{"tweets": "@JohaFuentes https://t.co/5SmQABeWKO Quiero precisar que yo no apoyo a ningún candidato político en estas elecciones. El video que circula fue un saludo de ánimo que me pidieron, pero nada más. Lo verdaderamente importante de estar al volante es sentir que todo está bajo control. #VolvoXC90 #JugadaSegura @VolvoCarCo https://t.co/mcTV4Bt53d Con la mayor responsabilidad para enfrentar a @PSG_inside  👊 👊 https://t.co/lNVDTpPHiU https://t.co/lGVV9xQJ2S - @ChampionsLeague, here we go 👊🏼 https://t.co/5fN6IWAdQW 30 September 2009, my first goal in Champions League. Game: Porto vs Atlético de Madrid. 10 years ago //// Hace 10 años marqué mi primer gol en Champions,  en el partido de Porto vs Atlético de Madrid 😉 https://t.co/6lflDpDnIy It was not the result we expect. We must work to achieve better performance. https://t.co/v5vcDvTdgr 🔥G A M E   D A Y🔥 Go for it @GalatasaraySK 👊👊👊  https://t.co/BRWTO1SJR6 https://t.co/PkbDsoiIFH Por acá tembló.  Mi familia y mi esposa estamos bien. 👍 Espero, igualmente, que las personas afectadas en la zona del epicentro se encuentren bien. #Istanbul Vamos ante @YMSkulubu 👊👊👊 #GSvYMS  https://t.co/AxksP4AOsH https://t.co/TSle0EZ0Oe Tough game. We have to keep working for the next games in our house. /// Un partido muy disputado. 1 punto. A trabajar fuerte y pensar en los partidos en nuestra casa.  https://t.co/fzvwZGQllg ¡Vamos @galatasaraySK! // Let's go together !👊👊  https://t.co/3vF9HLLJX8 @ChampionsLeague   #UCL https://t.co/ZaiVOPCNMK 👍 https://t.co/HOOQGNJltY My pick for the FIFA Puskas Award is #JuanFernandoQuintero! Here we go @ChampionsLeague 👊👊👊 https://t.co/Gbvpo0xx7u Trabajo en equipo. Gracias a Dios por esta victoria...a seguir trabajando. Gracias a todos por el apoyo en 🇨🇴 😉  ///Great team work. Thank you God for this victory, we must keep working https://t.co/UVquM3iE2l Let's go together!  #GSvKSM 👊👊👊👊👊👊👊👊\n#Galatasaray https://t.co/stJQHLfNNH https://t.co/s1sspKxX5Y RT @Galatasaray: Lions are now together with El Tigre 🦁🐅\n\nGalatasaray #INSIDE presents:\n\n\"Radamel Falcao in Istanbul 📍\"\n\n💬 Watch now with E… @muroo_baskann @AS_Colombia @GalatasaraySK @ultrAslan 😂🤭 @_vlknylmz 😂👍 @mcoban_office I wish the best for the new couple! Love forever !🧡_🧡 No rest. Working hard. Fine-tuning shooting skills 🚀⚽️/// Trabajo fuerte y sin descanso. Afinando https://t.co/zkiIVUUdLl Felicitaciones @juanscabal y @RobertFarah_ 🇨🇴🇨🇴🇨🇴🇨🇴 Sigan haciendo historia. Que grandes !!! @AS_Monaco Ma famille et moi même nous vous sommes très reconnaissants pour  tout ce que nous avons vécu avec vous. Merci au peuple français et à la @Ligue1Conforama  , pour l'honneur de m'avoir permis de faire partie de votre famille durant ces années. Bonne continuation  @AS_Monaco @AS_Monaco N'ayez aucun doute, je serai un supporter de plus et quelque soit l'endroit où je me trouve,  je vous encouragerai comme un supporter. Merci beaucoup également à la Principauté, à ses habitants, autorités  et supporters de l'équipe. Je voudrais remercier toute la famille qui fait partie de l'AS Monaco @AS_Monaco pour toutes ces années  que nous avons pu partager, les employés du club, kinés,  photographes,  joueurs, équipe technique et dirigeants. https://t.co/vY32NQyXql Inolvidable. 👍👍 https://t.co/YcZKSNG9XN 🧡🧡💛💛❤️❤️❤️ Presentación nuevos jugadores  @GalatasaraySK  ------&gt; https://t.co/4YOgnHGCPq 🧡_💛 Thank you for this wonderful time. Days I’ll never forget. Now, let’s work hard. /// Gracias a todos los hinchas. Han sido días que jamás olvidaré. Ahora, a trabajar fuerte https://t.co/0HsEOnkIne Bisou mon crack. https://t.co/IqjNKu4OFO Good morning cimbombom family 🦁🐅🔥🔥🔥 https://t.co/EDexSgmdpL Thank you all for the amazing support and love. 🤜🤛 https://t.co/lE4dQIzLDG RT @ChampionsLeague: #ComeToGalatasaray\n\nHe came. El Tigre becomes a Lion! \n\n🐯 @FALCAO 🦁\n\n#UCL | @GalatasaraySK https://t.co/mK6U0F4qST Je tiens à remercier tout le monde au Club, les supporters ainsi que SAS le Prince Albert, pour le soutien et la confiance qui m’ont toujours été témoignés. Et je souhaite le meilleur pour l’avenir @AS_Monaco  Daghe Munegu 🇲🇨🇲🇨 Parmi les nombreux souvenirs que je garderai avec moi, resteront tous ces buts inscrits avec le maillot à diagonale et bien sûr, le trophée de Champion de France remporté au bout d’une saison extraordinaire. Il est temps pour moi de quitter l’AS Monaco. Un Club unique qui m’a apporté de très grandes joies, tant sur le plan sportif que personnel. https://t.co/g8ZHDG4MbS 🐯🦁👊 https://t.co/0x93pqQL3t @GalatasaraySK Admin Falcao sandım 😉 Ya se van a cumplir 20 años de mi primer gol como profesional. 🤪 /// My first goal as a professional with Lanceros - Fair Play. https://t.co/UOzOwXwfzD Mis condolencias y afecto a @LUISENRIQUE21 y su familia en este momento tan doloroso. Qedpd Xana. Que golazo acaba de hacer Aduriz. No te retires por favor. RT @macastellanosh: Hoy, hace exactamente 10 años, @FALCAO marcaba su primer gol en Europa con el @FCPorto frente al Paços Ferreira tras un… Felicitaciones por esta gran victoria. Todo el país está muy orgulloso del trabajo y la lucha que las llevó al triunfo. ¡Felicitaciones! 🥳😆😆 🇨🇴🇨🇴 https://t.co/d8tIZoRnwD RT @AS_Monaco_ES: Sabes que naciste en Santa Marta, pero te alegras por la capital de tu país 😀🙌🏻🇨🇴\n\n#FelizCumpleañosBogota, les desea el T… Preparación. Victoria en la copa Philipp Plein.  https://t.co/W3rgs4Hwf3 RT @AS_Monaco: 🔙📽️ Le but ⚽️ de @FALCAO qui donne la victoire aux Rouge &amp; Blanc face à la Sampdoria 👊\n\n🔴⚪️ #PhilippPleinCup 🏆 https://t.co/… Happy birthday @AS_Monaco https://t.co/KHRCkhJrVm 🤔 👨‍👧 https://t.co/W5MyTm1zXC Entrenamiento del día https://t.co/GtqX59k2Ze 👊👊👊 @osdaroma @alejovelbaq @Eganbernal @LeTour @NairoQuinCo @UranRigoberto Muy orgullosos de todos los colombianos en @LeTour 👍🏼👍🏼👍🏼👏🏼👏🏼👏🏼 Grande @Eganbernal felicitaciones!!! increibleeeeeeeee 🇨🇴 🇨🇴 🇨🇴 🇨🇴 @LeTour  👏🏼👏🏼👏🏼👏🏼👏🏼viva Colombia 🇨🇴 https://t.co/wOgTWBzgNa Muy orgullosos de tu trabajo @NairoQuinCo. Un gran día para ti. Un triunfo producto de la persistencia y tu tesón. Gracias por esta alegría para Colombia. 🇨🇴 https://t.co/ivkH6aXxzN No tenemos porque ser enemigos y podemos reconciliarnos.  Dios nos ayude en esta tarea. Todos somos una nación y nadie — ni lideres sociales, migrantes, niños y niñas — deberían sufrir en Colombia.   🇨🇴🇨🇴🇨🇴🇨🇴🇨🇴🇨🇴. https://t.co/AWQEzANU4X En este 20 de Julio celebramos pero también es un buen tiempo para pensar en nuestro país. Un día para dejar la polarización y los odios y quizás restaurar las relaciones con los que piensan diferente. Y de esta manera inicié mi trabajo de pre temporada. Gracias a @FCFSeleccionCol por el apoyo el día de ayer. // preseason training 🤛🏼🤛🏼 https://t.co/xN11tjk0dh Espero que todos los participantes del proyecto Play In Bogotá @FundFalcao  hayan aprendido y disfrutado y, por sobretodo, aprovechado esta oportunidad de compartir conocimiento y experiencias.  👍👍 https://t.co/cfjpbF9hDw Por acá en vivo https://t.co/NvIFb2czjJ https://t.co/qfjo6QXq81 Muchas gracias @Ludovic_Giuly  Estephane Ehrhart, Amin Hammami, Gaël Givet, Asociación Let’s Play, @UEFA_Foundation y @asmonaco por el esfuerzo y el entusiasmo en este proyecto Play In Bogotá @FundFalcao 👍👍👍👍  https://t.co/lxEbspISgJ RT @Ludovic_Giuly: Une fierté de pouvoir découvrir le pays et la fondation de notre capitaine @falcao et de représenter asmonaco avec Gaël… https://t.co/kZW9V0yKII https://t.co/ORvaCEXNHP Avanza la clínica para entrenadores en Bogotá parte del trabajo de @FundFalcao ⚽️⚽️⚽️⚽️ https://t.co/3B7iitbfKD RT @UEFAcom_es: 🤩 @FALCAO 🤩\n\n¿En qué año fue? 🧐\n\n#UEL | @FCPorto https://t.co/F9UfF24NIO Felicitaciones @FuerzaAereaCol https://t.co/Et9HNIv9Ut Momento inolvidable @juanscabal y @RobertFarah_ -  Felicitaciones por este gran triunfo.  Mi admiración. https://t.co/ur1oqbE6cq Muchas gracias // thank you @mo_canouan https://t.co/4fdZnjIeeS ¡Feliz cumpleaños! 🥳 @jamesdrodriguez  Bendiciones !!! https://t.co/nxrXP5yEQU 🎾 @juanscabal y @RobertFarah_ a la final del @Wimbledon ¡Felicitaciones! 🇨🇴🇨🇴🎾 Inmenso logro !!! https://t.co/gBFvuYta8s 🤣🤣🤣🤣 https://t.co/z1P5SQDbpL RT @verobrunati: Pasaron 5 años desde que mataron al Topo en Brasil. Lo recordamos, lo amamos, pero es el cumpleaños de mi hijo Agustin y c… RT @Ludovic_Giuly: Petit teaser en attendant le départ pour Bogota dans la fondation de @falcao avec tonton_stef11 @aminldn et Gaël Givet h… Un especial saludo de felicitación a la Fuerza Aérea Colombiana @FuerzaAereCol en estos 100 años protegiendo a la Nación. #100AñosProtegiendoLaNación #FAC100Años Desilusión por no seguir en competencia pero el único camino que nos queda es seguir luchando para lo que viene. https://t.co/Nv3KqZqh0f Saldremos al Arena Corinthians a dejarlo todo en la cancha. ¡Vamos @FCFSeleccionCol ! https://t.co/xmQhnfzuRq  #CopaAmerica #COLCHI https://t.co/rfUun5Kj16 Entrenamiento. 🤜🏼🤜🏼 https://t.co/v0MQBW6Uc8 Solidaridad y trabajo en equipo. Ahora a prepararnos para lo que  viene.  🇨🇴 🤛🏼🇨🇴 https://t.co/YWD8GcRGUR Estamos listos para el partido ante la @Albirroja\nConcentrados y con la mayor responsabilidad para afrontar este encuentro. Ya tendremos tiempo de pensar en el próximo rival. https://t.co/Z8iCWDymoM https://t.co/ZteffPlS4B Entrenamiento en el estadio Barradão. https://t.co/I29wd6o2vd ¡Mañana! @LoreleiTaron @MarcosWitt 🎤🎤🎤 https://t.co/Wj3HECpVng Entra porque entra 💥🧨🚀 https://t.co/Gqm9gnbE5S Lo buscamos por todas partes y llegó. https://t.co/oTOC5ZL9Pz Durante todo el partido buscamos la victoria. Pero no podíamos anotar. Gracias a Dios al final logramos llevarnos los tres puntos. Gran trabajo de equipo 💥🇨🇴🇨🇴🇨🇴https://t.co/RoSb5Jk8us Asumimos este partido ante @QFA con la mayor responsabilidad y humildad.  Con el apoyo de todos saldremos con la convicción para obtener un resultado positivo. 🇨🇴🇨🇴✨ https://t.co/2ddckT2vAh Feliz cumpleaños princesa 🎂🎉 te amo @loreleitaron 😍 https://t.co/zupExU0J6A Feliz día papi. https://t.co/MFzoqnkGsm -----&gt; RadaMEL 😅😅👍🏼 Hemos dado el primer paso. Tenemos que ir partido a  partido. Un gran trabajo de todo el equipo. Gran noche, gran atmosfera. Gracias por el apoyo.  🇨🇴🇨🇴🤜🏼https://t.co/6ZHskTh5Ql Hemos decidido vivir y jugar según la mentalidad de creer y luchar. ¡Vamos Colombia! https://t.co/4vPh9zL1n7 🇨🇴🇨🇴🇨🇴🇨🇴🇨🇴🇨🇴🇨🇴🇨🇴🇨🇴🤜🤜🤜 https://t.co/HeTc3Ddfws Seguimos trabajando fuerte. https://t.co/UONtTu8unb Llegamos a Salvador Bahía, Brasil. Trabajo de recuperación en gimnasio. https://t.co/fstl3sq2xG Seguimos creciendo y preparándonos para nuestro debut en la Copa América. Positivo balance y sólido trabajo de equipo. 📸 https://t.co/9zvyRHWLjo Sigue nuestra preparación para la @CopaAmerica .  Visitamos el estadio Monumental para @SeleccionPeru vs @FCFSeleccionCol  \n🇨🇴🇨🇴🇨🇴💥🤜🏼 https://t.co/AcKETpLDGn #PerúvsColombia https://t.co/I4RZaPHJAf Salimos hacia Lima para nuestro último partido preparatorio antes de iniciar nuestra participación en la @CopaAmerica  ✈️  🇨🇴 🇵🇪 Muchas gracias a todos por el apoyo 🇨🇴🇨🇴🇨🇴 y seguimos trabajando en nuestra preparación para la Copa América.  📸  https://t.co/ZJY7C0ATnr Seguimos con nuestra preparación para la @CopaAmerica . Recibimos a @fepafut https://t.co/eVQZxU5zKW https://t.co/3FFLiVChB8 Preparándonos para el partido de mañana y para encontrarnos con nuestra gente en El Campín https://t.co/3hIV7TXzqv Felicitaciones a todos los muchachos de la Sub 20 por esta clasificación. ¡Nunca dejar de luchar! Siempre creer. Podemos hacerlo. https://t.co/UpuE0TBQGw Mis nuevas armas. https://t.co/RtydnbVmOc Que lamentable noticia el fallecimiento de Jose Antonio. Mi más sentido pésame a sus familiares, amigos y quienes tuvimos la bendición de conocerlo. https://t.co/mObmR5VzQB Vamos a darlo todo por Colombia 🇨🇴.  https://t.co/Xjn0HdLlv2 @EuropaLeague I believe the star will be @hazardeden10 😉 ¡Feliz cumple @RiverPlate¡  y que sean muchos más. 🎉 https://t.co/AO3C2gMVjP Un mensaje a los hinchas del Mónaco. 🇪🇸 https://t.co/fPZPR7Ai9h   🇬🇧 https://t.co/j0ndoM1sgb  🇫🇷 https://t.co/GyK3eWd9yS Ligue 1 - 2018 - 2019 👍🏼 https://t.co/Hc4W0pdLKK Día de fútbol. @ogcnice  vs @AS_Monaco  https://t.co/xTySo0H5KF https://t.co/3Yjg7GvJWE Ayer, hace 8 años, Europa era azul y blanca https://t.co/avc5wVuIgF Hemos dado un gran paso pero aún no hemos terminado. Gran esfuerzo de todos. Felicitaciones a todo el equipo  🇲🇨  https://t.co/Kkxj7c90Hg Día de fútbol @AS_Monaco vs @AmiensSC  https://t.co/YNB4QtY6TX #ASMASC 🇲🇨 JOUR DE MATCH 🇲🇨 https://t.co/f1wkQi4c90 Vamos ante @nimesolympique #NOASM   🇲🇨 https://t.co/11MgqWbZXs https://t.co/AwKWo34VMj Día de fútbol: @AS_Monaco vs  @ASSEofficiel 👉  https://t.co/mVJ00s4MBP https://t.co/2GwmABDX9v Espero estés bien @IkerCasillas y tengas una muy buena recuperación.  ¡Un abrazo! Punto importante para seguir luchando.  https://t.co/y5uGXDIZeE Día de fútbol. 🇲🇨 JOUR DE MATCH 🇲🇨  https://t.co/XbUnzMn2Mc https://t.co/WtXX03nt96 Muy atentos a la situación en Venezuela 🇻🇪 https://t.co/Pm10XqfZ2v Felicitaciones 🙌🏼 @juanscabal y @RobertFarah_ Estamos orgullosos de ustedes !\n\n https://t.co/ksOGbmrNcC What a team ! https://t.co/EWw5DPvhnk Feliz cumpleaños @atleti  🎉🍾🥳 https://t.co/Um2V2nBiOq RT @AS_Monaco_ES: FAKE NEWS: El AS Monaco quiere aclarar que @FALCAO nunca consultó su teléfono móvil en el banquillo durante el partido co… Día de fútbol 💥 @AS_Monaco vs @PSG_espanol  👉 https://t.co/8blEGg2rcz https://t.co/dYqMhiKHNH A pesar de  las malas noticias, el odio y la violencia hoy es un día para recordar la 💥resurrección de Jesús💥 y lo que ello significa: \n\"Yo soy la resurrección y la vida. El que cree en mí vivirá aun después de haber muerto. Todo el que vive en mí y cree en mí jamás morirá\" https://t.co/9j2j5x4F7o Quiero expresar mis condolencias a toda la comunidad cristiana y a todas las víctimas de este atentado en Sri Lanka. Mis oraciones para todas las familias y deseo el fin de la violencia y el odio. I would like first of all to offer my sincere condolences to the victims' families in Sri Lanka. My prayer for all the Christian community and all the victims. I want the end of violence and hatred. No quiero perder el tiempo sin amar,\nNo quiero buscar razones para odiar 🎶 🎼 🎵 https://t.co/AXlDJ5Yqpy por @LoreleiTaron RT @ATP_Tour: Spotted 👀\n\nLooks like @cesc4official &amp; @FALCAO are @RafaelNadal fans as well 😏\n \n📽️: @TennisTV https://t.co/4ibVCB2Xdp Quelle immense douleur en voyant ces images de Notre Dame. Une grande perte pour le mode entier. Tout mon soutien aux Parisiens et à toute la France dans ce moment difficile. https://t.co/Wl7WCWABx7 Estamos contigo @sjovetic Esperemos volver a verte pronto en el terreno de juego. Un abrazo https://t.co/d8pKCMGfKx Hoy vamos ante @StadeDeReims 💥 #ASMSDR 👉🏼  https://t.co/kBiLHY2dfQ https://t.co/ZYPy1vGHTG RT @romeronoe8: @FALCAO nos ayudas con esto? https://t.co/4o0Zqrz6YZ Find out about my experiences in the @EuropaLeague and how I got the nickname 'El Tigre'. Check out the video and visit the @KiaMotorsWorldwide Home of Football for more great content https://t.co/70m393mD69 #ad Retorna @Ligue1Conforama. Vamos ante @SMCaen https://t.co/knlwd35Gvk Vamos por este nuevo reto ante @theKFA  👊 ✊ https://t.co/ww1kJvZ25O RT @mundial_river: ⌛ EFEMÉRIDES RM\n\n📆 Un 23 de marzo de 2008 , en Liniers , Vèlez 0 RIVER 2 ( @FALCAO y @Alexis_Sanchez ) , quizás el mejor… Jugamos con personalidad y criterio a la hora de tener el balón. Partido ante Japón en su casa ... estamos contentos y es un buen resultado. 🇯🇵 🇨🇴 https://t.co/w38G2tYKst Iniciamos una nueva etapa ante @jfa_en 👊 ✊ https://t.co/HBeK1xAIlb https://t.co/qtXuz5AjMl Juan Fer: estamos contigo. Una pronta y completa recuperación. Estamos seguros que volverás pronto a las canchas. Ánimo. adelante. Un fuerte abrazo @juanferquinte10 https://t.co/LEenYeW3Mc David: Espero que todo esté bien y los exámenes médicos  den un parte de tranquilidad. Nuestras oraciones para ti y tu familia. @D_Ospina1 https://t.co/apTCHpUqVq Ya en Japón con mi compañero Cristian Borja iniciando trabajos. https://t.co/IOHqdMW6vR Mis mejores deseos para el partido de hoy @AS_Monaco  👊🏼👊🏼 https://t.co/LyV4Jijnfl 😆 https://t.co/XZ3PbmwSXn Espero estés bien @UranRigoberto. Te deseo una pronta recuperación. 💥⚽️ https://t.co/5z7d7nPls1 Se escapa la victoria. Pensar en el próximo partido. // we fail to keep the victory. To think about the next game. https://t.co/J7W8EGQlFT RT @AS_Monaco: Si @FALCAO joue contre les Girondins ce soir, ce sera son 1⃣0⃣0⃣e match en Ligue 1 où Il a déjà inscrit 6⃣1⃣ buts 🙌\n-----\n👉… 🇲🇨 Día de fútbol/// Jour de March /// 🇲🇨 👉🏼 https://t.co/iVyFxs5oXE @AS_Monaco vs @girondins https://t.co/j11kaQypDS RT @AS_Monaco: ⚽️ What A Goal #16 : Le magnifique coup franc 👟 de Juan Pablo Pino contre les Girondins qui lobe Ulrich Ramé ! #WAG https://… Comunicado a la opinión pública: https://t.co/LJSgfElGKZ Gracias @montanertwiter por compartir con todos tu profunda experiencia de fe. https://t.co/lfCf34f282 Logramos levantarnos de un resultado adverso y seguimos peleando. // we managed adversity and we will keep fighting 💥 https://t.co/YEct4QyPrH Día de fútbol 💥 @AS_Monaco_ES vs  @AngersSCO BoBuPoMaLON76 https://t.co/FDSixvhcSX Gracias @FannyLu me contaron de tu talento en las subastas. Gracia @andrescepeda . Muchas gracias a todos los que invirtieron en la niñez de Colombia 🇨🇴 Me llegan muy buenas noticias de la subasta. Quiero agradecerles a todos por su colaboración a la @FundFalcao. Mil gracias por apoyar la niñez de Colombia. Quiero expresar mi agradecimiento especial a @Alpina @Hublot y Pepsico. Muchas gracias. 👍🏼👍🏼👍🏼 https://t.co/WIJHksWCIQ Gracias @JeisonMurillo19 por apoyar @FundFalcao 👍🏼🖐 https://t.co/PJ3xeZxvDX Desde ya, muchas gracias a todos por la participación https://t.co/G1fch7QseF Merci @KMbappe 👍🏼👍🏼👍🏼 hoy: subasta de camisetas para apoyar la labor de @FundFalcao https://t.co/O14a0TnUXh Gracias maestro, libro Botero que subastaremos mañana ✍🏽 https://t.co/hbj8YTY7Wy Gracias @UranRigoberto por tu generosidad con @FundFalcao 👍🏼 https://t.co/rQtOig3NDG Jueves 28. Subasta  de la camiseta. ¡La camiseta! 🔔🔔( no la 🧢) https://t.co/a64NmGIXbL Para precisar y corregir y responder a las preguntas sobre el evento de @FundFalcao es el jueves 28 en el Club El Nogal. https://t.co/EQLw60qnhj @FdoCasillas @andresmarocco @patronbermudez @titopuccettic Fernando, que honor !!! Tremendo tatuaje. Muchas gracias y mis felicitaciones al artista que lo hizo posible. Un abrazo para ti y gracias por el apoyo. @KarenJoohanna Feliz cumple Juan. Dios te bendiga @dagober80060642 Gracias Gracias a ti @Cuadrado 😎😉 https://t.co/F8Gap7V02y Gracias @jamesdrodriguez por tu colaboración!!! 👍🏼👍🏼👍🏼¡Subasta! 🔔🔔nuevamente va el video 😉 https://t.co/Mq5KFKHPRB A todos les sale el video de James en negro ? @meisson3 @jamesdrodriguez Gracias. Ya lo vuelvo a subir Agradezco al maestro Fernando Botero por unirse a esta iniciativa de @FundFalcao .  Libro Botero, edición de lujo que lanzó en Nueva York la editorial Assouline. ¡Edición limitada hecha a mano y que incluye trabajos inéditos del maestro! https://t.co/AAc5XjseRr @Elunicoalbiazul @elmechu 👍🏼 Una invitación muy especial de @andrescepeda 🎶 https://t.co/HmXTdgwSSm Muy buen partido de todo el equipo. Un gran esfuerzo, con la  pelota jugamos bien y esta victoria nos da confianza para el futuro. \nIt was a great effort.\nWith the ball, we played a good match. With this victory, we are confident about the next games. https://t.co/oZpmCpPqqw Día de fútbol 💥@AS_Monaco_ES vs @OL 👉🏼. https://t.co/WhTC5tOIK0 https://t.co/tF1WTVr003 😎 https://t.co/LmA9uuaLEl RT @AS_Monaco_EN: On this day 2️⃣ years ago, @FALCAO netted a stunner against @ManCity in one of the @ChampionsLeague's greatest ever ties… ¡Todos invitados al Concierto Unidos por la Niñez con @andrescepeda ! Evento de responsabilidad social de @FundFalcao Una iniciativa que busca crear programas que beneficien niños, jóvenes y mujeres. 👍🏼😉 https://t.co/KD8nretTE0 Importante y merecida victoria. Seguimos progresando en nuestro juego. /// A deserve and important victory 👏🏼 https://t.co/rylhBAJbal Ante @FCNantes. Por un resultado positivo. 💥 https://t.co/hI08QZnIaO https://t.co/l96FUofxHS https://t.co/5ZsOJ8UQ3w https://t.co/bnu8LImw0K We are ready for the next game https://t.co/V5Ebp3goLg https://t.co/sVhTNAxNV1   Thank you Vadim for your contribution to the club during all these years! All my best wishes for your future activities. /// Gracias Vadim por tu contribución al club durante todos estos años. Mis mejores deseos para tus nuevos proyectos. Amor: @LoreleiTaron solo contigo puedo imaginar. \n\nLindo día para celebrar  con la persona que amas. ❤️\n\n «Ahora, pues, permanecen estas tres virtudes: la fe, la esperanza y el amor. Pero la más excelente de ellas es el amor.»\nhttps://t.co/jfLJCszzwx Se nos escapó la victoria. Gracias a Dios por este gol en mi cumple. Seguir trabajando fuerte // we missed the chance to win. Thanks God for the goal in my birthday.  Keep working team 👊🏼 https://t.co/DUAccUiOnF Y nada como celebrar el cumple jugando fútbol 🥳https://t.co/AplENe4THG https://t.co/rtttG1g2t5 Muchas gracias por los mensajes.\nLos llevo en mi corazón. /// Than you all for the messages. I keep in my hearth  /// Merci beaucoup à tous. 👏🏼👍🏼 Thank you 🙏🏽 https://t.co/uY5D3Fljj1 Obrigado portistas, sempre no meo coraçao 👍🏼\n\nhttps://t.co/gvvq3JNfl7 Abrumador ese número de noticias sobre fallecimientos en Colombia y en otras partes. Mis condolencias a las familias. Mis condolencias y oración en estos momentos de dolor   @Flamengo .https://t.co/16ASWd1YJK Mi más profundas condolencias a la familia de Emiliano. Igualmente a sus amigos y conocidos. Mi oración por sus vidas. https://t.co/2qVVlHB6N9 Amigos venezolanos: No están solos. Estamos con ustedes y  los apoyamos. No se cansen de hacer el bien porque a su debido tiempo cosecharán, si no se dan por vencidos. Libertad para los venezolanos. Vamos Venezuela. Video vía \n@ebatista82 #VenezuelaLibre https://t.co/Ddfwqwpl5y Merecida victoria en casa. Gran Trabajo de equipo. / Deserved victory and great team work https://t.co/1QxGMnZ5qq Día de fútbol. https://t.co/fUTxZW1Xwt https://t.co/5UMIL2m7pd Día de fútbol. @AS_Monaco vs @DFCO_Officiel #DFCOASM  https://t.co/X1NrHkjYYO https://t.co/hXJoAr2wAV #NoDejenDeBuscar https://t.co/9ZjMkXWhHo En casa por la Coupe de France 👉🏼 https://t.co/tx7EoF4I79 https://t.co/ZWo3nT32iZ RT @INSColombia: Información importante sobre disponibilidad de sangre en Bogotá. https://t.co/G65KWjhCOV RT @Bogota: RT @IDCBIS por emergencia por explosión en Escuela General Santander convocamos a la ciudadanía a donar sangre. Banco Distrital… Rechazo total al atentado en la Escuela General Santander. Mi solidaridad y oraciones por la  @PoliciaColombia y sus familias. Igualmente en mi pensamiento y oraciones las víctimas y sus familias. Paz para Colombia. Día de clásico en Louis II.  👉🏼 https://t.co/8ZrrN80SjR  #ASMOGCN  \n@ogcnice vs @AS_Monaco https://t.co/XXJeOesqDL Día de fútbol. @OM_Officiel vs @AS_Monaco 💥 https://t.co/GhKZZfozz1 https://t.co/lmWYowWiiK ¡Felicitaciones @AS_Monaco!  Merecida clasificación a las semifinales de la Coupe de la Ligue.  Gran trabajo @Loic_Badiashile!!!  /// Congratulations As Monaco. We deserve to win and we are into the @CoupeLigueBKT semi-finals. Great Job Loic ! great ! https://t.co/assDuSfwUw Papi: es difícil encontrar palabras en este doloroso momento.  Me queda la alegría por los momentos tan intensamente vividos a tu lado. https://t.co/MVFTpqm153\n\n** Al final de este álbum la última foto que nos tomamos. Cae la tarde sobre el entramiento de Mónaco en esta tarde. Bellísimo.  🌅 https://t.co/XLj1Y7N8c5 Happy new year 2019 to all my friends.\n\nMay this year give us the opportunity to work hard in order to follow our dreams\nAs we celebrate the New Year, I wish everyone success and a fresh new start. \n I wish in 2019 we can follow the Jesus word for our lives.\n\nHappy New Year!🎈 Gracias a todos por el apoyo durante el año. Un abrazo a sus familias y que este año podamos conocer y practicar realmente las  enseñanzas de Jesús para nuestras vidas.\nFelicidades y feliz 2019. Que este nuevo año podamos trabajar fuerte para cumplir todos nuestros anhelos y objetivos. Que la bendición de Dios esté sobre Colombia. Que podamos superar la polarización y encontremos acuerdos sobre lo fundamental para la construcción de un mejor país. 🎊🎆🎈🎉 https://t.co/k5LN5Vu69w Navidad en Familia https://t.co/WkNBibq7wn Feliz navidad les desea la familia Garcia// merry Christmas// joyeux Noël. https://t.co/gaTUDWnyop De todo corazón les deseo que hoy estén juntos a sus familias. \nQue estas fechas podamos estar más unidos, amándonos en verdad. \n\nNo olvidemos el sentido de la navidad: La presencia de Jesús en nuestras vidas.\n\nFeliz navidad de parte de la Familia García Tarón. 🎄 https://t.co/R9VgavPkGx https://t.co/ZIKPXP9IAX Deja que tu juego hable por ti ⏩⏩⏩ @nikefootball #SiempreAlAtaque #Mercurial #Velocidad\n\nLet your game speak your words ⏩⏩⏩ @nikefootball #AlwaysForward #Mercurial #Speed Último partido del año. @AS_Monaco vs  @EAGuingamp   #ASMEAG https://t.co/q4NYdRXkUK https://t.co/gVDI9ta3wK Join me and experience the beautiful game. #PES2109Mobile is out now! Also, play #PES2019 on consoles for free with #PES2019LITE. On mobile and console, #FeelThePowerOfFootball.\n📱PES 2019 Mobile: https://t.co/zYJ2JyHlPh\n🎮PES 2019 Lite: https://t.co/tMTJUB11iq https://t.co/yfl3NciyLd 👌👋 https://t.co/4snvrbUtB8 Día de fútbol:  @OLvs  @AS_Monaco https://t.co/xleaEj77N6 RT @AlejandroSanz: El excelente reto #UnChallengePorVenezuela ha logrado que #ReymarPerdomo venezolana que se fue de su país por el hambre… Ya es Navidad 🎺🎄🎄🎄🎄🎄https://t.co/nGFaJvp3Vh Día de @ChampionsLeague https://t.co/otsIyj9ItN @gus_ober @CARPoficial Grande Gustavo!!!! CAMPEONES . ¡Felicitaciones @CARPoficial ! https://t.co/P6SAUIeRWc GooooooooooooooooooooooooooolVamos River!!!! Que orgullo @tripleCIbarguen. Estamos muy orgullosos de ti. Eres un ejemplo de disciplina, esfuerzo y superación de todo tipo de obstáculos. Felicitaciones y que vengan muchos más triunfos y reconocimientos. Bendiciones !!! https://t.co/cinZi9FFre ☺️ https://t.co/5EVMXl7m7v Batallamos de principio a fin. Gran esfuerzo de todo el equipo. /// we fight from beginning to end.  @AS_Monaco https://t.co/1u1CKbfD1z Felicitaciones a todas las jugadoras del @AHuilaFemenino. A su cuerpo técnico y sus directivas. ¡Campeonas 🎉 🥳 /// Congratulations Atlético Huila. The best women’s team in South America. https://t.co/kojXONKzqX Día de fútbol @AS_Monaco vs @MontpellierHSC  #ASMMHSC https://t.co/erCpc2ZW3K https://t.co/SSkaGRynwr I can only imagine 🎼 🎶 https://t.co/9etYOCS9OK @LoreleiTaron No fue el resultado que esperábamos.  Gracias al @Atleti por el homenaje y a toda la afición por el cariño en el Metropolitano.  https://t.co/60qPbaW9OV Día de @ChampionsLeague. https://t.co/zxlx796xA4 muchas gracias a todos por tanto cariño. 🤝 Por primera vez en el Wanda, gracias por el cariño de siempre. /// it was my first time in Wanda stadium, thank you for your kindness 👍🏼 https://t.co/AGOYPEvLAx Quiero agradecer a Jesús por permitirme anotar el gol de esta  noche ante Caen. // I would like to say thank you, Jesus, for tonight goal against Caen. https://t.co/d1KsJxDjl1 Ante @SMCaen https://t.co/gIfoqIx2Mi https://t.co/sCKQzmG1XI Igualmente una felicitación al @Cucutaoficial. 👍🏼 Felicitaciones @UnionMagdalena, el ciclón bananero vuelve. La brisa loca nuevamente.  Un abrazo a todo el equipo, sus directivos y todos los hinchas. Felicidades, Santa Marta. 🥳🍾🎉 . @AS_Monaco vs  @PSG_inside https://t.co/XWcNT8g2rJ https://t.co/ACwkBPQmNF Concentrados y listos para afrontar con la mayor responsabilidad el encuentro ante @ClubBrugge por @ChampionsLeague https://t.co/P7FkDpeo3S Vamos @AS_Monaco. Podemos. https://t.co/LtsjVFih8K ¡Día de fútbol! ¡Vamos @AS_Monaco! https://t.co/YQ7pWaZRgq https://t.co/30b15sK8dB 2 versión goles picándola. https://t.co/fdBPS73Ltm Se ve venir goles picando el balón II versión. 👍🏼 https://t.co/rjMkYIZF9y @JuanRestrepoC 👍🏼 Picando el balón por encima del guardameta. 😆 ¿faltaría alguno? https://t.co/CV8BlAq88h @Ambiente884 si crees - Jesús - 11:40. 😆 Un nuevo proyecto periodístico en Colombia : 👉🏼 @Agencia_API Genial @davidgarzonv que bueno que nos conozcan por el deporte y la música. Greetings to all my friends in Kenia !!!\n\nhttps://t.co/Tn5ETuD4Sg Retornando al campo de juego. 😁💥🤛🏼 /// Trainning again with my teammates. https://t.co/gq6C66ai0q RT @2010MisterChip: #OJOALDATO - River Plate es el PRIMER CLUB en TODA la historia de la Copa Libertadores que elimina al vigente campeón e… RT @Crespo: El Pity Martinez qué loco que está 🎵🎶🎵🎶🎵!!!@CARPoficial #CopaLibertadores 1-2!!! https://t.co/YaCHQ6YVXN Las granolas de Kellogg’s me encantan y tienen sabores saludables para diferentes día de la semana #CerealesKelloggs #Energíasiemprebuena 😁 https://t.co/apU78sqPXP My pray and thoughts are with the Srivaddhanaprabha family and \n@LCFC. My deepest condolences. // Mi oración y pensamientos con la familia Srivaddhanaprabha y @LCFC.  Mis condolencias en este momento tan dificil. https://t.co/OMoUlqtXFX Lo mejor para el partido de hoy. !Vamos Mónaco que se puede! 🇲🇨🇲🇨🇲🇨 // The bests for the game against @ClubBrugge.  @AsMonaco we can do it. https://t.co/4K1PqvLIQE La historia del dibujo de Mathias. https://t.co/qkLS86LTRb un abrazo para ti @LD31Oficial y para tu hijo. A mis hijas les encantan los #CerealesKelloggs. Mi preferido es #ChocoKrispis 😁... aunque sea un Tigre #Zucaritas #TigreTony #Energíasiemprebuena https://t.co/rBhLjRSy5W Día de fútbol. @RCSA vs @AS_Monaco ¡Vamos Mónaco! https://t.co/xTDQhxOj3r https://t.co/7WQMrZvUnE ¿Qué tal cereal Kellogg’s como snack? Rico, nutritivo y para cualquiera hora del día.  💪🏼⚡️#CerealesKelloggs #Energíasiemprebuena⚡️ https://t.co/0JiIPfIEYV oye @cucho1099 , felicitaciones por ese gran debut. Dios te bendiga. Guerreándola en @NYCTSubway 🚊  😂 https://t.co/Rh0hdD5MPW Un nuevo amistoso para afrontar con la mayor responsabilidad y con todas las ganas de aportar al equipo.  https://t.co/w62wh4Ggaq https://t.co/qohfhe4Vsa 😆💥 https://t.co/RaPG6EMhkS Mallorca ha sufrido unas graves inundaciones y necesitan ayuda. ¡El mar ya no es una barrera! Pueden ayudar a las víctimas a reconstruir sus vidas con una aportación voluntaria aquí. https://t.co/ZfWBgzpx56 🥰 https://t.co/FSW4X0zoBM 🥰 Dominique cantando 😍😍😍😍 https://t.co/fvuw0CHxE4 Es fantástico jugar ante nuestros hinchas. A donde quiera que  vayamos allí están dándonos su apoyo. Es importante seguir marcando y  dar el 100 por ciento por el equipo.  Gracias a Dios por esta victoria y  el gol 😁 https://t.co/oBh33mn1s4 Con toda la responsabilidad. @ussoccer_mnt  vs @FCFSeleccionCol  💥https://t.co/R5bW4UQmCD https://t.co/KJ8kb56Wqd Muchas gracias por estos años de trabajo, confianza y triunfos. Ha sido un honor haber trabajado bajo tu dirección. Exalto tu profesionalismo durante tu permanencia en el club y deseo lo mejor en los nuevos proyectos que vienen para ti.  @leonardojjardim Merci beaucoup pour ces années de travail, confiance et succès.  Cela a été un honneur de travailler sous ta direction. Je rends hommage à ton professionnalisme pendant toutes ces années au club et je te souhaite le meilleur dans les nouveaux projets qui s'offrent à toi. https://t.co/2gWMKhHf0N All my respect for your wonderful career. It was a pleasure to  share with you and I desire success in the new projects. Respect  captain. https://t.co/r5cMaiuyaX Doy gracias a Dios por prmitirme llegar a los 300 goles como profesional. Gracias a @CARPoficial @FCPorto @Atleti @ChelseaFC @ManUtd @AS_Monaco  @FCFSeleccionCol y Patriotas- @cdfairplay y todos sus hinchas.  ¡Gracias! https://t.co/2lvqPcnBDf y vienen muchos más. ⚽️⚽️⚽️ https://t.co/F48SfuSIIN A pesar de todas las cosas tenemos que seguir trabajando con ánimo. /// In spite of that we have to keep working hard. https://t.co/0IupKxZiNx 👊🏼 @AS_Monaco vs @staderennais https://t.co/3c8lOsfpqV https://t.co/DhKn9g0uPr Es inaceptable lo que está pasando con nuestros niños. Los niños deben ser cuidados y protegidos. Cristo José debe estar con sus padres. Nuestros niños deben estar por fuera de cualquier conflicto y no ser víctimas de ataques como pasó con Génesis. ¡@ChampionsLeague @AS_Monaco vs @BVB ! https://t.co/fHWM14DMiq 💥⚽️ #BVBASM https://t.co/CsHbkG6N6p Esta noche cueste lo que cueste...!!! https://t.co/oXuestOM8q Día de partido. @AS_Monaco vs @ASSEofficiel  https://t.co/332Fv4NjDx https://t.co/LaFL64T3L7 Día de fútbol. @AS_Monaco vs @AngersSCO  https://t.co/gn1dyVqsPg #ASMSCO 2⃣9⃣9⃣ ⚽️💥 https://t.co/wU4ygz3TJ4 RT @AS_Monaco: 🐯 El Tigre ! \n\n@FALCAO avec l'AS Monaco en Ligue 1 : \n🏟 80 matchs\n⚽ 53 buts https://t.co/udmNbG0QJa Día de fútbol @AS_Monaco vs @nimesolympique. https://t.co/kZwctHdeJ3 https://t.co/NtI6YgZsgQ - @AS_Monaco vs @Atleti : Intensidad, concentración, compromiso y respeto. #DagueMunegu. 🇲🇨👊🏼🇲🇨\n\nTonight’s game. Intensity, concentration, commitment and respect.  https://t.co/c3o5MWhhjE https://t.co/cOFBiQo5F9 La Champions 🎶 https://t.co/yk8pDaoaqM 🆚 @ToulouseFC 🇲🇨🇲🇨🇲🇨🇲🇨🇲🇨👊🏼 https://t.co/wXzzhOatmJ https://t.co/9m8KlYFT0c 📸 https://t.co/ZmYcemUSjR https://t.co/sj7EhVwBTz Un balance positivo para estos 10 días de concentración. Partido disputado e intenso. Muchas gracias a los miles de hinchas colombianos que nos apoyaron en estos dos encuentros en Estados Unidos. 🇨🇴🇨🇴 https://t.co/zwGMJLnmTy Último partido de nuestra gira por Estados Unidos. Ante  @Argentina, por un resultado positivo. ✊✊🇨🇴  https://t.co/TD7p5yINOJ https://t.co/8LtmAKcUTR Tuvimos la capacidad de remontar. Justo premio al esfuerzo y trabajo en equipo. Felicitaciones a todos y gracias a los hinchas que nos apoyaron 🇨🇴 🇨🇴  https://t.co/Wx9nlJeVdw Día de fútbol. Vamos por los nuevos objetivos y metas que vienen para nosotros. ⚽️💥 \n@FCFSeleccionCol  vs @FVF_Oficial https://t.co/tIu3DolHml https://t.co/lP44jHvbDr Nuestro agradecimiento por su profesionalismo y por todos estos  años de trabajo y entrega en pro del  fútbol colombiano. Gracias por  creer en nosotros. Gracias Pékerman. https://t.co/EnGpD0R0cX Fue un partido en el que merecíamos mucho más. No hay otro camino que seguir luchando. \nWe deserved more in the game. There is no way to keep fighting and working hard. https://t.co/T8GonBAZFL ⚽️ 💥 Día de fútbol ⚽️ 💥 @AS_Monaco @OM_Officiel . Intensidad, lucha y ojalá un día de buen fútbol. // Match day. Intensity, fight and we hope a good game. https://t.co/6AEIKxDpCa 👌🏻 https://t.co/78WCCPiOLq Feliz cumple 🎊🎈🎉 @D_Ospina1 . Que el señor te bendiga en este nuevo año de vida. Muchos éxitos !! https://t.co/xCAUwwWD66 Muy contento y honrado por volver a un lugar que siempre ha sido como mi casa @Atleti 🤜🙏 Nuestros rivales en @ChampionsLeague : @Atleti @BVB y @ClubBrugge 😉 https://t.co/6jpjBx92Jy No se nos dio el resultado que esperábamos. Ahora trabajando fuerte para afrontar el partido que viene y la responsabilidad que viene con la convocatoria.  https://t.co/hNnGFW4Lra Con ambición y deseo de salir por una victoria ante @girondins.  With ambition and desire for a victory. https://t.co/QwgqAa1NR9  #FCGBASM 🇲🇨🇲🇨 https://t.co/y7P6AmTNzL Volviendo a casa . Día de fútbol ante @losclive  /// Happy to be in home. Match day. https://t.co/4QYUzc1Eia Hoy cumple un añito nuestra princesita Annette. Gracias Dios por su vida que nos alegra todos los días. Te amamos Bebita hermosa. https://t.co/C6RSe9AjLY Buenas sensaciones para retornar al Louis II. El sábado partido ante \n@losclive.  https://t.co/LiYAI4EEXC Felicito al Fútbol Colombiano en sus 70 años.  Un buen momento parar mirar atrás y ver lo que hemos logrado y un día ideal para pensar para dónde vamos. Felicito a todos los que han trabajado por nuestro fútbol: Escuelas, jugadores, árbitros, dirigentes. 🎉🎉 Felicitaciones. https://t.co/ElnRx6vSmB RT @officialpes: Our new ambassador, Falcao showing off! 😍 #PES2019DEMO https://t.co/uwTpWMhzf2 Comenzó el festejo de Dominique. Gracias Dios por nuestra hija y permitirnos disfrutar de ella cada día. Te amamos princesa. https://t.co/kTDwoIPki5 Buen inicio. A seguir trabajando fuerte. 🇲🇨👊🏼🇲🇨  https://t.co/UK93fa5NCc Inicia un reto en @Ligue1Conforama . @AS_Monaco vs @FCNantes . Tiempo de nuevos objetivos y desafios para seguir escribiendo historia.👊🏼👊🏼👊🏼 //   It’s a new day and a new opportunity in Ligue 1. It’s a time for new aims and challenges. https://t.co/2tQ03kYno4 🇲🇨 🇲🇨🇲🇨 https://t.co/J2eYyp3Kmi 老虎皇帝 https://t.co/RKc8jS1B3x Muy honrado de aprender a escribir mi nombre en escritura china. ✍🏼 🇨🇳 https://t.co/nm7ZxN7Yn9 RT @AS_Monaco: Appuis et vivacité 👌\n\n@FALCAO \n\n#CHINA #TDC2018 https://t.co/IhIfrsIdfz Entrenando fuerte. Puesta a punto 💪🏽/// Training day. Working hard https://t.co/B1ulRgspxA Vas hacer falta tío. Te fuiste muy pronto, pero Dios lo permitió así. Gracias por todo. https://t.co/2Qn9zJDQVL RT @AS_Monaco: Pendant que ses coéquipiers arrivent sur la pelouse pour affronter Bochum, @FALCAO fait son retour au Centre d’entraînement… Felicitaciones @NairoQuinCo . ¡Que esfuerzo y que demostración la de hoy! @LeTour 🇨🇴 🇨🇴 https://t.co/CfkymBKhmR RT @ThrowbackUefa: Year - 2017. \n\nManchester City v Monaco. \n\nGoalscorer - Radamel Falcao. (@FALCAO) https://t.co/kZm5syqvmA Siempre el #20DeJulio #DiaDeLaIndependencia es un buen momento para recordar la necesidad de reconciliación entre todos los colombianos. 🇨🇴 🇨🇴 🇨🇴 https://t.co/S6pllPMN13 RT @Phil_Coutinho: Welcome to the #PESF Family, Radamel! Looking good!\nhttps://t.co/DuSJIF7Vkv @Phil_Coutinho 👋🏻😉 Pero justo vas cuando no estoy. Disfruta la ciudad https://t.co/KvsWgtdoFp Get your copy now: https://t.co/VQkFkClNPR https://t.co/ZPmF72v90R Happy to be part of the #PESFamily and join @Phil_Coutinho on the PES 2019 cover!\n\nGet your copy now: https://t.co/VQkFkClNPR /// Muy feliz de ser parte de #PESFamily y compartir con @Phil_Coutinho en la portada 2019 👊🏽🤜🏽 #LaFamilia @jbalvin gracias por todo fenómeno https://t.co/44IpV5lNkw Feliz cumpleaños amigo 🎉🎂 https://t.co/zwsRjVGAjU @jamesdrodriguez Gran encuentro con @jbalvin #OrgullosamenteColombianos https://t.co/2fgQn1F5qd RT @CHVL0: Siempre una inspiración para todos! @FALCAO GRACIAS POR TANTO!, https://t.co/QqR1FS00QI https://t.co/Fm4rCuvOY9 @CamiloG_ lulo. Saludos amigos ! 👍 @AbduMuanis ✈️ @JohanCRodriguez @DanielMillanS_ saludos a toda la gente en el Guaviare. Y feliz cumple @perezsalvi lo puedo imaginar. Que impresionante. Gracias por tanto cariño. @ComuTricolor gracias a ustedes por el apoyo. Un abrazo. RT @mafhernandez_a: @FALCAO Seguiremos soñando y teniendo fe! Sos un duro! Ahora Copa America y Qatar 2022 #eltigrenosponeasoñar https://t.… @et_ernite @_R_I_V_E_ abrazo ! @uzkenia gracias! @JDavidHidalgo tremendo archivo. Mejor que el mio. @panguanito uy que delicia. @Guille9026 yo @AC_Blancoblanco Gracias Alejandro ! @_09AMSR_ lo pude ver ahora. Un abrazo. Sepan ustedes que trato de leer sus mensajes pero muchas veces no tengo tiempo de responder. Un abrazo para todos. ✌🏼 @diegol1506 claro Diego. Espero todo mejore. Un abrazo. @anag_45 impresionante. @Marcelitta75 siempre leo pero no tengo mucho tiempo así que cuando pueda respondo. Saludos. @perfectpoppin a lot of respect. Great team Japan. RT @segunJuan: @FALCAO  https://t.co/wZ67F0dnLC @Nicholas_llanos gracias, un abrazo ! @JhonBallesteros gracias por tanto cariño. Un abrazo a toda la hinchada embajadora. @M_Zzappers gracias Matthew. Un saludo a todos los colombianos por allá. 👋 @jmotta06301 Saludos a Sofía y a todos los hinchas del Bucaramanga. @VanessaVonZed Saludos Vanessa! @LauRobles diría que patacón porque hace mucho no como ñame. @JavierMinniti shortstop @feIiprado descansando. @OficialEsteban saludos a Miledy ! @Kraesp 👍🌟 @NatyGiraldo7 sin duda. Ojalá pronto podamos celebrar el deporte sin noticias de violencia en Colombia. @LUMIPICU10 desde chiquito. Saludos a Madrid ! @Cavari924 gracias David por tomarse el tiempo de hacerla. Un abrazo. @olga_olagui7229 saludo para ti y a todos los colombianos fuera del país. Es impresionante tambien leer los mensajes de las personas desde los lugares más apartados de Colombia. ¡Gracias! Deseo lo mejor para sus comunidades y familias. 😄 @Mimevalencia saludos Luz. Un abrazo. @JUANCAORTIZ14 gracias Juan Camilo. Un abrazo. @rodrybalaa 😂😂😂😂 @marthaquiroga1 jaja genial. @juligarcia_06 gracias Juliana. Gracias por todo este tiempo de apoyo. RT @HctorPoca9: @FALCAO Hey tigre, te compartimos otro desde El Salvador. Admiramos tu magnífica carrera y tus ganas de luchar siempre.\n\nAu… @HctorPoca9 @NetoPoca10 que genial. Muchas gracias.  Gracias @NetoPoca10 @Camilourue @FndoGaviria @letour_de sí, impresionante. Deseo lo mejor para todos los colombianos que participan. @FndoGaviria @GettySport @quickstepteam ¡Felicidades por ese sueño cumplido! Y que vengan muchas más victorias. Gracias a ti César por mostrarnos que no hay límites en el servicio y el amor por los demás. https://t.co/ZfkFkvDlCw @DanyelGPhoto Gracias Daniel. Las guardaré. @marcelocataldo Marcelo: muchas gracias por tus palabras y apoyo. La esperanza siempre sigue viva. Sigamos trabajando por un mejor país. Aprovecho para agradecerte por la ayuda y la atención que recibimos ayer. Un fuerte abrazo. #Conectémonos. @NicolasC__ no enloquecer ! @Dairo_BT @BuhoCruz saludos a toda las personas en El Copey y a todos los amigos de la iglesia. ¡Gracias por sus oraciones! @zaynselfie más que suficiente! @ArmandoArizaB amén. 🤜 RT @Nayiluna_: Yo nunca hago esto pero sería muy chévere que se tomaran 2 minutos de sus vidas para ver este vídeo o al menos solo darle rt… RT @BuhoCruz: @FALCAO Acá una más https://t.co/CdBjrIS3GU @BuhoCruz Gracias Andrés. @dicastilla por favor salir a comprarlo. @diegoprit un poco cejón. jaja. ¡La espera terminó!. Saludos Diego. RT @Karenjasc0308: @FALCAO Mi negro es el mejor @Fulaleo ❤❤❤❤ https://t.co/OkYiJqUOBO @Karenjasc0308 @Fulaleo wow. Tremendo. Muchas gracias. @pornrxgui hoy puede ser un buen día. 😆 @narrybelle gracias Alina. Un fuerte abrazo para ti y a toda la gente en Puerto Rico. @AminaMezouar1 respect. Greetings to Algeria. Amazing players. 👍 @__JavierHerrera espero su posición en el campo de juego sea la de un 9.😆 @oeofymagui volveremos más fuertes. @cgirlads bien. Con la espina en el corazón. Pero bien. Un abrazo Camila. 👍 @KarenU75 Gracias Karen. Un abrazo. Es impresionante la cantidad de dibujos, pinturas, arte digital y música que muchas personas han hecho durante el último mes. Muchas gracias a todos. Me siento muy honrado. @2010MasterChip no lo creo. Solo era mirar la fecha del trino, ¿no? @GuillermoT08 Guillermo, muchas gracias por tu arte. Que gran talento. @AnaCaic90008856 Gracia Ana, un saludo para ti. @Camila70775579 @jamesdrodriguez @Cuadrado gracias Camila. 🌟 Lo dimos todo por estos colores y por todos los colombianos. Volveremos más fuertes... no tengan dudas. 🤛🏼✊🏼👊🏽  https://t.co/tnAiPZNS5U ¡El mundial fue una experiencia increíble! https://t.co/JYR5rRlQPQ gracias Jesús porque pude vivir esta experiencia. 😀😊 ❤️ @LoreleiTaron https://t.co/6up2FeSMmE Con el corazón roto pero orgulloso de todo lo que hicimos en este mundial. Orgulloso de este equipo, dejamos todo en la cancha por Colombia. Gracias a ustedes por el apoyo. \nOrgulloso de ser colombiano. 🇨🇴 https://t.co/NkFoJ2Jz9y Unidos podemos lograr lo que siempre hemos soñado o imaginado. ¡Vamos Colombia! ¡Vamos por este partido! @FCFSeleccionCol 🇨🇴 vs @England 🏴󠁧󠁢󠁥󠁮󠁧󠁿 🙏🙏🙏 https://t.co/zCSLWvFIe1 https://t.co/et10Enp2bn https://t.co/1Cjt9SsQql La fe mueve montañas ⛰/ Faith can move mountains 🇨🇴 Vamos a dejarlo todo en el campo de juego. 💥¡Vamos Colombia! 💥https://t.co/BpwJwl3woO https://t.co/YRKZP702oA Mi primer gol en un mundial. 🎉 https://t.co/Z6iu0kV6T4 Jesús le dijo: —¿No te dije que si creías ibas a ver la grandeza de Dios? /// Jesus responded, Didn’t I tell you that you would see God’s glory if you believe?   💪🏽💪🏽 https://t.co/Vtd4MszCbW Podemos hacerlo. Que el aliento de millones de colombianos llegue hasta el estadio. ¡Vamos Colombia! ¡Vamos que se puede! #ConLaFeIntacta #Col https://t.co/h7EEgT3FFn Triste por la derrota pero con la fe que podemos convertir esta  adversidad en una oportunidad que nos permita obtener los resultados que todos queremos.  https://t.co/gqVPXyftYL Finalmente el día llegó. Dios puede lograr mucho más de lo que podemos pedir o incluso imaginar. ¡Vamos Colombia!  https://t.co/9MOTZE7Y3C Finally, the day has arrived. God can do anything, you know—far more than you could ever imagine or guess or request in your wildest dreams https://t.co/Y2WqX70r5C Hoy es el día de la Reina de nuestro hogar, la… https://t.co/FP0pTecSO4 Concentrados preparando el partido ante Japón 🇨🇴🇯🇵 https://t.co/CB1ltQ6XSU Gracias por el homenaje @PonyMalta_  https://t.co/4f4cEj17Y1 #ActitudDeCampeones 👍 Muchas gracias a todos por sus mensajes en estos 1602 días que han pasado. https://t.co/tWDhpae2dv🤝 Vamos a defender esta camiseta con el 💯 % de nuestras fuerzas,  energías y capacidad. 🇨🇴 // we are going to fight for this colors with  all our energy, strength and ability. https://t.co/DgCSg44Rd3 Kazán nos espera. A la conquista de Rusia 🇷🇺.👊🏽👊🏽 🇨🇴 Jesús al control 🙏🏽/// In our way to Kazan.Conquest Russia, we can do it,  Jesus in control 🙏🏽 https://t.co/A5csSMtFjk Persigue tus sueños / Pursue your dreams. Thanks to https://t.co/OGj8rmIDE3 #shadowmanvan and @samysass for all the help. https://t.co/D9HL5rFlMb RT @montanertwiter: “Ninguna arma forjada contra ti prosperará, y condenarás toda lengua que se levante contra ti en juicio. Ésta es la her… Entrenar, entrenar, entrenar. 🤜💥 https://t.co/mPHEwl7uvn - @frankfabra: Te acompañamos, estamos contigo.  Espero que pronto puedas volver a las canchas y tengas una buena recuperación. Fe y esperanza para lo que viene. /// In this moment we are with you. We wish you a successful recovery. Faith and hope for what is coming https://t.co/m93PZJ4gGf Se vale soñar. https://t.co/DLL4KkaRok \n@nikefootball RT @AS_Monaco: RETWEETEZ si ce but est votre #TopBut de la saison ! \n\n⚽ @FALCAO \n🗓 8e finale #CDL \n🏟️ Louis-II\n#⃣ #ASMSMC https://t.co/zoaw… A mi esposa @LoreleiTaron y a las niñas por estar allí en los momentos difíciles. Gracias por ayudarme con paciencia y por sostenerme en los momentos duros. A propósito de la lista final:  Finalmente llegó el día. Se aplazó durante un tiempo el sueño de toda una vida. En los últimos años trabajé especialmente para poder estar presente en Rusia. Agradezco a Dios por su fidelidad y por sostenerme durante todo este tiempo. RT @FCFSeleccionCol: Los 23 elegidos presentan a sus compañeros. 🇨🇴⚽️🏆 https://t.co/QdkAfYTfwA Colombia jugó con una gran decisión, fuimos creciendo durante el partido.  https://t.co/zdoHHyKr7o Amistoso ante @EFA previo @fifaworldcup_es. https://t.co/79AO6OJrjc 🤜💥⚽️ https://t.co/SsJMOKqGYH Mis respuestas a los amigos de la prensa: https://t.co/HJtKfwNl8K Un halcón, un Jacuzzi y @JackWhitehall…‘Falcao de Toilette’ (?) 😆#TrainningDays,  ¡Disponible ahora!: https://t.co/cCF0HzocAs\n\nFalcons, hot-tubs, and @JackWhitehall My new advert for ‘Falcao de Toilette’.\n#TrainingDays, only on @youtube. Out now: https://t.co/cCF0HzocAs Muchas gracias Colombia. Vamos a defender esta bandera con toda nuestra fuerza. 🇨🇴 https://t.co/CtxyDKOEl5 Canta sobre mi 🎶  @LoreleiTaron junto a @KikePavon  https://t.co/JK2mpAkZOS 🎶🎶 Esta mañana en el primer entrenamiento con la Selección en El Campín  https://t.co/vy5N7cgsy8 https://t.co/v970Ceu26h Nos sentimos honrados y asumiremos con profesionalismo el llevar la bandera de Colombia a Rusia. 🇨🇴  🇷🇺 Felicito a @RobertFarah_  y @juanscabal primeros colombianos en la historia en ganar un torneo mundial de maestros: Campeones del Masters 1000 de Roma. Impresionante. Muchas felicitaciones. https://t.co/NzJzFuuyJ0 El último partido del campeonato ante @estac_officiel https://t.co/lM5W3ExtAm https://t.co/lmlT1iQHxF Preparando el último partido del campeonato.  https://t.co/ZjrCeHAeh6 Un capítulo más de la @LaCasaDePapelTV antes de dormir.. Qué tendrá planeado el profesor para hoy. 😬 #netflix https://t.co/dmz5P0ThHd Buscan donantes de plaquetas para la hija de Sherman Cárdenas via @vanguardiacom https://t.co/DdVy9SPOQJ 💕 🌹https://t.co/90rMLmDdg6 A todas las mamás: ¡Feliz día de la madre!. Gracias por convertir este verso en realidad. https://t.co/0NbxX50gLC Una gran victoria anoche. Gran trabajo de equipo https://t.co/JIAVM1h5sd Hoy vamos ante @ASSEofficiel. Alistándonos para el partido.  https://t.co/N3tbbT9gWT https://t.co/ICAmEE8QCr Entrenamiento previo al partido ante Saint Etienne. 💪🏽 https://t.co/RIcGlvNBXl Sí. Entró. 😆 https://t.co/uWhKGwrq5n A ver: ¿El balón entra o no?  💥⚽️ https://t.co/OTZzKAwsBk Mucho ánimo @marianapajon y te deseo lo mejor en este proceso de recuperación. ¡Vamos @AS_Monaco por una victoria. 🇲🇨💥🇲🇨 A propósito de los 100 partidos jugados con Mónaco. Así es mi estadística en equipos Europeos donde he jugado 90 partidos o más.  https://t.co/pMh1ircgrv  📊 https://t.co/1pflPz7ohb El tiempo te enseña cosas, y aceptar que te falta algo es una de ellas. Así es la vida, con la frente en alto acepto que #MeFaltaSabor. Con la leyenda del automovilismo @massafelipe19 🤝  https://t.co/nTz7wytlRX Al final del partido ante Amiens me pegaron un rodillazo y tengo un hematoma en el muslo derecho. Nada de qué preocuparse. https://t.co/esTUO4mydV Es un momento difícil. Por más que intento, sigo sin encontrar el sabor que quiero. Es duro aceptar que #MeFaltaSabor. Muy contento de llegar a los 100 partidos con esta camiseta //. Je suis très content d'avoir joué 100 matchs avec ce maillot /// I am so happy to reach 100 games with Monaco.  https://t.co/R7FpgvaMbg Una visita especial @Cuadrado 😉 https://t.co/9oapTZ1HNP Si te caes más de mil veces, \nsiempre te hace más fuerte 🎶🎶  A cantar @LoreleiTaron y @EvanCraft      🗣️🎙️🕺💃 https://t.co/ntR4Q8pIwe Vamos por nuestro objetivo ante @AmiensSC 💥https://t.co/rNCCc7dEqR #ASMASC https://t.co/ZK3Prcsan4 Preparando el partido ante Amiens 💪🏽🤛🏼 https://t.co/jH7Q4ADxCi Gracias por los mensajes. Estoy bien. En el transcurso de la semana me uniré al grupo para preparar el partido del fin de semana ante Amiens. 👍 //\nThank you for the messages. I’m fine. During the next days I will join the the group in order to prepare the game against Amiens. RT @AS_Monaco: 🚨 Des nouvelles rassurantes de @FALCAO : les examens complémentaires sont en faveur d'une simple contracture. La reprise est… Vamos por nuestros objetivos.  https://t.co/dCXAioDXDR Hoy ante \n@EAGuingamp 🇲🇨 https://t.co/xQ9wDZdrke Muy orgulloso con la participación  de @juanscabal y @RobertFarah_ en el @ROLEXMCMASTERS.\nMis mejores deseos para lo que viene 🇨🇴🇨🇴🇨🇴🇨🇴🇨🇴🇨🇴🇨🇴🎾 Una visita muy especial en el entrenamiento de hoy. Gracias @juanscabal y @RobertFarah_ por lo que vienen haciendo por el tenis colombiano. Felicitaciones por  los triunfos que han obtenido y por los que vienen. 🇲🇨 🎾 🇨🇴 https://t.co/bV6QymvDXZ Clásico del fútbol francés. Hoy vamos por nuestros objetivos ante \n@PSG_inside. Allez @AS_Monaco !!!! 🇲🇨🇲🇨💪🗼  👉 https://t.co/Ek0r7bl4pT https://t.co/b7hWqikWTE #soymercurial https://t.co/xEwSmRRwGr 😅😅😅 A veces no entran... https://t.co/foYtfQejo8 leyéndolos... ¿están seguros? En unos  minutos la respuesta. 😅 A ver si alguien se acuerda de esta jugada. #GoloFalloChallenge Los leoooo 🤔 https://t.co/93I02xQcan Muy contento por la victoria. Seguimos trabajando fuerte por nuestros objetivos.  🤜🏽https://t.co/m1J4roeEGA Hoy en nuestra casa antes  @FCNantes.  https://t.co/0tnH5xiMor https://t.co/296kYgGsNa 🤛🤛🤛 https://t.co/b5iOifJLrG Empate que nos permite mantener la ventaja en la tabla. Ahora a recuperarnos para el partido ante Nantes. https://t.co/BRzYetnRWh Día de fútbol: Vamos por nuestro objetivo en Ligue 1 ante @staderennais https://t.co/J8Wk1mC3mG 🇲🇨🇲🇨 https://t.co/2nP6ygi7v0 3 de abril de 2011. Campeones con @FCPorto 😆 https://t.co/mBFzYEzVqM Gracias Marcos por compartir tu historia. Un abrazo para tu hijo y tu familia.  https://t.co/YfJGRwElAi No fue el resultado que anhelábamos pero seguiremos trabajando fuerte en busca de nuestro objetivo en el campeonato.  https://t.co/SD3w99Wm2F Porque ÉL vive no tenemos miedo del mañana. https://t.co/EdJ7ZLO3nw @LoreleiTaron ❤️ A través de Jesús tenemos esperanza, él resucitó. Si declaras que Jesús es Señor y crees en tu corazón que Dios lo levantó de los muertos, serás salvo / Jesus is our hope. He did it all for you. If you confess with your mouth that Jesus is Lord and believe(...) you will be saved https://t.co/g8EM3FD66q Una bendición tener la oportunidad de jugar una final más. ¡ Vamos @AS_Monaco! 🇲🇨 https://t.co/Y6Aj7mrEDZ https://t.co/tJ9rRtcj6b RT @AS_Monaco: ✍ Gagnez la caricature dédicacée de @FALCAO !!! #WeAreReady\n\n🖼➡ https://t.co/zqGVkPtPVz https://t.co/q2lXISS7eZ @daveflanagan @AS_Monaco thank you Dave 👍 Estamos listos para la final de la @CoupedelaLigue Hoy estuvimos en el estadio, reconociendo el terreno.  #WeAreReady 🔥 🔴⚪ @AS_Monaco  https://t.co/p72pVqvtN5 @Tim_Cahill @shanghaishenhua it was a really honor for me. A hug and blessings for the whole family.👍 Seguimos con nuestra preparación. A pocas horas de @FCFSeleccionCol vs @Socceroos. 💥🇨🇴💥 https://t.co/m6xapykbw0 https://t.co/l2vYHcBCYk Vamos paso a paso 🇨🇴 https://t.co/NDA5i0hD49 Una noche muy especial y un agradecimiento a Dios por su fidelidad. 👌🏻🇨🇴 https://t.co/ELKkmMGDMq Estamos en una etapa de preparación y debemos aprovechar al máximo este partido ante @FFF  /// we are in stage of preparation. We must take the best of this game. https://t.co/WKoZsvFlQZ https://t.co/whXMRmuF3G 🇫🇷 🤝🇨🇴 https://t.co/CiE6EYQOIu Entrenamiento ayer y preparándonos para el de hoy. 🇨🇴 🇫🇷 // Yesterday training and we are ready for today 🤛🤜 https://t.co/YWFwaz4plM Muy emocionado y asumiendo con la mayor responsabilidad el llamado a la Selección Colombia. 🇨🇴 https://t.co/K7BFgo4YIC Un partido muy dificil el de anoche. Una muy buena victoria de todo el equipo y muy buenas sensaciones en mi retorno a las canchas. // It wasn't a easy game tonight. A good team work and many good feelings in the pitch. https://t.co/priKUv7K47 Día de fútbol !!! Vamos ante @LOSC_ES \nhttps://t.co/xyP3ApJ51K https://t.co/KkndVn9K9q Mucha fuerza amigo, espero verte pronto en las canchas nuevamente. https://t.co/qow55u1XLo RT @EuropaLeague: ON THIS DAY: @FALCAO scored as Atlético beat Beşiktaş 3-0 in their round of 16 decider 🐅💪\n\nFavourite ever @Atleti striker… Este verso aplica para la actual situación de Colombia. También para todo en la vida diaria : Aplica para la casa, el trabajo, las relaciones, la familia, los amigos, las parejas, los padres, los hijos, los equipos. ¡Para todo! 👍 https://t.co/OkxZEzLSdB ¡Vamos @CARPoficial por esa #SupercopaArgentina 🏆 ¡Vamos ! que se puede. https://t.co/vsZOdXjvCQ Joyeux anniversaire à S.A.S. le Prince Albert II de Monaco 🇲🇨 https://t.co/gnIjZOVDUa Centro, palomita  y gol 💥💥 De esta selección ¿cuál es tu preferido?🏅 https://t.co/dKezFFZ7wE Midnight in Paris 🗼 https://t.co/1zRQsURfgt @JosueMoralesR No es verdad y aprovecho para aclarar, que no apoyo ningún grupo político, ni ningún candidato, ni ninguna consulta.  Lo que sí anhelo es que seamos responsables con nuestro voto.  Quiero invitar a los colombianos a ejercer libremente su derecho al voto. ¡Gran victoria @AS_Monaco ! Un buen juego donde mostramos contundencia y eficacia. #DagheMunegu 🇲🇨🇲🇨👏👏👏👏 Hoy vamos ante  @RCSA. ¡Vamos! @AS_Monaco 🇲🇨 https://t.co/OXWxDcPvQp https://t.co/HWvMryIIFZ RT @AS_Monaco: 😀 Quand tu es de retour dans le groupe ! #JournéeInternationaleDuGif https://t.co/VsRPxa6uct Sin palabras  al ver la magnitud y la importancia global del maestro Botero. Tuve el honor de visitar ayer la exposición Botero, un diálogo  con Picasso y pude observar el increíble aporte que su obra ha hecho a la humanidad. Es impresionante. https://t.co/eJFjgXfEWU De vuelta a la cancha: https://t.co/OXWxDcPvQp Alistando todo para el partido de mañana ante @RCSA .   #RCSAASM https://t.co/QdtuOYJ7hk A  day for pay tribute to all the women’s close to me.  Likewise, to all the women’s around the world my respect, admiration and  blessings in the international Women’s Day. 💐https://t.co/jf1N7IcJca RT @sebastianborras: Estoy buscando a Daisy, 11 años, cocker blanca y marron, se perdio en Devoto. Favor RT. https://t.co/j4wNqfJ7yU Con la mirada puesta en lo que viene. // Looking ahead https://t.co/yH2MYuStmM Que triste la noticia del fallecimiento de Davide Astori. Un abrazo a su familia, amigos, compañeros de equipo y @acffiorentina https://t.co/Nxr3slvQkE @manueljosechave @Nestorgalvis4 ahora toca tatuaje. #NoMentiras. Saludos. Puesta a punto ✊🏼👊🏽 https://t.co/dQh5i1KPZm @falozanom @Nestorgalvis4 le debe llegar la otra semana. Muchas gracias a todos los que ayudaron a encontrar a @Nestorgalvis4. Igualmente a su hermano Juan. Muy orgulloso de ver esas fotos mias en un camión que viaja por Estados Unidos. 🚚🚚🚚🐯 https://t.co/SVVoceiPOY With @LoreleiTaron In #laureus18 celebrating achievements with amazing sportspeople. 🙂 https://t.co/DzRnyrqM3X @LaureusSport @AS_Monaco thank you for the invitation. It was a really good time. 👍 Entrenando bajo la nieve que nos visitó hoy en Mónaco 🇲🇨 ❄️ 🌨 /https://t.co/wjxzpTbKep RT @LaLiga: El fútbol ni se ve, ni se escucha... ¡SE SIENTE! 🙏🇨🇴\n\nConoce la increíble historia de José Richard, el chico sordociego colombi… Ahora anda por Manhattan. Si lo ven, me lo saludan con un fuerte abrazo. Foto vía @dmolinares75 😄 https://t.co/DcgrpmoidY Allez @AS_Monaco!!! 🇲🇨🇲🇨🇲🇨🇲🇨 Sorprendente. Ayúdenme a ubicar a este hincha.  Lo único que sé es que fue visto en alguna carretera de New Jersey, USA. \nhttps://t.co/klf9jLZkYA Gracias @Pateto71 por grabarlo. Billy Graham ya en la presencia del Señor. Gracias por sus mensajes  y enseñanzas. https://t.co/uFvYretfza https://t.co/1e7Ct3Y4kl @Pata_Leo gracias por esa acuarela y muchas gracias por los buenos deseos. Muy honrado de que te tomes el tiempo de dibujarme. Gracias. 👍 A year ago ...https://t.co/fzdzkoAWqk 💥☝️✌️🇲🇨 Una tarde de domingo en la nieve 🌨 ⛄️ ❄️ con las chicas  https://t.co/5Y1tPPmhF8 Feliz cumpleaños hermosa de papi. 3 años ya desde que llegaste a nuestras vidas para alegrarnos… https://t.co/s0xYJeYOFm Un recuerdo del partido ante @DFCO_Officiel. Vamos Mónaco !!! 🇲🇨 https://t.co/yeFYwE9TR8 Un 16 de febrero hicimos una gran remontada con el @Atleti. Ese día pude asistir y marcar dos goles. 💥 https://t.co/fds8sZWHEG Te amaría por mil años más, amarte por mil años más  🎶🎤 \n  @LoreleiTaron  https://t.co/R4X2x7zozF ⚽️💥 https://t.co/465TcE5gc0 Muchas gracias @LaLiga por el mensaje. https://t.co/oyjN47kgOV Merci le gars, la victoire de hier soir c’est le mieux cadeau de anniversaire. https://t.co/TKa3uthkhh Muito obrigado @FCPorto por lembrar meo aniversario. Os levo no meo coraçao https://t.co/QhRa0tyi4K Muchas gracias a la familia riverplatense por este lindo detalle en mi cumpleaños. https://t.co/VWTN0tpieQ Gran trabajo de equipo esta noche. Un merecido y justo resultado que nos permite seguir sumando. // Great team work today. We deserve to win.  🇲🇨✌️☝️ https://t.co/jxy85dtuZr @AS_Monaco_ES Lo mejor para hoy ! Gracias 🙏🏽 /// thank you /// merci 🎁🎂🍰 https://t.co/VFyf1w1Tb2 Un 6 de febrero de 2005 fuimos campeones suramericanos.  🏅 https://t.co/amyWcjCQtZ #BORNMERCURIAL @nikefootball https://t.co/ZEplqP7OTO Gran victoria de la de anoche. Luchamos ante un resultado adverso muy dificil, le dimos vuelta y lo logramos. Frente a mi salida del campo, gracias a Dios no es  nada grave y estoy a la espera de los estudios médicos. https://t.co/hcIp0dBVeW Una  nueva oportunidad. Hoy vamos ante @OL #ASMOL 💥  https://t.co/oKqUUR85un https://t.co/BIDCz168Ik Hoy en la conferencia de prensa previa al partido ante @OL https://t.co/gmkf7Xe1vL #ASMOL Una buena victoria y vamos por la final. /// Great victory, we will go for the coup 🏆 https://t.co/cHVpQLKRyr @clausxe @MontpellierHSC  https://t.co/2vmL6x6cFl Camino al estadio para el partido ante @MontpellierHSC https://t.co/3hGpteKlR3 https://t.co/IBGzvQkoTc 😄 https://t.co/4FD9PE4mWT Ahora a prepararnos para lo que viene: @MontpellierHSC y @OL 💥https://t.co/m52gbz93i5 Alistándonos para el partido ante \n@OM_Officiel  🤜🤛 / Ready for the game tonight 💥 https://t.co/PLTAe7QTXP #OMASM https://t.co/mdcJHOLZYp @JorgeBenavides0 👍 nada mal. @Exly buena esa ! A ver si estas las saben...  antes del partido ante Marsella. 😉https://t.co/2cMDvoC5Vy Gracias  @juanscabal y @RobertFarah_ Gran participación en el @AustralianOpen  #AusOpen 🇨🇴🎾 ¡Que gran demostración @juanscabal y @RobertFarah_! Felicitaciones y lo mejor para la final @AustralianOpen  #AusOpen 🇨🇴🎾 ¡Día de fútbol! Hoy vamos ante @OL por @coupedefrance. 🇲🇨💥 👉 https://t.co/Ma9GzyADZ8 https://t.co/dgyFxMTaLK Una merecida victoria // a well deserved victory https://t.co/XZpeE8Ina1 Y hoy 21 de enero de 2018 tenemos partido ante @FCMetz 😉  https://t.co/zYI4pIaoEY https://t.co/aPnct6hS4b @KarenU75 Saludos ! El 21 de ENERO parece ser un día de goles. ¡Momento! hoy es 21 de enero. 😄 https://t.co/s0piog6K6Z @Alberto87OK feliz cumple Ciro 🎉 Dios te bendiga. 21 de enero de 2012. Un triplete.  Hat Trick ✌️☝️ via: @LaLigaEN https://t.co/FSGiGfhaoJ @espectacular010 lo logró ! 👍 crack. Saludos. Una jugada para que la hagan en ... 🎮 😉 / Just one skill to repeat 😆 https://t.co/bFl7LsEzWd #tbt con la bestia 💪🏽 https://t.co/uZcFmkl5EN La magia siempre será recordada @10Ronaldinho ✨ https://t.co/REXi059ReD De resaltar el espíritu combativo que tuvo el equipo hasta el final del partido. //// To highlight the fighting spirit of the team until the end of the game. 🇲🇨⚽️\nhttps://t.co/ITeJEoNZ7j ¡Vamos por este clásico ante @ogcnice ! #ASMOGCN   🇲🇨 🇲🇨 🇲🇨 🇲🇨 🇲🇨 🇲🇨 🇲🇨 🇲🇨 🇲🇨 🇲🇨 🇲🇨 🇲🇨💥 https://t.co/vDXFomH2bw https://t.co/Ocir7juECu Deseo un gran partido a todos mis compañeros en el partido de hoy. @AS_Monaco vs @MontpellierHSC // I wish a great game Monaco ! #MHSCASM @WilsonMillos gracias Wilson. Un abrazo. @jairocastano76 saludo ! 🙏 https://t.co/P9X9kUeNlB Muchas gracias a todos los que votaron/// thank you all for vote 😃https://t.co/xgb8RTzpd1 @FndoGaviria @quickstepteam cuando vengas por Mónaco intercambiamos roles. 🚵‍♂️😁 Apoyando y deseando  lo mejor hoy @AS_Monaco en el encuentro de @coupedefrance ante @ASYzeureFoot . ¡Vamos! 🇲🇨 Iniciando trabajos 2018  💪🤜👊 https://t.co/mjnz23COEP To my friends around the world!   Hope 2018 will be filled with success, health, prosperity and happiness.    (...) if anyone is in Christ, the new creation has come: The old has gone, the new is here!    Happy New Year! 🎉💥⚽️ Deseo un año 2018 donde todos los colombianos trabajemos fuerte para que Colombia salga adelante. No es momento de ver atrás, mejor remontarnos hacia adelante con esperanza. Por un país donde podamos cumplir nuestros sueños sin odios ni venganzas.¡Feliz año! Dios los bendiga. 🎉 Dando gracias a Dios por este 2017 y con toda la ilusión para el 2018. loreleitaron… https://t.co/ulTiOg11B4 Un año 2017 lleno de goles y golazos. 🐯😆  https://t.co/WYQYO54Ngh Thank you all the @Nice_Matin readers for vote. I really appreciate. 😀 I feel deeply honoured to be part of this award.  Gracias a todos los lectores de Nice Matin por el voto. Me siento muy honrado de esta distinción y de ser parte de esta lista con grandes deportistas. Recuperando energías después de un fuerte entreno. https://t.co/HuktzgWhNx Jesús es el centro de la navidad 🙂 https://t.co/qz2Y1JnKO3 Feliz navidad a todos mis amigos 🎁 🎄 https://t.co/YXbfloNrFB   Hoy es un día para recordar el amor de Dios para con nosotros. En todas las circunstancias que podamos vivir tenemos una esperanza gracias a la obra de Jesús. 😄😎 🎅Hoy vamos antes @staderennais  en el último partido del año.  🎅https://t.co/typ8Kra1E5 https://t.co/xYbQUMGqf4 My gang https://t.co/pkr81pOK5T https://t.co/BWFh5B75vV Estas palabras lo han dicho todo. Felicitaciones @nicovikonis27 ⭐️ https://t.co/rXaw8nXNkL César Daza y José Richard Gallego nos han mostrado un camino posible para nuestro fútbol. Nos mostraron a todos que es posible disfrutar del fútbol en medio de todas nuestras diferencias. Es el momento de seguir su ejemplo. https://t.co/ZEq8ZhArTV Felicito a @MillosFCoficial y su merecida estrella 15. ¡Somos campeones ⭐️! Que sea este un paso más para seguir construyendo el equipo. Las victorias son producto del trabajo fuerte y perseverar hasta el final. @SantaFe un digno rival en esta disputada final. https://t.co/Kpe7yw3xrU Penúltimo partido del año ante @ASSEofficiel 💥 https://t.co/RZgQ09RRHi https://t.co/keCHH2v1SF Gran victoria la de anoche.  🎯 https://t.co/ljUXmOad3S Hoy vamos ante @SMCaen por \n@CoupedelaLigue  https://t.co/MLpwicvUAt https://t.co/gkwiWwbFCH ¡Qué noche! Logramos darle vuelta a una situación adversa. 🤜🤜🤜https://t.co/7EUppI3wN2 Día de fútbol. Camino al estadio. @AS_Monaco vs  @estac_officiel https://t.co/fDyUCjhRtl https://t.co/62fkWp6RAD Lamentando no seguir en @ChampionsLeague Esta vez no fue. A pesar de ello fue muy especial volver al estadio Dragao.  Agradezco a @FCPorto por su cariño. Acá marqué mi primer gol de Champions y el gol 48 por competiciones de la Uefa. \nhttps://t.co/GxEde4ZzyC Siempre salir a la cancha con la mentalidad de ganar todos los partidos. Hoy 💥⚽️@FCPorto vs @AS_Monaco   https://t.co/11KP9ygY6Q https://t.co/JYhn64laFD Hoy es día de fútbol !!! Ante @AngersSCO  💪🏽🗣 https://t.co/sHZ6PPYbvh https://t.co/nSoKwILltT RT @kamilglik25: 🇵🇱🇨🇴🇸🇳 mocne ekipy ale napewno damy rade💪 https://t.co/fXax4Y3ifj ¡Alla vamos @FIFAWorldCup!!  💥💪 https://t.co/fwrhTV4oxd Dos recursos para antes del sorteo @FIFAWorldCup 1. Las probabilidades. https://t.co/RlvFoxUnJo 2. La explicación : https://t.co/DtXeBYjXCR @gaitan75 ohhhhhh @equipedefrance @fifaworldcup_es  https://t.co/jSCROfPhAq @CM_1777 de acuerdo. @FAndresSterling los locales @TeamRussia serán dificiles @FelipeAcevedoM saludo Don Gato. 👍 @elafinadito 👀 ¿Emocionados?  Yo por acá alistándome para #SorteoMundial . ¿Cómo la ven? ¿ Cuáles son los rivales que nos convienen? 🇨🇴 Miren la  copa. 😍 🤤 https://t.co/f7ae9dqj5M Seguimos trabajando fuerte y espero podamos encontrar pronto el camino a la victoria. Hoy es día de fútbol ante @FCNantes  ¡Vamos @AS_Monaco!  💥👊 https://t.co/srdiB3hvCy https://t.co/AY7gB06qCZ 🗣¡Vamos @AS_Monaco! https://t.co/zFcusRgNB2 🤜🏽🤜🏽🤜🏽 #ASMPSG 🔥⚽ Work hard 🔥⚽ https://t.co/jWu0qAfZ9p @nikefootball #playfire #mercurial #asmpsg https://t.co/Y6Be1PCxXQ Amén 😉 Pueden votar en https://t.co/8OCeHztLKc #TeamOfTheYear 😉 https://t.co/L4ti07UYxL Ahora debemos concentrarnos en lo que viene y trabajar para mejorar. https://t.co/dJhEVrOhpr Quiero enviar un fuerte abrazo, una oración y mucho ánimo a Eduardo Berizzo en estos momentos.   #AguanteToto Hoy vamos por una victoria!!! @AS_Monaco_ES   https://t.co/yQUmQEEob7 👊🏽👊🏽👊🏽 https://t.co/sSdr1H2HrF Opera con mi amor loreleitaron https://t.co/wQ5XTePODs RT @AS_Monaco: 🐃 @FALCAO &amp; @carrilloguido11 maîtres du jeu aérien au toro ! #ASMRBL https://t.co/2EgocKDUrV Muy contento de volver a las canchas. Todo listo para el partido de @AS_Monaco ante @AmiensSC #DagheMunegu  https://t.co/0m51kO9Uu2 https://t.co/vZRkVzzcJa @JesusIzq94 saludos 👋 Acá afinando la puntería 💥 contento de volver 😏 https://t.co/SU0crQaysN RT @cjportillaj: @conecta2_CR @CamposAlex @SuPresencia @ArturyPepper @a_asanchez @davandrinlop @mrcesos @patrudelanoche @juanfelipecine @da… Ya es momento que la gente piense lo que escribe.  Ya es hora de parar tanta violencia y odio en las redes sociales. Maduremos. https://t.co/oGL85c63Td Atento  y siguiendo el partido de @FCFSeleccionCol  🇨🇴⚽️ https://t.co/GFX28H2MWC Congratulations @AS_Monaco 5.000.000 fans in Facebook 💥https://t.co/IHLzji7v0h https://t.co/Q6iZfb9R9z Lamentado no poder estar hoy en la cancha.  @AS_Monaco_ES Todo mi apoyo y ánimo para el equipo hoy !!! Vamossssss Debemos seguir adelante. Jugamos un gran partido, lastimosamente no nos llevamos la victoria.  https://t.co/eeW4enE9Am #daguemunegu 🇲🇨 🇲🇨 ✊🏼 Training day 👌🏻⚽️ https://t.co/vHo9ysXpoy - @MLB could you think in beisbol fans in Europe. So late in our continent! Amazing games ⚾️🔥🔥🔥🔥 What a game ⚾️ @LosAstros @LosDodgers #SerieMundial  ! https://t.co/O5lC15sLZl Una victoria que nos da confianza. Seguiremos trabajando fuerte. 🇲🇨https://t.co/wG2ypPIAI0 Hoy vamos por la victoria ante @SMCaen  https://t.co/PGY3mlnLMd  💪💪 https://t.co/4AY2KdkyzN @SMCaen  https://t.co/Ni1DmAWh4V Con la mirada en el partido ante @SMCaen 👀  https://t.co/hCsYsDEHfC A seguir trabajando fuerte y ahora a pensar en el partido ante Caen.  https://t.co/uoBbNwJE9c Vamos por una victoria ante @Besiktas 💪💪💪 https://t.co/eJciK2P77d  #ASMBJK https://t.co/ncGd4YnCxN ¡Los sueños se cumplen! Allá vamos 🇷🇺   @FIFAWorldCup       https://t.co/CncOjX7AkP Estamos en Rusia Colombia!!! Gracias Dios por hacer realidad los sueños. https://t.co/efKnzmUVOm #ConLaFeIntacta. Dejaremos todo en el terreno de juego y que se haga la voluntad de Dios\n https://t.co/ahQ6JnDsA4 👉  https://t.co/Rm54GgbVZg 👶🏼👧🏼👧🏼Los hijos que tenemos son un regalo de Dios. https://t.co/oKwRNY0Ifs Esforcémonos y cobremos ánimo. No es tiempo de desfallecer o darnos por vencidos. https://t.co/qwbFbMmXwk ¡Vamos Colombia! 🇨🇴 https://t.co/qG3l2jFF7f https://t.co/H1z3t4CsSL Trabajando fuerte para asumir esta gran responsabilidad. 🇨🇴https://t.co/G0IQXGyzBr Día de partido. Hoy vamos ante.@MontpellierHSC  #ASMMHSC    💥⚽️https://t.co/UNv6Jt7d8U https://t.co/z7J8MlVXtA Je te souhaite un rétablissement rapide @benmendy23  https://t.co/fgarKbv08m Un resultado inesperado. Estamos confiados en que podemos dar vuelta a esta situación.  https://t.co/4T1elpCoEi ☝🏽does my strength come from ...?☝🏽 // ¿de dónde viene mi ayuda ? 👊🏽 https://t.co/RljW8q2Vwk Todo pasa en Pescaíto 🎤 @carlosvives https://t.co/ZkXsHbKts7 201 ✌️ y voy por más. 💥⚽️ https://t.co/o7n8oUq7E3 Gracias al Dios que ayuda a cumplir los sueños he llegado a 201 goles en Europa.   ⚽️💥⚽️🐯 https://t.co/VgJPTpBTG4 https://t.co/KnO3ZHz0Kk hoy viernes... es día de fútbol. Vamos ante @losclive  Allez @AS_Monaco_ES . 🇲🇨🇲🇨💥👏  https://t.co/6Sdgrv9GbV https://t.co/qFhcVXj8pP ⚽🎮 Merci @EA_FIFA_France ❤ #FIFA18 https://t.co/m9HgveUT4x ¡Vamos @CARPoficial! Esta noche...si se cree, TODO ES POSIBLE.  👊💥⚽️ https://t.co/cp4CTwzvJx @FRANKO7603 pero donde yo trabajo no. * Thank you. 🇲🇽 Than you Mexican people for showing us how important is solidarity in our society today. #fuerzamexico 🇲🇽🇲🇽🇲🇽🇲🇽💪💪 https://t.co/YbbXGVz4Bi @MdameNinie ☺️ RT @topos: Gracias por ayudar a nuestra labor:\nSantander 92000709294 CLABE 014180920007092942\nPaypal: donativos@brigada-rescate-topos.org t… RT @elconsejomx: 📌 Si necesitas ayuda o conoces a alguien que podría necesitarla, llámanos, #LíneaCiudadana 5533-5533, atención psicológica… RT @ManoloCardona: Por favor compartan los teléfonos de emergencia: Locatel 5658-1111. Bomberos 5768-2532. Fugas: 5654-3210. Cruz Roja: 065… 🇲🇽 #FuerzaMéxico RT @OnceNoticiasTV: #TomaNota 🔴 Recomendaciones después de un sismo https://t.co/5SIMwMn8Bg RT @CancilleriaCol: #ColombianosEnMéxico En caso de requerir asistencia por sismo, comuníquese con nosotros a la línea telefónica 018001233… El mejor regalo que me dio Dios. Falta 👶Annette 🙏// The best gift God has given me. #Repost… https://t.co/puaaBeOo2b Felicito al @Atleti por su nuevo estadio. Agradezco la invitación a la inauguración y les deseo muchas victorias en su nueva casa 🏡 https://t.co/4vl8cMPVy2 ✌🏻👶🏼😘 gran victoria y trabajo en equipo / great victory and team work. https://t.co/7Q0JVB8S7x 🇲🇨🇲🇨💪☝️Hoy es día de fútbol. Ante @RCSA https://t.co/lMCHMVtFi3  ¡Vámos Mónaco! https://t.co/xG3vFyfV7c @HemelBaena @FCPorto mucha emoción y admiración. @Steuermann5 👍👏 Un juego muy equilibrado y físico.  Ahora esperar a @FCPorto en nuestra casa  https://t.co/MhmNW4HkqN Un nuevo camino. Una nueva oportunidad. @ChampionsLeague  ¡Vamos @AS_Monaco_ES  #DagheMunegu 🇲🇨🇲🇨🇲🇨 👉 👉 https://t.co/MRhcUfU7sj https://t.co/7vf5m6CAAP Entrenamiento de hoy en el Red Bull Arena previo al partido de mañana ante @DieRotenBullen . https://t.co/bzxT4z3cj4 #RBLASM 🚨 En vivo: Todo lo que pasa conmigo y @AS_Monaco_ES en este inicio de la @ChampionsLeague Comenzó esto, señores. https://t.co/wYWNNR04LQ Listos para afrontar este clásico ante @ogcnice ¡Vamos Mónaco! 🇲🇨 🇲🇨🇲🇨🇲🇨🇲🇨🇲🇨🇲🇨🇲🇨🇲🇨 https://t.co/PACQ0jrptv 🗣goooool https://t.co/o4Jnn4OtIH Algunas 📸   https://t.co/3L3tk0bBpP https://t.co/Yv6NifM3e9 Si puedes creer, al que cree todo le es posible. https://t.co/f9HzdXg2Kp ¡Vamos Colombia! Tenemos todos los argumentos, las ganas y la convicción para hacer un buen partido. ¡Vamos Colombia!  https://t.co/7v7D0SeN8y https://t.co/zJ9y7pp8Hv Cree y conviértete #juegadiferente #MercurialSolarFlare https://t.co/OGa1VDuj28 Entrenamientos para recibir a 🇧🇷 https://t.co/BywKCPtIw7 ¡#VamosColombia!  https://t.co/VFdl93JTQ1 🇨🇴👊💪🇨🇴 https://t.co/jJwqhG889g RT @LoreleiTaron: \"Amigos, pueden descargar mi disco #NoMeRendiré desde cualquier parte del mundo a través de #Deezer 📀🎶\nhttps://t.co/lsJR1… 🚀⚽️✨. https://t.co/wsEh5xQJje Hoy un nuevo reto ante @OM_Officiel 👉⚽️💥 https://t.co/tHuIjv9k15 Muy orgulloso por la convocatoria. Debemos trabajar fuerte para lograr nuestros objetivos. https://t.co/FoJkziS4jY https://t.co/2fXvg9kb3Q ¡Ya tenemos rivales  en @ChampionsLeague!  @FCPorto, @Besiktas y @RBLeipzig_EN  Ya nos veremos.😏  https://t.co/unTJ0QHPeG https://t.co/V3U7AuLAdq ¡Muchas gracias a todos!  Ya somos 14 millones de seguidores // Thanks to everybody around the world! 🌎 😆 https://t.co/43W7XQKbGY https://t.co/WT6TW7N9Wc ⚽️🔥✨ https://t.co/18adSCGFHj Annette 👶🏼🍼⚽️ https://t.co/grGG94dABc Contento por la anotación y el trabajo de equipo en un partido complicado. Gracias a Dios por este nuevo gol  😅.  https://t.co/N4W3losS9F ¡Hoy es día de fútbol!  ⚽️⚽️⚽️⚽️ @AS_Monaco_ES  🆚  @FCMetz   https://t.co/Qlc4pLieCd https://t.co/c32qtZebER RT @ElHuffPost: Teléfonos de consulados en Barcelona:\n112\n🇲🇽 +34932011822\n🇪🇨 +34932457465\n🇵🇪 +34934154999\n🇦🇷 +34933041200\n🇨🇴 +34934127828… Mi solidaridad y condolencias por las víctimas del ataque en Barcelona.   Mis pensamientos y oraciones por la ciudad.  De no creer esto. Tengo la alegría de comunicarles  que hoy a las 8:31am nació nuestra 3era hija Annette García… https://t.co/YHSqe4kJYk RT @LoreleiTaron: ¡¡Amigos en minutos estaré en la FM en vivo!! No se lo pierdan.📻 https://t.co/UXo0gsYMMj Je n'ai pas pu m'arrêter pour vous saluer car l'équipe m'attendait pour prendre l'avion (2) 👋🏻👋🏻👋🏻👋🏻😧 Je m'excuse auprès des supporters de Monaco qui m'attendaient pour me féliciter hier à Dijon. (1) El Señor es mi fortaleza. Primer triplete del año ✌️☝️😆 https://t.co/vNFPvpb2DE  https://t.co/A9EoiWX78G Gracias Dios por un año más de vida de nuestra hija Domi, por permitirnos disfrutar cada momento… https://t.co/NtTU3AtfzS Hoy vamos ante @DFCO_Officiel  Allez @AS_Monaco #DagheMunegu 🇲🇨 💪🏽💪🏽👉🏾https://t.co/njV8Stueqv https://t.co/vG87DOzjq3 RT @montanertwiter: Cuando los justos gobiernan, el pueblo se alegra. Pero cuando los perversos están en el poder, el pueblo gime. Prov. 29… RT @EduardoLuisFut: Amigos les pido ayuda, mi perrito se perdió anoche en el Barrio Hayuelos en Bogotá, estamos muy tristes y angustiados,… Feliz cumpleaños maestro @carlosvives te queremos mucho. https://t.co/RWT49glJCd Disfrutando la vida avec mon amour @loreleitaron https://t.co/PRm7y9XrQn Iniciamos con pie derecho ¡vamos @AS_Monaco_ES ! 🇲🇨 / To start on the right foot  https://t.co/2CE4LZjqwP Hoy inicia un nuevo reto con @AS_Monaco_ES  🤜🤜🤜 https://t.co/uyisSkpqqa / Today: is the beginning of a new challenge. https://t.co/E1q0a63xgu Una gran visita 😀 https://t.co/jAY0yvwa8G RT @despiertamerica: Tenemos una cita a las 7Am/6C #DespiertaAmerica la casa más feliz de la Televisión Hispana https://t.co/AfsCDKo6sg Mañana una charla con @marcelaSar de @univision. Aquí 👉 en @despiertamerica 👈 😉 https://t.co/vYrC2K8QmI RT @AS_Monaco_ES: 🐯 #DíaMundialDelTigre @falcao 🐯 https://t.co/CXGfxewL9u Por el primer título del año. ⏱: 🇨🇴 2:00 - 🇮🇩 21:00 / The first championship title of the new season 🇮🇩🇮🇩🇮🇩🇮🇩💪🏽👊🏽  👉 https://t.co/zj8QpEe6bF https://t.co/az0epp9Vkj Contigo aprendí los grande que puede ser el amor entre hermanos, aprendí a cambiar pañales… https://t.co/Fjcg2IXXWP Concentrado en la preparación de pretemporada / Focus in preseason trainning 🏋 https://t.co/TuofCU21hy La próxima va al fondo 😆 / The next will be a goal  https://t.co/zZs5cjuOMB Y yo me alisto para partido amistoso hoy ante @Sporting_CP 😆 https://t.co/tBGFvyv6qz https://t.co/ycnzX9tpOl Te admiro @NairoQuinCo. Tu espíritu combativo es un ejemplo. #GraciasNairoman. Que gran deportista. Todo nuestro apoyo 🇨🇴 https://t.co/SLxjBLt8W0 Estamos muy orgullosos de ustedes @estecharu\n@sergiohenaoofic \n@Cabg1989 \n@jarlinsonPantan\n@elpumadarwin Gracias por lo que hacen por 🇨🇴🇨🇴🚴🏾 https://t.co/4HPCbQnmqB ¡Histórico! #GoRigoGo  felicitaciones @UranRigoberto. Un ejemplo gigante para el país 🇨🇴🇨🇴🇨🇴🇨🇴🚴🏾🇨🇴🇨🇴🇨🇴🇨🇴 https://t.co/H9DhfORx4o Algunos de los niños que disfrutan la cancha :D https://t.co/VFCLHUpL3d Así va la cancha de Palafito de Nueva Venecia. https://t.co/LS6TXUaY6n ¡Gracias @Hublot y @fjuventudlider ! 👍👍 ¡Feliz #20deJulio! Día para pensar en nuestro futuro. En la posibilidad de reconciliación para construir un mejor país donde quepamos todos. https://t.co/PrdkmRDA9s ¡Grande @elpumaDarwin! 🇨🇴🇨🇴🇨🇴🇨🇴🇨🇴 que demostración de fuerza y profesionalismo  @UranRigoberto. https://t.co/5JjIwrdK46 Algunas fotos del partido de hoy. Dos veces en el palo.🥅⚽️ https://t.co/l6Hv2tOfEF Empate ante @Fenerbahce  https://t.co/NXeCCa7Zmw  Foto vía: @AS_Monaco_ES https://t.co/JzSzkk4NO1 🗓️ Hoy: Último partido en Suiza. 🇨🇭 Encuentro ante @Fenerbahce  👉 https://t.co/KCjyxoMvcd https://t.co/yTLmVeoPy9 RT @TFTfootball: Radamel Falcao | The Forgotten Striker https://t.co/5FoI6Z00rr RT @AndreaSernaTV: Este álbum es precioso... \n\n#Repost @loreleitaron\n・・・\n#FelizFinDeSemana con música que sana.… https://t.co/oqy9upFLbu Segundo partido de pretemporada ante @PSV  https://t.co/QEWmWpAAPi https://t.co/UiL1QJNXDd Primer gol en pretemporada 😉 https://t.co/hVQND7FZ2z Que bueno volver a verte @BoKrkic te deseo el mayor de los éxitos para esta temporada. https://t.co/RA3sxzPfao RT @AS_Monaco_ES: 💪¡El trabajo durante la 1a sesión de entrenamiento! #Día1 https://t.co/mzyA87uFyS Trabajando duro / working hard 💪🏽😅https://t.co/ThbtMEvBiS Inician trabajos de pretemporada en Suiza. 🇨🇭 https://t.co/x2DgHLQD4E https://t.co/Hr7aS76X3h Comunicado: https://t.co/saPdxboqMX Tercer entrenamiento de la temporada ☀️💪🏽 https://t.co/vd18J94ev7 Gracias @pulpoviera por tu testimonio y ejemplo acerca del perdón. RT @pulpoviera: El perdón es la cura que todos necesitamos para nuestra alma.Hoy me tocó perdonar a la persona que me hizo mucho daño. DIOS… Segundo día ✌️ de entrenamientos de pretemporada con @AS_Monaco_ES https://t.co/uFoHwCRUNB Felicitaciones @UranRigoberto. Que demostración de berraquera esa victoria. ¡Sigue adelante @NairoQuinCo, ánimo! 🇨🇴🇨🇴🇨🇴🇨🇴🇨🇴🇨🇴🇨🇴 https://t.co/CBBbHK8yj0 Que buena noticia saber que @leopoldolopez está con su familia. Una oportunidad para avanzar en las soluciones que necesita Venezuela. Último día de vacaciones @loreleitaron //Last day of vacation with @loreleitaron and my princesses. https://t.co/RK8pIv4xvv Que grande pollo, abrazo grande. https://t.co/3fCphPtbJv La de visitante 👌🏻 https://t.co/p7kVnyO3Wi Gracias @entrenacarlos y a clinica_met en Bogotá por ayudarme en mi acondicionamiento físico. https://t.co/pd7LKUef0S Mi princesa más pequeña https://t.co/EQ2E6QvurN Amo tu sonrisa Mi pequeña https://t.co/b1EV0uvH6Q Falcao @Hublot https://t.co/I4AVvpRcFi Feliz de poder ayudar a los niños de la Ciénaga gracias a la segunda edición de @Hublot Falcao.   https://t.co/npDtZRlSmw Una nueva camiseta para enfrentar con ambición está temporada.  / Nouveau maillot pour une nouvelle saison ambitieuse 🇲🇨\n@nikefootball https://t.co/FVvMS0tTce Preparándome para jugar en los @marlins https://t.co/LXVGKxshQ0 Gracias por la invitación @Cuadrado lastimosamente no te puedo acompañar. Éxitos esta noche y q' se llene el estadio. https://t.co/y3yYMRIBre Te amaré con tantas fuerzas, no habrá fin.  🎵🎶🎵🎶 @LoreleiTaron  https://t.co/Nb7ZXswnEw RT @carlosvives: Acompañando a unos grandes amigos que viven entre el futbol y la música. Gracias @LoreleiTaron gracias @FALCAO  #nomerendi… #NomeRendiré 😍😘 https://t.co/eotBzcS7Qs El lanzamiento del disco de mi esposa @LoreleiTaron 😍 en vivo !! https://t.co/YRcdgn8hvq RT @LoreleiTaron: Les presento a Dios Invisible. Gracias a todos por hacer posible este sueño.\nhttps://t.co/c8HU7cMlv5 En minutos contaré de mi testimonio de vida en @SuPresenciaIgle https://t.co/gN0lCoQnBF podrán preguntar con el tag #Falcaoyloreleisp https://t.co/FRcvATdw7a Estoy de regreso a mi casa 🏡 y me encantaría saludarlos. Estaré en el Nike Store de la calle 82. 🤝 😉 https://t.co/RU3e35C1JK @danitorresrojas Disfruten las vacaciones @danitorresrojas Dios los bendiga. Gran trabajo de todo el equipo. 🇨🇴💪🏽 https://t.co/1YqYVBLjHg Estamos listos para el partido ante @FecafootOfficie  https://t.co/82IeG8ctiK    🇨🇴 vs 🇨🇲 https://t.co/dwv81ZMAF6 Felicitaciones @RafaelNadal.  Luego de un tiempo dificil. ¡Volvió con toda!.  Ejemplo. 🎾🏆👏👏👏👏 https://t.co/oRAPWssUsP 📷 🇨🇴 Colombia 2 🇪🇸España 2. https://t.co/ycolzb7gnJ https://t.co/zMmsDn9OTI Impresionante. Al que cree todo le es posible. https://t.co/FnbdLagPcK Qué alegría volver a verte kokiño. Abrazo amigo https://t.co/lIR9W3ZBA1 🤜🤜 Muy contento por el gol y por el planteamiento del equipo.  https://t.co/2ndSpxkh1f https://t.co/sPIeTzEZDO 🚨 Hoy es día de fútbol.🚨 A pocas horas del partido ante @SeFutbol. ¡Vamos Colombia!  https://t.co/lgGJx5SOAH   🇨🇴 🇨🇴 🇨🇴 🇨🇴 https://t.co/OidVYkZDwF Alistándonos 🥅 (ayer en el estadio Nueva Condomina) 🇨🇴 // Getting ready ( Yesterday at Nueva Condomina Stadium) https://t.co/NN1q8wBy7v Un abrazo a familiares y amigos del 'Olímpico' Marcos Coll, leyenda del fútbol colombiano. Recordado por siempre. https://t.co/Ex1U6sx6OZ A finales de mayo estuve en Grecia compartiendo y jugando con niños. Mi primera vez en ese país. 🇬🇷🇨🇴  https://t.co/tGhwnKe4JG https://t.co/AnaPbzP2N7 En los entrenamientos con la Selección. https://t.co/8ghDoUwNNd 🇨🇴 https://t.co/qKkoBmalmY Hace 10 años mi primer gol con la Selección 🇨🇴  https://t.co/ikQd9WAbRz Anuncio mi renovación con @AS_Monaco_ES . Muy feliz de seguir construyendo este proyecto. https://t.co/QwJ13SUMZJ https://t.co/HfbrwJrla1 Entrenando para afrontar partidos amistosos de @FCFSeleccionCol con la mayor responsabilidad. 💪 https://t.co/He4tBJxMir Muchas gracias por todo lo que le entregaste al fútbol @Totti https://t.co/lrQMSOOoJJ Siempre te apoyaremos @NairoQuinCo. Estamos orgullosos de tu participación en el @giroditalia #GraciasNairoman 🇨🇴 https://t.co/feblntt0rM Muchas gracias @TataCalde por la invitación y al equipo @SauberF1Team por permitirme conocer el box. 🏎🏁https://t.co/7H9KjHY0bc #MonacoGp Recargando energías 💥 https://t.co/3RGcmHhz8g ¡Grande @CARPoficial! 116 años y que sean muchos más. 🎉🎉🎉 https://t.co/X2VHkUe00n My thoughts and prays for those that have been affected in Manchester Arena. My solidarity with the British people. https://t.co/KfHf7YcZtP Una temporada inolvidable https://t.co/Ar6RsQR0ei 🎉🎉 https://t.co/2RZ33VbKtj Hasta siempre #VicenteCalderon Maravillosas tardes y mágicas noches quedaron en mi corazón. https://t.co/QhMmbb25NS Felictaciones @FndoGaviria ¡haciendo historia! https://t.co/1W4gThwBIN Mi diaria inspiración / My inspiration all the days ❤️ https://t.co/Jn8CaONvSf \"No temas. Solo cree”. Marcos 5:36.  #NoMeRendiré.  🏆 🎉 ¡Campeones! \n👉 https://t.co/Q4xm6bEx2t  👉 https://t.co/vZOltngvEd ¡Vamos por el campeonato! 🏆 https://t.co/YC2bqmhzto https://t.co/1VcifWvIBQ Cerca del objetivo 👊🏼 #nikeid  #MakeHistory  @nikefootball https://t.co/JTeGVw5x3t Con mis princesas por primera vez en una cancha. https://t.co/TWLOSpqFeI Muy cerca del objetivo https://t.co/jBGE1KgLy8 ¡Por la victoria @AS_Monaco_ES! 🤜💪👉     https://t.co/bQegpt5H94 https://t.co/tl6eq62wkD Gracias por todo lo que hacen. ¡Bendiciones! 🌹 https://t.co/OrCHNAXTr6 #SosVenezuela. Deseo la paz para Venezuela. / I wish peace for Venezuela. https://t.co/WSG7rFsdMK Hi my friend, 5 vs 5 in June with @JuanPaGalavis https://t.co/kKGIa2ATkA 😂😂😂  demain foto https://t.co/DQEI9bgvPx Thank you to all my friends around the world. We reach 13.000.000 users from all around the world in many languages and nationalities.  👏👏👏 Gracias a todas los amigos que hacen parte de mi perfil. Ya somos 13 millones y aumentando.¡Gracias por sus mensajes de apoyo y comentarios! https://t.co/eG9tucnytx Muy orgulloso de @AS_Monaco_ES  No pudo ser en esta oportunidad.  Ahora a concentrarnos en Ligue 1. https://t.co/q32IsJCwml https://t.co/2VjrgerDLx Que final @Adominguez15  🏆➡️🏆 https://t.co/DWZDW8HwTl Cada vez más cerca / closer and closer. \nhttps://t.co/fNo2JzATIa https://t.co/WlcUkfk8hy Concentrados para lograr nuestro objetivo: un triunfo ante @asnlofficiel .  https://t.co/AFXWg9RGFS https://t.co/lu8jQWPZzt Oye @AdrianaLucia que bello es Monteria https://t.co/slMooPu2lv Felicitaciones por tu disco #Porrock. 🎙 Tenemos que continuar. Con nuestras armas trataremos de buscar goles y dar la vuelta.  https://t.co/Uv0R6byCea Con la mirada puesta en @juventusfc  https://t.co/q1eVNrpYdf https://t.co/9Ulv9fybjj Buen juego colectivo. Victoria importante para lo que viene. https://t.co/mUbLdFZAf6 Todo listo para el partido ante @ToulouseFC . Allez @AS_Monaco_ES  🤛 🤜 👉 https://t.co/SydYEiB8jR  (ﾉ^_^)ﾉ https://t.co/XGH7hALrYK Último entrenamiento para el partido ante @ToulouseFC \nhttps://t.co/6SIADCI36B No fue un partido fácil. Ol es un gran equipo. Hemos trabajado duro para llegar hasta donde estamos.  📸 https://t.co/mbMn5o2CPj Victoria clave. / important victory today. https://t.co/IUjQoohCAu RT @BernardoCSilva: Quelle victoire ce soir!! 😃🔝 @AS_Monaco https://t.co/4GZgxLl6DC Llegando a Parc OL para el encuentro ante @OL a las 2:15 de Colombia, 21:15 Francia.    https://t.co/JSftPUI3Cj https://t.co/7Fme2XiIsy Contigo @NairoQuinCo y con todos los deportistas que nos representan... en las buenas y en las malas. https://t.co/9OHmZjaPrz Ante @juventusfc en la Semifinal. 🤜 Inicio de local 2 ó 3 de mayo. La vuelta: 9 ó 10 de mayo. https://t.co/EI5FMKgzsD Cuando anotas un gol en Champions. 🤤😉 https://t.co/pxEi3ITRxI Clasificamos. Dios es fiel / we are in semifinal . God faithful / Qualifiés. Dieu est fidel https://t.co/FpPjTbHEWI Al que cree todo le es posible.  ¡Vamos por la clasificación!. 💪 #ASMBVB #UCL https://t.co/eJhvIhk6hM Camilo, niño colombiano adoptado en Francia, me visitó en el camerino. 😀 https://t.co/xLuLN3pqRH Resucitó. Felices pascuas / Happy Easter 👍🎉 https://t.co/dvd90j4Shn Cuando tienes fe todo es posible. Vamos Monaco 🇲🇨/ keep calm.... Everything is possible when you have faith. 🤛🏼 https://t.co/oIb3O9y5j6 Gran victoria. Trabajo de equipo para darle la vuelta al marcador.  /⚽️🥅 https://t.co/CpSQVNtiCK ¡Vamos @AS_Monaco_ES! En un par de horas salimos para el estadio para enfrentar a @DFCO_Officiel    👉 https://t.co/ny00m8ZxBN https://t.co/jQKUWukaPC Gracias por tu música, sencillez y apoyo. Te extrañaremos. Acompaño a sus familiares y amigos en este momento. https://t.co/XvZChcRdYv Dimos un paso importante en Dortmund  pero la serie no está definida todavía. / #daguemunegu 🇲🇨🤛🏼🙌🏼 \nhttps://t.co/tzldpbSkU6 Lamento todo lo que sucedió. Todos estamos bien. Deseo una pronta recuperación a Marc Bartra. ¡Vamos @AS_Monaco_ES! https://t.co/WnU9TLrOUm Dios no nos trajo hasta aquí para volver atrás, nos trajo aquí a poseer la tierra que Él nos dio.☝️☝️ https://t.co/8GW9TWK7dg 3 importantes puntos en nuestro camino.  Victoria clave y gracias a Dios por ese gol.  🎯🥅 https://t.co/yjlxbbMFXq A pocas horas del partido ante @AngersSCO 17:00 🇫🇷 🇲🇨 10:00 🇨🇴  ¡Vamos @AS_Monaco_ES!  https://t.co/MauJoizU1W https://t.co/ALb4Jtrkyi Saliendo para Angers para el partido de mañana ante @AngersSCO / In our way to Angers.  👌🏻 https://t.co/BpNBSWp3LP Mi deseo de una buena y pronta recuperación para Sebastian Pérez.  Pronto lo veremos en la cancha nuevamente. https://t.co/jGpruoqb4i https://t.co/4uWBkuzOo9 La primavera llegó \"God is not dead\" thanks @supertrumpstore RT @chrissymacCNN: Prepping to interview the one and only @FALCAO @AS_Monaco https://t.co/LsC48IxEfW Bank account for donation. Colombia landslide in Mocoa, Putumayo\n https://t.co/Kspk2rCZZd  #MocoaSomosTodos Abrazo de solidaridad a todo el pueblo de Mocoa. Mis oraciones y deseo para que puedan superar este duro momento. #MocoaSomosTodos Entrenamiento a 1 día de la final de la Copa de la Liga.  https://t.co/YA1WaI0g4K Ya en Lyon para la final de la  @CoupedelaLigue🏆. We arrive Lyon for the Ligue Cup final. 👍 Felicito a mis compañeros por la gran victoria que nos dieron. ¡Vamos Colombia!  https://t.co/aGTdrPbYYW El gran @NickyJamPR...si es un fenómeno como artista, como persona mucho más. https://t.co/ekeEDmxx9w Mau y Ricky - Para Olvidarte (Official Video) https://t.co/bMdT6oMlC7 vía  @MauYRicky @YouTube Oye @Armero7 era la mano 🤚 derecha, no la izquierda. https://t.co/pakucsjIOZ Formas se pueden y deben mejorar, pero en este momento tan decisivo, sumar 3 puntos es lo importante. A Ecuador por puntos. ¡Vamos equipo! https://t.co/6TkIsc72Bt Envío un fuerte abrazo a todo el equipo y espero que hagan un gran partido que nos encamine al Mundial. ¡Vamos Colombia! https://t.co/SHajMAHRv3 Mis princesas y el 👶https://t.co/yT1eM0ZW6b Ante  el @BVB 😏... ¡Vamos @AS_Monaco_ES!    🇲🇨 Solo basta creer para lograr lo que parece imposible. ¡Sí se puede @AS_Monaco_ES! // Just believe  to achieve what seems impossible   🇲🇨 https://t.co/C4sqc3dieK https://t.co/y8gLQS3Kk9 2013🤰 2015🤰 2017🤰hat trick Alistándonos para el partido ante @girondins. 16:45  🇲🇨 10:45  🇨🇴 https://t.co/bExnIPfyXR / Ready for the game against Bordeaux.  😏 https://t.co/NRSliKgXQm Entrenamiento de hoy / training day 💪🏽 \nhttps://t.co/i7nVyjxEwp Regalos 🎁 https://t.co/jHiLE7uvBS Ya llegué. Como bonita esa camiseta 😆 https://t.co/xcjETltvoO Hoy estaré a las 6:00 en la tienda de Monaco. Para que vayan 😉 / today at monaco store https://t.co/hwdFQ7pAOb Hace 12 años, el 6 de marzo de 2005 debuté con @CARPoficial en un partido ante Instituto en el Monumental. https://t.co/iGPdZj8cXq Gracias a todos por la votación del gol de la jornada en Champions / Thanks for vote goal of the week   https://t.co/yPkPojzCkt 💨⚽️ @Ac3ro bueno saber que todavía existen hombres con sentimientos. 😆 Un privilegio para nosotros trabajar contigo @simonbrand gracias por tu profesionalismo y dedicación. https://t.co/xSEG84zUHV @OscarRi93974276 @LoreleiTaron gracias Óscar. Un saludo. @JorgeGm21380090 @LoreleiTaron gracias Jorge. Un saludo. @lucho1201 @LoreleiTaron 😉 Nunca se rindan // Never give up // Ne te rends jamais.  \n@LoreleiTaron  💑 🎼🎤 https://t.co/PNCJ1sc5YS RT @LoreleiTaron: Una aventura que hasta ahora comienza, llena de perseverancia y un montón de fe. Confío que Dios hablará a tu vida con #N… Sufrida pero merecida victoria. https://t.co/D3bKf4VgWf 👌🏻 ¡Vamos @AS_Monaco_ES ! https://t.co/nTDbIooYYA RT @LoreleiTaron: ¡M A Ñ A N A! #NoMeRendiré, solo 1 día. https://t.co/dvI41AYpwb RT @LoreleiTaron: Tan agradecida con Dios por esta cuenta regresiva y el lanzamiento de la primera canción #NoMeRendiré. https://t.co/imbeo… Quería copiar el tuyo 😂😂la próxima será. https://t.co/8DYz4H5SrR Victoria importante por lo que viene.   Supimos anotar en el momento justo . ¿Cómo no entra esa  chilena? 🤤 https://t.co/lC5aySL4ck ¡Vamos @AS_Monaco_ES! Todo listo para enfrentar a @EAGuingamp  https://t.co/SP8QC38vGc https://t.co/JTjMWWgTxw El proyecto de  @LoreleiTaron ❤️️ 🎤\nhttps://t.co/PfYd9MEIsm  👉https://t.co/uabU0bSB6M ¡Que partido! / What a game. https://t.co/CM6dL5o9QS  👉 https://t.co/dXaQdhieMv Muchas gracias crack. Tranquilo contra porto por favor 😂😊 https://t.co/6AdkIH5FFN La serie sigue abierta. No era el resultado que esperábamos pero podemos remontar en Monaco.   https://t.co/4LEmGJgwrX Ya en Manchester para el partido de @ChampionsLeague ante @ManCity 💪💪  https://t.co/46dIrWu56K https://t.co/oA5ycwf8Sb RT @BeVeronico: #SCBASM : 5 changements 2 arrêts pour blessure = 2mn de tps add\n#PSGTFC  : 5 changements 2 arrêts pour blessure = 6mn\n#netu… @cruzdiegoale House of Cards Abriendo jornada hoy. Partido ante @SCBastia  el club de la isla de Córcega. ¡Vamos @AS_Monaco! https://t.co/liV6yw9QOQ @DavidPomporreto @netflix ya me la vi ! Viajando a Bastia. ¿Qué me recomiendan para ver en @netflix ? https://t.co/r71aKUZOA7 RT @AS_Monaco: RDV à 11h avec @FALCAO sur Insta / @falcao answers your questions before @ChampionsLeague at 11:00 am\n\n#AskFalcao ➡️ https:/… Mi Valentín eres tu 😍...https://t.co/snJQs6KGlX Contento por la victoria @AS_Monaco_ES pero tristes por @g_boschilia  ¡pronta y sana recuperación ! #fuerzagabriel  https://t.co/FQOj4anBtz Alistándonos para salir al estadio. Hoy ante @FCMetz  🤜 🤞 👉 https://t.co/k8hdv4JfNr Gracias, muchas gracias @carlosvives https://t.co/sIyMTXA7bP Me pusiste a pensar con el jeroglífico @2010MisterChip No estuve ni cerca de resolverlo. Muy bien 👌 @Jorgeperolo19 https://t.co/wlJgO4AePA Muito obrigado, Porto sempre estará no meu coração. https://t.co/BT7h2gMLmF I just want to say many thanks for all the lovely messages you give me today in my birthday. Thanks all. God bless you.  😀 Quiero agradecer a todos por los mensajes llenos de cariño que me han enviado hoy por mi cumple.  Muchas gracias. Dios los bendiga. https://t.co/NMGTMSnEhJ J'aimerai remercier tous ceux qui m'ont envoyés des messages chaleureux pour mon anniversaire. 🎉🎉 @HeminVasani happy birthday 🎊 Primera sorpresa del día. Gracias por todos sus mensajes. Dios los bendiga 👍🏽 https://t.co/hHDyrN8yZf Félicitations les gars, tres bon match. https://t.co/SuRPiP2WON Sufrida victoria pero demostramos gran capacidad para mantener la ventaja. Se cumplió el objetivo ...  \nhttps://t.co/FXuPMx7d9t Preparándonos para el partido de hoy ante @MontpellierHSC  @AS_Monaco_ES trabaja fuerte y con disciplina #MHSCASM 👉 https://t.co/9QCPmgPZ3w https://t.co/Dcr5VBV7gQ Hace 10 años, debuté con mi selección Colombia en un partido contra Uruguay en Cúcuta.  🇨🇴🇨🇴🇨🇴\nhttps://t.co/gubckDxPMl Que golazo de @Cuadrado Nada como ganar un clásico ... 🚀⚽️ 🐯 https://t.co/SlVwpDBJfJ https://t.co/ouCQ3wVCjj RT @AS_Monaco: 😀✌Sourires, bonne humeur et décrassage pour les titulaires de la veille ! https://t.co/fo46ekZuOU Montado en la bicicleta 😂😜abrazo grande Carlos. https://t.co/lLJRXTZeM8 Muchas gracias Diego y Juan por ayudarnos siempre. https://t.co/mbITTGdCYk #daguemunegu🔴⚪️ trabajo en equipo 👌🏻 https://t.co/gUkBq3TNwR ¡Victoria! / Victory! / Victoire ✌🏻 https://t.co/j272tVFTQJ Hoy es día de clásico ante el @ogcnice ¡Vamos @AS_Monaco_ES!  👉👉https://t.co/NCgCkNxoSD #DagheMunegu #ASMOGCN https://t.co/VONoJgu6PW Buen ambiente antes del clásico ante @ogcnice  👌https://t.co/cyvs3qBOPY ¡Come on AS MONACO!  We are in our way to Coupe de France. Great game Chambly 👏👏👏 https://t.co/KXHvHnbGgZ ¡Vamos @AS_Monaco_ES!  Seguimos adelante en @coupedefrance.  Gran partido de @FCCTHELLE 👏👏👏 The Gerlings en el Festival de Circo de Montecarlo.   🇨🇴\nhttps://t.co/I42Jko3IF5 El equipo de acróbatas colombianos que participó en el  Festival de Circo de Montecarlo. Increíble espectáculo 🇨🇴 🇲🇨 https://t.co/2qBSoaZkrN La previa del partido ante @PSG_espanol:  👉  https://t.co/n4NWD55jrh https://t.co/z2s3Me7mSl Que admiración y que honor poder ver la final entre @rogerfederer y @RafaelNadal. 6 años después en torneos Grand Slam. 💪🏻 👊🏻 @brayaham1 jaja no. Pedí ayuda en la traducción. Happy new year my friends! Hope all your dreams come true. May the coming year bring you joy, love, and peace to you and your families. 🇨🇳 https://t.co/43GuVbYtkg 朋友们新年快乐，希望所有的愿望都可以实现。希望新的一年给你和你的家人带来快乐、幸福和和谐。Falcao 在此祝您鸡年行大运。🇨🇳 https://t.co/BP4ZI5Vjpi Siempre los recorderamos @ChapecoenseReal. Un fuerte abrazo a las familias y amigos del pueblo de Brasil. https://t.co/rGlszBpLuz Estamos en la primera final. Gracias a Dios por permitirnos llegar hasta acá  🇲🇨 \nhttps://t.co/qtZTfIsZcl On compte sur vous...👊  #ObjectifFinale 🎯// Hoy semifinal de la @CoupedelaLigue. ¡Vamos Mónaco! 👉🏻👉🏻 La previa: https://t.co/5M64ChxmbE https://t.co/0O1ZZxMpEg @elzorrotacneno saludos a Tacna ! Acá entrenando. No nos detenemos / Training day. We are ready for the next game 🤤 https://t.co/P5BR9GnGQl 📸 de la victoria de ayer.  https://t.co/fxCG1awNAv https://t.co/atRMnoPZjq My thoughts and pray for @RyanMason . Get well soon! // Mis pensamientos y oraciones por Ryan Mason y su familia. Pronta recuperación. Merecida victoria. Todo el equipo hizo una gran presentación y por eso llegamos al liderato. Vamos Mónaco !!!  ☝️☝️ https://t.co/9wjAWsiQIm https://t.co/84OA5MUyYc RT @2010MisterChip: Chapecoense vuelve a celebrar un gol. Lo celebramos todos 👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻 https://t.co/HZQ374E6IP Mañana ante el @FCLorient 👌🏼👌🏼 La previa del partido:  https://t.co/HrMTsjbj3f https://t.co/RCLBs1TmOU Pero los que confían en Dios siempre tendrán nuevas fuerzas.   https://t.co/JUCa9MRWx1 Felicito al equipo de @acolfutpro por coronarse campeón en @FIFProAmerica  Torneo de futbolistas que aún no tienen contrato con equipo. 🏆🇨🇴 https://t.co/mybJNS1ACe Cocktail pour la sortie du livre de recettes pour champions du Dr Kuentz @valeregermain @benmendy23 @asmonaco \nhttps://t.co/K8FyKlJwer El gol de ayer 👌🏻/ Yesterday goal 🥅 https://t.co/9wiSrpsDMx Gracias a Dios por esta victoria. / Thanks God for the victory.  👉  📸 https://t.co/dgr6QxdchV https://t.co/Fbw6q0jZ7u RT @AS_Monaco: 🎤 La joie du vestiaire monégasque ! 🔝 😍  #OMASM https://t.co/uAShPJaEAi Gooollll. 12 anotaciones. Somos primeros y el trabajo colectivo muestra sus frutos. https://t.co/9w94h0Qkd4  #daguemunegu🔴⚪️  👌 https://t.co/x1kie4L99H @surivman ¿Se podría que ganaran los dos? ¡Día de fútbol! Concentrados y con la mejor expectativa para el partido ante @OM_Officiel 👉  https://t.co/hHivOW6j9d #DagheMunegu  👊👊👊 https://t.co/7N95UFAwqm #DagheMunegu 🔴⚪ ⚽️ https://t.co/foseGWUg26 Victoria gracias al carácter y actitud del equipo. Seguimos nuestro camino en @CoupedelaLigue https://t.co/m2Kxq7Gdzb Así ya está hoy: https://t.co/nfTVQeH7V2 Así estaba ayer la cancha donde vamos a jugar  ⛄️ ❄️ 😱 https://t.co/CRl1stkeLi ❄️❄️Hoy una nueva oportunidad  con el @AS_Monaco_ES en el partido ante @FCSM_officiel por @CoupedelaLigue  https://t.co/UGWSxfjVC2 ❄️❄️❄️ https://t.co/ooBVTsdEf6 Salmo 30:5 https://t.co/Qx6ByoeZMm https://t.co/hplEbCLQIn RT @MarcoVanBasten: Brilliant to see some old faces play earlier in the snow. And welcome top women's players too. Happy to watch today!\nht… Trabajando con disciplina y constancia para afrontar la segunda parte del fútbol francés.👊 ✊ 🤛 Esto es lo que viene: https://t.co/rZEdGcc2AZ Un abrazo a los amigos y familiares de Roberto Cabañas. Mis condolencias al pueblo paraguayo y @APFOficial https://t.co/WX4goqzVo1 Cuando te preparas para las próximas olimpiadas 👧🏼 https://t.co/fGG6c4TRWh @danielesstr01 Gracias Daniel 🤠 @josegustavosan4 feliz año 👋🏻 - @ACAjaccio, un duro rival 👊🏽 https://t.co/WUJzE7jUQe Duro encuentro ante Ajaccio. Comenzamos el año con pie derecho y clasificados a la siguiente ronda de la Copa. https://t.co/o5XYXdPoGB Primer partido del año con muchas expectativas con lo que puede pasar en el  2017  👊🏽 \nhttps://t.co/YgnHmzJwHF ¡Feliz Navidad! https://t.co/w4Kr9xS42A Día de partido ante @ol  #daguemunegu🔴⚪️ / Match day 💪🏽 \nhttps://t.co/LZmQ9Q24X4 #ASMOL https://t.co/IoqTUYgi6L Finalmente nuestro rival @AS_Monaco_ES en @ChampionsLeague será @ManCityES 😏😏😏😏😏 Recuerdo del Súper Clásico 2007.  Alentando al millo siempre. Vamos  @CARPoficial !!!! #VamosRiver \nhttps://t.co/BpgvTdrATo 👨‍👩‍👧‍👧⚽️ 🎄 https://t.co/WV5GwU128i Desde hace mucho tiempo mis hijas me pedían que les llevara el balón del partido. Gracias a Dios ese día llegó. \nhttps://t.co/OiobHSkd6V ⚽️⚽️⚽️ #daguemunegu🔴⚪️ \nhttps://t.co/BSuo8RLt2r Hoy es día de partido ante @girondins.  #DagheMunegu https://t.co/uAIKqbgEPC // Match day. https://t.co/tDKR67n8rQ Cuando te gusta volar. https://t.co/aMNbcg5lNU https://t.co/XLpShb3MXT RT @RiverLPM: Cuando te gusta volar @FALCAO https://t.co/QtSoLplYO8 Cuando te gusta saltar  🕴 https://t.co/XZtySyZ7GF @74Elliott yeah sure. A super big hello to Ewan ! 👋 👋 👋 Ya somos 12.000.000 de personas en mi perfil en @Twitter  😅 https://t.co/LbfyMtPwTh Nuevamente esta noche un gran trabajo de equipo. Gracias a Dios por este doblete en medio de un duro partido https://t.co/Tm6IhvyWPC Así es @MassaFelipe19 ¡Que dupla y que honor! https://t.co/4rQxQqG0W6 #forçachape https://t.co/p2h2SD8Kos In times when solidarity and concerns for your brother is lacking. Colombian people returns us faith and give us hope. #ForçaChape https://t.co/m6recnZYkK Impossible not to feel all kinds of emotions when you see this video. @Chapecoensereal we never forget you.  Hugs for family and friends. https://t.co/GfVDrG6s9j En tiempos donde la solidaridad y la preocupación por los demás escasea lo que hizo el pueblo antioqueño retorna la fe y esperanza. https://t.co/3Q3uhp3rw9 Imposible no sentir todo tipo de emociones al ver estas imágenes. @ChapecoenseReal nunca los olvidaremos. #ForçaChape https://t.co/mosYvClF0G Camino al estadio Gaston-Gérard para el partido ante @DFCO_Officiel. RT @2010MisterChip: La grandeza está en los gestos y no en los títulos. Bravísimo @nacionaloficial https://t.co/bDviCcTq7Y My pray and solidarity for survivors, family and friends of @ChapecoenseReal in this sad time. Mis oraciones y solidaridad para sobrevivientes, familias y amigos de @ChapecoenseReal en este momento tan duro. https://t.co/ZFYOKT34US @julienasm 😉 Nuestra siguiente parada: Dijon. Mañana a las 21 hora de Mónaco. https://t.co/oK0TOYaYJZ\nhttps://t.co/DEH7junJRm Felicidades tecla!!! Líderes como tu, con ese corazón y sacrificio hacen faltan en el fútbol, te lo mereces goleador. Felicito al @AmericadeCali por su retorno a la Primera División. Igualmente al   @QuindioOficial. Un partido digno de estos dos grandes. Aplausos para el tecla Farias!!! Trabajo en equipo. La clave del triunfo. ¡Vamos 🇲🇨! /// Team work. The key to success https://t.co/KVjQH1CyNL https://t.co/14dmx8z29n Hoy es ¡día de partido! ante @OM_Espanol https://t.co/4BOTVvPhle Match day ! https://t.co/xA8dzIqVQE @dacourtolivier 😉 👍 Este domingo estaré con @dacourtolivier en entrevista para @CanalFootClub 📺 https://t.co/PQeC7Q37VR Que gran partido el de anoche. Totteham fue un rival muy difícil. ¡Estamos clasificados! https://t.co/wLHqYFqxWa Gracias a Dios por la clasificación!!!  https://t.co/BURmcedyEe\n @SubasicDanijel \n@benmendy23 \n@JoaoMoutinho \n@TimoeB08 \n@Boschilia Alistándonos para el partido de hoy ante @Spurs_ES por @ChampionsLeague https://t.co/jX2qlaGDCD Un fuerte abrazo a la familia, amigos y familiares de Gabriel Badilla. Me uno a todos ustedes en estos momentos ... \nhttps://t.co/BtwqwcCaum Nada más fuerte que un equipo unido 🙌🏼🙌🏼 \nhttps://t.co/SnTW6XjQh8 Gracias a Dios por ese gol tan rápido 😏. Un gran trabajo de equipo que nos dio una merecida victoria. https://t.co/EuCYWfHLE2 Llegando al estadio Moustoir para el partido ante @FCLorient . https://t.co/L1GrTxgCYC https://t.co/Ss9zAWusTE #parabensDragao https://t.co/cWSYuLP5AI Los partidos definitivos están por venir. Debemos detectar los errores y corregirlos. Tenemos cómo ...\nhttps://t.co/LIwTI2YyUr Fe, concentración, lucha y buen juego. ¡Vamos Colombia! Se puede 🇨🇴 ¡Vamosssssssss!\nhttps://t.co/b3OY8AOnl5 Dependemos de nosotros. El equipo está fuerte y todos tenemos la ilusión intacta. Se puede. 💪 https://t.co/MP6WngUZI2 ¡Vamos Colombia! 🇨🇴👊🏼 ¡ Todos unidos podemos! 👊🏼 Preparando el partido 🇨🇴 💪🏽  https://t.co/Q4JUYmo4Nr Agradezco a todos los hinchas que me han mostrado su apoyo y cariño desde que llegué a Colombia. Dios los bendiga ! https://t.co/7ThZdjTHFL https://t.co/BkeGVGRUbb Lindo reencuentro con @santiagoarias13 de camino a 🇨🇴 para esta fecha eliminatoria. ✈️✈️✈️ #VamosMiSelección \nhttps://t.co/rJYaG40U5x Contento de volver a anotar y aportar así a la victoria del equipo.  Terminamos una gran semana con este triunfo.   https://t.co/49OyhW5RVl https://t.co/KZXcdGPhOb Nuestras oraciones por toda la familia @lulopilato @michaelbuble. Encontramos consuelo en Dios en los momentos dificiles. #fuerzaNoah ✌️Feliz de volver a representar el país. Afronto esta oportunidad con mucha ilusión. Un llamado muy especial.... https://t.co/ZX839MKdnc https://t.co/rMdXUh0dYw Hoy tuve el inmenso honor de conocer al maestro Botero. Una maravillosa cena. \nhttps://t.co/oy1uLdcHh3 You can see the photos @ChampionsLeague game. 📸 https://t.co/2MEuIthxsA En mi sitio web pueden ver algunas fotografías del partido de hoy. https://t.co/q787JhkpL0 https://t.co/LzWrLRdV26 ¡Goool! ⚽️👌🏻 gracias a Dios por esta noche.  Agradecer al equipo y a los jugadores ...  https://t.co/nRFNkHGOm8 Camino al estadio. A pocas horas del partido por @ChampionsLeague. #DagueMunegu https://t.co/wrvP1DAojv https://t.co/TlbISz4Qrn Ayer en la rueda de prensa. Todo listo para el partido de hoy. ¡Vamos equipo! Preparando el partido de @ChampionsLeague / Preparing Champions League match. https://t.co/cM56whmkQR @soy_xalo ¿cómo se llama ella? Tiene Twitter ? Saludos. RT @AS_Monaco: La préparation pour #ASMCSKA a commencé ! @ChampionsLeague https://t.co/aytG2LFNPZ Listos para el entrenamiento de este domingo. Que tengan un buen día. 💪 ☀️ / Ready for trainning today. Have a good day  💪 ☀️ Luchamos  por la victoria, no se consiguió. Punto importante. Ahora a preparar partido de Champions. https://t.co/fFEQkJ5toZ ¡Vamos equipo! A pocas horas del partido de hoy ante @ASSEofficiel . https://t.co/54skTQvM0v https://t.co/s7OYWu9Mbg Boa foto. Abraço a tudos os portistas https://t.co/5OhOAGxgGO Todos listos para la foto oficial. 📸 https://t.co/rn9lH3xdB0 https://t.co/8BhqGIJYBw Muchas gracias querida Marcela. Un fuerte abrazo. https://t.co/kjjDXGW2Fj Muchas gracias a todos por la participación en el Youtube Live. Mañana. subirán el video completo a https://t.co/BdXxrSL5TH Estoy en vivo. Respondo sus preguntas: https://t.co/IiqG8gUBnR En algunos momentos estaré en línea para que charlemos en mi nuevo sitio web https://t.co/Gu0mRXOLzk 😜 https://t.co/Z7WkYGUYBo Soleado día hoy en Mónaco. Entrenamiento con el equipo de cara al partido contra Saint Etienne el próximo sábado 💪 https://t.co/Rc2CMGFQFb Carlos Alberto, capitán de Brasil que siempre será recordado. Un abrazo a sus amigos y familiares en este momento. https://t.co/Q9XKNHEcLg Inicia una nueva semana. Con toda las ganas y actitud para preparar el partido ante Saint-Etienne y lo que viene. 👊🏽\nhttps://t.co/xr5CJIgbqj RT @crossthelinex_: \"Better is a moment spent with you God, than a million other days away.\" https://t.co/kickPqNEHS El gol que acaba de hacer las palmas @KPBofficial pura clase. Aprovecho el trino de Domi para agradecer a todos por el apoyo.  👍 https://t.co/BrsKQPiEkw I just realized that it was my daughter. She published her first tweet. 👧 https://t.co/k3k8R0aZT0 @Koke6 Kokiño, perdón. Fue Domi. 😂 👧 Me acabo de dar cuenta que mi hija de 3 años ya sabe tuitear. 😂 https://t.co/k3k8R0aZT0 RT @FALCAO: @Koke6 hhhfjujfjznkkxioopññññjxbjgjjfufuxuubbjzhhjjzuxyuguujxjdudii @Koke6 hhhfjujfjznkkxioopññññjxbjgjjfufuxuubbjzhhjjzuxyuguujxjdudii Hey @loco13com !!! feliz cumple,  amigo. Un honor haber compartido contigo. Bendiciones en tu día 🎉 https://t.co/BdXxrSL5TH: Coming soon / Próximamente 💪 https://t.co/Kn67UF3KMf 🇨🇴 El Bobito. 🇲🇽 Torito, cascarita, gato. 🇪🇨 Torito.  🇵🇪 Camote. 🇦🇷 El Loco.   🇨🇱 Tontito.  🇵🇾 Jagua -i    🇨🇷 Monito    🇬🇹 Payasito loco  😂 @MwaangaMungelo Just fun in the training today. We called this activity in Colombia \"Bobito\" it means \"fool\"How do you call in your country? Me han llegado mensajes de toda América con el nombre que le dan en cada uno de los países al 'Bobito'.  😂 Un poco de diversión en el entrenamiento. 😅  En Colombia le decimos \"bobito\", ¿cómo en sus países ? vía @AS_Monaco https://t.co/y9olynDPEf El examen mostró una positiva evolución. Me siento muy bien y con muchas ganas. Cada vez más cerca de jugar.⚽️ https://t.co/hG60UocFh7 Con todas mis energías y concentración en el retorno a los entrenamientos con @AS_Monaco_ES . El balón es tu amigo 😏 https://t.co/OWcxU5dhNY Gooooooool Vamosssssss 🇨🇴 Hoy el Metropolitano debe ser una caldera 🔥con el apoyo de todos. Vamos Colombia por una victoria. 🇨🇴🇨🇴🇨🇴🇨🇴 https://t.co/ZdI7jNjEFU @fenix47452483 Gracias. Y muchas gracias por tus mensajes. Siempre los leo. Retorno a los entrenamientos con @AS_Monaco_ES 💪🏽 / back to the pitch 👊🏽 https://t.co/2FPfWx4fnp RT @AS_Monaco: \"Je me sens très bien\" Les images et impressions de @falcao de retour à l'entraînement avec le groupe ! https://t.co/EcFd53H… Para los que no se han despertado en Colombia  @JuanManSantos  gana @NobelPrize de  paz. https://t.co/mytFyk1ov0 #tbt acá les dejó un recuerdito previo al partido. ¡vamos Colombia! 🇨🇴💪🏽 \nhttps://t.co/zmFgmUcrD9 @javeri28 jaja. En qué zona. Acá con mi primera victoria en Pétanque ✌️️🙌🏼. ¿Esto se juega en Colombia? \nhttps://t.co/G3VELIDOs6 El único que no cambia eres tú, estas igual jejeje. Gratos  recuerdos de esa época en #MDF. https://t.co/FwuVD2n4zO https://t.co/BypxZsld9m  😍 Gracias Sambu @rubenssambueza por los dos pases. 😉😉 https://t.co/WZHR0UFAT7 11 años de: \"El pibe que no lo puedo creer, el pibe que no lo puede entender. El Pibe que piensa que está soñando\" https://t.co/PvSxy5CM8e Gran primer tiempo de @AS_Monaco_ES  / great first time @AS_Monaco   #DagueMunegu  👍 👊 Para pensarlo. https://t.co/kJxWHKZVcq Demain je te donne la revanche @benmendy23 😉\n  https://t.co/9tWRgjs2Ho Ante el momento decisivo que vive Colombia. 🇨🇴 👍 https://t.co/yMN3LYp1Y8 Me uno a las celebraciones. ¡Felicitaciones \n@CARPoficial!  #FelizDiaDelHinchaDeRiver 🎉 https://t.co/FCMP7263CN Admirable trabajo de @AS_Monaco_ES luchando hasta el final. Debemos continuar ltrabajando por la clasificación https://t.co/1BgknXRvJd RT @razaratev: Vale la pena creer en tan esperanzadora lectura de nuestro futuro. \n\n¡Gracias @FALCAO ! \n\nhttps://t.co/NeTRn8X5Oc Mucho fuerza y ánimo amigo @augusto12f.  Te deseo una pronta recuperación para verte nuevamente en las canchas. https://t.co/m4vfaBOCgt Gracias Crack. Haré una visita algún día. https://t.co/fcc7RcfOje I am right now in my house. I want to say thank you for the support. Especially God to keep me 👍🏽 Ya estoy en mi casa. Quiero agradecer a todos por preocuparse y principalmente a Dios por guardarme.  👍🏽 Todo listo para el clásico ante @ogcnice. Con el deseo de seguir en la parte alta de la tabla /Today we wish to be in the top of the league https://t.co/lO1gILnUoO Merci hahaha. https://t.co/eOhGP5C6qy Almuerzo con el equipo / Lunch time with the team. 🍜🍣 \nhttps://t.co/iZDHdYjZRA @jovimar4 Dile a Sebastían que deseo la mejor recuperación. Que siga las instrucciones médicas y  espero que vuelva pronto a las canchas Felicitaciones @Falcao12oficial por tu record como goleador histórico en copas del mundo de Futsal.¡Crack y leyenda! https://t.co/CVDyDFeIcg Mi primer gol en la liga. Jugamos ante un equipo muy sólido.  Nuestra escuadra supo enfrentar esta situación.  😏⚽️\nhttps://t.co/RK39iqNLZP Camino al estadio con las mejores expectativas para el partido. In my way to the stadium. With the best expectation https://t.co/itk0rdavW8 @jovimar4 ¿Cómo se llama? Valiosa victoria y gran trabajo de equipo ✌️ / Important victory and wonderful team work✌️ https://t.co/dGAWlv2kHA Gran victoria en wembley. https://t.co/GFDuO6mbhX Abrir la ventana y ver Wembley. Día de partido. #DagueMunegu ⚪️🔴 / Open the window and just here: Wembley, match day https://t.co/xVVRZCXcP5 Expectativa y confianza  para debut en Wembley ante @SpursOfficial  \nQuite confident about debut in Wembley tomorrow https://t.co/ggWU8sb09c Just a blind man can not see @D_Ospina1 great skills. Especially today. 😉 Coming soon. A website for all my friends around the world. https://t.co/BdXxrSL5TH https://t.co/7v3d15sZrV Próximamente un espacio para todos mis amigos alrededor del mundo: https://t.co/BdXxrSL5TH https://t.co/V9VmoPS1n2 Elle commence son premier jour d'école. https://t.co/6Mdqu34O63 ¡Muchas felicitaciones @NairoQuinCo y @estecharu!. Muy orgulloso de los colombianos en @lavuelta 🚴🏽 🚵🏽    🇨🇴 https://t.co/Nz73OLdyVv Muchas gracias a todos los hinchas por el apoyo. / Thank you to all fans for the support / Merci pour votre soutien. https://t.co/tmSMWw0s3L Gran trabajo en equipo el día de hoy. / Great team work today @AS_Monaco_ES ✌️\nhttps://t.co/x1XEuNaH0H Para que no olviden los horarios 😉 // Keep in mind. #DagheMunegu 🔴⚪️ https://t.co/3Wzp2NvcCW RT @CdelDeportista: .@FALCAO va a por todas esta temporada!! #CD #clubdeldeportista #CDlifestyle https://t.co/30AUDNgxTn Missing David Gardner in the photo 📸 https://t.co/diPGYzsfNC Trabajando nuevamente con el equipo / working again with the team 👌🏻 https://t.co/CHnRxDQeiF RT @AS_Monaco: ☕️ What else ? 😉\n\nFLOCAGE OFFERT ➡️ https://t.co/iiPe91CXF2 https://t.co/aYFhO2NQ5h Que lindo vídeo. Saludos... https://t.co/vhtP4bIfrG ¡Vamos Colombia! Apoyando siempre. Todos unidos por la victoria 🇨🇴🇨🇴🇨🇴🇨🇴🇨🇴 https://t.co/RwiBeEMlQN Goooooool ⚽️⚽️⚽️ @AS_Monaco_ES It was a pleasure to greet  @ThierryHenry  / un placer saludar a @ThierryHenry  👋👋 https://t.co/2nqvOpJte4 No lo dudo @bayer04_es https://t.co/mVwqB2QNze Nos enfrentaremos ante el  @SpursOfficial @PFCCSKA_en y @bayer04_es  en la @ChampionsLeague Bombo 4 @AS_Monaco .¿Contra quién nos tocará en la @ChampionsLeague 😁 / We are in pot 4. expectation 😁 https://t.co/m2VEny5LTb Oh Mónaco, lalalala 😝👏🏽👍🏽  https://t.co/FnAb8CqzGA 🎉 ¡Clasificamos a la  @ChampionsLeague  @AS_Monaco_ES¡ The championssssssss  🎵 🎵 🎵 https://t.co/L0Cgo6Fs1X \n🎉🎈🎉 Un fuerte abrazo @PibeValderramaP y a toda tu familia en estos momentos. RT @2010MisterChip: ¡¡¡ENHORABUENA @marianapajon #COL!!! Eres la PRIMERA MUJER SUDAMERICANA CON DOS OROS EN PRUEBAS INDIVIDUALES EN TODA LA… ¡Felicitaciones! @marianapajon. Que orgullo. Muchas gracias. No hay nada más que decir. #Oro #Rio2016 #BMX https://t.co/evTb62wkFD Felicitaciones! @RamirezBmx por el #Bronce Gracias por tu trabajo @oquendobmx. Que orgullo y demostración de talento https://t.co/4gQuGDvcal Grande @RamirezBmx ganando el bronce, muchas gracias hermano. RT @TinoasprillaH: @marianapajon es la Usain Bolt del deporte de @LasBielas https://t.co/bx1o21o4F5 Siiiiiii @marianapajon  Campeona olímpica. Don Omar Sivori el primero de derecha a izquierda. https://t.co/LtgkafhydA Buen resultado para nuestras aspiraciones. Sin embargo, no debemos confiarnos. ¡Gran partido partido equipo!   🔴⚪️\n\nhttps://t.co/hrqwT5DqyV Gooooooool !!! Dague Munegu. #DagheMunegu 🇮🇩 🔴⚪️ ¡Vamos Mónaco!. Go Monaco Go.  https://t.co/qb8pqklsnX Paper rule. https://t.co/MKaRpSZWpD RT @mario_sabato: Repito: El reglamento? Bien, gracias... https://t.co/mejGCwa6Nv @joacopinzon claro que soy yo. Qué pasó con las reglas @UCI_cycling. Solo en los libros porque en la realidad no importa. @BrianCooksonUCI. @BritishCycling #Oro? #Rio2016 What happened with rules  @UCI_cycling. Just in books...in the track it doesn't matter. @BrianCooksonUCI. @BritishCycling #Gold? #Rio2016 Mis mejores deseos para lo que viene @sebasmorales94 #Clavados  y @CeiberDavid   #Boxeo . Hoy mostraron su potencial y talento. ¡Vamos! Muchas gracias @FndoGaviria por tremendo esfuerzo. Toda Colombia orgullosa de tu trabajo. https://t.co/TA2YS1VaAz RT @UranRigoberto: El regalo mas grande para nuestros medallistas Olímpicos es una buena casa. \"No casita\" Jesus di it @WaydeDreamer. Congratulations. https://t.co/XDSyrz4Lqu Aún me da vueltas en la cabeza la caída de Sergio Henao. Deseo una pronta recuperación para él. Siempre hay una revancha 💪 ¡Vamos  @FndoGaviria!. ¡Vamos que sí se puede! #Olympics Gracias @tripleCIbarguen. Tu sonrisa une a todo el país.  Felicitaciones por el #oro https://t.co/z0W3htTfsG ¡Gracias #YuberjenMartinez por dejar el nombre de Colombia en alto! Felicitaciones por tu medalla de  #plata   👊 👊 👊 https://t.co/SBm6SIZhvr Hace tres años llegaste a nuestras vidas para cambiarla para siempre. Te amo mi pequeña Dominique ❤️ https://t.co/f5TIZ86bet Felicitaciones @alvear_yuri por tu medalla de #Plata. @JossimarCalvo hacienda historia . ¡Que orgullo! 🇨🇴 https://t.co/hEGT2CFEiY Felicitaciones @FigueroaM27 por el #Oro. 22 años de trabajo dan su fruto. Nos enseñas qué es caer y levantarse. #COL https://t.co/NcElty20NH Feliz cumple @carlosvives. 🎉.Te deseo lo mejor y muchas bendiciones. Dios te de muchos años más de vida para que disfrutemos tu música 🎂 - @VillarrealCF our rival in our way to @ChampionsLeague.The first match: August 17th. 😏 Listo el rival camino a la @ChampionsLeague:  @VillarrealCF.  El primer partido será el será el 17 de agosto. 😉 https://t.co/wAACNFaIv5 Congratulations on your testimonial Wazza!!! #Legend @WayneRooney https://t.co/j5uyBJWXHF Muchas gracias amigo,éxitos esta temporada. abrazo grande. https://t.co/GayEdOtqvm ¡Logramos la clasificación! Un muy buen trabajo de todo el equipo.  👊👊\nhttps://t.co/AChbFhY52z RT @AS_Monaco: Madjer ou ciseau ❓ Pelé ou Maradona ❓ @PibeValderramaP ou @carlosvives❓ (...)  Interview dilemme avec @falcao ! 👍\nhttps://t.… Merci mes amis. https://t.co/vmGTFeHh1W Resultado no fue lo que esperábamos. Queda partido de vuelta en nuestra casa, tenemos confianza en nuestro trabajo. https://t.co/KQPPPVHbIE Felicitaciones @nacionaloficial por poner al fútbol colombiano en lo más alto del continente. Premio a un trabajo institucional muy grande 👍 We are in our way to @ChampionsLeague. @AS_Monaco AS_Monaco vs @Fenerbahce. ⏰21:30 Estambul🇹🇷 1:30 🇨🇴  20:30 🇲🇨🇫🇷 19:30 🇬🇧 👍🏽👍🏽👍🏽 Iniciamos camino para clasificar  a @ChampionsLeague ante @Fenerbahce. ⏰21:30 hora de Estambul🇹🇷 1:30 🇨🇴  20:30 🇲🇨🇫🇷 19:30 🇬🇧 RT @AS_Monaco_ES: 🛬 Los jugadores Rojiblancos ya están en Estambul ! https://t.co/OUwnF08FhG @barajas1002 Guillermo, un abrazo. @ParcerosdFalcao eso espero. @nikolasrobledo 😆😆😆 @alexacif A través de tu mamá te saludo Sebastian.Te deseo lo mejor en Lanús. Con disciplina y dedicación lograrás tus sueños. Bendiciones. @Mengaana Gracias Chica Cocodrilo. ¡Miércoles! Está frío esto 😁😁😁❄. Solo estaba a - 111 grados en la crioterapia☃ https://t.co/NT9TIhrBua Monaco new away kit using virtual reality !  😛 📽 https://t.co/dGy1uck8vN Acá el video completo de la nueva camiseta del @AS_Monaco. En 360 😛📽https://t.co/dGy1uck8vN La segunda camiseta del @asmonaco. Linda ¿no? 👌🏻 / The new away kit 2016/2017. Beautiful, don't you think?  https://t.co/RrmnD4YE3q Muchas gracias Duvan por tu esfuerzo por hacer este video. Me siento muy honrado. Dios te bendiga. https://t.co/M07i1YlsIM @alexacif  ¿Cómo se llama? @JOTAPE14_G gracias Juan Pablo, ese gif está muy chévere. @JuanDavid_NB sí leo. Saludos. @jaimevengoechea apenas me instale y tenga el ps4 👍 Como que no? Claro que si los he visto. Gracias por el cariño. https://t.co/dhi71Zx55L Muy tiernos los dos, la próxima vez hasta el final. https://t.co/TnHtZdSNmW #tbt cena con los mejores compañeros de colegio que pude tener // Dinner with  best classmates I could have. https://t.co/hBTIu6Ystv Lo hago muy a menudo, saludos. https://t.co/7HXQcKOOWY #tbt  princess birthday ❤️😍😘⛵️ https://t.co/nyJpS2i84B RT @NBATV: In honor of Ray Allen's birthday, relive his epic shot!\nhttps://t.co/8lpDsdtHnI 🇨🇴🇨🇴 Orgullosamente colombiano. Feliz Día de la Independencia. 🇨🇴🇨🇴 https://t.co/qLpF0bNMhy The pre-season in Switzerland    has been positive. We are very excited about the future. https://t.co/5JtArZdAZD La preparación en Suiza 🇨🇭 ha sido positiva. Estamos muy ilusionados para el futuro 🔴⚪️  https://t.co/ScbVYC8E42 RT @AS_Monaco_ES: .@FALCAO  : \"Yo sé a donde quiero llegar...\"\nRegistrate gratis para ver el vídeo completo: https://t.co/S2APrb1Tqo https:… Congratulations @jarlinsonpantan. You show us courage and commitment in @LeTour 🙌 👏 🙌 👏 🙌 👏 ¡Felicitaciones @jarlinsonpantan! Que demostración de valentía y esfuerzo en @LeTour  👏 👏 👏 👏 👏 👏 💪💪💪 RT @AS_Monaco: L'image du match. 🙏 ♥️\n\n#NousSommesNice #NousSommesUnis https://t.co/mtxQP90TDX My thoughts and prayers are with the victims in Nice and the people of France. Mis pensamientos y condolencias con el pueblo francés por lo que acabó de ocurrir en Niza. Lindo poder encontrarse con amigos del fútbol @TeoG29 muchos éxitos esta temporada. https://t.co/2JDMmXPJ8C We are getting better with every game @AS_Monaco. A good result today. https://t.co/ktjhglg46r El juego de @AS_Monaco va mejorando partido a partido. Feliz por el buen resultado  hoy ante @Sporting_CP https://t.co/z2lUz55rgX Inspirada en la velocidad / culture of speed. 👌👌 https://t.co/V5oTbGfBL1 👊🏽 Never give up. Work hard. Step by step. You can go anywhere. 👊🏽 https://t.co/mvJ61ArjWE Nunca te rindas. No abandones. Trabaja  fuerte.  Paso a paso y llegarás lejos. 👊🏽\nhttps://t.co/mvJ61ArjWE Todo muy bien pollo,gracias por preguntar,Espero nos crucemos pronto.abrazo grande https://t.co/a7yAsC5cCT Working hard in the pre-season second week. https://t.co/3ymZ0TKy9O https://t.co/gwLseiGjef Una pronta recuperación @10yorelirincon. ¡Nunca te rindas!. Siempre hay una nueva oportunidad. Bendiciones. Así va la segunda fase de pretemporada. Trabajando fuerte. 👊👊 😓💦 💪 https://t.co/3ymZ0TKy9O https://t.co/GzeVbwjaRF C'est magnifique. Camino a la estación Verbier. On my way to Verbier  🚠 🏔 https://t.co/7RhtsqheZO vía @AS_Monaco_ES https://t.co/gzNPOd6tt4 Congratulations Portugal. Parabens!!! https://t.co/SEfomYUZXw @RiverLPM  hay que alentar al equipo del muñe. Abrazo Luego del ⚽️ a 💤👁👁 https://t.co/EpVGNSJkSS https://t.co/JJIsNoYBdv \neguimos en pretemporada preparándonos fuerte para lo que viene / we are in preseason working hard. 👊👊 Seguimos en preparación de pretemporada. Hoy jugamos ante SC Kriens. / We played against SC Kriens in preseason game https://t.co/V7518m9OyG Muy contento de volver anotar en el partido de pretemporada.  @AS_Monaco vs @FCLugano1908 . 👍🏽  https://t.co/FyxaihvigC ⚽️⚽️⚽️⚽️ Colombia and FARC rebels agree on cease-fire, disarmament in country's 52-year war.  My generation has a new task: create a new Colombia.🇨🇴 🇨🇴🇨🇴 Gracias Dios por el fin a 52 años de guerra. Todos, en especial mi generación, somos responsables de construir la nueva Colombia. 🇨🇴🇨🇴 Muy orgulloso por todo lo que ha hecho mi equipo. ¡Vamos mi selección Colombia!  Vamos por la victoria.  👊 👊  👊 https://t.co/zGL12PMN5S Tuve el placer de hacer el primer lanzamiento en el partido de los @marlins contra los @rockies en el @marlinspark.  https://t.co/o2K0nspB7e ¡Vamos mi selección Colombia! ¡Vamos mi equipo! Vamos por la clasificación. https://t.co/8QZcpVV3At RT @PeterManjarres: Buena charla esta tarde en miami Con un buen ser humano y orgullo del fútbol colombiano @falcao https://t.co/IFpKHtEXXp Training with @JUANPABLOANGEL Nowadays, I have been training and learning with Juan Pablo https://t.co/Ribca0x02P   👊👊👊 Entrenamiento y aprendizaje con @JUANPABLOANGEL 👊💪 https://t.co/Ribca0x02P On June 24th I will start the pre-season with @asmonaco. I am excited and committed with the beginning of the trainings with the club. Próximo 24 de junio iniciaré entrenamientos con @AS_Monaco Emocionado y comprometido con inicio de la pretemporada. https://t.co/j4MhZwKX2E Gracias Dios por la bendición de la familia. @loreleitaron #Domi #Desi https://t.co/TFNqUD3fpZ Vamos todos por la clasificación. ¡Vamos Colombia!  🇨🇴 ⚽️🇨🇴⚽️ 🇨🇴⚽️ 🇨🇴 https://t.co/EtbXBIPSk6 Los mejores deseos para @FCFSeleccionCol. Éxitos en @CA2016. ¡Vamos todos juntos¡!Vamos mi Colombia! 🇨🇴 #CopaAmerica https://t.co/8uvzU2Aao1 Wuuuuuu 🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼 @WaltDisneyWorld, #JuntosenDisney, #DisneyFamilia, #AnimalKingdom  https://t.co/0MCJKrz78o Gran tiempo con las chicas😎@WaltDisneyWorld #JuntosenDisney #DisneyFamilia  #AnimalKingdom Great time with my girls https://t.co/vUkMZZi3YQ RT @claudiofreidzon: No renuncies a lo que Dios te prometió  en su Palabra. El torna los imposibles en posibles por el poder de su Palabra. Preguntas ? #FalcaoLive https://t.co/mwrjc1AGLD ¿Quieren preguntar algo? Usemos el tag #FalcaoLive. :D Friends around the world. If you like to ask me. Please join me. my new youtube Channel https://t.co/mwrjc1AGLD #FalcaoLive Amigos: Estoy en vivo y en directo. Pueden hacerme las preguntas que quieran. #FalcaoLIVE ¡Compartan! https://t.co/mwrjc1AGLD Me alegra ver que ese amor de colegio se sigue manteniendo. @BarretoJenn @HRestrepo  https://t.co/xhLjdzYAiE Gracias por tu amabilidad y permitirnos disfrutar un agradable momento. La próxima me pongo la de La Dolfina. https://t.co/bjh5asV0W8 Training day before @spursofficial game. We are focused in a victory ⚽️👍🏽.Todo el equipo concentrado en una victoria https://t.co/q2cQqjYM0r @LMatthaeus10 @PUMA @ThierryHenry @cesc4official really great day. Nice to see you friends. ✌🏼️ https://t.co/tHYy7RKB3x RT @FourFourTwo: Question of the day... what's @FALCAO's favourite emoji? 😎 Follow us on @Snapchat 👻 for more... fourfourtwouk https://t.co… RT @pumafootball: All that sound. All that speed. @FALCAO #CHOOSETRICKS https://t.co/wcActotpZu EN DIRECTO en #Periscope: Hola. Mi primer periscope 🤗 / my first Periscope https://t.co/qaGr8KKCzD My pray and solidarity for the people who was affected in the earthquake in #Pedernales, Ecuador. Mi solidaridad y oraciones por las personas afectadas por el sismo en Ecuador. Sobre todo por los habitantes de #Pedernales. Remate y gol ¯\\_(ツ)_/¯ ⚽️ https://t.co/58itWVxxSj / Shot and goal. Training before @MCFC game. Con esta app puedo seguir lo que pasa en los partidos de las ligas que sigo. https://t.co/Gr2lPPPXq3 https://t.co/W4n9vr7aEX I have set up my favourite teams on #ProScores.  Looks like a great app; check it out https://t.co/Gr2lPPPXq3 https://t.co/7IF4AMx6IP Siempre quedarán en nuestra memoria las narraciones de Édgar Perea. Un abrazo a sus hijos, familia y amigos. https://t.co/JS3xYkNes0 The score is not what we expected. Excellent support of all the fans. I am really happy to return to the pitch. https://t.co/qzwWeiM2Vh Resultado del partido no fue lo que esperábamos. Excelente apoyo de hinchas. Muy contento de volver a las canchas.👍💪 https://t.co/7CKrNPKqwy Gracias @saulniguez por tus buenos deseos. Estoy muy feliz y motivado por el retorno. Igualmente, te deseo lo mejor para lo que viene. 👍👍 Lindo día de entrenamiento con el equipo / Beautiful training day with @chelseafc before @SwansOfficial game. 🙌🏼🙌🏼🙌🏼 https://t.co/oJlZ03sJTr Control. ⚽️ entrenamiento previo al partido ante @AVFCOfficial . Training day before Aston Villla Game 👍🏽 https://t.co/PVAfn1hPpj Para resaltar el trabajo de la @FCSeleccionCol  mayor y sub 23. Opiniones sobre el tema:  https://t.co/iI72bFf7Q8 Epa!!! Así será ,Muchas gracias por el apoyo. Saludos https://t.co/ycjeOAXfWN No creo que sea por qué se aumentan los gastos ,no? https://t.co/7kJP5jVkqB Listos y en formación con @carlosvives  ¡vamos Colombia! ⚽️⚽️⚽️ https://t.co/VBkHK2gli7 ¡Vamos Colombia! Todos unidos podemos. ¡Sí se puede! https://t.co/M0iFzv0e3R - @pumafootball Evospeed. son ligeros = rapidez ⚽️ //  The Evospeed are light... it means you are faster.\n\n https://t.co/CEa6owwdac ⚽️⚽️ No me molesta. Siempre serás bienvenido. Abrazo 👍🏻 https://t.co/AGZgWv2iB9 Entrenando. En casa haciendo ejercicios de fortalecimiento. Training in my house...strengthening exercises✌(◕‿-)✌ https://t.co/VxjGGudc1C Jesus remember us we can pass trough the grief and lost of our live. His resurrection is our hope\n💒💪🏽 #CrossEqualsLove Jesús nos recuerda que podemos pasar por el dolor y las derrotas de la vida. Su resurrección es una esperanza. 💒 https://t.co/EKG80MCSdY Little walk #towerbridge https://t.co/mdVQ9RyD6P Terminando entrenamiento. Bellísimo día hoy en Londres. // Beautiful day in London at the end of the training day.  https://t.co/DBdAjrKXio Bueno,a dormir contento con la victoria de mi selección.Abrazo de gol al minuto 92' #CostumbresColombianas Importantísima victoria para nuestro camino al Mundial. ¡Vamos @FCFSeleccionCol! ¡Vamos Colombiaaaaaaaaaaa! https://t.co/fu6d0uXSdP We always will remember @JohanCruyff as a real legend. (1947-2016) https://t.co/8BcjKCc1ay Siempre recordaremos a @JohanCruyff como un verdadero crack. Una verdadera leyenda. https://t.co/0DwosYwM04 #RIP  Legend. https://t.co/5zq7sOHfwC My thoughts and pray for Belgium people and victims of irrational attack.  #PrayForTheWorld https://t.co/0MtLSt0dKR Mi pensamiento y oraciones por el pueblo belga y las víctimas de este irracional atentado. #PrayForTheWorld. https://t.co/VeGmM5hptH Esta mañana: trabajo de definición ⚽️⚽️⚽️⚽️ / Today in the morning at Cobham. https://t.co/aA1OlrOhkf ¡Vamos @CARPoficial!. Esta tarde cueste lo que cueste !!! Vamos River ! https://t.co/uzGoeziBWn - @FndoGaviria won  a gold medal in the Track World Championships, here in London.🇨🇴 🇬🇧 🇨🇴 🇬🇧 Congratulations. https://t.co/odalBAzxym Felicitaciones @fndogaviria. Somos campeones mundiales de Ómnium otra vez. 🇨🇴🇬🇧🇨🇴🇬🇧 https://t.co/4bSJzsebMh Training day at Cobham. 🌞🌥 https://t.co/Sol3AiikNQ Día de entrenamiento en Cobham 🌞 https://t.co/PeGcCwBkti Jerónimo needs a special treatment to fight against cancer. You can donate. https://t.co/nLFsTLmDuy #LetsGoJero https://t.co/IGdXgDMkx8 Donemos.Jerónimo necesita un tratamiento especial en su lucha contra el cáncer. https://t.co/DqR55faG8l #LetsGoJero https://t.co/ZXGEbDQWLU ¿Quién dijo que en Londres no sale el sol? 😜 https://t.co/gXxRxuood4 ¡Gran partido hoy¡ Felicitaciones al equipo. Gran trabajo ⚽️ /// Great game today! Congratulations team. Great job. https://t.co/kg0vOBjOi7 @OficialMeireles thank you bro. God bless you ! Thank you bro @ArdaTuran big hug Por acá de celebración 🎈🎉😜 https://t.co/MEdP7SU9Ft // it's happy birthday time. Thank your for the message for my birthday. God bless you. 🎉🎈🎉🎈 Muchas gracias por los mensajes que me han enviado el día de hoy por mi cumple. 🎈🎉Dios los bendiga Oye @carlosvives para cuando #lafiestadeTodos en Londres.  Acá tu público quiere escucharte. Gracias por el cariño a través de sus mensajes. Es lindo recibir el apoyo de todos. @carlosvives gracias ! 👍 👍 👍 👍 @scottnicholls no. I was talking about my injury two years ago. I focus in one thing: forgetting the past and looking forward to what lies ahead. Philippians 3:13 √ Una cosa hago: me olvido de lo que ha quedado atrás. Me extiendo hacia lo que está adelante y lo que vendrá. Filipenses 3:13 RT @AlejoCSanchez: @FALCAO Leonidas, Fabian Diaz, Rafa Robayo: Leo Gonzalez, Carlos Tinjaca,Maricio Collazos, Oscar Morera, Stalin Motta y … @AlejoCSanchez Te falta Abel y John Sandoval. jajaa muy bien @Angtycy A ver qué tanto saben de la historia 😜 Identifiquen los personajes de esta foto: https://t.co/YsqeyRBGs2 #TBT #graciasYepes, #GraciasCapitán. Yepes: muchas bendiciones en esta nueva etapa https://t.co/cCls3wnwGf Always  fighting. Always with clear goals. 👍🏽⚽️ https://t.co/dpp3IQd3DY Siempre luchando. Siempre con las metas claras. 💪🏽✌🏼️ \n\nhttps://t.co/dpp3IQd3DY What a game. I am very proud of the team. We must keep fighting https://t.co/77OBjsJM4n 💪🏽⚽️ go, chelseaaaa, Go ! Que partidazo!! Gran esfuerzo del equipo. Debemos seguir luchando. 💪🏽💪🏽https://t.co/77OBjsJM4n @Ivo_Caicedo wow @TOTTI_22 Gracias Yesid. Cae la tarde acá en Londres. Ya casi es de noche. 😏. Bonito no ? https://t.co/vog4Jc8WZZ Oye @bernardo_ez mucha fe y ánimo. Pronto estarás en la canchas nuevamente. Te deseo una buena recuperación. Quiero agradecer a @juandeariza07. Sin su trabajo no hubiera sido posible la cancha acuática en la Ciénaga. https://t.co/CbuZZL6Mr9 They are enjoying the sport complex built over water. Thank you @Hublot and all the people who support this project. https://t.co/Wej5tN9HrI Gracias a @Hublot y a todos los que hicieron posible este proyecto.👍👍  https://t.co/7VexGHwuG1 Muy contento porque ya es una realidad  el complejo acuático deportivo para los niños en la ciénaga del Magdalena. https://t.co/A55plyCp0B Acompaño y aliento a Jefferson Herrera y su familia en estos momentos. Mis oraciones para él. https://t.co/EhFqJY16mo #FuerzaJefferson Gran victoria hoy. Felicitaciones al equipo /// Great victory today https://t.co/a6vhzLn376 🌧 https://t.co/HJLanVkVS8 Vamos Chelsea !!!! 🙌🏼 /// come on Chelsea #CFC  ⚽️⚽️ https://t.co/vYJUWN3B1F Happy new year: a message for my followers: https://t.co/FJX9GS0Yl0 ¡Feliz año para todos! Un mensaje para todos mis seguidores: https://t.co/GpQ8b5bgYE Following the last match of the year in Liga Española. Quite interesting! https://t.co/jTmvjLy95I ⚽️⚽️⚽️⚽️ Siguiendo la última jornada de la Liga Española. ¡Parece muy interesante! https://t.co/jTmvjLy95I⚽️⚽️⚽️⚽️ https://t.co/qcqhXvaUFz @Chelsea_HQ thank you. I am working hard in my total recovery. @cnataly23 feliz cumple ! @IngDoubleShots gracias Iván. Saludo. Feliz año. if you have doubts... I am reading my social media accounts 👁 https://t.co/6mUzhDAtTd Miren: yo sí leo lo que me escriben en redes sociales. https://t.co/6mUzhDAtTd Today training at Stamford Bridge. We are ready for tomorrow ⚽️🗣 https://t.co/QBXGedbfFZ El entrenamiento de hoy es en Stamford Bridge. Preparándonos para el partido de mañana ante el Watford  https://t.co/QBXGedbfFZ Merry Christmas around the world. :)  https://t.co/kmLCBXYpuH ¡Una feliz navidad para todos! https://t.co/1cBLVLsiIx Training day before Watford game 💪🏽⚽️ https://t.co/o5wAUeZBqx Día de entrenamiento antes del partido ante Watford. #CFC https://t.co/4D3QqngiCj Un saludo a @eldoctorpelaez a propósito de su último programa de #ElPulsodelFutbol. Los mejores deseos para lo que viene.  👍 RT @Hublot: .@Hublot @UNODC and @FALCAO provided a sports centre and a fish storage for the wetland community in Colombia https://t.co/vAWE… @theojose1 Thank you James. Todos los colombianos rodeamos con afecto y  mucho cariño a @gutierrezary. Training session at Cobham with Guus Hiddink on the pitch 💪🏽 https://t.co/7vvM4rHkb0 Día de entrenamiento en Cobham. Trabajando duro con la presencia de Guus Hiddink.💪🏽 https://t.co/7vvM4rHkb0 Vamos River!!! Listo para alentar al millo https://t.co/GBqGckrrgW @ChelseaFansCol gracias, un saludo para todos ✌🏼️ RT @2010MisterChip: Más temporadas marcando 10+ goles en competiciones europeas:\n[5] CRISTIANO\n[3] Messi\n[2] Heynckes, Jardel, Rivaldo, Van… @askomartin 👍🏽👍🏽 Training today ⚽️💪🏼 https://t.co/woLgrmxBaB Esta mañana en el entrenamiento https://t.co/woLgrmxBaB ¡Vamos @ChelseaFC por la victoria! ⚽️ /// Game day, Come on @ChelseaFC ! #UCl #Chelsea https://t.co/2juD34rGyO I am very happy to train again with the team. I am sure I will back strong.  ✌️https://t.co/cf19t88HY6 Estoy muy feliz de volver a los entrenamientos  ✌️\n\n https://t.co/cf19t88HY6 Mi día favorito será el Blue Day By BBVA, así que todos preparados este 20 de noviembre. Entra a https://t.co/2eCTU6nDLa Mis pensamientos y oraciones con París / My thoughts and prayers are with Paris https://t.co/LEKGWRjQB2 Empieza una nueva etapa con el nuevo Gatorade sabor Naranja, aquí no existen los límites. Pruébalo tú también.  #GanaDesdeAdentro Today we're going to play for the Champions League.\nHoy jugamos por la Champions League. Vamos @ChelseaFC https://t.co/f7lZsxMpKm A tu manera, es tener unas tarjetas para aprovecharlas como siempre has querido. Conoce más en http://t.co/2eCTU6nDLa  #ATuManera #BBVA De vuelta a las victorias. Back to winning. Well done guys! @ChelseaFC http://t.co/IE5be8zbFK The Premier League is back in action. Follow the matches live on http://t.co/eFB0AjMKlx Great win for the Capital One Cup.Thanks for the support/Buena victoria por la Copa Capital One.Gracias por el apoyo. http://t.co/DDUEhqBs7C Mucha fuerza @LukeShaw23.Deseo que tengas una buena y rápida recuperación/Stay strong. All the best and recover soon. http://t.co/F2x8QWC57Y Mañana vuelve la Champions League. Vamos @chelseafc / Tomorrow Champions League is back. Vamos @chelseafc http://t.co/a8G4u8QXGE Vuelve la premier, listo para el partido de hoy.\nPremier is back, ready for today's match. http://t.co/wwUkzdDWFd Traveling with @diegocosta to Liverpool for tomorrow's match. http://t.co/xXIUZsDzPW Viajando a Liverpool para el partido de mañana junto a @diegocosta http://t.co/cF3Nk7ytlo RT @JUANPABLOANGEL: Cenando con uno de nuestros más grandes embajadores en el Mundo @FALCAO #TopMan #9 @CARPoficial @FCFSeleccionCol http:/… Buena semana de entrenamiento ya preparados para el proximo partido/Good week of training/preparation for next match http://t.co/jqcvdMJj6s @higuitarene un verdadero placer poder conversar contigo. Te deseo muchos éxitos en esta temporada. RT @higuitarene: Con el TIGRE @FALCAO  en Londres! http://t.co/aZGQS0m7D0 Dos años ya desde que llegaste a nuestras vidas para llenarlas de felicidad,eres el mejor regalo que… https://t.co/L8Xh5urEXL Felicitaciones a los hinchas de River,jugadores y cuerpo técnico,por consagrarse campeones de América #ElMasGrande http://t.co/NIJjAEHnL3 Buen momento en el entrenamiento de hoy con @cesc4official / Great moment in today's training with @cesc4official http://t.co/I31DQlHg1m Good result yesterday against Barcelona. Next game is on Sunday against Arsenal. Let’s go @ChelseaFC http://t.co/DqZLEQDf67 Bueno resultado ayer contra Barcelona. Proximo partido el Domingo contra Arsenal. Vamos @ChelseaFC http://t.co/VskKPIYNZP We're about to leave to Washington to play the last match of the pre-season against Barcelona. http://t.co/yRDchU0s9f Estamos por despegar para Washington y cumplir con nuestro último partido de pretemporada contra el Barcelona. http://t.co/rAsRZaZEue RT @HRestrepo: Después de ver este video, no voy a volver a textear mientras conduzco jamás!\n\nhttps://t.co/xkOv1bIAKm Great feeling in my first match with the team that did a great job. Go @ChelseaFC! http://t.co/NOZZomoLpq Buenas sensaciones en el primer partido con el equipo que hizo un buen trabajo. Vamos @ChelseaFC http://t.co/zQjMfQ0uQT Nairo gracias por hacernos vibrar a todos los colombianos.Este año no pudo ser,pero cada vez estas mas cerca,pronto serás el rey del #Tour. Después de entreno en Montreal con mis Panitas @cuadrado y @willianborges88 // in Montreal after… https://t.co/zKmpkcNBwC Happy to join the team and start working with my new teammates at @chelseafc. http://t.co/qY18ea7wrh Feliz de unirme al equipo y empezar a trabajar con mis nuevos compañeros de equipo en @ChelseaFC. http://t.co/mfTns4UVub Estas son las muestras de apoyo que me llevan a seguir siempre adelante. Gracias #Colombia, gracias @bbva_colombia.\nhttps://t.co/GqxVWHQapQ Gracias por la atención en estos días @Disney mi familia y yo disfrutamos mucho. http://t.co/GWJKK5V7un RT @DisneyNewsLA: El reconocido jugador de fútbol Radamel @Falcao nos compartió su #LadoDisney en su reciente visita a @WaltDisneyWorld htt… Muchas gracias por los buenos deseos. Saludo a toda la banda millonaria. https://t.co/5rMokCRwdo RT @ChelseaFC: Radamel @Falcao will wear the No.9 shirt during the 2015/16 campaign.... http://t.co/zfWwzyDzJM En vacaciones disfrutando con mi familia un delicioso almuerzo de @spoleto_co muchas gracias por la amabilidad!!! http://t.co/4yxN0cE4ke RT @UKinColombia: Delighted that @FALCAO is returning to the UK's @premierleague to play for @ChelseaFC #SportisGREAT @jeffglekin http://t.… RT @venezuelaaldia: Muguruza vence a la polaca Radwanksa y entra en la final de Wimbledon http://t.co/9neEJEgo7j http://t.co/0Lpwch6eGM Very happy to join Chelsea and help us look to retain the league title and be successful in Europe. https://t.co/AiFYKLZiHJ Estoy muy feliz de unirme a Chelsea y no veo la hora de luchar por el título de la premier y tener éxito en Europa. https://t.co/AiFYKLZiHJ ¿Ya conocen la #EstrategiaGanadoraBBVA de 'El Profe' Durán y @BBVA_Colombia? Síganla para poder ganar. Mi esposa @loreleitaron ya les puso la camiseta a #Domi y #Desi para alentar a Colombia. https://t.co/4Ke7sPVKa9 Ready for the quarter final with my new @PUMAFootball #evoSPEED. Vamos Colombia! http://t.co/yppukMPERX Listo para los cuartos de final con mis nuevas @PUMAFootball #evoSPEED, Vamos Colombia! http://t.co/g0VO5hyqoQ \"Cuando cruces las aguas,yo estaré contigo;cuando cruces los ríos...\" Isaias 43:2 Jesus esta contigo. http://t.co/Dss871QA7M Es bonito regresar a jugar con la #tricolor y contar con el apoyo de tantos. Gracias @BBVA_Colombia  http://t.co/7GoCgxZquL No esta muerto el que lucha. Gracias Dios por la victoria y el gran trabajo de todo el equipo. Vamos… https://t.co/ns7ayhP1nz Vamos Colombia!!! Unidos somos mas fuertes. http://t.co/292NQxzCqK Feliz cumpleaños amor, Dios te bendiga y te de muchos años de vida @LoreleiTaron http://t.co/J4lSkAeVpx Thank you @aditya_reds for the beautiful video of my moments in @ManUtd Gracias amigo @J_MOfficial .  https://t.co/5K5Pozaw3r RT @juanpabloraba: Y ya que tivimos tantas alegrias futboleras Acà  la espalda de un paisano que me encotrè @PibeValderramaP @FALCAO http:/… Gloria a Dios por la victoria de hoy.seguimos creciendo como equipo. Vamos Colombia, siempre unidos!!! http://t.co/7eTuXarELQ RT @santiagoarias13: Argentina ✈️. e.cardona10 @pedrocfranco @DawAndrade @cristianboni1 13alexmejia @kmilovargas12 @falcao… https://t.co/7x… I really enjoyed to see your skills every day, thank you and all the best for your career. https://t.co/x2c4MBxqxY Thanks bro for all, I enjoyed it as well . God bless you. https://t.co/lQfsHFqIJF I wanna thank to all @ManUtd fans for all the gestures of support you gave me. I'll never forget it! http://t.co/VVHKC3zQ16 Quiero agradecerle a los Fans de @ManUtd por todos los gestos de apoyo que me dieron siempre. Nunca los olvidare!! http://t.co/OC2NuTBWOB Pues si que tiene buena pinta... Me la descargaré! #ProScore http://t.co/5CVN0e0uob Wow, vaya final de temporada en La Liga @juanmata8, donde estas siguiendo los resultados ? Guauu!!! Muy bien le quedo el corte. Saludos Juanes  https://t.co/8DIW1yicVo Los cambios no son fáciles,Pero hay momentos en que hay que hacerlo.Atrévete!! @UranRigoberto hágase el corte bien. http://t.co/U6AZbUVHqB Merecidas felicitaciones a mis compañeros @D_DeGea y @juanmata8 por sus premios como mejor jugador del año y gol del año de @ManUtd #Repost @loreleitaron with repostapp.\n・・・por fin te di el gusto...\nNuevo look #newstyle #mybaby… https://t.co/9zI1e1xcDI RT @AnderHerrera: With @FALCAO , what a new look !! #mufcpoty @ManUtd http://t.co/W5zwElviei Mis condolencias y solidaridad con las familias de las víctimas y habitantes de #Salgar - Antioquia. Thank you so much for the incredible support of the @ManUtd fans all season. Unforgettable. http://t.co/ISWzTcop3F http://t.co/KPY24HVxGl Muchas gracias por el increíble apoyo de la afición de @ManUtd durante toda la temporada. Inolvidable. http://t.co/D1cWTJRoV2 Para todas las madres mis mejores deseos en este día, doy gracias a Dios por sus vidas, en especial a mi mama y a mi esposa @LoreleiTaron Gran trabajo en equipo para conseguir una victoria importante. / Great team work to get an important win. http://t.co/2JtkIgXdvu Elkin no estas solo,toda Colombia te acompaña y desea que superes esta adversidad. Te queremos mucho!!! #FuerzaSultan http://t.co/5Zrgnnjn54 All my thoughts and prayers for @rioferdy5 and his family in this sad moment. Be strong, my friend. Todos mis pensamientos y oraciones con @rioferdy5 y familia para este momento tan triste. Mucha fuerza, amigo. Lo superaste 2 veces y lo harás una vez mas,eres un luchador y Estamos todos contigo. Fuerza Sergio!!! http://t.co/98VctHmZR1 RT @LibroMetodov: Tuve un Doctor que dijo : \"La suma de pequeños Detalles, provocarán que salgamos Triunfadores\". En lo insignificante, est… Un gusto compartir con Jonas, gran ejemplo de valentia y gran persona. @elgalgojonas http://t.co/MMOJ5DaZmL It was a pleasure to spend time with Jonas, a great example of bravery and a great person @elgalgojonas http://t.co/BizJQqvatc Another great win in Manchester's derby. Well done team! http://t.co/POZ3VGnFOJ Otra gran victoria en el derby de Manchester. Bien hecho equipo! http://t.co/3MNE1dz6FK Vamos equipo, siempre unidos.// Let's go boys, always together https://t.co/zsBlfjPlpz #Repost @loreleitaron with repostapp.\n・・・la princesita de papi.\nFalca &amp; Desirée ... Love ❤️...… https://t.co/yH2ayvU0o4 Getting ready for Sunday's derby. Listo para el derby del domingo. http://t.co/SvFxuYMCpb My fans are ready, @aguerosergiokun. https://t.co/mohXW0qLP1. #HeadToHead Falcao versus @aguerosergiokun... http://t.co/8OqT6y1Fpa #HeadToHead // Falcao contra @aguerosergiokun... http://t.co/8OqT6y1Fpa #HeadToHead Feliz cumpleaños a mi querido amigo @pollopochin espero que la has tenido un gran día. Dios te bendiga siempre Another win for Colombia and a special goal that make me very happy. Go Colombia! http://t.co/x6izDs2qTH Una victoria más para Colombia y un gol especial que me hacen muy feliz. Vamos Colombia! http://t.co/qYE9RzVsdI «Alaba, alma mía, al Señor, y no olvides ninguno de sus beneficios. Él perdona todos tus pecados y sana todas tus d…» http://t.co/k7xbqLQkHO Gran victoria hoy contra Baréin. Fantástico  Trabajo en equipo que es lo más importante. Vamos… https://t.co/JVNzQp8grJ Aunque el partido sea lejos de Nuestro país sabemos que no vamos solos,45 millones de Colombianos van atrás nuestro. #VamosColombia RT @medicoulloa: Camino al estadio con @entrenacarlos @FALCAO con @FCFSeleccionCol vamos Colombia!!!!!! http://t.co/VafUpw2pW4 La felicidad una decisión diaria guiada por Dios. http://t.co/EdOeyUbXDk Último entrenamiento antes del partido de mañana. #VamosColombia // last training before the match… https://t.co/Ms7QT0vTpJ Arriving at Bahrein with a lot of excitement to face these two matches and continue growing as a team. Llegando a Baréin con mucha ilusión de afrontar estos 2 partidos y seguir creciendo como equipo. #SeleccionColombia Celebrating the win against Liverpool! Well done lads! / Celebrando la victoria ante el Liverpool!… https://t.co/TIT3NQ6s3m Millions of kids dream of being football players, even in the middle of war. You too can help: http://t.co/RiMkvtMnpQ Millones de niños sueñan con ser futbolista, incluso en medio de la guerra. Ayúdanos a darle la vuelta. http://t.co/RiMkvtMnpQ Gran victoria para el equipo contra el Tottenham. Seguimos luchando! @manutd http://t.co/eyCahbcuVb Great win for the team yesterday against Tottenham. We’ll keep fighting! @ManUtd http://t.co/auZc7gFWEL Ya conseguí la maleta Gatorade!! Consíguela tú también. Entra a http://t.co/ifCxYpzk2q y averigua. #Gatoradesportbag http://t.co/p4YqjaCAPl Con marcosrojo preparando el partido de #FaCup . With marcosrojo preparing the #FaCup match. https://t.co/ilMN6WQnCH Best wishes to all the women of the world, especially to those in my family, you are my inspiration!! Feliz día a todas las mujeres del mundo, en especial a las de mi familia, ustedes son mi inspiración!! Welcome back Jonas Gutierrez. Happy to see you back on the pitch. http://t.co/NVKv0cbP2Y Bienvenido Jonas Gutierrez. Feliz de verte de nuevo jugando. http://t.co/uwPaBVSFXz Important win last night. The team will keep fighting! / Importante victoria ayer. El equipo va a seguir luchando! http://t.co/xyFXnOpT9m Félicitations Monaco pour le magnifique résultat c'est soir. Dague Monegu!!! It was really a great day, in the company of children as part of the @MU_Foundation day. http://t.co/4yeMimznXI Gran tarde en compañia de los niños en el dia de la @MU_Foundation http://t.co/8DR2BGHDkf Mi princesa Desirée... http://t.co/KJHDoWAz2J Bienvenida hija,Te amamos con todo nuestro corazón. Gracias Dios por la bendición que representan los hijos. Welcome daughter, we love you with all of our heart. Thank you God for the blessing of children. Happy Valentine's Day to everyone and especially for my love @loreleitaron http://t.co/iNmofMqbnQ Thank you God for a year full of love from my family, friends and the fans I always count on Gracias Dios por 1 año más lleno del amor de mi familia, amigos y de los que me siempre me apoyan Gracias hermano por tu amistad//“@D_DeGea: Feliz cumpleaños Tigre!!! Happy birthday Tiger!! @FALCAO 🎉🎉⚽️⚽️ http://t.co/lgXXO8KReE” Qué alegría levantarse con tantos mensajes felicitándome, muchas gracias! / It's great to wake up with so many birthday wishes, thank you! Gracias hermano,gran foto//“@lennyflorez07: Feliz cumple hermano q' dios lo bendiga le de muchos años mas @FALCAO http://t.co/WmXwjaVHF4 Forever in our hearts  #flowersofmanchester / Siempre en nuestros corazones #flowersofmanchester http://t.co/EdXseqydoE Mucha fuerza @jamesdrodriguez en la cirugía de hoy, va salir todo bien y vas a volver mas fuerte!!! Dios te acompaña amigo,abrazo grande. Disfrutando de la nieve con mis princesas @loreleitaron y #Domi// enjoying the snow with my Princesses. http://t.co/Ng62zYFffa Feliz cumpleaños @UranRigoberto Dios te siga bendiciendo. Abrazo grande http://t.co/344XInm7hQ Colombia celebra la belleza de su gente, su humildad y perseverancia Gracias a #MissUniverso2015 @PaulinaVegaDiep por darnos está alegría! Siempre leal con @pepsicolombia. Siempre con ustedes.\n\nMuchas gracias! Gracias a todos por ayudar a John Andrés a conseguir un nuevo corazón! El chico ya fue operado y su nuevo corazón le dará una nueva vida! Me acaban de llegar mis nuevas #evoSPEED, gracias @PUMAFootball. Les gusta el nuevo color? http://t.co/PV6yHjMvS7 Just received my new #evoSPEED, thanks @PUMAFootball. What do you think about the color? http://t.co/WkAyeiqM2N Mi bebe disfrutando la nieve. http://t.co/SLTRB7r6m3 Con mi amigo @1victorvaldes volviendo a casa en tren y contentos por la victoria.// with my friend… http://t.co/KIqhsXADxJ David fue a pelear con Goliat sabiendo que el Señor peleaba con el, tu gigante nunca será más grande… http://t.co/a9jIMFYHcw El equipo está unido para el partido de mañana! Muchas gracias a todos los fans de @ManUtd por su apoyo increíble. The team is united for tomorrow's match! Thank you so much to all the @ManUtd fans for your incredible support. Estos 2 Colombianos pusieron a nuestro país en lo más alto del futbol mundial. Grandes!!! @jamesdrodriguez y @teog29\" http://t.co/UXVZddEOY5 RT @jackfootball1: Can't believe falcao looked more happier than me😂 RT @jackfootball1: Lololololo radamel falcaooooo @FALCAO http://t.co/4FAQmKEzNh RT @luisferpo: Además Van Gaal lo ratificó en rueda de prensa y yo lo ratifiqué personalmente. Hay que filtrar lo que se dice y escribe des… RT @luisferpo: Para aclarar.@FALCAO Si estuvo en Old Trafford el domingo, partido al cual asistí. Incluso se vió con Van Gaal en el túnel d… Happy in @ManUtd. Check out my interview / Feliz en el @ManUtd. Echa un vistazo a la entrevista http://t.co/JmEcHeMTGg Fue un partido difícil. No es el resultado que queríamos, pero vamos a seguir luchando. It was a difficult game. Not the result we wanted but we'll keep fighting. Thank God For the lessons this year and All of you For the support. Happy 2015 to everyone.. And continue the celebration tomorrow Gracias a DIOS por los aprendizajes de este año y a todos ustedes por el apoyo! Feliz 2015 para todos...Y que mañana siga la celebración! RT @UranRigoberto: Comprendí que la voluntad del de arriba está por encima del deseo humano.Pero hay que seguir luchando. #Recuerdos2014 ht… El equipo luchó los 90 minutos por la victoria , pero desafortunadamente no ganamos. Seguiremos luchando para triunfar, siempre unidos . The team fought the 90 minutes for the win, but unfortunately we didn't make it. We'll keep fighting to  triumph, always united. Today we face Tottenham. Let's go @ManUtd / Hoy jugamos con Tottenham. Vamos @ManUtd http://t.co/qCWn7ZkCoC Boxing Day is today! Team united and stronger everyday. / Hoy es Boxing Day. Equipo unido y más fuerte cada dia. http://t.co/Sw6ZH5ovUB la verdadera razón de celebrar la Navidad Esta en Jesus. Gracias por venir al mundo para darnos vida.… http://t.co/3DlAJqLbij Feliz Navidad lleno de magia y felicidad, paz y amor / Merry Christmas full of magic and happiness, peace and love. RT @LoreleiTaron: El señor premia a quien a pesar de los obstáculos mantiene la fe intacta http://t.co/nnRkdU5sBI Victoria increíble hoy. El equipo ha hecho un gran partido, De Gea en particular. @ManUtd más fuerte cada día . http://t.co/aTXKCYM0U6 Amazing win today. The team did a great match especially De Gea. @ManUtd stronger everyday. http://t.co/obpwAyxpx4 RT @UranRigoberto: @FALCAO parcero admiración total por vos. Feliz Navidad y saludos a toda la family #FalcaoWeloveYou http://t.co/9co12aTI… Felicitaciones al mas grande @Riverplatecom y toda su gente por obtener  la copa sudamericana. #RiverCampeon http://t.co/iD53ueJBnA Bendiciones de Dios// God's blessings http://t.co/CZuFn2t0zL RT @ManUtd: Our #passtheparcel appeal provides sports equipment for underprivileged kids this Christmas: http://t.co/OQiAOqp9tB\nhttps://t.c… Important win for the team, let’s keep strong #manutd/Victoria importante para el equipo, seguimos creciéndo #manutd http://t.co/Ex5pbGE3vQ RT @FCPorto: #OnThisDay in 2010, @FALCAO scored his first hat-trick. #FCPorto smiled again at Vienna, deafiting @skrapid by 3-1. http://t.c… Un domingo cualquiera loreleitaron #Domi http://t.co/qecTb0h7PH RT @MaicolBuitrago: Paz en la tumba de @ChespiritoRGB Un grande de Latinoamérica, y quien marcó varios generaciones, sin duda alguna, siemp… Feliz por estar nuevamente en la convocatoria y preparado para disfrutar de la magia de Old Trafford//… http://t.co/zia8mXjkYP RT @juanmata8: Ready for tomorrow! @marcosrojo5 @AnderHerrera @FALCAO @D_DeGea @fellainiM @ManUtd http://t.co/SGfAK5PcXE RT @ManUtd: PIC: Great to see @Falcao back in full training today after recovering from a calf injury. http://t.co/ZxrJ8B4C5t Vuelvo a los entrenamientos al 100 % y listo para ayudar al equipo en los próximos partidos. http://t.co/P8upYqo6yM Back to training 100% and ready to help the team in the next games. http://t.co/YV1xIHzz9R Muy importante victoria de hoy en un campo difícil que nos permite seguir luchando por nuestros objetivos. Very important win today in a hard field that let's us keep fighting for our goals. RT @ManUtd: To clarify, \"new injury\" refers to Falcao's recent calf problem. The word \"new\" was used to distinguish this from a previous kn… RT @ManUtd_Es: Louis van Gaal confirmó que @Falcao retornará a los entrenamientos con el primer equipo el domingo #mufc RT @ManUtd: Louis van Gaal confirms Falcao will return to full training with the first team on Sunday. Exito no es solo lo que se ve, la Biblia enseña que grandes cosas suceden después d tiempos d invisibilidad. Mira historia d Jose Genesis 37 Success is not only what looks like, Bible says Great things will happen after blindness times, Check Joseph history at Genesis 37 RT @sebasruiz007: Un día inolvidable!! No se como explicar, aquí la tienes @FALCAO ,me dejo invitar a un partido del utd!! Que decís?? http… Volviendo en tren desde londres a Manchester para continuar la preparación. // returning by train from… http://t.co/YsbIjAhB8C RT @hugol1120: Siempre será un orgullo estar al lado de ustedes compañeros dios los bendiga millones de éxitos http://t.co/wko4d8CkO5 Listo para entrenar con la mayor motivation .//Ready to train with the best motivation http://t.co/ZkbaoLNXSI One fool speculates. A few others lacking objectivity respond and millions believe lies. It is disastrous what a few fools can do. 1 tonto especula, algunos pocos más tontos sin objetividad replican, para que millones crean mentiras.Nefasto lo de esos pocos. RT @Pepepasques: Vamos con una sonrisa para llevar la tarde😜 http://t.co/o9c67tOVwl Ayer en la gala #UNITED4UNICEF en Old Trafford para recaudar fondos para ayudar a los niños #mufc http://t.co/9XgqycrF74 Yesterday at #UNITED4UNICEF dinner at Old Trafford to raise funds to help children #mufc http://t.co/u2YygY8PUL Felicitaciones a @nicoleregnier11 por llegar a un club como el Atleti! Los mejores deseos en este nuevo reto!!! RT @MajidaIssa1: Equipo artístico y técnico merecen jornadas laborales justas. Por un #TrabajoDecente @actoresACA @luchogarzon http://t.co/nhaakOSEfL. #TBT family time in NYC @LoreleiTaron #Domi http://t.co/nhaakOSEfL. Simplemente maravillosa @LoreleiTaron Los invito mañana al estreno de la película #defaultthemovie de mi amigo @simonbrand http://t.co/DUrZsGPAWe #miedoesmiedo Feliz noche para todos http://t.co/6EqfZY80Il Con ilusión Y orgullo por vestir la camiseta de nuestro país nuevamente.Siempre unidos para darle alegrías a nuestra gente. #VamosColombia What a feeling to score a goal with the red shirt. / Que emoción marcar un gol con la camiseta roja! http://t.co/O2iXquH1gl http://t.co/v2DOY2jgWA gloria sea para ti Dios.// All of glory is for you God. Thanks Muy feliz con el primer gol y victoria en @ManUtd http://t.co/UncvJqxe09 Very happy with my first goal and win in @ManUtd http://t.co/zqwIfxql7y Hoy no te pierdas por @DIRECTVSports  desde Old Traford @ManUtd  vs West Ham. 3pm (Eng) 9am (Col) 11am (Arg) Fantástica charla de fútbol con  @Persie_Official y @PatrickKluivert muchos goles en una misma mesa. http://t.co/vMTxfn6Km4 Fantastic soccer conversation with  @Persie_Official and @PatrickKluivert many goals at the same table. http://t.co/Gt2aB2zB1z Very happy to debut in Old Trafford and for all the support I received from the first day in @ManUtd. http://t.co/FfDYcvpF6c Muy feliz por el debut en Old Trafford y por todo el cariño desde el primer día en @ManUtd. Abrazo de gol a todos. http://t.co/CKFSlnkEcU No se pierdan esta noche el segundo capitulo de mi documental \"falcao, un sueño y una lección de vida\" 8 PM Por RCN No se pierdan hoy x @DIRECTVCo canales 625 y 626 @ManUtd vs Qeens Park Rogers\n10 am Colombia los espero. Conociendo el teatro de los sueños. http://t.co/RySUXxOOuh Todos mis mejores deseos para mi amigo @carlos7bacca que esta de cumpleaños. Bendiciones crack Feliz cumpleaños a nuestro querido amigo @montanertwiter que Dios te siga bendiciendo. Abrazo grande mi hermano. Thank you @juanmata8 for the welcome @ManUtd. I'm excited to be in the pitch with all of you Muchas gracias @juanmata8 por darme la bienvenida a @ManUtd . Deseó disfrutar en el campo con todos ustedes. Do you want it? // La quieres tener? http://t.co/mv0U700W67 RT @ManUtd: Everyone at #mufc can't wait to see @Falcao pull on the no.9 shirt for the Reds. #FalcaoJoins http://t.co/2rmPcCCGeZ Thank you to Jorge Mendes and my lawyers Paulo Rendeiro and Carlos Osório for making this happen. @ManUtd http://t.co/b91ofGnT4q Moving to @ManUtd was my decision. It's exciting to play at the world's best club and in such a competitive league. Thank you Prince Albert, Dmitry, Vadim, all the supporters and @AS_Monaco team. You will always be in my heart. http://t.co/reBOZ12ALQ Contentó de ser el número 9 del @ManUtd // happy to be the number 9 of @ManUtd http://t.co/3lXKFxvwJk http://t.co/4ZEiqp0Xe9 Graciaa Dios!!! Oficialmente jugador de @ManUtd // Thanks god!!! Happy to be Man U. player Tengo que desmentir una noticia sobre un tweet que no he hecho y que es un foto montaje. Ya está aquí mi amigo @SergioAsenjo1 Bienvenido a Twitter Sergio!!! http://t.co/OUxChA17sJ \"Bendito el hombre que confía en el Señor, y pone su confianza en él\" jeremías 17:7 Desearle muchos éxitos a mis amigos de @interacapulcofc en esta temporada. Los proyectos organizados tienen frutos tarde que temprano. Congratulations to AS Monaco for 90 years of History is great to be part of this institution http://t.co/7NEnsQKAfI Acepte el desafío del hielo. ALS #IceBucketChallenge. Mis nominados @AlejandroSanz @paugasol y @juanes http://t.co/u6JqrDmH0X Calling all those who are #ForeverFaster. Reply and use @PUMA and #Fastergraph and you’ll get a digital autograph from me. \" El Angel de Jehová acampa alrededor de los que le temen,a su lado está para librarlos\" Salmo 34:7 http://t.co/MH95qytJiS feliz cumpleaños hija de mi vida. Te amamos con todo nuestro corazón. Goles del entrenamiento//“@AS_Monaco: Superbe volée de @FALCAO ce matin à l'entraînement à se repasser en boucle =&gt; https://t.co/FXZguXxgN1” http://t.co/tcTkB0ymbN recibiendo la visita de la figura @UranRigoberto gracias por todo y muchas bendiciones #ForeverFaster is here. http://t.co/zSUfMC2bVC \n/ Llegó el momento. #ForeverFaster http://t.co/7y6kSlnjHl Gracias amigo y Felicitaciones//“@Locampos15: Muy contentó X el gol y X la vuelta  a las canchas de un amigo @FALCAO http://t.co/e1RgbY4hUM” Simplemente Gracias!!! http://t.co/xnKEQe6299 http://t.co/Fsv3QppFjk Dios nos guarde y bendiga.Lindo día para jugar.\nGod protect and bless us.Nice day to return to play. Let's go boys Faith, Work and Patience. Thank you God. #thetigerisback http://t.co/awyI0VVL13 Fe, Trabajo y Paciencia gracias Dios #ElTigrevuelve http://t.co/TuWV6TMsWh http://t.co/AFxk6ZO0qS Selfie con el Príncipe Albert, junto @JoaoMoutinho @Locampos15 @ValereGermain  ¡Feliz cumpleaños Santa Marta! Trabajemos todos juntos para ser la Bahía más hermosa de América !!! Gracias #HinchasInseparables por contagiarnos su energía y su pasión, les comparto el mensaje de mis compañeros http://t.co/H1qcClBRSa Me uno al mensaje de mis compañeros diciendo a los #HinchasInseparables ¡GRACIAS! Por apoyarnos siempre http://t.co/H1qcClBRSa Hoy 6 meses.Me siento muy bien luego de Algunos test en Porto, y espero pronto jugar con mi club @AS_Monaco RT @AS_Monaco: Bye Florida, back to Monaco ! @FALCAO @Locampos15 @JoaoMoutinho @Geo_Kondogbia #ASMonacoInMiami http://t.co/atdNg672cR “@jjvc2878: @FALCAO eso lo aprendiste aquí en Venezuela”//claro pana, 5 años en Venezuela jugando béisbol. What do you think? I am ready for the Major League Baseball? http://t.co/GMecY3lGs4 Qué te parece? Estoy listo para la Major League Baseball?http://t.co/GMecY3lGs4 Un tigre enfocado. http://t.co/eQJM7RnQ2b http://t.co/2TOYnyQeH8 partido por la copa #EuroAmericana @AS_Monaco vs @nacionaloficial en Miami. Los esperamos Amigo gracias//“@FarydMondragon: La amistad y la hermandad no tienen fronteras #miami #alegria #nostalgia  @falcao http://t.co/cliRH2xbRn” Les comparto el teaser del último video clip de @carlosjean . Esta divertido http://t.co/DkvEvhGvmH Felicitaciones @jamesdrodriguez por esta nueva etapa de tu vida, te deseó el mayor de los éxitos y que puedas conseguir todos tus objetivos. Me siento honrado por recibir de parte del alcalde Tomás Regalado las llaves de la hermosa ciudad de… http://t.co/Ox8hU2S5Ni Nueva temporada, botas nuevas! Espero marcar muchos goles con estas #evoSPEED 1.3 de @PUMAFootball  http://t.co/0LSUTNhg3S Una vez más Barranquilla brindando todo su cariño. Dichoso el que pasa por esta tierra,Muchas gracias por estos 3 días maravillosos. Yendo al metropolitano emociona ver el ambiente d fútbol q se respira en Barranquilla.Demuestran gran pasión X su junior como la selección Los aliens no vieron nada aun! Muestrales, @Cristiano Ronaldo! \nhttp://t.co/xnw1o9qbxe  http://t.co/Tl18K6gM8i Feliz día a ti q has estado siempre desinteresadamente//“@pedro_llerena: Feliz día del amigo a los d siempre @falcao http://t.co/uTP3HLJ1O1” Ya pueden visitar \"La cueva del tigre \" en Bogotá para q disfruten d la pasión del fútbol y de todo el deporte. @CUEVADEL_TIGRE @RadamelKing “@PibeValderramaP: @FALCAO es honor para mi compartir con uds Todo bien”// mañana vente para dar unos pases en el entreno.Todo bien jaja Gracias por tu visita maestro @PibeValderramaP las palabras se quedan cortas para describir el gran ser humano q eres http://t.co/MgCDHNyfYR RT @AS_Monaco: Les Colombiens fans de @FALCAO et de @AS_Monaco a l'entraînement! #MonacoEnColombia #Falcao #EuroAmericana http://t.co/VYePM… http://t.co/AzSdV1HMaq Nuestra debilidad no es un impedimento para El obrar de Dios, basta su \"Gracia\". @http://instagram.com/p/ql7o_Kp--M/ buenos días!!! Con @nicoisimat desde Barranquilla la bella. Listos para entrenar El Primer día sin mundial les pareció aburrido? Tranquilos, faltan 1425 días para Rusia 2018 Jejeje los comprendo http://t.co/5oAF2KUHyu Ya terminó el mundial y yo no me puedo sacar de la cabeza que, \" Era Gol de Yepes........Era Gol de Yepes\" Felicitaciones a mi amigo @jamesdrodriguez por ser el goleador del mundial. Felicidades y viva Colombia!!! Buena tarde de descanso con mi amigo @Locampos15 mañana a seguir la pretemporada Echa un vistazo a mis botas EvoSpeed para velocidad increíble en campo! Hace clic aquí ahora: http://t.co/sT2NuFQsRv http://t.co/UPTRPXKxpr Ya han visto las preguntas delirantes de Phineas y Ferb? https://t.co/55GwKXrljK Por mi esposa que es Argentina, mis amigos que están allá , y los 9 maravillosos años en este país. Felicitaciones Argentina!!! Que grande chiquito Romero!!! Que grande, Enoooorme!!! Triste noticia tu partida Topo Lopez. Mi pésame para @verobrunati y toda su familia. Y pensar que Brasil tiene que jugar por el 3er puesto el sábado. 1 resultado q nos deja a todos sorprendidos.difícil este momento para los futbolistas y los brasileños.lo importante ahora,Q reine la paz ¿Quién tiene los fans más apasionados? Comparte una foto con #PassionPulse y #GALAXYS5 http://t.co/N7wQzpWYDm http://t.co/iRkXRPyAo3 Nos dejó una leyenda del futbol mundial Descansa en paz Don Alfredo Di Stéfano Las palabras sobran mi corazón agradece.\n#GraciasMiSeleccionColombia “@2010MisterChip: El tigre tiene razón. Siempre la tiene ;-)”// jaja solo en esta. Abrazo grande y gracias por tu buena información “@2010MisterChip: Keylor Navas debe haber hecho un pacto con el diablo. No hay otra explicación.”//O le entregó su vida a Dios. Gracias Selección. Vamos por más, porque Lo mejor está por venir!!! http://t.co/McNvvOxVhY http://t.co/fVZek8FNSP te deseó una pronta recuperación @neymarjr Deus tiene todo bajo control y tu lo sabes. Ja temos saudades de voce. Para el próximo  partido acuérdense de llamar al árbitro que hoy no vino. RT @Pepepasques: En mi barrio, de jovencito, un partidito así, como no había árbitro terminaba a las piñas. Sólo podemos sentirnos orgullosos por lo que hizo nuestra selección. Gracias muchachos Goooolll vamos todavía Quiero ver a todos los colombianos con la camiseta puesta, manden sus fotos.\n#ConLaTricolorpuesta Ya con la camiseta puesta para alentar a mi selección. #VamosColombia http://t.co/UByTaGSYlW Gracias mi doc.Alentando desde lejos//“@medicoulloa: @FALCAO http://t.co/BvQNKzPPJv” El partido se gana desde la previa,#TodosConLaCamiseta“//@Jordyissa: @hyperconectado mejor,q se la pongan para el partido,no para trabajar” Vamos Ricky//@RickySarkany: Q sea 1buen VIERNES para todos,especialmente para mi amigo @FALCAO .Hoy los argentinos somos un poco colombianos RT @layvinkurzawa: Selfie with @FALCAO and @Geo_Kondogbia ⚽️⚽️⚽️ @AS_Monaco #daghemunegu http://t.co/PEGomEfdJM Te acompaño en este momento doloroso @titifernandez1 espero que Diós consuele tu corazón y el de tu familia. Abrazo grande Lo que me he reído viendo a este niño bailar,//“@Vine_esp: La reacción de este niño no tiene descripción xD https://t.co/ukHBbhGLt8” http://t.co/gqDsgvhAxM RT @AS_Monaco: [VIDEO] Plongez au coeur de l'entraînement de reprise et découvrez les 1ères réactions =&gt; http://t.co/5QFUmvb9bC http://t.co… Esperando la conexión a Mónaco me encuentro con mi amigo @humilde00 http://t.co/kJPRMg8f46 Histórico primera vez nuestra #SeleccionColombia en 4tos de una copa del mundo gracias Dios por tanto.\n#OrgullosamenteColombianos RT @OFFCORSS: Esta tarde canta con la OFFCORSSBand y disfruta del 5% de DESCUENTO por cada #GOL de #COL http://t.co/Oppn7hM9U0 @FALCAO El mejor gol del mundial lejos, el que acaba de hacer james. RT @Diego_Hartfield: Las mujeres más lindas del mundo son las argentinas y colombianas. Así q le voy a Colombia. Y por vos @FALCAO también Llegar aquí no es el logro de un equipo, es el logro de un país entero.\n#VamosColombia \n#HinchasInseparables http://t.co/fTBS1wrrku Nuestro equipo representa el verdadero empuje de un país. Somos #HinchasInseparables #SeleccionColombia http://t.co/rKCqa481Nj Da RT y demuéstrale al mundo el amor que hoy más que nunca sientes por la selección. Somos\n#HinchasInseparables http://t.co/b1Ho1KvMjO Los#HinchasInseparables somos más. Hoy y siempre #ContigoMiSeleccion http://t.co/3dUgXsQWth #Arena #Mar #Sol mi compañia en el entrenamiento de esta mañana. http://t.co/YSXoyE8tKM http://t.co/xZ0Yg75PtN preparado para el entreno de hoy con @DanSem7 #joaquin #paco Levántate y asume el reto de vivir sin drogas !!! Día mundial de  #LuchaContraLasDrogas @UNODC Estén pendientes de la nueva actualización de mi nuevo juego Falcao Vs Aliens. Android y iOS http://t.co/1UtYXVsqmh http://t.co/6kdiFBdQEj RT @montanertwiter: @Falcao Foto de evitaa27 http://t.co/0rnroYJZjv http://t.co/LQZMtY28x3 maravillosa cena con @montanertwiter y su hermosa familia en @RagazziCafe gracias por el cariño. Dios los bendiga Justo premio a la experiencia y trayectoria de un grande dentro y fuera de la cancha #FarydMondragon #TodosConColombia Falta una hora para que sigamos construyendo el sueño. Vamos #PasoaPaso Colombia http://t.co/o5oyDkvljC Mas de 50, 000 personas atraviesan mas de 4000 kms para ver a la seleccion #HinchasInseparables http://t.co/Wi6Cp9AXWo \"Muy meritorio lo de Costa Rica rompiendo todos los pronósticos, nos soprendió a todos!!! Felicitaciones a todos los ticos\" \" la vida es futbol, lo demas son detalles\" #hinchasinseparables http://t.co/0v25WSplQI Oye @Cristiano, ¿ya superaste mi puntuacion en Striker Soccer? http://t.co/krppxHuVnk Un abrazo muy fuerte para #SereyDie hoy fuiste un gran ejemplo para todos los que amamos este deporte #respect #contigomiseleccion de corazón, alma y mente, gracias Dios por esta alegría para mi país. Goooooooooll vamos Colombia Toda Colombia está #ContigoMiSeleccion http://t.co/7zbnNhRtA1 Gracias @PacificRubiales, por respaldar el Proyecto #HinchasInseparables, y el decisivo apoyo de @ficorestrepo @rossanapantin y Maria Romero todo mi respeto y agradecimiento al fútbol español por esos 6años maravillosos de fútbol,No lo olvidaremos. RT @alejovillalobos: Gracias España por estos últimos 6 años de fútbol y espectáculo.  Respeto a sus hinchas y admiración a una generación … Cuando no lo haces en el arco rival, lo ves hacer en el tuyo. Fútbol y música...los dos idiomas internacionales. Escucha el himno #GALAXY11 aquí: http://t.co/i4lsmeea98 RT @nicolasturin: Vamos que hay que alentar a la selección de @Falcao http://t.co/G3aKpxkOcS @nicolasturin @yosoy8a  era de esperar. Disfruta del mundial, abrazo RT @wqueijeiro: Ellos felices con su selección #Mexico http://t.co/E4lYVxBAaG Felicitaciones a todos los mexicanos por el gran partido de su selección contra Brasil. Impresionante el partido de @yosoy8a  la figura del partido. Feliz cumpleaños a mi amor @LoreleiTaron eres una gran bendición para nosotros.te admiro y he aprendido mucho de ti. http://t.co/2p2LqWqANf Junto a Amaranto, @fguarin13 y Pascual. Siempre apoyando a nuestros compañeros. #VamosColombia #HinchasInseparables http://t.co/FQ0SpBEB2q Hoy hago parte de los #HinchasInseparables de la @FCFSeleccioncol. Dale RT si compartimos el mismo sentimiento Buenos días!!!Con mi esposa @LoreleiTaron 2 #HinchasInseparables listos para apoyar a la selección @ficorestrepo http://t.co/kkn7oIspwq Preparados para ir a Brasil junto a @ficorestrepo @sofia_restrepoo @loreleitaron @silvananiebles #VamosColombia!!! http://t.co/6cHOkYEfjC What a joy! We're already 5 million on Twitter. Thank you all for your support. It makes me really happy to know I can always count on you. Que alegria! Ya somos 5 milliones en Twitter. Gracias a todos por el apoyo, me deja muy feliz saber que ustedes estan siempre comigo. ¡Empieza el juego!Miren como @Cristiano y #GALAXY11 expulsan a esos extraterrestres al espacio http://t.co/OcWPYWL6Kx http://t.co/eCdAHjLmJM RT @leocorredor2007: El futuro est en tus manos y sabes lo q realmente quieres,no permitas q nada t detenga,mira siempre adelante @FALCAO h… Atrévete a vivir la experiencia de entrenar con los mejores equipos del mundo. #HazMagia enviando tu vídeo a: http://t.co/JjEcZlQAx4 RT @sarisbello: Nunca te olvides de los q estuvieron a tu lado cuando no brillabas... En el estrellato cualquiera ve tu brillo, pero eres l… A la distancia siguiendo el partido de mis compañeros @FCFSeleccionCol mi corazón con ustedes muchachos. Mira al trailer de mi nuevo juego para móviles Falcao vs Aliens. Puedes salvar al fútbol? https://t.co/Ik8wjt875c Check out the trailer for my new mobile game Falcao vs Aliens, can you save the world of football? https://t.co/Gqtr0MhSfb Salva al fútbol! Baja mi nuevo juego \"Falcao vs Aliens\". Android http://t.co/Xj9tOeHNNo iOS http://t.co/aoxcABymCy http://t.co/Isj3ktMJ22 Can you save football? Get my new game Falcao vs Aliens! Android http://t.co/Xj9tOeHNNo iOS http://t.co/aoxcABymCy http://t.co/CWQ7xeRp7K Gracias @kevinrozog por la camiseta de tu equipo @IndyEleven muchos éxitos en esta temporada http://t.co/BntxXu2zfD Muchas gracias x recibirme// “@USEmbassyBogota:El Embajador Kevin Whitaker envió mensaje de ánimo a la @FCFSeleccionCol a través de @FALCAO Foto en redes sociales. http://t.co/qQ2Fbcfu3R Hoy solo puedo sonreír por haberlo intentado hasta el final. http://t.co/qzDkcT9gyj RT @Simeone: @Falcao Lo más importante es tu recuperación como profesional. El fútbol necesita de tu talento y tu pasión. Abrazo. http://t.… RT @sjo1978: La verdad es que hay que ver lo que se rompe el lomo @FALCAO para llegar al mundial, no tiene nombre! Fuerza tigre! http://t.c… #GALAXY11 Striker Soccer está aquí. Nunca antes me enfrenté a alienígenas.Esto será divertido. http://t.co/jDEFvqqDiO http://t.co/83X1OFvIIM Nuestros ciclistas no paran de darnos alegría en el #GiroDeItalia ,felicitaciones Julián Arredondo y Fabio Duarte X ocupar el 1 y 2do puesto En #BuenosAires pendiente de mis compatriotas! @NairoQuinCo @UranRigoberto no puedo explicar lo que siento al verlos brillar en el #Giro RT @Locampos15: Me hackearon esta cuenta., Siganme en @11lucasariel...\n Muchas gracias a todos mis seguidores los espero por allá http://t.… RT @carlosvives: @FALCAO quiero que sepas que hoy todos los colombianos te estábamos extrañando y pensando mucho eres nuestro orgullo. Oye … #Nostalgia Siguiendo desde España la despedida de la selección Colombia,me alegra ver  el cariño de nuestra gente por la tricolor . @sofirestrepo no te preocupes por no ir esta noche a la despedida de la @FCFSeleccionCol lo importante es que nos vas acompañes en Brasil. Felicitaciones @UranRigoberto por el triunfo de hoy. Que orgullosos nos haces sentir a los Colombianos con tus victorias. Grande River!!! Felicitaciones a todos los riverplatenses,y en especial a mis 3 compatriotas por este nuevo título del fútbol Argentino. RT @DDubelley: http://t.co/zfU15MUIsp\n@FALCAO @Geo_Kondogbia @layvinkurzawa @EAbidalOfficial @jamesdrodriguez\nLas estrellas del Monaco #Dag… Todos los elogios que se puedan otorgar al Cholo Simeone en este momento, quedan cortos ante su inmensa gestión. Un título más que merecido para el @Atleti después de una magnífica temporada. Felicitaciones a todos los rojiblancos!!! RT @AS_Monaco: Follow @AS_Monaco para jugar + RT este mensaje para intentar ganar la camiseta de @FALCAO ! http://t.co/rJi5j3ibAB RT @marcosvidal: Es más sabio aprender a reírse de uno mismo que ofenderse por todo... Hoy recibí mis nuevas #EvoSpeed  #StartBelieving pumafootball @puma http://t.co/rTZWw9UkQw .@Cristiano, el entrenamiento #GALAXY11 estuvo de locos! Quien iba a pensar que nuestras prácticas serian con aliens? http://t.co/cDrLjKJLKB @Cristiano, #GALAXY11 practice was insane!  Who ever thought our training would involve aliens and robots? http://t.co/cDrLjKJLKB Ya tengo mi réplica, esta buenísima !!! Gracias #MinigolsPG  http://t.co/OtToVO6Vsi Un resumen del trabajo de esta mañana. 9.4 km corriendo, 1.5km nadando.No alcance a los 2. Y a la… http://t.co/8OV6OnmP81 Quiero enviar un mensaje de ánimo  a @Borjalopez3 deseo que te recuperes pronto y seguramente estarás mejor. Así es Claudio//“@claudiofreidzon:No importa la que digan las circunstancias, Dios dice en Jeremías 29:11 \"Yo tengo Planes de Bien para ti\"” Gracias por el apoyo amigos.felicitaciones por el buen trabajo que realizan,lo hacen muy bien//“@Reporte_Futbol: @FALCAO te queremos ídolo.” Buenos días primaverales.Preparado para mi triple entrenamiento de hoy empezando por una corrida de 10km y 2km de natación,a la tarde Gym. #Selfie del primer día de la madre de @loreleitaron #Dominique http://t.co/NbXF1TpBEH A todas las Madres, mujeres virtuosas,   tesoros que Dios nos regaló. Feliz día!!!  En especial a la que me dio la vida. gracias mami... RT @fedecaro: @FALCAO un placer enviarte esta foto tomada en la reserva indígena \"La Libertad\" en  el Amazonas. Fuerza tigre ! http://t.co/… Watch for the world release of this epic mission to save the world in 2 days. #GALAXY11 #GALAXYS5 @SamsungMobile http://t.co/9hWPXGuDgg RT @tomasberdych: Cool picture from yesterday @CasillasWorld and @FALCAO in the back http://t.co/hTEGDj6orE Un placer poder conocer a uno de los mejores deportistas Españoles  como paugasol http://t.co/d9N7KTUsd6 RT @fcarrilloflorez: Pocos pasos faltan para la eliminación de la visa europea. Gracias de nuevo al Gobierno español @GonzaloFournier   htt… Disfrutando el ATP de Madrid juntó a mis amigos filipeluis03 @ribasdiego10 @okanturann8 #Arda #Ata http://t.co/az4kx6nVUZ Lo se mi hermano muchas gracias. Éxitos mañana y en los siguientes partidos. Abrazo grande//“@Juanfrantorres: @FALCAO estamos contigo Tigre” Muchas gracias a las personas que realizaron este video que me llena de fuerza para seguir luchando. https://t.co/Aj6aJ5I2gz Apoyando a la banda colombiana en el ATP de Madrid. @loreleitaron  @robertfarah_ @juanscabal… http://t.co/srCzvWkDHx RT @titopuccettic: Un gran homenaje de los colombianos alrededor del mundo para @FALCAO http://t.co/8Koq0NLXTE No importa cual es tu situación actual, la promesa de Dios es que tiene preparado algo mejor para tu vida. http://t.co/JKLEpRGjuO #MiqueridaColombia mi gratitud a todos por sus mensajes #Vamoshacerhistoria https://t.co/nOGHcxvOxQ #Almadeacero Grande @Atleti !!! Una vez más superando al Chelsea y una vez más una final. Felicidades a todos los atléticos RT @ASMFC_MONACO: [VIDEO] Retrouvez la présentation de la #CopaEuroAmericana avec @Falcao =&gt; http://t.co/8y2EXf4GA4 - http://t.co/9LfvPnxCDe Con el hombre más rápido del planeta @usainbolt http://t.co/Hvx8fExm5n RT @EAbidalOfficial: Por todo lo vivido juntos, siempre te recordaré amigo,DEP. Gracias por la lucha. Mi cariño y apoyo a su família.Abi22 … Un día triste para el fútbol. Mis mas sentidas condolencias para familiares y amigos de Tito Vilanova. triste por tu lesión @steffanmedina pero convencido de que volverás más fuerte. estas dificultades te desafían a ser mejor.Estamos contigo Ni el sabía que cumplía años lincpal @carocruzosorio @loreleitaron @danielaysalome @jamesdrodriguez… http://t.co/VPI8xug24i Que divertida persona es djokernole http://t.co/davSCuTLmo Con el gran rogerfederer en el abierto de Montecarlo . http://t.co/Zc5kEvFU4K Gracias infinitas por llenar este mundo con tu magia e imaginación!! #GraciasGabo Genio total @DjokerNole con la #9 del @ASMFC_MONACO // The great @DjokerNole with my @ASMFC_MONACO #9 : ) http://t.co/WEgSJH8NJh RT @ASMFC_MONACO: @DjokerNole avec le maillot de @FALCAO ce matin au Louis II / Djoko with the Falcao shirt : http://t.co/yCYwTrp48r - http… RT @Matias_c10: @FALCAO prov 3:7-8 \"teme a Jehová, y apártate del mal; Porque será medicina a tu cuerpo, Y refrigerio para tus huesos\" El paseo de domingo para la princesa le duro 1 cuadra, le pudo el sueño. http://t.co/A4amCiuHnp RT @alan10amado: @FALCAO el Talento depende de la inspiración,el Esfuerzo depende de cada uno, sos un grande y el cuerpo tiene memoria,por … #FalcaoBelieves @PUMA Día a día un paso más cerca! Gracias a todos por estar ahí, gracias a todos por creer en mi! http://t.co/Zw96EpL8GQ @PUMA #FalcaoBelieves Día a día un paso más cerca! Gracias a todos por estar ahí, gracias a todos por creer en mi! http://t.co/tjLdV4wT4b RT @pumafootball: Follow @FALCAO as he mentally and physically prepares for his comeback with the @PUMA #FalcaoBelieves Series. http://t.co… Claro que te leo, saludos//“@chelitarivera: Si puedes mándame saludos @FALCAO solo para saber si me lees, me harías muy feliz!! 🙈❤” Congratulations to @Lexi on her first Major win at @KNCGolf. LPGA's longest hitter is now a Major Champ! #GOLEXI #TeamCPG Les comparto esta obra que realizo Emanuel Ceron. Muchas gracias amigo, espero conocerte pronto http://t.co/07IwgTr8at RT @EAbidalOfficial: Nos diste suerte Tigre y te lo agradecemos. Recupérate pronto y mucho ánimo @FALCAO. Et oui, on est au top AS... http:… Felicitation pour le match. A bientôt“@SubasicDanijel: Grande Falcao👍Top-Class👍❤️ http://t.co/uGPfIt1cEI” Merci mon frère, tu est le grande. //“@ValereGermain: Con el grande Falcao !!! Gracias hermano ... @FALCAO Nada mejor que empezar el día con la ilusión de conseguir tus objetivos. #Futbol #Gol #Sueños @puma… http://t.co/x78Dn9HqFt Es un orgullo ser embajador de @hublot y poder representar a estas maravillosas personas.Muchas… http://t.co/YCsUiIpiry Tuve el placer de visitar el stand @hublot en #BaselWorld @r_rguadalupe http://t.co/NMUQSxBfil RT @marcelaSar: @juanes @FALCAO #Madrid #amigos #Nocheinolvidable ✌️ http://t.co/xtrAYbKEDj Divertidisimo momento al lado del maestro  @juanes http://t.co/L5Y11aB7ve Quiero enviarle mis mejores deseos a @1victorvaldes para que tenga una pronta recuperación,vas a volver mejor que antes. Fuerza campeón!!! Felicito @acolfutpro por estos 10 años defiendo los derechos de los futbolistas Colombianos. Gracias por esa gran labor Tremendo domingo de fútbol! Hoy desde las 21hs(Fr) 3pm(Col) @ASMFC_MONACO vs #Lille Todo el apoyo a mis compañeros!! Great victory @ASMFC_MONACO !! 2-3 against a very tough opponent! Pretty happy for my team mates!! http://t.co/FXcttxolr4 Gran victoria del @ASMFC_MONACO 2-3 contra un rival muy complicado! Felicitaciones a todos mis compañeros!! http://t.co/tTtZpepjn1 Domingo de fútbol! Hoy O. Lyonnais Vs @ASMFC_MONACO 17hs(Fr) 11am(Col) Imperdible! desde acá todo el apoyo para mis compañeros! RT @ASMFC_MONACO: Seguidores colombianos, para finalizar el día no se pierda el vídeo exclusivo \"Un día con @FALCAO\" ! http://t.co/bsTHmNq1… RT @ASMFC_MONACO: #ASMTV #EVENTUn día con @FALCAO es ahora sobre http://t.co/b7my490ufs ! #FuerzaTigre http://t.co/T9qu3dLk8C RT @ASMFC_MONACO: #ASMTV #EVENT  One day with @FALCAO à 8:00 pm on http://t.co/CAIyZ0toq7! Watch the trailer --&gt; http://t.co/JEFPuXGGEd htt… RT @ASMFC_MONACO: #ASMTV #EVENT Un día con @FALCAO a las 20:00 (14:00 en Colombia) \nMira el trailer --&gt; http://t.co/9rgVsyi5SE http://t.co/… .@FCFSeleccionCol cumple 1 año en Tw! Siempre al tanto de todas las novedades e información de nuestra selección!! RT @ASMFC_MONACO: Today @FALCAO greeted us at Madrid to spend the day with him, he talks to the fans in french and spanish on Facebook http… I'm very happy with my new @puma #TrinomicXT #Puma http://t.co/pBrSbxaSgv El cuerpo tiene memoria, sabe que es domingo. Aunque cueste mucho levantarse, hoy estamos un día más cerca del objetivo. Feliz domingo!!! Fútbol, fútbol, fútbol!! @ASMFC_MONACO vs Sochaux Desde acá apoyando a mis compañeros!! Feliz día a todas las mujeres del mundo,  en especial a las princesas de mi casa @LoreleiTaron #Domi también a mi mami y hermanas Con mi amigo camilozuniga18 luchando juntos por conseguir el mismo sueño http://t.co/yBPZVzMqK6 Sesión de hoy con los grande de @entrenacarlos y Joaquín Juan. Ilusionado de ponerme siempre esta camiseta http://t.co/UslkVDa9D5 #5semanas 3días . Al ritmo de Rocky fue el entreno de hoy http://t.co/AiCA0akAlM Mi outfit de hoy @Puma @puma #EvoSpeed y mi bebita no se quería perder la foto http://t.co/ve4HEzs2Si #Yesid que lindo fue ver el testimonio de tu recuperación! Gracias por tus deseos #CreoEnTi #CreoEnColombia #Teleton2014 Un verdadero placer visitarlos hoy en el Calderón @FilipeLuis03  muchas gracias por el cariño. RT @FilipeLuis03: Visita de nuestro eterno goleador, el Tigre @falcao. Hombre de las finales y de mucha fé. 🙌 http://t.co/itLO7zrbHp @VickyValenciaR  en realidad es el día 33 porque fue el 25 la cirugía . Muchas gracias por escribir todos los días RT @VickyValenciaR: @FALCAO Dia 36 las victorias se logran luchando, haciendo, construyendo, anino SI SE PUEDE RT @medicoulloa: En el centro de rehabilitación con Joaquín Juan. @FALCAO en recuperación. http://t.co/goVCfTHhP9 .@carlosvives Es emocionante ver tus presentaciones! Sobre todo con sorpresas como esta gracias!!! http://t.co/x9SnMGIXZV RT @OFFCORSS: Descubre la colección y la historia que hay detrás de @FALCAO Ingresa aquí y conoce la producción&gt;&gt;http://t.co/lEnE53THPG … Nuevamente quiero manifestar que no apoyo partido político alguno, ni ningún candidato al congreso... (Continua) https://t.co/PR1Iki3n9w Le gusto tanto ir al cine que no se quería ir http://t.co/GeZVp2OnOJ Siempre firme Venezuela, no están solos!!! http://t.co/k0EmInOhhV Hoy #4semanas de rehabilitación . deje las muletas y ahora aprendiendo a caminar de nuevo. http://t.co/6WY5RA0e9h RT @maestri11: DIOS porfavor ayúdanos a salir de esta triste situación en nuestro PAIS,queremos PAZ y UNIÓN y que no se derramé más sangre,… Día #21 sábado entrenamiento a doble jornada , acá un resumen. http://t.co/8Qco1QXVMa Todo el apoyo para compañeros en el partido de hoy!! Ya se viene SC Bastia Vs @ASMFC_MONACO 17hs (Fr) 11am (Col) No se lo pierdan! All my support to my teammates today!SC Bastia Vs @ASMFC_MONACO 17hs (Fr) 11am (Col) You can't miss it! “@AlejandroSanz: Algún plan para un día lluvioso en Madrid?”// estamos en lo mismo, muchas películas querido amigo. Abrazo Lamento mucho el fallecimiento de Pacheco, todo un emblema de la TV Colombiana! A su familia y amigos el mas sincero abrazo. QEPD. Thanks very much for all your kind messages on my birthday! I'm having a great day with family and friends! Gracias a todos por los mensajes!! Estoy disfrutando mucho de mi cumple, rodeado familia, amigos y todos sus mensajes!! Gracias! loreleitaron Tu sabes como hacerme sonreír hasta en los momentos más difíciles. Gracias por estar… http://t.co/nCbSe2UIfh J'aurai souhaité entrer sur le terrain et jouer ce match avec mes coéquipiers. Même si je suis loin, mon coeur est avec vous ! #AllezMonaco TODAY! very important match @ASMFC_MONACO vs PSG 9pm (Fr) 15hs(Col) From Porto all my support to my teammates!! HOY partido muy importante!! @ASMFC_MONACO vs PSG 9pm (Fr) 15hs(Col) Desde Porto todo el apoyo a mis compañeros! Y ustedes? Cloudy and rainy morning but with the best disposition for my training day. Have a good Sunday Mañana oscura y lluviosa en Porto pero con muchas ganas para la sesión de rehabilitación. Que tengan un buen domingo. #Hinchasdeunhincha Gracias por todo el cariño y el apoyo de todos y cada uno de ustedes! http://t.co/lnHE71T1Uq Gracias @MillosFCoficial Día #12 de rehabilitación. un poco de fortalecimiento muscular http://t.co/UmqQEl2FVW Tenerlas cerca me anima a seguir luchando!!! loreleitaron #Dominique #WorldCup #Brasil #Sueños http://t.co/ua9fBlGluv Gracias a todos mis colegas del Fútbol Colombiano x sus muestras d solidaridad @MillosFCoficial @nacionaloficial @IndSantaFeCO @AsoDeporCali Impresionante el partido del @Atleti hoy. Felicitaciones por el primer puesto de la liga a todos los rojiblanco. Muy atento siguiendo a mis compañeros!! Hoy FC Lorient vs @ASMFC_MONACO desde las 16.30hs (Fr) 10.30am (Col) No se lo pierdan! DEP Luis Aragonés , el fútbol siempre te recordara. Bien acompañado en tratamiento con el parcero @juanferquinte10 http://t.co/nntarTlbA2 Muestras de cariño q me dan energía para afrontar día a día mi rehabilitación! Gracias! @ClubUnionMagsa http://t.co/rVGVBvGrmW Tranquilos, ya estoy trabajando en la recuperación \"Cámara Hiperbarica\".Las 2 horas más largas de mi vida http://t.co/dodY04Hhs7 Gracias por otra alegría @NairoQuinCo Dejando nuestros colores en lo más alto del podio! Eres todo un orgullo para el país! Abrazo grande RT @FALCAOinstagram: Un mensaje de ánimo de @AndresLeon0516 desde #NYC para @FALCAO #FuerzaTigre http://t.co/1JzFCd6hRu Wow! No paran las sorpresas y las muestras de afecto! Muchísimas gracias @DIM_Oficial !! http://t.co/QK9mGzBPW6 Desde Porto viendo al equipo, gracias por  la fuerza que me dan, yo estoy acá a darles la mía!! http://t.co/nrHCeHxAge RT @Bryan_Oviedo: @FALCAO Amén, así será. Nos vemos en Brasil tigre, gracias y pronta recuperación Dios hace posible lo improbable!  @Bryan_Oviedo Mucha fuerza y a trabajar con toda en la recuperación! Abrazo grande! Viendo a River me encuentro con esta grandísima sorpresa!! Muchísimas gracias!! http://t.co/QDd3FPdD9k @FALCAO: Alguien t dijo alguna vez q tienes 1 corazón inmenso @carlos7bacca  ?T estoy viendo jugar amigo mío http://t.co/U4JXyZopvY Soner Ertek gracias por tus mensajes. No te culpes por lo sucedido son accidentes del fútbol. No se duerman que ya vuelvo. medicoulloa http://t.co/OLDlBminAU Ya estamos con @medicoulloa Dr. Noronha y el Dr. Dino petruchi para la cirugía http://t.co/O9JRvvdGGu Si nos ponemos de acuerdo......       Cuento con sus oraciones. Hasta mañana http://t.co/W73i2dqVA7 Gracias marianoagui71  por esta reflexión http://t.co/go9OfrtIYt Obtigado ao FC PORTO e aos seu adeptos pelas mensagens de carinho e força neste momento. Aqui vai começar a minha recuperação. Muchas gracias al @atleti y a todos mis ex compañeros por tan lindo detalle. Un abrazo grande para todos http://t.co/Eo5iYULEFq Muchas gracias a todos!!! http://t.co/QABcwNSknO RT @MLACASTELLUCCIO: Con la de #RiverPlate a todos lados, siempre!!! En #IslaBaru ,Colombia. http://t.co/x1baDLphPb Los Navegantes del Magallanes//“@jgnievesa: @FALCAO recordando tu pasado beisbolistico...caracas o magallanes??” Todo listo para el\nToulouse vs @ASMFC_MONACO 17hs (Fr) 11am (Col) Su apoyo es fundamental! No se lo pierdan! Buenos días a todos.Desde muy temprano listo para el último entreno de la semana.que tengan un buen fin de semana. Que linda barriguita de embarazada tenías en ese momento loreleitaron http://t.co/QfnmOPGRXb Con mi querido amigo y gran productor musical @redone_official //with my dear friend and great… http://t.co/M6PDZVctZl Este 2014 será un año lleno de fútbol y moda de la mano de @offcorss http://t.co/0fGsUzN4Ig RT @OFFCORSS: No te pierdas todos los detalles de una colección que te hará rugir con la moda de OFFCORSS y la pasión mundialista del 2014 … Y mientras muchos ven venir la lluvia, yo veo venir el arco iris. @LoreleiTaron RT @HRestrepo: @FALCAO jajaja, y no decirle \"profesor\" a los DTs de fútbol, a menos que tengan una licenciatura en pedagogía #Propósitos201… @HRestrepo y no decirle profesor a ...? RT @HRestrepo: No decirle \"doctor\" a quien no sea médico o tenga un phD #Propósitos2014 Felicitaciones  @Cristiano  por ganar el FIFA #Ballond'Or 2013 . Que continúen los éxitos en esta temporada . Pretty happy with my oficial App! https://t.co/pEwDOq8PSH It's free to download! And we'll be in touch right away!! check it out!! Ya salió mi App oficial! @pumafootball buenísimo! La pueden bajar gratis así estamos en contacto permanente!! https://t.co/pEwDOq8PSH Hoy fecha 20 de la liga 1. Montpellier vs @ASMFC_MONACO 20:30 (Fr) 2.30pm (Col). Espero que nos acompañen!! Acabo de publicar una foto http://t.co/H7PkRTPsO1 Un poco de la práctica de hoy http://t.co/W3bEL2N3T3 Muchas gracias//“@silvestrista_RB: @FALCAO tigre desde Colombia en esta madrugada 3:29 am te deseamos muchas Bendiciones.vamos goleador” Feliz cumple disfrútalo  //“@CintiTomasini: @FALCAO Hola Radamel,sos mi idolo. Me das 1 saludo porque hoy es mi cumple.Saludos desde Arg.” Listo para un nuevo día de trabajo. http://t.co/ai373kAVqf RT @juanpabloraba: Tristeza, rabia, indignaciòn por la muerte  de nuestra querida compañera Mònica Spears y nuestro buen… http://t.co/VzEwQ… Buena lectura para empezar el día. http://t.co/HvkP0TcFFC Un poco de bici regeneradora después del partido de ayer! Buena semana para todos!! http://t.co/NV0dXif80G A la pelotita señores, domingo de Fútbol! Copa Francia, 1/32\nVannes vs @ASMFC_MONACO Desde las 17hs (Fr) 11am (Col) No se lo pierdan! Today!! FRENCH CUP, 1/32\nVannes vs @ASMFC_MONACO - Stade de la Rabine. 17hs (Fr) 11am (Col)! Don't miss it! Feliz año para todos!!! Que este 2014 sea muchísimo mejor Vamos que vamos!!! Listos para el 2do entrenamiento del día y después esperar el pasaje de año en familia y amigos. Back to work!! http://t.co/AGtk509Mjg De regreso al trabajo para empezar el año de la mejor forma!! http://t.co/3C3ppC0iWP Cumpleaños de #Juan loreleitaron @phahs @maurahahs @javitaron @gon15k @nahueltaron @antonellawittig http://t.co/K15jkc4J1t RT @SC_ESPN: #Video #SportsCenter Parte 2 del repaso de los goles de Radamel Falcao en este 2013 --&gt; http://t.co/E2HsPCXvAv. Que tiempos aquellos.abrazo amigo//“@javieraraujo10: Viejos tiempos.Ak una foto con el loco @FALCAO ÉXITOS en esta nueva etapa d tu carrera. RT @tanyahartfield: Las chicas y el falca loreleitaron @falcao @sa_polisz @phahs @maurahahs @marugambinig http://t.co/IykvhvUuwa En nombre de mi familia @LoreleiTaron y nuestra hermosa hija Dominique queremos desearles a todos una muy feliz navidad!! In the name of my family @LoreleiTaron and my loving daughter Dominique We wish you all Merry Xmas!!! Q.E.P.D Diomedes Díaz, Tu música nos acompañara por siempre. Que Dios fortalezca los corazones de su familia en este duro momento. Un placer mi hermano, Que se repita pronto//“@juanchocardonam: Nos divertimos trabajando.... @falcao gran ser humano. RT @medicoulloa: @FALCAO gracias a ti por confiar en nuestro trabajo. http://t.co/MOAe0Jvg6o Siempre un placer poder trabajar contigo @medicoulloa  gracias por tu tiempo en vacaciones Chia-Colombia http://t.co/VsfQ8ByWzu #Navidad #chía #bogota #Colombia #home http://t.co/N8cV0AU9Wz Espero que hoy nos acompañen para el @ASMFC_MONACO vs Valenciennes FC 20.30hs (Fr) 2.30pm (Col) http://t.co/t7F9nzTXlg Que se repita este grito hoy... @asmfc_monaco http://t.co/Wswnzhg7Sv Navidad en Mónaco! http://t.co/5sRHo8P3yt Concurso! Sigan las instrucciones en @ASMFC_MONACO We got a Contest follow the instructions on @ASMFC_MONACO http://t.co/W5Z5EQfMli “@ASMFC_MONACO: #ASMVAFC ¡RT para saber quién se invita encima de la camiseta para el partido contra @VAFCofficiel http://t.co/W5Z5EQfMli” We are now one planet united against the Aliens! Our team stands shoulder to shoulder, ready to fight! #GALAXY11 http://t.co/OD7LlCDX5C Todo el planeta unido contra los Aliens! Nuestro equipo espera hombro a hombro listos para pelear! #GALAXY11 http://t.co/OD7LlCDX5C Como nos ven acá junto a mi amigo @jamesdrodriguez ? http://t.co/DyQt5afvDK Gracias @asmfc_monaco por la fiesta de Navidad.Con la más bella de la noche loreleitaron http://t.co/p8Xv0hS2PR Y esta es la navidad acá // And this is christmas eve around here!! http://t.co/Txyi24oi0v “@MelissaMarRCN: @FALCAO Colombia navideña y futbolera ✌️ http://t.co/2g8Y4syBgX”//infaltable el fútbol jejeje In the last few tweets I shared the way we live christmas eve in Colombia! I hope you like it! : ) Muchísimas gracias a todos por compartir sus fotos!! Esta es solo una pequeña muestra del ambiente navideño que se vive en Colombia! “@Laga_11: Puente de Boyacá alumbrado Saludos! http://t.co/mMXKPb6MCK” Wow! Espectacular! “@Ricacamargo10: Alumbrado Navideño en @Valledupar-Colombia http://t.co/iemE4sRuJY” Grandes amigos tengo en valledupar!! saludo para todos! “@carloss_blanco: Parque Santander, En Bucaramanga, de fondo la Iglesia de la Sagrada Familia http://t.co/1eISdt79Fh” Gracias!! “@yicelg1: Tunja Boyacá http://t.co/xxpMDTuu5p” #BienvenidaLaNavidad Abrazo grande a todos en Tunjaaa!! Gracias por la foto! “@JakoboPerez: Alumbrado del rió en medellin http://t.co/4ME9uZD8HG” Buenísimo! Ya se me hacia raro q no reportaran desde Medellín. Saludos! “@kathyotalora: @FALCAO asi se ve el Parque Nacional http://t.co/HWRupNTS5G” Que gran clima Navideño!! Gracias por la foto! : ) “@clausvaleny: Asi esta mi Quindio Paisaje Cultural Cafetero http://t.co/tfwL30bO2v” La zona cafetera en Colombia! Gran lugar para conocer! “@Manu22J: Así se ve parque el tunal ciudad bolívar en la ciudad de bogota http://t.co/x4wC1PXoJe” Saludos a toda la capital! “@mfresistance: Así se vive en la plaza de Bolivar en Tunja, Boyacá. Un saludo y un abrazo, fuerza tigre.. http://t.co/c6PjfGwvrf” Wow!! “@Sanchez1324: Tigre, así se vive en Cali/Colombia! http://t.co/DaVg00SQhJ” Gracias por la foto! Saludos a todos en el Valle del Cauca! “@e_sirtori: Santa Marta. http://t.co/q312rnYuy2” Así se viste mi ciudad natal para la navidad! “@IvethNattaly: Saludos desde Barranquilla.. Así están los parques.. Feliz Navidad!!! http://t.co/cFL6nuQMhl” Buen árbol navideño en Quilla! “@jachi_montes: @FALCAO http://t.co/1ck4D6bfG3” Buenisimooo!! Wow Espectacular!! “@SoniaPLopez1: el tren de la sabana Bogotá http://t.co/V4M19cqckM” Ayúdenme a compartir con el resto del mundo como se vive la navidad en Colombia. Luces, decoración, pesebres! Mándenme sus fotos para RT! El misterio fue aclarado http://t.co/cca6fBDzo2 Compartiendo con los hinchas!! @ASMFC_MONACO  asmonacofc_officiel's photo http://t.co/Md6uVQQyFx #Twitter van a poner las banderitas para el mundial? #Col El cronograma es: 1. #Col - #Gre 14/06 13hs 2. #Col - Civ 19/06 13hs 3. #Jpn - #Col 24/06 16hs #InformoElTigre #Brasil2014 Grupo c: Colombia - Costa de Marfil - Japón - Grecia (Debutamos vs Grecia)  #InformoElTigre #SorteoBrasil2014 @FALCAO: Grupo c: Colombia - Costa de Marfil - Japón (3er partido)  #InformoElTigre #SorteoBrasil2014 Grupo c: Colombia - Costa de Marfil (Segundo Partido) #InformoElTigre #SorteoBrasil2014 Cabeza de serie grupo C Colombia #InformoElTigre #SorteoBrasil2014 Sorteo, sorteo, sorteo, sorteo... en 5,4,3,2,1... #Brasil2014 #InformoElTigre Deepest respect to a man who fought and wrote world history defending his people and his legacy that it will last for centuries. Thx Madiba Es una pena la desaparición de Nelson Mandela. Nunca dejó de luchar por un legado que cambió el mundo! Profundo respeto a él y su familia. Sorteo de los grupos del mundial a la vista!! Algún palpito? #Ta-Tan-Ta-Tan #RedobleDeSuspenso Hasta en el espacio él puede salvar cualquier cosa @CasillasWorld se unió a #GALAXY11 y mandar los Aliens de regreso http://t.co/hdmi1rgFB3 Even in space he saves anything- @CasillasWorld has joined #GALAXY11 to send the Aliens back to where they came from! http://t.co/8N2HofboEy Bonjour a tous mes amis  je vous  souhaite une tres bonne journee pleine de bonheur Todo listo para apoyar a mis compañeros en el partido de hoy Niza - @ASMFC_MONACO No se lo pierdan que ya empiezaaaa! (21hs Fr - 3pm Col) What Alien threat? South Korea's 'blue dragon' Lee Chung-Yong is the newest member of #GALAXY11 He is prepared to WIN http://t.co/jtCMzBPUyV Desde Corea del Sur El 'Dragón azul' Lee Chung-Yong es el nuevo miembro de #Galaxy11 y está preparado para ganar. http://t.co/jtCMzBPUyV Con IL capitano de la Roma Francesco Totti. Agradable conversación de fútbol junto a nuestro… http://t.co/6zOLD8m7Fx RT @ASMFC_MONACO: #ASMSRFC COMPO Subasic, Raggi, Kurzawa, Carvalho, Abidal (cap), Toulalan, Obbadi, Moutinho, James, Rivière, Martial http:… Hoy acompañenme para apoyar a mis compañeros en el @ASMFC_MONACO Vs Rennais FC que empieza en 5,4,3,2,1... (17:00 Fr - 11:00 Col) Psyched to be selected for #GALAXY11. I am ready for the fight of a lifetime and to make intergalactic history! https://t.co/IlfifVhW7X Muy contento por ser elegido por #GALAXY11. Ya estoy listo para la pelea del siglo y hacer historia intergaláctica. https://t.co/IlfifVhW7X RT @LoreleiTaron: Amigos tienen que ir este 8 de Diciembre al concierto de @CamposAlex  en Armenia!! Va a estar genial !! \nhttps://t.co/Ksq… Disfrute mucho siendo el director de la revista @Cromoscomco para esta edición especial.Gracias a toda… http://t.co/iF5WxCJ2X8 Quiero aclarar que no hago parte ni apoyo ningún partido político. El uso que se esta haciendo de mi imagen es sin mi autorización. La esperanza nos hace persistente http://t.co/4OyFIJ2LPe Trabajando por nuestros niños #offcorss http://t.co/uJ1oTfXyeW Fútbol de domingo! Hoy no se pueden perder Nantes Vs. @ASMFC_MONACO desde las 21hs (Fra) 3pm (Col) Contamos con todo su apoyo! RT @USEmbassyBogota: Felicitamos a @Falcao por su nuevo papel como Embajador de Buena Voluntad de @UNODC, en el que jugará para ganarle el … RT @UN4Youth: #Footballer Radamel @Falcao, @UNODC Goodwill Ambassador, says he will help youth fight against drugs and crime http://t.co/rc… A pic with the great @RvN1776 Thx for your Futbol and your kindness!! Was an honor to meet you! http://t.co/uFpk8Hk1gp Visita del gran @RvN1776 después dl partido.gracias Ruud por el fútbol q nos regalaste y por tu humildad q sorprende http://t.co/uFpk8Hk1gp Entre todos podemos ganarle el partido a las drogas y la ilegalidad!! @UNODC https://t.co/MdQzmfnZCR Muchísimas gracias a @UNODC es un gran honor y aún mayor la responsabilidad ser su embajador de buena voluntad http://t.co/l3BjhDjGf0 \"Le footballeur Falcao désigné Ambassadeur de bonne volonté par le chef de l'ONUDC\" C'est un honneur, merci beaucoup http://t.co/QBGcIDS0bp RT @UNODC: We’re proud to announce the newest @UNODC Goodwill Ambassador: #football superstar @FALCAO! http://t.co/5228F2Zopl http://t.co/G… Hoy es día de fútbol de selección! Espero que puedan ver desde las 2.30pm(Col) Holanda - Colombia Amistoso rumbo a Brasil 2014! : ) Foto de bienvenida a twitter para @kinerendon.Las redes sociales te van a dejar sin pelo jeje… http://t.co/IiOBVsu9fx Amsterdam arena con @patriciocamps @gabywainer @entrenacarlos @medicoulloa  @fisiopetrelli #jose #marce #ivan http://t.co/RCm8w2GiJ9 “@gabywainer: Con @FALCAO,gran jugador, mejor persona. http://t.co/EX9OjptG6j Gabi!!! Un gusto q estés en esta selección “@Daricvitaok  @chubonelli @FALCAO @Daricvitaok @LoreleiTaron entonces yo aporto la ensalada jajaja.Buena semana a todos,nos vemos pronto RT @Moha1morales: Mañana en @DFdeportes , entrevistaran a @FALCAO . Y hablaran del @EstadioAcapulco . Excelente programa. “@Daricvitaok: @LoreleiTaron ja q linda exitos al gran goleador @FALCAO la prox semana hacemos comida!!Buen viaje//me preparo para el asado? “@LINCPAL: Trabajando con ganas y humildad siempre se ven los frutos.....en silencio!!!!”//tienes toda la razón. Abrazo RT @Cromoscomco: A 7 días de descubrir todos los goles de Falcao en Cromos. Nuestro director invitado nos traerá una edición con excelentes… Llegamos a Amsterdam,una ciudad fantástica // We just arrived to Amsterdam,a fantastic city. Y el final de esta jugada es? http://t.co/52yc71pivq Fantásticos porteros,mi amigo d_ospina1 y siempre es lindo reencontrase con mi amigo thibautcourtois http://t.co/AYHJiBHsrA Este no es el límite, vamos por más #equipo #unidad #amistad #festejo http://t.co/rOxsWK0gnt RT @ElUniversalCtg: Este es el niño cartagenero que dejó sin palabras a @FALCAO García http://t.co/Pf15DXSs7Q “@JuanPaGalavis: Compa que es de tu VIDA @FALCAO / How is your LIFE compa Falcao...”//En Belgica con la sele.the question is\"where are You?\" Jueves de fútbol de selección desde las 2.30pm Bélgica - Colombia! Espero que no se lo pierdan! [Video] http://t.co/UZJtm5XNeu Videooooon! Colombia, vamos al mundial!!! : ) We're back in the world cup!! “@hyperconectado: Amigo @falcao cuando me regalas una camiseta ?”// cuando la pidas [Foto] Se acuerdan de \"Donde esta Javier\" Ja!  http://t.co/sKIjG4ivUx Sin palabras // Speechless http://t.co/2l5zjC5zpD #SinPalabras #Speechless http://t.co/2l5zjC5zpD RT @marca: Así gritó Falcao que Colombia estará en el Mundial de Brasil, ¿cómo lo celebraste tú? #ColombiaMundialista http://t.co/rDMOKjPyRg Grito con el alma que nos convierte en mundialistas. Con @armero7 macne10 @abadiaAMARAL #willi http://t.co/NeE3GuXFAc Thx @destinofutespn about the documentary \"Falcao: A new hope\" @martinainstein I really like it and appreciate it! Muchas gracias @destinofutespn por el especial \"Falcao: La nueva esperanza\" @martinainstein Espero que no se lo pierdan! Esta muy bueno! #Hoyesviernes Planes para hoy? Yo tengo partido! :) fecha 13 liga 1; @ASMFC_MONACO - Evian [20.30 Fra - 2.30pm Col] Todos invitados! Aujourd'hui Ligue 1, Jornée 13 // Today's match @ASMFC_MONACO - Evian [20.30 Fra - 2.30pm Col] :) RT @RICK_HUBLOTLAM: @FALCAO @jcbiver @Hublot @r_rguadalupe @juandeariza07 today in Colombia we gave the first 100k$ contribution to #eltigr… Bulding up a Sports center in Palafitos-Ciénaga de Sta Marta A dream come true! #UNODC @juandeariza07 @RICK_HUBLOTLAM http://t.co/3zpAwSFXRw Listo para comenzar el polideportivo en Palafitos - Ciénaga de Sta Marta :) #UNODC @juandeariza07 @RICK_HUBLOTLAM http://t.co/3zpAwSFXRw “@LucasConslie: @FALCAO amigo estoy en tu tierra. Sin palabras Colombia es muy lindo!!!”//disfrútala Lucas, saludos a la familia Todo listo para esta noche http://t.co/mhKECV49JK No se pierdan Lille Vs @ASMFC_MONACO (21hs Fra - 3pm Col) Contamos con su apoyo! No hay palabras de agradecimiento para todos ustedes que me apoyan día a día y me dan todo su cariño y afecto!! Gracias a todos!! A todos mis compañeros con que he compartido en el campo durante los últimos años y me han ayudado a ser mejor futbolista! Mil gracias!! Gracias a Dios por la nominación a la lista de 23 jugadores al balón de Oro. Muestra de tu fidelidad al cumplir en tu tiempo nuestros sueños “@leocorredor2007: Felicidades @FALCAO X esta nueva nominacion al Balón d Oro 2013.Este es el resultado dl trabajo y sacrificio.”//Gracias Un beso de tres!! Love love love!! http://t.co/ePJyr6SBvu “@Daricvitaok: @FALCAO lo mismo para vos goleador y felicitaciones por la victoria y el gol d ayer.”//Muchas gracias Darío.Abrazo grande Lindo día en la costa azul, disfrutarlo @LoreleiTaron @danielaysalome  @JESICASTERLING @jamesdrodriguez @D_Ospina1 @chubonelli @Daricvitaok 150 gritos de gol en Europa!! :) Espero q los hayan disfrutado tanto como yo! Ahora a trabajar x los próximos 150 rugidos! Gracias a todos por los mensajes! Conseguimos una victoria muy importante en casa! Q tengan todos buen resto de domingo y mejor semana! Muy buen domingo para todos!! Hoy no se pierdan @ASMFC_MONACO vs O.Lyon 17hs (Fra) 11am(Col) Es muy bueno levantarse antes d q suene el despertador,sin nada de sueño, sabiendo q dormiste 1hora + por el retraso del horario en invierno Muy feliz día a todas las madres Argentinas! La mas linda de todas @LoreleiTaron que me dio a mi princesita Dominique! A madrugar!! Vamos, vamos que cuento con todos ustedes!! Bien tempranito 7am (Col) 14hs(Fra) No se pueden perder Sochaux Vs.@ASMFC_MONACO “@FerniZagaglia: Bueno gente, mi primer tatoo espero que les guste http://t.co/moreNauQrD”// me gusto el tatoo.Abrazo y saludos en Argentina Nada más lindo que volver a casa y encontrarme esta hermosura. Nuestra princesa #Dominique http://t.co/Ygc33CkLvk Colombia volvemos al mundial!! Esto es para todos y de todos! Ahora a trabajar mas fuerte q nunca, prepararnos y disfrutar lo que viene!! Hoy Paraguay - Colombia 6.30pm (Col) No se lo pierdan!! Desde donde reportan sintonía con la selección? [Video] Gracias a las mas de 25mil personas que ya estan ayudando esta noble causa #unidosporcolombia    http://t.co/D94CT39HgV Únete!! Somos de la generación #Mudial2014 @jamesdrodriguez @fguarin13 @juanferquinte10  http://t.co/porEaCbRo7 Alegria não tem fim!! Gracias a los q apoyan en las buenas y en las malas mucho mas!! Abrazo de gol de clasificación al mundial! Ja! Todo listo para Colombia - Chile 4pm (Col) Este es todo el plantel solo faltan todos ustedes apoyándonos! http://t.co/1VoQkxuMNG Hoy mas q nunca necesitamos el apoyo de cada corazón Colombiano alrededor del mundo!! Vamos Colombia!! Con su apoyo y nuestro esfuerzo queremos cumplir el sueño de todos! #TodoLoMejorParaTiMiSelección http://t.co/WDjVrfR6JY Pero que lindo que es estar nuevamente en mi país! Como amanecen? Ya mentalizado en el viernes! #Nadamasimporta http://t.co/eRehdMXPeC Ya está todo listo para @ASMFC_MONACO vs S. Etienne 17hs (Fra) 10hs (Col) Partido muy importante y espero que nos acompañen!! Qué tal mi actuación en El mayor espectáculo del mundo? director: #OliverStone  #NadaMasImporta http://t.co/hYvQWS3SPX Gran experiencia! RT @TheOliverStone: We are making history We are writing destiny / Haciendo historia Escribiendo nuestro destino #NadaMasImporta   http://t… Dominique feliz porque ya recibió parte de la nueva colección de \"Offcorss\"\nMuchas gracias chicos http://t.co/3kV7Jpn3uM No hay nada más difícil que hacer la foto del pasaporte para un bebe. Es imposible que se queden en la posición que exigen las embajadas Felicitaciones @CamposAlex y a mi esposa @LoreleiTaron Por esta canción tan linda sobre la amistad! No se la pierdan http://t.co/Np8sS28JZN :) @CamposAlex @LoreleiTaron http://t.co/ySDtOaonR7 La familia son personas q Dios nos eligió. Amigos son la familia q nosotros elegimos! Acá está el #FIFA 14, no se lo pueden perder!! There you go! The #FIFA 14 You can't miss it! http://t.co/OZd9zeDsTm Felicidades @EASPORTSFIFA Estoy feliz de ser parte del mejor juego de fútbol del planeta #FIFA 14 En Colombia ya está a la venta!! Congratulations @EASPORTSFIFA Happy to be part of the best sports game in the planet #FIFA 14 Colombia the game is now in stores!! Hoy día de fútbol!! Reims vs @ASMFC_MONACO 21hs (Fra) 2pm (Col) No se lo pierdan! Felicitaciones @Atleti A todo el plantel, cuerpo técnico y flia colchonera por la victoria, fruto del esfuerzo y el gran trabajo de todos! Feliz día a todos los hinchas del Millo. Orgulloso de haber vestido la camiseta del más grande!!!#DiaInternacionalDelHinchaDeRiver RT @ASMFC_MONACO: #DagheMunegu'2 avec @FALCAO, les jeunes de #Academy, des anciens R&amp;B et pleins de surprises... http://t.co/cPforuCQ5i Buen resultado el de hoy! Seguimos en la punta! Lo cuál significa q hay q seguir trabajando aún mas fuerte para mantenernos ahí! Tonight we got a great match! PSG vs @ASMFC_MONACO 21hs(Fra) 14hs(Col) Hope you can supports us! You can't Miss it!! Hoy tenemos un gran partido por delante! PSG Vs @ASMFC_MONACO 21hs (Fra) - 14hs(Col) Esperamos todo su apoyo!! No se lo pierdan! Llegamos a Paris!! Ahora a descansar para el partido de mañana!! Feliz día de la primavera!! Feliz día en Colombia del amor y la amistad! Espero que puedan pasarlo con las personas que mas quieren! Donde más se festeja?? Happy B-Day @jcbiver have a great day!! http://t.co/Z7tM5Oc7RC Todo el plantel! Qué tal?\nl'image de nous tous! Ça vous plaît?\nThe pic of all of us! do you like it?\n@ASMFC_MONACO http://t.co/WpnhkbbmLn Un triunfo importante para seguir trabajando! Que tengan un feliz resto de domingo! - Great victory to keep working! Have a nice sunday! Dimanche 15 Septembre 14h00 AS MONACO FC - OFFICIEL - FC Lorient - 5ème journée Ligue 1 - Stade Louis II Como ven la madrugada mañana? 7am (Col x @DirecTvSports 610) @ASMFC_MONACO vs Fc Lorient Espero que no se lo pierdan! [Video] El proyecto de los Palafitos en la ciénaga grande de Santa Marta empieza a ser una realidad! cc @Hublot http://t.co/uHLpgNIzk6 Un abrazo de apoyo y fortaleza para @mariomarrio20 familia y amigos. Esperamos su pronta recuperación. El sueño sigue intacto! La fé no se quebranta!! El trabajo y el esfuerzo se redoblan!! #DiosAlComando Con #DiosAlComando de nuestro trabajo y nuestros sueños; Enfrentamos hoy a Uruguay y esperamos todo su apoyo!! Genial esta canción de @carlos_lazaro\nhttp://t.co/e7D6IBtp42 La conocí en España y la oigo ahora sonando en Colombia!! Imborrable recuerdo #River!! \"Yo campeón te vengo a ver...\" http://t.co/BzixPLXK85 Felicitaciones @simeonegiovanni por el gol! Hasta acá al otro lado del río de la plata se oye rugir el monumental!! Vamos River!! Que estaría pensando mi amiguito??? http://t.co/tnWp7zIooQ Rugido de gol! El grito contenido de todo un país! #unidosporcolombia http://t.co/yfNdyTu7VT #Unidosporcolombia Gran victoria! Y el sueño que de a poco y con el esfuerzo de todos se vuelve realidad!! #DiosAlComando Es un gran día para llevar la camiseta puesta! Ya se siente todo el apoyo! Porque hoy y siempre esta #DiosAlComando Vamos Colombia! [Video] El cambio depende de ti! Depende de todos! Yo ya tengo mi manilla! y tu? #UnidosPorColombia http://t.co/CJbAer71UP What a great sunday! Any plans?Whatever you do, do not miss Ol. Marseille - @ASMFC_MONACO at 21hs (Fra) 2pm (Col) Have a nice day! Que hacen un domingo como hoy? Dejen un espacio para ver Ol. Marseille - @ASMFC_MONACO 21hs (Fra) 2pm (Col) No se lo pierdan! Felicitaciones a toda la delegación Colombiana de patinaje que se coronaron campeones de pista en el Mundial de Bélgica!! Clap! Clap!! It's a shame that you can not be in the Stade Louis II cheering and supporting us / Es una lástima que hoy tengamos que jugar sin público!! Todays match @ASMFC_MONACO vs Toulouse 20.30hs (Fra) 13.30hs (Col) Can't miss it!! Ya estamos por salir para el estadio Louis II ! Hoy no se pierdan @ASMFC_MONACO vs Toulouse !! Desde las 20.30hs (Fra) 13.30(Col)!! [Video] “@EASPORTSFutbol: ¡ Radamel Falcao se una al equipo #FIFA14!  http://t.co/RTPrCQPoil” Feliz de ser la portada de FIFA 14 de @EASPORTSFutbol y de confirmar la liga colombiana en el juego. Que esperan para reservarlo? #FIFA14 Happy to be in the @EASPORTSFutbol FIFA 14 cover, and to confirm Colombian league in the game. Pre-order now! #FIFA14 [Video] Les dejo la entrevista: http://t.co/xYYAs5tYsB A pesar de la desinformación de los medios de comunicación mi presente profesional esta con el Mónaco. Por favor basta de especulaciones!! Quién se acuerda de la mejor celebración de un gol?? En Colombia fue icónica la voltereta del \"Tino\" Asprilla! Cual otra?? Gran partido el de hoy! Una victoria muy importante para seguir trabajando cada vez mas!! Y la celebración a lo Bebeto para Dominique! We got a great match today!! A victory to keep working harder an harder! And a celebration like Bebeto for Dominique !! Hoy es día de fútbol!! Y no se pueden perder desde las 7:00 (Col) 14hs(Mon) @ASMFC_MONACO VS Montpellier! Los esperamos! Sunday a football day!! @Asmfc_Monaco VS Montpellier 7:00(Col) 14hs (Mon) Can't miss it! Significado de Dominique: \"La que pertenece a Dios\" #Enamorado http://t.co/db1oFfU1uw I'm glad to announce that this morning just born our daughter Dominique We're so happy!! #WelcomeDominique Ahora si! Muchísimas gracias a todos los que nos escriben! Estamos muy muy felices por esta gran bendición! #BienvenidaDominique 13 de agosto a las 8:35am nació nuestra hija Dominique García Taron.\nBienvenida princesa, te amamos http://t.co/V0HPIqoWqk Les agradezco por los mensajes recibidos pero les informo que nos encontramos todavía a la espera de nuestra hija y en pocas horas nacerá . RT @ASMFC_MONACO: #asmTV - (J1) G.Bordeaux - AS Monaco FC, les réactions - @FALCAO @EAbidalOfficial #Ranieri #Rivière http://t.co/XV2RAPZSOb Y les dejo esta ultima imagen!! http://t.co/LHPA6YyH23 Toda la alegría con mis compañeros y el puño apretado al aire!! Como no compartir el 1er gol oficial con @ASMFC_MONACO con todos ustedes! Este si q es un abrazo de gol! ja! http://t.co/Jn1DE9WLKk Importantísima victoria para comenzar el campeonato! Ahora a seguir trabajando que esto apenas empieza! Great and very important victory to start up the season! we must Keep training and working 'cause this is just the beginning!! RT @ASMFC_MONACO: Chaban-Delmas abrite ce soir les tuniques de l'AS Monaco FC... @FALCAO @JoaoMoutinho  @Locampos15 http://t.co/ofhEreGZ0J"}