{"tweets": "@UFCBrasil @Benaskren @demianmaia Monstro muito! Mano... não zoa. Não estraga. Pelamordedeus. Diz que vcs estão zoando. Diz que vcs ñ são tão ARROMBADOS!!! https://t.co/NLeZ8PzcgQ @gustastockler Eu tenho vergonha é do novo Fiat e do programa Se Joga, da Globo. Estreou um programa na Globo chamado SE JOGA. As gírias levam de 12 a 14 anos para chegarem na emissora. Breve os programas Daora, Vacilo, Balada na Night, Rolê da Paquera, Mó Comédia e Queimando a Rosca. @Kidids Hehahehahr RT @rafinhabastos: Sabe qual a parte boa de acordar muito cedo? Não. Você não sabe. Porque não existe. NÃO EXISTE. RT @rafinhabastos: https://t.co/VIhjoSdljS Esses espaços coletivos de trabalho tipo WeWork são tão bacanas e descolados... mas eu sei que os jovens que habitam o lugar, estão ali trabalhando na 17ª versão de uma apresentação de merda para um chefe insuportável que ñ faz a menor idéia do que quer. Coringa é um filme incrível, mas ainda acho o Ronald McDonald o mais macabro dos palhaços... destruindo gerações glúten a glúten. https://t.co/yC2VqDspJI @raffaellsan @moura_101 Ja expliquei pro anão 3 vezes. É um dinheiro do canal. Não saiu de cofre público nenhum, mas ele insiste. 🤷🏻‍♂️ @moura_101 Calma... moça. Vai perder todo implante. Vai acabar careca 2 vezes. 🙏 Que surtinho psicótico mais fofo, geeentchi! ❤️ https://t.co/dGSLm02Jko @LeoSanes “Haver” não. A ver. Obrigado. Mano... ó as coisa que os cara compartilha! Hehhshehahe!!! Uma mulher massageando a virilha do presida que atira com duas metrancas enquanto um jacaré sorri vendo o PT pegar fogo. Coisa mais linda. https://t.co/3bdWWtl6Xr Mestre do Capitalismo de cu é rola! Isso sim é COACHING FINANCEIRO, carai! https://t.co/P7ngMkREeQ Tenho nada a ver com isso, Vivo. Inclusive meu celular é Claro. https://t.co/8US8HlfA3w Meu papo com o @Haddad_Fernando tá no ar. Assiste ae! https://t.co/MVLRLGtAJ7 https://t.co/1PvGe9fa7x @Tonkiel A Globo é aquele tiozão que se esforça pra aprender as gírias dos jovens, mas larga uns “e aí, galera!” no meio do papo e bota tudo a perder. @JlioCsa40437174 @quadrelii @LineroGomes HahhsshHahahhs! Encerro aqui o meu caso, vsa senhoria. @Robertaurca 🙌 @colorina Hahehaheh! Menina Greta é só irá. @UFCBrasil Aqui no BR o Wallid ja fechou com o Batoré da Praça é Nossa e vcs não falam nada? #PrayForWallid @jbanguela Jajá @WelderMM @romulomendonca Tb renovei. Sigo morando em Perdizes. #Aluguel2029 @EllenPfefferOf @EduPrimitivo Moça.... seu desejo será dificilmente atendido. Não tem Leão na favela. No Google achei apenas a música FAVELA, DE NARA LEÃO: https://t.co/RY58jMnsBn @EduPrimitivo Edu... triste é saber que teu bairro é ultra perigoso e tu vai morrer de diabetes. Gordo safado. @bicmuller E ainda saiu como unha de fome que corta cabelo na permuta. Foda. Falasse isso pra mim há 2 anos eu riria e procuraria a câmera do Topa Tudo por Dinheiro. Hoje eu apenas apago o cigarro na minha coxa e sigo a vida. https://t.co/Kwm3OMHLLC @pegoncalves @YgorFremo Hahhhahahahgagagga Parabens aos bródis do Porta pela conquista!!! Muito foda!!! @gduvivier @antoniotabet @FabioPorchat @joaovicente27 https://t.co/35P5UyRrgh @AroucheYeda @acarol_luz @Beastmaster @broome88 @netflix @NetflixBrasil Gente chata tb assiste o programa. Infelizmente, @netflixbrasil. @afrancyellee Prazer!!! Obg pela visita. Vou voltar em português. Prometo!!!!!! 🙌 @MarcelMelfi Que massa!!!!!!!!!! Vc lembra dessa propaganda e nem sabia q era eu que fazia. https://t.co/h4aL05dOaT @rosana Com @MariMoon e @biagranja. 🙌 @moura_101 Uma semana após o procedimento, NANDINHO volta para uma avaliação... https://t.co/7TDBQltaL4 @FNaveganteST @moura_101 Hahhwhshhe hush Nandinho... tâmo aqui na torcida pro seu transplante de cérebro ter dado certo. ❤️ #PrayForNandinho @moura_101 https://t.co/fVKAf5I6hr Quem fizer piadoca de tiozão como “O PERU TE DEIXOU FELIZ”, leva choque no ânus. Não gasto dinheiro pra ficar triste. Paguei 70 dólares pra me divertir... e assim o fiz. #Peru https://t.co/VbxLTiA8if Moça, seu chapéu tá furado. Vai sair do sol parecendo que tá com sarampo. Cuidado aí. Jesus te ama. https://t.co/ltoBzcQkhT https://t.co/TxdmcXdkfI @Calazani Tem isso aí tb. Conservadorzinho é valentão no Twitter, não é mesmo?! Chega na frente é fofo, te abraça e diz que é fã. Tão fofinhos! ❤️ Dá vontade de levar pra casa de tão cuti-cuti! @FabriniNaira Ô tia... o botox chegou no teu cérebro. @Will_ggil @SuperCaruso @felipeneto Hashahe! Manobra orquestrada. “Vc é um verme! Um imbecil! Tua cara me dá ódio. Tomara que vc morra... seu trouxa!”. Aí eu vou olhar o perfil do cara e a 1ª coisa: Cristão. Vejo isso direeeto. Explica aí que Cristo é esse pq tô confuso. O q eu conheço era gente boa demais... falava umas coisas de amor e tal. @sisasantos @carlosjordy https://t.co/ZVRcqzkqdh @nathanaeldream Sempre E maaaaaais... esse bate-boca todo não é tão ruim... aumenta os acessos do vídeo... assim cai mais verdinho na conta do amigo aqui... o que faz de mim o VERDADEIRO MESTRE DO CAPITALISMO. https://t.co/eSISk9mhGr Repito o que disse anteriormente: O grande problema do CQC não foi dar voz ao Bolsonaro... foi dar voz ao Rafinha Bastos. Esse coitado aí tá pedindo internação há anos e ninguém faz nada. Triste isso. E quem acha errado eu “dar palanque pra maluco”... DISCORDO DE VC. Acredito no diálogo com todo mundo. Do mais louco ao mais equilibrado. E NÃO FUI EU QUE ELEGI O BOLSONARO... não tenho esse poder. (segue) Curto ter papos legais com quem concordo e com quem discordo. Ver esse trampo distorcido e manipulado ñ me faz dar pulinhos de alegria... admito. Faz parte. Dou a cara pra bater e tô sujeito a isso. Só peço que vc assista às conversas na íntegra. https://t.co/cpfJsLx3pD (segue) Tenho um programa de entrevistas no YouTube há 7 anos e continuo acreditando no diálogo. Levo todo mundo lá... da Joyce Hasselmann ao Boulos... do Mamãe Falei ao Fernando Haddad (ainda vai ar esse)... do Major Olímpio ao Glenn Greenwald. (segue) A gente tá vivendo um tempo em que a verdade não é mais relevante, o que importa é o recorte dela que agrada o paladar do caboclo. Tá tudo certo... faz parte do jogo. Só queria que vc entendesse o esquema. (segue) Entrevistei uma deputada conservadora. Galerinha da direita vai lá e edita um vídeo só com as respostas dela pra eu parecer um cavalo (fizeram isso numa entrevista minha no Pânico tb). Galerinha da esquerda edita outro com ela quase tendo um AVC na minha frente. (segue) @Giliard99699165 Quando a vontade popular é contra a legalização do aborto e gente pobre tá morrendo em clínica clandestina... PRECISA SIM. @bicmuller @alexnero Fizeram uma edição só com as respostas dela e eu quieto. Já é a terceira vez que fazem isso. Galerinha tá ligeira na manipulation. @carlosjordy Quem quiser assistir a íntegra e não um clipezinho editado apenas com as respostas dela: https://t.co/whOp4q1Z77 @gregory_barros Quem quiser assistir a íntegra e não um clipe editado apenas com as respostas dela: https://t.co/whOp4q1Z77 Esse THE MASK é bem melhor: https://t.co/RSWml17jHW https://t.co/QJN19lCBn6 Amanhã na bienal do RJ tem livrinho bacana de grátis. Chupa essa aí, Crivelito! https://t.co/ZC3bskjR7G Se a deputada Ana Campagnolo é tão conservadora, ALGUÉM ME EXPLICA PQ ELA, REPITO... ELA, PEDIU PRA TIRAR ESSA FOTINHO COMIGO??? Vídeo: https://t.co/whOp4q1Z77 https://t.co/VfDh1m3DUJ @MundoSpears 😂😂😂 Pra quem mora ou tá passando pela Califórnia... minha agenda de shows do finde. https://t.co/zKAmBoxnGC E o cachorro conservador querendo dar fim a baixaria. 🐶 https://t.co/ELPTL6mr6c @lippe14 Chupa! https://t.co/BFpYXc3Hcm Esse domingo, em Los Angeles! https://t.co/e5MIOpX9Uw @rafaluz55 parabéns velho! Quebra tudo! @raphaeldraccon Uauhwhshe! Bem isso ae #Mito @VAREJAOANDERSON https://t.co/S8ZeAXWVnH @mheelena 🙌 @RafaelSimon2 Você leu a palavra censura no que eu disse? Eu não falei isso @YCampolongo Então sai quieto... não fode o show pra quem pagou. Não era debate com participação do público E pra fascistinha de merda... se liga: Não gostou do que o comediante disse, fica quieto e vai embora do show. Tem gente ali que PAGOU pra ver o que o cara tá fazendo. E mais: se vc foi no show do cara QUE IMITA A DILMA, deveria desconfiar do que se trata. Comediante de verdade luta pela liberdade do colega de fazer o seu trabalho... mesmo que algum dia ele tenha se equivocado no que disse. Todos nós falamos merda... o tempo todo. Agora ñ é hora de apontar as incongruências do colega... é hora de lutar pela liberdade dele. @pietraprincipe @RogerioVilela Achei q cs tinham namorado. 🤦🏻‍♂️ @Muyloco @jessydalpino Mano... isso caiu na minha timeline. Manda direct pra ela, caraio. Coraçãozinho brega no feed num dá. @RogerioVilela @pietraprincipe Vacilo ficar contando essas coisas pra ex, champz. @Tonkiel Esse! @mariana_godoy Sorteio do terço!!!! Obaaaaa!!! 🙌 @Tonkiel @joaoamoedonovo Instala vc, cara! Ps: Não sei pq to dizendo isso. Achei q tinha q falar algo. @joaoamoedonovo Fica aqui aquele abraço pra TIM que trabalha nas duas frentes: é celular e tb é esgoto. 🙏 @marigraciolli @naosalvo Se conhecessem teriam descoberto que não precisa se matar no Crossfit para ter músculos de um campeão. @_karoliiima 😉🙌 Obrigado por curtir meu trampo por tanto tempo... por me defender nas discussões da família... por acompanhar meus passos nessa busca interminável por realização profissional. Faço hj o q eu amo do lado de gente que sempre admirei... graças ao apoio de quem me curte. Obrigado. https://t.co/gFSrzIOYDC @Tonkiel Carpool lane - Curb your enthusiasm. 🇧🇷 + 🇺🇸 https://t.co/zbNT6Wd0VY One of the greatest is launching a new special. You should definitely watch it!  @GaryGulman https://t.co/7obzIfItOT RT @rafinhabastos: No ar o MAIS QUE 8 MINUTOS com o João Amoedo (@joaoamoedonovo). Grande papo! https://t.co/lnBwrno7kE https://t.co/2Aqeyd… @monark @izzynobre https://t.co/EsvsaUz5Az @peterjordan100 Assustador @folha Diz leitor? Este é o relato mais triste da história da Internet brasileira. https://t.co/rUSbUmNBoh Cara... Nando Moura sumiu pra fazer implante capilar. Certeza. Cortou o cabelo... postou um vídeo do corte em que não mostra o topo da cabeça e sumiu! HahehhHe! Que coisa maravilhosa. Bolsonaro só vai aceitar os $20M da França pra Amazônia se o Macron pedir desculpas. Ele também pediu de volta a lancheira do Ben10, o pacote de traquinas e mamadeira do cebolinha. https://t.co/4QHUkFiwVq O curioso caso do delegado de Porto Alegre que virou escritor de ficção. Muito orgulho de ter ajudado meu parceiro @MarcoADSouza1 a realizar um sonho. Bela matéria da @GauchaZH: https://t.co/hsGcncbtOv Huck hoje / Huck há 2 anos. 👍 https://t.co/nGNHtjE3Qi @marigraciolli Ah sim! Muito bom sim! Galera quer atacar quem tá em cima. Nisso concordo super. Tem 786 Drakes e ninguém fala nada. @marigraciolli Mari.... Referência tem limite. Vocal, bateria... guitarra. Não sou especialista, mas tá parecendo um Roubinho maroto aí. A Fernanda era legal pra caralho. https://t.co/sD7glB9OML @samirsalimjr Hahheahehahhw Isso a Globo não mostra! https://t.co/vyffmHQA57 @imdeadmannn @meteoro_br 😥 Melhor canal do YouTube hoje: @meteoro_br (https://t.co/aq05Or6HtK). 2º lugar: Marido da Tigresa (https://t.co/VjUE8jWRCx). RT @joaoamoedonovo: Participei do programa 'Mais que 8 Minutos' do \n@rafinhabastos! O vídeo completo está no canal dele! Assista!\n\nLink: ht… No ar o MAIS QUE 8 MINUTOS com o João Amoedo (@joaoamoedonovo). Grande papo! https://t.co/lnBwrno7kE https://t.co/2AqeydIoaP @Ely_de_Almeida Ganhei da Adidas, bro. Gastei 0 reais. @toledoluizf @demori Fui apenas 4 vezes. @CanalBigtoon meu velho... me manda as falas que eu dublo minha voz na animação felizão. Manda uma DM no insta pra mim. @marcos_rvn https://t.co/2f9IGujIg3 O cara saiu da Globo pro pornô. Hoje tá no programa com maior credibilidade do país sendo chamado de SENHOR. Dá pra ver sorrisinho na cara dele. O Frota é gênio. https://t.co/xKzoOEURys Agora o cara pára o carro no semáforo e vem estes anões fantasiados de Willy Wonka vendendo curso bosta. https://t.co/c4b2uzkbu7 @angeloaralves achei q não @UOL Hey @UOL! Deleta. Não foi isso que eu falei. O que eu disse foi: “O PRESIDENTE CELEBROU UM TORTURADOR... NÃO FEZ PIADA”. Ele nem teve o intuito de fazer rir. Foi uma homenagem formal. Não falei que não se pode fazer piada com tortura. Nunca diria isso. Enxame de abelhas na bandeirinha. Brasil pacaraio! Amo essa porra. 🙌 https://t.co/1zk8zBmWaY @FelipeHamachi Posta a minha parta falanu, caraio. @pauloem @Lets_Dex @JoaquinShow 👍 https://t.co/DCm9EzpF4t Entrevistei esses dois jovens hoje. 8 minutos é pluralidade, Manolo! @Haddad_Fernando @joaoamoedonovo https://t.co/Nz9kE2j9bp @andrebrandt E Netinho de Paula pré violência doméstica. Passei o bastão. Posso seguir a minha vida com o sentimento de missão cumprida. https://t.co/r9q98WshFq A definição de ‘GROSSERIA’. @SHAQ https://t.co/J7hqm1Qn1w @kellymatos @gabrieljacobsen @GauchaZH 🤷🏻‍♂️ Vamos ajudar! Vai rolar! @Gremio @todosnaarena @PaixaoGremio @torcidadogremio @GauchaZH https://t.co/379K8xBq8m Faixa etária procurada: -1 a -9 meses. Ser feio no Tinder não foi o suficiente para o João. Ele quis também ser odiado. Ps: Ainda pegou uma foto tirada na Tekpix. https://t.co/sRfafG8hBz Minha vontade de mijar é inversamente proporcional à proximidade de um banheiro. Impressionante. @LeloZG Ele mesmo @HenryCejudo @BulletValentina Afraid of Nunes??? Cute. @gutocouto1 Tb sei fritar hamburger. @RafaelLunes @joaoantoniocjr @JonathanNir Gente..o cara com 27 posta seguidos elogiando o Bolsonaro tem todo direito de achar sem graça uma piada que sacaneia o mito pra quem ele se masturba toda noite. Democracia por favor. @leandro221901 @RenatofilhoRTF 🤷🏻‍♂️ @me13 🙌 @schon_98 🙌 Meu pai é legal, não a ponto de me dar uma embaixada, mas é muito legal. #DiaDosPais https://t.co/Hr1DD2I1zl @zecabotequim @SpiderAnderson Valeu, bro!!! @juzao Essa porra só aparece quando desaparece. Que caralha! @Tontanive 🙌 @paulafsena “Que prestam”... errou a concordância querida. O Twitter vai banir vc. @henriolliveira Quem disse isso? Vamos aprender a ler, campeão. Porra, Brasil! Sério mesmo? https://t.co/ioZcO3GBNj Quando olho pra um deputado quero ver trabalho e não chilique na Internet. https://t.co/eEu7MLp9GE Ô... a turminha do “bandido bom é bandido morto” tá vendo Profissão Repórter? Cheio de gente na cadeia que não fez porra nenhuma. E aí? O que estão achando? @pintorrocha Pô... mals ae @lxpesmiranda @Another_Ventura Rolês randômicos por aqui Vâmo Inter!!! Inter 1x0 Cruzeiro!!! https://t.co/Nm5nOKY6r6 @jeneuston @BAFTA 👏👏👏 congrats!!!!!! @driccos Um absurdo... não tenha dúvida, mas eu sinto responsabilidade direta sobre o que faz a torcida do MEU time. Por isso, me manifestei na ocasião. Abs @fabioheinen @marcosdps Muda sim, amigo. Você só vai entender a piada se compreender o contexto. Abraço. @Santos_JonasB Ok https://t.co/qTWHe2cf83 Presidente @jairbolsonaro: Concordo em vetar o financiamento público de filmes como o da Bruna Surfistinha. Peço que o sr analise com calma o projeto infantil: Ester Tigresa, a rainha da floresta. Uma versão nacional do Rei Leão. Filmado todo num quarto no Mato Grosso. Obg. @oodiodobem Ou abraço de BH! 😘 https://t.co/KDDbO0x23c @oodiodobem Abraço de Montreal (Canadá). ❤️ https://t.co/iaI13shZJR @canalpame Não é uma questão de documento judicial. É uma questão do relato. Nem toda agressão ou violência vira processo, ainda mais depois que a pessoa morre. Está explicado no documentário o porque deles não terem tornado o caso público durante a vida do artista. @canalpame Assiste o doc. Depois falamos. To lançando o meu curso de educação financeira aqui no Twitter. Aula única. Quer ganhar dinheiro? Aumentar a renda? Melhorar de vida? VAI TRABALHAR E NÃO GASTA COM MERDA! Fim do curso. Obrigado São Bernardo, BH e Campinas. Os 1ºs Ilha de Barbados ao Vivo foram foda! SP, RJ e POA... tâmo chegando. Infos e ingressos: https://t.co/975qvTpSaw https://t.co/5Ylph5Xjzt @RizethJ @Anonymo__Brazil Segura a onda, Latoya Jackson! @Fernand35405610 @wekcha0073 Mano... olha à tua cara. Hahahhehe @wekcha0073 “Aqueles que vazam informações oficiais serão frequentemente denunciados, processados ​​ou difamados. Quanto mais sério o vazamento, mais feroz é a perseguição e maior a punição”. Não propaguem mentiras. @wekcha0073 Não se deixem manipular. A verdade está aqui: https://t.co/p1QizRvxUy A estréia do ILHA DE BARBADOS AO VIVO foi animal. Hoje estaremos em BH. Vendas: https://t.co/f8zMcCIos2 https://t.co/Ap5U1A7tQJ @braian @yuditamashiro Mano do céu. @jiaoguilherme @antoniotabet Porra.. o cara tinha 15 anos. Puta sacanagem. Todo mundo já falou merda nessa vida. Era um moleque, porra. @carapanarana Banido de 2 cidades pro criticar autoridades. Serve? Abs. @lucasfresno Young Wanessa Camargo. @peterjordan100 Ixi bro! Foi mal. Nem lembro, devo ter feito se sacanagem, mas tá super desbloqueado. Mals ae! 🙌 Tá cheio de deputado e senador ganhando dinheiro do povo pra ficar no Twitter. Descobriram que capitalizam mais fazendo barulho do que cumprindo suas obrigações. Vão trabalhar, caralho! @CNN Where is @bengleib??? Bring him!!! We wanna see him!!! @arielhelwani Couldn’t agree more Segunda-feira. https://t.co/avl3gMcqat @tonaraujo1968 Parabéns, cristão. Deus tá orgulhoso de vc. @engbadass @carteiroreaca Trouxa. É teu dinheiro. @carteiroreaca Cara, você é fiscal de piada mesmo. Hahehahehe! Vai trabalhar que o povo tá de pagando. Já é segunda-feira. https://t.co/rKT44xkNg4 @PatytaSuspensa Pô, tia... que agressiva. @RegianeLuuz Disse a pessoa q usou a palavra BOLSONARO nos últimos 53 tuítes. @valdecilima50 Não é meu herói. Nunca votei nele. @carteiroreaca Ahhh.. pena. Tadinho. Faltou argumento. Tava tão legal. E tortura é o povo pagar imposto pra sustentar deputado que deveria estar trabalhando e não fiscalizando humorista. Bjo no coração. Não. Sou contra a tortura... ao contrário do teu mito. https://t.co/170DlhO38j https://t.co/Lz606awqnz #Denúncia #JornalismoVerdade #Polêmica #Mundo https://t.co/bvMCw3tJRW @benebarbosa_mvb Só de palestrante. @edtakataka Pode hackers. Tranqs @anth0nykauan Não é uma má idéia. Acho que uma boa parte do país pensa como eu. O problema é que a essa galera não tem saco pra discutir política, daí os radicais de ambos os lados dominam o debate. Fica parecendo que o país está em guerra, enquanto a verdade é que a maioria tá de boa. Admirava a política social do governo do PT, mas tenho vergonha e raiva de toda corrupção que rolou durante os anos do partido no poder. (segue) Exemplo: Concordo com muitas medidas econômicas do Bolsonaro. Acho importante a desburocratização do país e a reforma da previdência... mas ñ dá pra bater palminha pra uso indevido de helicóptero da FAB e nem pra nepotismo na embaixada em Washington. (segue) “Se vc critica um, tá automaticamente do lado do outro”. Esse é o pensamento mais simplista e ignorante da discussão política atual. Cresce aí, caraio! (segue) @mmarianaff Jahahhahahhah!!!!! E foda-se se é o Moro, a Dilma, o Lula, o Papa, o Wanderley Luxemburgo ou o Tio Armindo. Não faz merda que tua casa não cai. Simplão. @danielcalou Se não tava fazendo merda... tranquilo. Vida que segue. Chega de chororô. @sufepa @Desesquerdizada Pô tia... não se chateia não. @iv2011m @Desesquerdizada HHhshhshahahe! Não caraio. Tortura faz o sujeito admitir crimes que não cometeu. Grampo grava o que o sujeito tá fazendo. Bem diferente. Foda-se... vc sabe disso. @Desesquerdizada Vc esta convidadisso a grampear meu fone. Fica tranquilo. Vai passar 80% me ouvindo falar sobre Minecraft com o meu filho e os outros 20% sou eu brigando com a AVIANCA. Boa sorte! @daniloscav Exatamente @john_dijon Se tá fazendo bosta, seja Dilma, seja quem quiser... tem que pagar o preço. Caguei pra fonte ou pro método de aquisição de informações. É verdade?!?! Então foca no conteúdo, caraio. Se grampear o telefone de quem não tá fazendo merda, não vai dar em nada. Simples assim. @marceloindaniel Natureza. Natureza. Natureza. Natureza. Natureza. Natureza. IFOOD!!!!!!!!! Natureza. Natureza. Natureza. Natureza. @TiciaEvans Olha vc!!!! 15 dias (24 shows) no maior festival de comédia do mundo, o @justforlaughs. Foi demais! Agora é hora de voltar pra SP pra ficar um tempo com meu filho que a saudade da foda. Ps: Post emocionadinho mesmo. Obrigado por torcer por mim. Quem deseja a minha desgraça, ora mais. https://t.co/UFcoybwnWX @GelminiJacques Eu até ficaria chateado com o seu comentário, mas vi a sua cara de trouxa e apenas sorri. Um forte abraço @ThiagoABDS94 Campeão, você está justificando uma manobra ilegal. Só pra te avisar aí. @maelfla @Brunopsicol Abraço do Canadá pra vc. https://t.co/gOm7o80UnH @Rony_Moraais 🐄 @andrees_m12 Tão jovem e tão gado @Brunopsicol Só li mugido. @Brunopsicol 🐄 😂 @AlexandreMaranh @JoelPinheiro85 🐄 Pede pra ele tocar aquela que é mais ou menos assim: “Sei que vc sabe / Nossa paixão é explícita / Sou teu helicóptero da FAB / Me usa de forma ilícita”. 🎵 https://t.co/Qb9fThsE83 @psantunes @lelispatricia Concordo muito. Mto mais legal ñ se levar a sério. @caesar_teophilo @Anitta Mano... eu tô elogiando. Puta aprendizado importante. Não sei aonde vc viu ironia. Educação é um direito de todos. Parabéns, @Anitta! https://t.co/0aaIZ1sToM @jorgerbj Hahhshhe! Possível q sim @goiasoficial Vou poder acompanhar as partidas no XVIDEOS? Quando eu faço uma boa ação. #IMPENSÁVEL 😂 https://t.co/eKsUWeWZDy @paulaschubach @justforlaughs HHahhhehhe! Concordo https://t.co/VIhjoSdljS @marcoscastro Foda @danisuzuki 🙌 @Tonkiel 🙌 Foi! Pra quem duvidou, tá aqui. Não vou postar foto de ninguém. Da próxima vez, ao invés de questionar quem quer ajudar, AGE. Abs. https://t.co/IHmV9ejf44 @jnflesch Vamos ver no que isso vai dar. Que seja um banidos todos dos estádios. Valeu! E que eles 3 sejam banidos dos estádios pra sempre. Não tem volta (detalhe pra faixa da torcida anti-fascista... tá bom)! https://t.co/sTAiJtUkKD Consegui falar com a mãe agora (ela me seguia nas redes). Apesar da palhaçada, o pequeno tá bem. Ele recuperou a camisa. Combinamos a entrega dos presentes (que não pretendo postar). Tenho um filho da mesma idade e foi foda ver a imagem... mas felizmente tá tudo bem. 🙌 @tainamoraes2 @IJessikinhaI @maoritmicaazul Uma olhada no que? Balançar uma camisa justifica essa agressão com uma criança por perto? Você está louca? @Tonkiel @ThiagoFloriano_ Manda por DM @pam_gfbpa @Leogerchmann @ThiagoFloriano_ Por favor, cara. Me manda o contato. Não sei como faço pq não quero colocar meu fone aqui. DM no Instagram funciona. Gente... as minhas DMs aqui não estão funcionando. Travou. Por favor... me mandem DM no Instagram. É @rafinhabastos lá também. Cara... que cena triste. Se alguém conhecer a mãe dessa criança, por favor me passar o contato por mensagem direta. Quero dar todos os produtos do Grêmio que ela quiser na vida. https://t.co/mbg3LooSob Show solo no Just for Laughs, em Montreal (CA), com ingressos esgotados. Agora, só no Ethnic Show. As 2 sessões de hj estão esgotadas tb. Amanhã tem mais. https://t.co/P9oeuMUGAR @CrisMenshova Isso. Piada = Presidente direcionar os recursos do cinema para defesa e divulgação de sua ideologia religiosa. Boa! @JHabbey Manda um abraço pro CARAS. @JHabbey Spectreman?!?? @deise196 @correadearaujom Acorda tia! https://t.co/f457Km3zx7 @sisasantos Acorda tia. Tá na hora. @manubarem @lucasfresno Ele me roubou um tênis e chutou a cara do meu cachorro. @GuiTome O cara é um playboy carioca que DESCONHECE o Brasil. Passou anos ganhando pra não fazer porra nenhuma e não faz idéia do que é o país. @anagalv84953226 Oi amiga! Nunca disse que quer o socialismo no Brasil. Sou super capitalista. Sempre fui. Não sei de onde você tirou essa informação. Um abraço @GSantelli @OsmarTerra A propósito, ele vai morrer e não ver tudo sim. Tem muita coisa pra ver. Não dá tempo de ver tudo antes de morrer. @tdxcachorao Bro... vc tá forçando o bracinho na foto do Twitter. Ahhahwhhahhs! Abs @flaviogarage @jairbolsonaro Heheeehshahaeehe Semana passada estava abrindo as pernas pro Trump e agora vem criticar a Bruna Surfistinha? Coerência, senhor presidente. Por favor. https://t.co/gLLibpBmuY @jairbolsonaro Semana passada estava abrindo as pernas pro Trump e agora vem criticar a Bruna Surfistinha? Coerência, senhor presidente. Por favor. @OsmarTerra Pq a tua campanha é uma bosta, campeão. Abraço. @Bnsilva89 🐄 Minhas mentions depois que respondi o Bozo. Tá bonito. Pode vir que o pasto é extenso. https://t.co/iMgjaUbGao @opaulojp @felipeneto @DaniloGentili Fala amigo, gado! Tudo bem? Procurei a palavra ridicularidade no dicionário e não achei. Não conseguirei, portanto, responder a sua mensagem. Um abraço. @bipolar_sincero le a minha resposta campeão https://t.co/bKp6RqPre6 Fumei maconha e fiquei preso na letra “O”. https://t.co/ginVFJFhUm @jairbolsonaro Show! Só falta a Universidade Federal de Sergipe que tava suspendendo as atividades por falta de repasse; a de Brasília que tem déficit de 100mi e a de Santa Maria que demitiu trabalhadores e suspendeu obras. Vai fazendo aí que qdo estiver resolvido eu mando mais. Forte abraço! @jairbolsonaro A Universidade Federal do Mato Grosso ficou sem luz após atrasar o pagamento de contas de 2018 e 2019. Se quiser acionar o MEC pra fazer intervenção onde realmente precisa (e não pra fazer propaganda ideológica), dá um toque aí, campeão. RT @CTVChristine: The Ethnic Show continues @justforlaughs with @cristela9 @iamrobbyhoffman @davemerheje @anthonydevito_ @rafinhabastos @do… @lucianopotter @mariruybarbosa @instagram Foi o Intercept. @SF_Moro Boa tio! Fica aqui no twitterzinho... não usa mais Telegram pq que a galera descobre os esquemas do sinhô. @kumailn I hear the same every day. It always my mom calling me from Brasil. @jairbolsonaro Isso é um documentário, champz!!! Seguindo a mesma linha, o senhor tem que ver a história do navio que afundou. Imagens do Leonardo DiCaprio em câmera escondida. Não vazou por acaso. @carteiroreaca @DaniloGentili Eu até ficaria bravo, mas vi no Twitter você defendendo quem acha que a terra é plana… e apenas sorri. Abraço Tio. @fserb Valeu bro!!! Minha turnê na Rússia bombando. https://t.co/VbVlZi1Zs0 @kevinbrennan666 Nike @Matheus94776797 @dinizleoo Forte abraço, Matheus! Chupa Léo trouxa! @Kidids @chicobarney Sempre achei ZÉ CARIOCA uma redundância. Se é Zé, ñ precisa do carioca. Acho daora deputado que vota contra o partido. A turma lá: “Todos votando assim, hein? Combinado, turma?”... e o cara: “FODA-SE! VC NÃO MANDA EM MIM, ZÉ POVINHO! MEU PAI MORREU EM 2011”... e faz o que quer. Bonito. Fica aqui o meu forte abraço. @pavilhena 🤷🏻‍♂️ Eu na Globo. https://t.co/clNjUfe1vi @naosalvo Achei importante dedicar um segundo a defesa da própria mãe (“não a minha.... a tua que dá!”). Frio monstro. Fui mijar e meu saco parecia o véio da Havan. Triste isso. @bicmuller @Biakicis Hehehehe Sou apenas um espermatozoide cansado da vida. https://t.co/d5cSQvRiHR @pnanadquemtalen Nunca mais repita isso sobre o Mestre do Capitalismo. Our friendship is over, buddy. @Kausanciao Hahhshhe! Valeu! @pnanadquemtalen Pô... sou mó legal. Minha mãe repete isso com bastante frequência. RT @ComedyJuiceNY: NEW YORK CITY!\nDon’t miss our show this Tuesday at @GothamComedy at 9:30!\nClick for 🎟🎟👇👇\nhttps://t.co/wMOSZshafY\n\n#Comed… @cauemoura Agora fu/deu pra mim. Ano passado eu assisti 10 jogos dos clippers. Esse ano o ticket vai custar a puta que pariu. @willzeruela Pô... nem recebi. Senao eu mandava Moro? Reforma da previdência? Vazamentos ilegais? Enquanto vc perde o seu tempo com estas bobagem, o jornalismo do UOL foca no que o Brasil realmente precisa saber. #Denúncia #Polêmica https://t.co/VFhbpgQUiv @assimdisseojoao Bonito. 🙌 @tais_negrao Pô, tia. @HitTheGlass Essa vagina. https://t.co/3kUuwzihRl RT @rafinhabastos: Ontem estive no podcast do @joerogan. Foi muito foda. Assiste ae: https://t.co/EsvsaUz5Az https://t.co/7YivXv6fja RT @caitomainier: o problema desse video é o excesso de SENSIBILIDADE desse profissional, @rafinhabastos ! https://t.co/LxudJlNJb6 @caitomainier Gostosas e inesperadas gargalhadas com o falecimento do amigo Renato. @BolsonaroOlga Deus tá triste com a senhora. Ele me contou. A senhora não vai pro céu. Infelizmente. @daigooliva Vc tá comparando roteiro de cinema e podcast? Parei aqui, champz. RT @TheLaughFactory: We’re getting the Brazilian perspective on L.A. from the extremely funny @rafinhabastos #hwlaughfactory #hilarious #co… Não, você não tem personalidade forte. Você é só insuportável mesmo. Abraço. @rosanakeller Disse a pessoa que há 5 anos tuitava pra Sonia abrão. @andersonzhuri 👍 vc é um vencedor. https://t.co/0L3iYwkoFq @BolsonaroOlga Boa cristão vc. Deus tá feliz com a sua conduta. 👏👏👏 Minha namorada descobriu uma série de mensagens eróticas e nudes que troquei com outras mulheres. Felizmente consegui provar de que o vazamento foi ilegal. Continuamos juntos. ❤️ @lucasfresno Parabens ao casal! ❤️ @cauemoura Has hahehhsheh @Kidids Hahhshhehe @LuizThunderbird @astridfontenell @rodrigoleaooo Cuca ❤️❤️❤️ @MarcelMelfi @subtosco @CanalDoOtario @henrybugalho @cauemoura Hahhshhehe @ManoDoCeuGab @ssjubs Eu morri mesmo @MuseWendi 10 years ago... in a market that never had stand-up before. He learned, evolved, changed and today owns a comedy club generating jobs in a poor country with a huge unemployment rate. Just updating your tweet. Conheça o MESTRINHOS DO CAPITALISMO... pq feliz não é quem brinca, é o dono do brinquedo. Veja: https://t.co/PYRNpcPGca https://t.co/e2aZufPQ6h @camillagp https://t.co/LzNyFWU0kk @vp11_8967 É o mesmo elenco toda noite de show. Eu vou estar em todos os shows Deus do céu! Agora foi! Anthony Davis por Ingram, Lonzo, Hart e 3 escolhas do draft. WTF!!! O q vcs acham? https://t.co/rHvCjXTMJq @victorcamejo @lyotomachidafw 🙌🙌🙌 Boa @lyotomachidafw!!! https://t.co/MODdaF081s @GusLanzetta Qual o sentido disso? Tu tem meu telefone, campeão. Eu tô aqui. Quer esquerda? Assiste com o Gleen Greenwald: https://t.co/pdGy8f0lC4, com o Boulos https://t.co/K80ZBQSPvF e com a Carina Vitral https://t.co/KavdPqV5Nc. Qualquer coisa, deixa de ser mocorongo e me liga. @ELDER_Cerberus Que papo é esse, campeão? https://t.co/xwpkMuVuSC @Eduardocavaler2 Hahehhsheh! Boa. Manda mais O carro do Nando Moura é zoado??? Como assim??? É só uma réplica nacional??? Oqtacontecenu??? Não manjo de carro alguém explica!!! Isso é calúnia... ele é um Mestre do Capitalismo, gente!!! Vcs estão loucos!!! Luana Piovani, obrigado pela homenagem... mas ACABOU! Faz tempo. Fica aqui o meu carinho e minha solidariedade nesse momento difícil. #diadosnamorados https://t.co/85Eb3rAWnc @antoniotabet E quem celebrou os 2 e acha que quem faz esqueminha tem mais é que se fuder? 60% do país... certeza. @assimdisseojoao Hahhwhshhe 🍻 @DerosaGiovana 🙌🙌🙌😉 @jeneuston @Nick_Wechsler Uuajehhahsh @nder_son Mas levo uns não malucos tb Quando eu levei o @OscarFilho pra passear no parque do Ibirapuera. https://t.co/DgSQgjUHHL @trajanoo7 @Gui8seven Heheheheheh RT @HollywoodImprov: .@cristela9 @realianbagg @RafinhaBastos @ismocomedy @owensmith4real &amp; @AndyKindler are here Thursday at 8! 🎟 https://t… Balada... pq dançam? Pq pulam? Pq tanto barulho? Sexta que vem, no Globo Repórter. Libera essa maconha de uma vez. Não existe droga tão insuportável quanto maconheiro engajado. #legaliza Só uma coisa pode tirar o foco da direita: uma caneta BIC. https://t.co/ENKryXQPHC Hey! @naosalvo? https://t.co/8zIHQDdbIS @unosemcontextos A minha ida pra morar em SP se deu com a grana da perda total de um UNO (8 mil reais). Um vermelhinho que eu tinha. Era MILLE. @unosemcontextos Tive 3 @joaogps_ Hahhwhshhe he @GuedesHyure Sim... tá. Merecidamente. E aí? Não entendi, querida. @naosalvo @samirsalimjr Q maravilha @Muyloco Que animal!! Bel Marques bombou no protesto com o sucesso: “🎶 Vcs são CHICLETE e eu sou o BANANA 🎵 ”. https://t.co/1QqY57MkAL @odiodobemnews @moura_101 Em cima do carrinho pra não levar pescotapa (ou então de photoshopou numa foto do Chiclete). Mais corajoso do que dono de perfil anônimo no Twitter que se esconde atrás de logo. Agora sai do celular que a mamãe tá chamando pra tomar banhinho quente, beber Nescau e fazer naninha. @adaobispobr Uhehehehhe @cigarrobarato Melhor fio-me Eu acho muito daora quando artista sangue ruim é desmascarado. Já conheci muito mau-caráter q o povo ama. Quando a casa cai, é lindo. @pathy Cada frase tem um movimento dos braço. Curti. @eupilo @IcarodaMata13 Uhahahehahe! @DiVasca 🤷🏻‍♂️ @opropriolavo Eu tenho respostas pras suas 3 primeiras perguntas:\n1 - Tio, chega de falar bosta.\n2- Tio, não fala merda.\n3- Tio, quietinho q tá foda. @Dustin_Ybarra You are a lucky man. I wish could say more... but I have a few groceries to deliver. Ae MouroMinions! Bem-vindos. O Nescau de vcs tá na geladeira. Amanhã 14h publico uma resposta ao vídeo dele de hj. Já convidei o mocinho pra me encontrar pessoalmente, mas a moça tem medinho. Até amanhã. Eqto isso, coloquem um casaquinho que tá ficando frio. Bjo no coração. Um sopro de esperança para o sistema educacional brasileiro. https://t.co/JHW66I1l69 @insiderfox2 @RenatoCaldas 🤷🏻‍♂️ @lelezinhamattos Sim, foi. E sou contra. Independente contra quem seja. Esse é o Kawhi Leonard jogando manco. https://t.co/ByyUk7iysk @RicardoPipo Foi erradaço com ela... obviamente, mas aí vou apoiar o mêmo golpe com o outro? Ná. Votaram... fica. @henriquewicz Pode ser. Mas que algo seja provado. E digo mais... pensa bem se o impeachment não vai aumentar o merdel. Eu não quero militar no poder. Acho o risco ainda maior. Desculpe ae! A esquerda que torce pro presidente cair por “falta de governabilidade” e essas abobrinhas, precisa olhar pro passado recente do país e tomar vergonha na cara. É hora de entender as cagadas que cometeram e repensar o futuro. Do jeito que tá, a relevância chega a zero já já. Enquanto ñ for provado nenhum crime do presidente, impeachment é uma possibilidade absurda. Derrubar o Bolsonaro sem uma condenação judicial seria um tiro de bazuca da democracia do país. Foi eleito pelo povo. Segue o jogo. @Kidids Fucking amazing relato. Foda. https://t.co/xLKGett27R @bozomemes Hahehhshshhshshs Sensacional! https://t.co/4N2RGbOYJl @andrebrandt @letrapreta A versão br de The Bachelor pela Rede TV humilha The Office. @monicameireles Uma “mulher de Deus” falando essas coisas? @senierantos Bebelo? É isso mesmo, campeão? RT @craigpconant: New episode of @commservpodcast is up! I have my Brazilian brother @rafinhabastos on and we talk about how he’s famous an… @popocatugy @craigpconant @commservpodcast 🙌🙌🙌 @MariCabral00 @SuperCaruso Hahehhahe! Muito bom isso. Eu com filtro do Instagram viro a Fátima Bernardes. https://t.co/1TOqLOm8dt @giovannoni12 Culpa? Tu tá louco, Guilherme?!?! @MarcoADSouza1 Pelamordedeus @otaviano Bato uma punheta muito fera. Essa foto merece prêmio. https://t.co/EGN7zLrITb @Profile_carlos Pode crê. Sou mesmo. Tô véio Tá... legal vc com filtro de criança. Tá bom já. Obg. @imkelven @cauemoura @DanielAlderwei3 Comportamento ultra comum em valentão de internets. Que bonitinho eu ali equilibrado, racional e propondo a paz entre os povos (aka ‘Isentão do Caraio’). https://t.co/89CGVa437p @psantunes Olha q bonitinho eu ali. Super racional e amigão. @XtineBigHouse Só fun! Thanks for having me! @bicmuller hahahwhhahe! Aí o cara chega e tira os dinheiro da educação. Ahahehhah RT @DiVasca: Terminado!\nPC, @cauemoura e @rafinhabastos https://t.co/LtIFIB7BOi @wagnerlessasp Vc tem tetas. Abs @JonyPedro2 Vc usa boné dentro de casa, champz... quietinho aí. @pac_man @bferrari Parabéns, jovem. https://t.co/yw1iLaph4l @pac_man @bferrari No mesmo mês entrevistei Carina Vitral, Glen Greenwald e Boulos. Abs. @Kidids Eu sou @Padig Heheheahaw! Sinto-me honrado. Maldito ditado. Daí eu vou convidar abertamente o cara pra me dar uma entrevista, resolvo usar o DITADO do celular e sai “a” em vez de “há”. Se eu fosse o senhor, não topava e ainda xingava. @crawmari Tb achei q a gola alta tinha sumido e a senhora provou q ñ. Esse mundo é cheio de surpresas, não é mesmo? @oliviatomazela Mala pacaraio E vc tem medo do que? To tentando levar o senhor no 8 minutos a mais de 3 anos. Continuo no aguardo. https://t.co/BCQw4cGYn2 @odiodobemnews Champz... tua frase era “vc disse que a culpa era da galera que votou no Bolsonaro”... SEM EXPLICAR SOBRE O Q TAVA FALANDo. Achei q eram os processos. Tá tudo explicado aqui: https://t.co/l3IE3zsIpM @raulveiga Ae... de boas... olhei teu Instagram e e apenas sorri. Tira essa fantasia ridícula da 25 de março que vc usa pra brincar de igrejinha na TV e vem falar aí. Abs @NemethEsdras Tu não tem cérebro pra falar em nome de ninguém, iogurte de bosta. @Bimbatch Vê lá o q sai. Tá bacana @renataosilva HHahahhshas @Ariel34651786 Mais um covarde anônimo. Tá tudo respondido ali, amigão. @PredaconF @Fabioebenezer12 Respondido item por item. @OliveiraDco Pq champz?! Tá tudo respondido. @odiodobemnews ??? Não entendi. A fonte é ruim então a entrevista é de mentira? O que eles falaram não é real? Aprende a te comunicar, zebu! Pergunta: tu te esconde num perfil anônimo pra tua família não ter vergonha de ti? @yagoparola Ae seu bosta... tudo respondido @odiodobemnews Não inventa. Este papo de apagar Tweet é mentira. Prova disso é esse aqui: https://t.co/0f8OgNh9Tk que gerou matéria em tudo que é portal falando mal de mim e tá ali vivão. Tenta de novo. Pode vir! @odiodobemnews To aqui pro que vc quiser saber. Tudo q vc apontou tá respondido. E to esperando a tal hipocrisia que vc ñ provou. E este papo de apagar Tweet é mentira. A o rova tá nesse Tweet https://t.co/0f8OgNh9Tk que gerou matéria em tudo que é portal falando mal de mim e tá ali vivão. 👍 @PabloHoties @odiodobemnews Absolutamente nunca fiquei sabendo de entrevista do meu pai. Se comparou com nazismo, exagerou. Não tenho controle do que ele fala. @lporces Perdão. Tens razão. Enquanto vc curte a vida, Renato Aragão (vulgo Didi Mocó) está num cativeiro em Atibaia sendo torturado e obrigado a participar de vídeos bizarros que tem a sua monetização controlada pelo crime organizado. #FreeDidi https://t.co/ukiMmYLWzY @odiodobemnews HahahHe! O Texto do meu pai FUI EU QUE ESCREVI, ZEBU. Não vou ficar advogando meu curriculo pra mané que não dá a cara na web. Mas adorei o papo. Se quiser encontrar, só marcar. Tô em SP no mês que vem. Só vem de fralda pq cagão que se esconde em logotipo suja a calça. Bjo. @SargentoFAHUR @odiodobemnews Hahhwhshhe! Relaxa tiozão. Vai cair o bigode postiço. @odiodobemnews Mas quando eu disse que a culpa é de quem votou no Bolsonaro? Culpa do que? Bolsonaro nem tinha aparecido no Superpop quando essas coisas aconteceram. Mano... c é analfabeto funcional. @odiodobemnews O que tem a ver o ânus com as calças? O cara me apoiou... o que tem de mal nisso? Gente pra caralho me apoiou e bateu em mim de todos os lados. Teu argumento não tem nem sentido, campeão. @odiodobemnews AhehHheh! Caralho... vc nem assistiu o programa, trouxa. Se assistisse veria ver que EU MESMO entrevistei o presidente do Conselho Nacional dos Médicos que queria a expulsão dos cubanos. Mano... c achei que c ia pelo menos se informar pra parecer valentão aqui. @odiodobemnews Sim... tenho 42 anos e morro de medo de magoar meu pai. Se ele ficar chateado, eu posso não ir pra Ilha do Mel no final do ano. @odiodobemnews Nunca votei no PT na minha vida, champz. Nunca. Mais mentirinha de anônimo. @odiodobemnews Não é pq sou colega q preciso concordar com tudo. Defendi ele dessa vez, como já defendi em outras. Se não concordo com algo... não defendo. @odiodobemnews Nunca fui censurado. Nunca. E nunca disse que fui. Vc nem sabe o que vc ta falando... mas repito: fácil inventar qdo nem identidade o trouxa tem. @odiodobemnews Sim champz... quer saber? Fui suspenso e senao aceitasse a suspensão estaria fora. Não aceitei. O tipo de coragem q imbecis como vc q nem a cara da na Internet não tem. @odiodobemnews Mostra onde eu disse isso? Tá mentindo, amigão. Bem... pra um coitado q inventa perfil anonimo não é dificil. @odiodobemnews AbsolutaMente nunca disse isso, champz. Melrose Avenue, Los Angeles. Ae mãe... olha a cara feia do seu filho em Hollywood (ou como vc chamava o cigarro: Oliú)! @HollywoodImprov https://t.co/gExGssazrD @odiodobemnews Se não quiser passar vergonha com esse perfil anônimo pra todo mundo ver, fica tranquilo. Mandei dm. Ainda to esperando. https://t.co/tNNp59yH27 “Matar negro é adubar a terra”. Relato do meu irmão Marcio Chagas (amigo desde os 7 anos de idade) sobre o racismo no RS. Ele foi árbitro de futebol e hoje é comentarista da Globo de lá. Bela reportagem. https://t.co/eVNxjmW82t @odiodobemnews 14h em Brasília... continuo esperando. @odiodobemnews Pode me dizer qdo fui hipocrita campeão? @NBABrasil @Al_Horford De cima pra baixo jogando a bola no chão??? Vamos esperar aquele toco de baixo pra cima jogando a bola eternamente pra cima... até ela vagar pra sempre na estratosfera, Zé Boca! @brunobiancoleal Vamos marcar isso aí! Com prazer. @bicmuller @gabibianco 1,98 @tangerinav221 Uhahjahahehs Se você não pode vencê-los, junte-se a eles. Fiquei fã desse cara. Espírito esportivo monstro! https://t.co/zW0ntFBHCU @Victorkzx Desculpa cara. Minhas sinceras desculpas. @diegoborges Foda. Puta golpe Ultimato? Senhores Vingadores... meus advogados entrarão em contato. Ps: Vai rindo aí do $ que perdi com processos. O jogo virou! Toma essa, Zezé de Camargo! https://t.co/cEr525XuO9 @andrebrandt UHahehh! “Mesmo vcs duvidando” é ótimo. É como dizer pra namorada: “Não importa que o mundo te ache horrível... pra mim você é uma gata”. O elogio perde um pouco do efeito. @andrebrandt Era um troço com a galisteu né? Ouvi falar disso aí. @andrebrandt Era Quela bosta das mulher rica. Certeza. @andrebrandt Acho triste que o “Chupando Pirocas com Carlos Nascimento”, tenha durado apenas uma temporada. @andrebrandt https://t.co/OgfKvcgX3T @andrebrandt Cumpadi Washington &gt; Papa. @andrebrandt Nossa... essa eu ouvi 10000 de vezes em todos programas que envolviam hermanos. Depois do Kirchner e da Evita, o Jimmy Fallon é o homem mais celebrado da Argentina. @andrebrandt Comentarei. Postei uma edição bem foda do ‘Mais que 8 minutos’ de ontem... com o @ggreenwald. Um papo muito legal. Assiste aí! https://t.co/21Wq15sJad https://t.co/2CCUBnJ0ji @OutroEdu @craudio99 Tá enganado, campeão. Critiquei a decisão pra caralho aqui no Twitter... lá atrás. Só buscar aí. Foi em 2016. Antes de chamar de machista... te informa, campeão. Abs @tigresaester Impossível. Spiderverse sai em blue-ray só em junho. Sorry. @craudio99 Justiça foi envolvida? Ele foi processado? Perdeu? Não? Então não é a mesma coisa, champz! Isso é coisa de empresa babaca. Ele que vá buscar os direitos dele e era isso. Abs Agora me deixa em paz q tô fechando The Last of Us no PlayStation e a fase 4 é impossível. Se vc souber como mata esse zumbi de verde que parece a Gretchen, me fala. Já morri 12 vezes. Meu apoio nunca foi ao sujeito e sim a causa. Repito: Liberdade de expressão é irrestrita ou ela não existe. Agora... quer saber mais? Pergunta pro cara. Acredito que ele deva ter uma explicação decente pra isso (segue). Agora tem uma galera achando que tô quieto pra passar pano pro coleguinha... então repito aqui o que já disse: Qualquer tentativa de calar um cidadão, seja ele comediante, jornalista, político, malabarista ou engenheiro civil, é um equívoco (segue). Após eu publicar um vídeo apontando que o perda do processo do Danilo era um atentado contra a liberdade de expressão, sai uma matéria dizendo que o próprio, que luta pra ñ ser calado, processou 4 pessoas por crimes contra a sua honra... inclusive alegando injúria (segue). Já em 2011 eu batia na tecla que injúria e difamação são ferramentas que ameaçam a liberdade de expressão e a democracia, mas eu era só um imbecil que queria o direito de ofender. Em 2019 tem comediante, jornalista e até revista sendo calados. E aí? ACORDOU, CARALHO?!?! https://t.co/ZkC6Fzw1GN Valeu San Diego... mais um show foda aqui nos states. 🙌🙌🙌 https://t.co/Fc83MtMW7O @GuiFlesch Na foto do seu perfil c tá forçando o bracinho, rapaz. Quietinho aí. Orlando 1x0 Toronto... Brooklin 1x0 76res. Esses playoffs da NBA vão ser loucos demais. Demais! https://t.co/Mnxh0jeivL Um podcast muito legal comigo em inglês. Confira o resultado do meu curso “Inglês em 4 meses ou seu dinheiro de volta”. The Checkitow Podcast on @LATVnetwork with @humbertoguida: https://t.co/LNT0d3SgsZ Pra que brigar, Brasil?!?! https://t.co/S7N1W7GH6F Essa história do Danilo: Puta palhaçada. É um absurdo qualquer indivíduo ser condenado por algo que disse... por mais absurdo que seja o que foi dito. Liberdade de expressão é irrestrita ou NÃO É REAL. Simples assim. Falei mais aqui: https://t.co/IkvHj3nKQl @FabioPorchat @DaniloGentili Cara... todos nós já fizemos piadas boas e ruins. Um colega não pode virar juiz da piada do outro. O que importa agora é que um colega está tendo a sua liberdade ameaçada. Simples assim. @GiBmvb @NakedDog @lovevs9 Concordo muito @tosquista Ah hahehhahe! Do elogio a humilhação em 6 palavras @otaviano Hey... caiu um botão da tua camisa enquanto vc escrevia isso. https://t.co/d75jaHwMYo @YgorFremo “Curto mesmo é um sertanejo“, disse a menina após 16 minutos de beatbox desse cara para tentar impressioná-la. @omoristas Vou mesmo Mano... tô querendo muito ver o filme do Pokemón. Confesso. Acho q ñ entenderam o meu Tweet. Não tem ironia ali. Só existe uma coisa mais irritante do que a proibição da maconha: MACONHEIRO ENGAJADO. Nossasinhora como irrita. Legaliza a canabis de uma vez pra essa maconheirada chata parar de encher o saco com discursinho de merda em câmera lenta. Jah pro raio dos infernos! @maluugomees Poutzzzzz!!! Sorry. Ve se ñ rola ir acompanhada de maior Cheguei na academia do prédio. Vazia. Peidei altão. Tinha uma menina no canto fazendo abdominal. #winning @EricoRoger 🙌 @JulioPither O melhor @LlianRibeirode1 🙌 @arrobazipmail I Hahhwhshhe! Devia ter tirado @diriev 🙌 @Jorge_Aguiar2 Valeu meu velho! Nana-nenê. Tô completando 15 anos de stand-up. Esse vídeo tem 13. Foram 3 especiais na Netflix, 1 dvd de ouro, 4 voltas pelo país e agora um começo de carreira internacional... e ainda curto muito fazer isso. Obg a todos que acompanham essa minha jornada há anos. https://t.co/e9yxW2wa8R @GaryGulman @YouTube Thats awesome!!!!!! @LubaTV Q lenhador hipster te picou???? @bicmuller Concordo. É gênio @victorac @tosquista And also the president: AlreadyGo NaroPocket. @BolsonaroSP Nada disso me parece justificar os assassinatos, a tortura, a perseguição contra os tais “inimigos do regime”, a censura do pensamento e o controle da imprensa que se sucederam. Se vc tem uma explicação plausível... adoraria ler. @BolsonaroSP Daí o exército se empolgou e saiu torturando, matando, calando, atirando e controlando. Vai ter parte 2 no vídeo? @jr_dema Ok, mas Teu avô é um bosta. Abs @El_Doutrinator Quanto a isso... caguei. Abs @El_Doutrinator Você tem razão. Por isso que apaguei @jr_dema Te garanto que é @Rodes40 1 milhão de trouxas @michel633 @cahmilacomc Porque as pessoas não entenderam e achavam que eu estava apoiando a Globo @EDERSON03517531 Olha o que você está escrevendo usando a foto do seu filho. Que bonito. @cahmilacomc Me desculpa. Seu avô é um bosta assim. Um forte abraço “Meu avô viveu na época da ditadura e disse que era uma maravilha”. Pois seu avô era e continua sendo um bosta. Abraço. @CristianoGregio Champz... vc é jovem. Acorda aí. Abs @SargonC @jhonyromano 🤷🏻‍♂️ @PauloELemos https://t.co/9oBjuxelwV Mensagem do presidente pra você. https://t.co/xMznu6oX4V @RachelSherazade Obg por fazer isso. @diegomachado73 “Pra mim”... que pra mim o que?! Vai estudar. Jornalista, músicos, poetas, comediantes e políticos contrário ao regime foram torturados e assassinados. Não tem “opinião” nesse caso, Manolo. @thiagowalker @paesdigo 🤷🏻‍♂️ @danielortop Legal, champz. Cancela as aulas de história. Essa galera que nasceu depois do século XV fica querendo cagar regra sobre o período jurássico. Um bando de trouxas. @OsmarAlbuquerq3 Fica aí a oportunidade você deletar esse comentário. Dá pra entender a frustração do cidadão com a esquerda corrupta que presidiu o país, mas achar que golpe militar precisa ser celebrado é pedir pra levar choque na teta e acordar com o ânus cheio de furúnculo. Forte abraço. @nepopop Nossa... tirou da cartola. O cara sente saudade de comentar o basquetinho. A gente entende. @It_Thaaay @carolmanganaro @GracyPerez @tigresaester Mas só aparece c vc segue ela Doces palavras de @cauemoura sobre  banheira de Nutella. https://t.co/WfGWM3Mh4P @carolmanganaro @GracyPerez @tigresaester Porque a gente? Deixa moça ser feliz. Não gostou, não acessa @gustastockler Puta presente caro q vc tá pedindo. https://t.co/HT5VcgdMBn @mariana_godoy Que fim de viagem trágico. @ReisMarcelo4 Mano... tuas piadas são uma bosta. Abs @Clayton6622 HHahhshhehe #10YearChallenge https://t.co/cm3KiBrMgX @lolenantes Não.. Na terça e curto de novo. Eu devo voltar logo para fazer um longo @lorenapachecco Da próxima vez, faço uma headline gig e aí mando 50 minutinhos. Obg pela visita. Bjobjobjo Sinto muito orgulho de mim mesmo quando saio de casa com 100% de bateria no celular. Super adultinho. @lolenantes Obg pela visitaaaa!!!! @paulocuenca Só não precisa sentar em cima. @Lima_Lucas Entregar livro na biblioteca? Esse email veio de 1982? @joseaug45709800 Poutz... ñ tinha visto isso. Caraio @marigraciolli Maricota... Você conseguiu incrível façanha de combinar CrossFit e feminismo. Vc ta bem? A BETEMER tem um recadinho pra você: Desculpe a corrupção. https://t.co/X0kojTWqWE @tigresaester Menina... sua vagina está aparecendo na foto. Acho q a saia tá curta demais. @TEICHMANN10 @NBB @BasqueteSCCP @giovannoni12 @Shiltonsantos @femedeirostt @TonhaoRomero @JorgeDesa Quebra!!! Não é teu mesmo!!! Depois a gente quer bater bola e tá quebrado, porra. @rosana Obg querida! Bolsonaro zoando o tio laranja. https://t.co/6r9EXvKc8w @cauemoura Taquispariu. Foda @antoniotabet Período de eleição passou. A bolsa sempre cai mesmo. Mãe... tô em Hollywood. Obg a todos que estão acompanhando essa jornada. Vâmo!!! @TheLaughFactory https://t.co/seuV6XxdTp Eu ri disso. #MemeVéioRulez https://t.co/u3HZqd95iW @rikolbe Parabens. Das 2892 mensagens que recebi, a sua foi a primeira negativa. O que me leva a crer que vc é um puta mala do cacete. Abs @UFCBrasil @ClaudiobjjSilva Vamos amar uns aos outros... disse ele após enfiar a mão na cara do seu adversário. 🙌🙌🙌 Real. Tadinha. https://t.co/hnMObACR0l Nova York, Rhode Island e San Diego... tô chegando. Infos e ingressos em https://t.co/gFpeRUgw8x https://t.co/b3EWqBU2Z2 Instagram fora do ar. Pena. Saudade de me sentir inferiorizado pelas suas vidas maravilhosas e seus corpos perfeitos. Volta logo!!! Whatsapp e Instagram estão zoados hj? @leticiapearljam Parabens aeeee!!!! 🥳 @Fabiohe2011 Eu acho daora ele postar... não acho daora os motivos pelos quais ele postou (pela moral e pelos bons costumes). O fato é que postou... e isso é show! Acho da hora o Golden Shower em público... também acho daora o presidente do país postar o vídeo. Quem ñ se choca com o ato, não pode se chocar com a postagem... aí é hipocrisia, caraio. @FeCastanhari Os cara jogaram ela pq tavam cagado de medo que eu to ligado. @jairbolsonaro Estou acompanhando o curso sobre sexo anal, Jair. Os desvios de dinheiro do PT, as denúncias contra o seu filho e aquele seu suspeito uso de verba de moradia me machucaram demais. Se vai continuar metendo no meu cu, que pelo menos eu aprenda a conviver com a dor. Defesa pessoal. Hoje: tapa. https://t.co/ZbrihUdawt @jairbolsonaro É quando a pessoa mija na outra na hora do sexo, Jair. Transando e tals e aí rola aquele mijão maroto. Provavelmente foi criado por um Indivíduo influente que sofre de incontinência urinária severa. Espero ter ajudado. O banconzitos sagrado 🙏 (por @YudiTamashiiro). #ElmaChipsDeDeus https://t.co/khr0Povo6x @dressabass Já eu acho que é moça inchada com os braço gordo. @YudiTamashiiro @dressabass Caralho velho. O que que tinha nesse baconzitos? Botaram doRgas. @MiaMello A lista de Schindler. Mais chato que o carnaval só quem odeia o carnaval. O cara me descreveu com uma clareza impressionante. 👏👏👏 https://t.co/44T91Cmr7n @jpocosta @marcogomes CQC Manolo. Era grande pra gente Porra @canalCombate!!! Tô pagando isso pra que!!?!?!! https://t.co/ykAYgO0mv1 Nem tenho. Era zoeira. https://t.co/iz79FRx1A1 Mora em Rhode Island ou conhece alguém que mora aí? Faço o meu show  no final do mês em East Providence. Vai ser foda. Ingressos em https://t.co/T52JrwT3tF https://t.co/8mQKfN3Zvh Postei um vídeo hoje no youtube sobre o surubão da Globo. Fui assistir agora e senti vergonha de mim mesmo cagando regra e dando uma de moralistão. Apaguei. Foda-se. Na real é que suruba é show. Parabéns a todos os envolvidos. Favor enviar convite pro próximo evento. Fuma não pô, singaro dá cãrse. Obrigado, @lucasinutilismo. https://t.co/BSwBUdi6Lb @Diego_bsi Se vc gosta de porra, problema é seu bro @lmotabr Dei cotovelada em alguém? Agredi colega de profissão? Acho que não né. @gustastockler Caraio. Estudamos em escolas diferentes porque até hoje eu acorda feliz que não preciso voltar pra aula. Tenho 42 anos Atitude show do senhor @albertobial dando uma cotovelada num atleta. https://t.co/Ni93ZUYxiI @silviomjr10 @UFCBrasil @TMarretaMMA Ahhashhshehha @UFCBrasil @TMarretaMMA Teleférico @Lima_Lucas Tinha global? Eu na balada:\n1- Chegando animado.\n2- Dançando de leve.\n3- Destruindo na dança.\n4- Solidão batendo.\n5- Costas doendo.\n6- Querendo ir embora.\n7- Querendo muito ir embora.\n8- Em casa comendo pão, sorvete, assistindo a Rede Vida e prometendo nunca mais voltar.\nTempo total: 7 min. @vgualberto 🙌🙌🙌 @odiodobem Hahhehshwheh @taisilvas 🙌 O MAIS QUE 8 MINUTOS com o Boulos tá no ar. Aqui vai o trecho onde tiro a cueca do rabo e depois do saco. Íntegra em https://t.co/s6MacrdPlj https://t.co/WTQ6KO68Ej Gosto de uns meme véio. Admito. https://t.co/t66W2eCM43 Nenhum erro do Onix Lorenzoni vai ser tão grande quanto o que ele cometeu em 1999, quando sua clínica veterinária na avenida Getúlio Vargas em Porto Alegre (ao lado do Bauru Country) matou o meu cachorro Bidu. @Pirulla25 Pirilampo... assiste aqui: https://t.co/jxqncH6aps Assiste se! https://t.co/jxqncH6aps https://t.co/oMmb7eCyYT @oadmficoulouco Antes da babaquice dos tempos atuais em que vc tem que escolher um lado... isso seria conhecido como “um cara de cabeça aberta”. Aparentemente #EuSouInimigodaGlobo também. E eu nem sabia. https://t.co/ylWYFVF3lX Agora sim virou crime. https://t.co/uIgB6umUMj RT @felipesolari: O @rafinhabastos colou no Podcast do @joerogan !!! E isso é tão legal, que merece um video falando sobre a entrevista !!!… Lembrando que só rolou isso pela força que meu parceiro @FabricioWerdum deu fazendo o link com o cara. Nunca vou esquecer desse jeito, bro. Foda. Ontem estive no podcast do @joerogan. Foi muito foda. Assiste ae: https://t.co/EsvsaUz5Az https://t.co/7YivXv6fja Você sabia que Ilha de Barbados tem um podcast? Disponível no @SoundCloud e no @SpotifyBR , da aquele RT pra divulgar essa bela notícia! \nhttps://t.co/HPsFEZQm3o\nhttps://t.co/ioEZObI88E Eu no @joerogan Experience. Inesquecível! https://t.co/EsvsaUz5Az @d_odonnell True @Ornyadams @TheLaughFactory Hehahehahe!!! Good to see you, brotha! Indo pro estúdio do @joerogan fazer o podcast dele. Isso é tão foda que tô achando que ele nem vai abrir a porta. RT @Padig: Vejo no #Fantástico manifestações de \"Força Flamengo\" em campo. É o mesmo que dizer \"Força, Vale!\" para a tragédia de Brumadinho… Mais de 1 milhão de views em 3 dias. O 8 MINUTOS voltou! Só que agora MAIS QUE 8 MINUTOS. O primeiro papo foi com o @kimpkat. Íntegra em https://t.co/7prlL8ZGUM https://t.co/w0yhtjezZP RT @HollywoodImprov: LATE NIGHT TONIGHT :: 10:30pm in the Main Room : your Saturday Night pick-me-up crew is about to shock your system!  @… Olha que foda... segunda-feira 12h (18h no BR), eu vou estar no podcast mais foda do mundo... o do @joerogan. /// 🇺🇸 Next Monday at 12h (18h BT time) I will be in having a conversation with @joerogan on his great podcast. I am excited asf! @_FNARDINI Nunca serão. Jamais serão. @KatiaCr00035895 Obg Katia! O primeiro MAIS QUE 8 MINUTOS tá no ar. Assiste se! Acho que vc vai curtir. https://t.co/7prlL8ZGUM https://t.co/qD6dUjVxcX @NunesMilleny @Franstama Toma, tio! @BarbyMartins_RS Hahahheheh Obrigado, ministra Damares. 👏👏👏 https://t.co/zEJNGMtsrY Mais um INFERNÁCULO no ar! https://t.co/dsefqPc4dc https://t.co/8eIcyup5lu O cara manda um whats, ela responde no insta. Ele continua no face e ela contesta no Twitter. O papo se estende no iMessage. Os 2 acabam no Orkut e percebem que morreram em 2002. Fim. Não sou eu ali. Fake news. Sou Náutico. ⚽️⚽️⚽️⚽️⚽️⚽️⚽️⚽️ https://t.co/bokZsHzIML @bicmuller 😂😂😂😂😂 @clovisbotelho86 Nao tem problema. Os shows lotaram sem vc. Não fez falta não. Abs @pqpnats 🙌🙌🙌 Mal assumiu a presidência e já está pegando as mulé dos outro. https://t.co/d5zfCzWucO @cauemoura @marcogomes @pecesiqueira Te amo. Se é tão importante pra você, eu quebro a rótula do joelho dele. Farei isso por amor. @cauemoura @marcogomes @pecesiqueira Caguei pro sujeito e pras próximas 26 gerações da família dele. Eu sou o primeiro a comprar as brigas dos meus amigos, mas essa aí é bater em cachorro morto. O moço é bobo. @marcogomes @pecesiqueira @cauemoura Marco, me desculpa, eu só tenho uma coisa pra te dizer: essa expressão do chapéu aí não existe. Nunca existiu. @assimdisseojoao Uahhwhhssj Fala galera, novidade lá no canal do YouTube, Infernáculo, vocês perguntam e eu respondo! Da uma moral lá... Deixa um comentário e um like!\nhttps://t.co/7zOdRass0k Oi @VEJA... vai tomar no teu cu. Abs. O desenho que um cartunista fez de mim criou vida e saiu lutando contra a corrupção. https://t.co/Mglhcdkkpn Não sobrou 1 assento na primeira noite em Boston. Que loucura! Eu não imaginei que essa turnê (com show em inglês) seria tão foda. E tem mais 2 hoje. Vem! https://t.co/vgY5JK3wxl https://t.co/Bx8R4v5m6f Mano... https://t.co/Di8BSfwMBE @superklaus Valeu pela visita, meu velho! Avisa pra galera que amanhã tem mais. Abração @Edinholivero Valeu pela visita! Avisa pra galera que amanhã tem mais. Valeu salvação @poucaspalavr Valeu bro @DiegoCoste Hahhwhshhshheha @realDonaldTrump Let me introduce you to soccer. @trade_ricardo Pergunta pro Bira Belo. Ele sabe. 🤫 https://t.co/DLdehNuYSJ @CorujaFocada Assiste o vídeo de novo e veja que ñ votei em nenhum dos 2 @CorujaFocada Bro... meu nome não é PC e nem Cauê. @lucasinutilismo Tudo bem lôco @ElisaaDinis @Leet_sp Ve se ela vai. Eu deixo um ingresso Tem uma galera em Boston querendo boicotar o meu show porque discorda politicamente de mim. Aqui fica o meu recadinho do coração. https://t.co/pla7ffQ1H8 ...tentar vencer de maneira global na carreira que eu escolhi. Como liberal e capitalista q vc (apoiador do novo governo) é, deveria estar feliz por mim. Ps1: Desculpe que postei e apaguei. Tinha aparecido tudo na ordem errada. Ps2: Não é pq tô nos EUA que ñ tenho direito de falar. Todo mundo tem direito de falar... retirar esse meu direito faz parte da agenda autoritária que você está engolindo. Sou capitalista e tô aqui pra.. Agora vou ali escrever umas piadas de pinto daora que é assim que eu pago as minhas contas. Não se deixe manipular por essa histeria reacionária. O ódio contra o PT (justificável) não pode cegar vc frente a um governo que tem como base em 2 instituições comprovadamente atrasadas no pensamento e na conduta: A igreja e o exército. Bjo e boa sorte pra nóis. (continua) ...do que a direita faz parecer. Esse novo governo se alimenta do fracasso de um esquerda mimizenta e corrupta, mas não se enganem... ele carrega todos os vícios da velha política (os primeiros escândalos de desvios e leilão de cargos já começaram a surgir). (continua) Vcs estão engolindo um monte de bostas pq, com razão, odeiam o PT. Essa guinada que o país tá tomando a direita só mostra o quão conservador o Brasil sempre foi. Vão ser 4 anos lutando contra o marxismo ideológico, um inimigo muito menos real... (continua) @TioDedezinho @pecesiqueira É a merda do marxismo ideológico que a direita insiste em lutar contra e que nunca foi tão real quanto ela pinta. É bode expiatório das idéias reaça que estão chegando com tudo... até pq a esquerda é mimizenta e também defende um monte de bosta. Fudeu... tá todo mundo engolindo. @Anitta Ok. Chegando em 15min. O filho da dona Iolanda é o headliner de um dos maiores clubes de comédia da gringa nesse finde. Cadê aqueles sites cheios de filhos da puta pra noticiar isso aí? #RancorÉshow https://t.co/ESwueYMgD9 @dhf1349 @vitoridiota @pecesiqueira @cauemoura Oi? Retardado? Eu? https://t.co/WKgLT2xh0U Gostei de um vídeo @YouTube https://t.co/AboVbakF4g \" CANTE MAIS UMA VEZ ESTA BEM CHARLIE \"| @tosquista Há arrecadou 1100 doletas em 3h Não acho que o CQC errou ao dar voz pro Bolsonaro. Acho que errou ao dar voz pro Rafinha Bastos. @claudiojr82 É bem possível isso mesmo, mas ñ é chupar bola... é algo que eu acredito. Não é pq discordo de 98% do q ele fala e pensa q vou entrar no espancamento. Gostei de um vídeo @YouTube https://t.co/kBZin9LFr8 PODEMOS MELHORAR @AndreiaSn1 @talytaconfessor 🙌 @Danilo_Baldusco Hahehahhhe! Foda Já sei como seria: vc faria uma matéria com uma denúncia grave. O governo (ou alguma marca) ameaçaria tirar verba do teu canal. No próximo programa vc ficaria quieto e dedicaria 45 min a Mulher Melancia ou ao aniversário do David Brasil. Mano... nem volta. https://t.co/uW3t4STMB9 https://t.co/rvINHupO77 @lelispatricia @pecesiqueira @BolsonaroSP Mano... essa novelinha ta show de seguir. Cada tweet novo é um sorriso na minha face. 🙌🙌🙌 Não parem... por favor. @AndreiaSn1 @talytaconfessor O q eu falei é que a perseguição do jornalista é bobinha. Só isso. Eu só preciso de amor. https://t.co/X7vlwnMwm0 @Renatafrizone 😉 @GDimenstein @DaniloGentili Gilberto... vc perdeu um processo pra ele que teve uma das sentenças mais lindas que eu já li na vida (ótimo saber que existe gente no judiciário que pensa assim). Talvez seja legal vc relembrar e largar mão de ser rancoroso. Esquece... segue a vida. Não olha pra trás. Perdeu. https://t.co/FOMh5gthfS Ae!!! Obrigado a galerinha que torce pelo narigudo aqui. https://t.co/hZ1QlOGSv6 https://t.co/IKkoKXEvcv @carlaoeng1984 Ok. https://t.co/jHB0Smcbfk Oi, sou modelo. https://t.co/HiAf79WLEO @MichelS76220552 Vc é jovenzinho. Vai estudar, amiguinho. @eugostodequiabo É da miha produtora. Relax. Acordei com o Alexandre Pires tretando com o Gustavo Lima. Tentei dormir de novo pra esquecer q eu registrei essa informação no meu cérebro, mas era tarde demais. Let’s do it! https://t.co/P5U741Kvcn @tosquista @fvguima Lingua presa em gif é lingua presa pra caralho. @adrianogallvao C ta ligado q é em ingles né? @adrianogallvao Vamo ae!!! @anagabrielabrod 😉 @let_dex @Zanfa Nao, mas achei válido o registro. @Zanfa Ok, campeão. https://t.co/jsUSa527PK #tbt 10/2011 O dia que fui coroado rei. #orgulho 🤴🏻 👑 https://t.co/FGVUPGqjkY @Nell8163Correa Ok, tia. @leonam4K @Helio_mothci Eu tb @adrifnmt Eu estava ficando triste, mas aí eu olhei a sua cara de trouxa e apenas sorri. Que Deus te abençoe. @jessika_ccs 🙌🙌🙌🙌 🇧🇷 Use camisinha. /// 🇺🇸 Use condom. https://t.co/vG2hOBc0P6 RT @HollywoodImprov: Don’t miss @Cristela9 @RafinhaBastos @OwenSmith4Real @GregorySantos @BrodyismeFriend &amp; @MorenoTheAlien tonight t 10:15… @OtakuAlgum Hahehhshhshs 1º jogo da @nba. O próximo é com ele na quadra (nem q seja distribuindo toalha). https://t.co/Gnnb3m4CtU Uma semana longe e óia o que os caras me fazem. Não dá pra confiar mesmo. @ilhadebarbados https://t.co/LzS7h2XkwL Obrigado Dollynho! https://t.co/t1RB6ma45d Mano... https://t.co/FAtjLU2tCe @LeoduK1985 Nao... era pra tua mae matar a saudade de mim. @rmarcomini Uhrheeahshsha Fuck the police!!! 🚔 👮🏻 #VidaLoka https://t.co/K2rFK1ecft @AqueleCaraYT @lgqueiroga @andrefran @demori Concordo com o tweet todo. @biancarothier Que horror isso! Nossa! Só por isso tenho redes sociais... https://t.co/Qx0PiPFAxy @lgqueiroga @andrefran @demori You have a point. Eu entendo. Não tinha visto por este lado... acho errado e meio babaca, mas ainda vejo exagero em proibir o bloqueio da rede do sujeito. Ainda é pessoal a conta... mas o debate é bacana. @andrefran @jacksrogerio @demori Uhahhehhahe @annaclaral Não é canal de comunicação oficial. Não vem do governo. Não é porque eu discordo do cara que vou ficar cerceando a liberdade dele de bloquear quem ele quiser. @farmacolucas Pelo amor de deus. Discordei de uma coisa. Não é pq penso diferente q ñ posso zoar exageros. @lais_csiqueira @andrefran @demori Tweet é informação oficial de onde? É uma rede social criada pela comunicação social do governo? Pelo amor de deus. @Laiooo @andrefran @demori Ok... eu ñ tinha pensado isso. You have a point... mas é só entrar deslogado e vida que segue. @nobrufjv @andrefran @demori Li a primeira palavra e te bloqueei... só pela zueira. Conta pessoal minha. @andrefran @demori Entao... bloquear significa que ele nao mais ler o q o jornalista escreve... nao significa q o jornalista ñ pode escrever. O cara pode bloquear quem ele quiser. Não queria defender, mas segura a sensibilidade ae! Tô aqui brincando de bruxinha. https://t.co/JV0bEdRGUN @duksfts @leopfuita @cauemoura Ae! @belinhocrisanto Por favor... aponta aonde eu fiz isso, campeão? Gostei de um vídeo @YouTube https://t.co/8L9Fueju0ZÊ MOURA + RAFINHA BASTOS | #POUCAS #10 No ar no POUCAS com o parceiro @cauemoura. Entra ae! https://t.co/IiufbJxelF https://t.co/C3sPxNw4Ao SIGA O SEU SONHO... a não ser que ele seja muuuito difícil. Nesse caso, pense bem se vale a pena. Talvez seja bem melhor escolher algo mais simples e ficar de boas. Na real, não siga seu sonho não. Nem tenta. Espero ter ajudado. #motivação #foco #força #fé https://t.co/26kRDrceLp Um youtuber xinga o outro. Aí o ofendido responde o que ofendeu. O agressor agora tem mais conteúdo pra atacar novamente e o agredido pra responder. Tudo isso com propaganda de 5 segundos na abertura dos vídeos. Resultado: vc mais imbecil e o Ifood 42 mil dólares mais pobre. @anxietieps 😂😂😂😂 How u doing??? https://t.co/Mgd7vdiwP9 @caue_nascim @DonatoX1 @WanWanSilva É isso. @JimmySouza49 Deus vai puxar seu pé de noite, mau-cristão. Boa 4ª série ae! Normal. https://t.co/XFoYAunMgt @TnorSantos Hahahhehe! Ficou putinha. Bjo moça @CanalDoEduzera Heheheeh! Eu lembro disso @TnorSantos Eu ia te xingar e então vi q vc usa hashtag do Dancing Brasil e da Fazenda... e desisti. Nao quero ser mais um motivo de tristeza na sua vida medíocre. @Iordlotus @aguedescartoon Mamada aonde garotinho? Vou contar pra tua mamãe q tu ta fazendo arte. Agora volta a chupar o peruzinho dos amigos aí e sai do cpu do papai. @Iordlotus @aguedescartoon Quem comprou, campeão? Se comprou, tá devendo ainda. Aqueles momentos felizes que a gente nunca esquece. 🙌🙌🙌 https://t.co/nWRMy0rWMC @JimmySouza49 Hey campeão... “retardado mental”? No seu perfil fala que vc é cristão. O q é isso, amigão? Deus tá vendo. @JimmySouza49 Eu estava ficando chateado, mas aí olhei a sua cara de trouxa e apenas sorri. @AlexAlichandri E ganho pra caralho. Chupa! Meu pornô favorito. Vídeo novo na Ilha de Barbados: https://t.co/EpQPzAfJ4y https://t.co/3igbHf10OK Porra! Muito eu! https://t.co/OAoSUPeWqq Caro senador @MagnoMalta, mesmo depois do senhor ter dedicado 20 min de seu tempo na tribuna do senado pra me chamar de pedófilo (https://t.co/Zbz0dHwpV8), torço para dias melhores na sua vida. Bjo no coração. https://t.co/GzkCMEvxPO @Tonkiel Uhahhehhahehhshha O convite tá feito. Ultimato... na Netflix. https://t.co/61Xmv4nxuu Gostei de um vídeo @YouTube https://t.co/bvjJnuxTUi For Real - Candy Rain Porra Noel! https://t.co/dbV6z0VYPi @rodrigoramthum No. Never bro Isso ficou legal!!!! https://t.co/3LV7GAPIAt Gostei de um vídeo @YouTube https://t.co/nynxFHPYt2 cortes - LEGALIZAÇÃO DO ABORTO @ThiagoLlunaa @insideei Champz... aponta agora aonde que eu falei pra votar no Lula. Agora. Ou entao pede desculpa. @arantes_lucas Pq queria fazer uns trouxa que nem vc me engulirem. Bjo @danmotarj Eu quis ter ele. Desde o começo. Tenho grana pra ter filho e posso dar uma qualidade se vida legal. Nao entendi a comparação champz?! @Reginal76659708 O exemplo dos presos e do aborto sao bemmm diferentes champz. @ThiagoLlunaa @insideei E a hipocrisia ta aonde champz? Boston, NY e Miami! Turnê pelos states em janeiro! Infos: https://t.co/gFpeRUgw8x https://t.co/qpOw1RPaIQ Deus mandou um whats dizendo q o sr tem q se resolver com a gente mesmo. https://t.co/vn2hptHoeo @ricardoecher Uhehhehhe Obrigado, Deus. Chegou a minha vez de ganhar um dinheirinho na justiça. https://t.co/BI7HwLFNxC @gremio_bcn @libertams Quietinho que a discussão sobre “onde começa a vida” é polêmica e to com mais 13 milhões de refém aqui pronto pra exterminar. @caiodgsousa Sou a favor de liberar tb @arq_elder Cara... num país pobre, onde mulher ta morrendo em clínica de aborto clandestino, a discussão não pode carregar essa filosofia toda não. Abs @libertams Em tua homenagem, entrei no xvideos agora e pratiquei uma chacina num guardanapo. Bjo Pera aí... se legalizar o aborto ele não se torna obrigatório? A pessoa ainda pode ter o filho se ela quiser? Oxi... tâmo discutindo o que então? Minha considerações sobre o pornô da Gretchen. O episódio de hoje do Ilha de Barbados tá fueda!!! https://t.co/PNVw3d9o9e https://t.co/S44BMMB7li @CharlesIrado @felipeneto @CdNLeon @PCsiqueira @DaniloGentili @moura_101 Cristão show você, hein?! @ovarzeano @nayanebraganca 🙌 @anashakifan 🙌🙌🙌🙌 @le_chagasm @Luiz_fgf Simmm! Aviso no insta sempre RT @TheLaughFactory: Man of the hour @rafinhabastos shining on stage! Cross culture comedy crushing it tonight! https://t.co/jGHeQ0CoPl Meu aniversário hj e o 1º parabéns vem de um companheiro das antigas! https://t.co/3Tf7vqg2vY @TheLaughFactory @paulo_c_s Hehahheheh!!! Nice!!! RT @TheLaughFactory: At 7:30 Laugh Factory becomes Brazil with @rafinhabastos &amp; friends! \n\nTix - https://t.co/SzqVsRSw4n https://t.co/1NF1I… O que é mais triste? @assimdisseojoao Uhahhehhahe RT @rafinhabastos: Galera da California... terça que vem, dia 4 as 19h30, vai ter show meu no Laugh Factory. Esse aí na foto foi o elenco d… @shannongsims C acha?!?!? Olha o meu time do Fantasy. Só os top. Rafiuston Hockets. https://t.co/8BauZtcjh6 Mano! @ShogunRua e @junior_cigano... só pedrada. Parabéns! Foda demais. Meu trabalho é fácil demais. https://t.co/1g8oTkjT9A Galera da California... terça que vem, dia 4 as 19h30, vai ter show meu no Laugh Factory. Esse aí na foto foi o elenco da última edição. Não perde! Ingressos: https://t.co/gFpeRUy7x7 https://t.co/s7ut76aRz7 PIRIGOSPEL... a melhor palavra da década. https://t.co/JAmrTEbCF5 @umEumelhor @juu__almeidaa Eles injetam. Ela força e sai RIP Roy Clark. Gênio. https://t.co/90baXaKzjC @arielhelwani He asked his girl to marry him. I am here. She said yes. He will propably have to get a regular job. Gostei de um vídeo @YouTube https://t.co/w9tHZRb2Ge Edge - He Can't Love U @alexandrenickel @lucianopotter Roubou um tênis meu. Mano... que coisa maravilhosa! https://t.co/71aid2Xk4U Nunca gostei muito de vc. https://t.co/FT5xTuXxdQ @tosquista Fiquei mais surpreso em saber que aqui não era merda... parece que meteram sorvete (ou espuma de chocolate) no rabo da moça e começaram a gravar. Achei triste. @fzanetti05 Valeu parcêro! @DHZAZ Valeu brooo A recompensa do trabalho vem chegando. Assinei com uma das maiores agências dos EUA, a Gersh (https://t.co/0kRKGMZ1bg). Ela representa caras como Dave Chapelle, John Oliver e Kevin Nealon. Obg a todos que torcem por mim. Pretendo continuar decepcionando vcs por mtos e mtos anos. https://t.co/H9X9JN98vo Os apelidos do UFC são quase sempre umas coisa do capeta... Axe Muderer, American Psyco, The Crippler. Acaba de vencer o main event de hj o Santiago “GENTE BOA” Ponzinibio. Fofo. Mereceu. Uma vez por semana eu vejo 1 tênis ou um chinelo no meio da rua. Não UM PAR... um pé mesmo. Quem atravessa uma avenida, chega do outro lado com um pé descalço e não se dá conta? @marcogomes @forastieri Há alguns anos fiz com A LIGA um programa inteiro dedicado ao tema. Assiste ae! https://t.co/988JRB6VGC MAIS MÉDICOS - Há alguns anos fiz com A LIGA um programa inteiro dedicado ao tema. Fomos conhecer o trabalho dos estrangeiros que atuam no BR. Assiste ae: https://t.co/988JRB6VGC @dubheller @BrasilTruth Bro... eu só disse que foi escroto... ñ tem bandeira nenhuma nisso. O q vc tá combatendo? Nao falei que tinha que censurar, processar... nada disso. Foi escroto. Tb já fui. Simples assim. @BrasilTruth @dubheller Falei que o cara foi escroto. Tb ja fui. Ta em casa. Nao sei qual a pira. @dubheller O que eu disse, bro?! E quando alguém engravida na suruba? /// Ilha de Barbados... toda seg e qua as 18h no Youtube. https://t.co/NMDt7Affkz Silvio Santos passou dos limites. Tenho saudade do tempo em que a TV dele respeitava a moral e os costumes da tradicional família brasileira. #VoltaBanheira https://t.co/C7c35SmpXy O bom e velho SUSTEIDO. https://t.co/407lj0dx7X @prtiagocoelho79 @CrissPaiva Mas em nenhum momento eu disse que não sou escroto. Aliás... exatamente por ser especialista é que eu tô ligado. 🙌 @CrissPaiva @victorsarro Mas isso é verdade pq ele me mostrou vídeos... então ñ é piada, é jornalismo. @JotaNero7 @CrissPaiva Aí eu aprovo. 👍 @CrissPaiva Poutz... mas um tiozinho te abraçando e dizendo que tá excitado não é meio escroto? Certeza mêmo? Se tu tiver tesão por véio, tá fora do debate. Hehehe! Silvio Santos é FILF: Father I Would Never Fuck. Respect. https://t.co/K4MTL9AmSQ @Jhonnydrt @gabrieelbarbosa É burrice negar a existência do privilégio. De um modo geral, ele existe... o debate não pode ir por aí. Mas te exemplifico... no RS tá cheio de colono loiro de olho azul passando fome na rua... as vezes ser branco não te garante muito. @gabrieelbarbosa @Jhonnydrt Mas eu concordo com muito do que foi dito. Só apontei que debate tem discussão... contraponto.. e tem pontos que podem ser discutidos. @Jhonnydrt De maneira nenhuma, amigo. Esse radicalismo brilha na tua bolha, mas mata o debate. Nem todo contraponto é NAZISMO. @Jhonnydrt E esse debate que todo mundo concorda? Acho que precisa de alguém que discorda. Só acho. Paizão! https://t.co/HXh7ljahdq Derrick Rose monstro! #OldManCanDunk @nba @NBABrasil https://t.co/BV0fF1WnFn @RicardoPipo Como assim!?!? O q é isso cara! Chupa WWE! https://t.co/8DewnAzAXY Na boa... vocês tão tudo louco. @RicardoSPimenta @cinebrasiltv Valeu Ricardo!!! Série linda que fiz em parceria com o @cinebrasiltv. Se puder, assiste! https://t.co/0naJfmTABU @HuffPost I wasn’t curious at all about that, sir. I actually don’t even know what you’re talking about. Atrasar pra prova não é exclusividade de quem faz o ENEM. https://t.co/tcv5Sr4hrS @DavidCarvalhoC Esse é o Loro @marcelorubens Impressionante. Puta que pariu. O comentário do cachorro no final é o melhor! 😂😂😂😂😂😂 https://t.co/ErhSnbnArX @pecesiqueira @WagnerVicYNWA @mamaefalei Eu tento PC... mas o amor é tóxico e as vezes incontrolável. Não mando no meu ❤️ @calebcristovam @mamaefalei Qdo a resposta vem num nível legal eu sempre respondo. @mamaefalei A proposito... aqui falo tudo: https://t.co/9goIVa8JS9 Muitos se afastaram dos parentes por discordâncias políticas... outros simplesmente aproveitaram a oportunidade pra se livrar de uns tios chatos mesmo. @mamaefalei Quem elegeu o novo presidente não foi um liberal bem informado, acredite. Ele é parcela minúscula do eleitorado... mas seria imbecilidade minha desconsiderar que tem sim uma esquerda politicamente correta que ama um processinho e quer q eu me foda. Abs @mamaefalei Não bro... mandei aquela foto apenas pra te exemplificar que nem todo povo que quis me prejudicar votou no 13. Não disse q votaram no 17. E quando falei “família conservadora”, não estou falando do liberal a favor da liberdade de expressão. Medo da porra! https://t.co/KUWOcmE4e0 @mamaefalei A esquerda é politicamente correta e gosta de jogar um processinho por qualquer coisa. Tô de acordo. Mas eu sei quem faz cara feia pra mim... quem quer q eu me foda. Só eu sei. A cara de nojinho vem da família conservadora brasileira.... e essa galera votou 17 sim. @mamaefalei Vota 13 mesmo? https://t.co/ZEKOg867KI Ô Arnaldo... explica. Qdo eu, um mero comediante, falei bobagem.... o povo levou a sério e quis a minha caveira. Qdo o outro lá, político, falou bobagem... o povo disse que era só zoeira e elegeu ele presidente do Brasil. Ajuda ae! https://t.co/044fM8IeRp @giovannoni12 Ufaaaaa @giovannoni12 Mano.. eles estao falando C’MOM??? É isso mesmo!??? Nao né??? Quando um amigo seu escreve: “Vamos torcer pra que tudo dê certo. Respeito a democracia e a decisão da maioria”... no fundo ele quer dizer: “MANO!!! Vocês são trouxas demais. Vcs estão ligados q a gente vai se fuder muito, né??? Depois ñ digam q eu ñ avisei. Taquispariu mêmo!!!”. Reforma da previdência? Importante. Só quero saber se o tio Bolso vai mexer na grana dos milico. @ICollengue Pô tia @tomiasi @GuiTome Orra champs! Assiste os 200 videos q fiz na Ilha de Barbados @MauMeirelles @GuiTome Beija! @MarceloAdnet A bíblia. 🙏 #paz Ae Bolsonaro! Se vc é fodão mesmo, traz de volta o Orkut. @Oswaldo70368631 O sistema... hehehahse! Assiste meu especial novo na Netflix e volta ae. Tá tudo explicadinho nessa figura. @MrVanDep https://t.co/JpTDHkKWrV @biagranja 😭 foda @victorcamejo Uhahhehshhehe @DaniloGentili Exatamente isso que eu tô falando. Não ouve esses babacas. Esses caras não querem o teu bem. https://t.co/Hc37Oriypo Esse fã que te acha o solitário paladino da justiça da comédia, te dá um estranho combustível pra se isolar e cagar em quem tá ao teu redor. Ele te empurra pra longe de quem gosta de você... e eu ainda me coloco nesse grupo. Abs Te falo isso pq estou na mesma barca. A liberdade $ q eu conquistei me deu direito de comprar as brigas que eu comprei, mas ñ posso exigir que um colega em outro momento de carreira faça o mesmo. É injusto. Falar estas coisas jogam o teu público (q é gigante) contra teus colegas. Entendo a tua frustração, mas te peço pra parar de se atirar contra teus colegas de profissão. Nem todos tem a tua influência e a tua liberdade pra dizer o que pensa. É fácil lutar contra o sistema quando vc já construiu a carreira e não vai passar dificuldade se algo der errado. Danilo, concordo que a esquerda tem sim esse péssimo costume de querer calar na base do processinho e, se pudessem, mudariam legislação pra acabar com a piada contra ela. Falei a teu favor diversas vezes, inclusive naquele processo patético movido pela Maria do Rosário. https://t.co/Y0Qwj0mOOa @paulabrasil2016 @Haddad_Fernando Vc realmente postou isso, moça? @rosana @cirojorge Entendi, mas continuo achando ela muito radical quando usada em discussão política. É como se ñ houvesse outra possibilidade que não o extremo, sabe? Aí dificulta o debate. @euliatulias @ManuelaDavila Oi!!!  A verdade é que eu acho que a piada ñ ficou clara pra muita gente. My fault. Admito. 🖐 @MarceloAdnet @RicardoPipo Jehaahaheehabs Essa eleição me fez sentir saudade de quando eu acordava com 250 megas de pornô bizarro pra baixar no celular. Entrar no whatsapp era mais seguro e harmonioso naquela época. Nunca deixei de acreditar. 🙏 https://t.co/hYziqlqj5q Pixar Paraguai. https://t.co/47RCQ0KQWZ @EnzoPerazolli Ironia champz @RitaPanahi @joerogan Hhahaheheheahehe @ApoioJanaina O caminho pra uma vebelebiliviação!?!?? O que é isso? Parece ruim. É ruim? Vai sonhando aí com a idéia de arrependimento. Quem for eleito vai passar 4 anos bostejando sobre o derrotado (chutando cachorro morto mesmo) e o séquito vai continuar vibrando. Anota aí. @GABRlELinHELL Entrevista realizada antes dele ñ comparecer aos debates do 2o turno. @Pocxatoba @Giovanne_Shiva @costa_rui @forastieri Esquerda usando Carta Capital cono fonte. I rest my case. Abs @romulomendonca Tem toda razão. Nicho ignorado. Essa expressão “passando pano” é imbecil. Ela derruba qualquer possibilidade de debate. Ou vc é contra, ou está PASSANDO PANO. É radical e infantil. @Pocxatoba @costa_rui @forastieri O cara até pode pensar isso... não sei... mas não é isso que tá diro ali. @costa_rui @forastieri Pera aí... o cara fala muita bosta, mas ficar puto com piada velha é um pouco demais. Uhahehaheha! O senhor é fera, pastor! Quando não toma a medicação cria umas coisa muito daora. https://t.co/NEd8hyalOh @bicmuller Uhehqshrjeaheja @gabieferreira Respondeu sim... e foi lento. https://t.co/VcAEaodN2a Ô @romulomendonca! Que papo é esse de “martelada de macho alfa”? https://t.co/UoiOD7Xnli Sempre que fui no Pânico, torci pra encontrar a @amandaramalhos. Provocadora e ranzinza, fazia um papel muito difícil no programa. Vai fazer uma puta falta. Repensa aí, Amandinha! @feh_abreu @carolmanganaro @marcelorubens Impressionante né?! @gabieferreira Eu, o Brown ou os 2? @GABRlELinHELL Está distorcendo o que eu disse. Sim, continuo achando que pra um comediante é mais perigoso uma possível ditadura de esquerda, mas isso ñ influencia definitivamente o meu voto. @Haddad_Fernando @Bob_Fernandes Eu ñ aconselharia mesmo a discordar do Mano Brown. @marcelorubens Com esse video vc mudou um voto. Eu ia votar no Haddad, Marcelo. O Mano Brown veio na minha casa e disse que eu preciso arrumar meu armário. Falou que eu ñ tenho mais idade pra vestir macacão e jogou 6 cuecas minhas fora. #BrownSincerão A bipolaridade dos tts. https://t.co/DRrzp6PKKJ Se eu tô tendo que explicar que a minha piada foi irônica... talvez ela só tenha sido uma bosta mesmo. Admito. @Antonio_marcus @OFrancoSerrano @ronaldrios @EKrominski @GugaNoblat Desde o princípio. Hey @euliatulias! Vc usou meu tweet irônico sobre a suruba do Doria como informação da sua matéria sobre a @ManuelaDavila. Vâmo rever isso aí! Uns me chamam de esquerdinha de merda... outros de bolsminion. Caraio. Então... quer me xingar? Super ok... mas só peço uma coisa: Constância. Tô um pouco confuso aqui. A partir de hoje, meu meus tweets terão hashtags explicativas. Tipo: #ironia, #sarcasmo, #SQN, #pleonasmoSIM, #ApenasProvocaçãoNemPensoIsso. @igorroida Uhehheheh! Talvez @GhostJacobs To ligado @hmcpedro Ironiaaaaaa!!! Oxi. @henriquewicz Galera ñ sacou a ironia. Ontem fiz essa piadoca aqui. Quem ñ sacou a ironia tá achando que eu voto no Dória E QUE EU Ñ SEI TRANSAR. Uhehahuheha! https://t.co/t5J7YtpcMS @pecesiqueira A propósito... minha piadoca foi irônica. 1º pq ñ voto no Dória, 2º pq o cara ta morto ali. Caraio Brasiu... vâmo pegar a ironia da piadoca. O cara tava morto na cama, caceta. @jonesbaldoo Hehahehshe! Real. 1º dia de trabalho. https://t.co/oWla24mjEM @pecesiqueira Tranquilinho... curtindo de boas... deitado. Acho bacana a suruba Jaiminho. https://t.co/SR7QPpILbA 🇧🇷 https://t.co/W534wlRH0x Assistiram meu especial na Netflix e brigaram. Triste isso. #ULTIMATO https://t.co/EkGCxaIhLO Quem administra uma suruba com maestria, administra bem o meu estado. No 2º turno, eu sou Doria! Os cara tudo zoando que o pau do Dória é pequeno, mas no fundo pensando: Acho que é maior que o meu. TÔ LIGADO NA DE VCS, SEUS RÔLA CURTA DOS CARAI. Boas propostas merecem ser mantidas. A Erundina criou o rodízio em SP, Doria apenas o aperfeiçoou. As eleições indo pro 2º turno e o João Doria indo pro 3º, 4º, 5º... João Doria fala a real! Sempre uma sentada na cara da sociedade brasileira. @FeCastanhari Hehahehu @FeCastanhari Certeza q tem. 1000 doletas pra mim ja pagava. Ps: A pessoa passou em Oceanografia. @VICE What happened to u, Vice? @nandalaraa @alexchico01 @WagnerCarolli @Iexandre @DaniloGentili @jairbolsonaro Discussão fofa essa. Parabéns aos envolvidos. @Superbruna @Leandro52814989 Acha o telefone ou email e me repassa champz. Tem nada @marceloindaniel Forte @marceloindaniel Ou o Roda-Shivas, onde o convidado vomita a cada giro pq bebeu de estômago vazio. @flaviosobrenome @marceloindaniel UHAHSHHHEH! Só comparável ao Roda-She-ra, onde a She-ra roda cercada pelo tirano Hordak e seu exército de mutantes, até voltar a ser a pacata princesa Adora. Galerinha tá confusa nesse segundo turno. https://t.co/toCv0Gywcs @marcelorubens Uahehahehhahe! @Iexandre Eu até ficaria chateado, mas quando vi q tuas análises sociais tem como base trechos da Fazenda... apenas sorri. @Kakauzita Eu sou comediante... eles candidatos a presidência. Vc acaba de sofrer um episódio de Dissonância Cognitiva, amiga. @adpmotta VLeu irmão! Vc acredita que o candidato A pode fazer um governo honesto mesmo aliado a corruptos? Você crê que as ameaças de ditadura do candidato B são só “brincadeirinha”? Sabe o que é isso? Dissonância Cognitiva. Entenda:\nhttps://t.co/GSyseouPrR Pouco orgulho de ver a minha cara feia aqui. 🙌🙌🙌 https://t.co/5xEgnayKp6 Segura aí, @leticiaspiller. Vou atrasar uns 15. Chegando. https://t.co/qDQU9mR9ty Saudade de quando vc tava no saco do seu pai. https://t.co/1mjBWQ7w42 Muita gente dizendo que o CQC fez merda dando voz ao Bolsonaro. Esse pra mim foi o menor dos erros. Cagada foi ter dado voz ao Rafinha Bastos. @NBABrasil @Bulgarelli1971 Mano... vc ta em casa. Para de gritar. Tem gente querendo cagar em paz. @Linadjanara @maufreire 😂😂🙌 @chicobarney Uhahehhehahsh Eu acho que o Bolsonaro não existe. Minha teoria. https://t.co/tcZH5WfI5J Algumas pessoas sonham em viajar pelo mundo, outras em conhecerem seus ídolos. Eu só quero sentar no sofá da Fátima Bernardes passar o programa inteiro me peidando. @joemamartins Mano... acabei de ver isso. Muito divertido. 😂😂😂 O que você prefere? O Haddad, o Bolsonaro ou um coqueiro enfiado no seu cu? https://t.co/EyO7LIWTWF Boa, campeão! https://t.co/VGKI6LZurO Eu achava que era problema no algoritmo... agora acho que a Netflix já tá de sacanagem mesmo. Olha as opções que aparecem quando você busca meu especial pelo meu nome. https://t.co/soIPinE4Mf @antoniominari04 Manda teu email e instagram. To avisando a galera por ali. Acredito mais no discurso dos 2 candidatos a presidência do que nos textos de “pai foda” e “familinha feliz” do @piangers. Torço pra vc vir a público dizer q é zoeira, velho. Te amo. @partiucagar Nao... tava escrevendo e dei enter antes, zebu! Concordo, Netflix. Concordo. https://t.co/Xe3H8ryDhP @reajacomcarinho Uhrhdheh @leandroliveira7 🙌 @gustaluft Mandavideos @jeanvyana @MarceloTas @marcoluque Deve ter dito absurdos maiores que ofuscaram esse. Era papel de UMA pessoa editar a matéria. Nem reporter, nem apresentador tinha controle disso. O cqc era um programa de editores. @ForeverBastos Tem q assistir vaaarias vezes @MiMiBender 🙌🙌🙌 @lanaluxo 🙌 @MarceloPituca 👍👍👍 @cnomura_ Exatamente isso. Ia ficar feio https://t.co/E0bt9exG5L https://t.co/2ansMWHvVN @mashable Just go do your bed, you lazy fuck! @rdmcarlos @disorderz Disse o cara que retuíta Gabriel, o Pensador. @disorderz Deveria ter pedido Haddad ou Bolsonaro???  🌴 Íntegra do vídeo em https://t.co/YCCx5RqAEg https://t.co/IEyOz7PHie 👹👹👹👹👹 https://t.co/4g6FiaLdaz RT @cinebrasiltv: Em cada episódio de Brasileiros S/A, um personagem apresenta seu dia a dia, com as dificuldades e alegrias que enfrenta n… Série linda de shows em Portugal! Fechamos no Cassino Estoril. Obg a todos que compareceram! https://t.co/Lfa5mJTmJZ @coisasdolacerda Acharia @arrombavcs @Air_tonton @gabihecck @DaniloGentili @CanellaMatheus Prefiro o Mateus tb. Vídeo do Connor tentando bater no técnico do Khabib antes de ser atacado. Você ñ viu pq nessa hora a TV mostrava o russo no meio da galera. https://t.co/iaItEHQAJ5 @MrVanDep Cara... envolve nada. Pulou certinho no tecnico. Ninguem nem derrubou a cereveja. @pecesiqueira Eu te amo @Luciandrade @AnaHissa Eu enviei um troféu aqui de casa pra ele. @Rigo4Rigo Achei show @MrVanDep Tranquilo. Vai pagar sorrindo O UFC mais top do ano. https://t.co/nm0Uh7HxxB @MrVanDep Pra mim acabou TOPZÊRA. @canalCombate @TeamKhabib Top A todos vcs que estão falando em desmoralização do @UFC e o escambau... meu forte abraço. Eu sorri e me diverti como em poucos momentos da minha vida. Que seja assim sempre. #BaixariaShow O que é esse espetáculo que o UFC criou pra luta de hj? Pelamodedeus. Chupa Cirque du Soleil! https://t.co/x2DlaNqfHN @_minorith 😉 Vai começááá!!! https://t.co/8YFrj7AGoh Noite boa pra desmarcar o rolê, reunir os amigos e rir até ir pro inferno. Estarei lá pra te receber (na Netflix e no inferno). Ps: Arte linda do Tiago Amora. https://t.co/eUs4Q4SOMm O dia que o cotoco meu deu oi. #ultimato @netflix @NetflixBrasil https://t.co/xVbfinEXqh Gente hoje, 21h, estreia uma série documental mto legal que produzi em parceria com canal CineBrasilTV. O programa mostra o dia-a-dia de brasileiros que ralam pra fazer esse país acontecer. https://t.co/W6wiK0UR6V @MarcoMota77 Cara, sao 1h02 de show. Desses... 7 minutos estavam na Internet. Apenas 7. E isso fazia parte da construção do show novo. Então ta tudo dentro do plano. @MarioMontagner Boaaa @Papercuwt @NetflixBrasil Valeu brooo! @ToaDDaviD 🙌🙌🙌 @llRobersonll Valeu amigo!!! @missbalthus Deves assistir de novo. 🙌🙌🙌 @aninieleite Hahhshshh @RMarssaro 🙌 @BecaMarthello Uhehehehhe @pat_assis Obrigado Patricia!!!!! @taviao @UnileverBrasil @marcosmion Também fui convidado e atropelei uma velha. Tamo junto. Já deixa as grana e os cartão ali pra nóis pagá os advogado. https://t.co/owuopFOMrL Obrigado, NETFLIX. Você pesquisa meu nome no sistema e, além do meu show, vem DESENCANTO, CASO DE POLÍCIA, MANÍACO e FELICIDADE POR UM FIO. Grato pelo carinho. https://t.co/h4Uon7lmR3 RT @TheLaughFactory: Bringing his Brazilian flavor to the stage is @rafinhabastos https://t.co/IrFQic2EvF Faço o meu show na Netflix e acho que tô abafando na comédia... aí surge o Cabo Daciolo... e eu me sinto um mero iniciante. Voltei pra escolinha. @vivianamorim 🙌🙌🙌 @ClaudioAbdalla 🙌🙌🙌 @BEEF_BRASIL @bricioloureiro 🙌🙌🙌🙌 @alicecarlamont 🙌🙌🙌 Nesse sábado em Los Angeles!!! https://t.co/3SmyayoGTB Ah... Internet. ❤️ https://t.co/2PUppMbbp7 @xamanaty uahehshahhehe Não escrevi meu show sozinho. Tive ajuda desses 2 amiguinhos. Tá na NETFLIX. Assiste lá que eu preciso ganhar do @rickygervais e ter o especial mais assistido do ano. O vencedor leva uma caixa de Suflair. https://t.co/3bQ2pAh95A A infância de hoje é MUITO melhor. 🤷🏻‍♂️ Corre pra Netflix pra ver o show todo. Ultimato - meu novo especial de standup comedy... na Netflix. https://t.co/9PwFSdtQHX O cupim. https://t.co/cVWJ43IlXV @whindersson Prazer ter vc aqui, bro! @jgoficial31 Boa! @limamemorabilia @rickygervais Valeu rafa!!! @aleticialottb Exatamente @fabi_berto 🙌 @CamilaCallimanP 🙌 O especial do @rickygervais é o mais assistido da Netflix nesse ano. Vâmo ultrapassá esse cuzão! https://t.co/1YIz6IS87V @NicolasC_Campos 💦 @lulu_bf 🙌🙌🙌 É desse tipo de elogio que o Brasil precisa. https://t.co/rREf4q6bHY @ThammyLimaa_ Aeeee Eu no Tinder. Só alegria. https://t.co/a5w0rCQgkV Corporação estourando um churras clandestino. Bom trabalho. https://t.co/BF6DddlEKl Pô... aí me emociona. https://t.co/I3LttJdzDc A Netflix nunca mais será a mesma depois desse maluco do barulho! Muita diversão nesse show que vai conquistar o seu coração. Ps: Roubei o texto das chamadas da Sessão da Tarde. https://t.co/BYSMfVLsdN @LeoxMarques VLeu Leooo @guigenova VLeu brooo @SamiaOfficial @icaroleles1 Acho q é só buscar por Rafinha e vc acha tranqs @gleise30 😉 @Marcoshio Justo. A minha nao vai durar muito Por favor, ouça essa mensagem. O futuro de uma criança depende de você. #QuemAmaNãoProcessa https://t.co/00pOxm4E7j Um pouco dramático, mas tá valendo. https://t.co/Mu1BtbnP2J @AndreLVarga O show tem 62 minitos... desses, 7 estao na web só bro. @jrhardware13 Valeuuuu @tixinhadois @NetflixBrasil Po mano... obg pelo carinho. @Rinaxp_76 🙌🙌🙌🙌 @AAndreiaFM Simmmm @dilene_nana Muito verdade @spadova Valeuuuu @Monica99312079 😂😂😂 @cvborges Hegegehehe @h_breda @NetflixBrasil Certeza @LcCarvalho98 Valeu broooo @beeasaraiva Aeeee! Espero q curta @vitinfalso9 🙌🙌🙌 @RodrigoHND_Pa VLeu rodrigooo @_Andreiaxavier @NetflixBrasil 🙌🙌🙌 @carolisnd 👏👏😜 @esthersaff @NetflixBrasil 🙌🙌🙌🙌 Lição de casa pra você nesse domingo. Assiste lá e me manda uma msg aqui. https://t.co/u9MEYq0BXQ @GustavoFabbro2 Valeuuuuu Salvando casamentos. Isso a imprensa não mostra! #denuncia https://t.co/rw90HGiGTE @shungara Um crowdfunding. Not a bad idea! @vitoroocha 🙌🙌🙌🙌 @MarceloCherba Assiste maissssd @MainPuddin 🙌🙌🙌🙌 @railsonls Hehehhehhe @KlebersonSeg2 Veja isso no medico, jovem @absteia Nao deixaram. Acredita @teagoalves Boaaa @LMenegatti_ Uhahhshshhs @NetoJJ77 Boaaaa!!!! @axlandreto VLeu alex!!!!! @rafasilveira Valeuuuu @filipels10 Valeu Filipe @lukasbd Bouaaaa @lokao742 Uhahahhehhe! Justo! Todos na jaula! @CoisasdaPimenta Pouuuutzzz @mcporto Aeeee!!!! Felicidade por fio... apropriado. https://t.co/977k2mbWN8 @rmadeira_9 @NetflixBrasil 🌵 @FernandoDi39 Aeee @Fran_co0 Vale mais no jatinho @willianlourenco Belo sabadão @LLENN0 Vc vai curtir @Fellipgustavo VLeu Guto @alexcalves Aeeee! Valeu bro! Assiste mais. Decora ai @soloncototi Valeu brooooo @NotLifas Boaaaa @izastica Aeeee @Nomdt Apropriado @Alessandrouw @NetflixBrasil 🙌🙌🙌🙌 @DaniloSilvino2 https://t.co/8ocQZWzMEC @GuimmoAlonso Uhehahaahshs @marcelo23779 @littleprii Deixa rodando q ta lindo @dssuzuki Valeu brooooo @roquecaio Assiste pra caraio e espalha pros amigos ae! @primveiga É melhor @SandroDelter Aeeee @deadzao Assiste pra caraio e espalha pros amigos ae! @alangrespan Boaaaaa @NFL_Cantadas @LeScoralick @NetflixBrasil Valeu pessoal!!!! @robertaromano Obaaaaa @bacioli VLeu brooo!!!! @kelduarte92 😉🙌 @LeScoralick @NetflixBrasil Aeeee @andre_costa_s @NetflixBrasil Vveluuuu @alineee_m @pjol_ @DaniloGentili 😉 @brunadelbonee ObaaaA!!!!!! @psicologoarthur @NetflixBrasil Uhehhshhs @KooriBeloved Uhehahahhshs @renatochagasrj Aeeeee @ArrobaTuga @NetflixPT To chegando em portugal! @lokao742 Valeu velho! Tem que assistir mais vezes. Deixa rodando em casa e foda-se. @littleprii Tem que assistir mais!!!!!! Deixa rodando. 🙌🙌🙌 @Tres_Dani Que legal!!! Funciona com legenda tb?!? Hoje no The Noite... https://t.co/WbTcfJHdp1 No ar, na Netflix. Assiste agora pq tem sempre o risco da justiça tirar a bagaça do ar. #ProcessinhoMaroto https://t.co/Gk03bCtGc4 Essa é a minha vida. Esse é o meu clube. https://t.co/oogoPsoHMp Meu sonho. #PraQuemViuOshow https://t.co/BJHvvoIZyF @gustavormiranda @NetflixBrasil Uhahehshhsh @priprifaraujo Obaaaaaa Lagriminha. Te amo. ❤️ https://t.co/FeNFLMPLvz Exagero. Liga na TV Câmara. https://t.co/IwjsEKXXmS A preocupação da minha mãe com a estréia do meu show na Netflix. Agora já tá no ar. Já era, mãe. 🤷🏻‍♂️ https://t.co/IiqLOVJPX0 ❤️❤️❤️❤️❤️ https://t.co/2oJ3dAj3ZL @wandafreire 😉 @ArtAme_ Tem sim. Só pesquisar Tá no ar na Netflix!!! E que venham os processinhos!!! ❤️❤️❤️ https://t.co/hhZrWvFtWl Os advogado pira. https://t.co/cDajqb1MhK @Curum1n Faça isso. Aimmmmm @MateusCaniceiro @pablitonfelix Mals ae @MateusCaniceiro 4hrs cara. Mala@ae @Bruna_Tav Mundo todo @daniloaugusto07 Valeu broooo. Espalha aeee @Spiderike Nao vai ficar @lustforliv_ Deveras gringo @Spiderike Malsito mesoooo @alanfaustop Sexta @sofsoff 🤷🏻‍♂️ @larissnobrega Era isso mesmoooo @LUILZL Boaaaa @gabumachado Muito @squallmacthorio Hahahshsh @PauloCecchi Naooooo @karinadaniel38 Concordo mto @LucasMolejim 😂😂😂😂 @bemyguest__ Obaaaa @PortalRafinha Sexta @lannawaleria @CarlaGasparDeO2 @DaniloGentili Sexta. 😉 @daniloaugusto07 Tem o trailer @rodrigoglaser_ Boa @naomechama Cheganu Hey! Vi que tem muita gente esperando para assistir o meu show na Netflix agora. Pessoal, vai estar disponível a meia-noite de Los Angeles, ou seja, 4h00 da manhã aqui. Sorry. 🤷🏻‍♂️ Vicky???? Daonde saiu isso? @Ceenci 4h @naomechama Sorry @PieterXd Simmm @INUVLOG Po... vale @FelipeVarga3 Po... e eu???? @lannawaleria @CarlaGasparDeO2 Eu tb @otavio_silva93 Tb espero @Buyuzeraa Boaaaa @LucasMoll Boaaa @tkzins Agora fica na pilha aí. Falta 4 hrs @rodrigoglaser_ Mano... assina por 30 dias. É de graça @pessanha2001 Amanhã bro @Gigikisses Poxa. Sorry @CarlaGasparDeO2 @Joao_Reiss Inteiro RT @TheLaughFactory: #comedy #TheLaughFactory #Hollywood @rafinhabastos @fabiorabin @thejademovie and more! BUY TICKETS: https://t.co/Sjn0p… Tô no @programapanico agora! Estréia amanhã (no mundo inteiro)! Tá pesado! Tá do demo! Mais uma das artes que a Netflix gringa fez pro meu solo que estréia amanhã. Ansiosaço pra vocês verem isso. https://t.co/qmpzyuEC1A @marigraciolli Parede mesmo. Tô me sentindo naquele bar jovem descolado em que o garçom fala: Não temos refrigerante... só suco. Maracujá, romã, acerola ou tomate? https://t.co/oJtRhEfuWs Os cara acordaram cobrando da Anita um futuro melhor pro Brasil. Vocês tem iogurte no cérebro mêmo. Pelamordedeus. Arte da Netflix EUA. Assistiram o show e criaram isso. Compreensível. Nessa sexta, ULTIMATO... na Netflix. Assiste rápido pq não deve durar muito no ar. https://t.co/HGS7psT8Tu Eu depois de acessar o facebook. https://t.co/QxFw7T8OUd @Prixike @oerichribeiro @robertopc0 @lilliumsong @ricapancita Desculpa, mas quando a justiça te obriga a PAGAR por algo dito é sim um cerceamento. É uma forma de te calar sim. É como dizer que passar 2 anos na cadeia ñ é calar a boca do sujeito. POR TRÁS DO SHOW - ep 3. Meu especial de comédia entra na Netflix na sexta. Por eqto , assiste aqui a 3ª parte da série que mostra o processo de criação do show. https://t.co/debWPdK6Db Portugal, tô chegando!!!! Vem me assistir. Shows no Porto, Braga, Aveiro, Damaia e Lisboa entre 3 e 7 de outubro. Infos e vendas: https://t.co/yMWna8DrD1 https://t.co/RssT2tj6vN TÉ QUE EMFIM! NESSA SEXTA ENTRA NO AR! Tô ansiosaço. Quero muito que você assista. Ps: Esse videozim tá todo limpinho e bonitinho. A sujeira pesada, a Netflix guardou pro show mesmo. https://t.co/lVWl3pb2Fg Esta sexta na @NetflixBrasil. https://t.co/ntAJmdiPIh Próximo jornalista que escrever “fulano escreve tal coisa e desagrada a Internet”, leva um coqueiro na raba. Valendo! @cauemoura Uhehehehe Los Angeles: Dia 25 agora... eu, @fabiorabin e @thejademovie no @TheLaughFactory em Hollywood. Vendas: https://t.co/ExBKeiHFg0 https://t.co/3TV8F6I8jN 9 dias pro lançamento. ULIMATO, dia 21/9 na NETFLIX. Não perde! https://t.co/OgjIhY2Kzg E após décadas de bullying, a Globo finalmente se vinga do Pânico. Saca o tema do programa de hoje. Porra @cariocadelegado! https://t.co/r8M4JJK0Hz @YgorFremo Valeu grande Ygor!!!! @BellesaCo @SryAboutLastNyt @PhilanthropyGal @KrystynaHutch Helppppppp ULTIMATO. 21/9 na Netflix. Faltam 11 dias. Ajuda ae! https://t.co/SNI5MjK9LJ Perdemos um cara foda. Um grande parceiro. Esteve comigo na TV, na Internet e no cinema. Não se levava a sério e nunca deixou de dizer o que pensa (por mais absurdo que isso as vezes fosse... nisso sempre me identifiquei). Vai nessa, pai! Descansa. https://t.co/nkPnlY0TJ2 Quando eu tô na merda e um amigo diz: “Vai ficar tudo bem”. https://t.co/399J5SxSCb @obede Pode ser, mas achei engraçado. Posso não concordar com as posições dele, mas gesto de pistolinha na uti depois de levar uma facada me fez rir alto. Hehehehee! Respeitei o senso de humor do caboclo. Espero que eu tenha entendido certo. https://t.co/Lt2dOzOZuJ @randomboxes_ @SryAboutLastNyt 🙌🙌🙌 @hlycv @SryAboutLastNyt Heyyy! Heyyyy! Heyyyyyy! You are genious!!!!!! RT @broome88: Thank you to all the fans around the world who have helped make this a global success! #Ultimatebeastmaster ⁦@DanniiMinogue⁩… Tô hoje num dos podcasts mais legais dos states: Guys we Fucked. https://t.co/SUSTKqVvEQ @UFCBrasil Até que enfim. Esse já era pra ter estourado ha muito tempo HEY PORTUGAL! Tô chegando aí no dia 2/10 para shows em Lisboa, Damaia, Braga, Aveiro e Porto. Não perde! Infos e vendas em https://t.co/gFpeRUy7x7 https://t.co/cdCqYMRc0X @hexatamente Uhahehsheh Obrigado Nova York! Ps: Gosto de agradecer a cidades... assim como fazem o U2 e os candidatos a presidência. Isso dá um caráter de grandeza a minha pessoa e vende a imagem de que estou conquistando o mundo. https://t.co/kLAa349Kdt @melrodriguez25 Vou em janeiro!!!! Tenho show @GuiTome @ThatyCosmeticos @grauhase @marcos_rvn @Haddad_Fernando Thomé... Guaianazes discorda de ti. A vila madalena concorda. No Genial é só sucesso. Triste o Museu Nacional ter pego fogo.. mais triste é vc nunca ter se interessado por ele... mais triste ainda é vc estar chorando por algo q nunca te interessou... ainda mais triste sou eu te julgando por estar chorando sem nem saber q ele ou vc existiam. Triste isso. @robertaromano @Beastmaster 😉😉😉 @liyees 🙌🙌🙌 @notlir @fabiorabin @Nene10 Vc é um jovem do sexo masculino. Isso complica as coisas pra mim. @samuelamarant Valeu broo @Jessucrazy @TheFunnyVine https://t.co/ss3hU92nVf @fabiorabin @Nene10 Comeria vc e o NENÊ. @Padig Orival morreu na hora certa. Se liga no final desse trailer do @Beastmaster. Uhahe! Tá no ar! #EssaJaquetaTaRidícula https://t.co/FKEkv4lPap #ultimatebeastmaster @ordepj O que ele fala? @laujagrr Foi foda. @Chaiana_nunes 🙌🙌🙌 Faltam só 20 dias pra estréia do meu especial Netflix! 😳 https://t.co/H3KRMkCKf4 @Haddad_Fernando @GuiTome E porque vc deu uma cabeçada nela? Pobre senhora. @arreeguanatalia Vai melhorar. Eu acho @SugaImYourHope Assisti o brasileiro. A versão brasileira. É só nós @trubisquinho Certeza @TatianaBuske Pô!! @_amorimrenan_ Nem eu @Jehvarolli @NetflixBrasil 🙌🙌🙌🙌 @fuckzreality 🙌 @dudabolt 🙌🙌🙌🙌 @joaozinhomarcos 🤷🏻‍♂️ @laly_abrahao @NetflixBrasil 🙌🙌 O dia que eu quase morri. Pra saber o que aconteceu, assista nova temporada de #ultimatebeastmaster. Tá no ar na @NetflixBrasil! @Netflix @Beastmaster https://t.co/o2g73jwgod @NicksonMaciel Foda meml @laly_abrahao Jjrrejeejejejhhehe @JACKNAJAS Aeeee @HugoCWolf_ @NetflixBrasil Uahhwhahs @dulceamoreira @SpiderAnderson Obaaaaa @Beatriz_587 🙌🙌🙌 @MaxieMaya @NetflixBrasil 🙌🙌🙌 QUASE MORRI! Tá no ar, a nova temporada do Ultimate Beastmaster na Netflix. E tem Brasil no páreo!!! Assiste aí que tá demais!!! https://t.co/w8wehiI4MC @MarceloAdnet Mano... gênio O FDP é gênio. Uhahehha! https://t.co/pwkPJ9RTaD @FabioPorchat Também assisti. Ligue pra minha mãe e mandei ela a merda. @YgorFremo Pode deixar. Sem problema. Eu tava mal informado. Mereci. Quando você não estudou e o professor cancela a prova. https://t.co/qcbpmaKXL5 @otacosta Buuuu!!!! Muito civilizados!!!! Quero sangueeee!!!! @marcotsantiago @YgorFremo Eu não sabia disso. Mesmo. @YgorFremo Isso aí eu já nao tava sabendo. Ixi caraio. Aí já complica muito. Inclusive apaguei o que escrevinhei. Vou me informar melhor. Amanhã estréa a nova temporada do #UltimateBeastmaster! E tem Brasil no páreo. Tá sensacional! Não perde! @Beastmaster @broome88 @netflix https://t.co/NX2P5WAqqp E assim vamos superando os obstáculos que a vida nos traz. https://t.co/0Szhwm1RSR O bom e velho SUSTEIDO. https://t.co/407lj0dx7X Gostei de um vídeo @YouTube https://t.co/MekgxmPuZP Central - Crise dos caminhoneiros @Niveabiba ❤️❤️❤️ O rapper é Bonner fazendo as perguntas mais longas da história da TV. #FalaMuito https://t.co/a37po8GXDY Coisa linda! O exato momento em que essa menina linda descobriu que estava sendo finalmente adotada. Ps: Bateu uma saudade monstra do meu filho. Dá um beijo no seu aí por mim... e sim... também chorei. https://t.co/bgyIZkw1Mn O impossível existe. Resta você deixar de ser trouxa e reconhecê-lo. https://t.co/XCzbfEVkVZ @chicoteiajesus Nem se compara. Muito mais honesto. #TVaberta #Brasil https://t.co/nq8BrClYKJ @tnmsqt Tainá... pensando assim, acaba o humor no mundo. Sempre alguem vai ou pode se ofender... com qualquer coisa. @cauemoura Muita voltinha pra chamar de perfeito. Nao concordo, mas aceito o elogio. ❤️ @LuanCene 🚨 Tocou o alarme de cara chato pra caralho aqui. Galerinha tá chata ou eu sou um monstro (talvez as 2 coisas). Eu sabia exatamente como ofender o público. Hoje o povinho fica indignado com umas coisas que eu preciso estudar e pedir pra alguém desenhar aonde tá o problema. Uhahhwhahheh!!!! https://t.co/sjfVJgqOfX @CamilaCallimanP 🙌 Separados por um Neymar. https://t.co/UY3OGiZqdp @mucamuricoca Como elas nao se mataram? Como elas conseguiram chegar tao fundo no poço? Geração PornTube Nutelêra dos carai. Aqui é raiz, porra! https://t.co/fQdqW9vhpk @CPrindio Poutz. Que bosta Foda quando as pessoas acham que os manos mais feios do mundo são parecidos comigo. #DebateRedeTV https://t.co/7NjkgdxC7t Acabei de cagar sem meu celular. Foram os 6 minutos mais tristes e solitários da minha vida. Doutor Bumbum é sem dúvida o pior apelido possível pra alguém levar pra cadeia. https://t.co/GU16txk7QP Terceira temporada no ar dia 31 de agosto. 🙌🙌🙌 https://t.co/vsjDcNueUl 21/9... e tá bunitu! https://t.co/mK8F3hNoFo Episódio monstro hoje na Ilha de Barbados. Curte aí: https://t.co/GL0V1VkqAl https://t.co/3AWdFI5JEN @MauMeirelles @fabiorabin Volta la a brincar de zoeirinha no facebook que era mais bacana, caraio. Para humor: Acesse https://t.co/lvA12F7Bdo “Cabe ao jornalista colaborar para a construção de uma sociedade mais desenvolvida”. Parabéns @UOL! https://t.co/GXzsRHzVRo @fabiorabin @MauMeirelles Caraio... o q vcs tao falando? Quando viraram Alexandre Garcia nessa porra? Taquispariu. RT @GoodLooksShow: Wednesday! UCB Franklin! 8PM!\n@littleesther @maxsilvestri @rafinhabastos @iAmRobbyHoffman @IanKarmel @AndrewMichaan \n\nTI… Acho que chateei meus amigos no vídeo de hoje. Assiste ae: https://t.co/tvVSS4wYT5 https://t.co/QEd6CtaVpR Feliz dia dos pais! ❤️ https://t.co/1Bbs9DJkij “A amizade é um amor que nunca morre”. Frase de Mario Quintana, falecido em 1994, 10 anos antes da criação do Facebook. Aquele verão show. https://t.co/NoYfAwPSpR @ufc Singer Pitbull x Tiger Woods. @colorina Agree Sempre acesso o Facebook antes de fechar o olho... pq acho errado dormir feliz. @FeCastanhari Eu mandaria fotos sorrindo no insta. Pare já com essa zoeira. https://t.co/HmZy7YNrbc Putaqueospariu. Olha as matérias. https://t.co/fGfmMTlmwA Faz faculdade pra escrever uma matéria de bosta dessas, hein?! É pra ganhar moral com a turminha descolada do boteco, fdp? https://t.co/Nycy8GCWQ2 @bicmuller A minha no crossfit (tentativa única… Nunca mais voltei). Gostei de um vídeo @YouTube https://t.co/HpD4smMp3z Stanhope vs. Bagzilla Antigamente os BBB saiam tudo com vergonha. Hoje saem influencer. Aeeee!!! Daqui a pouquinho em LA. https://t.co/qviBkvi5y4 @QueSeFueda @_TomRhodes @allthingscomedy Same thing. I am Lenny Bruce. And u suck my shine and beautiful balls. RT @_TomRhodes: Rafinha Bastos is the Lenny Bruce of Brazil and he has the court orders to prove it. He has been sued and had his life thre… @mar_de_palabras @laurenduca They were asking him to SING in portuguese. Vamos sair?! https://t.co/ZCdEaYX4TK @laurenduca Well... I am from Brazil. If a guy from germany comes to Brasil and give a big speech in Germany, I would be a little curious too. @chinisalada Heheehehee Suas definições de Carreta Furacão foram atualizadas. https://t.co/uuH5A5eYJQ 👏👏👏👏👏 https://t.co/Tw7i1vG8nY Melhor tirinha. https://t.co/pgUOKPwMsW @lucianoalbef @sunsetlaa A capa é de 2011, zebu. A piada dele é de 2014. Forte abraço. @anadodique @Claytoii Chupa! @avila_rodrigo Tom Cavalcanti Parabéns ao @sensacionalista por assumir a direção do maior portal brasileiro. https://t.co/o31nz7S2DT Quando vc fala merda trabalhando na Globo x fora da Globo. https://t.co/nLwJ1ZdMR1 @biasors @gmmaiadenovo Valeu pessoinhas!!! @ehistovinicius Esse é o objetivo @rdgsdev Eu tb @desertqueeeen Que masssa!!!! Valeuzaço @rodrigodrod Valeu rodrigo!!! @Osanches Muitooo @Curum1n Hehehage @seinemmeonome Boa resposta @lokoblanka Valeuuuu @FredCooperDiddo 🙌🙌🙌 18 de setembro, garotim. E tá bonito, viu? Assiste ae! https://t.co/C6Sm1yA43C @haas_lennon Valeu brooo Um podcast comigo in english. Ouve e me diz se eu tenho mesmo condição de sobreviver falando outra língua. https://t.co/lHPFn9fvA9 @MrPoladoful Melhor som!!! @marcelorubens ❤️ Sua vida é mesmo dura demais, bro. Vou jogar sim essas pedras fora... opa... achei um tijolo aqui. #ad https://t.co/ZDwWPBGtVT Niiiiice @josealdojunior!!!!! #UFC @mcreboucas Valeu meu velhoooo!!!! Me manda o site da comunidade. É facebook? @rafaelrodrigues Nao distorce meu velho. NUNCA falei que racismo não existe. Pelo contrário. Só assistir de novo. @pcyhyo 🙌 Gostaria de celebrar este dia único em que passei 12h sem carregar o meu celular. I’m a winner! #tbt 2011 / 2018. Ps: Nitidamente fingindo que dormimos na 2ª foto. https://t.co/ETe1EI6Z2F @caiocgomes Se a consequência é a PROIBIÇÃO, você não pode não. É bastante perigoso pra comunicação o que está acontecendo. No meu caso, não foi apenas “desagradar o público”... foi perda de direito mesmo. @caiocgomes Tive um dvd tirado de circulação; um processo que me impede de falar sobre determinado assunto; tive que pagar bem caro por falar uma piada. Dizer que “ ninguém vai te proibir de dizer algo” é desconhecimento da tua parte. O problema é bem mais grave e perigoso. @mtesperon @ivoneuman Olha aí o papinho de “passar pano”. Isso é de uma babaquice ímpar. É não aceitar discussão nenhuma. Mais obstáculos... mais países... mais épico. Vem torcer pro Brasil na 3ª temporada do Ultimate Beastmaster. Dia 31/8 na @netflix. https://t.co/9ROmmGc3oZ Edir Macedo no Faustão. https://t.co/YmSzx5XHCX RT @MauMeirelles: Funciona assim:\n1) figura pública fala algo\n2) 20 pessoas criticam na internet\n3) jornalista pega isso e coloca como INTE… @olucassalles @AwardsDarwin @samirsalimjr Copiaram muito Não?!?! Jura?!?! Serião??? https://t.co/Obs1YycuBC @panfiettii Concordo Jornal da Globo: Sequestro / Corrupção / Tiroteio / Morte / E agora é hora do projeto BRASIL QUE EU QUERO. Taquispariu. RT @fabiorabin: LOS ANGELES! Dia 21 de julho tem show aí no Improv com @rafinhabastos @thejademovie e eu as 19hs! Vamos fazer Stand Up Come… Gesto nobre do goleiro da França. Se eu tivesse a chance de fazer o mundo inteiro sorrir, faria o mesmo. Filho, estarei sempre ao lado.... a não ser que nossas vidas estejam em risco, obviamente. https://t.co/c2mHUunoo2 Dia 18/9. Tá muito foda. Garanto. https://t.co/w5bg5lOwCL @annaclaricee Legal. Vc foi ficando mala com o passar do tempo. @donajujuh Juliana... nem tinha visto isso. São milhares de comentários por minutos. Obviamente eu condeno esse tipo de comentário. Tentei deletar, mas ñ encontrei. @inagaki @iberethenorio Uhehehhehe! Li 2 vezes pra melhor compreensão. Confesso. O twitter sempre dando umas dicas muito show pra mim. https://t.co/VuQ4JVMWNl @Pmuzi Uheehehhe @mpa90 Eu li 20%. Texto pacaraio. Bom dia pra vc também. https://t.co/QMTEAuVTGH @marigraciolli Nossa... hehehshe! Galera criativaça. @Lima_Lucas É @ManoBrownOF. Pode xingar. @capitaoluffy @pecesiqueira @cauemoura Chato pra caralho vc. @AureaDamasceno uhehehheh É difícil, numa discussão, reconhecer quem foi grosso. Muitas vezes a estupidez vem com volume baixo. A reação é em voz alta. O culpado? AQUELE QUE GRITOU. #injustiça @rodrigo_saran @netflix @NetflixBrasil No mundo todo. @arielchileno Vai nanar, campeão @telescraquel AManhã vou no medico Eu sou um dos produtores aqui do Brasil. :) https://t.co/vJ3b5NjfuG Dia 18/9 na Netflix. Assiste assim que lançar porque esse a justiça não vai deixar uma semana no ar. @netflix @netflixbrasil https://t.co/EORFLA1M5R @LuccaPrado86 Sim. Sabe o que também é muito difícil e exige prática, técnica e muita aptidão física? As piruetas do Circ di Soleil... nem por isso é esporte. @sissirb 🙌 @jovemnerd Cara... o principal é amigo cantor Naldo. Muito foda. https://t.co/KJVrzxjFaA @jovemnerd Cara... essas novidades são top. Tenta assistir outra na netflix... chama FRIENDS. É 10! @mauromueller Meu celular é de traficante. Pega em áreas impossíveis. Na vida real: Cara, discordo de vc.\nNa internet: Porque você não cala a boca, babaca?! Só fala bosta! Tá passando vergonha, otário! Se mata. @JeanCarlos501 Cara... eu acho bom pelo simples fato de que o Lesnar é um bom lutador. É all-american no wrestling olímpico. Mas entrar no octógono e dar discurso ao estilo wwe fica estranhão. @bruh_fenix @IgorRyanSilva2 @lucasFCSN Sim Bruna... concordo com vc e te digo q vc trouxe um bom argumento. O que posso te dizer é que esta encarada tem um elemento importante: 24h depois os dois caras vao sair na porrada de verdade. Existe ali uma tensão verdadeira. A intimidação é real. @wrestlemaniacos Cara... eu vou repetir... como entretenimento acho divertido. Bem roteirizado. Bem atuado. Assisto como teatro... nada mais que isso. No contexto do mma fica forçado. São duas coisas diferentes. Uma é real e a outra é programada. Eu sou mais o real. @JeanCarlos501 Tranquilo. Mas eu respeito, cara. Como entretenimento bacaninha. Quando falei que é ruim... falei naquele contexto do mma. @IgorRyanSilva2 @lucasFCSN @bruh_fenix Simsim. Foi comprado pela WME. O bussiness dela é entretenimento. Vai migrar pra isso. Sou careta... acho errado, mas a evolução é essa. @lleo_machado @wrestlemaniacos @JacsonJn @JeanCarlos501 Isso no mma é palhaçada sim. Eu acho, cara. Fica feio e forçado no UFC. Ontem foi bobinho. @Paulovernillo @wrestlemaniacos Um puta entretenimento legal. O que to dizendo desde o começo. @JeanCarlos501 Entao rapazote... foi o que eu disse. Vc concorda comigo e ta brigando. Quer que eu te encaminhe os tweets das pessoas dizendo que é luta? Vai nanar que amanhã c tem provinha. @JeanCarlos501 @ohumorwrestling Tava falando da gritaria que ele fez... não do wrestling. Wrestling é um teatro daora. É divertido. Abs @wrestlemaniacos Robert De Niro fez papel de lutador no cinema.. sabe o que é!?? Um ator! @wrestlemaniacos “Não é porque a pessoa está “atuando” que ela não está lutando”. Você realmente disse isso? É exatamente pq estao atuando que nao é luta. @JeanCarlos501 Aquilo não é luta... é teatro. Um forte abraço. @wrestlemaniacos @JacsonJn @JeanCarlos501 Sim... praticam tudo isso... são grandes atletas... e usam todo esse conhecimento em artes marciais para fazer um teatro bonito. Só isso. Qualquer lutador que combinasse resultado e sequência de golpes com o adversário seria suspenso de qualquer esporte. @IngridSev7n Sim... a cagada foi do UFC. Nunca disse que foi do Lesnar. Ele ta no lugar dele. @IgorRyanSilva2 @lucasFCSN @bruh_fenix Cara... aquele payperview foi um dos 3 menores do ano. @wrestlemaniacos Quebrou o pescoço produzindo entretenimento e não numa luta. Abs. RT @rafinhabastos: Acordei desnecessariamente feliz. Entrei no Facebook. Voltei ao normal. RT @rafinhabastos: Terrível acidente no parque diversões. Imagens fortes. https://t.co/VIgIJNEzJ9 @JeanCarlos501 Cara... acho uns putas atletas fodas. Um show divertido... só nao da pra misturar com o mma. Só isso. @BloodWrestling Lacrou. https://t.co/8SzkSRsaRd @luizfelipeprota Sim sim. Eu curto. Acho os caras foda. Só nao da pra misturar com o real. Essa entrada do Lesnar aí foi teatrinho ruim. @luizfelipeprota Nao luiz. Nao respeito. Nao tem como. É ruim . @adryannop Pelo menos provoca sem empurraozinho forçado. Foi ruim @marcogomez_ Liguei nos ultimos 10 segundos. Vi nada @JonathanFriesen Valeuuu @ursosentado 🙌🙌🙌 Acordei sem energia, apaguei de tarde e agora tô acabado de novo. Puta dia de Iphone dos inferno. @_hahayy @cocielo Ia. Abraço. Relembrando um post de 2014. Anos depois a vergonha continua a mesma. https://t.co/uNruByBrF2 Se o Galvão parasse de chamar o Neymar de ‘NEY’, o jogo seria outro. @pecesiqueira 😭 @donajujuh Falei do twitter só. Na vida nao. @CamilaCallimanP Tem que pesquisar no search mesmo Fui rever meus tuítes antigos. Mó deprê. https://t.co/ayJyyL1l7z @vicenteflores93 @Giovannadbt Triste isso Dizer que ama é fácil... quero ver não assistir mais um capítulo da série quando a pessoa tá longe. Tranquilaço. https://t.co/kzrlk1N5BQ @manubarem Uhhehahhe! Sacanáji! @MestreAnaoBardo Errou bro. Errou mesmo. Já admitiu. Vida que segue. @lucianopotter @Nike @UNIQLO_JP Acordou Globo Esporte hoje, Potter? @cmerigo Tá bom. Vai pegar um moleque que saiu da periferia... tem mãe e avó negras... que faz uma piada ruim e pede desculpas pra usar de exemplo no combate ao racismo. Força aí, campeão! Que vc e o seu tribunalzinho sejam felizes. @cmerigo E onde que eu disse que ele tem direito de ser racista por ser assim ou assado? É errado e o cara pediu desculpas. Tua leitura tá equivocada. O @cocielo é um dos caras mais legais e humildes com quem já convivi. Tem um coração gigante e é admirado por TODOS, repito, TODOS os influenciadores que conheço. Perseguir o cara por causa de um erro (ele já se desculpou), é um equívoco imenso. Esse ñ merece mesmo. Minha vida é uma grande batalha contra a bateria do meu celular. @RitaLisauskas 😉 @AxasWu Reescrevi @RitaLisauskas 👏👏👏 muito beeeeemmm 😂 Um exemplo de pai de família. Abraçou a zoeira e mostrou que o bom humor pode ser uma bela ferramenta pra combater o preconceito. Dia triste. Descansa, cara. https://t.co/xAhJxpqrIM @Pirulla25 Te conheço pessoalmente e concordo com ele. Mas por ser um lixo é que tens o meu amor... seu fofo. @RitaLisauskas “Lasquem”... queria ter esses bons modos. RT @UEComedy: Tonight @westsidecomedy @ 8PM don't miss @ramy @ItsTraceyAshley @BrendanSagalow @IAmMikeFeeney @neelnanda @rafinhabastos @Eri… Videozão da porra hoje no Ilha de Barbados: https://t.co/M41KvLQWVk https://t.co/wfh5Ply94m Neymar reclamou que o Gabriel Jesus deu um corte desnecessário... Gabriel olhou pro cabelo do Neymar... os dois sorriram e voltaram pra defesa. @HotTub_Show @DebraDiGiovanni @IAmMikeFeeney @EpiGillespie @myqkaplan @taylortomlinson @Byoussef It was awesome!!! Temos um GÊNIO na Internet brasileira... e eu não uso essa palavra todo dia: @gaveta. Olha o vídeo novo do cara: https://t.co/Ijs4aydfcZ Vc nunca será feliz com outra pessoa se não for feliz sozinho. Quem disse isso ñ fui eu... foi a minha namorada que, graças a Deus, me deu outra chance. Obg amor. Nunca mais me abandona, por favor. Quando eu descubro que não vou ter  1% de desconto, posso dividir em 12 vezes. Vídeo novo no Ilha. Assiste aí: https://t.co/mbLJEHoZsr https://t.co/4b33LvDKvY Alertei minha vó de que o gênio da matemática brasileiro que ela compartilhou nas redes sociais e na verdade um ator pornô. Ela deve estar assustada de eu saber essas coisas. @namastrevas Hipocrita pq? Aquele que me encontra e diz que “o mundo tá chato” é exatamente o mesmo que tá mitando no face e deixando o mundo cada dia mais chato. O melhor vídeo da eternidade. https://t.co/yEbseSYqKL RT @TheComedyStore: 7pm Main Room @marcmaron @bobbyleelive @gadelmaleh @steveo @Ornyadams @rafinhabastos +more! https://t.co/vk3EgJLe62 #th… @Lbfs17 🙌 Deus vai aparecer, olhar pra galera e dizer: “Chega! Saiam da Internet! Vocês tão tudo errado”. Assim... sem plural mesmo. RT @HotTub_Show: June 25 w/ @rafinhabastos @DebraDiGiovanni @IAmMikeFeeney @EpiGillespie @myqkaplan @taylortomlinson @Byoussef https://t.co… @4drianoSilva @FabioMe16577855 Mano... pq tu nao assiste o video inteiro? @SeuRiba Eu até ficaria chateado, mas entrei no seu perfil e vi que você comemora o seu aniversário da conta no twitter. Então apenas sorri. @JadeFraga @wesleysb_ Nem eu em vc... entao ta tudo bem. High five!  👋🏻 Brasileiro não tem moral pra tirar sarro do argentino. https://t.co/q0oFewVGUg @joycemocock Não disse isso. Só falei da frase “o sociedade é de tal jeito”. @SusanaCRF81 Você tem um perfil com foto da Susana Vieira. Você acaba de perder o seu diploma. “Porque a sociedade é assim... pq a sociedade é assado”... quem é você pra dizer como funciona a socialedade? Você tem um perfil no twitter e não um diploma de sociologia, caraio. @youpix @biagranja Metas e métricas é exatamente o oposto de autenticidade e criatividade. O bondinho da lacração hoje tá animado. @oxelorenamoura @andrefran Exato @andrefran Ta problematizando sim, bro... mas tudo bem. O Nazario tb trocava de penteado e era só festa. O problema tá no teatrinho q o neymar faz. Teatrinho sem resultado dá raiva mesmo. @JulietaBaldon Deletei. Achei q um amigo tinha feito. Sou contra isso aí. Eu sou a bola, o Alisson é a justiça. https://t.co/3FEYSNTGmx A câmera corta pra arquibancada e mostra o real povo brasileiro, um país formado por advogados, arquitetos e CEOs de grandes empresas. Só queria que o meu coração superasse a dor com a mesma velocidade do Neymar. México ganhando da Alemanha é o Rocky derrubando o Drago. https://t.co/cRhXwo4Nq4 Beleza exótica é a feiúra sob os olhos da pessoa educada. Que horas é o jogo do Brasil amanhã? Indo pro show! https://t.co/cy0hFSbwv6 @Lakitasodre 🙌 Explica pra mim aí o que o china ta ganhânu nessa brincadeira. Tô vendo o Trumpinho dar palestra e o Te Bo Lee só no sorrisinho. Tá aprontânu alguma o Michelin, né? Diz aí. https://t.co/YjKVi63fvG Em vez de celebrar, foi consolar o amigo de infância que jogava no outro time. Incrível. Via @houseofhighligh https://t.co/JOLL5oQTdr Acho que envelheci bem. https://t.co/Iv7LItowqb O cara tá conscientemente humilhando o CM Punk. #UFC https://t.co/0bjUReRXtz Há anos eu não me encolhia com um nocaute no UFC. Acho que desde as cotoveladas do Patrick Smith no UFC 2. Essa luta do Overheem me fez rever a minha vida. Ca-ra-leo. #UFC Gostei de um vídeo @YouTube https://t.co/bvjJnuxTUi For Real - Candy Rain Gostei de um vídeo @YouTube https://t.co/7UxJEqptYJ James - Make Love To Me @mascarine7 @gabriella_almd Segura o corrimento aí tia @gabriella_almd Muito bom gosto RT @brianmonarch: Tomorrow night at @HollywoodImprov on Melrose at 10pm w/ @rafinhabastos @iliza @TheoVon @SklarBrothers @JamieKennedy! htt… RT @TheLaughFactory: #comedy #TheLaughFactory #Hollywood #Thursday @JayDavisComedy @rafinhabastos @PreacherLawson @JamieKennedy @thechrissp… Amanhã faço um show mucho bacana aqui em LA. Aquele retweet maroto no meu próximo tweet ajuda a espalhar a mensagem. Gostei de um vídeo @YouTube https://t.co/6IcfFhBvEw | Maria Alice e Claudio | Segunda Chance {DISENSA} @eduagraespn Grande análises, Agra. Depois dessa a ESPN nunca mais me chamou. 😂😂😂 Valorosa e profissional análise minha sobre a calçada da fama em Hollywood. Assista e aprenda: https://t.co/wK4t9KLfeF https://t.co/ctoNJFe6sg RT @rafinhabastos: Os politicos proibiram o nome do aplicativo “Detector de Corrupção”. \n\nO @MauMeirelles sugeriu um novo nome: “Detector d… Normal. Nada demais. https://t.co/f00iP5sAin O cara ñ é desse planeta. #NBA https://t.co/PurLw0Bg2k @MiaMello Suas definições de “a balada foi lôka” foram atualizadas. @marigraciolli @danillobatista @Zanfa Sou mais autista Um agente do FBI vai pra pista de dança, dá um mortal de costas, a arma escapa da calça e ele acaba atirando na perna do DJ. História real. https://t.co/3za1B1vkc6 @andrefran Èlé do @RogerioVilela @andrefran https://t.co/CeNXlZwjws Sua hora vai chegar. https://t.co/4GHR7KZeO4 @vincentslee @miryslist @Racheldoesstuff @MintMilana @shitfromkiran It was a great night! Thanks for having me. It was an honor. 🎼 O sabor brasileiro! 🎵 https://t.co/yJDqSdbUN7 Obrigado por dividirem seus sonhos comigo. 🙌🙌🙌 https://t.co/7yaP38ZZGI @Marcos_Borba Opa! Diz a minutagem em q ele fala RT @rafinhabastos: Interessante a moça do Instagram q fala: “Ñ importa se vc tem um corpo perfeito... o q importa é vc estar feliz com vc m… @Marcos_Borba opa! Onde ta o podcast em que ele falou??? Lebrão rouba a bola e dão falta. Lebrão leva uma caceta e ñ dão nada. Aí complica. #NBAnaESPN @MysteryGuitarM @TheLaughFactory Heheheh RT @TheLaughFactory: Navigating American culture, the Brazilian way is @rafinhabastos. https://t.co/vOk1xTd0se Corpus Christi... do latin: “Não tem aula ae, caraiooo! Que beleeeza!”. Galerinha da Califórnia: Tenho show hoje no @TheLaughFactory em LA. Vai ser fueda. Ingressos com desconto em https://t.co/SuX62ZMJYs. Código promocional: RAFINHA. Ps: O 4o caboclo da foto ñ sou eu nem o @MauMeirelles. https://t.co/IX9llgbQxx @PaauloMedeiros Cara... ele faz parecer fácil. A NBA tá fresca: Encostam no Lebron é falta... Harden se atira no adversário e vai bater lance-livre. Tempo mole... sem pancada... sem pivô. Queria ver Draymond Green, Horford e Thompson segurando Shaquille, Ewing e Alonzo Mourning. Hj Kevin Love joga em baixo. Taquispariu. #NBA RT @HollywoodImprov: Don’t miss this killer show TMRW at 8! @SherriEShepherd @KevinNealon @RafinhaBastos @OrnyAdams &amp; @MaxComedian are taki… Os politicos proibiram o nome do aplicativo “Detector de Corrupção”. \n\nO @MauMeirelles sugeriu um novo nome: “Detector de Ficha de Político”. \n\nPrefiro abreviado: Detector de FDP. Vocês gostam? https://t.co/YKZ6Mtx8fx RT @TheLaughFactory: #comedy #TheLaughFactory #Hollywood #Wednesday @JayDavisComedy @rafinhabastos @SherriEShepherd @JonathanKite @TONYROCK… E o @UOL ainda faz matéria em cima de repercussão minúscula na web. Criando polêmica onde não existe. Prejudicando colega q só quer fazer rir. Devia ser crime. @Rudylanducci, tô contigo. https://t.co/2LzVwqneq8 RT @HollywoodImprov: Don’t miss this killer show TNGHT at 8! @kurtmetzger @NicoleByer @RafinhaBastos @annielederman &amp; more will be here! 🎟️… Depois da sexta tequila. https://t.co/KJWpRBcgVp Recomeçando. https://t.co/5CSeN5QaoF My pleasure, my friend. 🙌 https://t.co/c17XrwSo6F @luysaflor 🙌🙌🙌🙌 @ale_birds @HollywoodImprov Jehhehehhe! Lets do this!! Uma estrada longa pela frente. https://t.co/mSghSrehBc @ale_birds @HollywoodImprov Obrigado pela visita, meu velho. A plateia estava difícil, mas sei que tem um caminho legal pra seguir aí. Daqui a pouco faço um show maior e vai ser foda. Obrigado mesmo pela visita velho Machida wins by tiro-de-meta. Belfort se aposentando. Carreira bonita... desde o UFC 5 na estrada. https://t.co/xhK0C59Atb @bori_ng 🙌 Nunca o slogan “o sabor brasileiro” fez tanto sentido. https://t.co/Em8b4r52yM Chegou a sua chance. https://t.co/03SYIlLpiO @bibiayete 🙌 Quando entrei na Rede TV. https://t.co/Q5nFz8MWzC Manoooo! Uhhahshhshhe! Nem precisou de som pra ser hhuahhe! https://t.co/UsgsVfHPcJ As moça faz esses preenchimento labial aí e ficam parecendo q tão assobiando o tempo todo. @Bianca_RCC Vamo q da tempo @lamonteiro Corre! @naosalvo Viajar é uma bosta. Abraço @PCoelha23 Exatamente Sua carreira não pode estar indo no caminho certo qdo vc busca “FRASES HITLER” no google pra sacanear um amigo e é isso que aparece. https://t.co/AGWVHIHC2h @bicmuller Interweb nunca decepciona. Vou dormir e sonhar com o tempo em que o orkut era top. @bicmuller 🙌 @bicmuller Desculpa. Apenas ñ to num bom momento. A meia ficou show. https://t.co/yV54e1TkKr @MauricioRicardo @chicobarney hahhehshe!!! Hey!!! Lembro de tudo isso. Tb ñ sigo meu pai e nem @OCriador e nem por isso tretamos. Pra mim, somos bródis. Twitter de cu é rola. Bjo no coração. @MauricioRicardo @chicobarney E aí eu te fiz o q? Diz aí pq ñ tô sabendo. RT @PatrickMaia: Hoje tem @rafinhabastos no meu podcast #PorcosVoam! Ouve aqui: https://t.co/4Ja70dXNaD https://t.co/qt2n2XjY2F O maior comedy club de LA, o Laugh Factory, postou uma piadoca que eu fiz lá. Se puder entrar aqui https://t.co/GzJvBONGgQ e deixar seu likezinho seria lindo demais. https://t.co/zQEie42kSJ @feltrinoficial HAhhehahahheh!!! Morra, caloteiro! https://t.co/ivPQ7puhfH O dia que os super-heróis dessa Marvel aí tomarem pílula de nanicolina pra salvar o planeta, aí vcs vem falar comigo. https://t.co/3sh6aMGreE @jeniflrs Ufa! @jeniflrs Decepcionei? Nunca achei graça nestes bagulhos de filme de super-herói aí que vocês gostam. @braian É golpe? Jura? To aqui no fone com eles desde domingo. Acho q vão atender agora. Resolvi não baixar a atualização do meu iPhone. O sistema vai dificultando tanto a minha vida, mas tanto que daqui a pouco eu tô ligando pra telefonista pra fazer chamada. A solidão humana chegou a níveis inimagináveis. https://t.co/NYh07T516I Um alívio ver uma mulher linda namorando um cara q depila o peito. É deitar a cabeça no travesseiro e pensar: “Não era pra mim mesmo”. https://t.co/8xVTPHQenW Dedicando essa segunda-feira a este gordo que acho que é um gato. https://t.co/5lfzBtEh8r @HavocMiranda Valeu bro! @aliceon_ 🙌 Consegui tranquilo. Sou um guerreiro. Não acredito no impossível. https://t.co/DO3OUonZMY Eu e as minhas superstições. Vídeo novo no Ilha: https://t.co/Twf1dyAeLF https://t.co/TNiaFprbMm Quando vc tá enchendo o saco de todos ao seu redor. https://t.co/gGNXoY0LHq https://t.co/l4bJt7BuSg @xandeluna Melhor filme @EuToBemTriste5 Relax. Se vc saiu feliz... ja ta lindo. 🙌 @ciranadorado @agarcc Pbeeeeeensss!!!! @fred_b12 Onde compro carregador de celular? @cauemoura Já pintei. https://t.co/0uRCsFELD0 @andrefran Quebrou tudo a temporada toda. Foi meu lider no fantasy. Parabéns @cauemoura! A-do-rei! https://t.co/YnTnqlLdqk @catupiry @naosalvo @brogui @kibeloco @jbanguela Eu matei 12 pessoas. @marigraciolli Krav-maga O mundo em guerra, o país em crise, as pessoas em conflito e a única coisa que eu quero saber é onde está Nuno Leal Maia? @CyntiaMarangon 🙌 @_FNARDINI @Danilo0014 Nunca E o @PyongLeeTV que tá parecendo o Jackie Chan interpretando um pastor evangélico? https://t.co/Nnnaln2X9Z Produção! 1h03 na fila pra jogar Fortnite???? É isso mesmo???? Pelamordedeus... o que eu tô fazendo comemorando um gol no campeonato árabe??? https://t.co/4UIFO1LK54 Lula ou Bolsonaro? Corinthians ou Palmeiras? Cirinho pescotapa ou playboyzinho choradeira? Silvio Santos ou noção? Grandes duelos nesse 2018. Porra Akinator! Sifudê! https://t.co/rq1YXRJTNZ @zenasciment0 @alineee_m @marceloalmeid_a Concordo RT @hermeserenato: Polly Guaraná é show https://t.co/2Y6vAc63go @pecesiqueira Puta mundo injusto. @LucasSbarze @lucasaguiarlira Todo café é ruim pode também ser uma opinião. É o exemplo perfeito de que uma afirmação pode ser vista como mentira e como opinião. O Facebook precisa combater as Fake News, mas jogar pra rede a responsa de diferenciar mentira de verdade é perigoso. E mais: qual a diferença entre mentira e opinião? Piada ou texto de ficção vão ter que passar pela aprovação do esquadrão da verdadinha? Difícil. Tenho sempre a petulância de achar que posso chegar mais rápido do que o Waze indica. Consegui UMA vez. Waze 632x1 eu. RT @rafinhabastos: A partir de hoje, aulas de DEFESA PESSOAL na Internet. Lição n°1: Tapa. Íntegra em https://t.co/WLJ1cGfUaf https://t.co/… A partir de hoje, aulas de DEFESA PESSOAL na Internet. Lição n°1: Tapa. Íntegra em https://t.co/WLJ1cGfUaf https://t.co/YYvw9R680L Não existe momento de conexão maior entre duas pessoas do que quando elas descobrem que estão assistindo a uma série que NINGUÉM MAIS TÁ VENDO. @italosooso Valeu bro! Espero que tudo tenha dado certo Após 41 anos de avisos, alarde e muito terrorismo… finalmente tropecei no cadarço. @frulanis Espero q vc tenha curtido! 😉 Corrige o português do amiguinho nas redes sociais, mas fala “menas” na vida real. https://t.co/5CgKnE1ldL @euleticiabri92 Compraaaa SENTE A BATIDA! https://t.co/smHhX8yBaI Imagens fortes. Menor B.B resgatado de cativeiro inusitado. Revoltante. #ChamadoCentral https://t.co/PZd36hMfLt Um dos momentos que não foram e nunca vão ao ar no Ultimate Beastmaster. Temporada 3, com brasileiros na disputa, chegando! https://t.co/BjFE0YehMv Sorria. https://t.co/4QDP1PtvJ1 Gostei de um vídeo @YouTube https://t.co/klW4ontWFn de Dança - Dançarinos Drogados - FULL HD! @luciofsousa Ta seeerrto. Eu sei que eu poderia estar falando sobre algo mais útil pra humanidade, mas internauta trouxa que desencoraja gente legal é um lance irrita pacas. A @Anitta fez um clipe ao vivo. O fã que reclamou merece choque no esfíncter! A mina faz um negócio diferente e o babaca enche o saco pq não ficou “sensacional... do jeito que eu sonhei”. Vai pro inferno! Ela que continue pirando e criando uns bagulho louco. Netflix muito zuôna. https://t.co/06MrL1YrLb Karaokê... melhor rolê. @lucianopotter @G_Mor @MarceloBerghahn Cara... na boa... achei sem propósito sair me ofendendo assim gratuitamente. Não te fiz nada. Qualquer coisa, pode falar diretamente comigo... e me citar. Próximo casal de recém-casados que entrar no salão de festas ao som de Coldplay leva tiro de chumbinho. @KrystianeSPM Pq ninguem vê... nem quem ñ tem Netflix. Os caras cancelando assinatura da Netflix por causa do posicionamento da série O Mecanismo. Agora tão tudo em casa tendo que conversar ou assistindo a Rede TV e querendo cortar os pulsos. @jkcduarte Pra sua informação, meu tweet acaba de ganhar o Nobel da Paz. 🏆 Quando eu saio de madrugada pra comprar presunto, sinto a necessidade de estar bem vestido... pq classe e estilo pra mim são essenciais. https://t.co/AlPTFvuky0 O Instagram vira um ambiente um pouco mais acolhedor no final de semana, quando as pessoas mais gostosas do mundo resolvem dar uma pausa na academia. A banda pregou o fim da violência no palco do festival. Ao ouvir o recado, o crime organizado cancelou os trabalhos e desarticulou as facções. Boa! @mii_vargas 🙌 @fiiiiiamma @cauemoura Gosto de conforto. Apenas isso. My Netflix Special. Fucking cool, bitches!!! Breve no catálogo ao lado da Galinha Pintadinha e de um incrível documentário sobre a vida do Cauby Peixoto. @NetflixBrasil @netflix https://t.co/NeZwwpY5Ri @Bradesco @YgorFremo Fala pra molecada botar o mic na boca de quem ta falando. @HenriqueTancini 🙌🙌🙌🙌 @joluho1 Valeuuuu @BahBello 🙌🙌🙌 @Lima_Lucas @Tonkiel Respeita que sou o membro 12 do fã-clube. Mirandópolis... vai deixar saudade. Parceiraço. https://t.co/5Oh3b0OvMt @prifrancco 🙌 Tô com os parcêro no #ProgramaDoPorchat. https://t.co/RqTHF3Dais @Daniel_Felic @flipexsx 🙌 Eu já não gostava muito de sair de casa. Daí os caras inventam um negócio chamado Netflix... e a vida em sociedade perde completamente o sentido. @pathy @marigraciolli Alô @crimeorganizado, fica aí a dica. Uma boa noite para aquela visita. @andrefran E tudo sendo decidido na segurança e conforto dos bastidores? Nada disso. 2018... o povo tem que assistir mêmo. @mariana_godoy @marcioapviana Notícia do R7. I rest my case, your honor. Vídeo novo no Ilha: https://t.co/AQrWDCIHW2 https://t.co/yQBaHO5AE6 @LaryNery É aonde eu pego o texto sendo narrado pela voz do Google. 😉 Manual para a felicidade eterna. https://t.co/bFaDdaizYX @vavofresno @Bulgarelli1971 Portland tem um caminhão de 4 medíocres: Leonard, Aminu, Davis e Collins. Os 4 somados ñ dá 1. Tentando ajudar, Serginho amassou a cara do defunto. Triste isso. Com @DanielSFurlan e @caitomainier. https://t.co/pWsP9emuMU @jeneuston @danielletbd @Variety 👏👏👏👏👏👏 Momentos felizes criam tristezas eternas. https://t.co/bQ3AUv2x6Y https://t.co/uQTlD2Tm3U Sobre o meu primeiro amor: https://t.co/bQ3AUv2x6Y https://t.co/37dEqVByp6 @alsimoes Relaxa... nem me estresso Não entendo a galera q repete: “pra alguma coisa mudar, o Brasil tinha que ir pras ruas e meter pressão no poder”. Daí uma pessoa é assassinada, as pessoas se mobilizam e o cara fala: “ah, morre gente na favela toda hora e ñ vejo esse estardalhaço todo aí”. O que vc quer, champz? @marceloindaniel Uma vez me mandou embora do táxi dele pq estava em fim de expediente e a Santa Ifigênia ficava contramão. @CVStaufenberg @GraOficial Eu tb acho. Muito Terrível acidente no parque diversões. Imagens fortes. https://t.co/VIgIJNEzJ9 @Lih_Fly @Iuizatavares 😉 A mobília aqui de casa tá esquisita. https://t.co/iNrHwlztIT Hoje o CQC completou 10 aninhos de seu lançamento no Brasil. Aqui relembro um dos meus grandes momentos no programa. ❤️❤️❤️ https://t.co/qMfGEgXwLv @iberethenorio @pierocassol Minha orelha é top. Foi eleita a melhor orelha da america Latina em 2012. @mucamuricoca Assim q vc pretende ser um influenciador da juventude? Triste isso. @ReyBiannchi @cariocadelegado Belo texto, Rey! 👏👏👏 @mucamuricoca E sao 2h. Acho triste que ela passe a noite em claro sofrendo por causa dessa pai que ela nao quer. @mucamuricoca Acho triste que ela nao queira o pai que tem. Só me chateou essa msg dela. @murilocardoso Cara estranho @ericfaria74 @andrefran @MarceloAdnet Uma vez passou a mão na minha bunda. Não tirei. @Anitta @boninho Alô Boninho. Porque esse ódio? https://t.co/0CpCTcQzTX @lucasfresno @pecesiqueira @cauemoura Tá mêmo. @mmarianaff Hahahhehahheheh!!! FINALMENTE! Saiu o primeiro episódio do Ilha de Barbados com convidado. Pra abrir essa playlist nova no canal: @lucasfresno. Curte aí! https://t.co/oEV3WhkLPh https://t.co/wLfW8Lh9Oi Eu paguei a janta num restaurante em São Paulo que é o mesmo valor. https://t.co/dCp0ppmEDX RT @braian: nessa foto vemos que a bariatrica funcionou melhor no @azaghal que no @jovemnerd https://t.co/jvdhVNknPH @naosalvo Me traz um iphone Quando vc quer pagar de sentimental e bacanão na Internet e leva uma voadora no peito pra deixar de ser trouxa. https://t.co/D7GrOBamlr Melhor que sexo com amor. https://t.co/OyzZ8r6P6c @mahcfurtado @ste_mendes Poxa Pastor, não tenho como estar oferecendo um aluguel no momento, mas se esse tal de “senhor” aceitar uns boletos, envio agora mesmo. https://t.co/EnFztcgvbP Acordei desnecessariamente feliz. Entrei no Facebook. Voltei ao normal. @celenaferreira2 🙌 Quando vc quiser socar a cara ou matar alguém com requintes de crueldade... lembre-se disso. Vídeo novo no Ilha de Barbados: https://t.co/9sbFgZbYBb https://t.co/vpngK8G7Hy @leticiapearljam Pbeeeeenssss!!! @ste_mendes 🙌 Minha mãe diz que nunca fiz nada sério... nunca. Abri um perfil no Linkedin. E aí? Quem é o zoeirão agora? Nasce mais um partido político? Celebridade veste camiseta em apoio a uma causa? Intriga na casa do BBB? https://t.co/8jfTJAkD3X O dia que meu filho apresentou meu show (também conhecido como o dia que entendi que meu filho fala devagar quando tá nervoso). https://t.co/6KNjKEOsCW @walves_br_sg Esse pullover ta apertadinho nessa barriguinha de cocô, campeão. Sexy bagarai. https://t.co/wzbpo6J81p @CarlaDauden @NALIP_org 👏👏👏👏👏👏 @Lallicah @nicolauvrau 😧 A seção QUEM SEGUIR que o twitter joga na timeline devia mudar para PESSOAS QUE VC ODEIA. É só os maldito ali. Quando a vida te puxa o tapete, sorria. https://t.co/gmbhWOFMeU @bczzfps Obrigado Otávio! Espero que tenha sido um aniversário legal! @MauroNakada Maureza... obrigado pela visita bro! Prazerzaço te receber, meu velho. Volte sempre. Só gritar. Jovem: Um dia vc vai se dar conta do quão patético é carregar estas bandeirinhas q vc carrega hj. Você vai olhar pra trás e sentir vergonha. Abraço. @Superbruna @lucianopotter Graças a deus @sergioriibeiro Total. Sou muito lacrante Os cara tudo lacrando no dia das mulheres. Falando bonito na Internet e na vida pessoal tratando que nem gado. Tô ligado nessa hipocrisia aí. Poesia... por Fátima Bernardes (via @femedeirostt). https://t.co/hn3XKbTJ4W @lucianopotter Uma pena saber que no fim da gravação o sinal abriu e essa moça foi atropelada. Triste isso. @Tonkiel Ja nao ficou caraio @katenash 🙌 @cauemoura Mano... o q é isso!? Eu tentando pegar as oportunidades que a vida me oferece. https://t.co/KG3yN12eEW Cinema pra mim é ‘O Exterminador do Futuro’. O resto é novelinha. Interessante a moça do Instagram q fala: “Ñ importa se vc tem um corpo perfeito... o q importa é vc estar feliz com vc mesma”. Aí vc olha as foto da pessôa e ela passa 19h por dia na academia, tem nutri, dermato e apoio de 27 marcas de suplemento. Aí é fácil, querida. @mairamedeiros Pegando fogo @Jefinho_Farao mano... o que vc fez foi épico. Absolutamente sensacional. Quinta: No sábado... baladinha!\nSexta: Amanhã balada monstra!\nSábado: https://t.co/TOEZZebsfs @mariana_godoy @andrefran Mano... graçasadeusos!!! “Confia no repertório”, disse o funkeiro mito pro produtor antes de entrar ao vivo na Record. https://t.co/954D2GSwyg O Brasil precisava mesmo de crítica política com embasamento e credibilidade. Agora vai! 👏👏👏 https://t.co/bCevjg0F6p @MariMoon Kelly Key. Nos tts tem #QueroBrasilSemGlobo. Vou levantar uma tag que pode resolver o problema de maneira simples: #QueroControleRemoto. Quando eu decido lutar contra tudo e ir em busca dos meus sonhos. https://t.co/KdVhKgY007 EXCLUSIVO: Polícia camufla drone de nuvenzinha e corporação retoma o comando do Morro do Jotalhão. Operação bem-sucedida! https://t.co/81P9oNV72M O povo tá com o Alckmin! https://t.co/2tvGQMMxpQ @lucasinutilismo Não tinha pensado nisso. Obrigado pela observação. Importante ponto levantado. Ñ entendo pq vcs magros simplesmente não comem pizza o dia inteiro... a vida toda. Ñ entendo. Hahhehahe! Q fiadaputagi! https://t.co/U1AeyBi1a8 @juzao I should have known better. Jim Diamond. Ô... não quero ser o chatão, mas essa babaquice de compartilhar foto de mulher nua sem autorização dela tem que acabar. Internet já existe há mais de 20 anos pra vc saber o q é certo e deixar de ser trouxa. Gravâmo boas conversa hoje pro Ilha. https://t.co/Vdq509e3D8 @qqtaacontecenoo @vini_skrrr @cauemoura @pecesiqueira Manos... o Cauê é um cara daora. Acabou de pagar um refri. Repensem aí. @rodrigocosma @braian Uhahehwheh @naosalvo Caralho... acabei de ver que vc tinha achado. 😒 @naosalvo Corra que a polícia vem aí. Quando o Frank Drebbin vai transar com a mulher (Priscilla Presley). Acho que é a sequencia da cena paródia de Ghost em que eles estão fazendo vaso na argila. @naosalvo @MauroNakada 😂😂😂 Parabéns pelo lindo casamento, meu amigo @whindersson. Que vocês sejam felizes para SEMPRE (tb conhecido como um período de 3 a 5 anos). Tá se achando incrível aí, né campeão? https://t.co/5wlFKh3gFh https://t.co/H67rVR16eY @NetflixBrasil O monstro tá saindo da jaula @alynealc1 Agree. @tiagosplitter @NeneHilario42 @NBA Honduras @chorinhobastos @YouTube Nunca @sxmoel Q video é esse? SIM!!! Vai ter Ultimate @Beastmaster temporada 3. E TEM BRASIL NO PÁREO! Eu já treinando tipo monstro. Vâmo!!! @NetflixBrasil @netflix @broome88 https://t.co/TQbX7vhSMn @RitaLisauskas 😂😂😂 @RitaLisauskas https://t.co/fGeZwag0jf @karinyukilopes @TheLaughFactory ❤️ O melhor vine de todos. https://t.co/x1Fgj2pEQq Confesso q tô meio emocionado lendo os comentários no vídeo do meu stand-up lá nos EUA. É animal ter uma galera torcendo por vc. Alguma coisa devo ter feito certo nessa minha bizarra e controversa carreirinha. https://t.co/xm5gXle1Ci @Lima_Lucas @TheLaughFactory Valeu brooo!!! Heyyy! O @TheLaughFactory postou uma parte do meu show em inglês no youtube. Assiste aí... dá um like, comenta que ajuda pacaraio! https://t.co/xm5gXle1Ci https://t.co/bbRWMCL9hz Toma essa, @realwbonner! Aqui sou eu quem dito as regras. https://t.co/57LZHJK7Su Grande momento! https://t.co/0jp1RLwMTE @maia_tabita 😂😂😂😂 Tu aí na academia se esforçando pra ser bonito e as mulé tudo com uns feio legal. Dura vida pra vc, hein fortão?! @alineee_m Manda um print aí!!! Galerinha foge como pode. https://t.co/BAAhRwe9Ra Mãe, tô na Globo! https://t.co/4OcjtYUorN @Tatifonn 🙌 Eu, imbecilmente, troco o verbo SECAR por ENXAGUAR e mesmo assim o tweet tem 2000 likes e 500 rts. Minha burrice vai ficar registrada pra sempre. https://t.co/qAmwOerzfB Graaande invenção esse vento quente que seca a mão no banheiro do shopping. Se eu posso enxaguar a mão com um papel em 7 seg, pq não levar 6 minutos de vento na fuça com barulho ensurdecedor? @mbeckk 😉 @felipesolari Mano, na Rocinha tem uma mulher em cada esquina. Na verdade nem chegou na esquina ja achou umas 12 melhores. Tô sentado na penúltima fileira da arena no #AllStarGame2018 (na puuuta que pariu) fazendo uma excelente cobertura do jogo nos meus stories do instagram. https://t.co/75YU4exojI @R_Mart01 @dona_najuu Danilo nunca matou ninguém. @dona_najuu 😉 Ontem fiz um show muito foda no @BarLubitsch. Foi demais! Obrigado @geoffreyplitt e @peetguercio! Keep up the good work! U rock! I’ll be back! https://t.co/x1aKGH0kG7 @vavofresno É sensacional mesmo Quero um país forte, um país com estrutura, um país seguro. Quero um país como o sutiã da Jojô Todynho. https://t.co/YyjIZMLcZG @victorludgero Poutzzz foda. Eu e meu filho queríamos muito Eu abro a page do @TheLaughFactory ontem e a minha foto tá em destaque na home. Que coisa linda. Foram 2 shows incríveis ali essa semana. Obg a todos vcs que torceram. https://t.co/JyFHvBge6l @braian Valeu! @lucianopotter Essa musiquinha de Benny Hill no fundo transforma todo argumento em esquete cômica. Caraio. O tweet mais triste que já li. https://t.co/HYSvsnco0u Pra odiar meus amigos, brigar com a minha família e ver propagandas de produtos q ñ me interessam? Nananinanão. Tô de boas. https://t.co/dS1sQ3WePx Hoje em LA abro o show do @TimAllenRants as 19h45 no @TheLaughFactory, depois faço o @HollywoodImprov e fecho a noite com @toneBell @NateCraigLive e @Mattyfontana13 no @FreeParkingCom. Seu like ou RT nesse tweet ajuda nóis. Valeu!!! https://t.co/0hFh1ZOTgj Fica a dica aí, pessoal. https://t.co/iAJ1bmvj5o @LimaRB26 Hahahhahahhe Eu acho uma sacanagem o desfile das campeãs. A escola vence e tem que fazer tudo de novo? Sorte q isso não se aplica a outras áreas: - Senhor escalador, parabéns pela conquista do Everest. Agora volta lá pro pé da montanha e sobe de novo. Dessa vez feliz e abraçando os amigos. O q é mais chato: O cara que julga o seia da Marquezine? Aquele que critica o q julga? Ou o cara (eu) que se acha descoladão por sacanear a discussão, mas involuntariamente está alimentando ela? RT @HollywoodImprov: .@ComedyJuice is in the house TNGHT w/ @NikkiGlaser @Reddsaidit @thejademovie @rafinhabastos &amp; @KateQFunny! Don't miss… @CamilaCallimanP @carlacalimman 😂😂😂 👍 https://t.co/vvL3Ughkow @BarbaraCurlee 😬 @marigraciolli 😂😂😂 Mais um show meu amanhã. 😬 https://t.co/rICEazKglf @Pelaipedadepre Entao errei. Apaguei @Thzn Entao errei. Ela: Vâmo no bloco.\nEu: Ok.\n5 min depois... https://t.co/TOEZZdTQQS Dois shows fodas em LA amanhã. Que noite amigos! Ansioso pacaraio coessa bagaça. Seu like ou retweet aqui neste tweet é very wellcome. https://t.co/eNk29776U3 Vídeo novo na Ilha de Barbados. Assiste aí que tá daora: https://t.co/iwv8U2kzVd https://t.co/IinDDcYEaA @CamilaCallimanP Mas Deletei. Nem vem. @Leandro_Renault 😂😂😂😂 @flaviasiufi Não tem porque. Não precisa me avisar que o meu cadarço está desamarrado. Fica tranquilo, não existe nenhuma ocorrência na história do mundo moderno de uma pessoa que tenha tropeçado no próprio cadarço. Nenhuma. @AdsonKoenig Cara... vc nao assistiu a versao americana??? Tem uma versão brazuca. É outro ícone no menu da Netflix. Terça-feira vai ser um dia foda demais pra mim. Vou contar tudo no meus stories. Tô nervosaço com essa porra. https://t.co/IzjpknWpIO “Atrás do trio elétrico, só não vai quem já morreu”. Bastos, Rafinha (5/12/1976 - 10/2/2018). https://t.co/GRt6IN29t8 Pessoas simpáticas antes da 9h da manhã. Até quando, Brasil? Até quando? Carnaval... eu tentei te amar. Juro que tentei. Íntegra: https://t.co/i3RlJ0PQAt https://t.co/dD9kIsYoeK “Não aceitamos cartão”. E um coqueiro no seu ânus, vc aceita?! Desgraça. @bicmuller Porto alegre tb @silva_marina Como se isso fosse garantir que eles trabalhassem para o interesse coletivo. Basta querer manter o partido do poder que o hábito se mantém. Sim. Esse sou eu. 👍 https://t.co/kql0WqLP8U E assim foi a Ilha de Barbados na @CampusPartyBRA. Foda! Esse ano vamos em outros picos aí. Fica ligado! https://t.co/vKMI7CEnkJ @jovanipadua Jogaço do Embiid. Assisti. Um grande momento. https://t.co/Vg7emCck8B @NBABrasil @utahjazz @PelicansNBA Pq vcs editaram o vídeo com o áudio de um locutor narrando golfe? 2018 tá estranho. O vídeo novo da Ilha de Barbados é prova disso: https://t.co/XWPYxxCid8 https://t.co/Uy1HUsYssG @fred_b12 @neymarjr Assistência? Ele me deu um navio. Chupa essa, Fred! 4h: Tom Brady acabou de me ligar. Disse que tá de conchinha com a Gisele Bünchen assistindo Netflix numa TV de 240 polegadas. Tá de boas. Pedi pra galera me ajudar curtindo um tweet e disse que responderia a todos. Foram mais de 1000 likes. Acabei de desmarcar minha viagem de carnaval. @ihpires Hahae! Daora Valeu! Vcs são foda! RT @TheLaughFactory: #comedy #snl alum @kevin_nealon  returns with a killer lineup including @thejademovie  @theskylerstone  @Thomasdale5… Um favorzinho aí: Dá aí uma curtida no retweet que eu vou dar agora pra fazer um barulhinho e ajudar o amigo Rafinha aqui. Vou agradecer com tweets cada um que curtir. White men can dab. https://t.co/eNWF5OCvFC Seja o que Deus quiser. Eu, @thejademovie e @kevin_nealon no @TheLaughFactory no dia 13, 19:45. Se você morar em Los Angeles ou estiver passando por lá, venha ver eu passar vergonha fazendo comédia em english (ou não... ainda não sei... saberemos). https://t.co/UGomJI7Xl2 Então... até que enfim vou fazer algo que sempre quis: Stand-up em inglês... em clube de comédia de Los Angeles (nos maiores). Tô ansioso, nervoso, achando que vou me fuder (provavelmente vou). A propaganda de um dos shows vou tuitar agora (se puder, dá um RT aí). Bum Bum Tam Tam melhor que Caetano. Bom dia. https://t.co/DcgsxhLpj3 Talvez o @cauemoura esteja certo. Episódio novo na Ilha de Barbados. https://t.co/Q40D4Lcqnr https://t.co/nBzaOn8TcR @canalCombate @JacareMMA Candelabro. @CdNLeon Saudade das “video-respostas”. Achava daora. @Isamoora_ Agora Nuossa!!! Boa @JacareMMA!!! https://t.co/HpPxW2dNUf Ah legal! A privada entope com um charuto agressivo do sujeito... daí eu entro pra dar aquela mijadinha inocente e saio culpado pelo apocalipse. Puta mundo injusto. O Brasil realmente não é pra iniciantes. https://t.co/ZqaUnSwgxB Felizmente o Brasil tem o BBB pra trazer debates relevantes pro nosso cotidiano. https://t.co/P4n80cJwDC @HuffPost I cant read your links. https://t.co/kclEQiqJTM Momento “mulher linda tocando @Anitta na sanfona”. 👏👏👏 https://t.co/RsSXiwHi77 @jeniflrs 🙋🏻‍♂️ @dancelttlturner 🙌 Manja muito dos memes. https://t.co/jdeNmgSSDp Obrigado Campinas! Mais um dia de casa cheia. 🙌🙌🙌 https://t.co/jpfapgYYwA Nenhuma mova tecnologia conseguiu reproduzir aquela emoçãozinha ao ouvir a mensagem do ICQ chegando. É importante a equiparação salarial entre homens e mulheres, mas quando você é o Mark Wahlberg e a moça é a 3ª coadjuvante de Dawson’s Creek, fica difícil defender. #tbt https://t.co/xFoSgaNFqn @joemamartins Calmaaaa... respiiiira. 😂😂😂 @caitomainier Mano... não se explica CARALHO. Forte abraço. @bicmuller Muitos “influenciadores” nascem do bullying... do humor acidental que o alvo, a personalidade, nem nota. São retardados que herdam um pequeno poder que atrai enganadores. Foi o que aconteceu. A única culpa da menina foi ter comido cocô na infância. Ela é legal.... só é lesa. Faço fácil. https://t.co/7RqzW4HRXb @Uma_Nina_Ai 😉 Ultimate Beastmaterzinho. @NetflixBrasil @netflix @Beastmaster https://t.co/dYCSLk6OvH @FeCastanhari Bem louco A internet precisa de mais mensagens encorajadoras como essa. https://t.co/8NIvGJAKuh @ilauraromano @Beastmaster 🙌 Este ano entra na @netflix a 3a temporada de Ultimate Beastmaster. E eu fui o único apresentador que teve coragem de enfrentar o circuito. @NetflixBrasil @Beastmaster @BabiOliveiraa_ 🙌 @Tatawerneck Deveria ter pego um Uber. Amiga minha entrou num chorando por causa do namorado. O motorista já virou pra ela e disse: Esse The Voice Kids é pura emoção, né?! #UberMelhorQueTaxi A vaidade em tempo de rede social chegou a um ponto em que postar foto sem maquiagem é um grito de liberdade. Vâmo revê isso aí, humanidade. @fe_morel ??? @oMariosouza UahahshhwhhHahha O jogo mais fudido da NBA do ano e a emocao dos caras do sportv como é que ta?!?!?! Tá tipo Gama X Hercílio Luz na Copa SP de juniores. Bacana. #biravelho Xinguei mesmo. Falei tudo que já queria dizer há meses. Não me arrependo. Tô aliviado. Foda-se o que vai pensar. /// 2 minutos depois... https://t.co/EadjFt9DAz @miladasfotox 😂😂😂😂 @Nandibarreto Nunca fiz Nunca dei moral pra esse Friends. Friends de verdade não ficam pegando a mulher dos parcêro. #NotaZero https://t.co/8pp8i0yeN5 Na imagem, Kevin Durant tenta enterrar e a bola escapa. Após o quarto replay...\nRob Porto: O que aconteceu, Bira?\nBira: A bola escapou.\nBirinha, mostrando que respeita o espectador com deficiência visual. #BiraVelho #NBA @sportv “Não existe bola de 22 pontos”. Birinha mostrando profundo conhecimento da regra do basquetebol. #BiraVelho #NBA @sportv Pra quem assiste a NBA no @sportv... tá lançada a tag #BiraVelho. Rob Porto: Como seria o Jordan na NBA hoje, Bira Belo?\nBira: Ia jogar. Sem dúvida alguma.\nBela análise, campeão. Parabéns!\n#AmeninadaDaBase #LanceLivreGanhaJogo @Alice123Hot 😉 @CarolPinelli_ 😉 @chorinhobastos @prorodrigues Aeeee!!! 😉🙌 @elisamarquesp 😉 @O_Demiurgo33 👑 @tessutti_r 🙌 @philvsf Uahhwhahshhehahha! E ainda me perguntam: “Tanta gente te enche o saco... como vc aguenta?”, então... esse tipo de msg responde a questão. Foda. https://t.co/Cnf5qeVYRb E ainda me perguntam: “Tanta gente te enche o saco... como vc aguenta?”, então... esse tipo de msg responde a questão. https://t.co/oun2Whtqlw Uma hora a idade chega, guerreiro. https://t.co/9r2GVyjv4c @Sa_ameliaF @jjaomoreira Até eu deu block Estava na rua com muita vontade de mijar. Entrei no primeiro restaurante que vi. Tirei o pau pra fora e entrei na cozinha. A vida é linda. #pas @Taalitabrgs 😂😂😂😂😂 Não sei o q vcs fizeram, mas aparentemente sou tendência hoje no Xvideos. https://t.co/dxSILfyLaw @eitatiih 🙌 @Bob_Fernandes 😂😂😂😂 Não lembro em que contexto isso foi dito, mas desde já me arrependo. Vídeo novo da Ilha de Barbados... assiste ae! https://t.co/T5b2Ri4wvZ https://t.co/Kadj0lGMCF @Dani_CGouveia @pecesiqueira @cauemoura 🙌 @Rockbrabo @SporTV @ivanzm O melhor locutor do br Galera compartilhava trecho de filme pornô... então passou a mandar vídeo vazado de gente comum. Agora a onda é divulgar, junto com a cena, o face da menina, fotos com a família e até informações sobre o emprego dela. Na boa, não faz isso. Mesmo. E manda quem fizer, tomar no cu. Olá Bira Belo, comentarista de NBA do @sportv. Foda-se a “meninada da base” e o que eles tem que prestar atenção. Para de comentar basquete como um professor de ed.física de 75 anos. Obrigado. @LuizThunderbird Grande Thunder! Vc precisa de um programa de madrugada sobre o submundo do sexo bizarro. @Padig Teu blog tá bombadão. A matéria da minha série com a Paloma eu continuo recebendo da galera. 🙌 Curiosidade: Se vc pesquisar “RAFINHA BASTOS” no Xvideos, tem um vídeo de sexo em que eu realmente apareço. Entrei no xvideos e tinha um cara muito parecido comigo numa thumb. Muito. Cliquei. Não era eu. Respirei aliviado. O moço estava levando a pior no vídeo. Sofria muito. @Tonkiel Conheci ele em LA. Pareceu ser um cara legal. Trocamos 3 frases, nenhuma delas ofendeu ambas as partes. Tem Eu, Ela e 1 Milhão de Seguidores no NOW. É uma série muito legal. Satisfação garantida ou seu dinheiro de volta. https://t.co/wTzIxzi2pT https://t.co/tHxf8dMhgV @NBA No. I play because is a good aerobic exercise. Thanks. @Gabriela_Mestre Ah tá... tenho assessores que fazem plantão aos sábados. https://t.co/UeTAZN3IXW A vida já era um negócio muito legal... aí o ser humano vai lá e cria o ar condicionado pra deixar ela ainda mais top. Que maravilha! @PereiraRbT 🙌 @anna_bitt Pô tia! Olhei o seu Twitter e vi q você só xinga as pessoas e ainda espera o amor de um argentino que está cagando pra você. As coisas não estão indo muito bem hein!? @rodrigueesjimmy @ahgabss @pecesiqueira @cauemoura 🙌 @P4uLiNh0W gênio @dudumm Que alegria @ToscanoLinguica Obrigado. Sou profundão. Na vida: Cara, não concordo. /// Na Internet: Que trouxa! Porque você não morre, seu verme?! Sua mãe amamenta mendigo, seu jumento com sífilis! @trouxapela_Lana Nao achei @softgotica @iFood Nem fodeno @TatiSbarVero @iFood Impossivel @GiVallin @iFood Isso não existe. Já pesquisei. Bati o olho na imagem e lembrei de momentos desesperadores da minha vida. Bateu a tristeza. https://t.co/Lrv7Y1CFsu @nando_reis @pefabiodemelo 24 anos depois, surgiu o google maps e ele conseguiu localizá-la. Infelizmente ela estava casada e não tinha tempo para aventuras, afinal, trabalhava em 3 lugares diferentes para sustentar os 6 filhos. O marido alcoólatra nunca trouxe um real pra dentro de casa. Triste isso. Íntegra: https://t.co/OWuttpsViw https://t.co/VU7jY35GwD @andrefran Dentro A natureza agradece. Boa, tiozão! https://t.co/xmLqa088kG @cassiokadu @goulartlaura Concordo com o Cassio. @meviobr Crime? @oficialkellykey Q outra opção vc dá pa nóis? https://t.co/sCld1j3E6B @RitaLisauskas Uahahhahshehe @bia_zachello 🙌 @thamirisnyame 😂😂😂 talvez @lennonvictor633 🙌 @leleoamancio @piangers Meu pau atochado bem no meio do seu cu. #pas Que vídeo foda esse de hoje da Ilha de Barbados. https://t.co/hv3oJYPFGD Durante meses me chamaram pra ir no programa do Sílvio Santos. Ligavam quase todo dia. Não aceitei. Fiquei com medo. Medo de me achar íntimo e responder uma pergunta com: “ahhh... vai se fudê, velho!” ou algo do gênero. Juro. @CHLSo0 @litza_matheus Exatamente isso que o pequeno gafanhoto falou. @noorasaetrrr 🙌 @lucasvon @piangers #PAS @goulartlaura @YouTube Exato. Vc nao entende que a sua percepcao de babaquice é subjetiva. Se for eliminar a babaquice do youtube baseado no que os usuarios acham babaca, nao tem mais conteúdo. E agora só tô adicionando mais esse tweet só pq achei demais essa ferramenta de adicionar tweets. @marcurelio Passo. @YouTube O Youtube é uma ferramenta. Meia dúzia de regrinhas e o resto é bom senso do produtor. Se ele não tem bom senso, para se seguir. Impede que o seu filho siga. Pelo amor! Esse mimimi só espanta patrocinador e ajuda a afundar um lugar incrível que faz a alegria de muita gente. Quer dizer que a liberdade que o @Youtube oferecia era fascinante... um mar de criatividade no mundo careta da mídia tradicional. Aí um moleque abobado faz a cagada de filmar um cadáver e agora o “youtube precisa cuidar do conteúdo e evitar que os produtores mimi mimimi mimi”??? Maconha liberada na California. Finalmente, após anos de luta, milhares de americanos poderão realizar o sonho de fumar maconha. Bonito. @CarinaFragozo @piangers 😢 “A morte não é uma tragédia... tragédia é não ter vivido”. O q aconteceu contigo, @piangers? Cadê aquele garoto maroto, cheio de ironia e boas piadas? Tô com saudade. Agora só te vejo falando umas abobrinhas de paternidade com pianinho de Domingo Legal no fundo. Volta! Te amo. @WelderMM Desculpe a demora, estava dançando. SIM. #amigodadança @cauemoura @LoganPaul Drink in your ass, u shit. Traduzindo aí pro jovem cuzão americano. @RickSouza Multishow é mestre nisso. A tag da minha serie era #tarindodoqueep01. No proximo programa era #tarindodoque02. Já tive também o #chamadocentralep01 e o melhor de todos #euelaeummilhaoseguidoresep01 @sensualgifs And he had sex with her mother 2 days after that. True story. E 2018 já começa com grandes vídeos. O primeiro da Ilha de Barbados do ano. E tá bem foda. https://t.co/3OordR5nDx https://t.co/JUxSLBDwRU Alô você! https://t.co/kcD8faXPhm @WiillDuarte Olá! Vc pode me assistir no Netflix em Ultimate Beastmaster temp 1 e 2 ou em Eu, Ela e 1 milhão de Seguidores... todo dia no multishow. Abs Quando penso que meu 2017 foi ruim, lembro do Willian Waack... e sorrio. Na vida o coração aqueceu e os cara tão se abraçando... chorando a virada... aqui no twitter tão tudo reclamando dos parente pra parecer descolado. Tô de olho nessa zueira aí. Em 2018 prometo não mijar mais contra o vento. Obrigado. De nada. https://t.co/pLMsSG9TGV @CrlBru_ Missao cumprida. Aos amigos que disseram que a Holly ganhou ALGUM round, fica aqui meu forte abraço. https://t.co/EhScBHZTlX @EvilGregJackson By punching her in the face. A lot. E 2 juízes ainda viram só 48-47. WTF?!?! Cyborg dominou todos os rounds. And still!!! #UFC219 https://t.co/PdtbXdhQPc Grande @EdsonBarbozaJR! Guerreiro demais. Lutaça! #ufc219 https://t.co/AFnYVvGxVH Obg a todos q colocaram a Ilha de Barbados nas melhores coisas das interwebs de 2017. Ano q vem tâmo aí cagando regra de novo. @pecesiqueira @cauemoura Os maloqueiros também amam. #QuebradaFofa https://t.co/GPDwHBMGgF @ovicinius @RicardinoLet Uahhshhehe @Driuzao Uhahhwhahhehe! Muito boa E após 26 anos de pereginação pelo mundo, ele finalmente encontrou o sinal da TIM. https://t.co/fPthiT1Z7j @vitoroocha @SKLLXsoares @cauemoura @pecesiqueira Mm Pare suas férias! Chega! Algo precisa ser feito. #denúncia #polêmica #vergonha #BielGate #Justiça https://t.co/ubK3EP0qd2 @CaroLopesx3 @Ograziexplosiva @multishow @paduarteoficial @multishow se liga aeee @Saradocinzas HehehageadfFhrgshe @NBA Nice smile!!! @andrebrandt Sim. Fazem barulho. Tanto no choque quanto no movimento Dica de cinema pra este feriado: Star Wars (em português: Guerra Estrelar). Ação e aventura no espaço e também fora dele. Personagens interessantes e enredo envolvente. Nota 8,2. Natal é tempo de amor, de congregação e, é claro, tempo de ver um gordo miando. https://t.co/5lfzBtEh8r 🎁🎊🎉👏👏👏 https://t.co/QJarZ8XK7f @Hiago__Junior Valeuuuu @trumpeu @marceloguaxinim @NetflixBrasil Melior mezo @pedrosponja @Beastmaster @netflix @NetflixBrasil Aeeee @porratalitha @Kleyssantos @NetflixBrasil Toma essa!!!! Vamo pra 3a Natal... tempo de ter o nosso whatsapp entupido de mensagem de Natal de uns mano que a gente nem sabe mais daonde conhece. Uns vídeo de 30 mega com umas animação tosca do Noel voando numas rena que parece uns cachorro. @kethlyngm @SpiderAnderson 😂😂😂😂 @MaiconBlake @Beastmaster @NetflixBrasil @SpiderAnderson 🙌🙌🙌 @QueilaOliveiraa 😂😂😂 @marceloguaxinim @NetflixBrasil Ok @Nlsbrtt 🙌 @easyoko @NetflixBrasil @SpiderAnderson Na 3a temporada. Aguarde. @VrlXWayne Assiste q é massa Em 2018, só quero que acabe essa baixaria de perfil privado no Instagram. @gabrielrta @Beastmaster Voltamna terceira temporada @igorluix @Beastmaster 🙌🙌🙌🙌 @m4ninhodoido @Beastmaster @netflix @NetflixBrasil Tem que assistir a versao brasileira pô! Ultimate beastmaster brasil @brunoncarlos @Beastmaster @netflix @NetflixBrasil 👏👏👏👏👏 @Gabriavelino @Beastmaster 🙌🙌🙌 @dinizcavalcanti @Beastmaster Na proxima tamo @gordodebarba @Beastmaster @netflix @NetflixBrasil Valeu bro! @lemoregui Na proxima tem!!! Heyyy!!! O Ultimate Beastmaster temporada 2 tá no ar e tá muito louco. Liga aí e me diz o que achou! @beastmaster @netflix @NetflixBrasil https://t.co/yxnK2kRQQ1 @AnnaJuliaR12 @cauemoura @pecesiqueira 🙌🙌🙌🙌 Meu filho acha que aprendeu a falar “WTF?!?!”. Viu um gato no armário e soltou... https://t.co/FhR1nssWdO @navarrobrunom Jahahhehhhehhehe Planeta: Terra. Cidade: Tóquio. Como em todas as metrópoles deste planeta, Tóquio se acha hoje em desvantagem em sua luta contra o maior inimigo do homem: a poluição. Quem poderá intervir? Spectreman! https://t.co/2BchCNxUXT @teosmiranda @cauemoura @pecesiqueira Escuta, moça. @eu_ca @NetflixBrasil @terrycrews 🙌🙌🙌🙌 @GuyFranco HahahhhshHAhahhs!!! ‘Os Parças’ bateram 1 milhão de espectadores. Parabéns @whindersson, @tirullipa, @TomCavalcante1 e @brunodeluca. Foda demais!!! https://t.co/51mddszU8y @ManuZeglin @aczeglin Terceira temporada tem Brasil!!!!!!! @zgraca 🙌 Em 2018 só queria de volta o meu Orkut. @lucas_ignacio #Ultimatebeastmaster os china sao bom mesmo! @EnzoMarioBr @Beastmaster #Ultimatebeastmaster sao os 2 apresetadores mais legais @m_arcuss @Beastmaster #Ultimatebeastmaster faltou mesmo pô. Fueda @VeroneziJuni #Ultimatebeastmaster gracias carloa!! @soninharb9 @Beastmaster Bjo nela @jlucazzz @Beastmaster Hahahhhehe! 🙌🙌🙌🙌 @ifmaker Sou pura sorte @Lucio_Ferr @terrycrews Aeeeee @DaviRomeo Ferro pacaraio @andressabsl Obaaa @DaviRomeo Gracias @m_arcuss Será q ganha? @lucas_ignacio Mas ta divertido @DaviRomeo Uhhehehe! Mals aeee @marceela98 @SpiderAnderson Valeuuu @anabeatrizrr Eu fiz isso Vídeo novo na Ilha de Barbados ae!!! https://t.co/Qqu7PXv9UX https://t.co/sxHUOzFA98 @Kidids Muito foda! Vamos falar no comecinho@de janeiro @marcogomez_ Esse é monstro Filmaço! https://t.co/xs59mUtnNe @kruskredo @SpiderAnderson Mas tá daora pô @ja1ricardo @SpiderAnderson VaLeu bro!! @chasingfollese Maior lindo Esta singela imagem da luta do @RdosAnjosMMA de hoje me lembrou aquela cena do Rocky surrando a carcaça de uma vaca dentro do frigorífico. https://t.co/nMHLZIMaGY @maaaaands_ Eles sao muito fodas @AMarianaSantos Também. Pena que a minha mãe trocou a TV de canal e acabei gravando desenho. O motorista do Uber aqui disse q se o BNDEs cobrar a dívida da Globo, a emissora fecha. Vamos investigar aí Brasil pq a fonte é confiável. @Pirulla25 Cara, morreu? Que bosta! Vi muitas vezes na minha vida. Ele xingava a galera que não dava dinheiro. Vou ver a matéria. Me interessa muito a história desse cara. De verdade @rodrigobillioo @NetflixBrasil @Beastmaster @broome88 @netflix Aeeee Ultimate Beastmaster Brasil 2 acaba de entrar no ar! Tá muito foda. Assiste aí na @NetflixBrasil. @Beastmaster @broome88 @netflix https://t.co/gdnyupQZD8 @igorluix @SpiderAnderson 🙌🙌🙌🇧🇷🇧🇷🇧🇷 @rodornelles @SpiderAnderson 🙌🙌🙌🙌🇧🇷🇧🇷🇧🇷 @EnzoMarioBr Aeee @Felipe_power2 🙌 @C_Hernandez0 @valter_lima @NetflixBrasil @netflix @broome88 😂😂😂😂 @vausejacq Mó emocionante esse @anaceloarts Ela vai pirar @vausejacq @Duplex007 Eu te garanto que essa temporada ta mais legal! @coliseubr Valeu broooo @Duplex007 @NetflixBrasil Ta mesmo muito animal!!!! @ComentaTV1 @SpiderAnderson @NetflixBrasil 🙌🙌🙌 @debibal 🙌🙌🙌🙌🙌 Meu pai dirige muito devagar e freando bruscamente. Em 2h no carro vc percorreu 300 metros, tá vomitando e sem tendão na cervical. Heyyy!!! A segunda temporada do Ultimate Beastmaster Brasil tá no ar e tá muito divertida. Somos os atuais campeões. Quem vai levar o caneco agora? Assiste. Você vai curtir. @netflixbrasil @netflix @broome88 https://t.co/lXUddxX3Q2 @raulchequer Não depois de empurrar o guerreirinho. Vai afundar como o Kevin Spacey. @raulchequer É das 7h as 18h. Se cair o job com o Tony, me manda um email. De qualquer forma vou deixar a data reservada com o Walcyr da VanVídeo. @Corpodormente Produz pornô de alta qualidade. 👍 Na novela da Globo, o puteiro do Tocantins é a Casa Cor e a mocinha que atende é a Miss Brasil. Crível. Maurílio é o único que respeita a sétima arte. Fará o transporte da minha próxima produção. Eu contando coisas de humor e comédia pra esse Brasil sorrir ou me atirar objetos pontiagudos. https://t.co/lybytCkVpk @Bob_Fernandes Paguei 3 mil pra eu e meu filho. Foda. O vídeo novo de stand-up q postei hj tá no EM ALTA do @Youtube. 🙌🙌🙌 https://t.co/pvUIa1vzbX @tosquista 😂😂😂😂 rolou isso??? @Tonkiel Paguei 3 mil pra mil e pro Tom. Quase vomitei de nervoso. @gustastockler Essa tua namorada te traiu com um moleque de 13 anos. Na verdade, te traiu com um cara de 35 que age como um moleque de 13 pra buscar a identificação da turma teen. @GugaNoblat @MercadoLivre Cara, eu entendo o teu drama, mas vou te contar que eu andei fazendo umas compras ali e tive só alegria. Fiquei muito surpreso positivamente. @gustastockler Cara... super entendo o teu drama... mas entenda que a recompensa que vc colhe vai valer a pena a longo prazo. Teu trampo é fudido. Não para!!! @Carolineazzi 🙌 @g1 Pô... matéria legal. Bem feita. 👏👏👏 Baita nocaute do @MMARLONMORAES! #UFC #UFCFresno https://t.co/ks1IrB8Jwd @lgmota Valeuuuuu!!!! @lgmota Valeuuuuu! 🙌🙌🙌🙌 Quando alguém diz que tô bem pra minha idade. https://t.co/oqtCQOUEVc @Filhadocorvo 😡😡😡 Aprovada no Congresso a lei que autoriza vc a socar o gogó do indivíduo que proferir a frase “esse ano passou rápido, né?”. @AMarianaSantos Desculpe aí @PaolaCarosella 😉 No ar Eu, Ela e 1 Milhão de Seguidores. No @multishow. Liga aí... vc vai curtir. https://t.co/n81EaDamBX @Rickamykazy1 @Kamyllaann Sim Passei anos achando que estudei numa escolinha chamada Patinho Feio. Hoje acordei e lembrei que o nome era Cisne Branco. Obrigado. O tal do Ponto G. https://t.co/9IKyNe2BGo Atenção: Notificação! #UltimateBeastmaster https://t.co/viNvcFNQHH Vâmo falá de nave agora. https://t.co/npJqrdojgq @ramos_leandro 👍🦆 As vezes eu perco a fé no Brasil. Então eu assisto esse vídeo... e sei que tudo vai ficar bem. ❤️ https://t.co/qHCJuzjq4w @_karoliiima 🙌🙌🙌🙌 Depois de 12 anos no @youtube, finalmente fui convidado a participar de um rewind gringo. Orgulho fazer parte disso. Ó eu aí no frame. https://t.co/iYYL7dgK7o Sou um velho gigante. https://t.co/5DT1ZdNI3v @debwtf 😉 @vocesabendo Não sabia @cauemoura 🙏 Te amo, @cauemoura. ❤️ https://t.co/SZUVzcHuCe @siflores 🙌 É hoje!!! 22 horas no @multishow. Não perde! Vou estar pigado na tag, hein?! #euelaeummilhãodeseguidores https://t.co/MCMH4eyacf @CdNLeon Opaaaa!!! Shit storm coming your way, baby! Estreia hoje, as 22hrs no @multishow, Eu, Ela e 1 Milhão de Seguidores. A série tá muito legal! Vc vai curtir. Ps: O Multishow passa na televisão, aquela moldura preta que fica na parede da sua sala. https://t.co/9xkwUVjlFe Esta tal dessa “busca pela felicidade” que a galerinha entrou, virou paranóia. Todo mundo cada dia mais infeliz, tentando ser feliz. Cala essa boca e relaxa, parça. Só vive aí e fica de boas. @CamilaCallimanP 🙌 @antoniotabet Melhor assim. @leticiapearljam 🙌😉 Complete q frase: Kombi não é um carro... é um _______. Saiu uma crítica linda da @Padig sobre a minha nova série no @multishow. Linda. Clica aqui pra dar pageview pra coisa boa: https://t.co/ERSnxmdHAc https://t.co/TLMRMZVtYf @vocativ @Anitta Nobody is thinking that she is just looking for good press. She is giving people opportunities. This is the most important thing. Way to go, pretty girl!!! @antoniotabet Aconselho vc a evitar piadas com bebê. Eu em busca dos meus objetivos. https://t.co/mpUx2T9Xuy @Lipecorradi @multishow 🙌 @RicardoPipo Nao compreendi. Overheem acaba de encontrar meu avô que morreu em 1973. #UFC218 @joerogan Good thing his friend came up to help him. O @victorcamejo tá me reposicionando artisticamente. #RafinhaLuzEFé https://t.co/wVE3IhJ0AL Fez 50 plásticas. Mirou na Angelina Jolie, acertou em Walking Dead. https://t.co/pOFDn8Y5d9 @Bob_Fernandes Sem contar que várias pessoas morrem de doenças bobas durante o jogo. Simplesmente pq Deus tava ocupado ajudando o Valtinho da Ponte Preta a bater uma falta no ângulo. @everaldomarques Everaldo! A porta abre e a mulé ta maquiada e com o texto na ponta da língua? E o que o Romulo ta fazendo no camarim dela? Como o camera sai gravando sem avisar? Pq o Romulo pergunta quem vai ganhar pra ela? Ela tem bola de cristal? Mta perguntas. @LubaTV A minha tb. https://t.co/bJSFxpwYBY @naosalvo O que ela ta fazendo no Show da Fé? Ela matou o RR? @lola0198 @cauemoura @pecesiqueira 😭 Gravando Ilha de Barbados com o PC enforcado pelo cabo da luz. https://t.co/RiDogyKR20 @PalomaGodoi @pecesiqueira @cauemoura 🙌 @PalomaGodoi @pecesiqueira @cauemoura Hahhahehehhe @dudagarbi Não sabia q tinha falecido. @Jardelvicsil Iluhahwhhwh @JosyAnn67511022 🙌 Dica simples pra conviver com o ódio na Internet: 1 - Abra a foto do indivíduo que lhe xingou. 2 - Respire aliviado. https://t.co/mImfc9lg0U Eu motivado em busca do sucesso. https://t.co/1KgT7X53dR @dudagarbi Morreu??? @costa_joana Oxi. Pô... q feio @marceloindaniel A pitada de Tieta sempre presente @y_koallan Eu tb mano Mano... ainda passa novela! E umas novela que parece filme. As mesma pessoa de sempre, mas umas câmera bem loka. Daora. @Lima_Lucas Nem eu. Mas eles me criticam direto. @seiosdasandy @PaolaCarosella @murilo_bergami Mas vc tanta radicalidade por aí?! Poxa... devo estar olhando pro lugar errado... ou não tô vendo algo na minha frente. Realmente acho o ser humano mais tolerante do que aparenta. @cocielo @cauemoura Vamos fazer a copa ONG. O vencedor é aquele que mais ajudar o próximo. #pas Em segundo no EM ALTA, mano! Nóis! https://t.co/tUVEXH4bIn https://t.co/gkQgoRYWTq Boomerang com as amigas pulando e encolhendo as perninhas no ar... até quando? @murilo_bergami @PaolaCarosella Exato. @CamilaCallimanP Adrena é pior @PaolaCarosella Todos parecem radicais, mas as pessoas não são assim tão unilaterais assim. A conduta na rede social parece refletir a vida... não isso tá longe de ser verdade. Somos muito mais amorosos e receptivos do que mostramos no ambiente virtual. Acredite.. há esperança. 😉 @BRUNOHGAMEPLy @cauemoura @pecesiqueira Uhahahhehejj!!!! Fodeo Isso tá muito legal! Dia 5 estréia Eu, Ela e 1 Milhão de Seguidores no @multishow. A série tá super fodona! https://t.co/yi8VZeyD7g @Cout 👍👍👍👍👍 No meu primeiro dia de mandato como presidente, eu baixaria uma medida provisória proibindo o uso das palavras VIBE e VISU. Eu como. https://t.co/JZWWQSCAwr @joerogan @SophiaHelwani @eddiebravo @BrendanSchaub @ChaelSonnen @MMARoasted @TimKennedyMMA @dc_mma @jeffwagenheim @MMAjunkieGeorge @MMAjunkieJohn @MMAjunkieSteven @MMAjunkieMatt @Benaskren I have almost 12 million people following me. I never... I repeat... NEVER... did anything to acquire fake followers, but I have millions of them as well. I dont know why. @monicabergamo Graças a meu bom Deus. @YgorFremo  https://t.co/9oXj6UGjn2 Videozinho com um trecho do meu novo stand up foi visto por 1 milhão de caboclos em menos de 48hrs. Gracias pessoal! Aqui está: https://t.co/Y6DDrUrZyk https://t.co/LeOra9aOij @chinisalada Querido Leatherface. Como se o moço tivesse um. https://t.co/8vovF0ANyS @mashable Also redefining the term “waist of electricity”. Sexta-feira, Rafael! Vâmo sair!\nEu: https://t.co/Cx2VmbyVFi @fabiorabin @pecesiqueira Aproveita e patrocina um time da olimpíada de inverno. https://t.co/8DHqoktJkl @gordaopvcs @cauemoura É possível. Seria lindo."}