{"tweets": "Fakie chicken wing between 1-2 o’clock from @LakaiLTD Brazil tour https://t.co/ixbsSD5Btq @kingskeef I did. We can split the proceeds. Top 5 texts (or derivations of) that I receive after posting my number:\n1) Skamtebord\n2) Do you know Joe?\n3) Is this the Krusty Krab?\n4) Is this really you?\n5) You look like Tony Hawk Wonderfront is two weeks away! I'll be there with a crew of vert maestros performing at the Huckjam stage. \nInfo / tickets: https://t.co/0o2MDTSOSy https://t.co/NZWNmSmhkU To the victors belong the spoils https://t.co/xfYomkQvKD Giving away these three [new] old-school @birdhouse decks: text me at +1 (760) 492-6712 and I’ll pick random winners at 5pm PST. This is not a scam; texts go directly to my phone and I will not sell your info, steal your identity or hack your crypto wallet. https://t.co/nK6IDqE5qK @RockoChar It is What better place than here?\nWhat better time than now? https://t.co/SyExsxOItt Happy Halloween! Quick question: Do you respect wood? I revere wood. https://t.co/kj4ZKh8xlW @artwilliamsgs This story is true down to every last detail. Not sure what it has to do with texting but I make no money from either one. Just thought it was funny. @gupimusic It’s still upsetting, and now we have “HODL” to carry the torch Follow up: I asked him his name and he said Irving. I told him my name is Tony, to which he replied sarcastically “like Tony Hawk haha”\nand then he left. Kid at skatepark (as I arrive): “you a good skater?\nme: sometimes\nhim: you ever been here?\nme: no\nhim: you travel a lot?\nme: yes, perhaps too much \nhim: are you a YouTuber?\nme: no, I’m just a skater and a dad\nhim: wanna see me do a jump?\nme: absolutely\n..and I then shot this pic https://t.co/IBODPauEe2 Looking forward to it! I’ve been riding the Bitcoin transitions for over 5 years now. Which reminds me... should I bring my ramp? https://t.co/0rDyit2Th1 @nnoahfitzgerald It’s me! I was thinking about this flip-board-transfer thing for years and finally tried it last week, even creating a comically shaped landing board. The hardest part was aiming, and then leaning forward at the end. It was a brutal battle but I’ve already recovered thanks to @CannaHempX https://t.co/q1AmEnUjQN That time I was a “Mystery Diver” on ABC’s Splash. I’m just thankful that “Do A Kickflip” wasn’t a thing back then... it would have been the worst credit card ever. https://t.co/vPsQ17NWnb @halo57634 @The_Hermit_Crab @John97Jackson I too cringe when I see it. I let spellcheck undermine my grammar on that one because I was rushed trying to get the Tweet out before takeoff. Me talk good otherwise... Whose reading these anyway? \n(SWIDT) Translation: my son @rileyhawk666 was sponsored by the company she works for years ago, but he is no longer with them (they let him go because he rarely competes on TV... their loss). And apparently they never update their website. \nIn other words, she has no Hawks to speak of. Woman at restaurant: “Tony?”\nme: yes\n“I came over to say hi because we have you”\nhuh?\n“at _ _ _ _ _ _ _ (company name)”\nI don’t understand\n“you’re on our team!”\nthat’s not me\n“but you’re on our website”\nyou mean my son Riley\n“yeah that’s it”\nbut you let him go years ago\n“we did?” @katiemaller It was me! This is a powerful message about bullying. When I was young I got \"picked on\" because I was skinny, nerdy and rode a skateboard (which was NOT cool then). Recognizing this as being bullied has been cathartic, but I am thankful that there are now effective ways to end the cycle. https://t.co/ZkE55RPhv3 @LameAsChris All is forgiven. Sick nosegrind shuv btw. Let me know what you think of my weird flip transfer thing if you saw it. @LameAsChris This is absolutely fake. I would never discourage someone from skating, nor do I care how someone holds their skateboard. Sorry I didn’t reply to you (in reality) but at least you got attention out of it. @_spice_boy Wiener dog Answering the important questions...\n+1 (760) 492-6712 https://t.co/HkwlNAuI73 Correction: the Jubilee is October 26 I'm honored to speak at @alzassociation Chocolate Jubilee in Detroit 10/25. My mom was diagnosed with Alzheimer's &amp; we’ve seen a rapid decline in her health, so I know the devastating effects it has on family. Please help #ENDALZ by attending or donating: https://t.co/7yeHC3eW0R https://t.co/LlLBFQTQ0d @adiosnadios Sent. @WalshMike @TooGooden16 Your message got buried in my text avalanche so here is the answer: yeah it’s super weird, especially coming from a sport where there was no chance of fame or fortune when I started. It’s also weird to put your phone number out there and receive 20k message within a few hours... @JakeHolleyMedia Your message got buried in the tsunami of texts I received today but thank you for the kind words @DylanLJMartin 🎯 @MUFColin Because that’s usually what happens in real life. Don’t hate the player, hate the... wait, never mind @FairbanksTech @ThatDannyDan Correction: I edited the draft. It’s not a scam, and I promise not to share your info. Let me explain while I skate: https://t.co/ORE5A5vKuq @ThatDannyDan Oooh you’re right; I edited that Tweet because it was much longer and forgot to correct the punctuation. Wait, I just did it again... oops Text me at +1 (760) 492-6712\n(for real; it’s me) The new @LakaiLTD and @indy_trucks collection is available now at https://t.co/3LiS5TUaDy and finer skate shops, featuring exclusive colorways of Protos &amp; Riley models. Here we are with Keegan (one of my other sons) testing the goods recently #LakaiXIndependent https://t.co/ZHc8hscsze Flashback to a year ago when it was take-your-kids-to-@KSWaveCo day. “A man-made barrel is a real barrel; it’s just man-made” said no one ever\n📷: @CameraJesus https://t.co/00QUO5zVog Japan air, Torquay, Australia, 1987. We landed in Melbourne and drove straight to this demo. I got out of the car and a kid said “hey are you Tony Hawk? I reckon you’re bullshit!” I went to the ramp dejected but determined to prove him wrong... having no idea it was a compliment https://t.co/xmIQ8QToBa @Nivo0o0 @dog_rates @dogfather I have seen it and I acknowledge the extreme cuteness. Any dog that skates is a good boy as far as I’m concerned. Watch double-amputee Felipe Nunes conquer the loop: https://t.co/H3x3IV6pdh Nelson Mandela said that “sport has the power to change the world” because it can unite people like little else does. I’m a proud supporter of @LaureusSport; they use the inspirational and unifying power of sport as a force for good #SportUnitesUs https://t.co/jMAZ8EnRjb The inaugural @WonderfrontFest in San Diego is Nov 22-24, and I’m adding a Boom Boom Huckjam vibe to one stage featuring legendary punk bands, @ztrip &amp; a stellar vert crew (Sat / Sun only). And Downhill Jam will perform THPS covers while we shred\nInfo/tix: https://t.co/enqIjmjpnQ https://t.co/MMZFNrPlnz Thanks to @steveaoki @WillSparks &amp; @dimmak for including me in the “Send It” music video along with many action sports legends, and for supporting @THF through the collab: \nhttps://t.co/pOsDA3MJ8K Just saw #GeminiMan with this crew and I’m thankful none of us have to deal with our younger [exact] clones; a great concept and very thought-provoking, opens Oct. 11. @GeminiManMovie https://t.co/Do1rHK31sj Dementia has impacted the lives of millions of families, mine included. This powerful new film from @AlzResearchUK and @SamuelLJackson can get us all thinking differently about the varying disorders of dementia. Watch and #ShareTheOrange https://t.co/PAKFITqYX4 Staying connected to @birdhouse w/ my @Dell XPS 13 while on the grind\n#ad Thanks to my @AmexBusiness Platinum Card &amp; the Shop Dell benefit, I get up to $200 in statement credits annually for U.S. purchases with @Dell. Terms apply. Learn how: https://t.co/tvq3OanFfr #DellSmallBiz https://t.co/WKs8PnUMNl #ForYourConsideration: the More Fun in the New World audiobook, follow up to the #GRAMMY nominated Under the Big Black Sun, performed by a full cast, including yours truly. Info: https://t.co/sB0cjVdYz7\n(My story about seeing Circle Jerks at Marina Skatepark in 1980 should help) Thank to everyone that attended / donated / skated at our @THF “East Coast Super Session.” We are thankful for your support &amp; thankful for all the clips to share here.\n🎶: @officialcult - “New York City” https://t.co/IrOVkZX8rm I broke down 21 levels of complexities in “basic” skate tricks with @WIRED: https://t.co/UPHzBqyEkp (aka watch on old dog teach new tricks) Thanks to everyone that attended / skated / performed / supported /donated at the #triple8clash aka #clashatclairemont today. It’s always an honor to skate &amp; raise funding through @grindforlifeorg for those affected by cancer. 🛹 \nYou can help: https://t.co/19Z3amwCUO https://t.co/PX6hK8ImmU @MCote_BHVR Ask your friend to ask me and we can go from there Lunch in The Bronx with @ASAPferg @AlealiMay &amp; @GhettoGastro; great food, better conversation: https://t.co/BaIImfsieo Bagels and Doritos and Jeeps, oh my https://t.co/0LWaJTidfG Hey @tomhanks, if we both acknowledge that we’ve seen this then maybe people will stop sending it to us... looking forward to seeing your signature moves though. #shimmyshimmycocoapop https://t.co/HZFOkEsI7o @Rustwolf Yes, right here: https://t.co/pQ4Bb2rXup This Saturday! Come watch us shred the gnar while helping cancer victims. Info: https://t.co/h0iUryd33Z https://t.co/yI4K7EJ8Xn @AKAJEDI77 Al right Hamilton! Woman at concert: “Are you Tony Hawk?”\nme: I am today (Spicoli reference)\nher: “I took a picture with you years ago”\nme: where?\nher: “In Vegas. It was the first time my son thought I met someone cool.”\nme: wow thanks\nher: “he took the print, cut me out of it &amp; put it on his wall” Only a couple hours left to bid on exclusive auction items benefiting @Hilar4Charity (including signed skateboard and pics): https://t.co/lw8FFyoOrE It was an honor skating at the #hilarityforcharity carnival last night. Thank you Seth &amp; Lauren Rogen for raising awareness / funding for victims of Alzheimer’s. Here is @Mitchiebrusco84 720’ing over Jimmy Wilkins to @Sethrogen &amp; Jeff Ross approvals 👍🏼👍🏼 https://t.co/ZaOmNaYwKX https://t.co/N2vTy55aIP @ChercheBuddy If you [re]build it... @vikramblings I was just happy to make it first try At a skatepark, older dude outside the fence sees me and yells (heckles) “do a kickflip!”\nSo I did one.\nHe then turns to his friend and says: “holy sh!t, he actually did it” @JediRealEstate No, but you might have seen my 18-year-old son. He’s my doppelgänger and he just started college there @ethanburgess @iamthalente “Talent” by @PIXIES I met @iamthalente 10 yrs ago near Durban, SA. He was ripping with style at age 14. I asked if I could send him some gear &amp; he said flatly “no, I live on the streets.” There is a powerful doc (“I Am Thalente”) about him &amp; he’s still ripping; I shot this today in less than an hour https://t.co/MckfwJypEs Senior pic, 1986. My careers teacher berated me for finishing workbook pages that he hadn’t assigned yet. He told me I wouldn’t make it in the workplace if I didn’t follow instructions. He was absolutely correct, and I am thankful for his indispensable guidance. https://t.co/LSRL4oejBh Back disaster (?) by @DarbyAllin \n#tacky https://t.co/p6HjkBUiBC In keeping with the THPS 20th anniversary, here is our motion capture session from 1999. We didn’t end up using any of this data because there wasn’t enough time to program it into the final game, but at least I got to do a bunch of hard tricks while wearing an embarrassing suit. https://t.co/pHw09SX3tg To clarify: thought I grabbed my ID out of my car on the way in. Honest mistake, but discovered too late. At will call: I have 2 tickets for Hawk\nagent: “Can I see your ID?”\nme: I forgot it but I have a credit card\nother agent: “He’s Tony Hawk”\nagent: “he doesn’t have ID”\nguy behind me: “that’s him”\nagent: “I can’t find your name”\nme: there is no E on the end\nagent: “here you go” @Vascillia @mrfeelswildride @THPSfilm I’m better at 2 &amp; 3 because manuals/reverts THPS was released 20 years ago today. It was an unexpected phenomenon and brought a new audience to the skateboarding world. My friends at @THPSfilm are finishing a documentary about the series https://t.co/zpUC6WSQGr\nMeanwhile, here I am this morning skating the warehouse ➡️➡️⭕️ https://t.co/9eCEvgxzod @BendubzGaming @David_Flett We had to rename it for Europe &amp; Oz because they said “skater” would be interpreted as ice skating @arto_mata Thank you! See you soon Found one (well, many... but one that is close). Thank you Twitterverse Anybody out there in 760 have a copy of THPS1 for original PlayStation? Totally serious. Just checked my archives and I have every sequel but not the OG version. Ironic? Anyway, I’ll give you a skateboard if I can borrow it for the weekend. For reals. I’m bringing my ramp and a superstar crew to the  #HilarityForCharity County Fair on September 14. Tickets available now! Proceeds go towards Alzheimer’s care, research, and support. If you know me, you’ll know why I got involved. Info: https://t.co/ZaOmNaYwKX 🛹🎡 #EndAlz https://t.co/Qivmel7aop RT @ringer: An oral history of ‘Tony Hawk’s Pro Skater’—which turns 20 today—with reflections by @tonyhawk himself.\n@ajohnagnello: https://… Thanks to @Sethrogen for being the final guest on Demolition Radio. It’s been a blast doing this show for the last 15 (!) years on @SIRIUSXM; stoked to have ended it on a high note (see what I did there). Check channel 103 for air dates or the SiriusXM app for previous shows. https://t.co/B8lJyA7bOd Thanks Aqua Sports Marine for letting us borrow one of your magical MB Boats #sortapitted\n📷: @camera_jesus https://t.co/zdp79tl3b3 Approaching ticket counter, agent looks up and exclaims “I know you... you’re a famous... person... or sports guy... skateboarder! And your name is...” (glances at my ticket)\n“Anthony Hawkins!”\nme: close enough \nher: my son would love a picture with you\nme: Is he here?\nher: no Answering #73Questions in one take with @voguemagazine was not easy, but I was honored to take part in this prestigious series: https://t.co/lo72ZRpwh4 I had the privilege of being interviewed recently by @KyleBreitkopf for his new series “getting Kandid with Kyle” \n(and he didn’t defile my ramp like in Parental Guidance): https://t.co/iUzC0zBuPT It was a blast hosting Felipe Nunes on his recent trip to USA. He literally got off the plane, set up a new board and went straight to Vista skatepark to shoot this #firingline. We are proud to have him as official member of the @birdhouse team; you’ll be seeing more of him soon. https://t.co/GA9sqB7mGC Don’t kill your television...\n just skate around it. https://t.co/QiGTc8Zy4u To all the people who now approach me (especially at airports) to say “hey, you look like Tony Hawk” and then laugh: I got you... and thank you for your service. A challenging part of my “job” is constant travel. #Ad @AmexBusiness Platinum Card &amp; Shop Dell benefits help me stay connected. I can get up to $200 in statement credits annually for U.S. purchases with @Dell. Terms apply. #DellSmallBiz #AmexBusiness Info: https://t.co/tvq3OanFfr https://t.co/YE23barAcp @NASA yep, that's definitely me. Thanks for exposing my alter-ego of space engineer. Now I'm gonna have to start skating in this outfit... to infinity and beyond [fashion]. Hopefully now I can use your technology to make skateboards lighter during my day job. https://t.co/kkD9dbkCvm For those that think I’m complaining about these encounters (I’m not; I think they’re funny), or that I’m simply making them up: here is the aforementioned selfie: https://t.co/e6YVzDYufK\nPlease don’t harass him; he was nice and I don’t expect everyone / anyone to know who I am. @Noah_Sayed529 @Casey That is EXACTLY what if felt like Stepping out of a taxi in Paris, trying to pay and organize kids / bags.\nGuy on sidewalk: “hey, you are a famous sports guy, I saw a video with you and @Casey Neistat!”\nme: yeah, he’s cool\nhim “can I get a selfie &amp; your name?”\nme: yes, it’s Tony\nhim: “what’s your Instagram?” The Paris #vansparkseries finals start in one hour (12pm France time... dunno what time that is everywhere else but you have a phone that can easily tell you) at https://t.co/RSNbq1Eua5. I will be on the mic instead of doing inverts like this. https://t.co/VYxO39JejQ UPDATE: São Paulo! The @lakailtd and @lakaibrasil crew is coming your way: street &amp; vert demos at \nCentro de Esportes Radicais \nAugust 18th at 11am. Obrigado!\n(art by @thebirdmachine) https://t.co/TCvqKkU1ll So hyped for this; @Hilar4Charity is a cause that is truly close to my heart. Thank you for including me in the festivities @Sethrogen https://t.co/euU1tt4pdj The “Raw and Uncut” footage from my recent Battle Commander is now up on @berrics. This is what it looks like trying to survive bails when all you want to do is kneeslide. Fun fact: I literally rode out of the building after the 10-stair. https://t.co/hTz3PjmIo8 Congratulations to @Mitchiebrusco84 on the first-ever 1260. I’m speechless. 🛹🌀🌀🌀🔥\n🎥: @rwillyofficial https://t.co/gecnC4Rhd4 Check out new Tournament Mode in the updated @SkateJam on mobile:  https://t.co/v6rgnmo00L https://t.co/fXFTOPyKq3 There are very few people I trust to go high enough over my ramp channel for me to zoom past underneath, and @shaunwhite is one of them. Here he is dusting off the cobwebs on a big heelfip as I sneak by this afternoon. 🍅 🦅🛹 https://t.co/fJBkoj9HGW The skateboard I used for @berrics Battle Commander and bigflip lesson (with @DonovanStrain) is now available on @eBay; % of proceeds go to @THF:\nhttps://t.co/aso5lMsdCS\n(also - leave a comment on my last IG post for a chance to win the board I’m currently riding... for free) Kid at skatepark: \n“Are you Tony Hawk?”\nme: I am\nhim: “no you’re not”\nme: ok, I’m not\nhim: “but are you, FOR REAL?”\nme: I am, for real \nhim: I thought you’d look younger\nme: ME TOO The @berrics #TONYHAWKWEEK has [thankfully] come to an end with the release of my Battle Commander video. It was a blast - and frightening - to revisit my “street” skills, and truly enjoyable to include my kids in the segment. Enjoy: https://t.co/Wyzqtu90Yp My @berrics “Battle Commander” video drops (posts? uploads?) tomorrow. Here is a preview of what it was like to revisit my limited street repertoire at my age: https://t.co/YAO8RqBwVT @Lin_Manuel Thank you maestro! And my daughter wants to be you - or at least in one of your productions - when she grows up. Meeting a friend for dinner, parking lot full, found a spot a few blocks away and skated to restaurant. Guy at crosswalk: “are you Tony Hawk?”\nme: yes\nhim: “I can do a kickflip”\nme: cool\nhim: “I wish you had your camera crew so I could show you”\nme: I’m off the clock I learned a new flip trick thanks to @donovanstrain as #tonyhawkweek continues over at @berrics. Fun fact:  @rileyhawk666 learned this when he was young and that was the day I realized that he was beyond my teaching capabilities. \nhttps://t.co/lQthcKSCOw The “High ‘N’ Dry” edit of our water park adventures is now live on @thrashermag. Here are some excerpts featuring my slight mishap, @rileyhawk666’s fs flip &amp;\nKeegan’s loop.\n🎶: @CornersCA https://t.co/Xr8F98w8kS My @berrics #battlecommander video drops Saturday, but you’ll have to endure “Tony Hawk Week” first.\nI promise it will be less painful than hitting handrails in your 50’s. https://t.co/bPCI2ipOhG These clips from the @birdhouse video “Unitlted” (1993) were the very last for my waning 90’s street career. I recently dug deep to see if I still had any of these skills left, and the result of those efforts will be shown on @berrics in one week... You might be mildly surprised https://t.co/ceWBEmlBWX In Athens, Greece at a Cure concert, walk up to bar to order drinks.\nGuy next to me: “you gotta get in the back of that long line to buy drink tokens”\nme: ok thanks\nhim: hey, you’re American!\nme: I am\nhim: I know you but I don’t KNOW you\nme: It happens\nhim: is your name Kelly? The resemblance is [still] uncanny https://t.co/nkPlzsAp0Y Update: my hidden skateboard in Montreal has been found. Finder=keeper, thanks for playing I just left my skateboard near this mural wall in Montréal.\nFinders keepers... go now.\nPlease reply with the hashtag I wrote on the griptape https://t.co/26mSnktHzY In case you were wondering what the @birdhouse crew has been up to lately... here’s a video update https://t.co/gxp7PjNrGR Woman on plane: “Are you Tony Hawk?”\nme: yes\nher: “my son knows all about you”\nme: I’m honored\nher: “do you sign autographs, or is that too 80’s?\nme: it is a tradition that endures \nher: “please sign this”\nme: ok\nher: “not sure what he’ll do with it”\nme: I can’t imagine @mattchewblack Uh... no. This was in March, and they are building a wave park. I just lucked into an invite to ride it before it’s gone Muchas gracias @HRHRivieraMaya / @WoodwardRiviera for the sun, sand, slides and skating. Now here’s a nice shaka brah from us to you.\n🎶: @metalachi - “Ace Of Spades” https://t.co/jtp0gMt5FH Circling the drain in Palm Springs \n📷: @CameraJesus https://t.co/kY5jF1lCBb Foam pits y niños at @WoodwardRiviera @HRHCancun \n(feat. Kady’s first time... wait for it) https://t.co/pQ0ZJPCex4 I’m a bespoke rollercoaster ride https://t.co/KpcIgPtSjH EARTHQUAKE\nJust felt our room shaking and heard the pool spilling over in huge gushes. Hope everyone is ok. We felt it in encinitas There was an annual 4th of July “bike decoration” contest in my neighborhood. My dad helped me during the bicentennial &amp; we came up with this monstrosity; I couldn’t even ride it. Happy 4th! Here’s to parents embarrassing their kids; it is a tradition I am proud to pass along. https://t.co/cTDOPcFgEQ Lipslide, 1997. Been dusting off these ”street” skills recently to see what still works. Stay tuned. https://t.co/dn88rtCd4N Had the pleasure of talking to @OsheaJacksonJr recently about the perks &amp; challenges of growing up with a famous dad, then being asked to play him in a hit movie. \"I've been studying for this role my whole life!\"\nhttps://t.co/CKNaxgiXFo @dhyman nice try &amp; clever tactic but it’s not my first rodeo @KimberliLarae Hi Kym! Congrats on being selected to help celebrate one of the raddest dads in America!  Hope to see you and your ‘rad dad’ in San Diego in August. Check for a message from @bagelbites with the details. P.S. yes, it’s me. @heatherrdn @BagelBites Hi Heather! Congrats on being selected to help celebrate one of the raddest dads in America!  Hope to see you and your ‘rad dad’ in San Diego in August. Check for a message from @bagelbites with the details. P.S. yes, it’s me. The #vansparkseries in São Paulo was a blast but the highlight of my weekend was meeting Renan Prasido whose childhood dream was to walk &amp; skate, which was fulfilled by Skate Anima &amp; friends. Check his Insta to see his first kickflip!\nCongrats to @pedrobarrossk8 &amp; @yndiaraasp btw https://t.co/zCxrTlNsRr Morning stretch at #vansparkseries 📷: @jrlemos https://t.co/RSNbq1Eua5 https://t.co/9wZFxSo74c Don’t try this at home... unless it’s #goskateboardingday and your room looks like this. #bertlemannbrigade https://t.co/rvKoSNKsQr The Search For Animal Chin is now on YouTube! So no more borrowing your friend’s worn-out VHS 📼\nhttps://t.co/i96spUJkGG Went to a convenience store on my way to skate, approaching counter with water &amp; Advil (I’m old), clerk sees me: “you look like someone”\nme: oh yeah?\nhim: “what’s your name?”\nme: Tony\nhim: “last name?”\nme: Hawk\nhim: “you are him?”\nme: yes\nhim: “no charge, but you owe me a selfie” Bones Brigade boy band(?), 1988\n📷: #geoffreybiddle https://t.co/OgmqiLwcpC @MikeIngelido Hi Michael! Congrats on being selected as one of the raddest dads in America! Looking forward to seeing you in San Diego to celebrate. Check for a message from @bagelbites with the details. \nP.S. yes, it’s me. At Disneyland with kids, waiting in line for churros. Girl in front of me: “you look like Tony Hawks”\nme: really?\nher: “yes”\nme: Is that good?\nher, nonplussed: “I guess so” Thanks to Michael Che for introducing me at the #cliosport awards and not destroying my career in the process (although I know it was tempting). Congrats to all the other incredibly talented nominees, and thank to @ClioAwards for the honor. https://t.co/Qd4ngctvmF In NYC, guy cutting meat at deli looks up with confusion: \n“you freaked me out, I thought you were that guy from the movie Ghost”\nme: Patrick Swayze?\nhim: “No, his friend that betrays him” The Rad Dad Squad is in full swing - and here are few of the most recent inductees. Happy Rad Dads Day from @bagelbites and me! Keep tagging those rad dad moves #RadDadSquad. https://t.co/J2NHioTCh1  #Ad https://t.co/xhMoACXr3C Thank you @Delta for the help getting this epic band to our @THF fundraiser! https://t.co/ClnP6mGf8o I sang “Amoeba” by @TheAdolescents with @BirdmanTHPS at our THPS 20th anniversary celebration last night. Best karaoke bar ever. https://t.co/iT6P9HnCwJ So hyped to have @BirdmanTHPS here from Oz to play our 20th anniversary celebration of THPS (they are opening for @badreligion).\nI barged their rehearsals yesterday to record this gem by @Millencolin. Looking forward to @ObservatorySD tonight! All proceeds benefit @THF https://t.co/Ba3U6SWwpL RT @FoodNetwork: THIS JUST IN: @tonyhawk is coming to judge #BeatBobbyFlay with @MVoltaggio ... and yes, @bflay is trying out the skateboar… Tickets for @WonderfrontF go on sale today. I'll be skating with a legendary crew at the Huckjam Stage in between performances by Pennywise, Suicidal Tendencies, X, Vandals and @ztrip: https://t.co/h5YdntWabr I'm teaming up with @bagelbites to form the Rad Dad Squad, celebrating dads who create spontaneous fun with their kids. Tag those rad dad moves with #RadDadSquad - recruiting starts now! https://t.co/O3DD0rhlxU #Rad #Dad #Ad https://t.co/J6bmsBtMbk Unlocking hidden (or forbidden?) street skills at @berrics today. https://t.co/iW9j3zKLa0 Don’t call it a comeback! Is it still considered “selling out” when you’ve been buying the product long after they were paying you to endorse it? Either way, it’s good to be back with @bagelbites.\nMore to come from this #bagelboy soon. #ad https://t.co/m2LVKLo433 Read the fine print... a Huckjam revival is happening at the upcoming San Diego @WonderfrontF in the form of our own stage, punk luminaries, my ramp, legendary skaters and @ztrip! \nMore info: https://t.co/enqIjmjpnQ https://t.co/s4KcHtrGBM Thanks to @CameraJesus for capturing me in motion today in and around Detroit. I can’t begin to explain how frightening handrails are for me these days, considering my AARP status and long dormant street skills. 👴🏼🛹⚠️ https://t.co/pcYLTXrXxn I was invited but I can’t make it there. Saw other Tweets about this, so just trying to clarify. Sorry about that. Looks like a fun event though. https://t.co/B2XADL78vD Skateboard P (aka @Pharrell) is on Demolition Radio tomorrow! We talked about his skating roots, Trashmore, early music influences, NERD and the universe. It’s wildly interesting; get caught under his spell. Show airs on @siriusxm 103:\n6/1 1p ET\n6/2 12a ET\n6/2 10a ET\n6/2 7p ET https://t.co/qrbBfw5U8c Watch @Lizziearmanto discuss her inspirations, success, feminism, skating pools and getting loopy with Jeff Grosso in the latest #loveletterstoskateboarding: https://t.co/zkLwYGK4ju My interview on @kingsthings with @tomgreenlive:  https://t.co/yWJH5orGQi @CryptoDingue Been riding it for 6 years. Haven’t bailed yet Handplant yoga by @buckylasek \n#taptaptaparoo https://t.co/w38dCViwPh Thanks to the always entertaining @tomgreenlive for joining me on Demolition Radio yesterday. We talked about skating, punctuality, being outcasts, 80’s haircuts and... magnets. Show airs tomorrow on @siriusxm 103 @FactionTalk103 https://t.co/p8PecOUHjO Check out @PlagueVendor (one of my fav bands) at @MusicBoxSD June 12th. They were featured in THPS5 and their newer stuff is always in my skate playlists.\nTix: https://t.co/M5mognta02 Best 360 flip you’ll see today: @vasu_sojitra with a masterful flick of the stick.\n📽: @whos_redey https://t.co/JXonXuZZqO Stoked to contribute to #morefuninthenewworld book about punk in the early 80’s! In celebration of the book release, I’ll be joining a panel discussion at @LargoLosAngeles on June 4. \nInfo: https://t.co/L6ufRgYnEz\nTix: https://t.co/FthVphuiDj https://t.co/lvxrmvoQLl The Bones Brigade Video Show (first @PowellPeralta video, 1984) is now available to watch on their YouTube channel, with other BB vids to be released in the coming weeks. Here is [some of] my video debut from DMSR. \nFull length: https://t.co/RqGOpwm37t https://t.co/7Ry2gbpdsC Playing the hits here in Shanghai during #vansparkseries practice https://t.co/aMlfIxgLKK Happy 50th to this beautiful mother, punker, skater, humanitarian and tender missionary from the underworld. Thank you for our wonderful life of adventure &amp; chaos. And special thanks to @float_land for creating my very ambitious gift of emulating our house &amp; kids (&amp; dog) in VR. https://t.co/zPmqP1RH1R Had a blast talking to @tomgreenlive while he guest-hosted @larrykingnow (with a solid lineup for the day). Episode airs 5/29 on @hulu https://t.co/SPCtDBMV3h Solid crew! https://t.co/zGzxsfajxp Thanks for all the bday wishes and Happy Mother’s Day to the hardest working people out there. We appreciate you even though we may not show it enough. Hug/visit/call your mom today because tomorrow holds no promises. Here is my mom - smart &amp; sassy - before Alzheimer’s stole her. https://t.co/TKmV4iSzv5 My bum is on the chair... https://t.co/h6nDYVEaWw @ogecebel “Doing everything I can, pretending I’m a Superman” Thank you @doctor_woo_ssc for branding me with a few of my favorite things; family and @birdhouse. It was an honor watching a master at work; I appreciate the time and meticulous attention to detail. https://t.co/nusmMTMlfY Thanks @ljplayhouse for the workshop opportunity, and to @mmothersbaugh &amp; @landoftrust for bringing our musical vision to life https://t.co/J60Jj6YiDH Smith-vert at a mini ramp demo in Brisbane, 1994. This was a rare demo opportunity in a time when I was struggling to make ends meet. Any ramp was a considered good ramp back then. https://t.co/GFczK2nOpB RT @landoftrust: So stoked to be at @ljplayhouse with @mmothersbaugh and @tonyhawk, working on this new show! https://t.co/dYaMrMwv2L RT @DougDelonyKHOU: Meet the #Houston woman (a veteran) who found @tonyhawk's autographed skateboard this morning outside Bush Airport! (an… Houston we have a finder https://t.co/J8HNx89JLV UPDATE: it appears to be found but I have yet to verify with the hashtag I just left my skateboard kinda close to Houston airport. Finders keepers if you can figure out where this is. Please reply with the hashtag on the griptape if found. Go now! https://t.co/X0HUQxUlVe In celebration of @erickoston’s birthday &amp; @berrics #nationaldoakickflipday, I would like to relinquish the dubious honor of being the “Do A Kickflip” ambassador. Back to you, Froston 🛹🎂🎈 https://t.co/pW5hEirLTa This interaction happens regularly (including yesterday):\nX = a person I don’t know \nXX = a city nowhere near San Diego\n“Hey Tony Hawk”\nHello\n“You grew up skating with my friend X!”\nWhere did he skate?\n“In XX!”\nI’m sorry, but I grew up in San Diego\n“Pretty sure it was you though” Thanks to everyone that attended our @GuacAmigos grand opening demo &amp; @THF fundraiser yesterday. And thanks @LakaiLTD for styling out the staff. To everyone else: here’s a triple stack with @plronchetti &amp; @andymacdonald that you missed seeing live. https://t.co/qgy0CHCiBR Saturday! We’re skating at 2pm https://t.co/R4iZvJFWPg Stacks on stacks with @andymacdonald. We only made two out of many frightening attempts. One time I stalled &amp; his arm collapsed from holding us both up. Another time I missed his board and my hand landed on his hip... but we made it. 📷: @atibaphoto\nvideo: https://t.co/aNYxNl9hy0 https://t.co/gaFqaVTUn2 @halifaxbeard ...because it's really good Pulling up to drive-through window, girl starts to read back my order and stops herself: “you’re Tony Hawk?”\nme: yes\nher: “can I tell everyone?”\nme: I suppose\nher: “yo, we got Tony Hawk at the window!”\nvoice from kitchen: “Who?” Just saw #LongShot starring @Sethrogen &amp; @CharlizeAfrica and it’s a fun reprieve from our current politics, where love conquers partisanship, and @OsheaJacksonJr wins the popular vote as far as I’m concerned (opens on May 3rd) https://t.co/eNdQfiV79Z I joined the fun on ⁦@BookCameo! Hit me up for birthday wishes, shout outs, kickflip requests, etc:⁩ https://t.co/MmXPIN8ZlM Had a blast giving @nate_robinson a tour of my place, brief skate lesson and dismount demo with my son Keegan. \nThanks to @SarahHallPRInc for setting it up! https://t.co/aV4rgVb0Ss I’ll be commentating at the 2019 #vansparkseries events in Shanghai, São Paulo, Montreal, Paris and SLC. This photo is deceiving because it looks like I’ll be skating in the events, but it’s better than some generic headshot that you’ll just scroll by without reading the caption. https://t.co/fshvrboSDB Watch the thrill of victory and agony of defeat from our @birdhouse OKC demo last weekend: https://t.co/Z7rhJpQjX6 address: 2607 Pacific Coast Hwy, Newport Beach, CA 92663 April 27, free to the public! https://t.co/pvv3pcZSdt April 27: @GuacAmigos grand opening in Newport! Free to public, 1-5pm (skate demo at 2pm featuring vert legends Andy Mac, Bucky Lasek, Lizzie Armanto, Jordyn Barratt, Kevin Staab, Elliot Sloan &amp; Paul-Luc Ronchetti). Join us for tacos, tequila &amp; tailslides https://t.co/7oBWHZQedk https://t.co/KO7V2NWfI4 😢 🇫🇷 https://t.co/WXJYLfQKre RT @vansparkseries: Vans Park Series Welcomes Tony Hawk @tonyhawk as New Live Broadcast Commentator for the 2019 Pro Tour Season! 🎙🦅🎙🦅 http… Goodbye Oklahoma. If anyone wants the board I was riding yesterday, I left it here in the Mat Hoffman Action Sports Park. Reply with the hashtag I wrote if you find it. https://t.co/1MGlZxb7A4 Thanks to everyone that showed up today in OKC (including the mayor), and congrats on your new park! Here’s hometown hero Clint Waker deftly maneuvering his way through the chaos. Thanks also to the dude that let me borrow his board after mine broke. https://t.co/f7iVFkmDJI @T_bell111 It’s real. I purposely left out which rental company because I don’t want him to get fired. At rental car agency, can’t find my name on the monitor to find my car, go inside &amp; wait in line. Finally get to the front, agent sees me &amp; says “you really are Tony Hawk”\nMe: um, yes. I was looking for my name outside on the list\nHim: “I deleted it because I thought it was fake” Tomorrow! Come watch our @birdhouse crew rip the new park in OKC while I struggle on the handrails. \nStarts at 1pm, ends when I do a flip out of the deep end of the bowl. https://t.co/UeWwh67LIc Here I am, doing everything I can... https://t.co/vg0GJswfgN It’s been 20 years since the release of THPS! In celebration, we’re having a benefit concert June 9 benefiting @THF featuring @badreligion &amp; @BirdmanTHPS at Observatory North Park. BIG surprises in store. Join us!\nTickets/info: https://t.co/a5wpVvXSMN New profile pic https://t.co/ztmf8I2CX7 2009: @THF raised $70k to build a skatepark in Compton so I brought a crew to skate for the grand opening. Fun fact: this is the day I met Clint Walker and things have not been the same since. https://t.co/OYDl4bvlCc RT @ibrowning: This month in The Rules of Skateboarding on @vllgpsych: I talked to @tonyhawk about corporate sponsorships, deals he turned… 1989: Landisville, PA. Ray Underhill, Steve Saiz, Eric Sanderson, Kevin Harris and I toured with the Bones Brigade miniramp for 6 weeks straight across the USA, doing demos every day in a new city and desperately trying to skate it as if it were a vert ramp.\n📹: Matt Hohman https://t.co/OGszblKRug BIRD UP! New @birdhouse series including the worst deck on television: https://t.co/BpPbmIFxAa\n Happy Birthday @ericandre @igoroliveiras He was not messing with me. He was just excited to see anyone deemed “famous” Guy approaches me while standing in line at coffee shop in Cancún.\nHim: my friend says you are a famous person. Is that true?\nMe: that depends on your definition of fame\nHim: will you show up on Google if I search your name?\nMe: yes\nHim (typing into phone): you are Tony Stark? Learning a new skate trick is a lesson in discipline, perseverance, confidence and [sometimes] luck. I documented the journey recently from start to finish so you can see what it takes to make a trick that could easily go unnoticed: https://t.co/rLyqjJeMAy (via @RideChannel) Happy Birthday Spencer (aka @gupimusic)! \nThank you for 20 years of laughs and entertainment... and all the great music. https://t.co/45sUOIMtlR I harassed random skaters on the street to “do a kickflip” and they rose to the challenge: https://t.co/5w4Bd6Z9UN The conversation went much better than the skate lesson. Thanks for having me on @CheetoSantino! https://t.co/kWIvkMJWy3 We had a chance to skate a giant waterslide today. Here’s @Lizziearmanto doing a frontside air on the face wall of a “Tornado” https://t.co/AWGZsWyfZy San Diego: still classy after all these years. Announcing #Wonderfront music + arts festival, Nov 22-24 https://t.co/lRSq3Fza1D Congrats @GORILLAFLICKS on #thedirt movie. I read the book &amp; enjoyed this interpretation. It’s a raw, funny &amp; moving portrayal of Motley Crue’s chaotic excess/success. Avail. on @netflix 3/22. These jackasses were not featured btw, but I was hyped to walk the red carpet with them https://t.co/pBHz7927Cw RT @waitwait: Our most recent episode, featuring the legendary @tonyhawk, is available now!\n\nhttps://t.co/9Nnpq5HWBF My life is super weird. https://t.co/XSJjUqOJ4P Switch Spaghetti Western for Jake https://t.co/JqSHhbuTIL Such tragic news about the passing of Jake Phelps. He was a true skateboarder to the end, a fan of diverse styles and a passion for the history of skating. He jokingly called my weird fakie footplant impossible the “Spaghetti Western” so I will forever use that name in his honor. https://t.co/aeDKnVAIig Hear @rileyhawk666’s unique journey from childhood to adulthood through a life of skateboarding, motorcycles, traveling and coffee on his recent interview with @thenineclub: https://t.co/6lRwzc9TrJ The duality of @shalomshuli: he did the same comedy set, once sober and once hammered. I would take inspiration from this, but I don’t think it would work as well in my profession... compare and contrast:\nhttps://t.co/ZewwsQGFKn\nhttps://t.co/WhubgFUuyH Full-time @THF programs director &amp; part-time skateboard wizard Alec Beck just dropped a video of him shredding during his off hours. In celebration, @birdhouse gave him an honorary “guest board” with proceeds going to THF for more public skateaprks: https://t.co/ffnoEdTZRb Do not try this at home... unless your dad produced an arena tour and still has big stunt pads laying around. https://t.co/A1yjU8J6kd I’m sorry if these encounters seem redundant... but they’re all true &amp; this just happened. \nSitting at gate, guy recognizes me, walks over &amp; says hello. \nGuy next to me: “you’re Tony Hawk?”\nMe: yes\nHim: “I have seen any recent pictures of you. You’ve gotten older.”\nMe: it happens RT @x4summit: Amazing to see a skating duo on the half pipe at @Qualtrics X4 Summit.\n\nThanks @tonyhawk &amp; friends for being a part of #Qualt… Flipping off @andymacdonald during #qualtricsx4 practice. \n📹: @corbinharris https://t.co/NEGxBF3vPg Watch me score big [burger] combos with help from Alvin Cailan on #theburgershow (via @firstwefeast): https://t.co/KESHx9pS73 https://t.co/Y8n6fqYIzp “The Sound Of Skateboarding” feat. @_davidloy &amp; Keire Johnson. Thanks to Bonamaze for the concept / collaboration https://t.co/DAObQBzJEu Young kid at skatepark: “Are you a professional?”\nMe: yes\nHim: “But you’re a grown up!”\nMe: I know. It’s weird.\nHim: “I have a skateboard”\nMe: I hope you never outgrow it Alive and kicking: @birdhouse 2019 https://t.co/nc5WhF6YP0 I've been doing Demolition Radio on @siriusxm for 15 years now, and this was by far one of my favorite interviews... my first question to Mike D: How can you be so skinny and live so fat? https://t.co/AX5HnVGtbs The evolution of confidence: https://t.co/FVdd31TEsH Congrats to @pamelaadlon on season 3 of #betterthingsfx (airing 2/28). It is a raw, funny, powerful take on parenting on the modern era while trying to have a successful career of your own, &amp; keeps getting better\nAlso: this Jacobs’s Ladder filter works wonders once you’re my age. https://t.co/bnx9goiWI8 Thank you for all the kind words about my daughter dropping in for her first time. I never imagined it would resonate with so many people. Here are her first “attempts” that day to give it some context: https://t.co/5ML93tSgcS @JR_Surg Thank you! I am truly honored Thanks @BlackPlagueBeer for hosting our @birdhouse “Beautiful Mutants” premiere this evening. Video drops on @thrashermag 3/1 https://t.co/42KkuOAfpV @MusaTariq @Nike Thanks! I used a red solo cup to brace my phone, so... mine was roughly $.05 production cost @Sethrogen Same My daughter overcoming her fear in real time (wait for it). I might have been more nervous than she was.\n👧🏼🛹⬇️ https://t.co/IG6awFIHA3 Failed Elguerial from Boom Boom Huckjam, 2003 (not sure which city). No wonder my neck is so stiff these days; decades of these whiplashes have finally caught up. https://t.co/zRmJ0bpQj1 @primus @GILx87 @THF @Millencolin Thank you. Frizzle Fry! My friends at @GhettoGastro started their cooking show “Stease The Day” and I highly recommend it; these guys are culinary maestros. I know from experience: https://t.co/SwWuM4c8mz @officialturbo @THF @primus @Millencolin The usual routes haven't gotten us very far with them. Need more direct contact @GILx87 @THF @primus @Millencolin Yes, already requested @AliasHandler @THF @primus @Millencolin They were one of the first I contacted Trying to set up a charity concert to benefit @THF sometime this year in celebration of first THPS release 20 years ago (!). Would love some help contacting bands if anyone is connected to @Primus, DK or @MIllencolin. Working on others that I already know. Rage reunion? Dream big Thanks to @SunshineVillage for hosting me yesterday before my keynote at #thegathering2019, and to @kendraSonia for showing me the least perilous way down Delirium Dive It was - dare I say - extreme. https://t.co/iF5tPPJULZ I was honored to present @lindseyvonn with the Laureus Spirit of Sport award last night, less than a week after she announced her retirement from professional skiing. She leaves a legacy of competitive domination, but also of dedication &amp; perseverance. I took this from the stage. https://t.co/LKoQMoqGrf RT @LaureusSport: How else would you expect @tonyhawk to arrive at #Laureus19 \n\n🛹🛹🛹 https://t.co/q8uOyun5re Searching for the only skatepark in Monaco with @Lizziearmanto &amp; @axelcruysberghs on our way to #Laureus19\n🎶: @fotc - “Foux du  Fa Fa” https://t.co/NvQkXgXN5I In Monaco for the 19th annual Laureus World Sports Awards, rehearsing my “nose manual of  victory” before tomorrow night’s festivities. #laureus19 https://t.co/1f6TLGj6CJ Watch @shaunwhite @kellyslater &amp; me discuss our early days, injuries, Space Jam and... [attempt to] SING on the newest @CarpoolKaraoke (on @AppleTV): https://t.co/A2in2Q2TGf RT @CarpoolKaraoke: An extreme new #CarpoolKaraoke coming your way this Friday with legit legends @shaunwhite @tonyhawk and @kellyslater! 🛹… 1993 promo for Tracker “E-clips” (a novelty hardware) with cameo of @rileyhawk666 &amp; his mom. It was a weird time: I was skating vert and learning tricks with little validation or financial rewards. I had just started @birdhouse by taking out a 2nd mortgage &amp; had to sell the house https://t.co/Gcl7y9bjqN Our @Hawkboxboarders are available now at @Walmart and they’re [literally] going fast. Each pack comes with four quarterpipes, but you can always make your own “big air” ramps like this, then record it &amp; share online with #tonyhawkboxboarders so we can all appreciate your efforts https://t.co/d9P7PuQCim We just saw #fightingwithmyfamily and I guess one of us took it at as literal inspiration. Great movie, stellar cast, and a message of hope for those of us that [still] feel like outcasts.\nThank you @StephenMerchant ! https://t.co/JlptXHNJxn You can get your skateboard design featured in @SkateJam by entering this contest with @Adobe: use any Adobe Creative Cloud tool to design a skateboard deck &amp; you could see it featured in my new game AND win other prizes like a MacBook Pro #SkateJamContest\nhttps://t.co/MYdinVecSP https://t.co/nr5CzG0PpO I’m gearing up to speak at #Think2019 with @rodneymullen, coming up in less than two weeks! Tune in here to get an idea of what I'll be discussing, then register to hear us both live: https://t.co/DAl8CbQjO7 #ad https://t.co/SWjXpkyGTk Steel Mill Coffee opens tomorrow. Congrats @rileyhawk666! Serving coffee, vintage vinyl and plenty of motorcycle parking...\n605 Mission Ave. Oceanside CA 92054 https://t.co/AEuu1W3Q2c So here I am, doing everything I can\nholding on to what I am,\npretending to skate like a young man\n(barging into practice at #simplesession19) https://t.co/frGhWdGktu So fun to catch up with this Jackass https://t.co/h82319nrgn To clarify the @SkateJam announcement: it is available NOW on Android but has been available on iOS since December: https://t.co/2FbDmtzQBB 📱🕹🛹 @gavinspringett It was released on iOS in December It’s alive... ALIVE! 🤖🛹 https://t.co/W1v1UFIfcF #10yearchallenge (give or take a few consoles). While we’re on the subject: @SkateJam for Android drops TOMORROW https://t.co/AaERIiwmK1 I’ll be at @simplesession 19 this weekend on the course and on the mic (live on @redbull TV). Escape the ❄️ and join us. https://t.co/y65JyBqt8L @RossBainesArt @rickygervais @Tyson_Fury @stylebender @HamillHimself @liamgallagher Would you consider doing one for charity (@THF)? Introducing @Hawkboxboarders. Each pack comes with one Box Boarder to collect, plus one mystery TH character (includes four quarterpipes you can tape down to any flat surface).  Collect all 13 pro skaters as characters (available now at Walmart)\n🎶: @gupimusic - “Ambassadator” https://t.co/eJ9VhgJ6Ld Android version drops next week! https://t.co/t2bH02PrZp I met @jgrantbrittain when he was working at Del Mar Skate Ranch over 35 yrs ago. We’ve shot photos across the world together ever since, including this Andrecht on 1/8/19. Thanks Grant for decades of friendship &amp; for always getting the shot.\nUnrelated: new @LakaiLTD Proto color! https://t.co/QnJUcd7zMO @primus I have a question for you guys... kinda THPS related. Please follow me so we can talk amongst ourselves. 1990: I needed to get a “street” ad by @trackertrucks so I went to the legendary “School W” to shoot something. It was there that I first saw a young @willysantos &amp; eventually recruited him for @birdhouse \nStyle check: Airwalk Prototypes, nose bone, Rip Grip, Limpies bum bag https://t.co/lwh2EYSNjt I put all of @LanceMountain’s punk mixtapes from 1985 on @Spotify (these were a huge inspiration for THPS soundtracks): https://t.co/FnVfW1h7C5 I recently had the privilege to shoot with the legendary Anton Corbijn in connection with the Tony Hawk Signature Line launch. The photos are being released tonight at Paris Fashion Week alongside the apparel collection preview (available to retailers worldwide mid 2019). https://t.co/GHurAIdhsQ Congratulations to all of the #Laureus19 World Sports Award nominees! Good luck on February 18 in Monaco. Hope to see you there https://t.co/ujgYVq9zhL @gupimusic This makes me deeply uncomfortable @gupimusic Firing line! The “making of” video of @stevecaballero &amp; my @indy_trucks doubles ad with a few near misses and my sketchy-ass landing. https://t.co/djjD7xuSJL I'm excited to be speaking at #Think2019 alongside change agents and leaders who are transforming the way we work and do business. Learn more about this #IBM event, and what I'll be discussing: https://t.co/Bg4EgUQLkT https://t.co/9vyC0YXLAD I recently went Sneaker Shopping with @Complex and talked about @SkateJam. Kinda out of my element with sneaker history, but here's a pic of Mike McGill &amp; me wearing OG Jordan’s in 1986, which we colored with paint pens (from Expo 86). Episode here; https://t.co/zgOtJzzpQX https://t.co/XF6Q8CuHwM What a vert demo looked like in 1984 (at @Wittscarlsbad) #nodecks #noflat #nocares #nopay\n📷: @jgrantbrittain https://t.co/waQ1N0JR9Y Check out these inspiring videos of the @LaureusSport Sporting Moment of the Year finalists and vote for your favorite! The winner will receive a Laureus Award in Monaco next month\n\nVote now 👉 https://t.co/LuOb0WlBEE A brief summary of my daughter learning [legit] kickturns this evening https://t.co/zfnPendkoq A snowboarder, a surfer and a skateboarder walk into a car... I forget the rest of the joke but it somehow ends with all of them singing along to The Ramones... \nand Journey? #CarpoolKaraoke https://t.co/b7W3oU4xGe “All the colors, see the colors, feel the colors... now it’s in your eyes.”\nNew @LakaiLTD Protos out soon https://t.co/VCS3O1X7sw @martymath And it was delicious RT @BleacherReport: The legendary @tonyhawk breaks down some of his best moves 🛹\n\n(via @SkateJam) https://t.co/TJz4fNfl8m Only for the first few hands... https://t.co/1xLe7p9L5G Here at the @pokerstars #PSPC with my friend Norm, hoping to end up in the top 500 after the first day so I can win some money for @THF. \nI know when to hold em but not necessarily when to fold em... https://t.co/ArlpoyOT9k in 2003, I was requested to meet with Warner Brothers about doing a film tentatively titled “Skate Jam.” They were bringing back Looney Tunes with “Back In Action” &amp; then wanted to start on my project immediately. A week later Back In Action bombed &amp; Skate Jam was shelved forever https://t.co/9giKzBnlWH I get invited to screenings of new movies based on my “influencer” status. I’m very selective with these offerings, as I don’t want to recommend a movie just because I saw it free before it came out. In this case, #TheUpside exceeded expectations. It’s very good; go see it Jan 11 https://t.co/5R5wA2yLAl New year, new trick, same me\n📹: @andymacdonald https://t.co/MIcI1JUEc0 If you think 2018 was hard, just remember that we survived the eighties. Here’s to remembering old tricks in a new year.\n🎶: @Killingjokeband https://t.co/eHgCTm922J Into the trees with @mikeescamilla and his crazy Fusion camera.\nOne of us had to fall... wait for it. https://t.co/ZiBG0tRu8B @jackiburkhart81 @hudsonposton Always Sliding through a winter wonderland at @MammothMountain \n📷 (by proxy): @MikeEscamilla https://t.co/UiFkQhglDe I’m not sure if I know when to hold ‘em or when to fold ‘em but I definitely won’t count the money to @THF when I’m sitting at the table... https://t.co/2YHVaViG8g Recently joined @CaseyNeistat at his loft (studio? lair?) in nyc to discuss living your dream and @SkateJam: https://t.co/6JPLv9CaTt RT @sounddiego: Check out #Warish -- the SD sludge-punk band fronted by @TonyHawk's son, Riley. https://t.co/bZolBb6R1n RT @CCS_Skate: 🦅🎄For your holiday viewing pleasure, we present the legendary @tonyhawk doing 100 BLUNTS (on vert of course) in his @lakailt… Out on the ramps there arose such a clatter... \nhere’s to family traditions 🎄🌅🛹\n🎶: The Waitresses https://t.co/WkoShy3S9a Our gift to you: watch @birdhouse’s “Saturdays” free (on @redbull TV): https://t.co/HZgTaPVFEC @jonahrigby You got it 🛹 🎉 Check out this video from @allstate and @soulpancake that’s all about supporting and empowering youth to become the next generation of leaders. The kids were stoked to see their community vision come to life. #GoodHeartsGoodHands #ad https://t.co/jECDdTFkjw Still looking for that skateboard under the tree in 1973... I had to wait another 4 years. https://t.co/l6eoIwAc7S A failed #firingline while being chased down by Chris Gregson. This is why you always see us vert skaters adjusting our feet across the flat bottom. In this case, I didn’t because I thought the run was over.\nI chose... poorly. https://t.co/7bX4rR7IGP Come session with (or watch) @BlackPlagueBeer &amp; @boneswheels crew on Friday at @CAsk8parks TF. I’ll be there 3-5pm kneesliding to the oldies. https://t.co/97Gi4XbX89 Best doubles routine ever from @megabiskate in Ethiopia. 🛹 🇪🇹 https://t.co/jiPg4d5br3 That day I met Bart. \nFun fact: I actually broke my pelvis three years later, and @blink182 played at the first @THF fundraiser.\nSimpsons &gt; Nostradamus https://t.co/kxWUFwVlof RT @brooklynvegan: Riley Hawk (Tony’s son) fronts a stoner rock band called Warish and they’re sick. Listen: https://t.co/ZSfPK0DADL https:… Download link: https://t.co/2FbDmtzQBB Introducing Tony Hawk’s Skate Jam, a new mobile skating game with familiar controls, high scoring combos, career mode and global online tournaments. Free to play and available NOW in the App Store (coming soon to Google Play) @SkateJam https://t.co/wok3shonuF Here is my #firingline with behind-the-scenes footage of Chris Gregson working his magic. Yes, he ollied the channel while keeping me in frame; the only filmer that deserves his own video part... of him filming. #filmception\nWhile I have your attention: @SkateJam drops TOMORROW https://t.co/jT0hDB2XUR Check out my #firingline on @thrashermag filmed by the incomparable Chris Gregson.\nI think his part might have been harder...watch &amp; decide for yourself: https://t.co/f1JdHIZLdO My version of a frontside air, 1978\nI might not have made the trick but I definitely nailed the outfit. https://t.co/SXVo6ytpgw The #gamerschoiceawards is on @CBS TODAY at 5pm EST (but check local listings just in case). @KISSOnline @tomgreenlive &amp; @terrycrews among other legends. https://t.co/PpQ3cCuzzX Me trying to learn a new trick on vert\n#ladderofshame #birdup https://t.co/NphlP4YFsn @sophcolette yes.\nI mean, happy birthday! RT @NPRAskMeAnother: We are one (1) (☝🏽) (1⃣) week away from our 🌊San Diego, CA ☀️ roadshow @SDBalboa on December 12th! \n\nWith *very specia… @investinStockz Your messages have been received loud and clear. New street part coming never, new mobile game coming next week; follow @SkateJam for updates. Thanks @berrics for letting us barge today https://t.co/p877aNJeJk @FUCKIECHINSTER @jonodiener @young_hearts @HotMulligan I also liked Shred; it’s what Ride was supposed to be. @jonodiener @young_hearts @HotMulligan I’m not sure if you guys want acknowledgment or an apology, so here’s both. @gupimusic https://t.co/nlVlkHUQzx Congrats @gupimusic!\n(Working link) https://t.co/NJ9yt0ppuT https://t.co/olPK8NqHrJ I, robot https://t.co/RVoWW7Mw5f RT @THF: Only 5 hours left to bid on this one-of-a-kind board signed by @mmothersbaugh and @tonyhawk. As an added bonus, Mark (front man of… That time Otto, Reggie, Twister and Squid snuck into my Nest https://t.co/pGxlKUYcNw @AlexMarks182 @buckylasek @scvrletta What he said ☝🏼 Goodbye Stephen Hillenburg, thank you for the shared laughs with my kids through the years. We’re all Goofy Goobers thanks to you. Mistakenly challenged @buckylasek to an ollie revert / fs 360 contest &amp; went down swinging. But then came back for redemption before the pain emerged. #whiplashlife https://t.co/RXdQR5MsJB RT @THF: Mark Mothersbaugh, frontman of @clubdevo teamed up with @birdhouse to issue a series of skateboards featuring Mark's artwork. We'r… RT @nextvr: Relive the nail-biting moments in immersive 3D VR as pro skaters attempt one of the most difficult tricks to navigate on a skat… When the student becomes the teacher... of style: @rileyhawk666 (and Riley’s dad) https://t.co/xOO5Zngkuw Skate or die! 🦃🛹 https://t.co/OLiDEf7Omh @ajduggins @kaliduggins Not unless you were on the beach in Mexico yesterday @adameasterlingx @ScourgeovMan I haven’t been offered tickets to my own performance before, but I did get wrestled to the ground by a huge security guard in Paris (at my show) because he didn’t recognize me as I was walking backstage. So it’s kinda like that I suppose. Special guest @OsheaJacksonJr (with Kareema) is on Demolition Radio this Saturday (Nov 24): @SiriusXM ch 103 at 1pmET/10amPT. We talk about THPS, Tupac, and other cool sh*t. LISTEN FOR FREE: https://t.co/zKks6Da8QU @factiontalkxl  #DenofThieves  #StraightOuttaCompton https://t.co/IptzUvy39k one-of-a-kind items are up for auction to benefit @THF including a @LenWein skateboard signed by Stan Lee, original Craig Stecyk decks and a @Nixon_Now created using my skateboard: https://t.co/NOOegkKivT Now available: Bones Brigade signed decks in shadowboxes. Head to https://t.co/zBf0X6AnzI for more info. $100 of each sale goes to @tonyhawkfoundation to help build public skateparks. #bonesbrigade https://t.co/2WpadkFF44 RT @Hilar4Charity: TOMORROW. @tonyhawk x @IamLaurenMiller. FACEBOOK LIVE. 12:30PM ET / 9:30AM PT.  Tony is going to share his #Alzheimers s… Dropping in on Detroit with a new venture: announcing D/CAL a creative agency I've co-founded, inspired by the innovative cultures of Detroit &amp; Southern California. We’re looking for talent &amp; partnerships to better connect commerce with authenticity. Info: https://t.co/h8jLKdZjis Goodbye Stan Lee, thank you for decades of entertainment. 🦸🏼‍♂️ https://t.co/9pRZIVtXJ2 In 2012 I decided to piece together some random clips I had saved and shoot some newer tricks in what became my first video segment since Birdhouse’s “The Beginning” in 2007. Here are some highlights. \n🎶: @Pixiesofficial - “The Sad Punk https://t.co/88htRw1v3t @TrashHeap64 My friend worked with Run And Gun in Chicago, and they were doing an ambitious CD-Rom game. I went to visit him while on tour (96?), and the developers asked if I’d do a cameo for it. They gave me strange lines without context. I liked their other work so I agreed. It took 5 mins @TrashHeap64 what would you like to know? It's a very short story... I partnered up with @Metallica’s All In My Hands Foundation to offer a private VIP skate session / demo / lesson (your choice) with me &amp; other pros. Bid here: https://t.co/xaWhAVhIR6 RT @IamLaurenMiller: I’ll be talking with @tonyhawk about being an Alzheimer’s advocate tomorrow at 3pmESTon @Hilar4Charity’s Facebook. Wil… I don’t know the complete story here but it looks like Renan Prasido wanted to skate despite his physical challenges so Studio Neuro built this device, @MatrizSkateshop gave him a skateboard &amp; @CezarGordo taught him f/s pop shuvs, making one of the best skate clips ever... https://t.co/4ZE4zBMLiK Happy [belated] Halloween from Ruth and Riley (and Riley)\n📷: @jgrantbrittain https://t.co/aZiw8HVDmi We have arrived... 🛹 \nThank you @jeremyburge\n(Update your iOS ASAP) https://t.co/OJCGw3IV5F @silenthooper I appreciate the hesitation though Guy asks for a picture with me, woman nearby says “I don’t know who you are”\nme: I don’t expect you to\nher: what do you do?\nme: I’m a pro skateboarder\nher: are you from Huntington Beach?\nme: no, I’m from San Diego\nher: so you’re not that guy with red hair that won the Olympics? @n3r01 @TwitchCon No but the terminal looked like this...\ndogs and cats living together, mass hysteria https://t.co/DDCKEA1Et2 @AllieJnorth 🎂🎈🎉 (does that work?) Here lies my street career: 1992-1994, beloved son of a fledgling vert scene\n🎶: Peter &amp; Test Tune Babies - “Blown Out Again” https://t.co/LQ9MGL9FUy Tomorrow at Alex Road (aka Prince Park)! Watch me try to skate the square bowl like a vert ramp... while the @LakaiLTD team rips it up. https://t.co/Ejk8KWqkuc RT @TwitchCon: This #TwitchCon, gather ‘round for inspirational stories and career advice from @tonyhawk, @thatkevinsmith, @feliciaday, Emm… Thank you @KSWaveCo for the waves and hospitality beyond compare during our family surf adventure yesterday. \n#sopitted #soextravagant\n📷: @CameraJesus https://t.co/UYrUCxliNb Thanks to @signalconf for inviting me to speak yesterday, and for bringing my ramp along for the ride. I’m much more comfortable on this stage btw... threading the needle between @plronchetti &amp; @andymacdonald for the @twilio crowd.\n📹: @dupedupe https://t.co/zAGzWNbEhG Full competition run from Tracker’s “The Brotherhood” video (1991). I was only supposed to film for Bones Brigade stuff back then, so my other sponsors had to use contest footage if they wanted to include me in their videos. Unrelated: Cab disaster reverts can be deadly. https://t.co/pCsyAiG9CI I encourage you more than ever to register and VOTE for the sake of democracy on November 6. Until then, I encourage you to VOTE for @DEVO to be inducted into the Rock &amp; Roll Hall Of Fame! Unlock your secret voice for these punk pioneers: https://t.co/fmgjIrWGlg RT @HillarySawchuk: Thank you @tonyhawk for being just as pumped about #Detroit as we are. Read, listen to full podcast interview or watch… It was an honor hosting @scottharrison &amp; @charitywater Well Members at my “office” tonight. Congrats to Scott on being a NYT best-selling author (as of today!). His #ThirstBook is a gripping story of his journey from shallow club promoter to becoming a revolutionary humanitarian https://t.co/FGIOqmZdlF I’ll be speaking and skating (separately; not simultaneously) \nat the @twilio #SIGNALConf in SF next week. \nMore info: https://t.co/tgsr4oQzE6 https://t.co/ZUlPBK6tgw Thanks to Jeff Grosso for including me in the Love Letters: https://t.co/r4tUZizBhx me: sitting near my gate, waiting to board\nguy: sits next to me &amp; shows me his phone with pictures of me visible\nhim: \"Is this you?\"\nme: \"yes, but some are less than flattering\"\nhim: \"I'm gonna tell my son\"\nme: \"that you did a Google search?\" I wrote a thing about skating in the Olympics... https://t.co/E8BBkJu25N Drop in, flip out https://t.co/5jEDcrx5IF Thanks to @TheKills for hosting us last night. Great show! Go see them with @Interpol if you have the chance... https://t.co/NsuALaMxw8 Wow @amandapalmer coming through today with a timely, poignant video (NSFW): https://t.co/2pZY1ugDp9 RT @questlove: Took all these decades to embrace &amp; reverse the name calling I endured from childhood (still a battle to not internalize the… The names I was called never defined who I became. Please share this film https://t.co/NZthqy6qBd and join me + @MonicaLewinsky (among others) in adding a name you were called to your Twitter profile. #DefyTheName 1987 segment on @ABC10 about skating feat. @rodneymullen @tommyguerrero &amp; @stevecaballero. Thanks to @michaelanthonyadams for uncovering this nugget. #slideandrollcurbs https://t.co/JESsRDiZxC This is epic https://t.co/BAJsNJDBxk @MichaelAdams317 @ABC10 I would love to see the whole thing! Skateboard emoji might be more relevant than skateboard Olympics https://t.co/Eaot9hYA3m Fun dinner and fascinating conversation with these talented women, discussing Nick Cave, The The tour, being high school outcasts, skating in Olympics and Amanda’s upcoming record. Watch for her new video dropping Friday! #bankofbostonbeautyqueen https://t.co/zAmvpKOFZL Shooting this reminded me of a day filming Animal Chin; renegade skating and improvised dialogue. https://t.co/jUsOWB3mZk Thanks to all those that attended and/or supported our 4th annual @THF East Coast “Super Session” today. A heavy crew came out to raise funds for public skateparks... and rip.\nAll photos: @JodyMorrisPhoto https://t.co/jFOLNmXXfA Guy at airport (loudly, from afar): “Hey, you look like Tony Hawk”\nme: turning to see him\nhim: “haha, I read your Tweets!”\n\nIs this the beginning of the end?\n#tweetception Here is the @LakaiLTD Proto promo by Manchild featuring Animal Nuge &amp; Jimmy WilkChins. \nWe Have Seen Him:\nhttps://t.co/CHY17z6EZX My signature @LakaiLTD shoe “The Proto” drops today. We’ve had a blast creating content surrounding the release, including this photo by @jgrantbrittain reminiscent of my original 1986 Airwalk, and a video with Animal Chin cameos: https://t.co/isqhDRjCi4 https://t.co/SDTRFfQqq7 Thanks @LaureusSport for highlighting skateboarding (and @Lizziearmanto) in this way https://t.co/RQg9tHQX2W Doubles with #markgonzales this summer, shortly after we both turned 50. Our faces show how stressful it is to synchronize a grind under a boneless while AARP beckons.\n📷: @pepkim https://t.co/6Rvr1qlPAK @hunicke Good to see you too! Japan Air at the last stop of our @LakaiLTD Japan tour. Thanks to the team for being so supportive and to everyone else that showed up to share the stoke. ✌🏼🇯🇵 \n📷: Rick Howard &amp; @oakernie https://t.co/LEDPmfxIfr RT @NigelBarker: This is not a video game character, well not exactly... it’s pro skater, legend @tonyhawk bringing the magic for my new bo… @JohnLegere Sounds good, magenta it is I’m trying to help my friend MC Bat Commander #BringBackTheAquabats. We’re gonna skate together soon &amp; YOU could join us. Donate $5 or more to their Kickstarter campaign &amp; you can win a chance to skate with us! \nGo to https://t.co/CK0vBFOsfm &amp; help revive @theaquabats Super Show Thanks to everyone that organized and/or attended our @LakaiLTD “Proto” release party last night in Tokyo. I’m honored to be the name behind this design, and I truly appreciate the support. Shoe drops next week. Learning Airwalks is suggested but not mandatory if you buy a pair. https://t.co/U1YfZww7kj I hope these guys signed the Rainbow Road waiver\n🍌🐢🍄💣⭐️ https://t.co/5YR4FIPbEp I never imagined lunch with @Sethrogen would be a serious discussion about Alzheimer’s treatment &amp; prevention, but I’m thankful to be connected with him &amp; Lauren for #hilarityforcharity. Fun fact: the TMZ tour bus drove by as we shot this photo &amp; abruptly stopped, causing a scene https://t.co/Jg91g1hHcr We loved it! https://t.co/QP1i2WmEPG Those affected by #HurricaneFlorence will need our immediate help.\nPlease donate to @SalvationArmyUS at https://t.co/7xIFZvAJmL \nor text STORM to 51555 #HurricaneFlorence Tomorrow on Demolition Radio: the raw &amp; prolific @MichaelRapaport !\nShow airs 1p ET / 10am Pacific, replays 12a ET Sunday and 10a ET Sunday, then again at 7pET on @siriusxm Faction Talk 103 https://t.co/kittg6B9l5 Catwalk shove-its are so hot right now. https://t.co/mymkNQNAIW High fashion! Thanks @Laureus_USA for facilitating my runway debut (yes, I skated down the catwalk) https://t.co/BzL7efkcU8 My signature @LakaiLTD shoe (The Proto) will be available very soon. Sign up at https://t.co/AhBFhBJnIu to receive exclusive updates and information about the release and where to find them. #flarewalk https://t.co/se1HilwqHU “Hey you... \ndon’t watch that; watch this”\nThis is #whiteboyrickmovie, a very good movie that genuinely captures Detroit in the ‘80s like no other; a tragic story told in an honest way. https://t.co/qXMyvpyfBK Thanks Danny! I enjoyed our heavy conversation. https://t.co/xhnsuKOVTr I just published “I visited my mom today.” https://t.co/BJJMX8TaYt Goodbye Burt Reynolds. I thought Hooper was the coolest in 1978, especially when Jan Michael Vincent showed up on a MotoBoard. \nThanks for all the laughs. And Boogie Nights. https://t.co/sVJAWOXknm THDJ commercial 2006 with @mikevallely @staabpirate1 @grampagram @Johnedale \nFun fact: the original cover artwork had me regular footed because the artist liked how I was facing better. After a lengthy discussion, we settled on this angry squat stance... but at I was goofy-footed https://t.co/ZOcPXTcFqC @tmckenna1 @vansskate @Lizziearmanto @nowthisnews You can use mine My shots of all @lizziearmanto’s loop attempts once we removed the stunt pads. Last angle &amp; phone retrieval: Rodrigo Leal (because I tossed mine in the revelry). https://t.co/FCsGpVvJR1 I talked to Felipe Nunes during his first trip to California about losing his legs, discovering skateboarding, and what motivates him: https://t.co/2uEI25IYE3 My kind of challenge: \nskating across America as a fundraiser for a skateboard museum...\nhttps://t.co/YPn9YuD6rw 🛹🇺🇸 Very cool article about @Lizziearmanto’s loop conquest on @thrashermag:\nhttps://t.co/xxwxvr5YXx Thanks @amyjomartin for including me, and to  @sarahhallprinc for setting it up! https://t.co/VOx7lv12Kb Congratulations to @Lizziearmanto on becoming the first woman to complete the infamous loop yesterday. She pulled it just after our @nextvr event ended. It was an inspiring display of fierce determination and skill, and we at @birdhouse are incredibly proud. https://t.co/8ekbUrxkOr RT @nextvr: DID YOU SEE THAT?! @jeromygreen COMPLETED @tonyhawk's Loop Challenge! 🎉 It was even cooler in VR 😉 #HawkLoopInVR https://t.co/X… Here’s Felipe Nunes getting a test run in preparation for our live loop challenge, tomorrow at 3:30pm PT, only in the @NextVR app. #HawkLoopinVR https://t.co/Wn7sdooH4O RT @nextvr: TOMORROW: @tonyhawk will be hosting \"Loop Challenge LIVE\" in virtual reality at 3:30pm PT! Pro skaters will attempt one of the… My brief history of looping, made for BBHJ tour when we added one to the show in 2003. On Sunday at 3:30pm PST a whole new crew will be trying it for the first time. You can watch it live for free on any VR headset or on your phone through the @nextvr app. 🌀👀 https://t.co/TrMacuwkrn @rhydjones @_DHOTYA Travel with me for a day. You’ll see. I had a blast skating a legendary clover bowl with @MikeMcGill_ while shooting this video for our friends at @HomeBayinc. #HomeBay is a local San Diego startup with technology that helps people who are ready to buy or sell a home save money.  #ad #realestate #thehomebayway https://t.co/Yua4lW9p92 TSA agent (staring intently): I’m trying to figure out who you look like before checking your ID.\nMe: ok\nTSA: that cyclist Armstrong!\nNearby agent: that ain’t Lance Armstrong \nMe: he’s right\nTSA: oh you look like that skateboarder (checks ID). Same last name too! Crazy!\nMe: crazy One of my favorite correspondents from @TheDailyShow has his own sitcom. Congrats @ronnychieng! Watch it now with no strings attached (aka “signing up”): https://t.co/gHsdawsUx5 The powerful, touching documentary Minding The Gap is now available on @Hulu &amp; select screenings. I can’t recommend it enough. Congrats to Bing Liu on capturing this important story of three friends that find salvation from their abusive childhoods through their love for skating. https://t.co/unHiF8nMY0 Living la vida boat-a with Kady, Calvin, Miles &amp; Catherine thanks to @Tommys_Colorado &amp; @malibuboats\n#wesarf #sortapitted 🚤🌊\n🎶: Surf Punks - “My Wave” https://t.co/YbhwB06n6e Thanks to @Tommys_Colorado for lending us one of your incredible @malibuboats, giving my daughter an opportunity to surf for her first time ever. #armpitted https://t.co/sWdUGUXaC3 I'll be hosting a Loop Challenge LIVE - in virtual reality - on Sunday, 8/26 at 3:30pm PT with a handful of brave skaters that have never done it before. Just download the @NextVR app on your #VR headset to experience it for yourself. #HawkLoopinVR https://t.co/C4snInzAEZ I'll be hanging with Rodney Mullen and @IBM at #VMworld in Las Vegas in a couple of weeks, talking about innovation and perseverance. \nCome join us! Info / tix: https://t.co/lqHDhi4U4f https://t.co/SMZNvA3jNh Congratulations @lizziearmanto on her last run win at #nitroworldgames just moments ago! \nYour @birdhouse fam is very proud. https://t.co/9vsSLh1rqR To infinity and beyond the corner: @coryjuneau at #nitroworldgames yesterday. Finals start today at at 11am PT, right here: https://t.co/mXMNOKJGWA\n📹: @jamiemosberg https://t.co/IdbOlHBaWF The #nitroworldgames are live now!\nhttps://t.co/RAcqoR6xup The @birdhouse team at Linda Vista skatepark last weekend (via @RideChannel): https://t.co/Tz0D51CRl5 I just left two tickets to the upcoming @WSL Surf Ranch Pro along this legendary surf trail in an envelope. Go now! Whoever finds them gets 2 passes to see some of the best surfing on the unreal wave, plus a headline concert in the middle of California next month. ⚙️💦🏄🏽‍♂️ https://t.co/2XQ7hlrLTy Just saw #SearchingMovie (starring @Johnthecho &amp; @therealdebramessing) and I am shook. It’s a gripping, clever thriller experienced through our breakneck era of social media. I highly recommend seeing it (opens everywhere Aug 31), and maybe checking your kids’ webcasts... https://t.co/EW0tX113GV @Salf0rdRed You win! @bekuhhh It was not. I skated Del Mar for years. I never got to visit the park I’m referring to @_samliu_ Noooo there were a few. But only one other  that I wanted to skate P.S. the screening is in San Diego area... very soon. So you gotta live close. I have a pair of tickets to a screening TONIGHT of #SearchingMovie to the first person to answer this question correctly: the first skatepark I ever visited was Oasis in 1978. I tried to go to another SD skatepark but I wasn’t old enough, and it closed shortly after. Which park? The @birdhouseskateboards team will be skating Linda Vista park at 1pm today. It might get crowded so please respect each other’s space and leave some room for us to get rad.\nEvery day is [not] like Sunday. https://t.co/3aC6mOonQJ I asked Felipe Nunes - on his first trip to California - l if he’s ever dropped in on vert and he quickly replied (in Portuguese) no but he wants to. So today he came to my ramp and this happened... without any hesitation. This dude rips. https://t.co/nbtmsgTyr7 Thanks for including me Lewis! Our full interview is now available (link below) https://t.co/FCZSUqAbS4 Nice little Sunday in San Diego!\nCome watch us shred some gnar at the Linda Vista Park.\nIf it gets crowded, please respect each other and make room.... because we are going rogue with this demo. https://t.co/QhBMHTZaHi Happy Birthday to the dude who keeps dropping in on me whenever we skate together: @andymacdonald \n(from our first “doubles” video, 2012)\n🎶: The Dead Weather- \"Cuts Like A Buffalo\" https://t.co/ntMADngYSm March 13, 1998: Gap commercial with @andymacdonald &amp; an army of inliners. Fun facts: I got sideswiped by George Clooney’s [then] gf on the way to the studio, and then broke my elbow on a bs 180 over the launch box during the shoot. Luckily this Indy stiffy made the cut so I got $ https://t.co/66SDpr8Aza Just returned from #partyattheponds, a gathering of diehard vert skaters that reminds me of a simpler time in skateboarding; misfits getting together, listening to punk &amp; encouraging each other to push their limits. The hairs are grey but the passion is timeless \n📷 @CameraJesus https://t.co/29uWdtqVws When worlds collide over trick names: https://t.co/Yr4Az8PcTK So much Pop\n(available soon from @originalfunko) https://t.co/n0JbX7rIa3 We have a new @THF program of Skatepark Ambassadors, encouraging people to share stories of how a skatepark has affected them. Just got this from @steveo:\n“If I had access to a skatepark growing up, I might be able to skate more stuff than a stupid coffee table” #skateparkstories https://t.co/gGLqjsHKeB Tickets available now for #pathwaytoparis in downtown Los Angeles on Sep 16, raising awareness and funding for climate action. Join us! https://t.co/hifooliARj 1990: I was featured on SK8TV, musing about the distant possibilities of Gnar Jars and 900’s. The future was so bright, I had to wear bad shades. https://t.co/tTtgUTE349 @mrpixelface I hope it is a life well lived @MrMonoMendez I send you a signed deck, as promised Thank you @Xtheband for 40+ years of legendary music. Los Angeles was the first X song I ever heard (at the skatepark, in 1980), so this recording of last night’s performance goes out to all the THPS / THUG2 fans https://t.co/ZMm3AmD6L1 All of these things are true. \nCongrats on the movie! @rileyhawk666 &amp; I enjoyed it very much. https://t.co/ZdJy69Zx9V I just got samples of my upcoming @LakaiLTD signature shoe and I'm too hyped to keep them a secret any longer. So I'm going rogue and sharing them here &amp; now: introducing The Proto, available September at skate shops. https://t.co/tDIxgJZqpZ Congrats to @DavidSpade on #fatheroftheyear movie available soon (now?) on Netflix. I would recommend you go see it... but you don't have to go anywhere to see it.\nWatch it asap, so funny. https://t.co/J3Rx7YHK7i an online auction to benefit the education of Dave Mirra's and Kevin Robinson's children (with some very cool items): https://t.co/OhZrnIXMIy Pulled off a surprise remodel for my dear friend Kerry and her family (in honor of Ray Underhill) on the latest My @houzz : https://t.co/PFeOOUYrrA @480G1 Haha you kinda look like the guy. Thanks for the kind offer! @480G1 Haha no worries, I liked the encounter. Thanks! @AlexGam2013 I try to only share the entertaining encounters Guy at grocery store: \n\"you ever get mistaken for Tony Hawk... or are you Tony Hawk?\nMe: both! My signature edition Triple Eight Certified Sweatsaver helmet has dropped (well, not literally)\nI mean, it’s now available: https://t.co/G8hQdQQkjL\n📷: @CameraJesus #thecertifiedsweatsaver Flight attendant checking overhead bins, sees four skateboards\nHim, jokingly: \"is Tony Hawk on this flight or something?\"\nLooks down, sees me\nHim: \"I guess he is\"\n🛹🛹🛹🛹 On July 18, Minneapolis will host a heartfelt fundraiser for the children of Dave Mirra and Kevin Robinson. Tix still available: https://t.co/uifLnMF4Xo or donate directly to the education fund: https://t.co/mTsgTQFAMK https://t.co/m7u9OiZmys Goodbye Switzerland, thanks for the extraordinary scenery &amp; hospitality 🇨🇭🧀🔪🍫 🛹 &lt;-- skateboard emoji!!! (as seen from a desktop) https://t.co/Py8YZtSaTb Update to my last Tweet: skateboard found by Jannick Burri (via Insta) https://t.co/kmyi3x527Z I just left my skateboard on top of the ramp at this skatepark in Zurich. Finders keepers, reply with the hashtag I wrote if you get it. https://t.co/njO5zOaHyG RT @blurppy: .@OriginalFunko first look:  @tonyhawk figure, \"The Birdman\" gets POPPED!  https://t.co/jftdHU3ZUj https://t.co/u2yu6bKxhG RT @sbjsbd: Our new Portfolio section showcases the dynamic personalities of the industry and delivers engaging lifestyle content. We kicke… @elocinardnas I'm sorry, I'm just bad at high fives The hills are alive... \nwith the sound of [goth] music https://t.co/BgWgNxPHRm I was part of a very special project recently. Stoked to share the big reveal next Tuesday... Thank you @_TWDY_ for inviting us to tag along to the @thecure 40th anniversary show. We were spinning on that dizzy edge the whole time. And congrats 🇬🇧⚽! https://t.co/mIupxycbQC Thanks @PostMalone for helping me carry all these skateboards through customs. https://t.co/KQRJPXSrfL That night in Paris when we skated at the Grand Palais and @lynzskate made history by being the first girl to land a McTwist. #femmefive https://t.co/73COBcyVkd Skating with the @birdhouse crew at @TransWorldSKATE in full 360 VR to the soundtrack of @goldfingermusic (of course): https://t.co/k4rm2uWMYC\n(watch on mobile or VR headset on @_VRTGO) @zaclw Stay strong and get well soon! Me trying to rekindle my street career before Tokyo 2020 🇺🇸\nAlso: Happy 4th! \"If we don't get some cool rules ourselves, pronto, we'll just be bogus too\" 💥 https://t.co/YztWfgGdiv I was shocked to recently hear more than 100 million Americans have high blood pressure. Staying active (like skateboarding) can help lower your risk for heart attack &amp; stroke. Talk to your Dr &amp; check out the tips from @American_Heart &amp; @AmerMedicalAssn at https://t.co/Jp3DpbhhpC https://t.co/UMIhXvAspo RT @watch_sitv: We spent a day with @TonyHawk for our Where Are They Now issue and tried to recreate some of that 90s skate mixtape magic… Some clips from back when I used to do commentary at X Games and sneak into practice sessions in between events. 📹: Aaron Brown https://t.co/KUNGpyQUUY RT @SInow: “Oh he got old. No, I was already old!”\n\n@Tonyhawk turned 50 this year, but he’s not slowing down: https://t.co/mCKD8yZGJ3 https… Where am I now? \n@JacobFeldman4 spent a day with me to answer that question for @SInow. Spoiler alert: raising kids and still skating, among other things:\nhttps://t.co/bdQCaw2yZ6 @CiaranDunbar @jayfrankparnell Yes Spent our day visiting a film set (rhymes with Shame Of Drones) &amp; checking out Belfast skatepark. I sometimes get asked what happens if I show up to a park unannounced; well here you can see it in real time. Good to meet you guys, thanks for the warm welcome!\n📹 @jayfrankparnell https://t.co/XYPGdMGyuI It's available on demand via @SIRIUSXM app https://t.co/B8uTISrcVQ Thanks for the pic @ScobeyMK \n(at @RAWcycles yesterday) https://t.co/yVrUOz2kC9 RT @PBSSoCal: Legendary skateboard, and Southern California native @tonyhawk recently turned 50. To celebrate? 50 tricks that put him, and… Practicing my lines for Tokyo 2020 with Gav Coughlan &amp; John O'Connor \nThanks to @RAWcycles for hosting us 🇮🇪🍀\n🎶: Waterboys - \"World Party\" https://t.co/07nn7kW8QM @Niall070115 You did Happy #goskateboarding [to your gate] day. You never saw this btw. https://t.co/Msw2BJxnGL @MichaelRapaport Confirmed To clarify: my legal name is Anthony\n\nTSA agent checks my ID, looks at me, looks at ID, looks back at me quizzically and loudly says \n\"Tony Hawk's my favorite skater\"\nMe: I’ll tell him. Tour the new, expansive Linda Vista skatepark through the shredding of @andymacdonald: https://t.co/qy6vlI7X20 (via @RideChannel) \"Hey dad, I ran into the gate with my car by accident. You should come out and look at it.\" \nHappy Dad-ambush day. https://t.co/5TJ6Poowhd I just learned that nearly half of the US adult population has high blood pressure. Talking to your doctor &amp; increasing physical activity can help manage it. Doing something you enjoy (or once enjoyed) - like skateboarding in my case - makes a difference. https://t.co/K1Yr5qTFfW https://t.co/jMwZEFgJ5C Vertical pairs dancing with Shawn Hale for #birdhousesaturdays\n#bladesofglory https://t.co/z8D2cvcSFM @eddytheaxe @MonicaLewinsky I stand corrected @jeremyburge Yes! I mean... how do I see it? @airbender106 Anytime! We can plan something or apparently you can just call the airlines and ask them where I'm going next 🤨 @BodMonAtkinson No hard feelings, I enjoyed our brief time together! @MonicaLewinsky I haven't had that one (yet)! @BTHerman Love that place! guy on escalator: Hey are you Tony Hawk?\nme: yes\nhim: you still skate?\nme: yes, quite often\nhim: but you're not that recognizable!\nme: I'm not sure what that means... but you recognized me, so here we are\nhim: [blank stare]\n- escalator ends - Montreal! We're coming to @jackalopefest with my vert ramp and the legendary Matt Hoffman. Info / tix:\nhttps://t.co/3mySkPUjt3 Thanks @colinmkennedy for digging up this clip of 6-year-old @rileyhawk666 's first kickflip\n(from 411VM, Nov 1999) https://t.co/Dg2beq6DVU I was honored to be the 100th guest of @thenineclubshow!\nWatch all 146 minutes of our deep dive interview if you dare: https://t.co/fYq5wQQrRU Detroit! I just hid my used skateboard behind the trash can in the lower right of this photo. Go now and reply with the hashtag on the griptape https://t.co/n3fjNm6jsL Favorite moment of our Detroit demo today: Dan Mancina's warmup 50/50 (yes, he's blind) https://t.co/zzk64zQGu8 Thank you Anthony Bourdain for your spirit of adventure, your appreciation of diverse cultures, your sense of values, and for bringing attention to the skate scene in Ethiopia. You will be dearly missed. As @davidspade put it: \"It's a rough world out there people. Try to hang on\" https://t.co/AlDwL5Ntc4 July 18 in Minneapolis: a red carpet event &amp; benefit for the children of bmx icons Dave Mirra &amp; Kevin Robinson. Auction items include my [other] skateboard used in the #50tricksat50 video, which will also be available for online bidding soon. \nTix / info: https://t.co/uifLnMF4Xo https://t.co/u7DIuQ2klH It's so rad in The D\n(@rileyhawk666 @aaronjawshomoki @SamarriaBrevard &amp; Clive Dixon will be there too) https://t.co/mOR6haFRe4 My brief career in \"park\" competition: Coastal Carnage, 2011\nMcTwist The Shark is the new Jump The Shark https://t.co/kEfZbWFOhB Just left Birdseye Kitchen and I realized it might be the only place to get authentic Thai, Lao &amp; Vietnamese cuisine with the soundtrack of bands such as Buzzcocks, Rezillos &amp; PIL.\nSee / hear for yourself: https://t.co/8zdyU9tSeg @thephysicsgirl @rodneymullen You did great! Would love to have you explain vert skating in scientific terms... Watch @rodneymullen break down the science of an Impossible with help from @thephysicsgirl : https://t.co/7WFmrCKHhU It's a challenge raising boys in an era when @realjknoxville does his own stunts- and breaks his eye socket - for #ActionPoint. I don't condone such behavior (as far as they know)... but we love watching it. https://t.co/WRDDgsVcuz Happy 50th to the incomparable Mark Gonzales, a true pioneer of modern skating. Here we are a couple days ago in NYC trying to stay relevant as quinquagenarians: fs boneless over fs grind\n📷: @Weston_Holden https://t.co/cdfkCURC1Q Detroit! Come watch this crew rip on  June 9 while I attempt to rekindle my street skills. Thanks to Library Street Collective for setting it up. https://t.co/fLQQJxxvxb Caught up with @nealthompson to share stories about the challenges of raising \"free-thinking\" boys who love skating. His journey is documented well in \"Kickflip Boys\" - a raw &amp; relatable account of towing the line between friend &amp; mentor to kids determined to carve their own path https://t.co/Cwefv7vaNC @MaddieMaeDavis @RagebertVargas I was also joking. I'm old and I embrace it. But how much you wanna make a bet I can throw a football over them mountains? But... these ARE my glory days!\n(I am a middle-aged dad though) https://t.co/Jb3sQ8KqSd I forgot how much fun it is to skate with #markgonzales. Here we are at Chelsea Piers this morning... \nOur combined age is 100 btw.\n📹: @tiaromano https://t.co/QMRsrFqwDi Special guest #JonHamm joins us for Demolition Radio this Saturday (5/26) 12p ET / 9a PT on @SiriusXM channel 103 - @FactionTalk103\n(FREE on the app until 5/29, including past episodes) https://t.co/WuBKmOnYZo One hour left to bid on my skateboard used in the #50tricksat50 video: https://t.co/M0Gt1v5zeP I got Funko Pop'd! \nMore info: https://t.co/FJdsMHqjBJ https://t.co/hLPQKwO96q June 2009: I went to the White House for Father's Day event &amp; skated around a bit. Some pundits got upset, saying it was disrespectful (even though I caused no damage &amp; kinda had permission). I don't regret it &amp; would do it again.. but I doubt it would make the news cycle anymore https://t.co/Ici6oovVPX My board from #50tricksat50 is still available, portion of proceeds go to @THF . You can probably feel my exhaustion radiating from it: https://t.co/M0Gt1v5zeP The @rileyhawk666 x @myMotorhead collab by @LakaiLTD is now available at https://t.co/3LiS5TUaDy ♠ https://t.co/Dl7M0ONHtT We got a sneak preview of @knottsberryfarm's new \"Hangtime\" coaster last night. It was like dropping in on over-vert straight into multiple twisting loops. So basically just like skating... in your dreams.\nScary fun. https://t.co/KT8z7oahzM Spoiler alert: my #50tricksat50 video was not shot all in one day...\nI'm auctioning one of the two skateboards I used and the custom color shirts I wore on eBay; portion of proceeds go to @THF\nhttps://t.co/M0Gt1v5zeP Getting so(rta) pitted at #wslsurfranch alongside Eddie Vedder @kellyslater &amp; @shaunwhite. Thanks to @wsl &amp; @kswaveco for this incredible opportunity. I promise to stalk the Surf Ranch gates respectfully in the future. ⚙💦🏄🏼‍♂️ https://t.co/XUP4LPgKd8 Showing off my new teeth in 1982\n(they didn't last long) https://t.co/eeL1vYVL2w I still think this all might have been a dream... https://t.co/cl2ylXTRGw Thanks to @_TWDY_ for this 10th anniversary show to benefit @THF! \nDetails: @BellyUpMusic, June 18. \nGA tickets start at $25 with exclusive raffle items. Tix/info: https://t.co/a5hUtjCg0y https://t.co/6HMbl4L9TT It was indeed, and your cake was the icing on the... er, you know what I mean. https://t.co/GswIa7d1Ed Thanks to @skateistan and and the kids at their Johannesburg school for this sweet message, and congratulations on 10 years of making a positive difference in the most challenged communities! Please support their profoundly important work: https://t.co/duNHjBI59d https://t.co/3JSUe4mbhb If you watched my #50tricksat50 video and noticed the 720 mishap, here's what [literally] went down that day. You'd think after 15 years of riding the same ramp, I'd know how to avoid the gap in the middle... https://t.co/sNVPMSPT2A My mom taught me to believe in myself &amp; the value of perseverance. She was a teacher for decades &amp; received her doctorate in education at age 60. Now she has Alzheimer's &amp; rarely recognizes me; it's crushing. Hug your mom or call her today; she could be gone before you know it https://t.co/ilbCA1IUuf Thanks for documenting this once-in-a-lifetime experience yesterday @toddglaser! Getting my first backside barrel was a birthday gift beyond compare. \n@kswaveco @wsl #wslsurfranch https://t.co/6OvVQ391Dt Here’s that #50tricksat50 video thing I promised. Thanks for all of the support over the decades, but I’m not done yet... \nhttps://t.co/pPJJHwfrEk @withwhatever @RideChannel You know it My early birthday gift: getting #sopitted with this crew. ⚙💦🏄 @kswaveco @wsl #evenflow 🎂 https://t.co/ukcJQWei0f I'm almost 50. I never imagined being able to skate at this age, or that anyone would still care if I do. To celebrate, I did 50 tricks that I've created. #50tricksat50 video drops tomorrow on @RideChannel. Thanks to all of you that made this dream possible.. but I'm not done yet https://t.co/VajsU0NT7G And to think I was YOUR stunt double... Why didn't you ever teach me this? https://t.co/otoudr3yrV @jazzblasterr @plastcfl0wers Happy Birthday! Sorry for the delay; I wasn't on Twitter yesterday (for shame) RT @TimMarcin: I talked with @tonyhawk about turning 50, his career in skating and being on The Simpsons. (Oh, and also fans wanting to sha… @that1_shyguy This would be me Tweeting at you @angeInews Yes, as long as you proofread it. @skrongmeat_ HAPPY BIRTHDAY! 🎈🎉🎂 \n(I expect the same next weekend) Here’s a trick that I was unable to recreate in my upcoming #50tricksat50 video: fast-plant McTwist. \nEdit: here’s a trick I haven’t tried again since I only made it twice... \nin 1995 https://t.co/4TVkeEwlv5 Not sure how we got all these A-Listers to come on Demolition Radio recently but I’m not complaining. Hear our interview with @nbcsnl alumni Jason Sudeikis tomorrow (5/5) at 12p ET/9a PT on @SiriusXM channel 103 @FactionTalk103 https://t.co/9BhgbdfVLN I’ve been busy lately documenting 50 tricks that I’ve developed over the years for a new video. It’s been exhausting but cathartic. Here’s a stale 5 from last week, as featured in the new @transworldskate. Thanks for still believing in this aging skateboarder; video drops May 12 https://t.co/VAgzF0v9lX Today we brought supporters of @THF to Hilltop Skatepark to show them one of the 588 parks that we've helped create over the last 16 years. We also brought Jaws, @rileyhawk666, Clive Dixon &amp; @Lizziearmanto to do stuff like this... https://t.co/whEsDvPHXu Took this headshot in 1986 and never felt the need to update it.\n📷: @jgrantbrittain https://t.co/bZjMx8XZmd Hear my Demolition Radio interview with masterful chef @MVoltaggio now: @SIRIUSXM channel 103 (on demand) #factiontalk https://t.co/tCJ0KLJwJm RT @VG247: We spoke to @tonyhawk and Neversoft about the fascinating story behind the creation of Tony Hawk's Pro Skater. https://t.co/eYVw… kinda jealous of my son's collab... https://t.co/J6A6IAXAYX There is really nobody more qualified... https://t.co/y0rvZw6LDV When @WayneBrady says kickflip, you better kickflip.\nPrimo anxiety level: 📈\n(from @cwwhoseline) https://t.co/hXJWBv8XHz This is one of the best films of 2018. Go see it ASAP. https://t.co/6ADZSudREF This version of @Millencolin’s “No Cigar” by @AdamFrenchUK is the acoustic cover that THPS fans needed in 2018: https://t.co/C24X5ovHEg Hear a new Demolition Radio this Saturday April 28th at Noon ET / 9am PT featuring the prolific @JuddApatow on FACTION TALK: SiriusXM channel 103. Special thanks to @samjones for lining up this dream guest! We’re not worthy. https://t.co/DlprSUKhMS The moving documentary @MindingGapFilm about three skaters from Illinois escaping their volatile families is playing tonight in San Diego: https://t.co/BTue6iFBLw \nI highly recommend seeing it if you can; wider release coming this summer RT @LagunaBeachUSD: Check out this video @tonyhawk and our friends at @LagunaBeachPD put together to launch the anti-bullying campaign, It… I sat down with @ArianFoster recently for his \"Now What\" Podcast and we had a blast: \nhttps://t.co/vzonxIVmPi\nThanks for including me! Thanks for all the laughs, generosity and heartfelt support, @VerneTroyer; I will always be a big fan, and it was a huge honor when you bought my used shoes and skateboard at our @THF auction. https://t.co/hv1F2LLpjd June 18 at @BellyUpMusic! https://t.co/Jtv1xvTN4N Nearly 30 years after the original #HELLofaParadise miniramp event in Hawaii, @thrashermag has rebuilt the ramp on the shores of Waikiki this weekend. I'm sorry to miss it. Here is one of my runs from the 1989 contest, when spines were cool and going switch was a new thing. https://t.co/pZiUNWdbgB Hear @Lizziearmanto muse about the Olympics, being a reluctant role model and teaching girls in India to skate on the latest episode of Skaters In Cars with Chris Nieratko: https://t.co/oh82dDMPag Alison Moyet killing the mistaken identity game: https://t.co/2bDxNoAt1i Pizzey Park, Gold Coast, 1989 #straya\n📷:? https://t.co/Q3M4Na4MFm Thanks for the unforgettable dinner last night @bflay @gatonyc1 https://t.co/mMG9oWy952 Update: I was found 10 mins later (check Insta story) I'm currently skating the streets of NYC on my way to a meeting. First person to see me and ask for my skateboard can have it. 🍎 ❤ https://t.co/E0B1nffObh My television debut: as \"Skateboard Johnny\" on Captain Kangaroo (1981)\nThis song still haunts me btw https://t.co/G3rvnqLazo A clean-ish 900 (at @WoodwardCamp during ESPN Gigantic Skatepark Tour) with moral support from @buckylasek &amp; @erickoston \n🎶: fluf https://t.co/xC0sLIBBZW Woman on plane retrieving her luggage in the overhead:\n\"Who's skateboard is this? It's blocking my bag\"\nme: that's mine, you can pass it here\nher: \"It's yours? You ride it?\nme: yes\nher: \"Are you any good at it?\"\nme: sometimes\nher: cackles maniacally, exits plane Thanks @MotoAmerica1 for hosting our synchronized skating today. https://t.co/zetMFv8oWK Just experienced 160mph on a motorcycle thanks to @ChrisUlrich18 &amp; @MotoAmerica1... \nbest rollercoaster ride ever. \n📷: @dupedupe https://t.co/xe2rdI34Au See you soon ATL! We are coming with an epic vert crew. https://t.co/DkfwrE05gb I have seen the devastating effects of dementia on my mom so I cannot stress enough the importance of supporting @ARUKnews through #ShareTheOrange campaign. Please help by watching and sharing: https://t.co/Vjh94iC2Aw (special thanks to @BryanCranston) me: polo, anyone?\nhorse: nah https://t.co/Sn5bMdXAsx Happy 10th anniversary @skateistan! Thank you for empowering youth in the most challenged areas through skateboarding, education and equality. I am honored to be a board member.\nPlease support this incredible organization: https://t.co/IoBHbm8YIZ https://t.co/kYCgqUp61V Jump ramping on 53rd Street for\nThe Late Show with David Letterman (2003) https://t.co/vFBBh1vMK4 ATL on Sat! https://t.co/3QI7K7vwEg A short profile on [then] 7-year-old @rileyhawk666 from ESPN Gigantic Skatepark Tour 2000 feat. @buckylasek @SalMasekela @JasonEllisShow &amp; Kris Markovich https://t.co/0eKzEwnErF We won! (according to @nytimes)\nhttps://t.co/eYfNg4EsIv\n...but I still think we need more skateparks across the globe. Highly recommended if you're into good, live music... https://t.co/wmdhsHgVqX Back when Tommy Carroll taught me Roast Beef axle stalls and then he removed his eyes so I could get a closer look. \nCheck his music! https://t.co/RwTHbiP6w5 https://t.co/EftxBgzqab RT @MotoAmerica1: What's up #Atlanta?! @tonyhawk will be joining us next week for the @suzukicycles Championship at @RoadAtlanta. He'll per… I am beyond thrilled to bring this legendary crew: @andymacdonald Elliot Sloan, Kevin Staab, @jordynbarratt &amp; bmx icon Dennis McCoy\nJoin us! https://t.co/4EhqtZGik1 We found the perfect date night movie (depending on your date). #aquietplace is SO good btw. Congrats @johnkrasinski! https://t.co/25rJys1KEY @briamgilbert Thanks! Quick session at Street Dome with @corbinharris Clint Walker &amp; @MikeEscamilla on our way through Denmark during @gumball3000 2015 https://t.co/qiWv1gxgaM RT @Beats1: Mike D welcomes skate legend @tonyhawk to the Echo Chamber to talk about music that has influenced his life. This is a must lis… Some pics from our recent adventures in Iceland\n(my kids took the best ones) https://t.co/C0qV3frzUY @niallstaines That’s my “international” collection area. Right above are decks from Australia, South Africa and Mexico. Thanks again I'll be on The Echo Chamber with Mike D (Beats 1 Radio) today at noon pacific, 3pm Eastern. Hear us [literally] wax poetic about bands ranging from Rezillos &amp; Circle Jerks to ATCQ and At The Drive In.\nmore info: https://t.co/z8Ep3I17wt https://t.co/Q9RtLbQ3K7 Here's a 25% discount code at https://t.co/3LiS5TUaDy (good now through 3/31): use the code \"Rileysdad18\" when checking out at https://t.co/3LiS5TUaDy and receive 25% off of any purchase site-wide (offer ends midnight 4/1) https://t.co/9Fyr5bN6i9 Yesterday we said goodbye to our dear friend Jen, who left behind a legacy of love and light in the form of three beautiful children and a devoted husband/father. \nThanks to those that donated to the Mancuso Fund during this painful time: https://t.co/OUtvUWmbcB At my gate, waiting for a flight:\nGuy with 8x10's &amp; pen approaches, asks me to sign them\nMe: How did you get past security?\nHim: I bought a $150 ticket \nMe: That you won't use?\nHim: right\nMe: so by selling these, you'll make at least that?\nHim: I hope so or my wife will be pissed Cool story... I mean, my story was actually cool but you missed it. https://t.co/TlGOrqTp5i Feel good flight of the summer\n(with @latestQOTSA) https://t.co/O7PXN3WLoW There was a time in skateboarding when making eye contact with a photographer was a thing. I'm guessing this was taken around that time: DMSR, 1982 (?)\n📷: @jgrantbrittain https://t.co/CGttDZSJS2 This was the scariest - and most challenging - doubles trick @andymacdonald &amp; I have done. And I never want to do it again.\nFun fact: this was Andy's first cover\n📷: @atibaphoto https://t.co/8WdY0bhC98 Calling my dad for a ride home from DMSR skatepark in 1982. \nHe probably wasn't home from the look on my face. This generation will never know the struggle of payphones; 10¢ was a lifeline.\n📷: @jgrantbrittain https://t.co/CRxcSZkmEq Thanks for the invite @MailChimp!\nBest (literal) board room ever... https://t.co/if5HK1cMVV Hey now, wooo look at that... Thomas Middleditch of @SiliconHBO \nwill be on Demolition Radio this Saturday - @SIRIUSXM channel 103 @factiontalkxl at Noon ET/9am Pacific #PiedPiper #snackdick https://t.co/0vuseUzUT4 Lien air, Palmdale, 1981\nPretty sure I was trying to make eye contact with Neil but the face was probably unintentional. \nFun fact: this was a centerfold of the first @TransWorldSKATE magazine even though I had a @thrashermag sticker on my helmet.\n📷: Neil Blender https://t.co/jiprs4Chms Please consider voting for Sky Brown as #LaureusSportingMoment of the Month. She already has my vote for obvious reasons... https://t.co/IqiWK8hk9x If we can get bungee jumping back in X Games, the cycle will be complete. https://t.co/N9jYk8mLpn I was, and it was excellent. \nBelieve the hype. https://t.co/hrTqbH3x2j This is the ultimate example on how NOT to drop in on vert, shown in glorious 4k slow mo. Kudos to Dan. https://t.co/fz02FgFpRJ Thanks Summer! https://t.co/d63BrRLEpl Tonight's demo playlist (so you can be there with us in spirit): https://t.co/tQFGK7wdgQ I came to #X4Summit18 in hopes of getting a pic with @Lin_Manuel... and I was not throwing away my shot. https://t.co/spfVS3Xbf4 Congratulations to Monica Acedo from Mexico City, winner of the @AdobeStudents #board4better contest! \nThanks for coming by @Birdhouse and sharing your design with us. https://t.co/NaCo7L5Wpy This was taken last week... or 30 years ago; I can’t remember any more, but I’m guessing 1988.\nOf note: Stubbies, Chin shirt, Nose Bone, Smith Gloves, Kasai sticker, reverse mall and NO LAPPER https://t.co/KoV1TOBLdA Seeing @lizziearmanto &amp; Atita Verghese teaching girls to skate in India is what it’s all about. https://t.co/coXBHtfacK Hear my interview with the talented &amp; prolific Alison Mosshart of @TheKills on Demolition Radio this Saturday at Noon ET/9am Pacific on @SiriusXM 103 (@FactionTalk103)\nFun fact: she's been skating longer than most of you https://t.co/LlDk43gDBl Great Falls MT 2006 \n(Secret Skatepark Tour) --&gt; Hollywood, CA 2018 \n(Adaptation x Maxfield)\nphotos: @JodyMorrisPhoto\n(I see a pattern here) https://t.co/9xXwa5WBbv Intel commercial from 2005 @JohnCleese and @Seal. If you think it's weird that we're all sitting in laps, it was even stranger after the 20th or 30th take. https://t.co/OQ1SoF3ga1 I don't normally ask for such things but our dear friends are going through the hardest time imaginable. Their sweet 8-year-old triplets would greatly appreciate any help: https://t.co/AEnGOnLKx8 To clear up a few things about THPS: I worked closely with Neversoft on our series to provide ideas &amp; authenticity (without writing code), &amp; I am forever grateful to Activision for 2 decades of support; my contract with them ended amicably in 2015. And THANK YOU to all the fans! @littleseizurez You have no idea... @Dan_Brenkert @BlakeOhBeKay I agree; it was glorious To anyone asking me to 'remaster\" old games, or complaining about THPS servers being down: Activision owns the THPS license but I am no longer working with them. If I had the skills / authority to reboot servers or code games for newer systems on my own, I would be happy to... When things get hot, cool is all you got... 1985 Mountain Dew ad feat. #rayunderhill and me doing it Country Cool. I'm hoping that above all else, this will be our legacy. #notforair https://t.co/II96RMbdp7 Me at the end of the weekend https://t.co/PnzcssvtAc @NathanLazarus3 @THF You saved the day! Glad to see you're doing so well. \nFYI - I actually made it to Estonia a few years ago. And you were right... It's in Europe Back when @NathanLazarus3 helped win $175k for @THF on Are You Smarter Than a Fifth Grader? \n...and then we named a park after him in Nederland, CO. https://t.co/PObvlfM88C @klbs88 Very cool, thank you! My stint as Lionel @damustacheman in the Loiter Squad Brigade\n(feat. @tylerthecreator @ChrisPontius Taco Jasper &amp; @rileyhawk666) https://t.co/B6NlmP9zFY The skateboard I used at Bondi #bowlarama last weekend is now on @eBay if anyone is interested. Warning: the trucks are tight if you're planning to ride it. Portion of proceeds go to @THF https://t.co/CXl9P4ii99 I don’t want accolades; I just want to join this crew if they'll accept me\n https://t.co/immzPDc7nM\n(via @TimeOutLondon) I just got back from Oz but @rileyhawk666 is heading there tomorrow for a short PETYR tour. Catch them at one of these shows with Grim Rhythm (date formats are Americanized... so is Canberra) https://t.co/bF4zvTKkDr New and improved skateboard emoji. I sent @jeremyburge &amp; @mindfad a photo of my actual board, so I'll take the blame if the wheels look big...\nNo shame in my 60mm game https://t.co/jUMVTr21lL The future is now: some clips of the other three winners of Bondi @bowl_a_rama: Tate Carew (juniors) @sabrenorris (ladies) &amp; Keegan Palmer (pro). The kids are alright. #ilovesydney https://t.co/pAC6CNzPeg Bondi @BOWL_A_RAMA finals are today... so these stands will look very different this afternoon. You can watch live (in Oz) at https://t.co/2v8VULbrxP or (everywhere) on ETN #ilovesydney\n📷: @rileywalker via @Boardworld https://t.co/lXS27HeX6P Thanks for the aquatic hospitality! #ilovesydney https://t.co/695IrsHVBH The early bird gets the Madonna. Here I am warming up this morning for @BOWL_A_RAMA on Sunday. I promise to do more of these if you come watch. #ilovesydney \n📷: @jockmorrissey via @boardworld https://t.co/siCkPpzACb How I made my 2nd million: \nsitting for hours on end.\nThanks @united https://t.co/mkKVN1VQF8 Everything you wanted to know about a (the?) skateboard emoji but were too self-conscious to ask: https://t.co/Xycvy8941e Frontside air over Jaws' crailslide earlier today. In other words:\nI jumped the shark. GET IT?!?! #skaterdadjoke https://t.co/hABtjn4Xss Skateboard terminology in #Tokyo2020 might have to be censored... https://t.co/Hza3SDGCZy One minute of goodies from my #birdhousesaturdays segment. Some of these tricks took 2-3 days of torment just to make one (especially the kf pivot fakie). This is a blatant attempt to tell you that the video is still available for rent or purchase.\n🎶: @banksandsteelz - \"Giant\" https://t.co/Uto79NIFX6 If you are watching Olympics without @Lesdoggg's commentary, then you're missing out on the true spirit of the games. My episode of Impact Theory with @TomBilyeu: https://t.co/8iAJM6zESz I have the sickest combos in this. https://t.co/UASmJTIEsF The vert crew came out of the [literal] woodwork tonight for a screening of #EARLYMAN. \nIf you're a fan of Wallace and Grommit (like me), you'll love it... \nso will your kids.\n@EarlyManUS https://t.co/mDLUH9ZIrB Good to catch up with this crew last night. Congrats Bam &amp; Nikki!\n📷: @ryanhalub https://t.co/YeqI6Y2JEa My brief stint on Million Dollar Password (2008). I almost got Lynn to 50k but blew it on clues for \"Drugstore\" https://t.co/6rFzxehTKg Hoping to help bring the skateboard emoji closer to 2018 than 1985... https://t.co/TIWWbGk1i2 This was a blast, even though it took a few more tries than I anticipated. https://t.co/Gq6kC78hw8 This was only true in December. https://t.co/5cVqldKzZB Bucky @buckylasek: “hey Jordyn, if Tony &amp; I make Mctwists, then you gotta make that back lip you’ve been trying.”\n@jordynbarratt: “ok”\nMe: “wait, what?\" https://t.co/H292Nhr1HG NSA San Jose Miniramp Jam, 1991\nSquatting on a mini was my true crossover talent. #ponyhawk https://t.co/YuYRLjqrQE Thank you Scott Oster for the totally tubular session today. This was my version of a touchdown, btw. https://t.co/e1j4GBeufC Bondi Brigade (as we prepare for @BOWL_A_RAMA): me @MikeMcGill_ Staab &amp; @buckylasek yesterday https://t.co/XNzv5tD82I I'll be speaking at @Qualtrics #X4summit18 in Salt Lake City on March 8 followed by a vert demo that night. Join us! \nI promise I won't wear a suit... \nor do G-turns during the event. https://t.co/IdQ5LTfHIy Focusing a board with my skull thanks to @CharlieOconnel &amp; @MrJerryOC (The New Guy, 2002) https://t.co/Pp8CiNF7OF Oasis, 1979: \"ollie to hang-up\"  which is now more appropriately known as a Disaster. \nAlso: Mr. Bill shirt https://t.co/YiK0dm5rKI @realfriendsband I live in San Diego but hit me up if you're in the area It was a blast hanging out with families from San Diego’s Ronald McDonald House. Having seen their work many times, I believe it’s worth supporting in any way. Check out their fundraising raffle w/ 2,000+ prizes (including this Dream Home): https://t.co/10s4VkyDVe.\n🎶 @gupimusic https://t.co/Ykwsui8ikg @chrislivingstn Thanks for filling up my Gravel bags! Happy Birthday @Lizziearmanto !!!\nYou can always count on our full support\n📷: @sammullerpics https://t.co/HmaZYixPmS Just when I thought I might get the job commentating #Tokyo2020, this guy comes along and nails it.\n(via @MuckMouthDotCom )\n#grindingforburly https://t.co/zL11rAU73Z A clip from back when I lost millions in endorsements for my Homie https://t.co/sr5rPwyk6P RT @ChineseTheatres: .@OriginalFunko founder Mike Becker and @TonyHawk at tonight’s Making Fun premiere. https://t.co/QDQIqsIJqm My collaboration \"Hugman\" with @NathanSawaya is now on display in DTLA (if you can find it). Available for auction via @charitybuzz , proceeds benefit #ArtRevolution more info: https://t.co/uAkv89qbh2 #HugmanAdventures\nAuction page: https://t.co/nnwdt0iG8D https://t.co/kMWm4p7n6x Going with the Flow(rider). This feels like skimming... until you fall &amp; go through the rinse cycle https://t.co/9CtWFvymT5 New year, new trick, same me https://t.co/A8QxaLlZ5x Bird Men? https://t.co/wDNbcz6SS7 It's great - and validating - to see these action sports stars nominated for @LaureusSport Awards among all the \"mainstream\" sport champions. \nLooking forward to seeing them all together in Monaco at #Laureus18 https://t.co/CteB4LBC8p RT @tunein: Skateboarding legend @TonyHawk opens up about his rise to stardom, building his business @Birdhouse and finding success in the… The 2018 Bondi @BOWL_A_RAMA is only one month away.\nAs The Dude says: \"I'll be there, man\"\nGet tickets now so you can be there too. #ilovesydney\nhttps://t.co/tkuAXiNJdt https://t.co/M6N9I8SP6F Current mood: shredding gnar\n@MammothMountain https://t.co/B80mXi7FTR New fav skater: Ruan Silva https://t.co/ED0ZoHpyjk 1997 Munster World Championships, Germany. Looking back now, this is probably the best I ever skated in competition. I was in \"the zone\" (or whatever cheesy sports cliche works in this scenario).\nThe original video had no sound so here's some Damned in keeping with today's theme. https://t.co/aYwA5PqzXW We got a brand new rose in town!\nThis homage of Ben, Clive, Lizzie &amp; Jaws was originally shot for a @birdhouse ad, but now it's available on decks &amp; t-shirts. Neat neat neat. https://t.co/gNQupD9VVC\n📷: @sammullerpics https://t.co/Er5h4e6OnU SATURDAY at 3pm ET: hear @samjones of @OffCameraShow on Demolition Radio. He’s got great stories of perseverance, talent and creating your own career path... and skating Whittier with OG locals\nTune in: @SiriusXM ch103 @factiontalkxl https://t.co/Qg5xidYwjJ Thanks for the invite @Lefsetz! https://t.co/5d8IVPqCvz If Boom Boom Huckjam were to return in 2018 for a “farewell tour,” would anyone come see it?\nAsking for some friends. Coastal Carnage 2011 where I jumped the shark for best trick.\n(via @ridechannel) https://t.co/NO9wyLfcrI Haha I remember you guys being less than “delighted” when I was riding it... but I had to take it for one last blast. Thanks again for the honor. https://t.co/uywFls9ViK Me in 10 years (or sooner) trying to reclaim my @BagelBiteLife sponsorship https://t.co/J80BaxhNkh @Littleheath_ @redrobinburgers Thanks for the offer, but I have to leave early tomorrow (assuming flights are still running...) Stream The Cube! https://t.co/rTMNLLjgZu Posting this while it's still \"current.\" Two lines I shot recently (spliced together) for @Triple8NYC. \nHappy 2018! Here's hoping I don't have to get a real job next year.\n📹: Brent Hyden https://t.co/SOyKYWTQoO Jumping into 2018 like https://t.co/YqBnDsaZ9v Last nostalgia blast of the year: my clips from our @birdhouse video \"Untitled\" (1993) featuring @rileyhawk666 cameos (in his first skate video) https://t.co/WBs9E1msU1 All of my street footage from our first @birdhouse video \"Feasters\" (1992). Front 3's for days... https://t.co/uTK6EpwFD6 Giving #SmallThanks (via @Google) to support Mimi's Bistro. Mel serves breakfast/lunch dishes inspired by her German roots. It's our fav brunch in The D. Share photos &amp; stories of your fav small business w/ #SmallThanks &amp; tag @google; some get Google marketing support. #sponsored https://t.co/5T1d5trmaE I love my gift from @jayfrankparnell but I'm not sure whether it's more fun to ride in or scare our kids.\n(safety monitor: Steve Hawk) https://t.co/jx6uvCKgSP @justinptak This is amazing @itsKapoow @SpaceX Very cool. @elonmusk knows how to throw a party Does anyone know what we just saw in the skies above San Diego? https://t.co/EFNBh87Hc8 A few leftovers from #birdhousesaturdays that I gave to @LakaiLTD. The last clip is at a wild ditch / fullpipe DIY spot in Czech Republic. Working on signature shoes now, or you can pick up a pair of @rileyhawk666’s since I might just copy his... https://t.co/f3tgk8v4KP Joining @Google's #SmallThanks movement w/ Leucadia Donut Shoppe, where Tom &amp; Emily have made great donuts for 30 yrs. You feel like family as you walk in!\nShare photos &amp; stories of your fav small business w/ #SmallThanks &amp; tag @google; a few will get marketing support\n#sponsored https://t.co/OuSzdnYc8G Skateboarding is not a crime... but it might be an emoji. https://t.co/en1j27BfDj No child left behind?\nWell, maybe just one or two...\n#kokomoisland https://t.co/2ohf2f3dMb @EinfachPatrick That was no dream. I have never wanted anything more. Bula from #kokomoisland https://t.co/rpLiR7N1tj Two tricks from 2001 X-Games best trick event. I only made a few heelflip bigspin leins through the years because of the guaranteed whiplash they incur.\nAlso: more skate events should have German commentators just to hear them say trick names https://t.co/VfoGlYnA6G I can honestly say that when I took out my savings (&amp; house equity) to start a skateboard company in 1992, I had no idea if it would work... or that @birdhouse would be around 25 yrs later.\nThanks @RollingStone &amp; @EricHendrikx for recognizing our tenacity: https://t.co/GGgD5Rh0xq Thanks @cirquedusoleil for the tickets to Luzia premiere. I never imagined seeing such incredible feats in a relatively confined space. https://t.co/ovrCnAScRB Last year, @SalvationArmyUS served over 3 million people during the holidays.\nYour donations help put presents under the tree and meals on the table. Join me in the #FightForGood! Learn more at https://t.co/RRn2VV5PXn #SalvationArmyPartner https://t.co/Ki1W988hRn I recently partnered up with @MINIUSA &amp; @THF to help a St. Louis Community where we expanded a creative urban space for a skatepark in a challenged area. \nWatch “Turning Corners. A St. Louis Skatepark Project\" https://t.co/VBtjeZQVbO Highlights from the 2008 \"All 80's All Day\" event at Quiksilver HQ featuring @henrygutierrez @eddiereategui @stevecaballero @christianhosoi @grossosucks @staabpirate1 @buckylasek @andymac720 &amp; me testing the limits of a Tracker Lapper https://t.co/H2F9XqIfvM @mbradmathis1 Awesome! I can still feel the cold from here Southern California is lit, but not in a good way. It smells like a campfire &amp; the sky looks like this. Thousands of evacuations while homes are burning. Stay safe out there. https://t.co/aZfoTzQori See you at Bondi in February! Tickets for Bowl-A-Rama 2018 now on sale. @BOWL_A_RAMA #ilovesydney https://t.co/TIpDqv1qzk RT @EricHendrikx: Drop in on a new interview with @tonyhawk on @RollingStone. Thanks Tony! https://t.co/3QxqNDhsyp Happy Birthday @rileyhawk666! I am so proud of the man you've become and your constant motivation to keep improving.\n25 is the new 5 btw https://t.co/T9GlruF7aB Thanks to @Triple8NYC for finally bringing together form &amp; function in a proper skate helmet. I can honestly say I've never worn something so comfortable and felt so safe at the same time (which is how I pulled off this run) https://t.co/2MZGFnpDkX Thanks to Door Of Hope &amp; @SalvationArmyUS for including Keegan, Calvin, Kady &amp; me in the holiday gift surprise this evening. You can help spread the joy: https://t.co/eSHF1DzPmq https://t.co/sWo8MNq4kV RT @trailerparkboys: From #OutOfTheParkUSA - watch the video for Bubbles' new song 'Who's Got Yer Belly' featuring Alex Lifeson from @rusht… New trick? Or recycled bits?\nEither way, I call it the Flip Tap\n(Fun fact: you can see my daughter waiting for me at the exit because she wants me to help her on Mario Odyssey) https://t.co/WPoXOhGhFU Since I first discovered skateboarding, it has allowed me to express my creativity in countless ways. Join my design challenge with @AdobeStudents to create a skateboard graphic that expresses how skating has impacted your life https://t.co/2KkOKEZvyq #sponsored #TheFutureIsYours https://t.co/I1gs0qW6MP Thanks for the session @supremenewyork @JeffersonPang\n📷: @GhettoGastro https://t.co/GaDze6FrOC Thanks @ronnychieng for the great stories &amp; laughs today. Hear our interview on Demolition Radio this Saturday: SiriusXM @FactionTalk103 https://t.co/2XMCdwJdwV Since I first discovered skateboarding, it has allowed me to express my creativity in countless ways. Join my design challenge with @AdobeStudents to create a skateboard graphic that expresses how skating has impacted your life #sponsored #TheFutureIsYours https://t.co/2KkOKEHUGS Help me #FightForGood this #GivingTuesday with @SalvationArmyUS by providing Christmas gifts to kids in need: https://t.co/wPqnFhZGxE #SalvationArmyPartner https://t.co/Ugq1QYAoa7 Going live soon on @BuzzFeedNews #AM2DM w/ @RadioFreeAsha. We'll be talking about #GivingTuesday, #SalvationArmy and skateboarding (of course): https://t.co/u5hikvhfjF Hello from the city that never sleeps. Just wanted to share the lovely view.\nI'll be on @TODAYshow tomorrow. Scroll on. https://t.co/RIGCWkw0uV Cab - revert - f/s Cab as seen in #birdhousesaturdays. It was scary and I never want to do it again, but thanks to Micke Alba &amp; Chris Miller for the inspiration. https://t.co/gnVno4JfVs Thrasher Magazine called to say that I was PROBABLY going to be named “Skater of the Year” like 1990, but I would have to agree to an interview and a major photo shoot. I said I'm probably too old and took a pass. But you can vote for the REAL nominees at https://t.co/HJ0XMmcURv https://t.co/z5oVaUQCek Thanks to everyone that has supported me in this surreal life of skateboarding, adventure and philanthropy (especially my ever-patient family). I sincerely hope you can spend your day surrounded by loved ones, fun stories... and good food. \n📷: @jgrantbrittain for @Nixon_Now https://t.co/2ueCuUyKPw Doing trick shots for good with the master @BrodieSmith21 &amp; @SalvationArmyUS\nJoin us in the #FightForGood: https://t.co/pZ983mAcil #SalvationArmyPartner https://t.co/brbSxAQ0vp I’m proud to be the latest member of the @Triple8NYC team. The new Certified Sweatsaver helmet is a long overdue combination of safety, style and comfort. https://t.co/il2tLDVhmz A \"street\" contest from 1991 (at Powell HQ). I always loved this vert wall. Dunno who shot this; saw it on YouTube with no filmer credit. https://t.co/dEaUeY8c4y Dangerous curves ahead @rileyhawk666 \n(from #shepdawgs5) https://t.co/Nx37rFv0kH Shooting the curl, 1981 https://t.co/8ctzAiNrwR RT @edsyder: A quick look at the new The Hawk &amp; Hosoi Book (shop link in my bio) @tonyhawk @christianhosoi #skateboarding https://t.co/ln9g… Here is how you answer the tough questions. Take note, Jeff Sessions... https://t.co/3z7UPQ8VGh Let's have a high score challenge! Just name the time &amp; place.\nWinner gets tix to Hamilton... \noh wait, never mind https://t.co/K1lULnZubP @colesprouse Hey Cole, please follow me so I can DM you. Kinda urgent. This is what it took to get my last trick in #birdhousesaturdays. I still have a lingering heel bruise...\nand I'm still telling myself that it was worth the struggle. https://t.co/JvakOmxY9S @liam_oliver91 No but you can come hang with me while I drive my kids to school instead. Just remember: we have to leave the house by 8:10am or they'll be late Almost as good as watching the THPS4 intro. I love that we take quantum leaps in technology to create important things like this; human evolution is wondrous. https://t.co/iCStIZKhke UPDATE: FOUND via Instagram by @ColinGitchell I just left my skateboard near this memorial in Boston. Go get it before it freezes. Reply with the hashtag I wrote on the griptape if found. My board is wicked smart, btw. https://t.co/V4iNp3E92m Just had a taxi ride that felt like a rollercoaster, complete with abrupt stops and excessive speeding. It was a beautiful throwback to the days before everything &amp; everyone was rated online. I would have given our driver 1 and 5 stars simultaneously. It is a little-known fact that pro skaters make the best interns... https://t.co/tKRqrUt7qW I knew he would make an impression, but I had no idea that he would come in and take over the place. This footage is incredible. https://t.co/z3x94ZrP1l Happy birthday @stevecaballero! Here we are 35 years ago, skating together and shooting goofy photos. Happy to say that not much has changed since then. https://t.co/fWHoNukgM0 Just saw #wondermovie. It was heartfelt &amp; we thoroughly enjoyed it. One of us might have cried, but I’m not saying who (hint: it wasn't her) https://t.co/jMqjqeAjAh RT @cheddar: Pro skater @tonyhawk's new film \"Saturdays,\" his first in a decade, is a throwback to team videos and synergy in skating. #Che… It's official: I have been drafted to @LakaiLTD thanks to @rileyhawk666 &amp; extreme nepotism https://t.co/jL6gEf5maE The new skatepark in Linda Vista is almost open and it is worth the trip... from wherever you are. https://t.co/7boVoFZnTi .@aaronjawshomoki Lyon 25 jump that @TheBoulala tried 15 yrs ago is metaphor for collective progression: https://t.co/YD0pq6s4Bn #daretoleap Happy 50th @christianhosoi!!! Thanks for decades of stoke &amp; style. Here’s to 50 more https://t.co/dTJg2ArvMg “I am Sci Fi” TRON ad from back when I rode Lightboards switch, and @SYFY was spelled properly. https://t.co/rqLnzrDsif Like fathers like sons? Most definitely\nTony [Keegan] Hawk &amp;\nDanny [Tavin] Way\nKeegan is wearing my actual shirt from Animal Chin btw https://t.co/JudZPuu5Db Happy Halloween from Petyr &amp; Corinne Burns (2015). She started a band after I met with a fatal daylight accident.\n📷: @CameraJesus https://t.co/493qLV17qd Found our kids doing this in the backyard with no supervision and it seems totally safe...\nI’ll just be over here if you need anything 🚑 https://t.co/riIB09bvCA @gupimusic Hey I was here first My son just heard this &amp; texted me that someone was impersonating my voice on the intro. I told him it's really me &amp; he was utterly confused https://t.co/iaEiNyF9dl You can help choose the next series of #bonesbrigade reissues. Go to https://t.co/9e2Kqm23Ae to vote &amp; enter to win 1 / 6 sets of the series The dude that knocked on our door at 2:30am dressed as a Door Dasher had the worst costume, &amp; he was too early for Halloween. Spooky though. If you teach an old dog a new trick, but the trick is actually old...\nDoes it make a sound in the woods?\n📹 by Kevin Staab (creator of trick) https://t.co/dI8uxSJNPY 10/28: @nickrutherford will be on Demolition Radio @SiriusXM ch103 @factiontalkxl at 3p ET/Noon Pacific. We'll talk comedy &amp; #lifestylegrabs https://t.co/RIW3xd1YMy Keeping up with my son at college through reading his interviews is surreal. https://t.co/pSQGCyKMng Adios #woodwardrivieramaya, thanks for the hospitality &amp; nonstop fun with kids. Here I am earning my keep with Sandro Dias &amp; @andymacdonald https://t.co/759LvhvLIy If you’ve seen @andymacdonald &amp; me do a demo in the last 10+ years, we probably did this routine. Old habits die hard. #woodwardrivieramaya https://t.co/sV9xrsXlHF In celebration of #woodwardrivieramaya opening, we’ll be skating live on https://t.co/jymcf6yoIG 5pm Central. Muy caliente.\n📷 @brycekanights https://t.co/lkRxdgrskG Tickets still available for #pathwaytoparis - Nov 5 at Carnegie Hall.\nGreat event, even better cause: https://t.co/QtTqUdoNKz https://t.co/SM0KPoXYds “Tongue-tied and twisted just an earth-bound misfit, I”\nThanks for the flight lessson #woodwardrivieramaya https://t.co/XQ2a6lQ8bK @sacca Looks like I picked the wrong week to quit drinking I was just asked to remove my skateboard from overhead &amp; put it under seat “in case it falls out”\nhas never happened..\nblocking aisle safer? Here’s a chance to see @hondurasband on Halloween... for free https://t.co/aQrNmARasv Pics of @rileyhawk666 snowboarding his first time in 1996 (age 4). I had to stuff foam in the bindings so his feet would stay in\n#snowsummit https://t.co/BFgjiQic9y Death from above 2017\n(me over Ben Raybourn yesterday)\n📷: @JodyMorrisPhoto https://t.co/RGJqWxdOcZ FOUND by @jeaninedeliz (for @jimmyyson) https://t.co/n4Jw64UsNG Just left my skateboard near Houston &amp; Forsyth in NYC. Go now or forever hold your peace\nPlease reply with the hashtag I wrote if found https://t.co/FtgIcPvEA1 Just hid a #birdhousesaturdays DVD in NYC. Finders keepers, others... can buy it online. https://t.co/rIefrE5YNz We drained our swimming pool. It’s rough, the transition sucks &amp; my heel is smashed, but @CruysberghsAxel had no trouble.\n📷: @jgrantbrittain https://t.co/bUXr5Nbal8 I talked to @thrashermag about my lifetime of whiplashes and the making of our opus known as #birdhousesaturdays: https://t.co/nGdmnaW83n If you haven't seen #birdhousesaturdays (feat. @Lizziearmanto) yet, I highly recommend doing so. Now available on all platforms except VHS-C https://t.co/xrQBU7XiOq Hear me interview the legendary @HenryRollins\non @SiriusXM channel 103 (@factiontalkxl) Sat 3pm ET / Noon Pacific\n🏴🏴🏴🏴 https://t.co/xtDiIBhwPT Current flock of @birdhouse decks https://t.co/hGYRPtVCsp @owenbrainard @kevinrose @sacca Let's make it happen. I promise you'll do better than that gruesome GIF. This ramp has been in storage since the last BBHJ tour (10+ years ago). Thanks @Elliotsloan for resurrecting my old friend.\n#mctwistandshout https://t.co/5aDSpjNfF7 “If you want to get laid, go to college. If you want an education, go to the library” - Frank Zappa\n(he found the non-friction section) https://t.co/KQaB2MdfI9 @N8tiveHoodrat Enjoy the silence I almost forgot that I was in a “movie” with a most legendary cast: Frezno Smooth (1999) was ahead of it’s time. Good luck finding it... https://t.co/JZKmVBqrtA Getting loopy on Jackass with @CondorBMX, a very young @rileyhawk666 (sliding), @BAM__MARGERA @realjknoxville &amp; #ryandunn (RIP) https://t.co/LlWq5et0Sm To friends &amp; those concerned: I came home from Vegas (Mandalay) yesterday so I was not part of this unfathomable tragedy.\nSo heartbreaking. My strange coping-spin thing from #birdhousesaturdays. It wasn’t the trick I had planned, but thought it was scary / weird enough in include https://t.co/2NfrStd52F For @StephenAtHome &amp; @nickkroll although I see nothing awkward about my teenage years. Thank you for the #puertoricorelief efforts #puberme https://t.co/15cpIpK77m @colbertlateshow @StephenAtHome Will this work? Although the only awkward thing is that my wheels are mismatched... #puberme https://t.co/SsCLOIGTRa For your consideration: #birdhousesaturdays, a project 3 years in the making, born of passion, pain and perseverance\nhttps://t.co/vmFvrLgU9l https://t.co/c0UXhVrjhg In one hour, #birdhousesaturdays will be released. It is a skate video that I am immensely proud of, &amp; fun to watch even if you don’t skate It’s real! #birdhousesaturdays is available for pre-order. Buy it now, see it tonight: https://t.co/TDIkVvIRX5 Goodbye Hugh, thanks for the mammories. https://t.co/vYSFIfr8A7 My view of @aaronjawshomoki’s vert rail thing from #birdhousesaturdays (which you can purchase TONIGHT) https://t.co/Sy1w2Yg0bJ @maxwelltani Thanks. FYI: I don’t follow NCAA, I don’t invest in e-sports &amp; I don’t know tax reform before it’s announced. But I know many other things.. @maxwelltani I was invited to talk about entrepreneurship not basketball. But I weighed in if you actually watched the interview. Nice try at subtle diss Going live on https://t.co/TXJ7kCadAt now London 2015: it was on this @birdhouse tour that we decided to make a full-length video, so #birdhousesaturdays is like our Abbey Road\n9/29! https://t.co/SCm1bagD79 I had the honor of being @RouteOne1989's 100th interview: https://t.co/QmFZT1yZ16 New York cares!\nThank you @Interpol for a magical night of bright lights https://t.co/ivH67JGcXw Thanks @BlackPlagueBeer for hosting a final #birdhousesaturdays premiere before 9/29 release\nAnd thanks all for supporting @birdhouse 25 yrs https://t.co/W4RwlLnAee The #LEGONINJAGOMovie Brigade was out on full force tonight. Fun movie... &amp; #JackieChan!\nWatch for a rogue crooked grind in the school scene https://t.co/KHLyygZ3H8 Very cool @kickstarter project, if I may say so myself: The Hawk &amp; Hosoi Book by Ed Syder (signed deck as a reward)\nhttps://t.co/xNUv7YyC9O @anonsoul11 @kfarmer4444 @JafetGmail @aguirran @ikonenotto I got you Congrats @kfarmer4444 @JafetGmail &amp; @aguirran for guessing correctly. See you at #LEGONINJAGOMovie tonight!\n@ikonenotto can't go; he's in 🇫🇮 I have extra tickets to a private screening of Lego #Ninjago tonight (near Carlsbad). First 3 to correctly answer wins: \"Locals say _ _ _\" Never thought I'd see Primo Slides at the Emmys. Congrats @KilianMartinsk8 on this big win last night\nUnrelated: #BetterCallSaul got snubbed https://t.co/yor5yA2TPy \"Hey Cube, can I get a shoutout?\"\nThis was for #birdhousesaturdays but I'm posting it now because he's performing tonight at @KAABOODELMAR https://t.co/pgYkkusKwV Had the privilege of seeing Erick Winkowski do a Ho-Ho handplant in person yesterday. Big fan, and very jealous. https://t.co/25VWde1FHu How Did I Get Here moment of the week: 5-course lunch with #ShepGordon &amp; #HenryRollins prepared by a bear. Thanks @eoalchemy!\n#getinthevan https://t.co/tg8re56UpH Exclusive auction items from @THF benefiting hurricane victims &amp; our mission: https://t.co/bajQjrY8IR We're raising money for hurricane victims with these exclusive auction items. Thanks to all that showed up in Nashville yesterday! https://t.co/JrRkoQdXmt Outside my comfort zone in Nashville with f/s inverts &amp; country music\n@KipMooreMusic &amp; I are raising funds for hurricane victims. 6pm - FREE https://t.co/sB0pInyYXH Nashville, tomorrow; free demo &amp; concert! We'll be raising money for hurricane victims, @THF &amp; #kipskidsfund\nInfo: https://t.co/AkSl9dfXMO Thanks for the opportunity! Going to @Padres games as a kid, I never imagined I would get to do this. https://t.co/taRRi1BYlV Hey Nashville, I'll be skating Sunday at the #MusicCitySkateJam right before @KipMooreMusic performs... &amp; it's FREE: https://t.co/0eBflbOZ2h Here's a raffle to win a signed board by me; all proceeds to go Hurricane recovery efforts in Houston (via LYNKM)\nhttps://t.co/gQ2nKPFgCU This was a fun interview, thanks @EricHendrikx https://t.co/hAvxlAm5Bc Join us on Sunday! Looking forward to jamming with you @KipMooreMusic https://t.co/swvj5TCJzd Thank you @TuftandNeedle for the speedy delivery of a full-size mattress for my rapidly growing teenager. Watching it unfurl was 1/2 the fun Buried deep in the annals of cheese lies this episode of Max Steel. So authentic. Still trying to learn that last trick tho\n#stinkbugtwister https://t.co/fCFzSxZsgJ Rarely does a newspaper print a decent action shot of skateboarding. Stoked on this one though (from our demo yesterday in Buenos Aires) https://t.co/cbWyeKXN4F ¡Gracias Buenos Aires! 🇦🇷 https://t.co/nSPiRymQUh Thanks to @amandapalmer for making this poignant hurricane relief song. Buy it &amp; help victims of Harvey devastation: https://t.co/bcwr4h5HPl A guy in Buenos Aires just approached me &amp; pulled this out for me to sign: his VHS copy of Gleaming The Cube in Spanish. #BrillandoElCubo https://t.co/WigcOKcJ1N There is still time to get one! And here's a code for $10 off: TONY10 \nhttps://t.co/wB9VpBde63 https://t.co/1TCEPeC0jf Buenos dias Argentina! See you Sat at #XtremeLifeFest (Av Figueroa Alcorta y Dorrego)\nHere's a pic from 2014.\n\"what a crowd, what a turnout\" https://t.co/AXfrLYBLf4 Come join @KipMooreMusic &amp; me in Nashville on September 10! https://t.co/2mSOM9zrqi We had too much good footage for #birdhousesaturdays so here is a bonus vert edit that didn't make the final cut: https://t.co/pIQ6CXevyt Sign up for @japancrate in the next 4 days to receive my \"signature\" box of Japanese snacks.\nCode TONYHAWK = $10 off https://t.co/wB9VpAVCHt https://t.co/GI0nWSsxSX Thanks to this insanely talented crew for making #birdhousesaturdays beyond all expectations. Look for the video on digital platforms in Sep https://t.co/IzVD8svnjQ Hurricane Harvey is growing &amp; will have long-lasting impact on residents in TX &amp; LA. You can help via @SalvationArmyUS: text STORM to 51555 Just hid 2 tix for #birdhousesaturdays premiere tonight at this bus stop on Wilshire. Follow my Instagram stories for more giveaways. https://t.co/eXHpgecXIB We are premiering #birdhousesaturdays TOMORROW  &amp; I'm giving away 10 pairs or tickets. Reply if you are in LA &amp; I'll pick winners at random. https://t.co/F3VuGx3WyV Just did a Facebook Live session in SD, cruising boardwalks &amp; giving away @pennyskateboard / @birdhouse collab decks (avail at skate shops) https://t.co/6O6CYCUTKD It's surreal that I've been able skate with these guys for three decades: @MikeMcGill_ @stevecaballero &amp; @christianhosoi \n(clips from today) https://t.co/zapaQQtfxf Today at ORD:\n\"Hey are you Tony Hawk?\"\nyes\n\"Can I get a picture with you?\"\nyes\n\"Can we take it with your phone and you send it to me?\"\nuh... Unboxing my signature @JapanCrate (in Tokyo) with help from my sweet daughter: https://t.co/RWf0piBnxN more info: https://t.co/wB9VpAVCHt UPDATE: my hidden skateboard was found. Congrats to James Fabbi https://t.co/FJIAsNFsIG I just hid my used skateboard behind this strange statue in Montreal. Finders keepers. Please reply with the hashtag I wrote if you get it. https://t.co/aVOA3Pn2CV It's all happening Sep 10 in Nashville! Info/tix: https://t.co/0eBflbxoaJ https://t.co/WSm78dspIn Thanks for the custom jersey @CanadiensMTL! https://t.co/H3vFZ11WzZ #jackalopefest is ON. We'll be skating tonight. You might see a boneless or 2. Here's @Lizziearmanto getting prepared before crowds descend. https://t.co/fG1GpBUjzd I don't always coffin down the street, but when I do, I prefer racing my son in a [borrowed] $7000 suit.\n(via @GQStyle &amp; @SarahHallPRInc) https://t.co/6DLO4tI386 RT @JapanCrate: A lucky sub has a chance to win September's Sugoi Crate feat a  signed @TonyHawk deck a PS4 + Tony Hawk Pro Skater!  https:… guy at restaurant: \"you famous?\"\nme: I think that depends on who you ask\nhim: \"anyone ever tell you that you look like Tom Brady?\"\nme: never These limited edition TH @pennyskateboard are available now, with % of proceeds going to @THF. Get a cruiser &amp; help fund public skateparks https://t.co/OWHGujrbxD RT @KidsPress: Interview with @tonyhawk --&gt; For the skateboarder and video game entrepreneur, the sky is the limit. https://t.co/RK0hJtlx12… The #wayfinding Skatepark is officially open. Thanks @mcginnessworks &amp; @modernskate for making it happen in record time\nNext stop: Montreal https://t.co/hm2N0qfjhP Mini-ramp jamming yesterday at the Wayfinding Skatepark opening in Detroit. Thanks to @DanaAfana for the clip https://t.co/LLxAl160bH See you soon Nashville! Come join us for live music and skating, all for a good cause. https://t.co/LafhsmUM65 The #wayfinding skatepark opens tomorrow in downtown Detroit. Free to public &amp; ready to shred\nI got a sneak peek this morning\n📷 @CameraJesus https://t.co/MvcPvtwbLB The one time I ride my son's coattails (aka good looks) in order to get into GQ Style: https://t.co/UMZQjjTseU That day @rileyhawk666 &amp; I created the Center For Children Who Can't Read Good And Wanna Learn To Do Other Stuff Good Too (via @GQStyle) https://t.co/rT1vcCZDQu My wife's quote:\n\"At the skatepark no one cares what you look like, or where you come from. It happens here, as it should happen everywhere\" https://t.co/ufn6ZC9GNo RT @InandOfItself: Who will you sit next to at #inandofitself…?\n\nFound #InOurAudience recently: https://t.co/0c9I0Ho5JY Serena Williams knows her back smiths\n(as seen in #birdhousesaturdays) \n@serenawilliams @lizziearmanto https://t.co/pFLirdUI6c I helped design this new park in Detroit but it's not a @THF project. Thanks @mcginnessworks @BedrockDetroit &amp; @ModernSkate\nOpen 8/16, free! https://t.co/JOiOBro6Vs Surfing is a way of looking at that wave [behind a boat] and saying \"hey bud, let's party\"\nThanks @SkiersPier for giving us some tasty waves https://t.co/wTIrRBII3n These fidgety @birdhouse spinners come with my signature @japancrate box, &amp; they'll be available in stores soon-ish\nLike a record baby. https://t.co/xL3oL0kkVD Jamarion Styles is a hero; I love his perseverance.\nPlease vote for his 3-pointer as a Laureus Best Sporting Moment: https://t.co/cvqJPz3W4v https://t.co/GPvEUYXE2r Hey look, it's the house from... squirrel! Anyone have 10,000 balloons? #spiritofadventure\n(thanks #motorcitymini for the sweet Countryman) https://t.co/OQ489VZO8d Happy birthday to Ben Raybourn. I shot this two years ago &amp; it was a catalyst for making a team video. #birdhousesaturdays is coming soon... https://t.co/XMlqzoYA7f I went to Sydney yesterday and helped save the world from a[nother] tornado full of sharks. You're welcome. #sharknado5 https://t.co/hArRBbWySG RT @SharknadoSYFY: We're bringing in the big guns.\n\nThat's right, @tonyhawk is taking on #Sharknado5! https://t.co/mPsZwz8UsN Metallica in SD tonight! I tried to join the band in 2015 but didn't make it past the first audition. Sad but true. https://t.co/R86OoAghLG Oh hell yes. Let's make it happen @KipMooreMusic! I have a portable vert ramp, btw. https://t.co/Wor7PY5uvi @teensrbad @KevinsHairy @MarkyRamone @RadioFaction @EllisMate I'll be back... One of these guys is my hero.\n🆘= Save Our Skateboards https://t.co/nKeRKCQeFH @KipMooreMusic I'm down! I mean... what is it? @CulinaryBroDown It was both High fashion with @rileyhawk666 \n#bluesteelish #magnumfail https://t.co/b6frC4jtIV This is true. I battled a sharknado... while skating. Watch me judo-air them back into oblivion on Aug 6. https://t.co/tbRe9yI7YP Argentina!!! See you on September 2...\nhttps://t.co/RsVaqx9usx This Tweet from @tonyhawk has been withheld in response to a report from the copyright holder. Learn more. This video has been making rounds lately From back when my daughter hadn't learned to skate and I was sponsored by Sony... so two years ago. https://t.co/meYFGN9oBR Thanks for finding my skateboard @united. Sorry the trucks were so tight (in case you gave it a spin) Mild in the streets 🇯🇵\n📷: @ripzinger https://t.co/DQh5XaLI3A Stoked to hear @thekillers are coming to SD (Valley View Casino Center) on 1/30. Been a fan since their first album https://t.co/y2p2TIFk9w I spent the other day in Tokyo skating &amp; testing @japancrate treats. \nMore on that later, but check out their [literally] sweet program. https://t.co/yM0dvF4idV My interview with @Darrin99... the sequel https://t.co/1Fl0CYihBL I saw @Krispyshorts in NYC last week and I have pictures to prove it https://t.co/HIfOt01zNW When our family travels together, I don't do a \"Home Alone\" headcount in the car... \nI simply count skateboards to see if anyone is missing. https://t.co/0i4vhe3orb Just saw @derek_del's show @InandOfItself &amp; I was blown away. It is moving, insightful &amp; magical. This is not an ad... just a recommendation https://t.co/0aq0ED51MW Still searching...\nhttps://t.co/RzfekjB9qE\n(with @RickThorne) Just keep trying to get a little better,\nsaid a little better than before. https://t.co/kn0Os0Np2X Today I shot my last trick for #birdhousesaturdays. It was a battle that made me realize it's probably the last video I'll devote myself to. https://t.co/9Cv6bOQojr Starting soon! Great chat with @Darrin99 about skating &amp; punk roots, and how it all converged with Goldfinger on THPS https://t.co/GGMXlBM3rU Hey @Apple \nFor new emojis, I suggest something like this. Zombies &amp; dinosaurs are cool but skaters are more in your demographic\nThanks\nTony https://t.co/YaKzbd2of0 Doubles clips with Jimmy Wilkins  &amp; Tyler Pacheco from @LakaiLTD video \"The Flare\" https://t.co/0F1dNTikEN @DrewBennett81 We'll still be around. Details to follow Airwalk ad, 1996. My wallet was stolen out my bag at the skatepark around then, so I'd skate with it... until I fell hard on my ass. So dumb https://t.co/6U2rdOx5hv As seen in the new @LakaiLTD video: @rileyhawk666 conquering Sano-Land.\nVideo available here: https://t.co/8ySsFEeCXV https://t.co/5H5tAYz6MJ OH MYYY https://t.co/9ZSYg204TW Scenes from \"Propaganda\" (1990)\nA case study of questionable tricks, hair, fashion &amp; music https://t.co/G2apJhfRdx A true inspiration; losing his legs at 6 didn't stop Felipe from skating.\nHelp get him to Tampa Am! (translate page)\nhttps://t.co/zEKVQIOJPH This is what my mom looks like when she breaks through the Alzheimer's fog in a moment of recognition. It's rare &amp; fleeting but huge #endalz https://t.co/onMZhD4koT Thank you @ShinolaAudio for creating this beautiful instrument of sound. https://t.co/kV2adKK2TI Anarchy for the U.K. https://t.co/NwFZZmHQ5V Had the privilege of skating with @erocdog today. Only bites when snaked but does the best body varials.\n🎶: Adam &amp; The Ants - \"Dog Eat Dog\" https://t.co/r5ulhys4ZI Happy 4th https://t.co/Ha6qXDPv0U Thanks @MINIofSF for lending me this sweet Countryman while I dodged falling skateboards throughout SF this weekend ☂️ https://t.co/h81EgX9FQ1 Huckjamming with @edhelms many years ago, with encouragement from @mikeescamilla https://t.co/uiBTx67ByQ Vote for your favorite drawing from kids all over the world. Winner engraved on @IWC @LaureusSport watch https://t.co/jNZONtuN1o #IWCLaureus Happy Birthday to this sweet girl who is wise far beyond her 9 years\n📷: @CameraJesus https://t.co/Kbf06glihJ Hey @RedHourBen thanks for the offer to join Globo but I'd rather ride my \"sissyboard\" to victory with Average Joe's https://t.co/8OzqnpLZ0k https://t.co/feoRcDssBg I'm not ready to give up this \"sissy board\" just yet, but let me consider my options and get right back to you. https://t.co/7iPdjpjlrV New @bluesmart line! I'm not getting paid for this; I just like the marriage of travel and technology: https://t.co/zrCGi34Z2L The night Bart discovered that I lived in the same building as him. Fun fact: I actually broke my pelvis 2 years later. #simpsonspredictions https://t.co/G5pav3nERp Death defying Harry Bink winning the #nitroworldgames FMX best trick earlier https://t.co/wfJmidARon Right here, right now (at #nitroworldgames): https://t.co/ESdM3HzFxl The [literal] view from @nitroworldgamesofficial host set: We'll be live on NBC at 8pm EST. (the crowd will be here too) https://t.co/tlHbiPfVM5 On week left in my @charitywater campaign to bring clean water to those in need. Donations of $50+ get signed 8x10: https://t.co/yR0RUlqu2q My @Spotify playlist inspired by a life in skateboarding, including many THPS songs (a work in progress): https://t.co/lFbpCD1X8y Happy #gobashyourshin day! Thanks to @dupedupe for the assist in this ambitious goal of the double tap. #twiceasnice #shindigs https://t.co/78XsKGjDWh Get a personalized video from me (or other action sports \"icons\") while helping @THF provide public skateparks: https://t.co/EcDidnMhNj Training for Tokyo 2020 like\n🎥: @cmarlurks #spreadeagleairwalk https://t.co/hQbVPXQxJy Getting Soapy with @Theclintorous https://t.co/F9Do7cWevd A #bonesbrigade reissue deck signed by @MikeMcGill_ &amp; me up for auction, benefiting @SwitchfootBroAm foundation: https://t.co/gxuNHa8yhC 2017-&gt;1988 \nNearly 30 years ago Sean Mortimer #RayUnderhill &amp; I got an \"old-time\" photo done at a mall. Our kids decided re-created it today https://t.co/BJDqs0x38Q Just saw @lakailtd #theflare video and I predict this is what @rileyhawk's life will look like in the near future. Congrats to the epic team https://t.co/Efph8rBBm9 The new @birdhouse video is coming. I can't begin to explain how much effort we've put into it: https://t.co/BOQQoov5zy #birdhousesaturdays Here is @fattmisher_  stepping up the dad/daughter doubles game. https://t.co/kmKlCKRdTD Most fun (and least effective) pit crew ever. \nAlso - Lightning McQueen &amp; I are kindred spirits in our \"retirements\"\n#cars3 https://t.co/BVoHtNXNnQ @brandonwleonard That's legit Congratulations Spencer (@gupimusic)! We are so proud of your perseverance &amp; kindness. Get ready for greatness... &amp; college👨🏼‍🎓\n📷 @mikeblake https://t.co/HMkDC2eARW Garno was the best. We will miss him dearly. https://t.co/Qykdz751sZ Some of my tips on overcoming challenges and building a business (via the Success Makers video): https://t.co/OYABGdDBDI #AmexAmbassador https://t.co/fT8UZRFwjI @skateistan helps children in Afghanistan, Cambodia &amp; South Africa through skateboarding &amp; education\n#DonateFun at https://t.co/Z9zZDCz8FE https://t.co/3J7o38BAbg Stacking clips of tricks over tricks for #BirdhouseSaturdays video with @shawnhaleyeah. Yes, we made it... eventually.\n📷: @jgrantbrittain https://t.co/CrrJxCx4nV a most in-depth interview about my life in skateboarding via @chromeballchops: https://t.co/opsTcH3sHt #chromeballincident Fury ad from 2001-ish. An 8-wheeler seemed like a fun idea until I actually rode it. This was much more difficult /dangerous than I expected https://t.co/CK0xmj4wV6 This documentary is important. And highly inappropriate... but in the best way possible. https://t.co/ma9cJg0PY8 High speed &amp; high fashion powersliding with @rileyhawk666 https://t.co/PwEE94io0X 1988 --&gt; 2017: T-Bones wheels have come full circle (see what I did there!?)\nThank you @BONESWHEELS https://t.co/WX0ay5JlhE @FerAnchus I'm on it. Hanging out with Patchy The Pirate in Paris (2005). #wheresgary #meow https://t.co/y8K0DJdPVG My cohost @Johnedale made the kickflip challenge https://t.co/ZEXML6Dpeg Demolition Radio starts in 5 minutes. Call in and harass us to hear your own voice... live! 1-877-HEY-HAWK\nOn @RadioFaction (SiriusXM 41) A promotional video for Airwalk Shoes, 1996. This is right when \"new school\" tricks hit vert ramps, so I was doing my best to bridge the gap https://t.co/yGooHm9Pbb RT @cwwhoseline: .@TonyHawk shows off more than his skateboard skills on the season premiere of #WhoseLine, TONIGHT at 9/8c. https://t.co/P… Thanks to those that have sacrificed everything to protect our liberties. My dad served in navy for WWII &amp; we were lucky to have him return. https://t.co/jixViqCSZn That time Jay Leno was my stunt double. https://t.co/2fIQTK3voh Watch @cwwhoseline tomorrow to see my not-yet-nominated improv skills. https://t.co/SZVvsLNgVP @YourGirlKalynn This work? This is what it feels like trying to follow @aaronjawshomoki... frustrating &amp; nauseous https://t.co/Ac3j0B6Sll \"Palaces, barricades, threats... meet promises\" https://t.co/yTlKOLU4uo If you ollie a gap under a bridge and nobody was there to film it, did it really happen? https://t.co/ubMYxYw9tX This was an incredible moment in sports. Stoked I got to see it unfold in real time. Thanks @danjansen94 for the inspiration! https://t.co/YcBlEw7oyg Warmup run for Ben Raybourn yesterday. I still get scared looking at this picture. https://t.co/ElC2eP6xcR Ben Raybourn was so preoccupied with whether he could, he didn't stop to think if he should... invert on the dinosaur. https://t.co/4hrWaNQ1cO ICYMI: #birdhousesaturdays is our first full-length feature in a decade. @birdhouse is working overtime. Coming soon to your tiny screen https://t.co/WGVCPxmfQQ In production and on location: @lizziearmanto ripping for #birdhousesaturdays https://t.co/J1cSigQPPA \"Look Kady, that's me in the pink shirt\"\nHer: \"Are you sure?\" https://t.co/tYk4dCfhA6 Our last @birdhouse video was released 10 years ago, so we're long overdue. #BirdhouseSaturdays is coming to a screen near you this summer. https://t.co/nICXkCXvB9 If this doesn't get you motivated, then I can't help you... \nhttps://t.co/iNeFAw604v\n(Ruan_FAP via @RideChannel) https://t.co/UvcU2GSU3a @PodSaveAmerica any more live (audience) shows coming up? This was a blast to shoot. Thanks for including me! https://t.co/zgCp6MnKlz Behind-the-scenes footage of my true motivation to pull a 900 last year. Thanks to @DangerfieldTV for capturing this moment of inspiration. https://t.co/Qao63vaRMX Link to painting: https://t.co/b7WFdk08wo https://t.co/U4iHUIPUyD @ronnychieng Only on good days Hey @ronnychieng, your segment on flying cars was brilliant. Thanks for the laughter amidst all the absurdity last night. 95 Hard Rock World Championships. This felt like the biggest competition that could ever happen; big sponsor, ramp &amp; parking lot\n📹 @skatelab https://t.co/vhkyBhqD3K That time my mom was on Dave Letterman Show (before Alzheimer's stole her voice). This was definitely a \"top ten\" moment in her life though. https://t.co/BFElzycfd0 RT @GeorgeResch: For the next 24 hours I'll be donating 100% of the profits from \"Happy Is The New Rich\" to the @tonyhawk Foundation https:… Haha thanks for reminding me of this epic pic @shaunwhite https://t.co/J1SveHyZmT I appreciate all of the support for my @charitywater campaign. \nSpecial thanks @NickSundberg!\nhttps://t.co/yR0RUlqu2q Go shorty. Thanks for al the birthday wishes! This year, I'm donating my bday to help @charitywater bring clean water to those in need. You can help ⬇️ https://t.co/uoRGWpTL1R My version of a @depechemode music video: https://t.co/3fQJe1VROq I'm not sure if the lesson here is \"don't drink and skate\" or \"don't drop your beer.\"\nOnly @BlackPlagueBeer knows for sure. https://t.co/a6Wnt3w91F This is a blunt line from a few years ago. The last one is still hard.\nInsert \"blunt/blunted\" pun here https://t.co/DyydMxuCnw @YaBoiChefMurray @ItsMackenzieM You know it Got a @depechemode fan story? Tell me here and I'll share it when I take over their Facebook page today. My used skateboard from our 30-year Animal Chin reunion is still available https://t.co/TlhRsMzXaQ\n(bidding ends Thursday) I'll be hosting @depechemode's Facebook page tomorrow with stories &amp; media about their influence. Please share your story &amp; I'll post a few. From halfpipes comes fans of #kingarthur.\nLove Guy Ritchie's take on this classic tale. It's uncanny how we all resemble Charlie Hunnam, btw https://t.co/0UpYlQ3QSc I still look like that with my shirt off... https://t.co/FB6vW6H66f Thanks @domowaka for shooting this pic on our way out of town.\nPivot to fakie to ATL https://t.co/4G6vBwjoqU Found out we're going back to Argentina in fall (details to follow). Here's a glimpse of our last trip; full crowd scene at the food lines. https://t.co/QqWNemW4SH My bday wish: help provide clean water to communities living without it.\nYou can help: https://t.co/yR0RUl8TaS\ndonations &gt; $50 = signed 8x10 Best fan mail ever:\n\"how do i be tony hawk\ni am asking for a frend\nbest regards\nthanks bruh - rich\" My used skateboard from #30yearsofchin is up for auction on eBay: https://t.co/XHiS7rE59i?\nPortion of proceeds benefit @THF. Yapple dapple. https://t.co/w1zCCR51PG um... HE took a selfie with me. I don't understand why this is a thing. Next time a car bursts into flames in front of me, I'll ignore it. https://t.co/lxGOrBIwnM This is great news @sacca! Hopefully it will give you more time to help us create more public skateparks in low income areas through @THF... https://t.co/OvIbeJK4n0 I love @carsonmell's work, so I am definitely going to see his movie... https://t.co/KqQIZ6YuDN Gold Cup Series, Marina Del Rey, 1980: this was my first big competition as a sponsored am (Dogtown &amp; Tracker)\n#theclash #madrats #lasttrick https://t.co/fy0FSs0s79 @KBeast_24 absolutely, and thank you! @FerAnchus yes, everyone that bought $20 in tickets will get a picture Last chance to win a @chatterstars FaceTime demo (happening today)\nGet the app, donate $1 for an entry (or $20 for 35 entries + signed 8x10) This happening tomorrow. I'll take trick requests...\nGet the app and donate $1 for an entry to win (or $20 for 35 entries + signed 8x10) https://t.co/omPSW7giuF Last day for a chance to win FaceTime skate demo w/ me (via @Chatterstars)\n$1 to enter, $20= signed 8x10 (% to @THF)\nhttps://t.co/mSZqfDMrqy Happy birthday @amandapalmer! \nAnd congratulations on your latest song/video. It is a truly magical piece: https://t.co/K2rbrUgKta Not sure about \"the best\" but it takes a lot of effort... https://t.co/JvVrxbMPPu Feeling hot hot hot for OP's \"King Of Skate\" (2002), back when I used to give valuable parental guidance to @rileyhawk666 https://t.co/9fIuofBn0B See @JordanGarlandMI &amp; @AsDetroitsOwn crew rip a miniramp inside the historic Fisher building: https://t.co/jeHtwl5w50\nIt's so rad in The D. @_CoachCole @ScottKaplan @ScottandBR A skit on a comedy show is not a \"commercial,\" but I stand by the sentiment. A few days left for a chance to win a live FaceTime skate demo w/ me (via @chatterapp)\n$20 = signed 8x10 (% to @THF)\nhttps://t.co/ETqTbUc2QB Thank you @amandapalmer for making today so special. I'm proud to be one of your @Patreon supporters. Please keep making things. https://t.co/DeZYBsmIZB Congratulations to @gordonbyers @DanThe3pan &amp; @LSAneta in winning @bluesmart luggage (from my previous post). You shall all #travelsmarter Thanks @bluesmart for putting modern technology into a suitcase.\nReply &amp; I'll pick 3 winners for luggage. #travelsmarter #ad\n🎶 @gupimusic https://t.co/YVUT7u9mIX RT @KingpinMagazine: We spoke to @tonyhawk about the Bones Brigade days. @Nixon_Europe #NixonxBonesBrigade\nhttps://t.co/gcrVXDbRZy https://… I'm grateful to take part! https://t.co/EEWRldVtVQ Go watch @Lizziearmanto's new video \"Fire\" right now to start the week off right: https://t.co/PSCJQoWBrb I asked Pixies some sacred questions before their SD show last night. Interview &amp; live songs on @RadioFaction soon\nand they bought me a soda https://t.co/96XV6b34AU The first episode of Cars of Skateboarding (featuring @stevecaballero's classic collection) us live on @RideChannel: https://t.co/vMcJDna8ih Catching fish in Amsterdam https://t.co/1kNpsgTDUE Dude boarding plane after me: \"I need a place for my bag\" &amp; removes my skateboard from overhead. \nMe: find another place... and some manners @hondurasband Had to leave, but I'll be back next week! I'll be live on Facebook from @AmexOPEN Success Makers Summit at 2:15pm EST\nTune in: https://t.co/KcQuCNQ6lR #AmexAmbassador #NextStartsHere That was the plan all along https://t.co/sVdR1TLTX1 F Alzheimer's https://t.co/ilpHTwUVYb My daughter (inspired by @Metallica) dropped in for the first time.\n🎥: @jayfrankparnell https://t.co/8wn9HZ48JN Bad day at work\n#nofilter #noskin https://t.co/otWMII9ysq Be part of @THPSfilm Pretending I'm A Superman, doc about THPS series: https://t.co/5YQlKaQqRz\nI'm only an interview subject, not a producer I highly recommend eating / drinking here while in NYC: https://t.co/M4DlgcegYf\n(yes, I'm an investor and... you're welcome) \"Downtown the young ones are growing\" https://t.co/90zq8bNQek This is awesome. @johnlegere &amp; @TMobile making dreams come true: https://t.co/9kbf7n4m2i Thanks @nixon_now for getting the Brigade back together at @activerideshop for the -#nixonbonesbrigade watch collaboration this evening https://t.co/yvwOND3qPt Happy birthday / Mazel tov @ericandre!\nGood luck with the... circumcision (?)\nStrange things are afoot on my Instagram story https://t.co/c0tw5KnFUv A $20 @THF donation gets you a signed 8x10 &amp; a chance to win a live FaceTime \"demo\" on my ramp (via @Chatterstars): https://t.co/ETqTbTUrs1 Check out Japanese vert destroyer @motoshibata's 2017 \"Trannies\" video: https://t.co/okE2QO1HJx\n#LiveNowOnRide @RideChannel \n🎥: @brent_hyden Revisited this spot today... 35 years later. Can't believe I look exactly the same https://t.co/CacbVetYT0 Bucketlist item: get featured in an Italian rap song.✔️\nhttps://t.co/Lkla6vn76l The winner of my @chatterstars offer gets a 20-minute FaceTime \"demo\" with me &amp; other pro skaters on my vert ramp: https://t.co/bqcHHX1iFs https://t.co/mOVAcyeVGB Adios 🇨🇷 https://t.co/n98KFjaDkA Feeling hot hot hot (literally) in Costa Rica https://t.co/2A2aqrPyZi I got to say it was a good day https://t.co/F3GmEjUeWK Matching Airwalks with Rodney Mullen (flat &amp; vert) from our 2014 \"SYNC\" video on @ridechannel.\nFull video here: https://t.co/vJ0Wulv5Bq https://t.co/AycOEUs3L4 .@united - I was on a flight yesterday w/ a difficult situation  involving 2 passengrs\n@aagomezcrespo &amp; crew handled it respectfully &amp; adept Thanks to viewers of our BBHJ reunion earlier. Kevin ended it with a bang by dislocating his shoulder. (he's ok now)\nhttps://t.co/jymcf6PZAe https://t.co/dZxQ4xGZqQ The band is back together! Huckjam, that is.\nTomorrow 12:30pm PST live https://t.co/jymcf6PZAe\nWatch us forget our routines from 10+ yrs ago https://t.co/En0SpFybDp Happy 18th birthday Spencer!\n(aka @gupimusic)\nRemember when life was fun &amp; full of wonder? It still is, but now you have to pay taxes. https://t.co/tEsSsrP0rW Playing with myself at @MadameTussauds\nI was there &amp; a stranger asked me to take their picture on this display, but didn't realize it was me https://t.co/jBw89l25Iq He's right; anything's possible.  I just hope he's true to is word and behaves like a gentleman https://t.co/55Fpf7Abg2 Happy birthday to this maniac known as @theclintorous https://t.co/Jgu8ZpLdVl Thank you @TordrilloHeli for placing us in all the freshie gnar. https://t.co/g6pE4QjXu6 TSA agent (checking my ID): \"Hawk, like that skateboarder Tony Hawk!\"\nMe: exactly\nHer: \"Cool, I wonder what he's up to these days\"\nMe: this Skating on frozen sand, ice and driftwood on the Norwegian coast looks epic (&amp; miserable). \nHere are some clips from https://t.co/JoHoys2EpD https://t.co/fMGO8wT2Oy Thanks for the ride(s) @TordrilloHeli\n#shralp #powpow #brobra https://t.co/g6TS3CGGC7 \"Jumping out of my flesh\" https://t.co/4w2cGVjFES Don't try this at home... or anywhere else:  @takes_yo_bitch with a \"backside\" handflip jumpseat https://t.co/9nJ3jLpQiq Apres skate (at home) in 1989. Noteworthy: original signature deck (later stolen), Amiga 2000, Airwalks, recaps, inflatable palm tree, pink https://t.co/qClmHn0eOV @GameSack holy crap, yes I did Today @amazonsmile will donate 5% of your purchases to @thf.\nPlease help disadvantaged communities while you shop: https://t.co/H7IZnHs3M9 We love you @Lizziearmanto! Congratulations on the @thrashermag cover... \nand @Birdhouse PRO MODEL https://t.co/oawrDX9SzD I let @edsheeran borrow my skateboard and he won't give it back. He keeps sending me photos like this from his tour and taunting me with it. https://t.co/PNUcUhiqBx Here's your chance to get involved with the THPS documentary: https://t.co/dqZMEzDsBw (my only involvement was being interviewed) @THPSfilm Stacks on stacks with @andymacdonald for the cover of The Skateboard Mag a while ago. We tried this for 2 hours &amp; only made 1\n📷: @atibaphoto https://t.co/HLhn7wNs0b RT @UniversalPicsIt: Jasmine Trinca e @tonyhawk, questa sera ospiti a Che tempo che fa, vi danno appuntamento dal 23/3 al cinema con #Slam… stasera https://t.co/xXadb1EVQa Thanks for the session @bastardstore! https://t.co/MbfAZ5RwV8 Ciao bella https://t.co/jlFTFrTLxp RT @berrics: The @tonyhawk remembers his first video part, in @PowellPeralta’s “The Bones Brigade Video Show” [1984] https://t.co/e4GxlSAWU… The look of lorn:\n\"You're leaving again?\" https://t.co/BDZNYf6tZa RT @Buck: He’s one of the most recognized Action Sports figures in the world: @tonyhawk. Watch on #UndeniableShow tonight at 8pm @AUDIENCEs… Tonight! https://t.co/JSjFUp1VCZ Watch @jordanhoffart go for a 100' lipside at the new @BlackPlagueBeer facility (via @RideChannel): https://t.co/vE9G28HbMV I'll be on #UndeniableShow sharing my life story tomorrow night at 8pm (on @AudienceSports) https://t.co/MO2TmSc3cx RT @AudienceSports: I’ve had haters since day one. And I got used to that.” - @tonyhawk\n\n#UndeniableShow with @buck this Wed at 8pm PT/ET o… As a skate dad, here's the equivalent of seeing kids' 1st home run: witnessing their 1st 360flips while I metaphorically cheer in the stands https://t.co/IPMwig5hMZ Thanks @ericandre for hanging out today. Watch us discuss his show, Tupac, Cindy Lauper and dick pics at https://t.co/jymcf6PZAe #birdup https://t.co/VCtURTnHen Doubles with Keegan in 2004.\nHe's still this size as far as I'm concerned. https://t.co/82hw8s3bHB HAVE YOU SEEN US?\nBones Brigade 9th series decks available April 7, 2017 at 12pm PST\nPester your local skateshop to get them. https://t.co/tr4lqsEV7P Roller boogie robot skater by Boston Dynamics: perfect balance, big pop, total snake. #skynetskates https://t.co/kCyGfiEFFM Goodbye Bill Paxton. Thank you for decades of entertainment &amp; for giving us some of the most quotable characters that still endure. #RIPchet w/ my schedule I use @postmates for fast deliveries of almost anything\nDownload the app &amp; use code HAWK for $50 in FREE delivery credits #ad https://t.co/gIhcsFwIEq Where the kids have no shame https://t.co/R0Fbr9Y7IW Unfathomable: over 20 million people still live in slavery. \nHelp raise awareness with #EndItMovement &amp; take action: https://t.co/e234fifoVy https://t.co/fqXzvr28fI Taking direction from @rileyhawk666 in 1997. \n\"Hey dad, the tattoo shop is that way\" https://t.co/cKKwOemJKk Very cool tribute / remake of our original Animal Chin montage... 30 years later (via @BONESWHEELS): https://t.co/QOkXuPHVRk My run from @bowl_a_rama masters finals. Thanks to my family for flying halfway across the world in support of my refusal to get a real job. https://t.co/IujgG1VBDW A view of yesterday's @bowl_a_rama highlight: @buckylasek impossible tail grab to fakie around the corner; when difficulty factor goes to 11 https://t.co/qtaRqhsFhv Thank you @general_pants &amp; \n@bowl_a_rama for the opportunity to experience NSW with my family &amp; for hosting #bowlaramabondi\n#ilovesydney https://t.co/puYle58p24 I'll be signing autographs at the Indy booth (inside @BOWL_A_RAMA venue) at 10am. Come say hi... and bring coffee Great day of sandblasting with the fam at Port Stephens, warming up for General Pants @BOWL_A_RAMA this weekend\n#newsouthwales @visitnsw https://t.co/OSl9hsru06 Sydney via heli is hella sick https://t.co/jzSABZ5CVD RT @TravelLeisure: How one restaurant inspired @tonyhawk’s trip to Peru https://t.co/oXfxrKdDYM https://t.co/U0HHW1pEiF Planes, trains and stale fish; straight from the airport to Bondi @BOWL_A_RAMA practice\n(via @Boardworld) 📷: @rielywalker https://t.co/1tEIZrSF0X Thank you to my 🖤 for this beautiful Valentine video of our wonderfully strange kindred.\n🎶: Majical Cloudz - \"Downtown\" https://t.co/mtHSMVEB0d Happy VDay! Here's a way to share the love &amp; give the gift of art:\nwatch https://t.co/b3JMXXgVtR &amp; help people in need through art programs Judging the \"Coolympics\" w/ @snoopdogg on Cleveland Show. Coolest part was being introduced by David Lynch, &amp; I skate switch while animated. https://t.co/YhR4OsFJ9c Best email subject line I've seen this year:\n\"Tony Hawk and SHARKNADO - one-day cameo as a shark-killing spy\" @JayFouz I did Very cool @WildBeasts video featuring girls in India skating against all odds: https://t.co/n751ZasiqR Roll in / roll out practice for General Pants @bowl_a_rama next week in Sydney. \n360 varials are the new layback airs https://t.co/KvI0Ljk17Z Thank you for the gift @TuftandNeedle! I didn't realize setting up a mattress could be so easy (or how much I hated my old one). #byefelicia https://t.co/g0MPvUcLU3 2017 marks 25 years of @birdhouse. Here are some of my clips from our 1st video \"Feasters\" in 1992\nFull-length team video drops this summer https://t.co/bzjAhJ3wp0 My daughter woke up with a sore throat and said \"I sound like @steveo without even trying!\" New executive order: Any negative reviews of THPS5 are fake reviews. @NicolaParish @galifianakisz you too! So funny Three reasons to see #legobatmanmovie:\n1. Seriously funny\n2. @galifianakisz \n3. Gleaming The Cube reference https://t.co/Xe9s8Oe41F RT @eespetacular: Skate na Alma: quadro do @eespetacular estreia com encontro entre @bobburnquist e lenda @tonyhawk https://t.co/x7UOsvZJJG Happy birthday to this beautiful freak of nature: @aaronjawshomoki\n(sorry it's a little late... just landed from Peru) https://t.co/Nm6Pnmd1Gh I want to go back to 1979 &amp; have my friend aim the camera better for this shot. Pretty sure I'm wearing cleats. \nClear grip + DTS = win https://t.co/H8jvOz5Lwk ¡Estamos! Right here, right now. https://t.co/xx481BBQ6q Pivot on the waterfall of what might be the only backyard pool with transitions in Lima. https://t.co/MlpIwZ98Cv Sightseeing in Lima with @acidinvader 🇵🇪 https://t.co/kbgYA6L6pn \"Breaking In\" w/ @ChristianSlater (2011). Show was canceled, renewed, then canceled again before this episode aired.. but cubes were gleamed https://t.co/zcUbvRv5QZ A THPS documentary is in the works... follow @THPSfilm for updates on \"Pretending I'm a Superman\" Our team meeting became a FB live session today. Watch this crew shred: https://t.co/jymcf6PZAe\nUnrelated: @birdhouse video is looking good https://t.co/Iw1YJUQ6TM Shiny new things from @birdhouseskateboards\nAsk your local shop or go to https://t.co/gNQupD9VVC to get chromed out https://t.co/PsNDk2CC1m My daughter upon wearing her prescription glasses for the first time: \"The world is so different! That guy across the street has a face!\" Happy birthday @lizziearmanto! Thanks for adding so much style to our team. https://t.co/sAdkCvGEKV @macfanatic56 we donated it to the Smithsonian a few years ago Today's trick: stale to smith\n🎥: @dupedupe\n🙋🏻‍♂️: @mitchiebrusco84 https://t.co/c7vVdqN1Vx For your consideration during award season: my role as a corpse on CSI: Miami 🏆 \n#deaddeaddeadski #rodstiffington https://t.co/Cytjc3vGQZ @XadybabyX happy birthday Peter! Thanks for the deepness @mammothmountain! 🏊🏼 https://t.co/ZyZwbsvXyU The transfer of powder is complete @MammothMountain https://t.co/tnN76PtdpJ Kickflip commander @Mitchiebrusco84 defies physics https://t.co/0h6dgMjtYS Watch our @starkeycares mission to @skateistan Johannesburg, South Africa: https://t.co/AodNR2hxgO\nWe brought the gifts of hearing &amp; skating Thank you #motorcitymini for letting me use a sweet Clubman during our visit to The D. #notexactlyanad #adish #iborrowedacar #socoldinthed https://t.co/QVJGFRnhGg I earned this trophy in 1997, lost it, found it 20 years later, &amp; now out can be yours (but time is running out):  https://t.co/QIYa2AJDWl Doubles with Mark Gonzales from #elgatoclassic https://t.co/Gb9L27lzfg Lat day to bid on my long-lost trophies (from 1991 &amp; 1997):\n\nhttps://t.co/ODdq748BVU\n\nhttps://t.co/cM40YH13cP?\n\n(% of proceeds goes to @thf) Alzheimer's has robbed my mom of her speech &amp; her memory, but her love of soda remains. This simple pleasure means so much. @alzassociation https://t.co/I5BT5JYuqk Doubles with The Gonz at #elgatoclassic yesterday https://t.co/l5eRu7G1BJ @StevenPenland nope RT @RideChannel: .@tonyhawk, David Loy, @shawnhaleyeah &amp; @iamthalente traveled to South Africa to help children hear https://t.co/xG5yPsDe9… The history of THPS from a few people responsible for the series' success: https://t.co/DB9tLhWz3U A rite of passage: bar hopping with my kids (Keegan &amp; @rileyhawk666) \n🎥: @dupedupe https://t.co/GfQP2KJxWd 1991: Rampage Skatepark in Leigh-On-Sea (Essex England). 12 Mctwists to Ollie 5. I'm still dizzy from this. https://t.co/Bc65b7iZnh I found a two old trophies in storage, and they are now up for auction:\nhttps://t.co/cM40YHiE4n?\nhttps://t.co/ODdq74qcNs\n(% goes to @thf) The Suite Life With Zack &amp; Cody (2008). If I had a TV show in the 2000's it would've been called The Cameo Life With Tony &amp; Board https://t.co/c6aNcFBwg1 Goodbye @BarackObama, thanks for letting me skate in the House. https://t.co/MmSkSK95AL @VirgilioCentral Hi Virgilio, please check your DM's on Instagram One more long lost trophy, from 1997 \"SuperSession\" in Sweden (check YouTube): https://t.co/cM40YHiE4n?\n(portion of proceeds benefits @thf) Recently found my trophy from 1991 \"Capitol Burnout\" comp (Sacramento), so now it's on ebay: https://t.co/ODdq74qcNs\n(portion goes to @thf) 900's are the new touchdowns https://t.co/8WBzXxWI94 Posing a frontside rock in front of my dad on our jump ramp. Sports Illustrated, 1987\nUnrelated: not my skis https://t.co/CXlrXXcIvM Going live on Facebook with this extremely talented crew in moments. Tune in, turn on, freak out: https://t.co/jymcf6PZAe https://t.co/mVLqtGCRUe Had no idea when Chris Miller &amp; I got asked to stunt double Kurt Russell &amp; Peter Fonda that we'd be in cinematic gold: Escape From LA (1996) https://t.co/DLo4mTu3T8 These tricks are so last year.\nThanks to all my followers for still believing in this grown ass man on a skateboard. https://t.co/Dtno20jQkz This @jgrantbrittain photo of me in 1986 is available in limited edition of 100. Each 11x14\" is signed by both of us\nhttps://t.co/0YMIhCFB2z Make America Skate Vert Again\n#smoothtransition Fam shralping @MammothMountain \n🎶: Devo- \"Snowball\" https://t.co/4HXG3TWSde Jumping into 2017 with the new #Battlefield game. Who wants some? #ad https://t.co/s4PmKtirRQ Our @birdhouse team is like a family and I'm thankful to share so many good times with them in 2016. Watch for our video dropping in 2017! https://t.co/JPT0qy7hJo Here's what I was doing at the exact time of my supposed demise. Don't believe everything you read... we can do better as a society. https://t.co/Xhdz7ru6Pv I'm still alive, just older (&amp; wiser...?). But still breathing, riding my skateboard &amp; raising kids.\nF off 2016; you won't be taking me too. Hey @KutuUpMusic, thanks for supporting @THF! Go see them tonight at @BellyUpMusic &amp; help build skateparks in low-income areas. https://t.co/9BqObzKbQz This documentary is a great insight into modern skating &amp; 4 icons. Guy Rudy Gabriel &amp; Paulo were ahead of their time https://t.co/K3lVfjCcxq Sent this \"card\" out to friends &amp; fam but didn't share it with my 4+ mil friends here.\nHappy holidays from [so many of] ours to you &amp; yours! https://t.co/lj2wKn3REC @VAdashVA it's all hers Santa came early to our place, so anybody in San Diego want a used trampoline? Come today if possible. Totally serious, DM me for details. https://t.co/Wk1uUAdVv0 That time I was Lionel @damustacheman on #LoiterSquad. We get mistaken for each other a lot, so I was the perfect choice to be his double https://t.co/OwfU5uUI0Q Here's a recent interview from @TheKit with info on our #tonyhawksignaturecollection (available now at #Walmartcanada). #tonyhawkclothing https://t.co/VGTTb9X1pk RT @berrics: .@colinmkennedy asked @tonyhawk, \"What ever happened to your street skating career?\" This was his reply. https://t.co/2vIx9SBu… Thanks to the epic crew for donating their time yesterday for our @TheArtofElysium video. Here's a behind-the-scenes shot of my alley stunt https://t.co/SeBAgY6JK0 Thanks for having me on @TheArtofCharm! This was a great discussion. https://t.co/3JSrnZRpYn Two of my favs at once: skating &amp; sushi (from the @DimeMtl video)\nThis is literally a 50/50 to stale fish https://t.co/g7tJQ0D1xl Possibly the cutest thing you'll see today: Jesse Fritsch skating with his daughter... just before she saved me: https://t.co/DHh7BJikbb @l_aurentaylor I'm honored you asked, but I must politely decline Part 2 of my Skaters In Cars episode is live. We discuss Del Mar, loops, jumping MINI's &amp; not having a shoe sponsor: https://t.co/9kBuAXDJA4 Thanks for lunch @ActionBronson! You were right, that's delicious. https://t.co/NMEEpi94yu Our 2004 Huckjam Happy Meal Toys were so sick. Thanks to @LuckyPennyShop for this entertaining demo of each one. #competitionisfierce https://t.co/35qhfhLiQ5 One thing I learned while playing poker against @ChuckLiddell: he never backs down. Watch us battle tonight at 7pm PT on @CBSSportsNet https://t.co/vxJHLI2huK \"In the city there's 1000 things I wanna say to you\" https://t.co/7HxIZNA6ca Backside air DMSR, 84-ish.\nSome call it a crossbone, but I call it Hosoi Air because @christianhosoi made this an art form\n📷 @jgrantbrittain https://t.co/z8MbCM1Kdu Very proud to be part of this retrospective on Animal Chin, and our return to the original ramp 30 years later: https://t.co/XNB3cPvyTj Tomorrow night: let's gleam cubes, have drinks &amp; raise money for the Solana Beach Skatepark project. Come early; 9pm is way past my bedtime. https://t.co/j6hAaxu84f Reflecting on The Search For Animal Chin (among other things relevant to an aging pro skater): https://t.co/9kI5thJfik Happy Birthday @rileyhawk666! You are now the age that I was when you were born. Thanks for making the last 24 years so meaningful. https://t.co/3abe27DWML Back to Bondi! Looking forward to @GeneralPants_ @bowl_a_rama 2017.\nTickets available at https://t.co/5eOHMjwafQ\nSee you there! #ilovesydney https://t.co/uyWAk6D8uG Winter is coming: @tomschaar at @jlaskatepark https://t.co/3OALjyaSWu I can https://t.co/acbRAl0bwp Sorry folks, park's closed. The moose on a leash should've told ya. https://t.co/2EvBeyMeE7 🏂🏂 @MammothMountain https://t.co/t9gOyZ7cpu Thanks Maria! I mean... sorry? https://t.co/l5vZxbHnRR I'll be playing tomorrow in @PokerCentral’s #CharityShootout to raise money for @THF (and skateparks for all): https://t.co/dKCDj1nTn9 https://t.co/jWgOs2hiev RT @ColecoKid: Up for raffle a @tonyhawk photo to benefit the resident's Christmas fund Brownfield Rehab &amp; Care Center. Entry info https://… Marcelo Lusardi cannot appreciate how amazing his skating looks, but he obviously feels it (via @muckmouth).\nYes, he's blind. https://t.co/Gvn60mrsgC RT @BonesBrigadeDoc: .@tonyhawk explains the origin of the Japan Air over on @TransWorldSKATE &gt;https://t.co/e4P0JnT1M0&lt; https://t.co/1mdYgo… Always down to help my homie Homer https://t.co/QF3H2Dk5nm Epic... @chillrobgee: \"kid in Nicaragua was butt boarding down a slide on this thing. He said he asked for a skateboard &amp; his pops made it\" https://t.co/01q1iHot72 @kmansnowden @MatthewSantoro @McD_Canada @McDonalds I still eat it! Had some on Friday... Been trying this (540 shove) for a while but decided to get serious last week. Dug deep, blasted new @ATCQ &amp; made it next try. True story. https://t.co/ab83hhe82T Tosh.0 Web Redemption featuring Serge Murphy &amp; Old Man Hawk. https://t.co/vWtLKODcLx \"content\" I've seen lately that made long flights enjoyable:\nOne Mississippi\nMan vs Snake\nPopstar: Never Stop Never Stopping\nLife, Animated Part 2 of Weekend Buzz w/ @stevecaballero &amp; @MikeMcGill_ is on @RideChannel: https://t.co/dCN3gzhIkR\n \"Do you choose to chew goo too, sir?\" Thankful for the hospitality we received in Costa Rica... even through a hurricane. Gracias gigante @tomgreenlive! #puravida #kookaladia https://t.co/37gDSR9VMx Get involved! Donate $1 (or more) and help change lives through Laureus Sport for Good! I just did: https://t.co/OOmoSIxFYv #myLaureus https://t.co/H7MdTzu0vL Skateboarding on (and way above) snow by Terje Haakonsen https://t.co/RBU3ISwMC1 Thanks for the session El Mutante! #puravida #elsmitho https://t.co/EpQ6vXcMtD Here's @AlbeeLayer with what I'd call an Ollie 7 revert, but surfers say 540 for reasons I refuse to understand. Either way, it's next level https://t.co/KyAvmi8lsj Thank you James &amp; @sortlandic of @TheShins for making our @THF fundraiser so memorable. This is just a Simple Song but it means everything. https://t.co/0hK18ADPRk \"on the bus today,\nI met the queen of L.A.\nAt least she said she was,\nand who am I to say?\" https://t.co/ollxiCEM3z Thanks to @MINIUSA for giving me a first look at the #NewCountryman, a solid adventure vehicle. Check it out for yourself. #ad https://t.co/sBjXBalnrK This is the face of a little girl after landing her first legit front flip. Thanks @TempestAcademy https://t.co/O3NUMGHftp That time I called my brother for help on Who Wants To Be A Millionaire because Hemingway. This was the seed money for the start of @THF https://t.co/XK4U8aZxyf I’ve ollied MINIs before but I may need a bigger jump ramp for the #NewCountryman. Watch livestream reveal tomorrow on @MINIUSA Facebook #ad [LK] AMA! https://t.co/zL2dC1u2R3 This #30yearsofchin show is unlike anything out there. Please watch... today! https://t.co/DSWS4FNIzE RT @dannyway: I didn't invent this trick but I have sure had a good time doing it over the years. Thank you @tonyhawk for inventing this on… Make cubes gleam again\n(via @capturedtattoo) https://t.co/0Tcc6lGKdY Happy Veterans Day. My dad was a  WW2 pilot. 1944: uncertain of his future &amp; country's direction. He smiled, got to work &amp; raised a family. https://t.co/JyKFTeqwni RT @RideChannel: Here’s what happened to the legendary ramps behind @tonyhawk’s old house https://t.co/cwB1z4URZ5 I found a happy place (for now) https://t.co/wCk5GpInwW Go vote! Then watch this:\n(or watch this, then go vote... but only if the polls will still be open) https://t.co/GJIzJ36bl2 @JoeyBmidC legit Happy birthday @stevecaballero ! Killing it in 1980 with a style that we still wish to emulate https://t.co/DCJYmKqDha These girls rip: https://t.co/kClKQKeFil Insightful article about our recent 30-year Bones Brigade reunion: https://t.co/kdVjKpWZ06 ..nor did I want to be. The segment was strictly satire; I didn't think it would be taken so literally. I'm wary of the issue BECAUSE I ❤️SD https://t.co/ravLjeSFTR But now I've made it since you followed me back... https://t.co/crbK5GTX2m When they said we were going live, I thought they meant in front of a studio audience. I had no idea we were going live to the whole world.. https://t.co/mD7TVnhRBs I was privileged to be on a panel discussion with @icecube about \"longevity in the game\" at #complexcon. Cool factor: 11 https://t.co/lhYDDDj72e Let It Be known that The Beatles were goofy-footed. According to @thenewno2, George could also skate switch #ringowasmongo https://t.co/ORaEIsvIuK On the last day of our #30YearsOfChin shoot, we invited other skaters to join the celebration. Watch the fun here: https://t.co/LdgNyfjWfJ April 1990 issue of @thrashermag, when contest placings were still a thing. https://t.co/aGqYfBL78G My friend @MikeEscamilla helped create a legit survival kit &amp; he has the life experience to back it up \nhttps://t.co/lJteQ6DspE\n#TheSEVENTY2 THIS! https://t.co/8j5fmy7Zm9 It is a little known fact that Larry David is actually a pretty, pretty, pretty good skater. https://t.co/oGvFPs4oAY Just saw #HacksawRidge with some fellow comrades. Great movie with an important message during these strange times. https://t.co/KcxEKfPVPf @LSAneta oh no! Send it to me (Vista address) and I'll replace it and send other goodies 30 years ago, we didn't put much thought into the iconic Chin photo. Recreating it 3 decades later was not simple: https://t.co/fJjFlYR5od @aidansdaddy619 congrats! Please check your DM's These were too good, so you both win. Congrats @majorhole &amp; @aidansdaddy619, see you tomorrow for a screening of #HacksawRidge! https://t.co/6q4P2EhbWR I have a pair of tix to an advance screening of #HacksawRidge in San Diego tomorrow night. Best reply in 30 mins wins (if you can get there) https://t.co/LuA16PDO1e Hey you guys https://t.co/6ozEM7tnc3 The legacy of The Search For Animal Chin, and how it resonated through generations of skating (&amp; up to Tokyo 2020): https://t.co/Un9iyklLtI @WEBZ619 yes, yes it is. You seem to be the only one that gets it though. Thank you. 30 years later and the Chin Ramp is like an old friend to us. Watch us travel through time: https://t.co/RRlB7RsEPy #30yearsofchin https://t.co/x5omn5fEUP It was an honor to join #QBConnect with inspirational speakers @BillRancic @JillianMichaels @csiriano &amp; @Simone_Biles Unrelated: I’m 6’3\" https://t.co/lhTToDij1Y The Chin Ramp was built 30 years ago, was up for only 3 days &amp; has not been re-created since then... until now: https://t.co/dHtFQzWr27 @howiegoldfarb @juicero nah, just a fan If you build it...\n(watch @ridechannel tomorrow)\n#30yearsofchin https://t.co/2JiSkSpsCo Acquiring my first \"sponsorship\" was not as glamorous as it sounds: https://t.co/fnWvDeZGDQ @Chris_Hadrick That's called a rock shuffle Yesterday we had a 1980's skate session (with Cab, Lance, Hosoi, McGill &amp; Staab). Here's the totally radical video: https://t.co/ZnY4bKKf4p 1990 was a strange time: vert skating was supposedly dead but I wasn't giving up the ghost considering this setup: rails nosebone &amp; Rip Grip https://t.co/TkNWQhyCnZ Thanks to #artofelysium for hosting our eclectic crew last night: @tomgreenlive @realjknoxville &amp; #rodneymullen https://t.co/MTwp1GJPEk Thanks for an epic meal last night! https://t.co/kCxV19dffX Watch us get totally radical Friday:\n @stevecaballero @lancemountain @mikemcgill @christianhosoi https://t.co/jymcf6yoIG https://t.co/SVf2d5HLNW Live now with Weird @alyankovic on Demolition Radio (SiriusXM 41 @RadioFaction) call us now! 1-877-HEY-HAWK Excited to have @alyankovic on Demolition Radio today, live at 4pm PST on @RadioFaction (SiriusXM 41). Longtime fan; first time interview Possibly my shortest cameo ever: N.E.R.D. - \"Provider\" video (2002) with @pharrell &amp; @travisbarker https://t.co/OGd5ruP1sO Thank you @EPLosAngeles for a truly memorable dinner last night. I'd be happy eating those sticky spare ribs every day. Can we arrange that? My mom has Alzheimer's &amp; she rarely recognizes us. Thanks @sethrogen for helping victims of this deplorable disease via #hilarityforcharity https://t.co/wqgRXzk7wU Happy Birthday to @peraltastacy who believed in me as a scrawny kid only known for \"circus tricks\"\nThank you for the guidance &amp; inspiration https://t.co/7MF7EQcDfb @MaxKHill North County: Encinitas Community Park (\"Poods\"), Alga Norte or Alex Road #impossiblesfordylan https://t.co/rApFMTOivL So true. I just watched this film and it speaks volumes about this particular issue: https://t.co/K6EgpB1zC7 https://t.co/Vb7cmvZv1R Stoked to speak at #QBConnect on 10/26 in San Jose, CA. Join us! Register here: https://t.co/rDHxswKlm9 #ad https://t.co/cTMb5jF0DD Today's inspiration: that one trick from Ban This... and Interpol\n📹: @dupedupe https://t.co/sDr3CkdfnC RT @Gizmodo: Big thanks to @tonyhawk for hanging out. See his answers to your questions right here: https://t.co/8k0PkwFk3c https://t.co/GV… @MichaelFNunez @Gizmodo we shall! Very much looking forward to being cool again... https://t.co/1hwhkoByHa To those considering going to #ellismania this weekend:\n1) I'm jealous\n2) Here's how to get @HardRockHotelLV rooms: https://t.co/gfzFlyzek4 My history with gadgets and the struggles of early adopting: https://t.co/m218TECqkf It's the last day to register to vote in many states. The importance of this cannot be overstated. Here's help: https://t.co/iajm5k0bSb @gupimusic @_yungslav_ some things can't be taught Here I am teaching @rileyhawk666 the most important life lesson at age 5: how to set up a skateboard. https://t.co/mLdwN2ipBF My daughter is already getting into politics by learning the art of flip-flopping. https://t.co/z8jV0LpZbK When life hands you hurricanes, evacuate... unless you're @billyinhawaii. #matthewmcgoneaway\nvideo: @deeznutshardwareco (via @LOWCARDMAG) https://t.co/vKcrjOvLOP Hellurei Helsinki! 🇫🇮\nSee you later at #NBForum2016 https://t.co/MOEOgSDvIx Words of wisdom in Finland: \"What you call soccer, we call football. What you call football, we call Hand Egg\" #NBForum2016 I [still] get the funniest looks while gliding through airports. #grownassmanonaskateboard #menacetonormalcy #needclearanceclarence https://t.co/GqWar9Pgl1 An important math lesson (from Sesame Street, 2008). My daughter just watched this and said \"look how freaked out I was!\" https://t.co/RtoQ3VXEyC The epic competition scene from Thrashin' (1986) featuring Josh Brolin and countless pro skater cameo (including yours truly) https://t.co/BKgHaAroHr Clips from our @THF East Coast Secret Session: https://t.co/BBzt3ao7Xg Thanks @MINIUSA @gumball3000 @starkeycares @HEXBUG @DynacraftWheels RT @RideChannel: Watch the best of @tonyhawk's East Coast secret sessions https://t.co/X6QcYc7AEF My daughter just learned flip flops https://t.co/Lkyx9jFI85 Thanks to this epic crew for an unforgettable few days. We'lll have more to share in the coming weeks. The search continues.. #30yearsofchin https://t.co/yEhfP6vyxs I'll be w/ @stevecaballero @MikeMcGill_ @tommyguerrero &amp; @LanceMountain on https://t.co/jymcf6yoIG 11:30 PST. We'll reminisce #30yearsofchin We [still] have a friend, his name is Animal. #30yearsofchin https://t.co/Kd4aHuqlrr We just had a next-level tasting menu by @MVoltaggio at @Ink_restaurant &amp; I felt compelled to share with you (the experience; not the food). https://t.co/fJujkq0iEf We are live with Mark Mothersbaugh on Demolition Radio (on SiriusXM 41 @RadioFaction). Call in and join the de-evolution: 1-877-HEY-HAWK Thanks for the session @AcademySkatePrk! Never done this over a channel before.\n📹: @NealMims https://t.co/VlM7SUJbkS Just saw #DeepwaterHorizonMovie w/ this brigade. It is a riveting thriller unlike any other; the movie, not the crew https://t.co/Cv2SjODTrU Gift from @johnedale: actual plaque used in The Big Lebowski's hallway scene.\nRacially, he's pretty cool. https://t.co/VtdSGWSNBm @whatislevi @purple_tuesdays thanks bro! Although I wasn't expecting a photo shoot while hurrying off a plane to make a connecting flight @jen_schues it's real. It looks like it was done in a hurry or in a chaotic state, but it's real @carlsullivmusic thanks! I appreciate the support Last day for raffle tickets to #BonesBrigade 30-Year Animal Chin Anniv; $10 donation to @THF for each raffle ticket\nhttps://t.co/1q2yXsv5Zz RT @RideChannel: 180 degrees of difference: @tonyhawk remembers the response to the 720 and 900 https://t.co/G9fzA83GfA Melon backflip frontside rock? Whatever it is, David Lafreniere conceived it and made it a reality https://t.co/OeR0yDOqDI RT @crowdrise: Ever wanted to skate with @tonyhawk and the #BonesBrigade crew? Well, it's your lucky day. https://t.co/7ZcA6278uv https://t… Congrats to Sam, who found me skating down Allen Street. Enjoy! Those gold Indy's brought me luck the last two weeks https://t.co/rdiBnFvi7S If you see me skating around NYC, ask for my board &amp; it's yours. Let's stay safe while continuing to enjoy all this fine city has to offer. Thanks for the session @ericandre! https://t.co/TmpHmTsKc6 So fun to see @gupimusic in his element and rocking the big 🍎 https://t.co/cMQRgJjhak 🐦⬆️ https://t.co/ucfTidA6QR Just saw @davidblaine at a sushi bar in NYC. He came to our table, did a card trick, then left us questioning the fabric of the universe. One of the most inspiring stories about skateboarding positively changing lives comes from a small village in India: https://t.co/hQrQEna6Ts We're having a 30-year Animal Chin reunion with the Bones Brigade 9/30 with a big surprise. Here's a chance to join: https://t.co/1q2yXsv5Zz Demolition Radio is back! I mean, live on @RadioFaction (SiriusXM 41). Call in to hear your own voice all over the airwaves: 1-877-HEY-HAWK RT @truTV: Pro skater @tonyhawk pulled the perfect 180 on this aspiring prankster. #Fameless https://t.co/ELIX8MwiJ6 Never forget: this happened in 1987.\n#psychostance #slideyourfootoverhere #raisedonleather #kickflop https://t.co/EY8gE2iCak A few friends made lasting, positive change in their lives thanks to @decisionpointAZ\nIf someone you love needs help https://t.co/6sQntahutn Innocence lost: Bruno @mussoinc in 1989\n📷: @originalbk https://t.co/HbDBW7RFGb Our trip to South Africa &amp; @Skateistan, a video diary (kinda) https://t.co/8ezsfY3NyU Shove-it rock clinic, Oasis, 1980. Looking back, I'm hyped on the Lein Air... &amp; the socks (shot by my dad on Super8) https://t.co/6bmS6BKekH That time I interviewed blind [literally] skater Tommy Carroll, who showed me his tricks, then pulled his eyes out: https://t.co/NQtgTpk4UV Thank you #motorcitymini for loaning me a Clubman while I grab stale fish in The D.\nPhoto: @CameraJesus \n@MINIUSA https://t.co/XSEZYXTxOT Bare necessities: the @birdhouse video production vehicle https://t.co/tZQq3HCyEh Congrats @shawnhaleyeah on his vid (drops tomorrow) at @thrashermag. Slap him high five at Garden Bowl 2nite (The D) https://t.co/iUcEKEudwx I was a human rollercoaster that day; it was exhausting yet utterly rewarding. Thank you @starkeycares! https://t.co/50NieUrWmi For every shirt ordered from @LevateeApp until 9/14, $10 will be donated to @THF. Design your own... or copy mine: https://t.co/NmJngC6SZa Right now! https://t.co/NEuxYJP9wb Cashier: \"Why do you look familiar? Did you used to skate?\"\nI think I just got a glimpse of what my future might look like. Become a member of \"The Spring\" at @charitywater &amp;100% of your monthly donation brings clean water to people in need https://t.co/PyAo6O3BKm My videos of @steveo's debacle yesterday. Final tally: broken/dislocated ankle, fractured heel, sprained wrist. Ouch https://t.co/Y1GGvp6fIo Found a book my daughter wrote at age 6. My favorite passage: \"In my fantasy world it would just be Friday and Sunday. Friday Sunday YAYYYY\" Thank you @Corkcicle for all the cool stuff, especially the Whiskey Wedge (which has already been put to \"good\" use) Boating with @BAM__MARGERA from season 2 of Jackass (2001) https://t.co/DxfmJz86w7 Listen to @banksandsteelz. You're welcome. @achtung8a8y yes and yes, shipping might be pricey though. DM for details The latest @birdhouse series featuring my new claim to fame. #circleoflife #mealticket  https://t.co/gNQupD9VVC https://t.co/bWAOyCor2o Watch @rileyhawk666 discuss broken tables &amp; nearly-broken ankles on @RideChannel's latest Free Lunch: https://t.co/0tuC12oZK7 Double dipping in the D https://t.co/K4Ws0LBt2j This is @elliotsloan doing a Christ Air in Moscow last week, proving that everything is big in Russia.\n📷: @marklosey https://t.co/DSL5SBQ9Uf Currently killing it on snapchat\n👻tonyfrankhawk https://t.co/DWFB5Q9FMi I doubt that vert will be an event in the Tokyo 2020 Games, but I'm learning this just in case (via @PlayFactorySK8) https://t.co/qxZH0V9hHf Watch Clive Dixon's \"Surfing With Satan\" video for some daily inspiration: https://t.co/n9khBpcKMn correction: FOUND by @ellejem https://t.co/ugkQCbbmXu @ellejem @ElleJaime oops, sorry wrong tag I just left my skateboard in this planter. You can have it. Reply with the hashtag I wrote if you find it. Bye TO https://t.co/DUz7TqNB6Y Great shot! https://t.co/S2h2DDFY7T Thank you Toronto! Here's a doubles pic with the birthday girl. 📷: @corbinharris https://t.co/KDT1uVHLGE Good to see you @JonahHill! https://t.co/Kz99WKsnD2 Good morning Canada! I'll be hosting @bttoronto soon and then skating here... rise and grind. https://t.co/hBgQy4tD4I 1985: My first-ever 720 (at Eurocana Skate Camp in Sweden).  \nI tried my first 900 3 years later\n#squattypotty https://t.co/cHezkIdL92 Toronto Thursday! https://t.co/mIfr4sG5f1 Great article (+ pics) about our trip to Johannesburg: https://t.co/B3teHjvwbU Thank you @WeChatZA for making this possible! https://t.co/UnqKvDOBsX RT @timmoolmanphoto: Front blunt by @tonyhawk for the @WeChatZA demo at Germiston Bowl today. https://t.co/UVEX87VGcT Full disclosure: this is how I end a demo if something goes wrong while I'm skating (like today) https://t.co/7zrHdYme9o The Madonna before the stitches... thanks! https://t.co/b41Jofq8xA Thanks to everyone that showed up at Germiston Skatepark! Sorry I had to leave abruptly; split my shin open on that 540 mishap. #stitches Just rode the @Skateistan facility in Johannesburg with the locals &amp; going to Germiston Bowl soon. See it all live: https://t.co/jymcf6yoIG After our @starkeycares mission yesterday, I became a human rollercoaster to some of the kids at the new @skateistan https://t.co/fDuIL8BoQJ Oh, the places you'll go https://t.co/zZPNGclttV Sunday, 3pm, Germiston Bowl! I'll be there with @_davidloy @shawnhaleyeah &amp; @iamthalente  https://t.co/4YOk5eZQqW We got a sneak peek of @skateistan Johannesburg. This kid grabbed my board and was unwittingly the first to ride it https://t.co/lZRZ0LMp87 I'll be skating Germiston Bowl / Skatepark (Johannesburg) August 14 with a few friends that truly rip. More details to follow. Happy Birthday @MikeEscamilla! Thanks for all the laughter throughout our years of ridiculous worldwide adventures. https://t.co/6ySDQ7ZSzv This UK community is honoring the life of Ben Wragge in a meaningful way (by building a skatepark). You can help: https://t.co/KAIzZDibuC! Hey Toronto, see you August 18! Free vert demo at Yonge-Dundas Square: https://t.co/2Yda4K9NtM Here is the next chapter of the @MINIUSA #DefyLabels campaign. Good luck to the U.S. Olympians in #Rio2016! #ad \nhttps://t.co/35cgaXISXA @Burt__Man I'm driving by right now (for real). See me waving? A true professional: \"Hello, this is your driver from Door Dash. Your food is going to be slightly delayed because I just got rear-ended\" I'm already preparing for Tokyo: conducting drills, rehearsing routines, changing diets, and [most importantly] reversing the aging process. Thanks Johnny Knoxville for joining Demolition Radio (on @RadioFaction) today, and for helping grab my board. https://t.co/xeekGbhNL3 RT @DavidSpade: Hey heres me impressing @tonyhawk with my skillzzzzz. FAMELESS tonight on truTV 10EST, 9CST and 7PST (Crank volume) https:/… UNCHAINED: The Untold Story of Freestyle Motocross is available today: https://t.co/rbyF2wrjT8 #BRAAAPhistory Never has skateboarding and espionage (and bazookas and blow-up dolls) been combined so seamlessly in cinema: https://t.co/1ZQ2HyvWeo My Instagram life, summarized: https://t.co/T7JdSvPdy3 I never realized we had a high dive until @theclintorous made it so https://t.co/57gyrsyqGL Thanks @LOWCARDMAG for reminding me to do Andrechts more often. https://t.co/UZMga4CHmh Flyboards and Jetbacks and \"Hoverboards,\" oh my... @AquaticAviation \nhttps://t.co/2JSbSEk6Yv Thank you https://t.co/UKhoUZQbMg for giving our cat Milo a dogless route in/out of the house https://t.co/S8uhyXA8Qa TSA agent: \"yo TH, I'm better than you. I got moves!\"\nMe (holding skateboard up): \"ok let's do this\"\nHim: \"nah, I'll catch you next time\" Skate date 🍎 https://t.co/vwqAU20W3e Morning workout at LES https://t.co/e9VzfKp7fK A brief tour through Pokemon Park\n(formerly known as Central Park) https://t.co/X3zPoIvKUi Another cause I believe in is @charitywater. Here is a great campaign started by a talented teenager https://t.co/whAQPaU4is start your own! I am a Citizen of Skateistan. Join us; donate $10/month &amp; empower youth globally through skateboarding &amp; education\nhttps://t.co/MEhcCNzkLg @xdannyxbrownx thanks for noticing! Such a great song. I just learned a new trick for the upcoming @birdhouse video. You can watch the process in real-time here: https://t.co/leg019AcMi Catch em all! Try looking on beach boardwalks, near college campuses &amp; around gentrified neighborhoods for this one https://t.co/9LTy9Gn311 Dropping 🔨🔨 with @DavidSpade on #Fameless https://t.co/YN1j5MgLp9 Star Trek: Beyond brigade! So good... especially appreciated the Beasties segment (spoiler? nah) #StarTrekMovie https://t.co/1RGQfhwKGb DJ ftw! https://t.co/ENMujUSm8F RT @NickelodeonTV: Two skateboarding legends, one human bowling winner! @TonyHawk @JaggerEaton https://t.co/NKXnd8AfXl Let's play the Feud! https://t.co/Yuw0RjFBCU\n(we're on tonight with @MsJoelyFisher &amp; fam)\n@FamilyFeud @FamilyFeudABC Check out @MINIUSA rallying to #DefyHunger: 4k+ Motorists hitting the road to #DefyHunger as MINI TAKES THE STATES: https://t.co/63aL21t5ws All of my 900 attempts from June 27, start to finish: https://t.co/If8rnGcgAB\nThe struggle was real... frustrating. My son: can I go out on the #NitroWorldGames course when it's over?\nMe: to skate?\nHim: no, there are some Pokemon down there.\n#huckachu Hosts for tonight's #NitroWorldGames on NBC: @btoddrichards @TravisPastrana &amp; older skater dude. \"We'll do it live!\" https://t.co/MdoWQO0Jgk RT @FamilyFeud: Let's get ready to roll! @tonyhawk is on #CelebrityFamilyFeud SUNDAY 8/7c on @ABCNetwork!! #FamilyFeud #TonyHawk https://t.… Let the #nitroworldgames begin (qualifiers, that is) https://t.co/Ju8qnW5MzD Good to see you @StephenCurry30! Watch the #kidschoicesports awards tonight to see one of us skate into slime https://t.co/4dO7bO2fJL Inside the mind of our forefather Rodney Mullen, and his thoughts on \"Liminal\" (his latest video) via @esquire: https://t.co/H7lV7XHGvH Here's what an \"afternoon in the @TransWorldSKATE park\" with the @birdhouse team looks like: https://t.co/zsb13xkqVV If Huckjam still existed, it might look like this: @NitroCircus first #NitroWorldGames, live Sat 8pm ET/PT on NBC https://t.co/QZ3FYMwE4I Survey says: this Sunday I’ll be on @FamilyFeudABC going head to head with @MsJoelyFisher! See it at 8|7c on @ABCNetwork. #SundayFunAndGames Some gear I used while doing a 900 recently is on eBay, portion of proceeds benefit @THF (auctions end tomorrow): https://t.co/Tm0eGNFob4 1995 Coke commercial directed by J.J. Abrams featuring stunt-doubles @christianhosoi Omar Hassan &amp; yours truly https://t.co/wH5ay9fRFQ With all the craziness happening in the world, here is a glimmer of hope: new Rodney Mullen footage! https://t.co/KMRFzFsIL9 I left my wallet in El Segundo (on purpose, along with this @Nixon_Now watch) just now. Finders keepers #gotstogetit https://t.co/gmqLMvO0mx Two extraordinary skateboarding feats that were in my feed today, had to share: Greyson Fletcher &amp; Clay Kreiner https://t.co/4ccmk4QZcE #StartWithASmile on #PrimeDay at https://t.co/E4ke7LU9ad to help @Amazon &amp; me support important causes like @THF #ad https://t.co/BWkNS8IN6N This helmet saved me a few times during my 900 battle last week, now it's on eBay: https://t.co/e76lhAG61x (% of proceeds benefit @THF) Thanks James! If only I could get my kids to learn stuff from me... https://t.co/4fsjbxhf7Y What's the best way to embarass your family on national television?  @FamilyFeudABC is the #1 answer. Watch us July 17! #CelebrityFamilyFeud I might be more excited about this upcoming Rodney Mullen video than he is... https://t.co/qItn4JnaRq RT @ComplexMag: The shoes that @TonyHawk wore when he did a 900 last week are for sale on eBay: https://t.co/DSV73IFvxE https://t.co/tTmPLG… Some of the items I was wearing during my 900 last week are on eBay:\nhttps://t.co/Tm0eGNWZ2C\nhttps://t.co/MBKmR0elUr\nhttps://t.co/GdEtIrmfSF Daily motivation: Vinicios Sardi doing frontside alley oop (among other amazing delights) https://t.co/zH7eMk8zIm 🇺🇸 F yeah https://t.co/ONBqO1nNVg Lighting it up this evening: @gupimusic https://t.co/WQvD3oNziz Good, candid photos from #clashatclairemont last weekend by @truephotography: https://t.co/1wM4cUC6Rc Video of my last post, including K Staab cameo. Thanks to Jeff King for his MacGyver skills. \nShot with #ActionCam https://t.co/d1SWXnucGq Perch pivot from latest @SkateboardMag l. Landing this was almost as hard as installing the thing.\n📷 @jgrantbrittain https://t.co/3Qagiw2N6c 1977: swapmeet deck, Gullwings, Sims Snakes, driveway ramp, volleyball pads. The fakie \"pretzel\" grab was next level https://t.co/Ik9AhmxBFz I'm happy yet horrified that this is news... (I mean the \"sausage slip\") https://t.co/27bdCmnMJr @dannyway thanks Danny! Couldn't have done it if you didn't pave the way A Day in the Life of a Skateboarding Dad: https://t.co/tGyyvpY5b7 @BakaryBurner Thanks! @ofk_aaron Thanks! @Xeh_la Thank you! @Th3_Sauce Thanks! @Im_Nebulaa Thank you! Thank you for all the kind words. I'm sore but thankful today. Please consider donating to @THF if you're inspired to make a difference. Here's my 900 at age 48. Sincere thanks to @Nixon_Now &amp; @MINIUSA for believing in this middle-aged skateboarder: https://t.co/Ga9Jy0DgIr I made my first 900 exactly 17 yrs ago. Today I celebrated by making it again at age 48 (video coming soon). Thanks for the years of support I'll be on @KUSINews' San Diego Tonight tonight (that's not redundant, I swear) at 9pm. Stream it here: https://t.co/0tQZZQf9Ru #stayclassy Thank you! It was a magical day. The photos by @CameraJesus are unreal. https://t.co/Gbacbzh8nA Trying to channel my inner Brian Cranston to no avail. He is phenomenal in #theinfiltrator\n👍🏼👍🏼(&lt;-- two thumbs up) https://t.co/1STO6jDeoA Triples encore: successful. Thanks #clashatclairemont &amp; congrats to @treywood on 1st at #skatercrossskateboardracing https://t.co/BizBQnLhfy This picture of a girl in India is my new favorite skate shot (via @roarkrevival @jamiethomas) https://t.co/VnRvKumx4G Happy birthday Clive! Thanks for being such a team player. https://t.co/nRBhPNYh32 RT @RideChannel: .@tonyhawk, @aaronjawshomoki, @Lizziearmanto, and more, pay tribute to Ray Underhill. https://t.co/f6VWBmIaAR https://t.co… @ilovefalsemetal Double Vision @ikonenotto I believe you might have cut &amp; pasted that from somewhere else, but well played. You win. DM me your address. An invert line I did on my 40th birthday. First to name all of these correctly &amp; in order wins a @Nixon_Now Blaster https://t.co/dhUjqqptuH Demolition Radio is starting very soon. It will be broadcast live on SiriusXM 41 @RadioFaction. You may call us at 1-877-HEY-HAWK. Thank you Looking forward to it! https://t.co/y4l7TWRtal Happy Go Skateboarding Day. I gotta find volleyball pads, Norcon helmet &amp; Mr Bill shirt to re-create this pic in '78 https://t.co/kyGdbbpt8G My favorite moment from #getradforray yesterday: Ben Raybourn doing a coffin roll-in. Thanks to everyone that showed https://t.co/PELPmyyJe3 RT @alzassociation: .@tonyhawk Goes Purple for his Mom &amp; all those living with Alzheimer's. Tell us who you Go Purple for. #IGoPurpleFor ht… RT @TheBoardr: Scenes from #GetRadForRay @KennesawSk8park with @tonyhawk &amp; @grindforlife It's on tomorrow: https://t.co/Vka0tSsu4o https://… Warming up today with @grindforlife for Get Rad For Ray at @kennesawskatepark. See you there tomorrow!\n📷 @gonzthedog https://t.co/1VRhY6bapL Sunday: Get Rad For Ray. We'll be skating like it's the '80s &amp; raising money for cancer victims at @KennesawSk8park https://t.co/sgkWcIrxyZ RT @NitroCircus: #NitroWorldGames: @tonyhawk joins @TravisPastrana and @btoddrichards to host the broadcast! https://t.co/IPWVVZmAli https:… Winter is coming? Maybe, but until then...🕹🐜🍬🦄💩 https://t.co/bXjd3FD7sB ICYMI, here's the premiere episode of #GetWrecked (feat. @briansacca &amp; @rhysiedarby): https://t.co/y7zJIqahKZ https://t.co/rqQSDG1B81 Saw #NeonDemon last night. A beautifully shot, dark commentary on today's rampant narcissism. That one scene though... Flip in and flip out... of a wall dance: @aaronjawshomoki at the @TransWorldSKATE facility https://t.co/WH4V4jhl2X RT @kennesawparks: Meet @TonyHawk &amp; other #skateboarding legends at @KennesawSk8park this Sun, Jun 19. https://t.co/LK56NI4EtE #GR4R https:… Our surprise visit to the 500th @THF assisted skatepark (during their naming ceremony for A-Dog): https://t.co/0Duz0dMzjf RT @FoodNetwork: @TonyHawk guest judges tonight's #ChoppedJunior at 8|7c. https://t.co/qVkkfetzaq My #MoveLikeSteph wallride dunk.\nAnd you? @DegreeMen\nNoPurNec18+ Ends 6/20 Rls: https://t.co/X2jKLWGWtB #ad #contest https://t.co/YOvukiqqVk Driving today and Foreigner comes on @SIRIUSXM. My 14-year-old asks: \"Is this Tenacious D?\" I smirk proudly. Thanks @therock &amp; @kevinhart4real for being gracious at #centralintelligencemovie premiere and for saving the world https://t.co/mvsADIJ0Ce I got to preview the new #skatercrossskateboardracing course today. It is truly challenging and such a blast: https://t.co/9uaxL5iYI7 Earthquake! It felt like a bus hit our house. We found Dory. #justkeepswimming #sigourneyweaver https://t.co/cZzlsaj9t2 So hyped on new @TheAvalanches https://t.co/1fmckIruy1\nDon't call it a comeback... although it kinda is. It was an honor and a privilege to be there https://t.co/SX210iqqZ5 Invert at today's grand opening of A-Dog Skatepark in Burlington, VT Spectator fear factor: 6\n📷: Blotto https://t.co/N9vJIlBfRd Goodbye, champ. \nThank you for inspiring all of us. https://t.co/dn2bjFL5Jf My first backflip attempt, Tulsa OK, 1997. My second was into a foam pit at @WoodwardCamp without scorpions https://t.co/kqcO3B9SDk @ThievinIMP no way @DeLizle @Biggpoppa917 you just trolled a charity for people suffering from Alzheimer's. Good job? @roybragg no, sorry about that This is mesmerizing https://t.co/VcPElox3O1 #RIPBryceLoy My personal skateboard is on eBay w/ all proceeds going to Loy Family https://t.co/joYCZtYata or donate https://t.co/SGl0ASpaZq F. Alzheimer's  https://t.co/phBtPiilv2 Just skated the @TransWorldSKATE park with @rileyhawk666. Watch our live (well, not so live anymore) session here: https://t.co/Df7LSbuR6m Learned a new trick in honor of Bryce Loy. This skateboard is on eBay &amp; $ goes to his family https://t.co/6ZPc2eyYWD https://t.co/b1j7YzTNGX Here's my talent: https://t.co/ynSv91QvfF \nHelp @THF win $50K by sharing yours! #NCAMChallenge\nHey @amyschumer &amp; @trevornoah; I'm watching. Demolition Radio is starting now. Okay, we'll wait for you: SiriusXM 41 @RadioFaction or call 1-877-HEY-HAWK &amp; tell us why you're late This video is insane. Congrats @Elliotsloan! https://t.co/xyog30HUSE Things I learned while attempting to “skate” in [simulated] zero gravity https://t.co/jrr1YCEFEZ My #MoveLikeSteph vert line\nWhat's yours? @DegreeMen\nNoPurNec18+ Ends 6/20\nRls: https://t.co/X2jKLWGWtB #ad #contest https://t.co/zRL0tSL9kp Wide decks for the discerning (aka old-er) pool skater. Great for sweepers &amp; layback airs https://t.co/gNQupD9VVC https://t.co/UbY5kLmNaF You can help @Skateistan finish a new facility in South Africa. I can't recommend their work enough: https://t.co/4OfGqdFFO8 Behind the scenes of our skate oddity: https://t.co/QNuLsh1bS8 I took the #RockOneSock challenge to raise awareness for @missingkids. #JasonSudeikis you're next! https://t.co/wGMNkbHvq6 Floating in a most peculiar way with @aaronjawshomoki thanks to #sony4k #actioncam &amp; @GoZeroG: https://t.co/degqm7d2nJ RT @richeisen: With @TonyHawk on @RichEisenShow, I got on a skateboard for the first time ever. The results were disastrous.\nhttps://t.co/i… Well that \"teach the host to skate\" segment escalated quickly. Kudos for getting up &amp; trying again @richeisen https://t.co/ruE3GDCRM9 Gonna be on @RichEisenShow soon. Watch us live as I try to teach him how to skate for the first time. I skated with @aaronjawshomoki \n...in a plane, without gravity. \nFull video drops (floats?) on 5/27 via #sony. https://t.co/PwwpvedAja Demolition Radio is starting soon and @ztrip is in the house... er, studio. Tune in to SiriusXM 41 and/or call 1-877-HEY-HAWK Truly inspiring stories from some #RealHeroes of sport (via @LaureusSport): https://t.co/pI6LRFZ4q9 Mine too... https://t.co/zKTtqrsHsw If anyone out there has influence over The Cure playing Plainsong tonight, I would greatly appreciate the effort. Thanks in advance. Name the best way to embarrass your family on national television. Number one answer: Celebrity Family Feud (soon) https://t.co/pbCclHOV5y @ZachBoard1 frontside nose grind Celebrate Ray Underhill's life &amp; help those w/ chordoma cancer\n#GR4R 6/19 Kennesaw Skatepark\nhttps://t.co/eTM6yh6H9S https://t.co/hZCGufs3Lr @no_good_hood nope Winning ollies from yesterday: Jimmy Wilkins, Tom Schaar, Rony Gomes, me (not winning, but my best) &amp; JW (again) https://t.co/R0Hzz61I10 ICYMI: a highest ollie on vert contest happened on my ramp today. Go to https://t.co/O3BohBREZo to see the chaos https://t.co/w0vEmlRfIW Tomorrow at 3pm PST: highest vert ollie contest, on Facebook Live (https://t.co/jymcf6PZAe) https://t.co/s8fhDw4XO8 Last 4 Photos On My Camera Roll, Captioned https://t.co/3PHGwzFCIc ¡Gracias Mexico City!\n📷: @stevenperelman https://t.co/gzEJyuyJ8N Tried a few of these at the end of our #NixonVerticalTour last night. Got close, got hurt, went home.\nI'll be back. https://t.co/AECAg5Kz3P Hola.\n👻: tonyfrankhawk https://t.co/v1WdunwWih Living the dream: notes from the battlefield https://t.co/vZSJdR14Ae 5 photos on my phone, chosen at random https://t.co/pI00I2UI9z https://t.co/g8y7Qw22F7 Thank you @elpatosk8 for this clip from 1984 DMSR contest, and to everyone for the birthday wishes. 48 is the new 47 https://t.co/QoPM25OssT Thank you @NickSwardson! The crystal shall remain safe with me https://t.co/f4DRCr3McL Same. Happy birthday @sacca ! https://t.co/fbTvrpcik7 Thank you @RadioMadison! Listening to you while taking my daughter to school just now For my \"Perched\" video I bought Soap shoes on eBay to do \"foot slides\". I could only find 11 even though I wear 13's https://t.co/XiF0YKpJvk Demolition Radio is live... like, NOW. Join the chaos: SiriusXM 41 @radiofaction  - Call 1-877-HEY-HAWK to hear your own voice on the air Behind the scenes w/ @OffCameraShow this morning. Production value: bigtime\n📷: @contusiondesign https://t.co/7iK9UlGnrB How my wife spent Mother's Day: breakfast in bed straight to cleaning out a backyard pool so her boys can skate 💁🏼❤️ https://t.co/4zBAlAsWOX New Mexico adventures with @birdhouse crew!\nIf you know this song you are really old and/or really awesome https://t.co/9FbtW1LxRJ RT @PolvoraRock: Hoy a las 8PM regalamos los boletos para ver a @tonyhawk con @elcarteldesanta , @Los_Viejos y @estramboticos https://t.co/… Thanks to @MINIUSA for their continued support of @THF, and for making our recent surprise demo in SF a reality: https://t.co/284VFHceN1 Don't play SKATE with @hopsin because he's got triple flips on lock.\nListen to us live (SiriusXM 41) at 4pm PST https://t.co/K1XV7ontVD Just another manic Monday.\n📹: @Dyoueda https://t.co/BHDoLJDjey San Diego! Stand up comedy w/ my buddies @Johnedale &amp; @JoeSinclitico at @americancomco tonight 8pm! FREE guest list: https://t.co/TfbKEP3WQB As seen in the new @TransWorldSKATE; shot on a recent film trip for the new @birdhouse video.\n📷: @sammullerphoto https://t.co/fL2pVp1GkV Family fun from \"SYNC\" ( doubles vid on @ridechannel): @rileyhawk666 @gupimusic Miles Calvin Keegan Kady &amp; Catherine https://t.co/1sd5KDBRtm My 1979 school report \"The Roots Of Skateboarding\"  (with illustrations!). Probably my only A+ in elementary school. https://t.co/qqZVBnZkJg RT @DangerousD_Show: My chat with @tonyhawk rad!!!\nhttps://t.co/x3EtY404wZ\n@idobiradio @PowellPeralta @bonesbrigante #Tonyhawk RT We are going live soon on Demolition Radio. You don't have to listen, but calls are welcome: 1-877-HEY-HAWK SiriusXM 41 @RadioFaction top photo: me, at #sanoland ditch, age 13 \nbottom photo: @rileyhawk666, same spot, age 23 (34 years later) https://t.co/f4bUTP59Tl I'll be talking to @steveo today on Facebook Live at 2:30pm PST, taking questions &amp; laughing a lot. Watch here: https://t.co/jymcf6PZAe This classic cinema was on yesterday. There weren't enough downhill skaters so I doubled for an extra: 3rd from left https://t.co/q904JQXEGR In celebration of Kevin Staab's 50th today (we've been skating together  40 yrs)\n🎶 Altered Images - \"Happy Birthday\" https://t.co/szqm3VWWpE Á la prochaine 🇫🇷 https://t.co/GQn5ZphrfV When in Cannes, drink rosé. https://t.co/2pwyfqRxyH Thanks @eMergeAmericas for inviting me to speak, and to @jonfortt for keeping our conversation interesting. #EA16 https://t.co/DPeXN5rSEs This could be the most important question asked today. https://t.co/S303MHDfJa I’ll be taking questions from the audience during my #EA16 Q&amp;A. Join the conversation by tagging questions with #AskTonyHawk. \nP.S. Be nice Attempting Megaramps through the years. Bailing 15' airs is not fun / not funny.\n🎶: Tom Waits - \"Big In Japan\" https://t.co/oJbc9SlZJE Tickets to our Nixon Vertical Tour (Mexico City, May 14) available here: https://t.co/JajtVf5s0Q RT @CNBC: Get an in on @jonfortt's chat with @tonyhawk. What question would you #AskTonyHawk @eMergeAmericas? #EA16 https://t.co/N1G4FFL4N6 And you may ask yourself...\n👻tonyfrankhawk https://t.co/fZZ8d2Hsh4 Mexico City, May 14! https://t.co/99PKsb87Bh It's a little-known fact that I attended Harvard... to skate\nhttps://t.co/r0juTsNj8E Test drive a @MINIUSA April 15-24 &amp; help a family in need via @FeedingAmerica. I'm proud to support the cause: https://t.co/XovAVBln30 Getting a beat down from the O'Connell Brothers in The New Guy (2002) https://t.co/KqwuXtDGLL Thanks @MINIUSA, I am proud to have you supporting our cause. https://t.co/B0XFwaSfaV I’ll be speaking at @emergeamericas in Miami on April 18. Join the fun... #EA16 https://t.co/YD9Q4OEi75 The inspiring documentary #IAmThalente is now available for pre-order on iTunes: https://t.co/GGivDMnSbN (of which I am a proud backer) Going live soon from the top of @MammothMountain at https://t.co/jymcf6PZAe What he said⬇️ https://t.co/gHyUe7P0U4 Skitching with Evel Knievel (2001) while wearing his gear was beyond bucketlist. I still can't believe this happened https://t.co/hkpZTDkD8G What happens in Europe, stays on @RideChannel: https://t.co/1PVzL4dDr4 Demolition Radio is happening and you are totally missing it. Live on SiriusXM 41 @RadioFaction Call us for a good time 1-888-897-4748 I applied for a new job: https://t.co/7CImgfIDyu Learning to carve a spiral, from start to finish. Shot with #ActionCam\n🎶: Siouxsie &amp; The Banshees - \"Spellbound\" https://t.co/8tRB48kurw Clips from our live Facebook session at SOMA skatepark yesterday w/ @birdhouseskateboards team.\nMore live stuff soon https://t.co/E7CS5Xd3vX They don't want you to add me.\n👻tonyfrankhawk  https://t.co/HSLDP56ZjZ Thank you @ztrip for the best custom demo soundtrack &amp; for adding a turntable extension to my ramp. 📷 @photojoebrook https://t.co/fg7jMPbvtX Going live on https://t.co/O3BohBREZo in 15 minutes with a vert demo in SF RT @ShaneMac: When @tonyhawk sets up a very ramp outside your apartment. Ya. That's happening. Free show at 4pm today. 11/Harrison https://… SF: free vert demo, 4pm, here: https://t.co/sQXae8rg2J \n(with legendary skaters raising awareness for @THF) Hello San Francisco, I have a surprise for you tomorrow afternoon if you're bored. Details to follow 👻: tonyfrankhawk https://t.co/CNMiF9lf8N I stand with @charitywater in their 10 years of fighting against dirty water. You can #FightDirty too: https://t.co/kM0lGyLB3u @hondurasband oh dang I'll be in SF Behind the scenes of my @mini Ollie.\nThanks to Ralf Koch &amp; Jeremy Fitzgerald for keeping me in one piece. https://t.co/CyPt6uUeXS Saw Richard Linklater's new @EWSMovie last night. It truly captures 1980 in a way I've never seen (and want more of). Great soundtrack too We are live with @steveo on Demolition Radio (SiriusXM 41 @RadioFaction) right now. Call us: 1-888-897-4748 Indy air on Mega over a young @rileyhawk (2003-ish)\n📷: @HawtAkshun https://t.co/VD6AHLXSRp RT @mikeboydvideo: A winner will be chosen TODAY for this signed @tonyhawk board! Get your last minute entries in for only $2! https://t.co… RT @NixonMX: 14 de mayo #NixonVerticalTour @tonyhawk en México .\nYa tienes tus boletos ? \nDisponibles en https://t.co/04QfUK22Uq https://t.… ¡Muchas gracias Mexico! Hasta luego...\n(shot with Sony #ActionCam)\n🎶: Los Margaritos - Rock de la Basura https://t.co/9Ukzv4DmZv Favor de donar a MasSkate para ayudar a los niños en riesgo social: https://t.co/fQyvQ8IlRN 🌴🌴🌴🌴🇲🇽 https://t.co/2QIfFJqR7q Richie Jackson is truly inspired. Who else could dream this up? https://t.co/txpOeSuVAT My dog doesn't speed check\n👻: tonyfrankhawk https://t.co/1MMfYevbXj Happy St Patrick's Day. Here's hoping you find your own metaphorical pot of gold. https://t.co/a4djc1hcpP Jay Leno about to drop hammers https://t.co/Jj3lew3MEb RT @LaureusSport: \"When @tonyhawk says ‘try this’, I am not going to say no!\" - @delpieroale\n\nhttps://t.co/op4gU4lyIW https://t.co/eIIyki5X… Only $2 to enter this raffle and help those with muscular dystrophy https://t.co/RfqWzeRmdD Alternate angles of new-ish tricks.\n🎶: @TheKills - \"Future Starts Slow\" https://t.co/fTiUEO8DCH Welcome Alessandro! https://t.co/YlwSqBQi4Q For a fantastic, cerebral time call 1-888-897-4748 and/or listen to Demolition Radio on SiriusXM 41 @RadioFaction right now My \"Full Skull\" graphic brought to life by @frank_ripley https://t.co/E56l1TdVO3 Halloween '78: my dad made me an R2D2 costume. 2 big kids knocked me over so I looked like a toppled squealing Ed209 https://t.co/3j6krXzgTg RT @chriscantore: with @thestevenwoods out of town, stoked to co-host @cantorewoods with @tonyhawk tomorrow on @FM949sd https://t.co/3lF2Rd… @hellis_you Now that looks like a party. Thank you for the honor. My mom is 92. She has Alzheimer's &amp; doesn't recognize me. She doesn't remember us, but we'll remember her fondly. https://t.co/04dxPl6J7p Closing credits of Police Academy 4: @steviecaballero C Miller @tommyguerrero @LanceMountain @MikeMcGill_ &amp; moi https://t.co/G4dTvBFcDW 1996 Olympics closing ceremonies. Outfits on point. \nFrazier Crum Dyani Hendrix Cab Way Hawk Howard Menditto Boyle https://t.co/E98KdPGRuP Thank you @grahamelliot for an epic meal tonight at @GEBistro. I never knew scallops could be that good. Love your book too! @rawanquinn haha not your fault at all, no worries My strange life: walking down the street with a surprise gift for my wife. People stop me for pics, tag me on social media, no more surprise Radio is a sad salvation... unless it's Demolition Radio on @RadioFaction SiriusXM 41 1-877-HEY-HAWK now live New series of @birdhouse decks &amp; shirts now avail direct: https://t.co/SoN2fH1kEy\nalso: this bluntslide took a while https://t.co/pggavFBKjW Arriving in Tokyo w/ @rileyhawk in 1996. demos in a skate shop there while Riley sat nearby with his Power Rangers https://t.co/FtFiV3ikr4 I didn't think a scripted movie could be as shockingly funny as Borat or Bruno, but along came #TheBrothersGrimsby\nThanks #SachaBaronCohen! Thanks for the 🍾❄️ @MammothMountain https://t.co/C0sStS1IjO Good morning from @mammothmountain \n❄️❄️❄️❄️❄️❄️❄️❄️❄️❄️❄️❄️❄️❄️ https://t.co/g4G47p5JFT Thank you David. Love your work https://t.co/hhzQWAm3iR People often / sometimes (ok... rarely) ask where they can get my @birdhouse gear. Here is the answer: https://t.co/SoN2fH1kEy 👧🏼⛷👴🏻🏂 @mammothmountain\n📷: @HawtAkshun https://t.co/2RsUfqIF5X One of my favorite writers (@carsonmell, now works on HBO's Silicon Valley, one of my favorite shows) has a new book https://t.co/utBzAgRyBI You're my boy @davidu! Please vote... https://t.co/xf1TcW7772 Just got my Clubman! First person to see me in it &amp; call me out gets the deck I used in the @miniusa #defylabels ad https://t.co/7x8WlAt3WZ Mike Judge is the new Nostradamus 👻: tonyfrankhawk https://t.co/KTMHVBJmrp Rusty ad, 1994 https://t.co/oTCMbeXgvr In 2012 I released a video part, although not sure what it was \"part\" of. Full vid on @ridechannel https://t.co/exdVw46XAg @greebo1972 I am truly sorry for your loss. No problem on sending a message along, just let me know how to get it to you Rockin' good times with my girl https://t.co/WdUPFxfxJv Higher ollies through science with @ihatespenzrnuzz (via @RideChannel): https://t.co/YXrxvElZrB When life gives you long layovers, make lemonade (in NYC, for brunch) https://t.co/vJ3DwMgR31 RT @mikeboydvideo: eBay auction never worked out. Now @tonyhawk signed deck is being raffled for charity. Only $2 entry! https://t.co/wJzbz… World traveler &amp; renaissance man: @rileyhawk666 https://t.co/GN7wNXxKBB Die touristen (with @jayfrankparnell &amp; @rileyhawk666) https://t.co/4Q5jFiSfnh \"I want to see some history, cuz now I got a reasonable economy.\" https://t.co/GVgGWfgTI4 History and stuff https://t.co/vdZM7PquTJ RT @OMRockstars: Tony Hawk: \"I didn't start skateboarding to advise people on politics...\" cc @tonyhawk #OMR16 It's so cold in the .de https://t.co/y8PGIL3FV2 @jssames210 absolutely! @marcmaron thank you for the Steve Albini insight. I was mesmerized. We have lost track of time zones at this point. The time of day is currently defined by coffee, water or whiskey. https://t.co/KEBUhF0ezD oops... try this # instead: 1-888-89-SIRIUS The time has come, the time is now, just listen to Demolition Radio, I don't care how. Sirius XM 41 @RadioFaction 1-877-HEY-HAWK Highlights from @BOWL_A_RAMA in Bondi last weekend: https://t.co/ilJMb3SpbI Our whirlwind trip to #sydney was a blast. Thank you for the sun, scenery, skating &amp; superb cuisine #IloveSydney https://t.co/TW438Z1Jle Rage At The Badlands contest, 1985. The original combi was gnarly; lots of vert, huge coping &amp; sandpaper flat-bottom https://t.co/UeZcDRKpXm Thank you @United for finding my son's DS. He is elated &amp; relieved... &amp; has hopefully learned his lesson that seatbacks are not storage bins Thanks @boardworld &amp; @rielywalker for this FS hurricane pic from my last @BOWL_A_RAMA run yesterday. Good on ya. https://t.co/XTi0aec3cJ Your @BOWL_A_RAMA victors (pro and masters division): @buckylasek &amp; yours truly https://t.co/N4ndq7ochP Going 90's miniramping through the corner this morning at @BOWL_A_RAMA practice https://t.co/UGixA8WD2W Going 90's miniramping through the corner this morning at @BOWL_A_RAMA practice https://t.co/9ND1yJcikU Warming up now (aka getting coffee) https://t.co/FD0PpqpCB1 G'day 🍤🔥 https://t.co/pFLrxgzG7I Chin Brigade, waiting for our cue from the eye in the sky (aka @peraltastacy, not TC), nearly 30 years ago https://t.co/sJhk0uyd4m 5 minutes to Demolition Radio. Be afraid, be very afraid. Tune, turn on, trip out: SiriusXM 41 @RadioFaction and/or call 1-877- HEY-HAWK My skate career has come full circle; I'm back skating pools &amp; doing 1/2 cab front rocks (which I learned in 1980) https://t.co/eZVr9D0zFy Testing a [potentially] new toy from @circuitboards to keep my head expanding. #getloopy \n🎶: Lene Lovich - \"New Toy\" https://t.co/YSCYbE0u7p @MukundaAngulo nice to meet you the other night! New York I love you, but you're freezing my face\n👻tonyfrankhawk https://t.co/QjcIchgpXG Mission accomplished: @aaronjawshomoki 🇫🇷 https://t.co/lH4SFhAekU Flashback to Bondi @bowl_a_rama two years ago. See you there next weekend. Cheers! https://t.co/nfHcJuSBgH Please vote @hicwarehouse for a grant to improve their public skatepark (via @bomitchell) https://t.co/cwMk4VBzho\nPS Do so &amp; I'll follow you @keatonunderhill style guru I swear I still look like this... https://t.co/CS7lP8CFSU Escaped #bonesbrigade retirement home w/ @MikeMcGill_ &amp; @steviecaballero earlier.\n🎶 Toy Dolls - \"Nelly The Elephant\" https://t.co/YkGGTSqJqg Demolition Radio is in the air! I mean, ON the air:. SiriusXM 41 @RadioFaction 1-877-HEY-HAWK call &amp; turn your radio UP for maximum feedback I truly love these. They remind me of my obsession with Mini Cubics as a kid (of which I only had one set) https://t.co/IQLHCjwnr3 This is our #bonesbrigade Blue Steel, in honor of #Zoolander2 aka @ZoolanderMovie #elnino #FarmToTableWiFi https://t.co/sJkeDB7PT5 Thank you @mammothmountain for the sun, the pow, the par, &amp; the confidence my daughter learned. Shot with #actioncam https://t.co/zpdKrMm0gp My @MINIUSA #ad airs today during a rather big sporting event. See it here: https://t.co/rqsXcwqkLm #DefyLabels https://t.co/38JR0sjgoW Thank you for the incredibly powerful Bowie tribute, @amandapalmer. It is a poignant eulogy to a revolutionary artist. Sometimes I feel like Willy Wonka as a parent, mumbling \"stop, don't, come back\"\nHere's Keegan invoking Wasted Youth https://t.co/NviT4wA9SL RT @mikeboydvideo: This charity auction for skateboard donated by @tonyhawk ends at 5.30pm Central Time (11.30pm GMT) https://t.co/0vnMwQke… Watch me on @MammothMountain periscope right now LIVE on #Periscope: Take a ride with me from the top of @mammothmountain (assuming the signal is good &amp; I don't dro… https://t.co/kei7KvZpNZ LIVE on #Periscope: Take a ride with me from the top of @mammothmountain (assuming the signal is good &amp; I don't dro… https://t.co/HFTIpYEiPc Getting slimy at 2003 Kids Choice Awards https://t.co/JlGFWCgA08 Goodbye Dave Mirra, a true pioneer, icon and legend. Thank you for the memories... we are heartbroken. https://t.co/RHpTe7Qzwi Tonight at The Saloon! @Saloon101  https://t.co/oh9Lle8Yas Demolition Radio starts in 5 minutes and IT'S LIT, FAM! \n(I'm way too old to say that, btw)\nSiriusXM 41 @RadioFaction 1-877-HEY-HAWK Thank you @steviecaballero for inventing the Caballerial 36 years ago (and for still doing them today). So sick. https://t.co/mmZ2qRVAA4 Stoked to be included in the new @MINIUSA Big Game campaign about those who #DefyLabels. https://t.co/rqsXcwqkLm #ad https://t.co/3R2Pi2jGCc Louis CK's new (surprise) drama \"Horace and Pete\" is raw, different and awesome. I highly recommend it. Frontside 9?\n👻: tonyfrankhawk https://t.co/tibo8Y6cHA \"Nothing, I want nothing\" https://t.co/RkZqORm5l8 If I ever had an album cover, this would be it... or at least an inner sleeve. https://t.co/STMvHMM3DZ Fear, loathing, footage: @birdhouseskateboards https://t.co/9em0qxGYBb True story: my 13-year-old just handed me a CD jewel case and asked \"how do you open this?\" @Brent09627100 looks legit RT @BONESWHEELS: SPF Pro @tonyhawk Mini Cubes available at a skate shop near you https://t.co/UojRBf5poD #BONES4LIFE https://t.co/Ihdns8Kk1U I've had to defy labels my entire career. What about you?\nSee my new @MINIUSA #ad &amp; tweet your labels w/ #DefyLabels https://t.co/n0nUbrCYjr Perseverance pays off, congrats Mike! https://t.co/lSxhYQdDKe I posed a new challenge for @mikeboydvideo (who learned kickflips in 5 hrs). Watch him suffer &amp; succeed for charity: https://t.co/X6FqbqBIYo Tell 'em who you came to see...\nEazy-E, Venice, 1990 📷: @_ithaka_ https://t.co/AJNuDB4Z40 RT @TheTodayShow: .@tonyhawk is heading Down Under this February! He joined us for a chat: https://t.co/u6lNiPT6bb #Today9 https://t.co/V3k… Demolition Radio starts soon. Get cozy, call us &amp; turn your radio up so there's plenty of feedback: 1-877-HEY-HAWK SiriusXM 41 @RadioFaction Dallas, 1983(?)\n📷: @jgrantbrittain https://t.co/GDqDX4PQYu @frank_ripley awesome! What size is that? And how much? In case you missed the epic #girlscombipoolclassic that went off over weekend, check out highlights on @ridechannel: https://t.co/VWPA2DgPFr Clips from Powell-Peralta’s 1st vid “Skateboarding in the 80s” 1982. This is my first video part ever, shot in 2 hrs https://t.co/nZZLrsfCHz Right now! https://t.co/LhSAJrtWIf The literal backside boardslide by @aaronjawshomoki https://t.co/wNEX0kvYXy That time Jackson Browne &amp; Tom Carroll cut me off in Fiji &amp; forced me into the reef\n#scrubitkook #runningblind https://t.co/Gjsx2P7vUB Stoked to hit @bowl_a_rama again this year for two days of nonstop shredding: https://t.co/MfNoKnTjr0 @GeneralPants_ https://t.co/YsnffXaHG8 Stay cool, Brett https://t.co/o2FLa235KM The new @aboutdotme looks sweet. Thanks @tonysphere! Here's a link for early access: https://t.co/KACpZz9GyJ https://t.co/C3uN2CCMfg Adios Chile, thank you for the hospitality, beauty and enthusiasm. 📷: @HawtAkshun https://t.co/vs1UylYt1c Thank you @bowlzilla!\nOld guys division: 1. Hawk 2. Cab 3. Passos\nYoung, pro &amp; virile: 1. Peres 2. Schaar 3. Russell https://t.co/yv3CTHUfH4 Gracias 🇨🇱\nChi chi chi le le le, VIVA CHILE!! https://t.co/k9izKpNx17 Buenos dias Kevin Kowalski https://t.co/84Qkfm1ntB 🇨🇱🌅 https://t.co/zzk7jZiTZG This bowl is challenging for airs but @tomschaar is unaffected with his bigass backside ollies @bowlzillachile https://t.co/OaqzzFUnzU RT @GeneralPants_: Wanna meet @tonyhawk, score a signed skate deck &amp; fly to @bowl_a_rama in Bondi? Enter here https://t.co/7HZ1lopva4 https… Canyon air, Marina 1980. @peraltastacy asked to meet re: #bonesbrigade. Had to do something big to justify the honor https://t.co/WCvbE2pbOk Demolition Radio, now, SiriusXM 41, 1-877-HEY-HAWK, speak clearly, enjoy Clips from @transworldskate's Uno (1996) &amp; Greatest Hits (1997). Noteworthy: my first switch McTwist &amp; fastplant 5 https://t.co/7uVPBqPEa0 He's stuck with a valuable friend: @rileyhawk666 https://t.co/BRV4cqMCIq \"Don't tell them to grow up and out of it\" \nThank you David Bowie Thanks for the pow @mammothmountain! Big fan of your work. https://t.co/0FENpgeMnC Groms shralp freshie gnar\n@MammothMountain https://t.co/yDTm6dqZaQ Frontside air, Pomona Pipe &amp; Pool, 1981. This board probably weighed more than I did. https://t.co/Unlvkjvt49 Floating like butterflies, stinging like bees with the GOAT 10 years ago (Celebrity Fight Night). https://t.co/ZqxYZso7PE 👻: tonyfrankhawk https://t.co/3OoTVldhYh Street clips from \"Ban This\" (1989)\nThe handrail was truly frightening at that time. https://t.co/P6yVsTeSAI Demolition Radio starts in 10 mins. Quick! Go get a subscription to SiriusXM &amp; then tune into channel 41 @RadioFaction (or call 1877HEYHAWK) I was on TRL 10 years ago &amp; they wanted home video. I can't believe how they’ve grown… not the kids; my gray hairs https://t.co/OUv8hlhbyT 2016 will make you jump, jump https://t.co/3ug6dwTidC The honor was all mine. Happy new year! https://t.co/IkH72ode49 Check out the backflip brigade on Jan 3: https://t.co/cUve02mQCQ \"Takin' that ride to nowhere, we'll take that ride\" https://t.co/3CD99nGpNO If you're looking for inspiration, check out Vinicios Sardi from Brazil... No feet; no problem https://t.co/H6E3wz624W Skate or die?\n#bodyworlds https://t.co/S5GnMdvq86 Happy holidays 🎄 https://t.co/FxHKFetTjA @patrick11249712 DM me your address and I'll send him something Thank you! Hope there wasn't any blood on that piece... https://t.co/7d9Rsoxg1B FOUND by Andrew Weston. Congrats! https://t.co/0JhIMNUinM I just hid a signed skateboard under this archway. Happy holidays.\nIf found, reply with the hashtag written on top. https://t.co/oeH5jtMv78 Very cool THPS retrospective included in this, featuring a generation of modern skaters that grew up playing it https://t.co/fdGtFNmmE8 I just had the privilege of watching @keatonunderhill learn his late, great father's signature trick: the Pop-Tart https://t.co/4t3ZxD1ImM Spoiler alert https://t.co/zUk0ViL5OJ @carlsullivmusic thank you! You can own a piece of the board I used for the #sonyspiral (and part of the ramp): https://t.co/FHivgoMqnk Just got some @Zipbuds SLIDE Sport #earbuds and they are sweet. They might be the first earphones I'm not afraid to wear while I skate. Wilmington 2007: @rileyhawk666 feeble bigspin. His brothers wanted to leave before he made it, so Keegan stayed mad. https://t.co/A5d50Y53WX #DaddysHome &amp; is truly funny. No wonder @mikemcgill &amp; I skate for Will Ferrell &amp; Mark Wahlberg; we are their doppelgängers. See it 12/25! Bones Brigade Tour, 1987\nDemos every day for 5 weeks, same ramps, different parking lots, much launching https://t.co/lhd8ob9tRt @chrisingtonn nah, just decent Photoshop. I don't have a tattoo... Daddy's Home opens 12/25. I stunt-doubled Will Ferrell! It was blood, sweat &amp; tears of laughter. But mostly blood. https://t.co/n97V8x9H1J My favorite part of our doubles video \"SYNC\" was getting clips with my family. The dog drop was unplanned, however https://t.co/6DmYVvQqFm We're through being cool https://t.co/uwbaong73E @jimthiebaud @woodwardwest saw them! Thank you @woodwardwest for hosting our birthday crew today. \n🎶: The Faction - \"California Dreaming\" #halfpipehoops https://t.co/3rpzipVuN6 Skateistan currently serves youth in Afghanistan &amp; Cambodia. Help Keep @Skateistan Rolling! https://t.co/Z9zZDCz8FE https://t.co/JFTIhU7QXo Lance &amp; Stacy, Chin Ramp, 1987 https://t.co/uWlNHNAEyW Help save Austin's foot!\nhttps://t.co/kUrBW5vKZY Ride along with my son @rileyhawk666 as he goes to pay his electricity bill (?): https://t.co/eHIAX0N1Oy My Mark Gonzales story: I was walking in NYC just now &amp; a guy on a bike yells at me \"Tony Hawk! It's me, Gonz!\" https://t.co/ksLzwDq2W4 Playing dress up with my wife last night at the @charitywater ball. Help: https://t.co/9fm1Khpwhf\n📷 @adaminspired https://t.co/66ELGivJa7 Stop the clock... Hanging with #FlatRonnie before joining the @sternshow Wrap Up Show today. Hey Now! https://t.co/KzN0TuNi6T Happy birthday @rileyhawk666 !\nWe still like you when you're 23. https://t.co/VNHHcYsfx9 @adurnwirth I can Iconic style: @christianhosoi blasting at the #elgatoclassic just minutes ago https://t.co/pYC1FjzXm4 Thanks @BAM__MARGERA for raising awareness about addiction &amp; helping @THF by selling shirts of his childhood bear: https://t.co/LCcCmQPThA Spirit of '76! \nI was too sassy to be creeped out. https://t.co/HfkGYnXWFm Master artist @haroshisk8 in the house (literally). Cant wait to see this come to life! https://t.co/tAUlcWUs9p Thank you @msjwilly (via @TheDailyShow)! \nhttps://t.co/I1XOyTfLjT @andrewXsingh @IshCepeda working on that big collab RT @THF: Take home @tonyhawk's 1989 Savannah Slamma contest trophy! Click here to own this piece of skate history.\nhttps://t.co/6KGnQzhcsn These are for you @eddieelguera. Hope I can make one at @elgatoclassic \nAlso: 👻 = tonyfrankhawk https://t.co/wyoRdNspo9 Congrats to Jason Park on his Sometimes Skateboards model. Check his \"turning pro\" video on @ridechannel: https://t.co/iWglETbYOo https://t.co/rh0WZxAAJu https://t.co/BWH2Za9vs5 #BONESLIVE TODAY w/ @aaronjawshomoki Ryan Reyes, John Motta, Josh Hawkins &amp; Jagger Eaton: 3pm MST (5pm EST, 2pm PST) https://t.co/gfEpuuvIJp Demolition Radio is live! SiriusXM 41 @RadioFaction \ncall in and hear your own voice: 1-877-HEY-HAWK (and turn your radio UP) Thanks @sammullerphoto forr for shooting this @boneswheels ad on our last tour:\nFront blunt @ Stoka (Czech Republic) https://t.co/hJ6kmWuzPU My son Spencer dropped his EP today!\nhttps://t.co/OJlFA9yIEB\nhttps://t.co/xpjx3smscd All of my #sonyspiral attempts. Looking back, the stunt pads were futile after the first few.\nShot w/ #ActionCam https://t.co/N1LxYkFfhz RT @fucktyler: THPS5 THANKS! 🍒💣 @tonyhawk https://t.co/laN2MV8DBC An edit I made of @rileyhawk666 around 2001 using music from his younger brother's Teletubbies video. https://t.co/mxea4joJY5 Cherry Bombing https://t.co/S9xcR2y4nk Vinaka Laucala Island for our magical trip. https://t.co/20Gguome2k Gonna be halfway interesting in the future, but for now you'll see the end of our obnoxious vacation\n👻 tonyfrankhawk https://t.co/VjQnJO2ohf When you're so desperate to surf that you ride ankle-high waves at low tide on the reef. 🏄🏼🇹🇨\nShot with #ActionCam https://t.co/VwQSjoLhGL Also: Tyler The Creator &amp; TMNT https://t.co/kjYO6fxXwh Looking forward to skating the Legends Division at @bowlzillachile in January https://t.co/dPgakAG3px 🦃 #birdup\n📷: @catherine_o https://t.co/77vFLHxkaJ Currently snapping \n👻: tonyfrankhawk Thanks to this crew for all the love, laughter and chaotic fun. https://t.co/BAFOtf3JfF Visit GameStop on Nov 27 for $20 off Tony Hawk’s Pro Skater 5 and a pair of #THPS5 @Zipbuds (while supplies last) https://t.co/RwjCdU8hYs Doubles action from @andymacdonald's video “Gratis.” I never thought a frontside pivot would be this frightening. https://t.co/KNZv4NRiSw Doubles action from @andymacdonald's video “Gratis.” I never thought a frontside pivot would be this frightening. https://t.co/WBIRJO43ns New series of Bones Brigade decks available 11/26: https://t.co/9e2Kqm23Ae\nPerfect for method airs to comb your hair https://t.co/Vxz3bJ6yll Working on my frontside inverts https://t.co/cggxUNMDMU RT @nerdist: We broke down the physics of @tonyhawk’s horizontal loop: https://t.co/FjVgwuqOcL https://t.co/Uhua0FayJN Current mood https://t.co/0buLrXiQmX Check out the @THF holiday auction items (including my trophy from 1989 &amp; a session with the @birdhouse team) https://t.co/Rw3H3xL5nQ Skymall on steroids: taking off in a DeepFlight personal submarine https://t.co/OLgMGX2uQi Behind-the-scenes of my #SonySpiral project is now live on @ridechannel: https://t.co/w5lPgzyKc5 It was confusing, painful &amp; fun.\n#ActionCam Please don't feed the fish; buy her a drink. https://t.co/0ldlLaB5QI Squad? @Nixon_Now + Star Wars https://t.co/gHihqPCHtW Vert demo, 1982 \n#nodecks #noflat #nocrowd\n📷: @jgrantbrittain https://t.co/ZZ9py6JOiI My wife made this edit of my #SonySpiral battle. She enjoys my guttural screams of pain, frustration &amp; defeat https://t.co/U4xVawolmt RT @SonyElectronics: Watch @TonyHawk skate the first-ever horizontal loop. #SonySpiral #ActionCam\nhttps://t.co/7VRY9YuDAf I've wanted to try a vertical spiral for a few years. Thanks Sony for making it a reality: https://t.co/E4a3ngTZAs\n#SonySpiral #actioncam Thanks to these comedy legends for bringing their show to our fine city. The Farley tribute was all-time #snlroyalty https://t.co/mBF4nNxvlC RT @RideChannel: Yes, @tonyhawk skated whatever this thing is https://t.co/SW6lHvKC1K https://t.co/0bbSPLxKVz Attempt 12 of my #SonySpiral struggle\nVideo drops tomorrow\n(shot with #ActionCam) https://t.co/M9DAvfRS4P Tune in to the soothing sounds of Demolition Radio in 5 minutes and let go of your worries: SiriusXM 41 @RadioFaction call 1-877-HEY-HAWK I wanted to do a vertical spiral/loop &amp; pitched it to Sony. Watch the struggle unfold 11/19.\n#SonySpiral #ActionCam https://t.co/h5HMuoK740 At LA premiere of #mockingjaypart2. Spoiler alert: the cast lives happily ever after (their characters, not so much) https://t.co/mGKekVJ2JZ Playing Legos with my ramp a few years ago: gap to tailslide. https://t.co/uKfWzGEbdK @Ashia_Hayes @CameraJesus awesome! \"I thought the future would be cooler\" \nSO DID I. \nThank you Yacht https://t.co/dbf0gsFCp6 Douloureux https://t.co/vm1UFLrPpM Worst-case Elguerial from 2003 Huckjam. I pretended to be okay, but I probably hid &amp; whimpered until my next turn. https://t.co/xkGExiNpbf Our dog shreds @circuitboards (figuratively &amp; literally) https://t.co/anPj1bK6ny With my dad at Grand Canyon in '73\nI think I'm starting to look like him lately so maybe it's time to cop his outfit https://t.co/AW8M5i4Nh7 Check out my #fullosophy! Take the @AbbottGlobal quiz here: https://t.co/wxAWz2n13y &amp; tell me what you live for! #ad https://t.co/aEm5Wf0y4V Thanks to all veterans for their service &amp; dedication. My dad was a Navy pilot in WW2; this was his custom helmet https://t.co/XB5MVCuluz @Sethrogen deal. Call Mr Green Just saw #thenightbefore;\nIt's heartwarmingly irreverent &amp; makes me want to spend the holidays in NYC w/ @sethrogen! https://t.co/G8kcAAJ3bb Stockholm 1985: @lancemountain &amp; I stayed at A skate camp for 5 wks going stir crazy so we bought this car for $500 https://t.co/cZQrUEH9gq Demolition Radio starts in 5 minutes. You can listen on SiriusXM 41 @RadioFaction or participate: 1-877-HEY-HAWK (&amp; listen while on hold) We rented a bullring in Tijuana for 2 wks in '98 for $1500. It took 10 days to build a ramp &amp; 4 days to skate &amp; film https://t.co/QXHWcBtBKs Thank you @leenadler &amp; @MINIUSA for the opportunity to share my insight  https://t.co/yVp8AQyQuT @adamkleinberg it totally worked Thanks for lunch (and #bluebottlecoffee) @bryanmeehan! Nice view, btw https://t.co/3MqW80h2TD Thanks for lunch (and #bluebottlecoffee) @bryanmeehan! Nice view, btw https://t.co/aIhEuj5oTf Only happy when it rains: @jayfrankparnell https://t.co/tpWklYTCCk Thanks @lizziearmanto for inspiring me to learn the elusive stale egg. You make it look easy; I, myself, cannot. https://t.co/nOQnNmLiFb My channel / gap project from Adio's \"One Step Beyond\" (2002). 12'➡️18'➡️24'\n🎶 Radiohead - \"National Anthem\" https://t.co/JGf1gaALop Rodney Mullen on “Incredible Sunday” in 1988. He skated for 3 mins straight &amp; never stepped off or faltered. https://t.co/G4thLMezfB I'll be in the @mini booth at SEMA for the next hour if you want to come say hi, or you can just ignore me and check out the new Clubman. Petyr braved the sunlight last weekend to worship the almighty Crailtap. \nPhoto: @CameraJesus https://t.co/1tMzOdmJkR Demolition Radio is looming. Tune in, turn on, fan out at SiriusXM 41 @RadioFaction and/or call 1-877-HEY-HAWK to join the chaos. My cameo on #undateablelive Fri w/ @Meghan_Trainor. The pressure of landing on soft linoleum on live TV is palpable. https://t.co/Nnc6IpJZNd Congrats on the book @davidspade! I think both of our careers peaked during Police Academy 4 though. https://t.co/qogjEfGYHN Thank you @DragonLordofZar &amp; Chris Dooley for transforming me into Petyr yesterday. 8000yrs in 4hrs\n📷: @camera_jesus https://t.co/yARqb7cuL4 Congrats to @Casey_Jacked for correctly guessing Corrine Burns and Petyr! I will send you a skateboard after it is properly cursed. Happy Halloween! First to guess our costumes (by character names) wins a cursed skateboard. It will not be easy https://t.co/Vyy57wSjAF Watch my buddy @sacca get raw on @ABCSharkTank tonight! 9PM ET/PT Check me out in the opening of tonight's #UndateableLive on NBC at 8/7c. Things will get weird... and funny. Maybe not in that order Halloween 2011: Lula &amp; Sailor, Ferris &amp; Sloane\nRockin' good news! https://t.co/a70LfjeWZW Throwback to Miles &amp; Keegan disrupting the pumpkin patch space a few years ago.\n#mamamonkey https://t.co/ttdvjrRLbl I ❤️ family + skating. What do u live for? Take @AbbottGlobal quiz &amp; tell me https://t.co/tW6pPw3j3J #fullosophy #ad https://t.co/zmXB3ECAdr Murdy The Dawg is small but he goes big. Check out his latest video on @RideChannel: https://t.co/sUoHRMEUI4 Bird up\n(no filter) https://t.co/w3D7H5j1Dm Sunday selfie Sunday (shot with #actioncam)\n#selfieslam #notcomplying\n🎶: Rezillos - \"Glad All Over\" https://t.co/rEIBwx81p7 Yesterday we went back to the future which is now present reality. In other words: hoverboards (now with dogs!): https://t.co/8lKbeJM5Rb TBT last Nov when @mikemcgill &amp; I stunt doubled for Mark Wahlberg &amp; Will Ferrell in the upcoming film “Daddy’s Home\" https://t.co/FqIDzOS3o4 The future is now!\n(repost from @EVERYBODYSKATES) https://t.co/syCG49Clpy 1-877-HEY-HAWK is the number. You are the caller. We are the answer-ers. \n(live on SiriusXM 41 @RadioFaction) Kids today should realize that college is possible regardless of their situation. #BetterMakeRoom campaign can help https://t.co/wZ8fWjxhem I lost some battles but won the war yesterday. Video coming soon. #sonyspiral https://t.co/lx3VimHKcb I might have gone overboard with the [animated] decorations this year. #scarymonsterssuperfreaks #gobacktoyourroom http://t.co/ZYQtAwyoEe I'm still here, skating backyard pools... only this time with permission: https://t.co/mViFhHt4Jy Happy birthday Stacy Peralta! Thank you for believing in me in my formative years &amp; for your invaluable guidance http://t.co/aUdd8L5wtL My son and I were recently  interrogated on the Crail Couch Riley: http://t.co/VoQMlYRq6g\nMe: http://t.co/uPGYN7QE3W Do you know the way to San Jose? And do you know how to get more speed for this wallride? http://t.co/wJPcBHmNZe Pepe le Pit http://t.co/sfLGAKMQRk My “trick tip” from 1st 411VM (1993). Not sure who I was advising since there were only a few vert skaters back then. http://t.co/nISbLovtoC Our \"secret session\" is no longer a secret. These guys were ripping though: https://t.co/qtFEJs9y3V My daughter has chosen the form of The Destructor. She couldn't help it... it just popped in there. http://t.co/uuvXY7Y8kf RT @THF: @LA_mag spoke to @tonyhawk about why skateparks matter: http://t.co/mj9OiS8TBl 2002 Apple ad (featuring 10-year-old @rileyhawk666), for which I received 2 iMacs &amp; a Powerbook... AND I WAS THANKFUL http://t.co/qIC7Hx2oVH What he said... @TheVandals &amp; @ztrip! https://t.co/QbawqhjHD2 For a relaxing time, make it Suntory time... unless this book gives you a better option. Scratch &amp; sniff whiskey! http://t.co/SeLTgAVEZP Goosebumpin with JB &amp; crew http://t.co/KAQPdV7qms Trying to complete a street/mini/vert trifecta in “Celebrity Tropical Fish” (1991) #nitzerebb #doubletail #limpies http://t.co/BqC9cZZmBo LIVE on #Periscope: Paul McCartney encore https://t.co/T58jkMTrFB LIVE on #Periscope: Sir Paul F'n McCartney at PETA's 35th anniversary gala... LIVE! https://t.co/xlGp7SRns0 Stacking inverts w/ @andymac720 5 years ago. We did it once at my ramp but I was hesitant to do it again for this pic http://t.co/wcA2CHDqVn #THPS5 is here! Thanks to the fans of our original series for making this possible.\n🎶: Death - \"Keep On Knocking\" http://t.co/Z46LH9XjRB Congrats to @Trevornoah on a solid debut! I'm excited for the future of @TheDailyShow; it is clearly in good hands. #THPS5 drops tomorrow! I'll be playing on XBox LIVE after 5:30pm PST. Figure out the Gamertag &amp; try to [literally] beat me at my own game. I'm on Amazon Prime! I mean, my autographed &amp; collectible gear is (decks, posters, helmets, etc): http://t.co/jJonognzdx RT @DadatworkNJ: Here is my interview w/ .@tonyhawk We talk #THPS5 #fatherhood and more @LifeofDadShow Pro Skater 5 comes out tomorrow http… The best of @aaronjawshomoki on instagram, compiled on YouTube by @RideChannel: https://t.co/3jA1fOC01d so much meta The perks of having your name on a videogame: getting production copies 3 days before the release date. #THPS5 = Tue! http://t.co/64H2sdgrfW Still can't believe that you let me (or anyone that signs up for that matter) fly a plane. We pulled 8 G's; unreal! https://t.co/LMEj603O5L Very cool mini-doc of our game series from @dannyodwyer's unique perspective: https://t.co/EaNmX28yoE That one time @aaronjawshomoki drove from CA to Louisville with the @birdhouse team &amp; jumped into the history books. http://t.co/ILaFdZFz5h 1 in 7 San Diegans face hunger. For every #Spoontember selfie w/ @FeedingSanDiego tag, supporters will donate 8 meals http://t.co/DUVKTVW3xN This was a blast to shoot (but apparently not as much fun as a \"Tokyo Blaster\"). Thanks @ConanOBrien &amp; @LilTunechi  https://t.co/aPDkvCY5DE #THPS5 will be featured on @teamcoco's \"Clueless Gamer\" segment TONIGHT at 11pm (feat. @liltunechi) http://t.co/tbfEk8Jaos RT @TeamCoco: Tune in to #CONAN tonight on #TBS for an all new #CluelessGamer with #LilWayne and #TonyHawk. #TeamCoco https://t.co/oAX4FQ1o… I've had a hard time connecting with my family lately: https://t.co/g9I82R4orx Consider this your #THPS5 preview for the day... Conan &amp; Lil Wayne! https://t.co/1Qjxk4xZUe FOUND! http://t.co/YAKqZAd9kO Live from New York, it's Demolition Radio! On SiriusXM 41 @RadioFaction call us 1-877-HEY-HAWK I'm skating around NYC right now. First person to stop me and ask for my board can have it. http://t.co/lSW4iUVlsC In celebration of #THPS5 release next week, here's the commercial for THPS1. Thanks to all the fans of our series! http://t.co/MUb5jXINSh We Slept No More last night. Highly recommend; 4th floor gets xtra weird #McKittrickHotel #sleepnomorenyc #strobejunk http://t.co/5UV7lJUbfu #THPS5 school with Andrew Reynolds\nThe electricity is a power up from grinding power lines (as you would in reality) http://t.co/T5MuIX40I8 Back when I did back lips on rails (with aid of ramp) in 95. Thanks @atibaphoto for this! deck:shoe ratio is on point http://t.co/VcCXq6GbmG #THPS5 drops in less than two weeks. You can finally skate the @berrics... as @ChrisCobraCole http://t.co/uJld83eEAp Watching @lizziearmanto develop her own style recently has been inspiring. I shot this of her today via #ActionCam http://t.co/bAAxyR6Ird This print of me above The D (aka \"Where Hawks Dare\") &amp; other sweet pics are now available at http://t.co/L0Vv9eoiB0 http://t.co/xOL2l91Hcd Tickets still available to 2015 Stand Up For Skateparks (benefiting @thf) 10/11 in Bev Hills: http://t.co/5yMfTYlDUc http://t.co/EtdrmnZeRX Thank you @movnomadx @Dosuna &amp; Tijuana for the hospitality! Every #nomadx was a blast, but TJ was truly special http://t.co/j2MieTDE9j ¡Hola Tijuas! #nomadx http://t.co/PAaypyB7Qo We have a winner! The song was released in 1978 btw - OG electronica  https://t.co/VyfBdxQ4hV First person to correctly identify this song (&amp; band) wins a Nixon Blaster @nixon_now #tooshortforshazam http://t.co/6fPFPR6tqi Some of my fav clips from 2007 @birdhouse video \"The Beginning\"\n🎶: Cold War Kids - \"We Used To Vacation\" http://t.co/ELmpersfcW 1991 Frosted Flakes commercial featuring Chris Miller. I was the on-ramp cameraman &amp; @realtonytiger's stunt double. http://t.co/Yy3DGSTzat RT @RevoltTV: .@tonyhawk &amp; team put on a show for the people in Vegas. \n\n#GumballOnREVOLT http://t.co/yhnAoWVx3i Tune in now to see myself @buckylasek @elliotsloan @lizziearmanto &amp; more skate my ramp for @boneswheels. #BonesLive https://t.co/Ke8W3Eyg0M We're skating in one hour for a #BONESLIVE session at my ramp. Watch/troll here: http://t.co/jymcf6PZAe Demolition Radio is back! Not that we ever left. Listen now on SiriusXM 41 @RadioFaction and/or call 1-877-HEY-HAWK to say something funny We will be skating LIVE tomorrow at 3pm PST, answering questions &amp; taking requests. Join us: http://t.co/jymcf6PZAe https://t.co/IVc1aDs3qx I don't know anything about this but it's awesome: a fairytale heelflip in Brazil by #RayssaLeal (via @oliverbarton) http://t.co/uZgshHYMMT Here's an exclusive offer from @BestBuy for #THPS5 (drops Sep 29!) https://t.co/oiOEdEe3j1 Customs agent at LAX (viewing my \"Anthony H\" passport): \"You related to Tony Hawk?\" I am. \"I can see the resemblance\" http://t.co/kcmdsn2F5p Adios Hermosillo, gracias #Nomadx! http://t.co/m6Pg20g0Ya ¡Hola Hermosillo! #nomadx http://t.co/tZ2ZliESEW Backyard NBD by Zion Wright \n#bonelessbounce http://t.co/4Wy8nxnliR I'll be streaming a live skate session at http://t.co/O3BohBREZo w/ @boneswheels team 9/9 at 3pm PST. Ask ?'s, suggest tricks or troll hard. A hands-on preview of #THPS5 by legit skaters: http://t.co/TnpAWouRVd Just #DonateOneDollar &amp; you can help save the Salesian Boys &amp; Girls Club @SalesianClubsLA! Please watch &amp; RT: http://t.co/Th7KL4Ik2t Big Day Out (Australia),1996: @rickthorne &amp; I stalked the Beastie Boys backstage for this pic. \nMCA ruled. http://t.co/RzsOhfAGWj It's all happening #THPS5 @TonyHawkGames http://t.co/49CuYiqxUA Back-to-school is the best! Or not, but new clothes are cool. Hawk Clothing is 20% off 10AM-3PM (CT): http://t.co/sP8h0cFDJK \nCode: WHYWAIT RT @TonyHawkGames: 16 years ago today, @TonyHawk made his videogame debut. When was the first time you played #THPS? 2015 is the new 1985\n#mcsqueeber\n(via @adrianmorris_) http://t.co/EFgdbDiVMR @JellyBoards @MariSmith thanks! ¡Hola Juárez!\n#nomadX http://t.co/YFcVGIGF2g @Arran_Cross @JessConditt @engadget indeed Thanks @engadget! https://t.co/Ome02NMWSK My daughter learned Ollie to fakie yesterday, with full narration.\n@sk8swing http://t.co/g5llSRmQUX A new trailer for #THPS5 just dropped (assuming \"dropped\" now means \"finished uploading\"): http://t.co/I5hs4xcxAE @TonyHawkGames Bidding ends soon for @THF \"Boards + Bands\" auction (featuring Ozzy, Jay-Z, U2, Elton, Metallica, Devo &amp; Tom Petty: https://t.co/mdhj1eKBhw RT @people: How @tonyhawk is bringing skate parks to kids in low-income communities http://t.co/CccA7o5mUK http://t.co/2Rc3YTcxeM Sorry about posting wrong # earlier. For future reference, our radio call-in is 1-877-HEY-HAWK. You'd think I'd remember that after 10+ yrs. my quiver... of movie memorabilia (via @Nixon_Now): http://t.co/1BlNYMbVE1 RT @RideChannel: .@tonyhawk's first setups weren't the best, but they were a start http://t.co/TdQmT94dln http://t.co/jE6tSrYwGT @TigNotaro Tig In Japan! \naka Lost In Translation 2 Skate with us Sep19! All proceeds benefit @tonyhawkfoundation; spots still avail.\nInfo: events@tonyhawkfoundation.org http://t.co/tstnOqy5kG @abbyferri it is A glorified Segway without handlebars is not a hoverboard. Swellbow!\n#occupationalhazard #perilsofvertskating http://t.co/dr6AxwxoS4 @akaspenny_ thanks! Arx Pax / Hendo have some secret breakthrough technology, but I rode their original hoverboard yesterday\n📹 #ActionCam http://t.co/6v2HNhuXzs RT @charitybuzz: Spend the day with @tonyhawk at his personal training facility in #SanDiego! http://t.co/1Dxot2cmiv Help preserve skateboarding history! Head over to http://t.co/2Ds7UQmv61 to vote (&amp; watch) #Skaterdater into the National Film Registry. Here's a chance come hangout with me at my ramp in San Diego while supporting @THF &amp; Ric O’Barry’s Dolphin Project: http://t.co/8F6qvFgp16 Goodbye Motor City! Thanks to @miniusa for the ride while we were in town.\n📷: @CameraJesus http://t.co/OMZTO1uaIa Living la vida boat-a in The D. \nShot with @Actioncam #ActionCam\n#wappaah #bradpitted\n🎶: Mars Volta - \"Aberinkula\" http://t.co/MU95EPmL1g RT @THF: #Bono with @tonyhawk's deck feat. \"Where The Streets Have No Name\" +signed by all of @U2 Bid @ http://t.co/59Qnu5TOG2 http://t.co/… #THPS5 is available for pre-order today at http://t.co/XSLfumcoR6 in case you want to blast Sacktaps asap. Watch today as I host the Van Doren Invitational of Skateboarding on CBS Sports Network\nChannel Finder: http://t.co/TDtDaR5eiJ Best pose I've seen. Thanks for joining \"me!\" https://t.co/yu3Jp6X3v6 Our @birdhouses tour in 1994: 7 dudes, 1 van, 5 weeks, skating parking lots, sharing 1 hotel room. Living the dream! http://t.co/MZmkZU78v6 My friend has a fun Kickstarter project about videogames in the 1990's: https://t.co/otvpZ0ywZB (ends today) Clips during my \"impossible phase” in 1991 (from Tracker’s “Stacked” video).\nmusic: Joe Jackson - “One More Time\" http://t.co/HgJkS3xUe3 I've always been proud of our videogame soundtracks, and #THPS5 is no exception. Here's the playlist: http://t.co/ZWy1OrO9ER RT @ABC7: Tony Hawk, Ben Harper raise money to build skate parks for at-risk kids http://t.co/c5fDugEREf This is true. https://t.co/5S5UUrCUZe \"our house... in the middle of our street\"\nhttp://t.co/LJbia8SZY9 The Boards+Bands auction (benefiting @THF) is now live! Thanks Mark Mothersbaugh &amp; Ben Harper\nhttp://t.co/9CCVfUot9q http://t.co/Za4iNZrGSu Frontside cab revert, @birdhouse ad, Skateboarder Mag, 1997. \nI made it twice that day but never pulled it again http://t.co/yIwWz6ltA8 1-877-HEY-HAWK (we're live on @RadioFaction) Vote for my buddy Matt Lasher (&amp; 3 others of your choice) as one of Seton Hall Prep's \"Mt Rushmore\" &amp; I'll follow you http://t.co/pWAbJjP0da #THPS5 graphics have improved so much in the last month of dev that I almost regret sharing prior gameplay footage: http://t.co/DyMHew0K51 Vote for my buddy Matt Lasher (&amp; 3 others of your choice) as one of Seton Hall Prep's \"Mt Rushmore\" &amp; I'll follow you http://t.co/pWAbJjP0da Connecting with my kids by sharing passion for sports. Working w/ @realtonytiger to ask: how do you #showyourstripes? http://t.co/TQtzD4j7Jj RT @RideChannel: 12 new images from @tonyhawk’s Pro Skater 5 just leaked. Check ‘em out! http://t.co/wzRFavcMfr http://t.co/6aDStQfwbk Much hoverboard hype lately. Thanks @zapataracing for allowing me to hover over water. Such a blast! #HoverboardbyZR https://t.co/I6DU9pdZ2p Tap tap tappy w/ @aaronjawshomoki at @woodwardwest; this didn't go as planned but it looks cool.\n📷: @jodymorrisphoto http://t.co/GJbX5HtILa Demolition Radio starts now. If you don't listen, who will hear us? SiriusXM 41 @RadioFaction call in: 1-877-HEY-HAWK Chris Cole &amp; I were playing with ourselves earlier. I mean only digitally. Or, uh... never mind.\n#THPS5 drops Sep 29! http://t.co/xfEzGp3dAQ The last installment of our #birdhousegoeseuro tour videos, featuring Munich &amp; Prague (on @RideChannel): http://t.co/h1ZIJSG6YE NINJA! #chappie http://t.co/TtaG0Tf49v Tune in NOW to @RBSigSeries on NBC &amp; witness @pedrobarrossk8 push the limits of skateboarding as he competes at the #VansPoolParty Grown-ass men skating backyard pools. We never seem to grow up: https://t.co/wuBb03iW0f Tune in NOW to @RBSigSeries on NBC &amp; witness top oros compete in a brand new street skateboarding event #HartLines We visited this DIY spot deep in the Czech Republic at the end of #birdhousegoeseuro tour. Video on @ridechannel Mon. http://t.co/MGeSIoyDug RT @RideChannel: .@tonyhawk and Andrew Reynolds have been pro longer than many skaters have been alive. And they're still progressing http:… Thanks to all the skate fans for helping @ridechannel go platinum! http://t.co/o3TThd3Pb2 Watch @RBSigSeries tomorrow at 1:30pm PT as the best street skaters shred Detroit’s Hart Plaza for #HartLines on NBC (I'll be on the mic) @BillyDeZavala1 the view is from the top of a pool. It's a classic Smith @bryce_mcgehee it's the top view of someone skating a pool... Smith Smith Grind!\n(honey pie, you're not safe here)\n@everybodyskates #everybodyskates http://t.co/TYtXOcVkHY Thanks Trevor! Very excited to see you take over my all-time favorite show https://t.co/VCPJUqqQKj Good morning N'awlins!\nStoked to be speaking at @Sage_Summit today. #SageSummit http://t.co/k6escB1CvM Rocket Air from 1st #birdhousegoeseuro stop. It seems like months ago! Thanks @miniusa for everything\n📷 @lewisroyden http://t.co/fH8YDYJnGc Czech customs agent: \"What do you do?\" Professional skateboarder. \"And you ride this?\" Yes. \"But my son has a Penny board &amp; it is faster\" \"Prettttttty, prettttty, pretttttty...\" Prague http://t.co/1DhqGZDnC5 Part 2 of our #birdhousegoeseuro adventures is now live on @ridechannel, featuring our stops in Paris &amp; Malaga:\nhttps://t.co/DTQWWemUkF Bones Brigade! I mean... Bone Church. #GothGroundZero\nPhoto: @sammullerphoto http://t.co/BO2CHax6ao Thanks Prague! Great crowd, such a blast.\nHere's @shawnhaleyeah front feebs on an awkward extension.\nPhoto: @dupedupe http://t.co/C3MjBlKZWv 2 seconds with @davidloy under the Boneless Skate Shop. Shot with #ActionCam \n#birdhousegoeseuro #guillotinegrind http://t.co/NhTPyg4UUn Airwalk ad, Oct 1997: lipslide at Roosevelt\nThis was the pinnacle of my street phase.\n📷: Sturt http://t.co/kvH4nyWNIW Our first @birdhouse video #Feasters is now on @RideChannel. 20 minutes of skating in big pants on little wheels: https://t.co/DnJqVbJEFg Looking forward to speaking at @Sage_Summit ! I will be sharing my experiences on \"finding a fanbase\" among other topics. The 1st @birdhouse video \"Feasters\" was released in '92 w/ Berra Klein &amp; Santos. Watch @ridechannel's short doc on it http://t.co/wUZFVJW5Oa My friend @realtonytiger taught me a part of #ShowYourStripes is having a pregame ritual. Here's mine, what's yours? http://t.co/ahBbDGtMRe Thanks @miniusa #ActionCam #THPS5 (@TonyHawkGames) &amp; #sportsdirect for making our tour possible (McTwist from Malaga) http://t.co/e0XfmxmKwm Testing then human limits of impact: @aaronjawshomoki goes fish in Copenhagen. http://t.co/Gq8HvXgRLn RT @RideChannel: .@tonyhawk, @aaronjawshomoki, @Lizziearmanto &amp; the @birdhouse team are ripping Europe now http://t.co/TEApEPdyfB http://t.… If you ever go to Ronda, find the \"secret mine shaft\" to get here. Then collapse from exhaustion walking back up. http://t.co/S3INEJ4lhh Gracias Malaga! Yesterday was a blast; so glad we visited your beautiful city.\nVideo: #ActionCam\n#birdhousegoeseuro http://t.co/xcymqlit5b Turistas en España\n#birdhousegoeseuro http://t.co/E0iTpiOIcg The #birdhousegoeseuro trip is our honeymoon, so we're embracing radical romance. Thanks @z_trip for the perfect song http://t.co/4iYNspbAwe RT @SportsCenter: Skater @TonyHawk wasn't always soaring to new heights--an early moment of failure during his childhood reshaped him. http… I never thought my son @rileyhawk666 would be featured in @RollingStone... as a skater, no less! http://t.co/LnA3wN9JCr Bonjour Paris! Nous skatons ici à 4pm http://t.co/lJbJGlMG0D I recently got to ride a skateboard made out of cardboard (thanks to @ErnestPackaging) and it worked: http://t.co/jOtmmSKbT0 Mona Lisa, and the excitement gang http://t.co/6ykAWKKn8e All you need is a MINI to join #MINIontheMack. You can be part of the largest gathering of @MINIUSA vehicles ever: http://t.co/HK8hMVTSyW RT @stereogum: Hear Cold Cave cover the Cure's \"Plainsong\" at @tonyhawk's wedding http://t.co/cQEuVuU7sV http://t.co/ehLAOugIrb CPH feat @lizziearmanto @_davidloy @shawnhaleyeah @aaronjawshomoki &amp; @Theclintorous via #ActionCam\n#birdhousegoeseuro http://t.co/XHtiG8SeVv Here's an early morning impossible sweeper in Copenhagen. Our @birdhouse demo starts at 4pm in Fælledparken today. http://t.co/bcoouAbhxf Copenhagen crew \n#birdhousegoeseuro http://t.co/z0lWQkzNoP The #THPS5 trailer is live. Behold: https://t.co/Q0ebxKvkxa Copenhagen crew \n#birdhousegoeseuro http://t.co/ETeteFdXCm While going #DarkForDinner, I found out Calvin does lein disasters &amp; Keegan got kickflips! Thanks @DixieProduct #ad\nhttps://t.co/if8FM6XqvD 84% of people are on phones at meals! Get quality time, go #DarkForDinner w/ @DixieProduct http://t.co/t71DmZmeim #ad http://t.co/WSw3FFp3IS Thanks @sidewalkmag for these clips from @nassfestival yesterday: @lizziearmanto Staab @stew_bacca me &amp; @bignarstie\nhttps://t.co/cGbCyLOG5G Thanks @MEATmission for hosting our entire crew tonight! Dead hippie &amp; monkey fingers were exceptional. We shall return. @MEATmission @bengibsonphoto thanks! Thank you @NASSfestival! We had a blast https://t.co/LIRKT6lCqd @SEASthrash haha thanks! I wish I had thought of it sooner and told Kevin to actually do it Here comes the sun. It's all right.\n#RingoWasMongo\n#birdhousegoeseuro #roadtoNASS\n📷: @sammullerphoto http://t.co/AjypVEvQq1 RT @NASSfestival: .@tonyhawk + @birdhouse team, Vert ramp tomorrow, 4pm http://t.co/sWI3qFTU3r \"Stonehenge! Where the demons dwell.\nWhere the banshees live and they do live well\"\n#roadtoNASS #birdhousegoeseuro http://t.co/t6J7pXAnZb Wild in the streets (of London): @aaronjawshomoki http://t.co/uGMlfCYNvx \"Dream Big: Skateboarders in Ethiopia\" airs Sat on ABC @ 2pm EST. See our adventures w/ @_Let_It_Flow &amp; @megabiskate, thanks to @AYCOfficial The #birdhousegoeseuro tour has landed.\nWell, most of us. http://t.co/OFuSfbO1oY A favorite aspect of traveling the world is teaching kids to skate. How do you #ShowYourStripes? @realtonytiger #spon http://t.co/vNEfvZtq7y Bye Khaleesi, see you soon 👴🏻👰🏼💒\n📷: @CameraJesus http://t.co/Cu60p0cvKd Demolition Radio is starting now feat. @ztrip! We are live on SiriusXM 41. Call in: 1-877-HEY-HAWK From 1976 film \"Magic Rolling Board\"\nI remember seeing the barefoot FS 360 \"gorilla grab\" as a kid &amp; not believing it http://t.co/WMXU9fTMhF RT @ztrip: YO! I'll be catching up w/ @tonyhawk today on his Demolition Radio show @SIRIUSXM (Ch.41) 7-8pm east, 4-5pm pacific. Tune in @Ra… Please allow me to be your tour guide of my hometown San Diego in this episode of @PlaneTrain_Auto  https://t.co/28oNn1Behu Nice digs, Notch! Thanks for the invite. http://t.co/1H9zAW2rgI @ikesplace yellow Happy 4th! Here are some pics of me skating in &amp; around the White House in the name of freedom. 🇺🇸💥🎆\n#GturnForJustice http://t.co/N4fWRMUqNn @ikesplace turkey, provolone, avo, lettuce, tomato, pepperoncinis &amp; mustard on squaw or wheat @nickciarelli same. Hope yours is totally radical and full of democracy Birds of a feather... eat Irish beef together.\nShot with #actioncam in Adare, Ireland. http://t.co/ehZrtQqe66 Birds of a feather... eat Irish beef together.\nShot with #actioncam in Adare, Ireland. http://t.co/odiVN8dkQ8 I am not worthy https://t.co/WkaLKT7x1D RT @RideChannel: Almost three decades later, @tonyhawk returns to the park he grew up skating. http://t.co/JAUmglwjG7 A few clips from yesterday's [last ever] session of Del Mar Skate Ranch w/ @sagebrittain &amp; skate-enema Kevin Staab http://t.co/AbUGwDUhoy"}