{"tweets": "@natasharothwell 🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾 RT @AdamSerwer: 1. Free speech includes the right to publicly mock, criticize, and belittle agents of the state. It does not include impris… Here's the link! https://t.co/gVVPiM2tmu If you had a song with @kellyclarkson you'd want to promote your Christmas album in October too! Signed copies of the deluxe edition of #ALegendaryChristmas are available for pre-order now! https://t.co/wVDuOWgii6 https://t.co/NWLWUfWhFS Thank you @VanityFair for the beautiful photos and story https://t.co/CVrgHylAQR @JJWatt Wishing you the best, sir @chrissyteigen I love you my baby. See you tonight @marybeth_music Condolences to you and your family 🙏🏾 @MaddowBlog Excellent work Some words from our President. RIP Elijah Cummings https://t.co/ymmzVi29Rf RT @AdamSerwer: The federalist goes full fascist, and  is now arguing that Trump losing an election would be a “coup,” because Trump is the… RT @DeeDot85: Thanks for singing Stay With You @johnlegend and making it rain on my face several times ♥️ It was our wedding song last year… Thank you, London!  Tonight at @TheO2 was magical!!! I love you! RT @LukeHermi: @johnlegend was phenomenal again tonight, 3rd time I’ve seen him live and just gets better and better. #02arena #johnlegend RT @sammykk83: @johnlegend  We had such a fantastic night tonite @TheO2  when you sang \"all of me\" it brought back such happy memories of o… RT @LewisCrocket: How good was @johnlegend tonight! Absolutley smashed it and had a great night with @CharlotteMay_ https://t.co/glg4uJwdp5 RT @Hazel_i: @johnlegend That was flawless performance at London 02! From the a capella, the band, the final rendition of Glory and the pow… RT @Hazel_i: @johnlegend KILLED London 02 tonight! 🙌🏿❤️👊🏿👏🏿 https://t.co/ytsJxHrUdj RT @lozzaj84: Went to #bluesfest london2019\n To see @johnlegend tonight.... I’m in love. What a guy... what a voice...total super star. Can… Congrats to these incredible individuals for joining our 2nd cohort of #UnlockedFutures! I’m excited to be a part of their journey as these entrepreneurs, supported by @LetsFreeAmerica, @BofA_News, and @newprofit, grow their businesses.\n\nLearn more: https://t.co/YgOsWrA0O4 https://t.co/1sXXZZPo5o RT @rtraister: Coincidentally my column this week is about why the brutally powerful often cast themselves as victims of brutality (specifi… The final episodes are so moving!  Such great performances and so much heart!  @rhythmflow https://t.co/csf7lAqdlf 😀 https://t.co/qFZtEqBgMr So excited to be performing at @BluesFestUK at @TheO2 in London tonight! My only UK show of the year. Hope to see you there! https://t.co/yIUWbKA6Af https://t.co/chVP5BC12S @calbertson I didn't say only black people were lynched.  I did say it was usually due to virulent racism.  Italians weren't considered \"white\" at the time.  This article should help you understand that lynching Italians had similar bigoted motives as lynching blacks. https://t.co/MNnXDWr5j5 @MyMichelle_7 @chrissyteigen you idiots type up a list and think it's some official transcript. Los Angeles! Come by @Pavilions in West Hollywood on Oct. 28th for a tasting of my wine, @LVE_wines! You can learn all about your favorites, plus I'll be there for a meet and greet! https://t.co/kEghfQxsj4 The final episodes of #rhythmandflow are here! I can't wait for you to see what I have in store for them. https://t.co/mYirTOGVYK Stay tuned! https://t.co/QtJV8K59Mb @flickr2754 If they called it a lynching they were wrong too! My face at the end is how I try to be everyday of this shitshow My thoughts on impeachment as \"lynching\".  Everyone study what real lynching is/was before you throw that term around. https://t.co/JUxPrlMSU5 RT @NBCTheVoice: .@danestephanie_ and @marybeth_music’s battle earned a standing ovation from all FOUR Coaches. 👏 😱 #TeamLegend https://t.c… Dane, Stephanie and Marybeth... you three made Team Legend very special... thank you!! #VoiceBattles RT @neal_katyal: About to take the stage at @VanityFair Summit, so honored to be on stage in a conversation with the legend @johnlegend.… RT @michelleinbklyn: Republicans who are worried about impeachment tearing the country apart should be going to Trump privately and telling… Uh oh https://t.co/AC5qkkHeo6 Listening to the other coaches? Or thinking about lunch? You decide. https://t.co/pqcjj54Nao Jared and Will… I couldn’t be more proud to have you on #TeamJohn! Great work by both of you! #VoiceBattles @ericripert @LeBernardinNY @MichelinGuideNY CONGRATULATIONS! This Thursday, during @USCCFoundation’s #TalentForward19 Conference, I will be discussing the systemic barriers so many individuals impacted by the criminal justice system face as they try to reenter the workforce.\nStay tuned for a special announcement. https://t.co/468UJc6JaH https://t.co/UdjfGa7qyL @prisonculture Happy Birthday!! @JayREllis Jay Ellis. JL. Same same @DrJillStein @HillaryClinton Bye Jill Love to the family and friends and constituents of the great Elijah Cummings.  What a life.  What a career.  He worked on behalf of the people with integrity, tenacity and intelligence.  The entire nation will miss his irreplaceable voice. #tbt to the 5th grade.  My last attempt at organized basketball. Teammates included my brother bumper3077 and cousin vadastephens.vasm.  My basketball skills were essential in pushing me to focus on music. 😂🏀 https://t.co/wqiNopcDxq RT @iamcardib: There’s three new  episode of Rhythm &amp; FLOW out today on Netflix! Who’s watching it ? @ava ✊🏾 @chrissyteigen This outfit! @SeanMcElwee @deray Damn That performance was a MOMENT and I’m glad we all got to see that together! Good for you @GwenStefani! #VoiceBattles #TeamLegend is getting to know each other!  I'm telling them about my favorite non-singles from my catalog.  What are your favorites? https://t.co/Hty54ekMZA RT @AOC: Both rationality &amp; emotion are inextricable to good leadership, which balances the two.\n\nIf a person doesn’t feel urgency in their… Joining @usher as my new guest mentors.... @ Universal Studios Hollywood https://t.co/f8AobUUZRq There was NO way I was going to let Zoe or Khalea leave Team Legend! They're both winners!  #VoiceBattles What’s that you hear? Oh yes.. it’s the sound of Team Legend being COMPLETE!! #VoiceBlinds https://t.co/dK1vgjnEks RT @womensmarch: Happy #IndigenousPeoplesDay! Phenomenally Indigenous activist, storyteller, and Women's March board member @Ms_EagleHeart… RT @GavinNewsom: When parents can't afford to buy their kids the typical school lunch, students are sometimes denied food or given a differ… @NBCTheVoice https://t.co/wtSfAqBcZK RT @prisonculture: https://t.co/FEAzWexPwr RT @Sifill_LDF: On the day after #AtatianaJefferson is killed in her own home by police, do not forget - AG Barr has continued Jeff Session… @Sifill_LDF @americanacad @ProfessorEA @mearest @JLWeisenfeld 🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾 @BillKristol Serious question: why aren't you a feminist?  What is it about feminism that you're against? @yashar @rhythmflow Thanks @yashar!  So proud of our show! @SNFonNBC Walter Payton Addiction is often seen as a “grown-up issue” but it impacts children in ways that aren’t visible. @sesamestreet’s new resources address the challenges of parental addiction and help the whole family cope: https://t.co/L1pYKHAG4a #SunnyDaysAhead https://t.co/9PaMAT3rGh RT @AdamSchefter: Colin Kaepernick’s representatives released statements today to clear up some facts surrounding their client: https://t.c… @secupp I see no bullying or silencing in this letter.  Raising legitimate concerns is neither of those things On #WorldMentalHealthDay I’m standing w/ @YourTourSupport, a new program to support mental health in music touring. They’ve partnered w/ @betterhelp to create BetterHelp: Tour Support to provide on the road counseling for artists &amp; their crews. Learn more: https://t.co/xIMFCDEJkX https://t.co/GxyBkajSkN RT @latimes: Kill Your 'Idol': Netflix's 'Rhythm + Flow' rewrites the rules for music competitions https://t.co/9ooX65Snjx RT @rhythmflow: We're writing the next chapter of hip-hop history. Rhythm + Flow is now streaming. #RhythmandFlow https://t.co/bLGBmYTaNw @tystiklorius Someone tell my manager! Congratulations, @AmbassadorRice!  Looking forward to reading this https://t.co/ZRjhHj3QVN When in doubt.. sing your pitch! I’ll give you a shoutout on #3, Blake. Let’s do this, Khalea! #TeamLegend #VoiceBlinds I might not be as colorful as @GwenStefani.. but... I have to say... my team is looking pretty bold to me! #VoiceBlind Nobody likes you, @blakeshelton.  😀 https://t.co/0mNbKz1XTE And now for the greatest trailer of all time about a talk show named \"Trailer Talk\" - THE trailer of #TrailerTalk https://t.co/klApWTPvOg Woah. Woah. WOAH! I did NOT expect Matt to pick me. But.. happy that he did! #VoiceBlinds Hey @chrissyteigen.. looks like we’re having a dinner guest! What should we make?? Excellent choice, Jared! #VoiceBlinds @kellyclarkson @NBCTheVoice @chrissyteigen Betrayal!!!! @blakeshelton @CarsonDaly @NBCTheVoice I like jerky too, guys. Maybe you could let me know the next time there's a tasting.  Jerks. #TheVoice Bloopers: where 90% of the retakes are due to @blakeshelton https://t.co/PzCX4K1M2v @NBCTheVoice ❤️❤️❤️❤️❤️ RT @AOC: I know the term “prison abolition” is breaking some people’s brains. The right is already freaking out.\n\nYet the US incarcerates m… RT @KevinMKruse: Well, every presidential candidate for the past forty years voluntarily released their tax returns because none of them ha… @LaVMFos @providencecol I watched the first 2 hours, but I had to go to work! I had so much fun at #latenightmadness with @providencecol friars_basketball!  Have a great season!! https://t.co/q9POuTXQ7B The San Francisco District Attorney election is heating up! Make sure you stay updated and vote for @chesaboudin. #Boudin4DA https://t.co/64SZJo56K4 RT @RealNHenderson: 🚨Mark your calendars!🚨for the first time ever, we—FIP— are hosting a town hall for presidential candidates on Oct 28th,… @TVietor08 @marcorubio Little, Liddle, Liddle' Marco @EricMacCarthy Thanks!  It was @gucci Show us your tax returns, Donald https://t.co/csilRWf3dX Iconic trio! @rhythmflow https://t.co/3jRRTZMbwt Good conversation with Sam! https://t.co/Pt3i1h3z21 @itsgabrielleu @DwyaneWade @ontheborder @OhioStAthletics @KingJames 🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾 Did you guys honestly think Preston wasn't going to pick me? #TeamLegend is his home! #VoiceBlinds I had a hunch you'd pick me over @BlakeShelton, Dane &amp; Stephanie! #VoiceBlinds That was FUN to watch :) Popcorn, anyone? 🍿#VoiceBlinds Love this dynamic duo.  Love their story!  Check out Dane &amp; Stephanie! https://t.co/w3JouHGB8K Preston is 14 and has a croon that's way beyond his years! Who do you think he'll pick as his coach? https://t.co/H08esDlnA9 San Francisco voters! You should be receiving your absentee ballots any day now. Please consider voting for @chesaboudin for District Attorney. #Boudin4DA https://t.co/KO2LoKFPwu Thanks for blocking Blake @KellyClarkson! You're a real team player!! #VoiceBlinds I honestly thought I had a chance with Josie! Doesn't hurt to try! #VoiceBlinds OUCH! That one hurt @gwenstefani! #VoiceBlinds Welcome to #TeamJohn Mendeleyev Galileo Einstein Pythagoras Darwin Euclid Leonardo Allan-Blitz. We'll stick with 'Lev.’ 👍 #VoiceBlinds @chrissyteigen You know how much I pack for a week vacation.  What's in this suitcase will last me til...now.  Home soon! According to Luna, you're in fact too late already 😀 https://t.co/nJvJeQNBwv .@blakeshelton asked if he could get a selfie with the reigning Voice champ for good luck https://t.co/jSFJAlChhy Ok, I never considered performing Ordinary People like this! https://t.co/umpXLfQahx RT @BetoORourke: Our president is threatening a Civil War. This is a constitutional crisis, but it's more than that: It's a threat of viole… RT @AdamSerwer: A day after quoting a radical cleric threatening civil war, the president demanded the arrest of an opposing party leader,… @itsgabrielleu @DwyaneWade @chrissyteigen Finally someone admits it!! 😂 @Lavell95259499 @itsgabrielleu @channingfrye @KingJames I also wrote a song that kept saying \"I don't wanna brag\" while bragging the entire time. https://t.co/XlpUlRU9Ak @itsgabrielleu @channingfrye @KingJames Sometimes you win by so much it feels excessive to gloat @DankSinatra06 I must confess. I'm a deserter. https://t.co/evZc2kWSzc https://t.co/hWcPIj5x7A @KingJames @OhioStateFB It's official!  https://t.co/50RxH02UuK A few of my favorite things https://t.co/PkyVyAmhqi @itsgabrielleu @Huskers #belikepurdue.  Ok, that stung a little @jemelehill @itsgabrielleu @CollegeGameDay Oh she must've picked Ohio State then? 😊 @MichiganStOnBTN @MSU_Football @LukeFulton_11 @EliseMenaker Sounds great! Trump is his own Deep Throat.  His own Tekashi 69, perhaps @CerromeRussell https://t.co/n7LzvFV1rQ We don't need secret docs and tapes.  It's all right there. He told Lester Holt he obstructed justice in a nationally televised interview. He told Russia to interfere with election via press conference.  He encouraged foreign governments to spend money at his resorts via press conference Exactly.  Trump's best shield has been doing all this in the open.  This Ukrainian thing feels different because it was a whistleblower report.  Press and Congress need to feel like they're uncovering secrets like Nixon tapes.  The impeachable stuff has always been right there. https://t.co/r2NSe3uxGi @GOPLeader That last sentence is absolutely correct. @LindseyGrahamSC @realDonaldTrump You impeached over dishonesty about a sexual affair. Spare us We found some of the best undiscovered hip-hop talent in America, but only one can win it all! @rhythmflow premieres Oct 9 on @netflix.  Let the battles begin! https://t.co/AjmhvuoHmG @rtraister The blunt instrument known as Stephen Miller's pen is all over this .@PaulSmithDesign, who also designed the jacket from season 16 blinds! https://t.co/YsbUsGlntS Hi @kellyclarkson... I just wanted to say that I really love working with you and you're a great person... #VoicePremiere Luna requests Ariana \"NUSA\" (that's what she calls it) and \"daddy's Christmas music\" just about every time we get in the car.  Christmas in April, June, September.  Christmas all year long. https://t.co/CQ18CY5L9l You can’t fight fate @gwenstefani! Will was meant to be on #TeamLegend!  Thank you for being so understanding. #VoicePremiere Feeling “annihilated\" tonight. @gwenstefani can you ask Rose to cover one of @kellyclarkson’s songs next round?? I think that will make me feel better… 😏 #VoicePremiere Thanks for using your Block for me @blakeshelton! You’re a real friend… so selfless and caring. Do you smell that, everyone? I can smell a repeat victory for Team Legend already #VoicePremiere The weekend is over. Back to work.  #TheVoice premieres tonight! https://t.co/65FvZkWag5 One of my favorite moments on #TheVoice so far! https://t.co/bsigKbnlVq @NBCTheVoice This is a very glass-is-half-empty hashtag.  I'm more of a half-full type of person @SteveLindsayCBS This is amazing When in Ohio, do as the Ohio Players do https://t.co/SvgixVAfin @chancetherapper 🙏🏾 Happy 70th birthday, Dad! @popz_topz https://t.co/RAhOqKtGvd Miles and his beautiful grandmothers! https://t.co/kbYGY0XK8W Got to spend time with Granny Stephens today! @ Springfield, Ohio https://t.co/rnXmch8zhs I just want everyone know that @galifianakisz is an evil, seductive man and he gets what he deserves in #BetweenTwoFernsTheMovie, streaming on @netflix now @SpeakerPelosi Impeach him RT @jbouie: here's the thing: we are at the point where if pelosi stonewalls impeachment and trump wins reelection, \"impeachment\" as a cons… RT @ewarren: After the Mueller report, Congress had a duty to begin impeachment. By failing to act, Congress is complicit in Trump’s latest… Young activists are challenging us to confront the realities of the climate crisis. Join me as I stand with @amnestyusa and @GretaThunberg today as we strike for climate. https://t.co/ND1321N5dJ #ClimateStrike #StrikeWithUs #AmbassadorOfConscience https://t.co/Bra27noYa9 @blkfootwhtfoot Congratulations! Excited to listen! @NicholasBritell @chrislhayes @TelevisionAcad @jessearmstrong1 @GhostPanther @HBO love this song!  congratulations! Watching the finale of @bringthefunny: \"by far the funniest show on this network at this time slot\" @realjeffreyross https://t.co/QV46JyIpPQ The first 7 minutes of Season 17.  I can't wait for you to see the rest! https://t.co/J6h3HQqbOG Our @NBCTheVoice Mega Mentor for Season 17 is VERY MEGA.  If only @blakeshelton and I could figure out who it is. https://t.co/GTlztSyPzU When you think no prison = no consequences.  There are other ways to hold people accountable than the state paying 10s of thousands a year to hold them in a secure facility https://t.co/9GrEALJ9xF Anniversary night on the Seine.  I love you forever.  Here's to many more beautiful nights. @ Paris, France https://t.co/1hQP5xNKzG RT @ClintSmithIII: It can both be true that Felicity Huffman got an incredibly light sentence compared to an endless list of black &amp; poor p… And no one in our nation will benefit from the 14 days an actress will serve for cheating in college admissions. We don't need to lock people up for any of this stuff. Her sentence shouldn't be fewer years. It should be ZERO. It's unconscionable that we locked a woman up for voting when, unbeknownst to her, she was ineligible. It's insane we locked a woman up for 5 years for sending her kid to the wrong school district.  Literally everyone involved in that decision should be ashamed of themselves Americans have become desensitized to how much we lock people up.  Prisons and jails are not the answer to every bad thing everyone does, but we've come to use them to address nearly every societal ill. I get why everyone gets mad when rich person X gets a short sentence and poor person of color Y gets a long one. The answer isn't for X to get more; it's for both of them to get less (or even none!!!) We should level down not up. @chrissyteigen Our love is impeccable and impractical @SnoopDogg @rhythmflow @netflix 👑👑👑👑👑 The first season of @rhythmflow has an all-star lineup of guest judges, producers, DJs (and visitors)!  Let's GO! #rhythmandflow https://t.co/JL9cKmQXnQ It was my *extreme* pleasure to sing this song with my castmates from #TheVoice.  Hope you love it!!  New season premieres Sept 23! https://t.co/RPacRDoKoK RT @BernieSanders: All school meals should be free to children. New acronym alert https://t.co/IQMUyUFL6y And there you have it. Season 1 of #ShermansShowcase - we hope you had fun, danced and laughed the whole season A decision was made early in the writing to have fun with the ACTUAL Frederick Douglass ads that ran on Soul Train (https://t.co/kaNSnUWCmZ). We thought “that guy must be an imposter” and the idea of a fake Frederick Douglass as our show’s heavy was born. #ShermansShowcase https://t.co/XofjORscAl For centuries, scholars theorized about time travel. Then @NeYoCompound solves it in one song. That's gotta hurt. #ShermansShowcase #RayJsShowcase This is the actual true story of how the Lucas Brothers came to be. Keith was time traveling when he accidentally disrupted his own past. It’s just a fact. #ShermansShowcase #RayJsShowcase I hear you, @NeYoCompound - dropping inter-dimensional knowledge on this track. It's a very clear explanation.  Makes perfect sense.  #TimeLoop #ShermansShowcase #RayJsShowcase The best part of this alternate universe is #TGIM.  Morris Day starring in all the ABC Friday sitcoms from the 90’s? I’m all in #ShermansShowcase #RayJsShowcase https://t.co/2wf3JdGczQ In this universe, Dutch aka @diallo isn’t the producer of a show that doesn’t exist. He’s the front man for a blues rock band called Thunderclap and honestly, he sounds a lot like Bob Seger #ShermansShowcase As far as Sherman’s dance moves...he’s a great host #ShermansShowcase #RayJsShowcase https://t.co/lCaHiJZElT #BellBivDafoe - I always wondered what would happen if Willem Dafoe was the D in BBD!  Didn't you? #ShermansShowcase #RayJsShowcase https://t.co/x2S6z0RRWl There's nothing wrong with your TV... Ray J has taken the hosting duties away from Sherman and now #ShermansShowcase is #RayJsShowcase https://t.co/FiIKE2AfKf We’re going live! The season finale of #ShermansShowcase is on @IFC right now! Watch with us. Yep https://t.co/enlqCQhcRO You won’t want to miss @KellyClarksonTV today! https://t.co/ucu6n57WMx @diallo @LateNightSeth @ShermansShow @theknocks Amazing! @Lin_Manuel Thank you, my brother!! 🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾 If you are interested in learning more about my efforts to reform America’s criminal justice system and end mass incarceration, follow @letsfreeamerica or visit https://t.co/ybau15VgPp As always, our national treasure Sherrilyn Ifill providing knowledge, clarity and wisdom. https://t.co/NmHil9e0jJ RT @ReignOfApril: Me sitting in the conference room at @Twitter as they decide whether #PresidentPussyAssBitch violates their T&amp;C  https://… .@twitter won't let Twitter be great. I understand.  #PresidentPussyAssBitch is vile and absolutely should not trend. @mattrife @chrissyteigen Sit this one out, Matt. No one wants paper cuts from your cheekbones Please don't make this foul mouthed hashtag trend #PresidentPussyAssBitch https://t.co/TMaq58hzIx Ah yes, Melania is otherwise occupied.  My apologies, @realDonaldTrump https://t.co/aNWgNsS34a Your country needs you, Melania Imagine being president of a whole country and spending your Sunday night hate-watching MSNBC hoping somebody--ANYBODY--will praise you.  Melania, please praise this man.  He needs you. Tonight at 7pm PT/10pm ET, I will be joining @LesterHoltNBC for an @NBCNews Town Hall on @MSNBC to discuss our country’s broken criminal justice system. Follow @LetsFreeAmerica to learn more about my work to end mass incarceration. #JusticeForAll https://t.co/9DFySXsgDY Went up to Fresno to check out my nephew's (michaelbstephens22) new team @gopherfootball and they won in double overtime. Great game! https://t.co/5K0RozOLwf Thank you for including me!  #GoBuckeyes!! https://t.co/zDUMgPZSWo Thank you to everyone who supported #ACA6 in the Assembly! https://t.co/bxvgaigkWY RT @Usher: Joining my bro @johnlegend as a Battle Advisor for #TeamLegend on @NBCTheVoice 🙏🏾 #TheVoice premieres 9/23. https://t.co/hkyj8fP… RT @ClintSmithIII: Recently spent some time with a man who just got out of prison after serving 51 years and he was telling me about all of… @bringthefunny @themorganjay I want to thank Chrissy for buying me lunch at Absolutely Pho-bulous even before she was a supermodel #BringTheFunny Newport! I'll be performing live at @audrainconcours on Friday, October 4 - tickets are on sale now: https://t.co/YSRGlk7bOY RT @NetflixIsAJoke: Zach Galifianakis. Two ferns. A lot of famous people. \n\nBetween Two Ferns: The Movie premieres September 20th. https://… We took team bonding to a whole new level. Next season of @NBCTheVoice coming at you on 9/23! https://t.co/9mtnEj3jw1 @chrissyteigen Time to join the grandmas with the plastic cover on the couch RT @tribelaw: Another insane idea is\n\nthat the death penalty can deter mass murderers who either are counting on suicide by cop — or aren’t… RT @ChrisMurphyCT: 8/x And that's where we are today. No Democrat is arguing to outlaw private gun ownership. But we do believe, as the fou… We are on a mission to find the best undiscovered rap talent!  So excited to present our newest production @rhythmflow featuring @iamcardib, @chancetherapper and @tip!  Watch weekly starting Oct 9 on @netflix! https://t.co/gx8RpM98wO @RepMattSchaefer So yes to more killings, just to sum up your no/yes litany The cash bail system &amp; the $2 billion predatory bail bond industry are unjust. They exploit already marginalized communities, who should not be locked up simply because they cannot afford their freedom. Read more here: https://t.co/L7Aclg2jga #EndMoneyBail @GAAlbright Happy birthday, brotha!! I will go to as many of these tapings as I can. I need to see this https://t.co/z5ta1gWHEM RT @kittenmittensWA: @johnlegend That Girl Was Poisoned- the Bel Biv DeVoe Detective Story #rapperbiographies #ShermansShowcase RT @diallo: BEEN: The Common Story #ShermansShowcase #rapperbiographies haha @johnlegend #ShermansShowcase #rapperbiographies RT @_gellafish: @johnlegend That was America, the Childish Gambino story RT @Brandale1854: @johnlegend She was in the middle - The Monie Love Story RT @tde911: @johnlegend She Couldn't Stand The Rain - Missy Elliott RT @TheGuence22: @johnlegend Her Milkshake Brought All the Boys to the Yard - The Kelis story Thanks to @wayansjr @KingBach @Breshawebb and all of tonight’s guest stars. And thanks to all of you for watching #ShermansShowcase - see you next Wednesday at the same time .@Breshawebb doing impressions of @anitabaker and @tonibraxton ?! I could watch this all day #ShermansShowcase @jonathanchait 😂😂😂 Come up with more rapper and singer biographies by putting the names of their songs in the past tense. I’ll go first - ALL HE DID WAS WIN - The DJ Khaled Story #shermansshowcase #rapperbiographies Thank you for that anthem, @montelljordan!  You got us through many a night in the club. #shermansshowcase Hahaha, I was a \"Black kid in the white school\" (@Penn).  So were our creators @diallo and #bashir (@Harvard, and they won't let you forget it) #shermansshowcase https://t.co/an1TxRDHlG These Frederick Douglass sketches on Sherman’s Showcase are based on ACTUAL in-studio ads that ran on Soul Train in the ‘70s. Don’t believe me? Go on YouTube and search for “soul train Frederick Douglass.” You’re welcome #shermansshowcase https://t.co/H0eSflrTrl Shoutout to @diallo @phontigallo &amp; @Zo3hree5ive for giving all the black kids in the white schools (HWCU’s) an anthem! Oh, and turn up that #gogomusic! #shermansshowcase @adamballew Agreed! “Cheat Day” is by far my favorite Fast Freddy Payne album. I covered this song about stalking for our launch party.  Don't stalk, y'all.  #ShermansShowcase Willie Wallace!  He can and he WILL. https://t.co/pL4tTteoCy Shout out to our talented animator, @songeriddle.  You'll notice they switch up the animation for the different decades of the show.  #ShermansShowcase #ShermansShowcase is live now! Watch with me and the show’s writers! Let’s go… https://t.co/IHWhZGkpEO @SpeakerPelosi @realDonaldTrump Impeach him @RoRoSav @cccdub Thank you! Headband of Every. Day https://t.co/Ebyf9N3ud1 @allisonthemeep Yes!  I was tweeting my concurrence @BillKristol But LBJ didn't have multiple felony indictments awaiting his departure Andddddd fried chicken is delicious and nobody should be ashamed of enjoying it! @Curt_Eisenhardt Exactly Thread. Popeye's would kill for lines like the ones outside of black polling stations. 1. Black people vote 2. We would vote even more if people like the GA Gov didn't intentionally limit poll access in ways that create these ridiculous lines. https://t.co/gdgjEn3sRw RT @NickKristof: ICYMI, my Sunday column on how to unwind the catastrophic war on drugs, which has resulted in as many Americans with arres… RT @JamilSmith: Pantaleo used an illegal chokehold to kill Eric Garner. It’s technically prohibited. Yet New York cops say that his firing… @secupp We don't have to do either.  This is all just conversation and a way of affirming and critiquing certain behavior and values. I think it's a worthy discussion if it influences people to think about the impact of their actions (in business, politics and philanthropy) on society @maxvan00 @secupp I'm gonna take a hard pass on looking to the 19th century for when America was at its greatest @rootb3er @MeredthSalenger @secupp Different Kochs. Same spelling, different family @PeterFManning3 @secupp He answers to billionaires like....the Kochs! @DWesJr @secupp Cool, bro @pmtisariddle @secupp If I ever run for office, I certainly will.  Still waiting for POTUS's \"audit\" to be over, I assume? @secupp Democracy is most certainly messy and imperfect but depending on the largesse and pet interests of unaccountable oligarchs is a far worse option. @secupp *unaccountable @secupp Trust has to be earned. But at least the people get to vote on politicians every 2-6 years. It'd be nice if those elections were free of unaccounted billionaires tipping the scale. @secupp And I'm pretty sure people have been criticizing him pretty loudly for at least the past decade. @secupp It may not matter, honestly.  But I think a lot of these guys care about their legacy. Maybe the ones who are still alive will see this and do better. Maybe they'll at least attempt to do more good than harm in the world. @secupp How many Medicaid expansion refusers did he fund? How many politicians who wanted to strip healthcare from millions did he fund?  He could have invested his money in making healthcare more accessible to the poor and working class.  He did the opposite. @secupp At least politicians have to answer to the people. At least when there aren't billionaires actively funding anti-democratic efforts like voter suppression and gerrymandering. Thanks again, Koch Brothers. @secupp I think we'll never agree on the role of government.  You'll always prefer less than I do. I get that. But I'd rather rely on democratically-elected officials than an unaccountable billionaire to set priorities and fund public goods. @JonTrotterEsq @secupp We can all debate the moral implications of everyone's political acts.  Part of your opinion will be based on your own priorities and values.  But let's at least be clear-eyed and examine the facts of what he advocated for and the real-life effects of the policies he championed. @secupp When you work so hard to avoid paying taxes that could go to fund things like education, the arts and infrastructure, spare me the celebration of your donation to the arts. @secupp For instance, when you spend so much to support politicians who want to strip health insurance from people, IDGAF about the money you spend on cancer research.  People without health insurance can't access that amazing research anyway. @secupp I don't celebrate his death. But I most certainly don't celebrate his life. @secupp He spent a decent amount fighting for crim justice reform too.  It's a cause I care about deeply.  People are complicated.  But I have to say that the net effect of the Koch brothers' activism is highly negative and I don't think it's that close of a call. @secupp It's not a lack of attention I'm concerned about. It's active attention towards destructive political aims. @HighArchmage @secupp @MIT @AnandWrites Word. He spends significant time on the Sacklers' story. @secupp @MIT When you spend so much $ and influence to dismantle the state and destroy the planet, it really isn't enough to donate even millions to offset that damage.  @AnandWrites wrote a great book re: this called Winners Take All.  I found it quite illuminating and useful. RT @IdaAuken: Mr President - Greenland is not for sale. But Denmark has a much better deal for you! Watch this. #dkgreen #dkpol https://t.c… @ava @Twitter Happy birthday, @ava!!! @BarackObama Thank you, Mr. President! https://t.co/jHNjQNFOlR https://t.co/5Hqj89k7eD New collab with @Jeezy \"The Real MVP (feat. John Legend)\"\nhttps://t.co/3sglJlPdSY My friend and mentor and musical hero @RaphaelSaadiq has a brilliant album out today called #JimmyLee.  Support this man!! RT @AOC: I see Fox News is big mad about abolishing the electoral college.\n\nSo let’s talk about it.\n\n1) If the GOP were the “silent majorit… Thank you @GovPritzker &amp; @ChicagoVotes for reimagining what our criminal justice system looks like and ensuring people in jail have the ability to exercise their right to vote. This should be the standard in every state across America. The mall in Korat combines all the shopping you'd expect plus a little Chuck E Cheese/Dave &amp; Buster's vibe for the kids. Miles approves. @ The Mall Korat https://t.co/wbYHASAUht Meet Keertana Talla. She is the Founder of @lunchcrisisorg, an organization that's erasing student lunch debt, raising awareness about lunch shaming, &amp; bringing change to school lunch system. Learn about her org &amp; donate to @lunchcrisisorg: https://t.co/XowcyqGdQQ #CantJustPreach https://t.co/akSTBewf9W We're in! #BringTheFunny https://t.co/ub48Hx4ihe https://t.co/nQt2Dk34Fa Meet Jason Sole. He is the co-Founder of @HumanizeMyHoodi, a project that helps in de-stigmatizing clothing trends associated with Black and Indigenous People of Color. Learn about his organization and donate to @HumanizeMyHoodi here: https://t.co/elEWI96TjW #CantJustPreach https://t.co/HQ5Dig9A8L Thank you to the @NYTmag, @nhannahjones and all the brilliant writers and thinkers who gave us the powerful 1619 Project, commemorating the 400-year anniversary of the arrival of enslaved Africans in America. https://t.co/4yQF2Mhj8T Let’s #FreetheVote in California! #ACA6 is headed to the Assembly Floor. Call your Assemblymember to ask them to vote YES because #DemocracyNeedsEveryone. ☎️ 916-702-8820 Meet Debs and Josh Walker. They are co-Founders of #7More, a program that gives ex-offenders a fair chance to get back in society by engaging w/ them the moment they get released from jail. Learn about their organization &amp; donate to #7more: https://t.co/rLl3ePUsE0 #CantJustPreach https://t.co/vSC4k0RNq8 @SloaneStephens @chrissyteigen Yes we should! @SloaneStephens Thank you, cousin! (My real last name is Stephens) RT @JohnFugelsang: Imagine being so evil\nit takes your party twenty years\nto catch up to your evil\nbut then you need to stand out\nso its ei… RT @JamilSmith: A reminder: #1619Project is in print today in the Sunday @nytimes. If you do not subscribe, you should do like me this morn… RT @Sifill_LDF: Today. #1619 project. Dig into these superb essays. Learn this history. Share with family and colleagues. We often lament w… @jonlovett Happy birthday, Jon! Meet Mike Williams. He is a Patient Representative in the ER at @HopkinsBayview. He counsels, comforts, &amp; educates both patients &amp; families of the community. Learn about the work The Behavioral Unit at @HopkinsBayview is doing &amp; donate: https://t.co/mdHG1wRysw #CantJustPreach https://t.co/CgV4mqSROQ Meet Tony Foy. He's the Founder of #EducateSavannah, a nonprofit that offers free educational services (tutoring, college planning, resume building, &amp; interview coaching) to the community. Learn about his org &amp; donate to #EducateSavannah: https://t.co/Fs13XDGvWc #CantJustPreach https://t.co/5oHxYlLgo2 @1stRoundBust Congresspeople don't govern their district. They are lawmakers who represent their district to help govern the United States, including how the US government conducts foreign policy. They have every right and responsibility to visit foreign countries to inform their legislation. The President of the United States is joining with a foreign government to punish duly elected representatives of the people to quash their dissent and prevent them from doing their job.  This is shameful on his part and on the part of the Israeli government. https://t.co/nBb3vAdGAx Meet Paige Walden-Johnson. She's the Founder of #CommUNITYarts in STL, an event that raises funds for community programs &amp; awareness to the healing power of the arts - free to those affected by trauma. Learn about her org &amp; donate here: https://t.co/w8QsQlBwpM #CantJustPreach https://t.co/3gT74IjuH0 RT @NBCTheVoice: All is fair in love and #TheVoice. ❤️✌️\n\n@blakeshelton, @gwenstefani, @kellyclarkson, and @johnlegend return September 23.… RT @ShermansShow: SURPRISE! #ShermansShowcase starts now. @MarlonWayans https://t.co/TS5Ru9qzi0 There are rumors that @common and I aren’t actually friends. That we're more like rival siblings, or “frenemies\". We address those rumors TONIGHT on a take-no-prisoners episode of Sherman’s Showcase, 10p EST / 7pm… https://t.co/jC5pGyTtW9 Best in show https://t.co/SsTZlUUS8r Meet @Antwansworld. He is the Founder and President of @caught_up1, a mentorship program for young men in Detroit, MI. Learn about his organization and donate to Caught Up here: https://t.co/MorzIAtSSf https://t.co/tDtqG0Gh9Q Bring Your Miles to Work Day https://t.co/T9Q4VVl5jm Tacos and #BringTheFunny.  Life is good over here. https://t.co/6R1w28kjvi Watch #BringTheFunny tonight!  Wait, what? @chrissyteigen https://t.co/SGAHAijvRL This summer I asked you to nominate change-makers in your community who are practicing what they preach, &amp; I'm excited to share that over the next 8 days I'll be announcing the winners of the #CantJustPreach donations. Please read about these important orgs &amp; donate what you can. https://t.co/Dqqw9vWkJb @YNB thank you, Yvette @summer_galvez @rolandsmartin true RT @politico: Singer and songwriter John Legend visited his home state of Ohio this weekend to play a few songs for Dayton residents still… Another great review of @ShermansShow!  \"Polite Cheetah\" is a new description for me. Perhaps my new rap name, @emilynussbaum ? 😂 https://t.co/8mXyT0vQ3J I sat down with the people of Dayton, OH and I’m inspired by their strength &amp; resilience, but we must take action. Join me, @Everytown &amp; @MomsDemand by calling your senators &amp; demanding they vote on stronger gun safety laws: Text CHECKS to 644-33 or visit https://t.co/57YE9StqMf Thank you, Mayor Whaley, for your leadership and the hospitality you showed me and my team.  You represent Dayton well! https://t.co/t6Sps1I5db I just played a few songs to try to help bring comfort to some of the survivors of last week's tragedy in Dayton.  My heart breaks for everyone who lost someone.  I love how everyone rallies around one another during… https://t.co/MB91chIKqf Today, I visited the Oregon District of Dayton, Ohio, and all stores are open for business. In light of last week's events, it is more important than ever for us to come together to support our local communities. https://t.co/Sj2aQH76sT @Scaramucci @JoeNBC he's been the worst for a long time.  \"Recently\" is doing a lot of work in this tweet This is the sarcastic smile she gives me when she's tired of me asking her to smile https://t.co/c0c3cQ3YA1 LEGENDS - Maybach Music VI: me, @RickRoss &amp; @LilTunechi  https://t.co/QuaBZUmSQK RT @AdamSerwer: “I’m voting for the tax cuts not the racism” isn’t a thing. It’s a package deal. Miles + LOVE https://t.co/udh2kftsMA The bad news? It’s going to take 208 years to achieve gender equality in the U.S. The good news? We can change this. If we act now, we shorten the timeline. #EqualityCantWait https://t.co/i8dMsjRBVf https://t.co/NKa5cAtKJg RT @rgay: RIP Toni Morrison. This is a devastating loss to the world of words, to our understanding of power and it’s reach, to the cultiva… Today is voting day for prosecutorial races in Mississippi. Your vote in local elections matter, so make your voice heard! @TheAtlantic @AdamSerwer That last paragraph. Lawd RT @matthewferner: A new report shows that a decarceral approach to criminal justice, like the one advanced by Chicago's reformer prosecuto… RT @SenMcCollister: The Republican Party is enabling white supremacy in our country.  As a lifelong Republican, it pains me to say this, bu… @marcorubio Do something. @gtconway3d This is exactly true RT @brianklaas: 🇬🇧Pop. 65 million\n🇺🇸Pop. 330 million (5x)\n\n🇬🇧Video game revenues: ≈$5 billion \n🇺🇸Video game revenues: ≈$25 billion (5x)\n\n🇬🇧… RT @shannonrwatts: Every nation is home to people who struggle with addiction and suicidal ideation. Only America gives those people easy a… RT @KyungLahCNN: I lived in Japan for 5 yrs as @CNN’s Tokyo correspondent and covered ZERO mass shooting. ZERO shootings AT ALL. Japan is a… @KellyannePolls Please tell your boss to do something to fix this problem. Denounce white nationalism in no uncertain terms. Take these weapons of war off the streets. @fumblingwomble @realDonaldTrump We don't think you should blame all Muslims just like I didn't blame all white people just now. I blamed a specific leader (the PRESIDENT) whose rhetoric is literally quoted as the inspiration for these terrorists. I said this after New Zealand. Very relevant today. https://t.co/FPiCbedLJt When we condemn the racist venom coming from the President's mouth and point out the bigotry of his policies, it's not an academic question, it's not a political game, it's about life and death. The President regularly inspires killers. He is a part of the problem My heart aches for El Paso and Dayton. Our nation is experiencing these traumas far too often and we need our leaders to take urgent action: take these weapons of war off the street and fight the evil ideology of white nationalism that motivates many of these terrorists. RT @radleybalko: El Paso is the most Latino big city in America, and the one with the largest percentage of immigrants. \n\nLast year, just 2… RT @BernieSanders: Another mass shooting, another horrific day for America.\n\nMultiple news organizations have reported the gunman shared a… RT @PeteButtigieg: Our country is under attack from white nationalist terrorism, inspiring murder on our soil and abetted by weak gun laws.… @MollyJongFast I was told the news was fake. Now it turns out he's outsourced his cabinet secretary vetting operation to this very same fake news media! Did you miss it? DVR and watch the encore presentation of the first two episodes TONIGHT at 10 and 10p Eastern / 7 and 7:30p Pacific on @IFC #shermansshowcase  @common #getliftedfilmco https://t.co/dPWgYYB6lc I want to apologize for calling POTUS a POS this week.  I was mistaken. At least excrement has a useful biological function. https://t.co/SOeYEbqamN @akilahgreen @diallo Thank you!  Can't wait for BLSS! @cbts7791 @maggieNYT He's a textbook racist. I hope you're not. Try not to be one. Malibu w/ my Lu https://t.co/6Ck0jSJNaI @maggieNYT Also because his followers are floating around a comment about drug infestation in B'more made by Rep Cummings.  He figures if he changes it to that, he's magically un-racist! @ap3_trillog ... My one UK show of the year will be at @BluesFestUK in London this October, and tickets are on sale at 9AM this Friday! Get yours here: https://t.co/yIUWbKA6Af https://t.co/nFwdxf15DJ Last night at the shermansshowcase premiere.  Swipe right to see a *still* of me approximately doing the running man https://t.co/pfGPhRDprx RT @IndieWire: #ShermansShowcase Review: IFC’s Unbound Fanboy Costume Party Is a Blast https://t.co/rqpZts2VPz https://t.co/8L0DPw6xDO @carlasosenko @kevinbacon I really need to know the context of this email haha We sang, we saw, I conquered.  Watch the clip! https://t.co/fAdClLiek1 I’ve been a fan of this program for 40 years. #ShermansShowcase premieres tonight at 10P on @IFC. https://t.co/nHUl1p3iYg RT @DrIbram: I wish every Democrat and Independent voter would think deeply about something Sen. Warren said last night during the #DemDeba… @TheFilharmonic @latelateshow Y'all sounded great!  Thank you,! Watch this tonight too!  James and I had an epic battle and at least one of us survived. https://t.co/avT90fhDh9 @mschlapp I can't respect anyone that uses Democrat as an adjective. So childish and unnecessary. Watch my baby tonight!! https://t.co/ZgZj2vqPzT RT @Sifill_LDF: This is good and necessary. Well done, ⁦@baltimoresun⁩  https://t.co/x2WFigk0qi @jelani9 bars RT @_AlexHirsch: ”LOL your city is poor? I lived in a gold house with my name on it and cheated on my model wife with my model mistress! Yo… Thank you for fighting for these families, Congressman @tedlieu.  These actions by the US government are causing permanent harm to these children and it's indefensible. https://t.co/hoTr5e5Ft8 Sunday morning jam session https://t.co/nIrtl2rVT7 @dannygore15 I started paying attention to NFL football right around the 85 bears' super bowl win, so I missed the core of Payton's career. RT @PatrickClaybon: The Baltimore discussion this week reminded me of this part of Richard Rothstein’s “Color of Law” (at your local librar… @MeetThePress @SenRickScott Wow. You guys are still doing \"racially charged\"?  Stop doing that Still the most exciting player I've watched play football. https://t.co/nc3N8TaqEw @TheRickWilson When did we start calling trios choirs? RT @yashar: Drop everything you're doing and watch this....\n\ncc: @VictorBlackwell https://t.co/N9ZWttHSzd .@OwensforDa is running for DA in Hinds County, Mississippi. He is a candidate who wants to improve our criminal justice system. We can establish fair and just practices in our communities when we elect local officials dedicated to reform. Learn more: https://t.co/29rfqbYP7M https://t.co/9kXBz62deC @juneo473 @HrhOrchid @duxcomedy @anniemarie_24 @SpeakerPelosi @realDonaldTrump Haha. Impeach President Hillary too?  You guys are obsessed with her. She's been accused of nothing by law enforcement. She's living her life. And you're still fighting 2016 battles. @juneo473 @HrhOrchid @duxcomedy @anniemarie_24 @SpeakerPelosi @realDonaldTrump Obstruction of justice, perjury, abuse of power, emoluments, coordinating with a foreign adversary to undermine our elections.  Shall I continue? @tedlieu @HouseJudiciary Impeach him @SpeakerPelosi @realDonaldTrump Impeach him Last night we played with a full orchestra at the 3000-year-old Greek theater in Taormina, Sicily.  Such a magical experience!  Thank you, Taormina! https://t.co/EIG6cYHBp5 This @chancetherapper collab is 🔥🔥🔥🔥🔥!!!!!  Play it all day long https://t.co/hKJ1v1uDj3 RT @FullFrontalSamB: Who can forget the Democratic Party’s slogan? https://t.co/egLGN4QIDy @LauraIvorySaund All the above!  I have a band and orchestra tonight.  Starlite asked for the intimate solo show.  I love doing that so I said yes! Thank you so much!  What a beautiful night! https://t.co/KvAMsmRK0G I had such a wonderful night in Marbella!  Muchas gracias to everyone who came to see me at #Starlite!! https://t.co/MelcukV7rp RT @YAppelbaum: To argue—like Speaker Pelosi—that one first needs to assemble all possible facts before proceeding, is to profoundly misund… RT @MrGeorgeWallace: Yo' momma's so stupid she thinks an innocent man would falsify records, try to fire investigators, dangle pardons and… RT @RepAdamSchiff: Mueller's report tells the story of Russia's sweeping and systematic attack on our democracy.\n\nIt’s the story of a Trump… RT @chrislhayes: The GOP threatened to precipitate a global financial crisis that would have more or less been unprecedented in order to im… RT @IlhanMN: Threatening to rip children away from their parents over school debt is unacceptable. https://t.co/le8PFvfGUB Thank you @mtv @vmas for the nominations for \"Preach\" (Best Video for Good) and \"Higher\" (Best Hip Hop Video)!!! @djkhaled @NipseyHussle Miles-stone! https://t.co/DjWnTJICBj @ChelseaClinton Congratulations!!! RT @prisonculture: Schools are the perfect sites to feed all children who attend them three meals a day and a nutritious snack. Then buildi… RT @BernieSanders: What if maybe—just maybe—in the wealthiest country on Earth we provided year-round, free universal school meals to all o… @Liz_Wheeler @BernieSanders What if.... everyone's vote in every part of the country counted equally?????? @RandPaul Serious question: how do you decide which items need to be offset?   Wars? tax cuts for the rich? All kinds of other spending? RT @thauserkstp: Congresswoman Omar just arrived back in the Twin Cities. https://t.co/ZiFqWnDJgQ \"If multiracial democracy cannot be defended in America, it will not be defended elsewhere. What Americans do now, in the face of this, will define us forever.\" https://t.co/5KUYnxJHpA In one week I'll be playing at Taormina4Ever in Sicily, Italy! Do you have your tickets yet? https://t.co/vMWeShCe4K https://t.co/fPbbZLQxaT RT @Ilhan: “The function, the very serious function of racism is distraction. It keeps you from doing your work.\" -Toni Morrison\n\nI am not… Excited to announce @newprofit &amp; @LetsFreeAmerica have opened the application for the second #UnlockedFutures cohort. Do you know an entrepreneur working to break barriers in criminal justice? Let them know they can apply until August 9th by visiting: https://t.co/ycz8sg8lj6 https://t.co/DHfTzKLGUL RT @chrissyteigen: hello east coast!!! if I'm doing my math correctly, #BRINGTHEFUNNY is on right now!!! I am on the west coast but I'll tr… RT @AOC: Donald Trump has decided he does not want to be President of the United States.\n\nHe does not want to be a President to those who d… My baby's on tonight.  Make sure you're watching @bringthefunny at 10/9c! https://t.co/67YHjzABsP Congratulations to our fantastic producers on another Emmy-nominated season! https://t.co/JQyxzLSJxP https://t.co/UEo349oIAf @dreamhampton Yeah! Had a beautiful time in Montauk this weekend!  Lots of love and music and lve_wines, and apparently my go-to pose was smile and hold jacket button.  Styled by the great @davethomasstyle https://t.co/sHVjomLQn9 RT @AOC: Until Republican officials denounce yesterday’s explicitly racist statements (which should be easy!), we sadly have no choice but… RT @ava: Saluting these women. Stay pushing. Stay shining. Stay working. Stay a pain in the ass of the #RacistInChief and all his co-horts.… RT @RubenGallego: Growing up I used to hear “go back to Mexico” from many kids, though I was born in the USA. I thought then that it was ju… Read the brilliant @nhannahjones on the history of school desegregation and resegregation in America.  https://t.co/as2TdvtRGp @SpeakerPelosi @realDonaldTrump Impeach him RT @versharma: Anyone with nonwhite skin born in America has been told to ‘go back to your country’ more times than we can count. Now we ha… RT @RaviReports: A power outage in New York, but it couldn’t stop the Millennial Choirs and Orchestras, creating a makeshift stage right ou… Meet me at @BevMo in West Hollywood tonight from 5:30-7:30, I'll have signed @LVE_wines bottles! https://t.co/1fhZL9Fr1y Sketch comedy that you can dance to. #ShermanShowcase premieres July 31st at 10P on @IFC. https://t.co/Fr7iirGY20 Thanks for having me! https://t.co/qgcBZsaX7e @couldvebeencth @BevMo @LVE_wines The event is tomorrow! @chrissyteigen 😜😍😎 @ItsMattRife @bringthefunny Yessir! @bringthefunny Delete your account! Good luck Chrissy!! @bringthefunny premieres after @agt TONIGHT 10/9c on @nbc. https://t.co/9PG5vEAwR7 @SecretaryAcosta Why did you hide the non prosecution agreement from his victims for a year? RT @MarkWarner: REMINDER: in under 24 hours, the Trump Administration will head to court to overturn the Affordable Care Act and\n \n❌  Strik… Y'all. The President is likely one of the male characters in Taken not played by Liam Neeson https://t.co/ZQCeZOHuVT Infuriating article:  \"Digital Jail: How Electronic Monitoring Drives Defendants Into Debt\" https://t.co/M3Slz5fU52 CONGRATULATIONS TO THE USWNT!!! 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 RT @PadmaLakshmi: “I’ve known Jeff [Epstein] for 15 years. Terrific guy. He’s a lot of fun to be with. It’s even said that he likes beautif… Everyone thinks Biden will win back the elusive factory worker in Pittsburgh or Youngstown.  But there is literally no constituency in those places for \"nothing will fundamentally change\" and nominate Merrick to the supremes. @Holly_A_K So we defeat what we criticize. We should nominate someone qualified and principled who isn't a rapist. But he/she should be young enough to be on the court for another 30+ years. @Holly_A_K We can't keep starting our negotiation from the middle. It is a recipe for failure @Holly_A_K He's too old. We need a progressive in their 40's or early 50's to counteract Alito, Kavanaugh, Roberts... Republicans play to win.  Biden plays to impress a panel on Meet the Press and Morning Joe https://t.co/pT15kDxWqx Great piece by @Sifill_LDF.  For decades, the @NAACP_LDF has been at the forefront of fighting to desegregate our public schools https://t.co/59LE5NNpV7 RT @deanspade: One of the most succinct and perfect critiques of \"civility\" discourse I've seen. Thank you @TheOnion! https://t.co/xONFuwjd… 😍🍦😎 @ Portovenere https://t.co/pmtbofIkUL RT @RevDrBarber: Tonight I am announcing we have accepted an invitation from multifaith leaders in Texas to go to the U.S./Mexico border in… It's afternoon here. lve_wines https://t.co/5JuLBMLwBM RT @JKCorden: Things we do on set @johnlegend.\nFull #OhPITERA MV here - https://t.co/qt4tsyobRy\n \n@SKII_US #skiipartner https://t.co/B0aQot… Happiness = Luna eating leftover pizza on the Mediterranean https://t.co/OC8a411iSz My happy boy in Portofino https://t.co/feyuvolOsf @JamesSurowiecki So you're saying Western liberalism has been dead all along RT @nhannahjones: If you really want to understand both the benefits of desegregation and the consequences of our decision to walk away, 5… I've always admired #NinaSimone’s commitment to social justice and the way she used her commanding voice to promote equality. Join me in preserving her legacy by contributing to @SavingPlaces to protect her childhood home. https://t.co/r7rnaToxiG https://t.co/nLIydNZJL8 Interesting article for context around the Harris/Biden discussion about busing and school desegregation.  65 years since Brown v Board of Ed, America's schools are as segregated as they've ever been. https://t.co/QJ9RM6DRYB @drboycewatkins1 I still am trying to figure out who gave you a doctorate. Vacation 😎😍 https://t.co/6RVvU2mIBE RT @AndrewGillum: I’m not calling DeSantis a racist, but his poll tax sure is...\n\nWe will fight this every step of the way. \n\nhttps://t.co/… RT @samswey: This may be the largest poll tax ever signed into law in America, in terms of the number of people disenfranchised by the act… RT @danpfeiffer: Republicans hate democracy https://t.co/K4aFlqHFcB RT @ClintSmithIII: BUILD A GOLDEN STATUE TO MEGAN RAPINOE AND PUT IT IN FRONT OF THE WHITE HOUSE YOU FOOLS @adamjohnsonNYC @AndyRichter We just beat Romney when all of them likely voted for him. We good Always a pleasure to chat with @katiecouric, especially when it’s about my favorite topic: my family. https://t.co/qh2KCZzRgj Congratulations to my friend @MLTJohnRice on 15 years of @MLTOrg!  I wish I could be there to celebrate with you!  I remember the good old days when I was a @BCG consultant helping you refine your strategy.  It's been amazing to see how many lives you've impacted since then. Sounds like a good plan for the evening! https://t.co/dUUqEwK6Iu Preach https://t.co/dPxey7V5X0 Today is voting day for prosecutorial races taking place across New York. Your vote in local elections matter, so make your voice heard! @mindykaling Happy Birthday, Mindy! RT @fingerbIaster: \"No offense but you're not the type I'd rape tbth\"\n-the president I really enjoyed tonight at the #BETAwards2019!  Thank you, BET!  So honored to perform Higher for Nipsey.  And thrilled to be in the presence of Queen @maryjblige!!  That parade of hits made me so happy!  The entire crowd knew every single word and sang at the top of our lungs! RT @common: \"Children as young as 7 and 8, many of them wearing clothes caked with snot and tears, are caring for infants they’ve just met.… My photo is thrilled to be at #BETAwards2019 rehearsal! https://t.co/PhyS898nuh New collab en español! @flordetoloache X @johnlegend https://t.co/rjqol6q6fP RT @theintercept: “He should apologize to the children that have been separated from their parents,” said Rep. @AOC of GOP leader Kevin McC… RT @CoryBooker: I'll be blunt. No matter who wins, even if it isn't me, people unjustly incarcerated must be liberated—and I need everyone… On June 25, New Yorkers will have the opportunity to vote for new district attorneys, who directly influence criminal justice in our communities. I’ve been following the Queens race and @nytimes just endorsed @CabanForQueens Who will you be voting for? https://t.co/s3VfbVlll8 Italy! I'm coming to Taormina this July for Taormina4Ever and tickets are available now! Get yours here: https://t.co/vMWeShkCGa https://t.co/4oAAPQdqrR RT @CoryBooker: Right now, there are thousands of people sitting in prison serving excessive sentences.\n\nToday I’m announcing that as presi… RT @jonfavs: Joe is correct here that FDR worked with segregationists to pass The New Deal and Social Security. That’s why those programs i… @HeatherPaige76 @Toure Ask Chicagoans about redlining @Toure And imagine a nation saying it doesn't have to pay its debts if all the senators who enacted the laws incurring the debt aren't alive anymore. Or a corporation that didn't pay its bills if their ceo passed away.  Or an heir keeping the house but refusing to pay the mortgage. Brought the lve_wines rosé back to its native land in the South of France #canneslions2019 https://t.co/FWBSOfMroP RT @ABC: Ta-Nehisi Coates criticizes Mitch McConnell over his comments on reparations: \"For a century after the Civil War black people were… RT @mayawiley: This #Juneteenth I recommend reeading or re-reading: \"The Case for Reparations\" by @tanehisicoates https://t.co/xjDnCHeHPt RT @landrist: I did my dissertation on #ConcentrationCamps, so I have a few thoughts about @AOC's use of the term to describe the build up… RT @chrislhayes: Yesterday the president vowed to round up 11 million people and today his supporters are marching through the streets thro… RT @sethdmichaels: if \"never again\" means anything, it means \"when one's own government declares a set of people a plague of undesirables a… Inspired by opening night at the @HollywoodBowl this past weekend - new LOVE t-shirts! They’ll be available all summer at my shows and online in my merch store: https://t.co/1RFd6AAce6 https://t.co/8AVYYbqYoK Backstage at opening night at the @hollywoodbowl.  Tonight was magical!! Thanks to everyone who came out!! @ Hollywood Bowl https://t.co/D0eDExInf8 Excited to see that @LVE_Wines is in so many more stores this year! You can find the Rosé just in time for summer at @Pavilions, @Vons, @Safeway, and @BevMo - and if it’s not on the shelves, ask for it! https://t.co/qKdYBCC1MF RT @RepAndyLevin: When I became a member of the 116th Congress, I took an oath to protect and defend the Constitution of the United States.… My management just got a few of these made for me. Does this mean we get mics next season too?  #TrailerTalk https://t.co/cULWJq7kIP @SpeakerPelosi @realDonaldTrump Please start impeachment hearings .@Pampers has committed to installing 5000 @KoalaKare changing stations in public restrooms, but we want more. For every person who posts a special moment w/ their kids using #LoveTheChange, Pampers will contribute toward installation of additional changing tables #PampersPartner https://t.co/G2Ew4YNtFz RT @robreiner: Everything we’ve always known about Donald Trump has been in plain sight. He’s a racist, a misogynist, a pathological liar,… @DukeEllingtonDC @nabtweets They were fantastic!  Thank you! @chrissyteigen Stunning @gracekellymusic You were fantastic!  Thank you! Today is a big day for prosecutorial races taking place throughout Virginia. Your vote in local elections matters! Good luck, @parisa4justice! Most dads have been there: you’re out with your kids &amp; there's no place to change their diaper. In honor of Father’s Day, @Pampers is providing 5,000 @KoalaKare changing tables in public restrooms. Finally, no more diaper duty on your lap! #LoveTheChange #PampersPartner https://t.co/1dBR2KwnBw Date night.  ❤️🇮🇹❤️🇮🇹❤️ https://t.co/O0pmBkeX0M Final lve_wines pairing for #NationalRoséDay: this rosé ysl jacket for date night https://t.co/b8CrketZ57 New comedy coming this summer!!!  @ShermansShow https://t.co/Uj5HSHXiIr @ItsRoohaHaghar Thank you for being brave RT @deray: Hugh Culverhouse: I gave the University of Alabama $26.5 million. I spoke out about abortion. They gave it back. https://t.co/zk… RT @SarahKSilverman: 4 minute abortion bit in 2 parts: https://t.co/4fyviih8hs La vita è bella https://t.co/jSJvPbLJqI The lve_wines rosé met us in Tuscany 🤷🏾‍♂️ https://t.co/apiXiV7deB cute and beautiful (L to R) https://t.co/YVfex6Vicu @JamesSurowiecki @EricLevitz @willwilkinson Bernie was more successful at running for Dem nomination in 2016 than Biden was in his two previous attempts. Both have won small state US Senate races multiple times.  VP doesn't count because no one was voting for Biden. They were voting for Obama. This is awful.  Watch or listen to Rachel  @maddow segment on this from last night.  The state needs to stay out of women's bodies. https://t.co/2UgiYfmYZz In hot pursuit of the mysterious black truffle https://t.co/BMwzUlUs7f @JamesWorthy42 @LATACO @chrissyteigen Of course, sir! Mini civics lesson that may come in handy in the near future https://t.co/pe223dtA8a Under the Tuscan son https://t.co/X7DTh3Bwaa My little angel (most of the time) https://t.co/ElHhgkPQei Thank you to @ava and her incredible team for making #WhenTheySeeUs.  Beautiful, powerful, necessary filmmaking.  America's so-called justice system continues to wreak havoc in black and brown communities.  That story could happen again today. We need dramatic change. Johana Medina Leon's death in ICE custody symbolizes injustices occurring against innocent people seeking refuge at our borders. Grassroots changemakers like @muxerisa of @ConMijente who was featured in #CantJustPreach, are demanding action. Learn more: https://t.co/U3YnRtYLxl RT @SenKamalaHarris: This is child abuse being committed by the United States government.\n\nEveryone should be outraged that this is happeni… Virginia, there are a lot of prosecutorial candidates on your primary ballot on June 11. Your vote in local elections can make a huge impact in determining the future of criminal justice in your communities. Learn more here: https://t.co/HYhFtpG8CM RT @ConnieSchultz: This thread. She is fine, but we as a country are not. https://t.co/0qJFKZeTlE Unconscionable treatment from our government.  Shame on all who are involved. https://t.co/kmA0cyz0Fd RT @birbigs: This video makes me so happy. Thanks to everyone whop supported this!  #DaytonDonations \n\ncc: @Lin_Manuel @jimmykimmel @mollym… My ❤️ https://t.co/gjOfGK8t92 @lang_lang Congratulations!!! RT @samswey: Today we launch the Police Scorecard to evaluate the police in California based on an unprecedented amount of data on police u… @andyroddick Important question: do you have a record player? Luna's in Paris https://t.co/JYQZ0vBkMg RT @cmclymer: Tomorrow is the start of Pride Month. This tweet by @realdonaldtrump is cynical propaganda. Since day one, this White House h… RT @FullFrontalSamB: Start by letting transgender people in the military 🌈 https://t.co/nxRWuZo8CC Our @LVE_wines rosé is back just in time for summer!  https://t.co/w8oIioQNam @DjangoHoorides @HeerJeet I said she's slanted in the things she chooses to discuss.  And you can tell she has preferred outcomes that are to the left.  But the content of the show is mostly reporting facts and getting subject matter experts (often former prosecutors or historians) to explain @HeerJeet Morning Joe is \"centrist\" but almost all opinion-based punditry. @HeerJeet Maddow almost never actually does opionated punditry.  She obviously has a slant in the news and history she highlights, but the show is heavily focused on factual reporting and relying on subject matter experts to contextualize and clarify. Donating to the Food Bank and a few other organizations helping to support my home state in the aftermath of the tornadoes. Please join me if you can! https://t.co/35IxdZv7hw Name that tune.  (Fun fact, this song is exactly 15 years old this month!) https://t.co/VDBoN93KlT @danpfeiffer Thanks!  This is great RT @staceyabrams: We must fight for a fair election system, but democracy also requires true engagement. Yet here’s further proof that some… Great news coming from Atlanta! Thank you, Mayor @keishabottoms, and all the advocates on the ground for your relentless commitment to criminal justice reform and community-building. https://t.co/aYqX7vXELT RT @nowthisnews: Exclusive: Robert De Niro, 1,000+ former federal prosecutors, and 448 pages all point to the conclusion that Donald Trump… @RepJerryNadler Impeach him @RepRoKhanna Impeach him @CliftonKinnie @HowardU Yessir!  Congratulations! RT @shanemcanally: I'm completely overwhelmed with all the love last night...so, this song is even more appropriate than ever. Thank you @j… @nycsouthpaw @owillis I'm going to say you must be doing something right if you're actually doing something right. Catch @NBCSongland TONIGHT 10/9c on @nbc #Songland https://t.co/vz65Hqg06k @nytimes Delete your account Thank you, Aruba!  We had so much fun tonight!! https://t.co/sCxMUb9JJM Powerful essay by Michelle Alexander (@TheNewJimCrow) on the importance of the right to choose: \"My Rapist Apologized:  I Still Had An Abortion\" https://t.co/2P3Y5h9o21 Sip Rosé This Memorial Day Weekend With John Legend and LVE Wines https://t.co/HdsPHhvSOW via @ESSENCE We'll miss you, brother https://t.co/woIegAzboM I like what I’m hearing, @parisa4justice. Good luck! https://t.co/3z4ZryE86N @RepAdamSchiff Impeach him Impeaching Trump Is Risky. So Is Refusing To. https://t.co/zmmk5YEbN3 RT @RedNoseDayUSA: .@johnlegend is giving us ALLLL the feels right now. Tune in to @nbc and donate now at https://t.co/16zCJnhxZR. #RedNose… @GAYDANIELSONMOR @ArianaGrande all the time. perhaps that's why she thought to compare us, hahaha Luna's QOTD: \"@ArianaGrande is a great singer, Dad.  You are not a great singer.\" 👀 It's time for California to reform its voting rights practices. I'm joining @AllofUsorNone to urge state officials to pass ACA 6, which would restore the right to vote for nearly 50,000 individuals who are on parole and have served their prison sentences. https://t.co/fuwYcc4n8P #TeamLegend for the win! Thank you @MaelynMusic for choosing me as your coach!  It has been such a joy working with you. Thanks to everyone who voted for her, streamed her music and supported us in any way!  We… https://t.co/TWPoQom05F Mood https://t.co/MofxIntjFK So happy for @MaelynMusic!  She is the Voice!!! Thanks to everyone who voted for her!!! https://t.co/XwTK8cWWli sadly, this is probably the case.  when you want to prove government is not the answer, you do your best to make sure government is expressly terrible at providing services to people who need it. https://t.co/FtmqXywNQ6 honest question.  why does he want this job?  he'd make more money speaking for conservative groups.  he clearly has zero interest in doing the job well.  just resign, Dr. Carson. https://t.co/jKdEfiREi2 don't play with my emotions, social media team https://t.co/WOmmmq0EDd 😂😂😂😂😂 https://t.co/Gdk0H6D0G4 Miles update. Does this mean I have to pose for another one? https://t.co/mHGxHgQwxq #StopTheBans https://t.co/vhljbmj0ra My wife is always right. https://t.co/B0XUbW6Yuh Mom, Aunt Benita and Pepper were very excited to hang with @blakeshelton at nbcthevoice tonight.  I downloaded the voice app on their phones and forbade them voting for him though! https://t.co/dZ4n4kfuRM Look at the iTunes charts!  3 songs in the top 10 for @MaelynMusic!  Stream her on @applemusic and make sure you vote too!  (btw, streaming\"Unforgettable\" doesn't count toward her votes but the other 2 songs do) https://t.co/M1Xo6RWPRZ 👑👑👑👑👑👑 https://t.co/l7U173uyPD Wow.  Wow.  Wow.  @MaelynMusic was perfect tonight. She is the Voice.  Please vote for her.  She couldn't be more deserving. RT @NBCTheVoice: We tried to think of words to describe this performance from @MaelynMusic and @JohnLegend but the best was simply, “Unforg… I will be performing a classic duet with @MaelynMusic tonight on @NBCTheVoice!  \"Unforgettable\" a la Nat and Natalie Cole. You can stream it now! Stream that and all of Maelyn's solo songs too and help her win the Voice!  https://t.co/5GVIgJdqNx So excited for tonight's episode of nbcthevoice!!!  @maelynmusic is ready to give the performances of her life.  Make sure you're ready to vote and bring home the trophy for #TeamLegend!! https://t.co/3hHGpzDlle PA, there are a lot of prosecutorial candidates on the ballot May 21. I’ll be watching what happens in Allegheny County. Your vote in local elections can make a huge impact in determining the future of criminal justice in your communities. Learn more: https://t.co/iSm1ys4oq4 @_falvo When you encourage law enforcement to go after your opponents on Twitter, it's an abuse of power.  When you threaten or shame witnesses who could speak the truth against you, it's obstruction. The Democrats in the House need to do their job and impeach him. Stand up for what is right and don't worry about the polls. Don't worry about Mitch McConnell.  Make every senator go on record to say if they think what the President did is ok The case for impeachment is obvious to anyone who actually has paid attention to what Trump has done. He obstructs justice and abuses power on Twitter everyday. Does he have to shoot someone on 5th avenue? https://t.co/75q9tY8K8y RT @nbcsnl: Thank you Paul Rudd, @ABFalecbaldwin, Robert De Niro, @RaleighRitchie, @djkhaled, @LilTunechi, @JBALVIN, @MeekMill, @sza, @john… Just posted a photo https://t.co/DN6cwBtXuy RT @staceyabrams: Please join @SenGillibrand, @KamalaHarris, @amyklobuchar, @ewarren and me in supporting organizations that protect the ri… RT @JoyceWhiteVance: Ending the week on this note: Trump heads a party more outraged by rape &amp; incest victims who seek abortions than it is… @ashoncrawley Chef Boyarditos Thank you, @BET! https://t.co/Dqpo8m1v28 Flashback to 1999.  Shout out to all my classmates from @Penn celebrating our 20th reunion in Philly tonight!  #fbf https://t.co/4bYPqtRlmi RT @nhannahjones: 65 years ago today, the nation’s highest court issued a radical decision when it unanimously struck down legal apartheid… RT @HRC: BREAKING: The House of Representatives has passed the historic #EqualityAct.\n\nIt’s the first time a chamber of Congress has approv… RT @nbcsnl: SEASON FINALE\n\n@djkhaled \n@LilTunechi @JBALVIN \n@MeekMill @sza \n@johnlegend @BigSean \n@Jeremih @lilbaby4PF https://t.co/NiOqEnN… 65 years have passed since Brown v. Board of Education, but the schools in our country are still far from equal. I support @integratenyc's efforts to demand racial and cultural integration, and #RetireSegregation once and for all. Sign the constitution: https://t.co/lxNOtjwiGU https://t.co/A6te15P0py Higher - djkhaled X @johnlegend X @nipseyhussle.  Video at midnight ET. https://t.co/6ElkbozXe2 RT @djkhaled: The Marathon Continues!  #HIGHER the video feat. @NipseyHussle and @johnlegend tonight midnight EST / 9 PM PST! \n\nLong Live N… Our beautiful boy is 1 year old today!  We love you, Miles! https://t.co/CCWY7ZYoyv Teachers make a huge impact in the course of our lives. As part of the #ISeeMe project, @DonorsChoose is ensuring students of color see themselves in their educators with resources and career development. Join me by donating to education in your community: https://t.co/DxnSEBett7 Proud to be a part of this inspiring record with  djkhaled and @nipseyhussle.  We lost him too soon. The proceeds will go to his loved ones https://t.co/dEZnoIrrSn Burdensome court fees only punish the poor and perpetuate the cycle of poverty. California should end them now with #SB144, @Portantino. #FamiliesOverFees @HeerJeet 19. And I'm not proud of this. RT @chrissyteigen: NEW NEWWWWWWW!!!! https://t.co/8sMRSYJDdM RT @MaelynMusic: WHAT??!! I can’t BELIEVE I’m going to the FINALE!!! I’m beyond grateful for all of your support. I would NOT have made it… Let's go!  #VoiceSaveShawn #VoiceSaveShawn #VoiceSaveShawn #VoiceSaveShawn He really is phenomenal! I feel so blessed to work with him. Retweet to #VoiceSaveShawn Soooooo happy that @MaelynMusic  has made it to the finale!  She's been consistently amazing!  Let's hope we get a chance to #VoiceSaveShawn!  I'm gonna need y'all to tweet for him tonight.  He's so incredible! These statehouses are waging all-out war on women and their right to control their reproductive decisions. This is awful. https://t.co/noOY2pEsqX @itsjulianking Lovely! Happy birthday to my big bro @RaphaelSaadiq!  I love making music with this man. He's been giving us soul music classics for like 3 decades and deserves to be celebrated even more than he already is. Shawn is incredible!  Giving powerful performances every week!  Vote for him tonight!  Let's get him to the finale! https://t.co/tLqpqUN8Cx Yes, Maelyn!!!! Everyone vote tonight!! https://t.co/wYLCZw4CU1 Vote #TeamLegend tonight!  Both Maelyn and Shawn are amazing and deserve to be in the finale! Top 8 tonight at 8! @NBCTheVoice #TheVoice https://t.co/Zo8GNodit0 Happy Mother's Day to my Queen!  Luna, Miles and I love you so much and we're so grateful for you everyday!\n\nThank you @yutsai for these beautiful prints! https://t.co/XdvS4puUlP We back. Season 17 https://t.co/uBvZVIoRpa @KimKardashian Congratulations!!!👶🏽👶🏽👶🏽 RT @Sifill_LDF: If you spent one moment enjoying the news of Meghan Markle giving birth then I challenge you to read this. And don’t say “t… RT @ChrisMurphyCT: These kids weren’t shot. They won’t become part of the grim statistics of gun murders. But the trauma from what they saw… Luna carefully scrutinizing tonight's performances 👀 https://t.co/t2jtkau02r Look who I ran into on the Universal lot today!  #LegendxBTS @bts_bighit https://t.co/DUhE5OnNnH Who are you going to save?  My vote is for #VoiceSaveMari Go to my IGTV to see the Trailer Talk you’ve all been waiting for. https://t.co/GNUrtgr3gk RT @Sifill_LDF: Pretty compelling thread. https://t.co/G2EZ0EEL4Q Maelyn is so gifted!  So happy to be her coach!  Vote for Maelyn!  #TeamLegend https://t.co/qCzuACsDx0 Celia stuck the landing! #TeamLegend https://t.co/dDG4CbhzMt Shawn was amazing!  Vote for him! #TeamLegend https://t.co/Bed1TVWgXV @AnikaNoniRose Congratulations!! RT @NBCTheVoice: . @JohnLegend is taking requests for Trailer Talk!\n\nWhat song would you like to hear him sing? 😍 https://t.co/9JAFKSfGoP I'm proud to announce the 2019 LRNG Innovators Challenge winners! With support from @writingproject &amp; @showmecampaign, these 10 educators will create innovative ways to inspire young people. Learn how these teachers plan to #redesignLRNG: https://t.co/lt6GyV914d https://t.co/0UxZMNabtl @jduffyrice Sounds like a combined gift to me. Lucky Zak! @LeilaniMunter @chrissyteigen @OP_Society The protestor was clueless and extremely unhinged. @iamtikasumpter Yeah Tika! RT @AriBerman: Breaking: Florida senate passes bill requiring those with past felony convictions to pay all restitution, fines &amp; fees befor… RT @soledadobrien: One of my favorite @LindseyGrahamSC tweets from the past. https://t.co/twG9uLKRzf My academic career at UPenn hugely shaped the person I am today. I'm proud to join @MichelleObama today for #CollegeSigningDay to welcome the Class of 2023, and celebrate all students taking their next steps towards their futures! #BetterMakeRoom https://t.co/RnkNNGQ0Gk https://t.co/FPmCtXhlOZ So proud of all of #TeamLegend! @jacobdmaxwell, @lisarameymusic, and @jimmymowery - I LOVED working with you and I look forward to seeing and hearing all that you will accomplish in the future! #TheVoice https://t.co/2d8Pkfvx6J Tonight’s guest on episode two of Trailer Talk is my “Duets” co-star turned #TheVoice co-star, @kelly_clarkson! \nHope you’re tuned in now to #VoiceResults on @nbc to see us on a show that… https://t.co/QzVoWihtel hint:  it won't be black or white. https://t.co/PdhXLztEUU @matthewjsings You were excellent, Matthew! I was so PROUD of #TeamLegend tonight!  They gave you their best!  Please vote for them and stream their songs on @applemusic to help them make it to next week!! #VoiceTop24 https://t.co/9MZtupxf9b I LOVE #TeamLegend!!!  They all gave you their best tonight!!! #VoiceTop24 We're live in a couple minutes!  Watch @NBCTheVoice tonight at 8/7c!    And vote for #TeamLegend!!! I want to know who is inspiring to YOU. Nominate changemakers in your community who are practicing what they preach for an opportunity to be recognized on my platform and receive a donation to their organization (or organization of choice)! #CantJustPreach https://t.co/pH5IfXcT6l https://t.co/Bs2suWhzRi So proud of the wonderful artists on #TeamLegend!  Watch them perform in the Top 24 on nbcthevoice Monday then help us bring home the trophy by voting #TeamLegend! https://t.co/Rbc04F4bA5 RT @ryangrim: Ya know, if a country has so many people in prison that allowing them to vote could swing an election, maybe there are too ma… @itsjulianking I'm so happy I got to work with you, Julian.  You're a gifted artist. @salamishah @highlinenyc Dope!!! Multitasking on the set of #TheVoice with my new online show, Trailer Talk! My very first guest moonlights as an Easter Bunny historian - @BlakeShelton! Let me know who you'd like to see… https://t.co/0M8JUVrZrn Ok, I'm a day late for Earth Day, but it's not too late to do something to save our planet!  Watch this and support the cause! https://t.co/KAMem9FTNq Listen to some voices I love on my exclusive @NBCTheVoice playlist, only on @AppleMusic: https://t.co/IkncFmouER https://t.co/aHn7lSi1A3 Watch the #VoiceCrossBattles tonight!  Live at 8/7c on @NBCTheVoice.  Then vote for #TeamLegend (only if we deserve it, of course!) .@SenGianaris and I wrote an op-ed about the impact of bail on our communities. Recently, @GovCuomo announced a budget deal to reform New York's bail system. Learn how progressive leaders across the country are advocating to end cash bail once and for all: https://t.co/vMsCeTgonA Easter Sonday https://t.co/Ir2ROqLX8A I'll be performing at MOTOWN 60: A GRAMMY Celebration, so make sure you're tuned in tonight at 8e/7c on @CBS! https://t.co/18fH8NYugO 100% of the proceeds from the #CantJustPreach shirt go to the @SocialImpctFund, a non-profit org. supporting causes I care about - equity in education, criminal justice reform &amp; more that guarantee all people have an opportunity to thrive. Get yours here: https://t.co/ascIVOkNiK https://t.co/697D63OeJF @SpeakerPelosi It's time to start impeachment proceedings, Madame Speaker. We can't let the bar for presidential conduct go this low. @itsjulianking yessir! @kendrachecketts Thanks so much, Kendra! RT @MichaelSkolnik: Not enough just to talk about, we gotta be about it. \n\nProud to support one of the realest, my brother @JohnLegend and… Got to sing Everything with @ellamai tonight for the first time LIVE! https://t.co/cb4c6lIV6D @Sifill_LDF Welcome!  You had my enthusiastic vote, of course! @MarcelloKline @DriesVanNoten on the left.  @PaulSmithDesign on the right. @JacobDMaxwell @NBCTheVoice So happy you could join us on stage!  Monday will be amazing!  Can't wait! RT @AOC: Climate change is here + we’ve got a deadline: 12 years left to cut emissions in half.\n\nA #GreenNewDeal is our plan for a world an… @ava I love this. @itsjulianking Thank you, brother!  Excited for Monday!!! @betsyademusic @NBCTheVoice @adamlevine @kellyclarkson @blakeshelton @MaelynMusic @rodstokesmusic Thank you for joining me on stage!  So happy you're continuing to grace our show with your presence! Thank you for all your hard work and inspiration, Desmond!!  Well-deserved recognition! https://t.co/qcKm0YZym1 RT @Ms_EagleHeart: It’s not enough to just talk about it or tweet about it—you have to go out and do something. Joining forces with @johnle… RT @JasonWGeorge: It’s not enough to just talk about it or tweet about it, you have to go out and do something. Join me in supporting @john… RT @YNB: It’s not enough to just talk about it or tweet about it, WE have to go out and DO something about it. \n\nPlease join me in supporti… @JessicaGooding9 Happy birthday to your sister!! You've heard the stories from some of the people who inspire me, and now I want to know who is inspiring YOU. Nominate changemakers in your community, donate to the causes in the #CantJustPreach series, and get your own #CantJustPreach t-shirt here: https://t.co/xqvG2RsjIL https://t.co/Usq8TGqVm7 A beautiful tribute to my awesome wife by our friend, the magnificent chef @ericripert https://t.co/gALNjLKgMg Congratulations Maelyn!  Amazing work! https://t.co/eaPkVMuW0F RT @chrissyteigen: https://t.co/5HGtlNwTFf Welcome to #TeamLegend, Celia! https://t.co/y2Gps2ZPIL Yeah Lisa! https://t.co/CxE1anZrpm RT @NBCTheVoice: .@JohnLegend is out here showing 'em how it's done. \n\nHe's performing his new single \"Preach!\" 👏✨ #VoiceResults https://t.… #CantJustPreach - check out our work at https://t.co/c7XeIxfTxV https://t.co/yJLkrfkddo RT @NBCTheVoice: Our own @johnlegend is taking the stage TONIGHT 8/7c on @NBC. 🎶#VoiceResults https://t.co/0e0Zhdp83V The results of Cross Battles won’t be the only exciting thing happening on stage tonight… Tune in to #TheVoice at 8/7c on @NBC to see! https://t.co/anO4SjvkNw RT @JaclynCorin: Honored to be a part of this project. Thank you @johnlegend for highlighting the advocacy and fortitude of communities all… The fifth and final episode of #CantJustPreach features @JaclynCorin. She is one of the founders of #NeverAgainMSD and @AMarch4OurLives and is an activist against gun violence. Learn more about her story and donate to #NeverAgain here: https://t.co/70oagXBY4v Maelyn is such a phenomenal singer!  So much control and style.  Such brilliant choices! Go #TeamLegend !!!! The #VoiceCrossBattles are so good!  Go Kayslin!!! YES LISA!!  GREAT START FOR #TEAMLEGEND!! Watch my newest interview with @nowthisnews to learn how the inherently unfair implementation of the death penalty is reflective of a greater need to completely redesign our country's criminal justice system. https://t.co/UurgOd6TLf @TigerWoods Congratulations sir.  It was a thrill to watch! RT @BarackObama: Notre Dame is one of the world’s great treasures, and we’re thinking of the people of France in your time of grief. It’s i… RT @ewarren: The President is inciting violence against a sitting Congresswoman—and an entire group of Americans based on their religion. I… Luna had a Disneyland birthday today!  (As far as she knows, her birthday is today.  Don't tell her it's sunday please. Thank you.) https://t.co/m72HxYGrje And he's often repeated the lie that scores of Muslims were filmed publicly celebrating on NJ rooftops as the towers fell. He's a despicable bigot. Never Forget.  While the President is making life much harder for Rep Omar, who has already been subject to death threats and bigotry, this is how he responded to 9/11 at the time. https://t.co/JqpgBlHylD @biewerboys @RepThomasMassie I graduated with a Bachelor of Arts in English from the University of Pennsylvania.  This means I'm a painter, of course. @RepThomasMassie You interrogated him as though he was trying to pose as a scientist because his degree has the word \"science\" in it.  Please tell me you were joking. @RepThomasMassie Secretary Kerry is a career public servant who never claimed to be a climate scientist.  He served the country well as Secretary of State and negotiated on our behalf in the Paris Climate Change Agmt.  He had every right to testify about the issue. @RepThomasMassie Next our great congressman will grill the high school Home Economics teacher on the Fed's monetary policy. \"You profess to be an expert on Economics, do you???!!!!\" In an interview with @nowthis, I discuss how individuals have the power to inspire others to take action and make the world a better place, as demonstrated by the amazing community leaders featured in my #CantJustPreach series. https://t.co/lbs3uqHcFD @RepThomasMassie Bro.  Please tell me you're not this dumb in real life. Please tell me you're joking. RT @SenGillibrand: This is what leadership looks like. https://t.co/1cVSwJBcfh Great conversation https://t.co/USspicG85s We found our Journey! Thank you to every young star who auditioned and congratulations to Madalen Mills. We're excited to bring Jingle Jangle to life as @Netflix's first live-action musical. https://t.co/2qUspesUkN RT @jduffyrice: I wrote something for the New Yorker in which I remind y’all that the Chicago FOP actually HIRED Jason Van Dyke after he ki… RT @gtconway3d: This reckless accusation of treason is ignorant and reprehensible.  However impossible it may be for Trump to disgrace hims… We sold out of our first batch of LVE rosé last year, but we're back in time for a beautiful summer!  Order at https://t.co/kZIGh3SG81 https://t.co/vwz9RbptV4 Join me &amp; @Kiehls on our mission to make the world a better place in 10 mins. Share your ideas using #Better10, and be sure to tag me and @Kiehls. #kiehlspartner https://t.co/ghYGe1v6gL Still got my drank https://t.co/89sD3X2ApD 😂😂😂😂 https://t.co/YJAvlxHz5N I’m super happy with my team. Can’t wait to take on the other coaches in the #VoiceCrossBattles! This is going to be fun. #TeamLegend Congratulations to my brother @DwyaneWade on a magical career https://t.co/wAWTh6Whbr RT @JamilSmith: Kirstjen Nielsen should be a pariah for life. No cable deals, no cushy college gigs. @michelleinbklyn, on what should happe… Big news on the #VoiceBattles tonight… let’s just say, the competition gets a little heated. Whose team are you on? #TeamLegend @prisonculture It's great! Episode four of #CantJustPreach features @muxerisa. She is the deputy director at @ConMijente and works extensively for the release of transgender women from ICE detention and an end to all deportations. Learn more about her story and Mijente here: https://t.co/W3PtuXBCEM @nhannahjones Happy birthday!! @brandicarlile @NBCTheVoice @lisarameymusic @betsyademusic Thank you for the beautiful song!! Happy to welcome Jimmy to #TeamLegend. Thanks for the gift @adamlevine #VoiceBattles Classic song! Classic performance! #TeamLegend makes my job so fun #VoiceBattles We had some true rockstars on the stage tonight! Proud of you both! #VoiceBattles The Voice is on tonight… the performances are incredible. Wait until you see my team. 8/7c on NBC! #VoiceBattles #TeamLegend RT @KingJames: Salute my brother!! Means a lot. And like you said I hope people listen, just open your ears and listen. 🙏🏾‼️‼️ https://t.co… Racism and white supremacy should be condemned and renounced &amp; people of all races and religions should come together to uphold a fair &amp; just society.  I sat down with @nowthisnews to talk about #CantJustPreach and what we can do to make the world better. https://t.co/l90uaTEgtA Sara and I recorded this live version of the beautiful song she and Lori wrote... https://t.co/x48gpf8vYd Excited to join @MelindaGates on May 7 here in LA. We’ll be talking about her new book, The Moment of Lift. Visit https://t.co/6rjJaUFHFJ to learn more. https://t.co/PadHNJ7pDh RT @ccjones13: One of my students is currently writing about @MittRomney’s ancestors who fled to Mexico to avoid prosecution as polygamists… @tshaikh1992 @TOMFORD Excited to hear my friend's new album!  We did a lovely song together on it called \"A Safe Place To Land\" https://t.co/D1H2OUuDNM Legends of Ink.  New show from your favorite tattoo family https://t.co/MGdDtguQjb RT @chiraagbains: New Jersey has almost completely eliminated cash bail. The number of people in jail has dropped 40%. People are still sho… I’ve arrived! Just say “Hey Google, #TalkLikeALegend” to get my voice on your Google Assistant. #HeyGoogle #ad https://t.co/mgbYh1Sigu RT @baobabstudios: The #webbyawards nominees were just announced and #CrowTheLegend received two - Best Narrative Experience and Best Anima… @whysoglamjam If you're at Howard, yep! If you missed it Saturday night during the @NAACPImageAward, you can watch my full interview with Cathy Hughes here: https://t.co/0Npi7P0ubo These battles are so exciting to watch! I hate having to choose a winner, but both Julian and Denton should be proud of their performances!  #VoiceBattles #TeamLegend The #VoiceBattles are back again tonight at 8/7c on NBC.  I can guarantee you will be entertained!  #TeamLegend Live performance coming soon I'm live on the Tom Joyner Morning Show! https://t.co/6BqYGQTGDU RIP Nipsey.  I just spent Thursday with him filming a video for a beautiful new song we created with Khaled.  We filmed in Inglewood, close to where he grew up. He was so gifted, so proud of his home, so invested in his community.  Utterly stunned that he's gone so soon. My new song #Preach is featured in the powerful new #TheBestOfEnemies film starring @TherealTaraji &amp; Sam Rockwell - watch the lyric video here: https://t.co/eDZ5kjqosy\n\nSee the movie when it comes out April 5th: https://t.co/6ZJYQVVBVv https://t.co/4zq2wDoz1X Hi Mom!  Welcome to Twitter. I apologize in advance for everyone. https://t.co/j9s9Ua8dYB Twins https://t.co/jKY6j4QSz4 @kelzipan @chrissyteigen Coming back soon! @LVE_wines Rosé all summer! @fivefifths Hundreds of millions @ledisi @rontyoungphoto Happy birthday!!! Thank you, @wkamaubell and @RBReich for highlighting how the criminalization of poverty negatively affects communities, and perpetuates flaws within our criminal justice system. To learn how @CADebtJustice is working to establish equity and justice, visit: https://t.co/rKuoolw7PJ https://t.co/SW2DTrlir4 RT @AOC: 3,000 Americans died in Hurricane María. The Midwest is drowning as we speak. 100s of Flint families were pumped w/ poisoned water… @NBCTheVoice @MaelynMusic @savibrister @Adele https://t.co/IzDlQkeAec Daddy Shark + Luna Shark https://t.co/pdSnQryy3L Making too much noise at lunch https://t.co/4k5pmUwEpS Modern-day segregation is a reality that destroys our communities. Thank you @nhannahjones, @MitchLandrieu, and @integrateNYC for joining me in elevating the issue of modern segregation at ‘A Day of #UnreasonableConversation.’ https://t.co/eoDvrO0J4L @ProfessorEA 😎 why thank you, Professor!! @NBCTheVoice @MaelynMusic @savibrister @Adele Ahem.  Which team? My word of the day today was \"elegiac\" which I sorta mispronounced as \"elegaic\" because I misspelled it in my head.  But it means wistfully mournful.  synonyms:  mournful, melancholy, plaintive, sorrowful, sad, lamenting.  And Maelyn and Savannah nailed it! https://t.co/qXXgpjfe98 Welcome, Beth! I’m so excited to have you on #TeamLegend. We’re going to do great things together, I can feel it! #VoiceBattles Wow. Absolutely gorgeous performance by Maelyn and Savannah. Thank you for that moment! #VoiceBattles Where is the LOVE?  Our hoodie is in red and black at our merch store!  https://t.co/ascIVO3bUa https://t.co/t7eDiTnKdc We're on right now!  #TeamLegend #VoiceBattles https://t.co/nfYV4JhmaN Of course, we don't have any baby sizes available. Miles has connections Miles loves the new black LOVE hoodie!\nhttps://t.co/QDSvrA8MM9 https://t.co/vp2yZDOdBC Why did I set myself up for this impossible choice? #TeamLegend https://t.co/nfYV4JhmaN Episode 3 of #CantJustPreach feats. Efren Olivares. He's the Director of @TXCivilRights’s Racial &amp; Economic Justice Program &amp; is devoted to advocating for the constitutional &amp; human rights of immigrants &amp; their families. Learn more about his story &amp; TCRP: https://t.co/qcvzsRHUiX New York State @SenGianaris and I wrote this together.  New York has a great opportunity to lead the nation in reforming our unjust money bail system: https://t.co/KYdAn2pVnV I'll never forget Lincoln's great speech: \"government of the acre, by the acre and for the acre\" https://t.co/zfeQG6GqYk A big shout out to @baobabstudios for earning 4 Emmy Award nominations for our flagship indigenous worldview animation #CrowTheLegend.  Watch @Oprah, @ConstanceWu, @lizakoshy, @diegoluna_ and myself here https://t.co/v4mOnRMoaM  #Emmys #EGOAT https://t.co/Ke4bY1WugE RT @mworringer: @johnlegend @fredmanwalking Scott Walker’s “fair maps” in Wisconsin last year 🙄 https://t.co/WiybzFzY0q Scott Walker apparently thinks we're all stupid. https://t.co/usYRXz2qud @ScottWalker I assume you'll be fighting for non-partisan redrawing of district lines that fairly represent the popular vote in each state. If not, STFU @ScottWalker Please stop lying. This is ridiculous #Amendment4 was passed with widespread support to restore voting rights to millions of Floridians. Yet, a new bill restricting eligibility would massively reduce the number of people able to register. Help guarantee civil rights by signing this petition: https://t.co/cNF8B0my0y @g_pratimaaa https://t.co/jpCreDjl13 RT @BernieSanders: This is what real action to stop gun violence looks like. We must follow New Zealand's lead, take on the NRA and ban the… RT @AOC: Sandy Hook happened 6 years ago and we can’t even get the Senate to hold a vote on universal background checks w/ #HR8.\n\nChristchu… Tonight's dance party: Recuerdame miguel https://t.co/svEqJjiIdz @anildash @nerdette @MikeIsaac @chrissyteigen It reminded me a lot of the Fire Fest docs.  In both stories, I was thinking this idea would be really cool if it actually worked! @chrissyteigen Just noticed that the lyric playing was \"funny how some distance makes everything feel small.\" You're very good at this social media thing RT @JoyAnnReid: Undoing the re-enfranchisement of former felons who've paid their debt to society inch by inch, by enacting fresh new versi… RT @AOC: A poll tax by any other name... https://t.co/kY65PooPUM @charnel56 So ready!  #TeamLegend is strong! My first team on @NBCTheVoice, everyone, and I have to say… I clearly have the best one. Excited to work with everyone, let’s make some magic. #VoiceBlinds I always know when Breitbart writes about me. An army of venomous trolls with terrible grammar takes over my mentions. I pray you guys rethink all of your existence. Do better. Be best, as your queen commanded you.  And know that I won't be shutting up. You can never have too much butter 😏 #TheVoice #TeamJohn https://t.co/eISKiUqUfi Freestyle stroke is improving! https://t.co/2uscor1MGb Adam's piece is a very helpful analysis of the historical roots of the ideology that is fueling so many terrorists today.  Anti-racists of all races and religions need to come together in love to counter this evil. https://t.co/ZSU4uU4e5O Thanks to @iheartradio for inviting us to perform Preach last night!  Thank you to my awesome team for putting together such a compelling performance!  @friendsatwork @manmanphilly… https://t.co/yQvzFMVHJz RT @WajahatAli: Let me quickly explain why the Christchurch mosque shooting affects many of us, not just Muslim communities. If the shooter… The President of the US didn't cause all of this. It's been around well before his tenure. But his rhetoric has certainly fueled and inspired these killers' sick minds.  He needs to condemn this evil ideology and take real steps to fight it. This evil ideology has attacked mosques, synagogues, Sikh temples, black churches and more in the past few years. So many people killed while gathering to peacefully pray. The killings in New Zealand are so horrific and heartbreaking. This white supremacist terrorist movement is so destructive here and abroad.  We need to unite against it. New cover of augustman https://t.co/dszYKnoLLc @QuincyDJones Happy Birthday Q!  See you soon! @RobinLawler3 @PaulSmithDesign @DaveThomasStyle True, true Spring is here.  I wore my Easter suit early.  @PaulSmithDesign @DaveThomasStyle https://t.co/8rYetUiWxH Don't forget to tune in to the #iHeartAwards TONIGHT at 8/7c on @FOX! I'll be performing my new song #Preach! https://t.co/rTanaUJgOK @common Happy birthday brother!!! RT @chrissyteigen: does this look real? we are trying to get into harvard @jenatkinhair @mrmikerosenthal @johnlegend https://t.co/jpcNGq2mVi Except the murder rate is higher in the Southeast where the death penalty is used much more often.  The death penalty is not an effective deterrent.  The facts are clear on this https://t.co/Oj8gR3soa9 RT @GavinNewsom: The death penalty has been an abject failure. It discriminates based on the color of your skin or how much money you make.… Thank you, @GavinNewsom\nhttps://t.co/qCw4dQkvdp I'm going to be performing #Preach at the 2019 #iHeartAwards this Thursday and I hope to see you there! https://t.co/wLEdRCicXr https://t.co/gWCgPCBhXi Excited to share my acoustic performance of #Preach - out now! #CantJustPreach\nhttps://t.co/dBepfdaGUD Not too bad, not too bad. I think we did alright this evening, don’t you Shawn? Welcome to Team Legend my friend, ignore the other coaches crying. #VoiceBlinds I think I win the award for best wingman ever. We both won tonight, Denton! #VoiceBlinds Desmond Meade of @flrightsrestore has helped 1.4 million people with felony pasts get their voting rights restored. Amendment 4 was a historical moment and a reason we #cantjustpreach. Read more on @wetransfer https://t.co/xqvG2RaIRd Take a second to imagine yourself in somebody else's position... #CantJustPreach https://t.co/kfEwLVTJWx @Wildaboutmusic @chrissyteigen 🙏🏾🙏🏾🙏🏾🙏🏾 @MissCandyBlair AND  I did a track w/ Buju Banton as a bonus for that album.  \"Can't Be My Lover\" RT @RecordingAcad: .@JohnLegend truly brought the room to a state of awe with his powerful performance of \"Bridge Over Troubled Water.\"\n\nWa… @AmandaMarcotte @PodSaveAmerica yes, I wish I could have remembered it when I was interviewing! In the second episode of the #CantJustPreach mini series, @desmondmeade shares his story of overcoming incarceration to become a social justice activist, helping 1.4 million people get their voting rights back. Learn about his story here: https://t.co/zCUIEnJLnT Thank you to everyone who submitted a question for my @SteveHarveyFM @AskAnythingChat! You can watch your questions get answered now: https://t.co/7fJFDdbXbZ. Thank you @IAmSteveHarvey and @iHeartRadio for having me on! @mickieg14 she covered it beautifully.  her version was Simon's favorite version, according to him. Watch me on @SHODesusAndMero TONIGHT!  We laughed a lot.  I committed career suicide.  Good times.  #DESUSandMERO #SHOWTIME https://t.co/vX3vyVg8tN RT @SHODesusAndMero: \"You either getting your next Grammy or unemployed.\"\n\n\"Possibly both.\"\n\nWatch the guys get into making Grammy-bound mu… In this interview we address the most important controversy of the past few weeks.   The infamous VF photo omitting Lovett and then, belatedly, un-omitting him. https://t.co/RTSIOheYF9 🙏🏾🙏🏾🙏🏾🙏🏾 https://t.co/o38bCDPR4k @jbouie Barack was astonishingly clean to him Sing, Miles! https://t.co/YWZWJwmNSY RT @chrislhayes: As intense and at times terrifying as this discussion is, it's really hit a nerve and I've been enjoying reading people's… @chancetherapper Congratulations bro No hesitation there, @adamlevine. When you know, you know - you know? Betsy! Let’s do this. #VoiceBlinds RT @NBCTheVoice: Q. What do you get when you combine @Kelly_Clarkson and @JohnLegend? \n\nA. #TeamJelly, of course. ❤️ https://t.co/1w3hnkFAxP My jokes aren’t too bad… Want to hear a joke about paper? Nevermind, it’s tearable. 😏 Anyway… welcome to Team Legend, Talon Ted! #VoiceBlinds You should have turned for this one, @adamlevine.  I think he would've picked you.  Jacob looks like a movie star and has that golden vocal tone!  Welcome to #TeamLEGEND!  #VoiceBlinds I’ll be answering your questions about my new song #Preach on the @SteveHarveyFM and @iHeartRadio @AskAnythingChat this Friday! Send me your questions here: https://t.co/5FcLks1z0E Whether you eat a salad for breakfast (yes, that’s a thing), choose the stairs over the escalator, or track your steps, @NakedJuice and I want to remind you that little choices can make a big difference. What are your little healthy choices? #HoweverYouHealthy #sponsored https://t.co/cKeG3g9sIk RT @RevDrBarber: #TheBestofEnemies is a powerful story of fusion politics that the #PoorPeoplesCampaign promotes. We were blessed by the mo… Turning tragedy into change is what the world needs now. Learn more about my #CantJustPreach initiative with @WeTransfer here: https://t.co/xqvG2RaIRd https://t.co/m5hTl9jhZA RT @CoryBooker: The failed War on Drugs has really been a war on people—disproportionately criminalizing poor people, people of color &amp; peo… @ladyexcellent Haha when fake black people on Twitter talk about \"blacks\". Black people don't call each other \"blacks\", my fake black friend. @RussCausinAFuss @VanityFair @jonlovett @RonanFarrow @deray There he is! Today, I’m kicking off the #CantJustPreach mini-series (presented with @WeTransfer) with the first episode featuring @SybrinaFulton, mother of Trayvon Martin &amp; founder of @the_trayvon. Learn about her story &amp; donate to the Trayvon Martin Foundation here: https://t.co/yU7uTZfcE5 https://t.co/iHjHIVDQOm #CantJustPreach https://t.co/SEsQXzfdmZ The #CantJustPreach mini-series explores five stories of people who have inspired me with their passion to change the world. I’ll be donating $10k to each cause. If you're able to support them in any way, please join me! https://t.co/a0Zw7zsd7y I’ll be on @SteveHarveyFM March 8th talking about my new single #Preach AND I’ll be participating in @iHeartRadio’s @AskAnythingChat! Send me your questions here: https://t.co/IhWh4z9lRz @chrissyteigen @AwkwardGirlLA You have my permission. Thank you for asking Yeah my wife is brilliant, savvy, funny as hell and clearly better at social media than me. She doesn't need my advice or censorship when it comes to how she communicates with the public. https://t.co/jgpqR2s4nA RT @TheDailyShow: Here's @johnlegend's performance of \"Preach\": https://t.co/qu04EZ27pr Revenge is a dish best served cold. That was Instant Replay worthy. Check the tapes, I got him, people! @adamlevine #VoicePremiere thank you! The jacket is from @PaulSmithDesign https://t.co/DjLSncv3EH Wow… blocked by all three of you..  Your welcoming committee is so warm. I feel right at home here #VoicePremiere. @tonytellez @NBCTheVoice @MaelynMusic @Adele I agree! @jamgram25 @TODAYshow @rkelly Perhaps him making a video urinating on a child made him stand out from the rest. Perhaps. Not a bad way to start night one of @NBCTheVoice. I’d say I’m getting the hang of it, wouldn’t you agree @adamlevine @blakeshelton @kelly_clarkson? #VoicePremiere .@kelly_clarkson sure sure 😒 #VoicePremiere Well, well, well… my first artist on @NBCTheVoice and it’s the 1st Four Chair of the season. The other coaches may be feeling threatened, but I’m feeling pretty good. Maelyn is magic. #VoicePremiere We love the LOVE hoodies so much, we made them in a new color!  Get your LOVE hoodie in black now at my merch store: https://t.co/z4GSifusHt https://t.co/1YJCo3skoQ Thank you, @KeishaBottoms, for your efforts in Atlanta to reduce incarceration, and for informing me about this community-driven process to #closethejailatl. We encourage you to include the formerly incarcerated in deciding what the space becomes next! https://t.co/N1ckooztZr @BarryJenkins Yes!!!!!! Mom and Dad went out tonight https://t.co/n5Nos9J3vC @maddow Every single show, Rachel! \"John, you are the father\" https://t.co/sADokhuTLS @awkwafina It took me a while to figure out the spelling. I never processed the first w.  And I refused to Google it @MarkObbie @NYTmag \"...Remedies for mass incarceration shouldn’t be considered crazy. It should be considered crazy that we have mass incarceration in the first place.\" @MarkObbie @NYTmag I agree with that, basically.  \"I don’t believe that what I think is radical. We’re the most incarcerated country in the world. That should be considered radical. Police are allowed to shoot unarmed black men in the street. That’s radical...\" It was an honor to share the stage at #MBKRising with Sybrina Fulton, mother of Trayvon Martin; Reverend Wanda Johnson, mother of Oscar Grant, and Congresswoman Lucy McBath, mother of Jordan Davis.  Thank you for your powerful, inspiring stories. https://t.co/1AJDOPcD1i Listen to #Preach on @AmazonMusic’s \"New to Prime\" playlist: https://t.co/PuFSXNVVr9 https://t.co/12bdpPLGOn @ColumbiaLaw @ReginaKing @ava boss. @Travon Oh my God.  😂 Catch me on the Tonight Show.  We perform \"Preach\", play a *new* lip sync game and talk about Chrissy possibly leaving me for a Secret Service officer. https://t.co/98rwbBYCxx Get a behind the scenes look and learn about the making of my new music video for #Preach. https://t.co/G4tW8vGjU2 #CantJustPreach https://t.co/mRcrIjBaFn Monday is my first day on The Voice!  Tune in to see what Chrissy packed me for lunch? https://t.co/G80B2NBrgZ @Believablee @MissZindzi I feel like you should say they're over-koalafied but what do I know about jokes RT @jbouie: excellent thread about racist spectacle violence and why people are willing to believe things that may sound outlandish to some… RT @davidfrum: Yesterday, federal prosecutors charged Coast Guard Lt Christopher Hasson with illegally amassing an arsenal with intent to c… @RepBarbaraLee I was excited to meet you!!  I'm a fan! RT @TheEllenShow: .@JohnLegend can \"Preach\" on my show anytime he wants. https://t.co/3bEFOJsyD8 still trying to figure out these floating shorts... https://t.co/DRq76LCoLa RT @Luvvie: Tonight is the premiere of the #UnitedSkates doc on @HBO! It is so good! I was able to chat with the Baltimore roller skater, T… Excited for y'all to see this tonight! See our award-winning documentary on black roller skating culture at 8pm/7c on @hbo #UNITEDSKATES https://t.co/wc1KBG946X RT @itsthereal: This week on A Waste of Time with ItsTheReal, we travelled to Los Angeles and finally sat down with @JohnLegend for a deep,… @chrissyteigen I had no idea Totinos made anything other than pizza rolls @chrissyteigen I love you, baby.  Totinos Pizza is almost here Start practicing what you #Preach - @YouTube has included a donation button on my new music video and all proceeds are going to @LetsFreeAmerica. Check it out and learn more here: https://t.co/mzcjXp2nNm https://t.co/mz76LPFQDJ My new song #Preach is out now and streaming on @amazonmusic, listen to it here: https://t.co/EQqgfvNcKk https://t.co/Yq6TNmHKrZ Be sure to listen to my new song #Preach on my @AppleMusic #Essentials playlist! You can stream it here: https://t.co/P9LL2LKB4Y https://t.co/5Zf4UANRGf Thank you @Spotify for the support of #Preach! Stream my new song now: https://t.co/uFotFj7G4Q https://t.co/I3mT8RVR8T #Preach is officially out now! Check out the World Premiere of it all day long on @iHeartRadio. https://t.co/5IJTal6h83 https://t.co/zie1Z3mV5h RT @DavMicRot: Actual national emergency: 100 die every day from gun violence, 5 dead in mass shooting will not even be national news tomor… I say gif https://t.co/0cb8NBTAK6 Sometimes we can get so frustrated by the news and what’s going on and there’s this battle going on in ourselves. Do we become apathetic? Do we become engaged? Do we just talk about it, or do we do something? #CantJustPreach https://t.co/09JN3YLq1j https://t.co/cHsEhiiRkx Out now #CantJustPreach https://t.co/09JN3Z31pT https://t.co/23qQaCiicw Tomorrow. #CantJustPreach https://t.co/nxauKcRn7e Get a little more LOVE in your life - use the code 'LOVE15' on https://t.co/z4GSifusHt to get 15% off tour merch, music, and more! https://t.co/hhxGlzgLEz @mayawiley @PaulBegala @davidfrum See you Friday! Thank you NAACP! https://t.co/mYBY6rlpTv Thank you again! https://t.co/g8aAtTLtIp Thank you! 🙏🏾🙏🏾🙏🏾🙏🏾 https://t.co/m0AhibS3rM @nealbrennan Lies, Neal. Lies Get Lifted Films, @HBOdocs, and I want to see your skating moves - use #UnitedSkatesChallenge and be sure to watch our new doc #UnitedSkates on @HBO Feb. 18th. https://t.co/c9eQz62wlP @showstopper816 definitely not Trump's fault.  This problem predates his political career, by far.  Citizens United decision by the John Roberts court made it worse (during Obama administration, but Obama opposed the decision). Swim lesson #3 @KidSwimLA https://t.co/EgDl4HTcXN #CantJustPreach https://t.co/GoQisqsRuH @Jdruc00 I think they will win more votes and small dollar donations if they make it clear that they can't be bought by big corporations, etc @tjhansen Make the case to the American people and rely on smaller donations @tjhansen That's great. But this bill won't pass the GOP Senate and Trump wont sign. How about Dems unilaterally vow to voluntarily follow a certain anti-corruption code even if it's not the law of the land. @jDorai Both parties should. You're right. But the Democrats claim to be the party of the people. GOP makes it clear their main goal is lowering taxes for the rich and deregulating corporations.  Democrats should back up their brand with actions that make it clear who they stand with Democrats should make it their policy to truly drain the swamp. Show that you can't be bought.  Show that you are making policy with no ulterior motives.  Make that a core part of the brand Everybody's retweeting this. But it really is great. This is what the People's House needs. https://t.co/pmqenfaybh My middle child skills come in handy https://t.co/TYmv9djbYK @NoelLaw1 Indeed he did. Chrissy lost her voice, I won an Emmy, all in the same day.  But the @lsb show must go on!  We taped the show with me still in my Emmy tux and serving as Chrissy's special guest… https://t.co/Tm1XykEL4D RT @brhodes: Dems in Congress and running for President should treat climate change like the urgent, leading, neglected national security c… RT @Tribeca: Dyana Winkler and @TinaBBrown's @UnitedSkatesDoc stole the hearts of festival audiences, winning Tribeca's 2018 Audience Award… 💪🏾💪🏾 https://t.co/2SLrGq38DI @jduffyrice @HBO You will love it. Celebrates the culture while also educating about and lamenting the disappearance of the spaces that enabled the culture to flourish. Our company #GetLiftedFilmCo produced a beautiful documentary called #UnitedSkates. It's about black roller skating culture.  Just went to the LA premiere. Can't wait for you all to see it on @HBO Feb 18! Nice pic!  This was the day we got legally married in NYC before doing the ceremony in Italy that weekend. https://t.co/klhhUCqgAz @DonaldJTrumpJr I'm just glad we agree that racists and sexual assaulters should resign from public office.  Daddy's coming home! @DonaldJTrumpJr Neither is your sworn testimony before Congress, Junior @criscarter80 I feel like they should hire Kaep too #CantJustPreach https://t.co/e2VaKql6eL RT @nate_bowling: In 2016, I was one of four finalists for National Teacher of the Year. What has happened to each of us since then tells u… His name is Coinky (sp?) according to Luna https://t.co/GA5FcWy6F0 @darrenrovell Super Bore Tiny audience... big impact. #LoveTheChange #StinkyBootyDuty #PampersPartner @pampers @chrissyteigen @adamlevine https://t.co/mULkGsKMMe @angelicahale You were incredible!!! @akilahgreen That's love This https://t.co/ZonpXUl9I1 All I wanna know is the line of succession in VA. What a poetic ending it would be for the black Lt Gov to take over for the KKK cos-play governor. RT @chrissyteigen: !!!!!! I am so excited for this !!!!!! https://t.co/6cOzA5AztD @HenryLouisGates @PBS Looking forward to this! RT @jayrosen_nyu: What Tom Brokaw didn't grasp. Concisely: \"No one moves to this country — or any country — and doesn’t want the easier lif… Love this new @Emilykingmusic! https://t.co/ZeL6iASzuI @PrincessPshh Ronald, John, Vaughn and Phyllis Yvonne Happy birthday to my original day 1, my big brother Ron!  Love you, brother! https://t.co/NkrdT9YYyk RT @QuincyDJones: There are no words to convey how much my ❤️ aches with the news of the passing of my baby brother, James Ingram. With tha… Sending love to Jussie and the Smollett family after this horrific attack.  We support you and pray that you find peace and justice. @Etothe_ They already started months ago! All. Lies. Hahaha https://t.co/ul2toK3N8f I can't really swim. Today I took my first swim lesson since I was like 5. My dad learned in his 60's so I feel like I'm ahead of schedule. https://t.co/ukdYoaCtAj I hope no one dares suggest I had a body double in this promo. That's offensive and I won't be taking any follow-up questions. Please respect the privacy of me and my family. 🤷🏾‍♂️ @NBCTheVoice February 25th https://t.co/qpxh38WPjt @rtraister Then admonishing Hispanics to assimilate better as if racism was their fault. Wow. Brunch buddies https://t.co/M3HjkLgfA9 RT @tystiklorius: We, Get Lifted Film Co., accept the 4% challenge &amp; commit to working with a female director on a feature film in the next… @phoebekatis @BreakMirrors Love this! excuse me, I'm teaching https://t.co/jAeCSniMj3 @fivefifths In Summer is my jam She loves this wig https://t.co/91dEAzsnCl Friday night https://t.co/pRG1MBktmi @nealbrennan Says someone who gets paid to write things @BillOReilly Hilarious RT @NBCTheVoice: Adam, Blake and Kelly are SHOOKETH. 👀\n\nSee why @johnlegend has them 😳😳😳 MONDAY. https://t.co/KwAmfeVyHk RT @Kanew: Yesterday @RevDrBarber called out Governor @BillLeeTN &amp; anyone who claims to love MLK but fight his agenda and hurt poor people.… @ChelseaClinton Congratulations!! RT @NyashaJunior: Woke Up This Morning https://t.co/7e7oqZS4RC @johnlegend #MLKDay https://t.co/HAmxpmPJY1 Thank you @RevDrBarber. 🙏🏾🙏🏾🙏🏾🙏🏾 #cantjustpreach https://t.co/UynoWcowVC RT @jbouie: i’ll say again that one consequence of trump will be to validate the public expression of racism and that containing this means… RT @ChrisMurphyCT: Saturday fact sheet:\n\nImmigrants commit crimes at a far lower rate than native born Americans.\n\nCounties that border Mex… RT @Andy: So pumped for @chrissyteigen &amp; @johnlegend tonight on #WWHL ♥️ @davidaxelrod @BernieSanders @Sifill_LDF @NAACP_LDF She's a national treasure! \"Don't just talk about it or tweet about it. Do something...\" #CantJustPreach https://t.co/N0p5QCiGRd @JohnFPfaff If it does change urban prosecutors' behavior, that's a small number of prosecutors, but lots of constituents affected 👑👑👑👑 https://t.co/yAZcBneQXM \"I can't just sit and hope, I can't just sit and pray...\" #CantJustPreach https://t.co/eF6UwkBZ8a Last party post (for today at least)! @lisavorce has been planning every event for us since she did our wedding at Lake Como. She transformed our house for the Casino Royale themed party.… https://t.co/U7Nw81oTUZ Epic!! https://t.co/TnrSTdZ6wy Saturday night, my amazing wife threw me the most incredible 40th birthday party I could imagine!  So good to be surrounded by family and loved ones. I had the time of my life. I'm so… https://t.co/5ATbiNXHTO @Travon @chrissyteigen @ImAngelaBassett @CourtneyBVance Your costumes were 🔥🔥🔥🔥 @AishaHinds 🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾 so much love last night!  Thank you for coming!! RT @neilmeron: We won!!! Thank you #CriticsChoiceAwards2019 for honoring us as #Best TV Movie A happy group moments after we won @tystiklor… Thank you @CriticsChoice for recognizing our show! https://t.co/MXQQ3lcRWQ @MissyElliott Congratulations!!!  Well deserved!! RT @jmeacham: America should “build a wall of steel, a wall as high as Heaven\" against the flow of immigrants.--Georgia Gov. Clifford Walke… So happy for @desmondmeade and the over 1M others in Florida who can now register to vote because of him and his team working so hard to pass Amendment 4. An amazing victory for democracy! https://t.co/1ZoxyvntjH @tariqnasheed No one asked me to be in a Harvey doc. I'm friends with the #SurvivingRKelly director and several protestors in the #MuteRKelly movement so I had a personal connection and agreed to appear. I don't just go around interviewing for every exposé. This is dumb @tariqnasheed I'm glad you agree with me that R deserves the Weinstein treatment. Believe the victims, expose the rampant predatory behavior, career destruction and indictment with convictions hopefully in the future. @DreMicheals1 Weinstein has been exposed. His career is destroyed, he's ostracized from the business  and will never make a movie again.  He's charged with sexual assault and is awaiting trial. If you want the same for R, then great!  Me too. @BluBell17 We have never collabed. Ever. @BluBell17 Please show me the songs I made with him. Google really hard. They don't exist. If y'all wanna cape for R and discount all these women's stories, just say it. Don't bring up some old pics of me and somebody else. https://t.co/2wus2P7vNm I took a photo with and worked with Harvey on several occasions before his abuse was known to me and the rest of the world.  Since his being exposed, his company and career have rightfully been destroyed and he's been indicted. Sounds like something that should happen to R Kelly https://t.co/LgIOQpEnsP @dh_simba7 @JT_theQB4th Congratulations on a phenomenal season!  On to the next challenge! @mason_patty Love you back!  Just believe that pundits' opinions should represent a wider range of the diversity of the populace. And likability depends on perspective and we should be getting a range of perspectives \"Dada's shoulders\" https://t.co/SKbs9JcuWM And this goes to who has the authority to write about likability in our major publications and opine on tv. Disporportionately it's a white dude. https://t.co/LlLaUjNJG2 @danpfeiffer *fails @danpfeiffer I agree with the writer that all candidates are judged on their likability. But I think he falls to acknowledge that women have much less room to maneuver in that likability matrix. They can't be too tough or too joyous or too anything and it turns out there's nearly nothing left @voguemagazine One small correction: that was a Google pixel 3. Hence the photo that captured the full brilliance and beauty of my wife and her outfit. My girls ❤️❤️❤️❤️❤️ https://t.co/8holPdt7dk In @NYGovCuomo’s speech on 12/17, he restated commitment made at @GlblCtzn to #EndMoneyBail in 2019. But we know it will take this &amp; more to end mass jailing in NY. I support the bail demands delivered to Cuomo by 135+ groups: https://t.co/h4XtAbao1a #FREEnewyork Just posted a photo https://t.co/iNjeDpurAf Also I'm happy to support the work of people like my friends at @ALongWalkHome who have been speaking out on behalf of the survivors for a long time. To everyone telling me how courageous I am for appearing in the doc, it didn't feel risky at all. I believe these women and don't give a fuck about protecting a serial child rapist. Easy decision. We should all thank my friend @dreamhampton for her very necessary work to create #SurvivingRKelly.  These survivors deserved to be lifted up and heard. I hope it gets them closer to some kind of justice. RT @jonfavs: 200,000 people will get the medical care they need without going bankrupt because a record number of their fellow Virginians c… https://t.co/2KLfUBUTrm @PUSHA_T Thank you for that album. 🔥🔥🔥🔥 Happy New Year!  #FreeThePeopleDay https://t.co/hVUPxluwWB It's a wrap!  Thank you San Diego!  Thanks to everyone who joined us throughout the tour!  We really had so much fun and we're most definitely going to miss playing these songs for you. I… https://t.co/YtMukemPJj Closing out the #ALegendaryChristmas Tour in Southern California this weekend. Costa Mesa was so much fun!  Thank you! https://t.co/FlQWu5c7L2 @naima So happy for you! @EdgeofSports Happy birthday Dave! Happy birthday to my friend, the wonderful, kind and talented @GayleKing I also proudly share a birthday with THE GOAT, Denzel Washington. Don't you dare @ me with any incorrect dissenting opinions. It's our birthday. Thank you all for the birthday wishes today. It's been a wonderful year, and I feel so grateful for all 40 years of my life. This year has been especially awesome. I love my growing… https://t.co/6d6EmuYPtf RT @BetoORourke: https://t.co/XONeh8HUf1 @TheEllenShow Love you, Ellen!! #topnine2018. Family love and lactation https://t.co/9jrtzozoj2 @QuincyDJones Love you, Q!  Merry Christmas!! Luna in 2016. Miles today. Hand-me-downs https://t.co/1GmU8CDHCy Christmas bear! https://t.co/uZTqtA5NaJ Christmas Eve with my favorite girls https://t.co/TKksR5ZTJK \"...home by Christmas Eve.\" https://t.co/PXr3zWO5Es @jemelehill The throw, not you haha @jemelehill Insane John Legend and the Slay Belles?!  We'll revisit this name thing after the Christmas tour. But I like it for now. What a wonderful night in Los Angeles!  So good to see so many familiar… https://t.co/cCCgfJdAsE My little Miles https://t.co/Ql6sdvZ7MS When Luna is singing along, you know it’s a good album. Get her favorite Christmas album #ALegendaryChristmas from @Target here: https://t.co/gD28WzQnAd https://t.co/CfNfKE7NZQ Thank you @YouTubeMusic for the incredible support of #ALegendaryChristmas! Listen to the album here: https://t.co/GB8ZODLygC https://t.co/hW8SMyp4gj What should we call our incredible vocal trio? They need a name.  The Legend Ladies?  The Legendettes?  We had so much fun in Oakland! Thanks for another amazing night! https://t.co/AjQcvIfVfq Join me all day as I takeover Holiday Hits exclusively on @TuneIn. I'll be playing my favorite holiday songs and sharing memories! https://t.co/bxUJrmudLN https://t.co/C0Ijj1N1zN I teamed up with @EmoJamApp to create my very own Christmas emojis and they're now available for you to use! Download them here: https://t.co/E4IjghV8bZ https://t.co/36a2Cqg0pA RT @publichumanist: Hey friends, let's out-raise THAT gofundme by contributing to the National Network of Bail Funds between now through De… @rickyyycan @chrissyteigen Will have someone reach out!  Sorry about that! Your Christmas party playlist is solved! Enjoy the glow of the yule log while listening to my new album #ALegendaryChristmas: https://t.co/7IPdvMBQ1A https://t.co/78ZmDs4FCi RT @TVietor08: Trump's unilateral decision to gut food stamps is incredibly cruel and stupid policy. This thread does a good job of explain… Sticker makeovers by Luna https://t.co/AEHRn77ZRN .@voguemagazine's story on how @DaveThomasStyle keeps me and the ladies looking great on the #ALegendaryChristmas tour\nhttps://t.co/OAS3ZipL3C ooh, I like this list!  Thank you, @RollingStone!  #ALegendaryChristmas\nhttps://t.co/u6Q8ajBbYq So beautiful!  Chrissy's kitchenware at @target.  #ALegendaryChristmas exclusive at @target.  We have your Christmas gifts covered! https://t.co/OR1qZpS5EZ Christmas party in the air! You can now listen to my new album #ALegendaryChristmas on @AmericanAir's in-flight holiday channel. https://t.co/y0dyQcCe4u Portland, you were amazing tonight!  Thanks for a wonderful night!! #ALegendaryChristmas https://t.co/1fYFM4igRx Fun fact: same nephew that broke my Grammy haha @MikeBStephens7 https://t.co/AL5qLTOyaH So proud of my nephew @MikeBStephens7!  This will present a dilemma for me during Ohio St - Minnesota games, but we'll cross that bridge when we get there https://t.co/zxDtlLLo6y This is the amazing team on the road with me spreading Christmas joy and musically kicking ass around the country!  Thanks to my awesome band and crew! We're having so much fun on the… https://t.co/Sky6aUkxYS RT @NBCTheVoice: .@johnlegend and @EspeSpalding are SO INCREDIBLE singing “Have Yourself A Merry Little Christmas.” https://t.co/jq6unbmuwp @jaywillis @GQMagazine haha thanks!  Great article! @chrissyteigen @GQMagazine the people will decide!! @GQMagazine Unfortunately, it is political, in that it affects our politics and can manifest itself in government decisions.  But I agree with the article that it shouldn't be treated as an equal side in a respectable political debate. @mattsnavely @eromiclord @mmfa @NateSilver538 I literally said none of that.  I didn't equate speech with terrorism and I didn't propose any government action.  I spoke about consumers' and advertisers' choices in response to speech. I love you, Seattle!  We had so much fun tonight!  Thank you!!  #ALegendaryChristmas https://t.co/Vq21L3ZZpP @Nole4life02 @NateSilver538 Yup. We good. Thanks @NateSilver538 People of good conscience are right to alert the public about it and we can make our purchasing decisions accordingly @NateSilver538 Far right extremism is the biggest terrorist threat in America. It is, in part, fueled by the rhetoric of demagogues who scare people about brown people and Jews. Some of those demagogues are on prime time on Fox News, getting ad dollars from mainstream corps @NateSilver538 The logical endpoint of anything moderate could be something extreme. A silly reason to not do that moderate thing. @NateSilver538 Slippery slope arguments are too easy. Executives can make decisions about what kind of speech goes too far and shouldn't be supported by ad dollars. I would submit that white supremacists should not receive corporate ad dollars Tune in tonight to @NBCTheVoice at 8/7c on @nbc for my special performance of #MerryLittleChristmas with @EspeSpalding! https://t.co/AAYBmvgvTC It's happening! https://t.co/XJooz2ekNh @CynthiaEriVo Can't wait to hear it! My special version of #ALegendaryChristmas is at @Target with 2 exclusive tracks. Start your new Christmas tradition and get your copy here: https://t.co/gD28WzyMbD https://t.co/F2mUQUcr3d My take on @StevieWonder’s classic “What Christmas Means to Me” is on @AppleMusic’s #EssentialChristmas playlist alongside some of my favorites. Check it out: https://t.co/D46uoomedu https://t.co/FgfrvPwiYN @kevinjparkinson @Toyota We sampled Winters Song intro for the Beginning My baby girl ❤️ https://t.co/VlC3wl218j Tonight was amazing!  Thank you Salt Lake City! #SLC #ALegendaryChristmas https://t.co/UsT1rNbJps @cLumberjacks @chrissyteigen Crafty indeed!  Hahaha What a fantastic night!  Thank you, Denver!  #ALegendaryChristmas @ Bellco Theatre https://t.co/jV8s7ph74c So sad to hear about the passing of the great Nancy Wilson. She was a magical performer. I'm so glad I was able to spend time with her and hear her beautiful voice in person. This is me dancing. Perhaps just exuberantly walking. We had a great time, Chicago!  #ALegendaryChristmas https://t.co/sfU2OXCYZp @j_alexandermo @1800flowers Haha. That makes sense Happy to support Kim Foxx for Cook County State's Attorney! https://t.co/Ti4jMzZKaC This holiday season, send your loved ones a Legendary bouquet of flowers from @1800flowers! Buy a bouquet from my exclusive collection and they’ll also receive a copy of my new album #ALegendaryChristmas! https://t.co/cxExSMe6bG https://t.co/WR1jx0Kyyx We had a wonderful time in Milwaukee!  Thank you so much!!  #ALegendaryChristmas @ Riverside Theater https://t.co/w6GAShU75u @AnikaNoniRose thank you!  I have to send you a video of Luna dancing to Princess &amp; the Frog, btw. In case you missed it on #ALegendaryChristmas, or can't wait until tonight to watch it again, the video for #BringMeLove is out now! https://t.co/8xrCnB6YR6 If you missed it the first time or just want to watch it again, tune in tonight to see #ALegendaryChristmas special at 10/9c on @nbc! https://t.co/gPGNaLFDZh @BrookingsInst @chrissyteigen well played, Brookings Gettin’ face-to-face with #GoogleDuo on #PixelSlate this holiday season. Or, you know, face-to-face-to-face-to-face-to-face-to-face. #ad #ALegendaryChristmas https://t.co/HrYIw2STno @macantone @nbc Thanks Mario!! Get all your Christmas shopping done now! Last chance to order from my merch store and have it arrive by Christmas - order by tomorrow! All #ALegendaryChristmas merch is available and find discounts on #DARKNESSANDLIGHT gear. https://t.co/z4GSifusHt https://t.co/EB5cPyr6wa #GetLiftedFilmCo is looking for a young female lead to star in a musical feature film we're producing - if you know someone who would be perfect for the role submit their application to jinglejanglecasting@gmail.com! https://t.co/N602q9mrSW Missed #ALegendaryChristmas TV special? It's coming back to your screens tomorrow night at 10/9c on @nbc! https://t.co/1J7AV4qiUS Hallelujah, I love you so, Indianapolis!  So much fun tonight!  #ALegendaryChristmas https://t.co/ckx3eu5RZx @DafnaLinzer @IronStache @senatemajldr @SpeakerRyan @Comey But. He. Did. The. Same. Thing Part of me is talking myself into saying Bruno or the Weeknd but I'm not sure they neatly fit into the genre. Honestly I don't think there is a king of r&amp;b right now.  Anyone consistently dominating the charts, selling out arenas, etc, a la Usher at his prime. Not a comment on quality.  I think the throne is open right now. @chrissyteigen Oh no they hacked Chrissy's account! @chrissyteigen I must be king of something or I wouldn't be singing on this throne. https://t.co/nYs1ik90Ow Millions of children across the country will spend the holidays without a parent. Together with @LetsFreeAmerica &amp; @SesameWorkshop, I spoke with these children about what it’s like to have a parent in prison or jail. https://t.co/bltbleih9l Learn more: https://t.co/hugyuviCj3 Our President wants to make sure you #GetCovered https://t.co/VyEJJUMW1F @julian_hagins1 Happy birthday! So good to be home!!!!  O-H!  Thank you Columbus!!! #ALegendaryChristmas https://t.co/8KMsars3IA “Wrap Me Up In Your Love” is one of the original songs on my Christmas album #ALegendaryChristmas, and was written with @RaphaelSaadiq and @WayneHector. Get the album now on @AmazonMusic. https://t.co/LpDc1MAGvW https://t.co/QRn7a0Fla5 Thanks for a lovely night at @turningstone!  #ALegendaryChristmas https://t.co/1e0pNcgPLf The perfect holiday gift, new sparkling wine from @LVE_wines is available now! https://t.co/mpd1xpNgIc https://t.co/4JMyBrPjcp #ALegendaryChristmas is now available on vinyl! Get your copy here: https://t.co/S8PpgOujW3 https://t.co/PdMbzr29nW Man, the FOX Theatre was on fire tonight!  Thank you, Detroit!  #ALegendaryChristmas @ Fox Theatre https://t.co/JRO2WImq6A RT @HillaryClinton: Republicans in Michigan and Wisconsin lost elections on Nov. 6. Rather than respect the will of voters, they're using t… Check out last night's performance of \"What Christmas Means to Me\" and #BringMeLove on @FallonTonight!  https://t.co/acKMmbjzU6 RT @FallonTonight: .@johnlegend is rocking Studio 6B with a holiday medley of \"What Christmas Means to Me\" and \"Bring Me Love\"!! #FallonTon… @chrissyteigen 🤦🏾‍♂️🤦🏾‍♂️🤦🏾‍♂️ We're the #1 song on Adult Contemporary Radio this week!  @EspeSpalding #MerryLittleChristmas https://t.co/II3Ua1sNQx Backstage at @fallontonight! 📸 bumper3077 https://t.co/W8LpHtyUKF Don't miss my performance and interview on @FallonTonight! Make sure you're tuned in at 11:35/10:35c tonight on @nbc. https://t.co/aXJzLaP7qI I'll be playing \"What Christmas Means to Me\" and #BringMeLove RT @nhannahjones: This should be the biggest story in the country. This is quite literally democracy being stolen. https://t.co/gE6QWYqx8B Learn the words to your new favorite Christmas song - lyric video for #BringMeLove is out now! https://t.co/MYCuSZrtwa https://t.co/JDcOwCO2Wh @ashoncrawley https://t.co/AK51FOdXcE .@adamlevine what did you do tonight??  you're all in my mentions.  @NBCTheVoice awwwww https://t.co/Zy3uIbIDsk yes, sometimes you gotta get specific... https://t.co/xqkIIiVRPf Great review of our New York #ALegendaryChristmas show!  Don't miss our visit to your town!  https://t.co/GudNW2nu2h Backstage at the newly renovated Met Opera House in Philly!  #ALegendaryChristmas  📸 bumper3077 @ Metropolitan Opera House (Philadelphia) https://t.co/rSxSgVuXWh Tonight was so much fun!!!  I love you, Philadelphia!!!! One of my homes away from home. #ALegendaryChristmas https://t.co/GsrO8PjJWy Thank you for doing this.  Unpaid internships make it so only kids with means and privilege get the valuable experience. https://t.co/83ElMqV2kc Listen to my favorite Christmas songs as I guest DJ on @iHeartRadio this holiday season! https://t.co/O8zeUM5Prh https://t.co/r5mQWqw6ej @ashstahl @chrissyteigen I will try my best to entertain you @jamesrockstm @chrissyteigen Damn you if I have nightmares about this photo Thank you for a beautiful night!  I love the holiday season in New York!  #ALegendaryChristmas https://t.co/dfoIdoUdYi RT @AriBerman: Very important election for Georgia secretary of state tomorrow:\n\nUnder Brian Kemp GA purged 2.2 million voters, put 53,000… RT @staceyabrams: Tomorrow, Dec. 4, Georgia can continue to demand better by electing @Barrow4Georgia &amp; @miller4georgia in the runoff. John… A great holiday gift to yourself!  Make sure you #GetCovered! https://t.co/ziuiP3lEqN Congratulations to the Buckeyes on another big 10 championship! Great win! And Haskins looks like a Heisman winner! Listen to \"What Christmas Means to Me\" from #ALegendaryChristmas on @amazonmusic's #HolidayFavorites station! https://t.co/7fL6gBeCm6 https://t.co/TzujodiYMI I’m taking over the @starbucksmusic Christmas playlist this week! Listen to all my favorites and #ALegendaryChristmas here: https://t.co/cDugL1OJKI https://t.co/rgie4fyOTG 😃 https://t.co/L8rTQaiCpG @yoursturIy @EspeSpalding @YouTube Stay tuned!! In case you missed it on #ALegendaryChristmas the other night, my new music video for #MerryLittleChristmas feat. @EspeSpalding is out now and the full video is on @YouTube! https://t.co/FSFBK2mrzc https://t.co/x4AmfksVOL @prisonculture Exactly. Our kids don't get to be kids Our show was pretty gif-tastic.  The gif that keeps on giving?  I quit. #ALegendaryChristmas https://t.co/hP1qq1wXxU It's Chrissy's birthday!  I love you, my Queen! https://t.co/ihMpExGybC The holidays can be difficult for both children &amp; parents who cannot be with their loved ones. @buildabear has donated bears to @girlscouts Beyond Bars, @still_she_rises, @AllofUsorNone, and the @WACorrections Center for Women to bring joy to families impacted by incarceration. https://t.co/9sEtIUIXLh @NBCTheVoice No way!  John Legend can never be a coach on the Voice!  I will boycott! I went ahead and recorded songs for all the holidays. https://t.co/gq1ZFUWmtP The next best thing to a real kiss from Luna is one through #GoogleDuo. #ad #ALegendaryChristmas https://t.co/QHwWRPx0R0 That was fun!  I'm so glad so many of you enjoyed our little Christmas special.  Love to all of you. Good night everybody!  #ALegendaryChristmas I think we've found our Silver Bells choreography! https://t.co/iGOjXrzCfL Hi, West Coast!  It's time!  #ALegendaryChristmas on @NBC now! @chrissyteigen Hehehehehehe Meanwhile I was live in the DMV tonight!  Thanks to everyone who came out to MGM!  We had a great time!  #ALegendaryChristmas @ MGM National Harbor https://t.co/8Hy2NEwT55 Thank you to @RaphaelSaadiq, the house band, and everyone else who helped make #ALegendaryChristmas with John and Chrissy possible! Now go listen to the entire album! https://t.co/nD26DIliK8 \"It Don't Have to Change\" appeared on my album #GetLifted and really does feature the entire Stephens family - so happy they were able to fly in and sing with me again. #ALegendaryChristmas Is this @ArthurPBS joke old yet? #ALegendaryChristmas This was rigged. #smacdown #ALegendaryChristmas Asking @NealBrennan for his opinion was just a courtesy, I know mine's better. #smacdown #ALegendaryChristmas @Joey2196 @EspeSpalding It's called an homage my friend #BringMeLove is one of my favorite songs off my album and I co-wrote it with my friend @Meghan_Trainor. #ALegendaryChristmas Now that you've seen it on #ALegendaryChristmas, watch the full version of #MerryLittleChristmas feat. @EspeSpalding again on YouTube! https://t.co/FSFBK2mrzc Fun fact: I wasn't supposed to eat this. but I ate it. EVERY. SINGLE. TAKE. #ALegendaryChristmas Don't worry @officialkenan, Luna only hangs up on people she loves. #ALegendaryChristmas Mine's better. #smacdown #ALegendaryChristmas Also, I really do have a @soundcloud with my album on it. https://t.co/j9JRmyxKOH #ALegendaryChristmas Thanks to everyone who let us celebrate Christmas in October to make this happen! They truly didn't know we were coming. But they were prepped that they would be filmed and it was Christmas-related. #ALegendaryChristmas Thanks to my friend and mentor @StevieWonder for playing the harmonica and being on #ALegendaryChristmas the TV special and my new album! Fun Fact:  Stevie always writes his own blind jokes. I guess we forgot to get clothing sponsors for the gingerbread men. #ALegendaryChristmas Tune in now to @nbc to watch #ALegendaryChristmas with John and Chrissy! https://t.co/1sfwDLHthZ Who’s ready for tonight?! \"A Legendary Christmas with John and Chrissy\" starts at 10/9c on @NBC. See you then! #ALegendaryChristmas https://t.co/PlMAgvTvVb You asked, so you shall receive! LOVE hoodies are now available in my merch store! https://t.co/ascIVOkNiK And more Christmas merch is on the way... https://t.co/l8nndX3JgN RT @DarrenCriss: When @johnlegend says hey do you wanna go knock on people’s doors and do some Christmas Caroling- I say hang on Mr. EGOT l… Tune in now to @TJMShow to listen to us chat about all things #ALegendaryChristmas https://t.co/HHhetParzb https://t.co/Lw8hxQUF7e RT @Meghan_Trainor: Had so much fun caroling with these guys!!! @johnlegend @chrissyteigen @janemarielynch @DarrenCriss @RaphaelSaadiq 🎶🎄🎁💚… A beautiful night in Toronto!  Thank you so much!! #ALegendaryChristmas https://t.co/y9tilkNVT7 https://t.co/Nzo712F6vK This Christmas, anything can happen. Tune in to @NBC tomorrow night at 10/9c to watch all the magic. #ALegendaryChristmas https://t.co/UVhpnzBYRy @morningmika Congratulations! This holiday season, we want to celebrate with you. Tune in to \"A Legendary Christmas with John and Chrissy,\" on Wednesday, November 28 at 10/9c on @NBC. #ALegendaryChristmas https://t.co/3TLVq3WAk2 RT @BetoORourke: It should tell us something about her home country that a mother is willing to travel 2,000 miles with her 4-month old son… Wednesday night! Join @chrissyteigen and me for #ALegendaryChristmas at 10/9c on @nbc https://t.co/BZKbcxxtGF @girlapproved_US They are not mobs.  They're asylum seekers traveling together. The president calls them mobs to dehumanize them so it's easier to harm them when the time comes.  The administration continues to act with hate and malice towards these people. We had so much fun in Boston tonight!  A beautiful night at a beautiful venue.  Thank you!!! #ALegendaryChristmas https://t.co/5T8cTcBisM @chrissyteigen @POPSUGAR My favorite!  You posted this to punish me for being on the road, didn't you. @CathyItaliano Yes. He's evil. Period Evil https://t.co/X4A120wZLT Y'all can DVR our NBC special and it'll be a win-win for all of us! DC/MD/VA Have no fear I'll be live in the flesh in Maryland on Wednesday. I pre-taped my Rockefeller tree lighting performance on Thanksgiving Eve. See you soon!  #ALegendaryChristmas https://t.co/BxeEa0FWm7 @cbsfinest540 I pre-taped my Rockefeller performance on Thanksgiving Eve!  I'll be live in the flesh in Maryland! Thank you to everyone who came to @FoxwoodsCT tonight!! I love you, CT!  (nice initials) #ALegendaryChristmas https://t.co/NWWxZPiABm @JGilesComedy Oh they know my every order. They told me what we ordered. I was like oh ok I guess we did haha Ohio St fans all wondering where this offensive line was all season!  #GoBucks Ga❌e Ti❌e We felt the LOVE in Atlantic City!  Thanks so much! #ALegendaryChristmas https://t.co/ML2FywHU36 @chrissyteigen @stuholden @KaralynWest @ClemsonTigers @OhioStateFB Yes we do! @lcrx5 Every singer there was promoting something, my friend. That's exactly why we do tv performances. @cmschiavone Same age as Luna!  She loves dancing to it too! @MeetThePress @mmurraypolitics Why would you tweet this when it's obviously false? RT @Ocasio2018: People are going to die if we don’t start addressing climate change ASAP.\n\nIt’s not enough to think it’s “important.” We mu… It's \"It Don't Have to Change\" from Get Lifted. We're gonna sing it on #ALegendaryChristmas With John &amp; Chrissy on NBC Wednesday at 10pm!  I flew the whole family in from Ohio! https://t.co/cecixT94oL I think I did on my last collab with @sergiomendes? https://t.co/akzW1WdAYi New York to LA yesterday. LA to Atlantic City today!  Who's coming to the Borgata tonight? #ALegendaryChristmas tour is busy this weekend. Atlantic City, Fox Woods and Boston! https://t.co/MRIzarWQIL @NinasCherry You will never find it because I never have @lp_bruce Indeed they did. We play most of the new Christmas album plus plenty of non-Christmas songs from my catalog. All of Me just might be one of them. (it is) https://t.co/b47VK2eIPe @lp_bruce Fun suggestion: relax Sometimes I'll really like a song but it doesn't fit with any of the other songs on the album. Maybe one day I'll just put those random ones out. https://t.co/pO3R29W0tK @Busiswa Richard Bona, Angelique Kidjo I've written in Nashville a bit. You could say it was country, but country and soul are pretty similar songwriting styles, just presented differently.  And I've written with and for rappers, of course https://t.co/tE05FEdfST I don't throw anything away. But I imagine some of them will never be finished or released. I always write too many songs for every album so I can only use my favorites. https://t.co/JYdJ5c4rIN @DianaRoss @ReignOfApril Queen Mini-me + Grandpa Teigen https://t.co/MvK2zuDcBy @ingridmusic Happy Happy Christmas is my favorite so far. So good @zenith5478 Happy holidays!  You seem to be in a bad mood. I hope things improve! @EndP8riarchy Yep!  She kept sneaking bites before we served it! @ingridmusic Thank you, Ingrid!! About to jam to yours on my flight back east! @DCclone To replace the skim My recipe is on Martha Stewart's site.  https://t.co/CHkeN0JWYp. but double the seasoning and use whole milk. They made it healthier than I do. My only job for Thanksgiving dinner was this Mac &amp; cheese.  I won't say how good it was (it was dope tho) but it disappeared fast. https://t.co/MLZ0BPwAJD @macantone @chrissyteigen Happy Thanksgiving Mario! 🙏🏾🙏🏾🙏🏾🙏🏾 @jmc598 @chrissyteigen That looks exquisite! @caseypatterson Because I was robbed of the title on a certain television program! @KamalaHarris Happy Thanksgiving, Senator!! @eveewing @AnikaNoniRose Happy Thanksgiving!! I had no idea the OSU band was there but I was waving at all the buckeye fans in the crowd.  Honestly I was wondering why so many were in NYC but now it all makes sense. https://t.co/ETbKEQP55D Seriously. It's like they were holding on to that screenshot, plotting the shade for 4 years. https://t.co/aFjQ3J0LKX I sang exactly as I would've if you could hear me. I figure that's the only way to believably do it. But I'm not an expert in these matters. https://t.co/jBj37kOPwj True, but... I actually convinced Soul Train to let me sing live when I was on there back in the Get Lifted days. https://t.co/eCbuEQ0cwL @chrissyteigen Savage. Respect the social media team at @Macys Hahahahaha perfect https://t.co/PhmCaiAFxE Fun fact. We all have to lip sync on this parade because the floats don't have the capacity to handle the sound requirements for a live performance. Hope y'all enjoyed it anyway. Know that if you come to my shows, the vocals are 100% live! https://t.co/C2bGj63AF6 Happy Thanksgiving! I’m on the @buildabear float at the #MacysParade and very soon I’ll be performing #MerryLittleChristmas from my new album #ALegendaryChristmas - tune in now on @nbc! https://t.co/nsihSSA58T I pre-taped my Rockefeller Tree Lighting performance last night on a frigid rooftop. This #ALegendaryChristmas marketing plan looked a lot better on paper https://t.co/TXj3Geo7q8 Of course I chose the coldest day in Macy's Thanksgiving Parade history for my first ever performance there! @DawneDeverell looks delicious!  Happy Thanksgiving! @IndieFemme Somebody must have changed it!  Strictly butter for me First promo clip from \"#ALegendaryChristmas with John &amp; Chrissy\"!! https://t.co/IOubV8x2ME Tune in tomorrow morning to the #MacysParade on @nbc where I'll be performing #MerryLittleChristmas from my new album #ALegendaryChristmas on the @buildabear float! https://t.co/SD0d8XqVpJ RT @NAACP_LDF: Before you head home for Thanksgiving, call your Senators and tell them to vote NO on the nomination of Thomas Farr to feder… Tonight at the FOX was absolutely fantastic!  Thank you, Atlanta!  #ALegendaryChristmas https://t.co/EykVt75AS3 @janderlinde It's me! @ArmyMama72 @SahiGomez It's both!  I play a lot of the new album and plenty of my older songs too I recorded a special version of \"Give Love on Christmas Day\" for @Spotify and you can listen to it now on the #SpotifySingles: Christmas collection playlist here: https://t.co/rebGeCD4Wf https://t.co/nWBwgytvGs 😍🎄 https://t.co/kZWPCKVYCn Nothing says #ALegendaryChristmas like chicken nuggets on Christmas Eve. https://t.co/hGkkvvSCWF https://t.co/jd6P5VzH2r Over the last year, I've had the honor of witnessing the growth of @LetsFreeAmerica's inaugural cohort of #UnlockedFutures. In partnership with @newprofit and @BofA_News, learn how these eight entrepreneurs are breaking down barriers to opportunity. #SmallBusinessSaturday https://t.co/yb3SqG0GQB I can't agree with the superlative but thanks for having us, @YOUMagSocial https://t.co/ZVZvLi2JiR Good morning! https://t.co/eTnlQ6aRVh @OfficialCropper It was an honor for me!  Thank you! @WilNorm My friend, the bill has not passed. McConnell said it won't even be voted on this year Tonight in Miami was magical!  Thank you!  #ALegendaryChristmas https://t.co/xLaXDSV2sk RT @Pekas007: @johnlegend #ALegendaryChristmas in miami was amazing... what a show...music, vocals, performance and visual 100% quality A+… More guests announced for #ALegendaryChristmas!  Nov 28 10pm/9 Central on @NBC! https://t.co/op38eJGY60 @BeckyMoleski Nov 28 10pm/9c on NBC! RT @Taniel: I just want to make sure everyone knows Georgia's Secretary of State race went to a Dec. 4th runoff between John Barrow (D) and… RT @staceyabrams: From the bottom of my heart: Thank you.\n\nI am so proud of the movement we built. Together, we redefined the politics of p… Yes https://t.co/l0mgT0jaE2 #BringMeLove is one of my favorite songs off of my new Christmas album and I want to hear your covers of it! Use #ALegendaryChristmas and I'll share some of my favorites! https://t.co/zbu8PNCDwp RT @PeakChiroFL: If you haven’t bought tickets to A Legendary Christmas Tour do it now!  It was simply the best night ever!  Thank you John… Thank you Clearwater/Tampa!  Tonight was so much fun!  A great start to the tour!! #ALegendaryChristmas https://t.co/aGYDtyVkdm #ALegendaryChristmas Tour is finally here and starting TONIGHT! If you haven't yet, grab your tickets here: https://t.co/MZfQeI5fx4 https://t.co/9VhC0zve2z I love this new merch booth!  You can pose in a replica of the living room where we shot the #ALegendaryChristmas album shoot. And I LOVE this new hoodie! https://t.co/t7sIHgFioJ More guests announced for our NBC special #ALegendaryChristmas with John &amp; Chrissy!  https://t.co/N6SKcRaahC Today, my animated short #CrowTheLegend premieres on YouTube and FB. We, @baobabstudios @ms_eagleheart &amp; @nativegiving, created this Native American inspired movie. I hope you love it as much as I do. https://t.co/Wc2GfjqSiU https://t.co/cY4E5sp1z3 About last night:  I went to the @BMI Nashville Awards to celebrate the great songwriter Steve Cropper.  I did a surprise performance of his and Otis Redding's song \"Sittin' On the Dock of the Bay\" for the first time.  So much fun! https://t.co/TwOuqpRgwK My #ALegendaryChristmas Tour is kicking off tomorrow in Clearwater, FL! Get ready for the show by listening to my album and get tickets for your city here: https://t.co/MZfQeImQVE. I can't wait to celebrate the holidays with you! https://t.co/pGOXVmRxhS True, true.  Many more friends to be announced!  #ALegendaryChristmas https://t.co/JcwNl56D4T Heading to Clearwater now!  Excited to start #ALegendaryChristmas Tour in Florida! https://t.co/pV2eo26IZL Excited to announce our new @Netflix show, Rhythm and Flow (@RhythmFlow)!  @Tip, @iamCardiB and @ChanceTheRapper will be looking for the newest talent in hip-hop - head to  https://t.co/IPXrmAHZ8B to audition. https://t.co/z3qxQLHQ8A My organization #FREEAMERICA just made a donation to the Campaign for the Fair Sentencing of Youth.  They're fighting for a justice system that doesn't throw our young peoples' lives away. https://t.co/xLpXfpefdm Last night was so beautiful.  I was able to honor my wife as one of @GlamourMag Women of the Year.  And I was so inspired hearing the stories of the other women who were honored with her.  #WOTY https://t.co/b316P4MIwf https://t.co/96HFLRaYAi I’m in NY for a special show with @iHeartRadio and @verizon! Check out the live stream tonight at 10:30pm ET! #iHeartJohnLegend https://t.co/viZSAAmhJE RT @billboard: Watch @johnlegend perform a moving rendition of @U2's \"Pride\" at 2018 #PCAs https://t.co/r1k431s6bR https://t.co/ScDLLgNnlw RT @BernieSanders: Here is the simple truth. Donald Trump, like his friends in Russia, Saudi Arabia and North Korea, is an authoritarian le… Not only did I voice Crow, I executive produced and wrote original music for the short. I had a blast recording “When You Can Fly”, and I hope you enjoy it. You can hear it both on YouTube and also in VR on Nov 15th! https://t.co/gn7Z19g6bO My new animated movie #CrowTheLegend by @baobabstudios releases on 11/15 during #NAHM, inspired by the original Native American legend. I play Crow, who learns about sacrifice and community. A story we @ms_eagleheart @nativegiving want the world to hear. https://t.co/gn7Z19g6bO @CamHeyward Yessir! It's an immense honor to present Bryan Stevenson w/ first-ever People's Champion Award at the #PCAs. His dedication to fighting for justice &amp; equality has inspired me &amp; many others &amp; made a lasting impact on our country. Tune in tonight &amp; help me celebrate a remarkable individual Sending respect and gratitude to our veterans. #HappyVeteransDay @OhioStFootball Put Tate in the game inside the 10 every time. We need that dual threat in the res zone I'm grateful for our brave firefighters doing dangerous work to save their neighbors Our National Embarrassment can't bring himself to show some empathy to Californians dealing with a horrific disaster. https://t.co/WwLA7UTI8c Thread https://t.co/1DP4wtAmYJ RT @AndrewGillum: Every voice must be heard in this race! If you voted a provisional ballot, make sure your vote gets counted by contacting… RT @ACLUofGA: GEORGIA PROVISIONAL VOTERS: You can make sure your vote is counted. Follow these steps by Friday 5pm.\n\n1. Go to your county e… @itsgabrielleu Amazing!! Congratulations!! New York! I have a special show just for you - enter for a chance to win tickets at https://t.co/LVHbRC2tjr #iHeartJohnLegend https://t.co/EFWde9nv26 RT @ProudResister: “The party told you to reject the evidence of your eyes and ears. It was their final, most essential command.”—George Or… @Barbara35942433 yep https://t.co/ujQIFaznnz If you're curious why this guy was picked for Acting AG.  Oh, and POTUS picked a Supreme Ct Justice who thinks Presidents are above the law. https://t.co/NqUtTjBSbg RT @JuddLegum: Hours after the polls closed:\n\n1. Trump fired Jeff Sessions\n\n2. Removed Rosenstein from overseeing the Russia investigation… The president is a fucking embarrassment. @freewimin Listen to the podcast because things actually changed with Obama when it came to racial attitudes influencing party affiliation. Definitely worth your time if you want to understand what's driving political trends since Obama was elected. https://t.co/Py67lgnC5m RT @JamilSmith: The difficulty that some Americans face when they go to vote remains one of this nation’s central failings. This is somethi… RT @sarahkliff: Hard to overstate how strongly Medicaid won last night, mostly in red states\n—3 states (ID, NE, UT) passed ballots to expan… @ericripert @LeBernardinNY @MichelinGuideNY Amazing!  Congratulations! RT @AriBerman: Huge night for voting rights:\n\nFlorida restores voting rights to 1.4 million\n\nMichigan passes automatic &amp; Election Day regis… Flipping the house despite all the gerrymandering was no small feat.  Despite it being expected by the polls, this is still a BFD. The House has so much power to hold the president accountable. I look forward to some real oversight People worked so hard around the country. Many voted who had never voted in the midterms. That was due to organizing and tenacity.  I'm grateful for everyone's sacrifice. Excited about this too!  Thanks to all who organized and fought for this in Louisiana https://t.co/nKgk2fUXLx RT @prisonculture: Super important for Democrats to spend the next 10 years addressing state based gerrymandering, voter suppression, felon… RT @samswey: 40% of all black men in the state of Florida just became eligible to vote *today.* Think about that. This wasn't a red vs blue question. It was about doing the right thing by allowing people who've paid their debt to society to participate in the elections that affect them and everyone else. I spent some time in Florida campaigning for this amendment. I was inspired by the grass roots efforts and the beautiful bipartisan coalition that worked for its passage. I'm so happy this amendment passed. This is wonderful news and will affect Florida and national elections in perpetuity https://t.co/E3d2mTekA9 RT @Ocasio2018: New York is a state *without* early voting, mail-in ballots, or no-excuse absentee.\n\nYou can only cast a ballot from 6am-9p… RT @staceyabrams: If you are in line to vote, STAY IN LINE. Do not leave your polling place until your ballot is cast. \n\nQuestions? Issues?… RT @shaunking: These 15 states (and DC) allow for same day voter registration. \n\nPlease spread the word. \n\nCalifornia\nColorado\nConnecticut… RT @KevinMKruse: Hey Georgia! \n\nAs you wait to vote in needlessly long lines that are due to either dumb incompetence or deliberate suppres… RT @domtoney: Who’s voting today? Let’s do this!!!!! #GetUpAndVote @johnlegend @RealLindaPerry @TheEraQueens https://t.co/z4wpMJ9Ybz Sing it! @ayana_is , @natalieimani  and @itskerilee !  Catch them singing with me on #ALegendaryChristmas Tour.  #GetUpAndVote https://t.co/6UY9FHu9KA @chrissyteigen Yes. I did. https://t.co/YXYB0SmNP1 RT @LisaLoeb: Haven't voted yet? #GetUpandVote! It's more important now than ever. Thanks to @johnlegend and @RealLindaPerry for spreading… @Julezz_2522 Vote for her opponent if you want preexisting conditions protected! RT @KevinMKruse: I just saw a couple tweets complaining about how people were trying to persuade them to get out and vote this year. \n\nAs s… A handy list indeed. Please vote accordingly https://t.co/nqobvecyhM In May, Ohioans passed a ballot initiative to establish an independent redistricting commission, but the fight for #fairmaps is far from over. Ohioans, on #ElectionDay, vote for candidates who fight gerrymandering. https://t.co/XqCCuFfRM9 @OHDems @MamaKateIsAngry @SherrodBrown @RichCordray Thank you for your hard work!  I met your sister in LA last week! @thedailybeast @kpoulsen @willsommer #blexitsky @andrewscott67 I love Eric! He is doing great work to make our elections more fair through his fight to end gerrymandering. He wants our districts to be drawn fairly so our legislatures actually represent the people Ohio, did you know that EVERY SINGLE state House seat (99 total!) is up for election this year? These positions are crucial for redistricting. Let’s show up for the Democratic candidates running for the OH House! https://t.co/jImG6u6vJQ Great to be back in my home state of Ohio supporting amazing Democrats running for office this year. If you live in Ohio, be sure to vote @SherrodBrown for Senate, @RichCordray for Gov, yes on Issue 1 and Dem up and down the ticket! .@chrissyteigen I'm sorry you keep being harassed by desperate incels.  He'll get all the attention he needs from the FBI https://t.co/rVxSLRWR8k I made a little list of Christmas songs to kick off your holiday season!  Guaranteed to brighten your mood! Listen on @Spotify or @AppleMusic: https://t.co/nD26DI3HSA https://t.co/PddMuHj2nr Watching @Oprah speak so beautifully and passionately in Georgia. So inspiring. #GetUpAndVOTE Brian Kemp doesn't deserve to be dog catcher in Georgia. His efforts to suppress the vote in Georgia have been nothing short of evil https://t.co/m6CwSeZuc6 I spoke to @bustle about the upcoming election, criminal justice reform and reasons to vote.  #GetUpAndVOTE https://t.co/bYHUcNENkz Happy Halloween! Now back to your regularly scheduled Christmas-themed posts. https://t.co/V4GZ70qIjl I'm sorry to everyone who thought I was skipping Halloween - in honor of this wonderful holiday that comes before November 1st, please enjoy this pumpkin carving by the masters at @ManiacPumpkins. https://t.co/kMyWWQifkE RT @nilslofgren: YOUR Right!\nYOUR Voice!\nYOUR Choice!\n11/6/18 #GetUpAndVOTE!\nOur lives and freedom depend on it! https://t.co/JRGzJBvvAK RT @lindiwesuttle: @johnlegend @staceyabrams Another reason I 🗳 VOTED. Georgia Absentee ballot is received! #GetUpAndVOTE https://t.co/5dW0… @randykcox Cool!  Brings back great memories! Another reason I am happy to support @staceyabrams https://t.co/c22OhYRjnc I love it!  #GetUpAndVOTE https://t.co/YUkbABXBvs RT @WillaAmai: #GetUpandVOTE 11.6.2018 !! find someone and sing it loud and proud ! @RealLindaPerry @johnlegend https://t.co/3CQ9IA5i2C RT @gethompson5: @johnlegend @RealLindaPerry @OfficialStarlet @iam_zyla #behold YOUR Right!\nYOUR Voice!\nYOUR Choice!\n11/6/18 #GetUpAndVOTE!… RT @jessygreene: Hope to hypnotize you to vote with this tripped out violin version of a song by @reallindaperry and @johnlegend ❤️💙#getupa… RT @beatiewolfe: Can’t give up on HOPE, gotta #GetUpAndVOTE #Nov6th — Double hats off to @RealLindaPerry and @johnlegend for starting this!… One week til election day!  Vote early or vote next Tuesday!  Your country needs you!  #GetUpAndVOTE https://t.co/tcc6LbH6Fc South Africa!!  I love you!! https://t.co/FnEoq5d2bN @fivefifths You just sing the lumidee song along with it. @taylorlargen So sorry!  I will have my team reach out to you Lovely https://t.co/uclS45rax7 Angel Sanchez is one of millions of Floridians impacted by a law that strips individuals with felony convictions of their voting rights. We have the power this Nov. to restore these rights once and for all. Learn how: https://t.co/8RgyERVdfx https://t.co/fyHNywQp3v RT @TheAtlantic: \"The apparent spark for the worst anti-Semitic massacre in American history was a racist hoax inflamed by a U.S. president… @FD1000 Haha he's an actual Nazi though RT @NewYorker: In the wake of the Tree of Life shooting, it seems clear that anti-Semitism has burrowed into the American mainstream in a w… RT @BarackObama: We grieve for the Americans murdered in Pittsburgh. All of us have to fight the rise of anti-Semitism and hateful rhetoric… @morganonmonday @chrissyteigen It looks fantastic! Paul is still getting used to being in front of the camera, but he is a huge fan of my new Christmas album #ALegendaryChristmas - out now! https://t.co/nD26DIliK8 https://t.co/RGV7qbgNr1 @KrisJenner Thank you Kris! RT @hayleyrbriggs: I told myself i was gonna wait until november 1st to listen to Christmas music, but @johnlegend released his christmas a… RT @Cotyaka_MrKabal: @johnlegend dropped his Christmas Album today, which is all the okay I need to start playing Christmas music!!! https:… RT @MsPettySavage1: @johnlegend John just said, fuck y'all's Halloween and Thanksgiving. It's Christmas time Bitches! #ChristmasOverErrytha… RT @ErinK1993: If you follow me on spotify don't @ me for listening to Christmas music already! not my fault @johnlegend dropped his Xmas a… RT @heathernewm: Me listening to @johnlegend's #ALegendaryChristmas: https://t.co/ijnoDMtTh4 RT @TheJarell: I’m sorry I can’t hear anything over @johnlegend’s new album. https://t.co/ouj08cJcCP RT @mpazitive: Me: @johnlegend couldn’t wait till Nov first to drop this Christmas album? I mean damn. \n*listens to Please Come Home For Ch… RT @ValSantosOnAir: I went ahead and canceled Halloween since @johnlegend released his Christmas album and I've been in the Holiday spirit… RT @TimeLessGazer: @johnlegend really has me blasting Christmas music in October 🤦🏾‍♀️ I love it lol https://t.co/oWu97Y7H3Y Make this holiday season Legendary with my new album #ALegendaryChristmas - in stores and streaming now! https://t.co/nD26DIliK8 https://t.co/ZTCrUM7q5p @Pearl313131 @gwil17 I got it!  Sometimes sarcasm gets lost on Twitter. Sorry if anybody gives you a hard time Haha! https://t.co/rkUcxwSgMg Yep!  I've been doing Christmas since May this year. Recorded it in N Hollywood when it was like 110 degrees outside. But studios have A/C and no windows, so we hung some Christmas lights, had some egg nog and got to it https://t.co/ScvBCHvJLB Yes, changing the album title to A Legendary Generic Holiday now! https://t.co/5E3PHLNCLb I promise, I know it's only October. But some radio stations start playing Christmas music the day after Halloween so we have to be ready!  And I bet if you start listening now, you'll be in a better mood for the next few months. Try it! #ALegendaryChristmas My new album #ALegendaryChristmas is streaming NOW across all platforms! Listen to it here: https://t.co/nD26DI3HSA https://t.co/mQin9jL6C1 @BET @BrunoMars @DanielCaesar @thegreatkhalid @TheRealTank @BETherTV Thank you!! @LEGlawLA His actions back up those words. He has used his official power over elections to actively find ways to target and  disenfranchise parts of the population that might vote for Democrats .@Pepperthai2 became a US citizen today! 100% on her test! https://t.co/LWxRkWoljx Sad when people who run our democracy hope and pray people don't vote #GetUpAndVote https://t.co/unWXCPTgNl Utah, you have the power to elect a government official who is dedicated to reforming criminal justice in your community. Make an informed decision and learn more about district attorneys by visiting: https://t.co/obrc9bO29a #MeetYourDA https://t.co/Qw5vrnOza3 Texas, you have the power to elect a government official who is dedicated to reforming criminal justice in your community. Make an informed decision and learn more about district attorneys by visiting: https://t.co/obrc9bO29a #MeetYourDA https://t.co/TJ5QGoV0NJ RT @PeteMolinari: Doesn't matter what you wear just as long as you are there. 11/6/18 #GetUpAndVOTE! https://t.co/678jIFUmBn RT @xtina: Tuesday Nov. 6th\n#GetUpAndVOTE 🙏🏼💙 https://t.co/6I6DqdrhJN RT @lindiwesuttle: @johnlegend #getupandvote! Send my absentee ballot in! @johnlegend &amp; Linda thanks for the song https://t.co/4HWe5cnohr RT @kelly_clarkson: #VoteMidterms #GetUpAndVote https://t.co/baN2aGhNM5 A new section...  #GetUpAndVOTE https://t.co/b8m205MHuM Beautiful haha! https://t.co/LQNDngKbJH RT @WillaAmai: doesn’t matter what you wear just as long as you there #GetUpandVOTE 11/6/2018 thank you @RealLindaPerry and @johnlegend for… RT @Mookychew: @johnlegend @RealLindaPerry Not so much a new song, but more like the next verse maybe? But hey, #GetUpAndVOTE https://t.co/… #GetUpAndVOTE  I'll retweet some more. Keep posting! https://t.co/Y7PENQdt4F #GetUpAndVote. @RealLindaPerry and I wrote this little song over the weekend. Share, sing your own version, then vote!! https://t.co/tecNP64yYz RT @RealLindaPerry: Hey hey, come together, we can make the world much better, don't give up on hope... gotta get up and VOTE!#GetUpAndVOTE… North Carolina, you have the power to elect a government official who is dedicated to reforming criminal justice in your community. Make an informed decision and learn more about district attorneys by visiting: https://t.co/obrc9bO29a #MeetYourDA https://t.co/jbedDVsg4u https://t.co/JogjpzbSw8 Did somebody say Christmas? https://t.co/tdI1Ken6Kv Minnesota, you have the power to elect a government official who is dedicated to reforming criminal justice in your community. Make an informed decision and learn more about county attorneys by visiting: https://t.co/obrc9bO29a #MeetYourDA https://t.co/WGzbR0OWFh Michigan, you have the power to elect a government official who is dedicated to reforming criminal justice in your community. Make an informed decision and learn more about district attorneys by visiting: https://t.co/obrc9bO29a #MeetYourDA https://t.co/sy2aV0GwH8 RT @danpfeiffer: The Georgia Secretary of State is using his taxpayer funded office to steal an election https://t.co/teI2GX0agm New duet with Wendy of Red Velvet! #WrittenInTheStars #KPop https://t.co/25rAbXUv8P @prisonculture Happy Birthday!  Thank you for being awesome! @NateSilver538 This is correct. Contributing to this now! https://t.co/OeleizZJVY Such a great episode.  @chrislhayes\n and outstanding historian @ProfCAnderson:  Voter Suppression Past and Present\nhttps://t.co/fEoYJiTDam Go to https://t.co/sYJ7F5Pe9s to find out how to vote in your state Chrissy and I voted by mail today!  So convenient. Do it if you can in your state. If not, vote early or on Nov 6!  VOTE, VOTE, VOTE! @ Los Angeles, California https://t.co/uAbeWmc4Y1 RT @SallyQYates: Too much is at stake for our president to treat criminal justice reform as a vehicle for celebrity photo ops. My thoughts… Your vote in the 2018 midterm elections has the power to decide the future of our country. To find out how you can make informed decisions at the polls this November, visit https://t.co/mTRL7IDgNp https://t.co/n0vBYxwYCr RT @jonlovett: This was always the plan. \n1. Cut taxes for corporations and the rich while lying about the cost\n2. Create a massive deficit… My babies are in @voguemagazine https://t.co/1ZxXORwag1 I know it's only October, but Paul and I are already in the Christmas spirit! We've been listening to my version of #MerryLittleChristmas feat. @espespalding non-stop. You can stream it here: https://t.co/fEaNm8hOH5 https://t.co/fJbIirXWvW RT @SarahKSilverman: I’m so sorry I try to give love but this person is human garbage. https://t.co/TBUHesESdh Don't \"some critics say\" or \"both sides\" this story. Everyone knows what's happening and why. Do better, @washingtonpost .  Your headline implicitly accepts the bullshit framing that this has anything to do with fraud. It's intentionally excluding voters based on their race and their likelihood of voting for Democrats.  https://t.co/DqIMr8kcc9 @fivefifths It him @LISCMaurice @freeamerica It was a pleasure! This is a must-read on #MassBailOut efforts. @NYGovCuomo and @NYSenate, I urge you to #EndMoneyBail for once and for all. https://t.co/NoWzXSAGv0 Annnd if you think it's a little early for Christmas music, I get it. In the meantime, check out my duet with @ellamai #EVERYTHING\nhttps://t.co/lCNfYj3xWW It's never too early to get in the Christmas spirit - #BringMeLove and #MerryLittleChristmas from my upcoming album #ALegendaryChristmas are available for purchasing and streaming now! https://t.co/fEaNm80dPx https://t.co/wKgvM63ohP @Henrygda The bipartisan support in Congress was veto-proof, but continue @ramen_girl__ I didn't watch the sideshow today. Not interested @GlennGardner8 The industry groups just had to get together and reconcile their differences. The streaming era means we had to modernize the rules that were written for a different time w/ different technology. Their unity and hard work took time to come together.  POTUS had next to no impact I'm happy Trump signed this necessary bill. I'm grateful to all those who worked to write and pass it. The Recording Academy and other industry groups worked very hard. Secured bipartisan congressional support and got it through both houses. Trump signed his name. https://t.co/DfXQJzrBy4 Today on International #DayoftheGirl I'm proud to join @MichelleObama and the Global @GirlsAlliance to stand up for adolescent girls’ education - because the future of our world is only as bright as our girls. Join us: https://t.co/YZB5WAf3Gi. #GlobalGirlsAlliance https://t.co/BjPIL0wWh0 RT @Taniel: Georgia's Secretary of State Brian Kemp (now running for Gov) has purged voter rolls &amp; is now freezing tens thousands of voter… RT @jbouie: Someone should straight up ask Kemp if he thinks black people should be able to vote https://t.co/xxJuc82n3u Great chatting with @JohnJHarwood https://t.co/LCQswuv9aa RT @jonlovett: HEY! Deadlines today for voter registration in AZ, AR, FL, GA, IN, KY, MI, MS, NM, OH, PA, TN, TX\n\nAnd states w deadlines to… The last day for many states is tomorrow!!!  Make sure you're registered.  Then VOTE like our future depends on it! https://t.co/tb0XLnnyBt RT @jonfavs: “At 3.6 degrees of warming, the report predicts a “disproportionately rapid evacuation” of people from the tropics. “In some p… Hey Georgia.  Make sure you're registered. https://t.co/A9vEwyGR4A @AbbeyRaeV @chrissyteigen Learned that from my mama. Just some extra deliciousness @Yassir_Lester White Supreme-acy RT @chrislhayes: Fully expecting to see Sen Collins and Mitch McConnell and others throw their weight behind ending cash bail after their h… Who's coming to see #ALegendaryChristmas Tour? Tickets are on sale now: https://t.co/MZfQeI5fx4 https://t.co/Re6fwuJ9FO He knows which way to go, haha. Go Mike! https://t.co/pmgzivHXpX Oakland! I've added a second night on the #ALegendaryChristmas Tour just for you - tickets for the new 12/22 show go on sale tomorrow morning at 10am: https://t.co/MZfQeImQVE https://t.co/pbW1qgU6R5 RT @staceyabrams: .@JohnLegend: \"We have to fight to get the right people elected. We have to fight to change laws that are unjust.\"\n\nThank… @mycuzzinvinni 6 originals. 8 covers @BroadwaySings @HLBallroom @jharrisonghee @EdenEspinosa @coltonthewizard @starringaisha @markevansactor @SoleaPfeiffer @coreymach @amberskyez @KristolynLloyd @DeMariusR_Copes @Cristalzheat @itsryanvasquez @sunnybrittney @BurninChernin @raena_white @justmort This sounds fun!  Can I get a recording of it?  What's the song list? I support this protest, but it has been misreported that I will be there.  I never was able to be there.  #CancelKavanaugh https://t.co/ADx45xHHxN I'll be on @allinwithchris tonight on @MSNBC at 8PM ET/5PM PT w/@desmondmeade &amp; @Volzie discussing voter disenfranchisement laws in FL that have affected millions of formerly incarcerated individuals for too long. This Nov., you can restore these rights by voting for #Amendment4. https://t.co/YnpbiS2RUd Thank you, Judge Brown, for speaking out and correcting the record on Issue 1. Like the judge, I support Issue 1 because it will provide safer communities, and more treatment in Ohio. https://t.co/b5BnAZeKka @Mares13Maria @thedailybeast By this you mean to turn my heat down to low? RT @chrislhayes: Seriously, Florida’s Amendment 4 is one of the best, most hopeful political stories in America right now. I’m on the ground in Orlando, FL, advocating for the restoration of voting rights for millions who currently cannot make their voices heard. Voting for #Amendment4 can give the formerly incarcerated the opportunity to express their fundamental rights. https://t.co/A3EHiUunOg https://t.co/l2Ad3FqUKK @MachewsMAGA Um check my Wikipedia page.  I'm not from Hollywood.  I'm from Springfield Ohio @EsquireErnie @AriFleischer If you can't understand the difference between Kavanaugh and Emmitt Till, I'm gonna say a special prayer for you tonight. May the Lord be with you. @AriFleischer are you still getting paid to spin for the White House?  or do you just bullshit for fun now? RT @JamilSmith: Trump mocks Christine Blasey Ford’s testimony at his latest masturbatory rally. The open contempt he shows for her, and eve… I’m proud to be in Atlanta to support @StaceyAbrams in her race for Governor of Georgia. To vote early, safely, and securely by mail, visit https://t.co/HNo1nU2XHX to request your ballot. Let’s make history. https://t.co/7wEsdphqpY @chrissyteigen It's fantastic RT @chrissyteigen: NYC! Come eat!! #CRAVINGSFEST is coming to @NYCWFF! https://t.co/3EhNagKgkp https://t.co/dILiS7jbSf @50fabthings You certainly would (or should) under oath. @PemWelshPeabody @chrissyteigen hahahaha @50fabthings I don't.  Which makes it even more damning that he chose to lie about it. Don't forget to sign up for #ALegendaryChristmas pre-sale! Sign up ends 9:30am local tomorrow and pre-sale begins at 10am local tomorrow: https://t.co/sMYoU5FLwO https://t.co/TyWKrzQjF4 There’s a limited number of autographed copies of #ALegendaryChristmas available for preorder now on https://t.co/z4GSifusHt https://t.co/JeJc9FY5iF This winter, get ready for A Legendary Christmas! I have a brand new Christmas album coming out accompanied by #ALegendaryChristmas Tour! Sign up for pre-sale TODAY only and pre-sale begins tomorrow at 10AM local time. Full dates &amp; sign up for pre-sale on https://t.co/MZfQeI5fx4 https://t.co/WUtaF9eoyd Join me on October 3 at Evans High School Auditorium in Orlando, Florida, to support #Amendment4 and give Floridians the right to vote. Register for your free ticket by visiting: https://t.co/lz428KDGHq https://t.co/FdrzgbuQjl @JeffreyGoldberg @bevysmith @jemelehill @TheAtlantic Yes Jemele! RT @HillaryClinton: \"Some staff members cried when they learned of the move, the shelter worker said, fearing what was in store for the chi… RT @ava: Just gonna go ahead and put this right here. Just set. it. right. here. 👀 https://t.co/9pEKNZ0B5T @secupp @GlblCtzn 🙏🏽🙏🏽🙏🏽🙏🏽 Watch now - I'm live at @GlblCtzn Festival! https://t.co/qL747VlJcs I’ll be streaming live from Central Park today at @GlblCtzn Festival - make sure you’re tuned in at 3pm EST! https://t.co/qL747VlJcs https://t.co/xLaNWGhqSf Tonight at 6:30PM/5:30PM CT, I’ll be sitting down with Lester Holt on @NBCNightlyNews to discuss the @GlblCtzn, and the need for criminal justice reform across America. Learn more about my work to end mass incarceration @LetsFreeAmerica . https://t.co/qecJPNQuyc Join me on October 3 at Evans High School Auditorium in Orlando, Florida, to support #Amendment4 and give Floridians the right to vote. Register for your free ticket by visiting: https://t.co/lz428KDGHq https://t.co/8GgYn1x4Q7 @secupp He doesn't have a right to be one of 9 on the supreme Court. That is a position of high honor and extreme privilege. He has the right to not be criminally convicted and locked up without convincing evidence. It's a different standard. @Yi_Dav2016 @secupp Well, you could understand him lying about, say, sexually assualting someone. But lying about getting very drunk is ridiculous and unnecessary.  All these beers and underage drinking and you never went too far?  Obvious bullshit. @mikedaitch @MICKGUILFOYLE @secupp My belief that the government shouldn't have power over a woman's uterus is very much a moral issue. My belief that a supreme Court Justice shouldn't be a liar and sexual assualter: also moral @TallManShort @US395 @secupp Dr Ford is not absurd and her accusations clearly weren't. Did you watch her testimony? @liberalnotlefty @KLMcFilth @DestructiveChem @secupp These are the sorts of details the FBI investigates to help flesh out the facts and assess the credibility of the accusations.  GOP doesn't want the investigation because they're afraid of the truth. @liberalnotlefty @KLMcFilth @DestructiveChem @secupp Dr Ford came forward before Kavanaugh was even picked, when he was on a short list. That timeline is critical. It shows the party wasn't paying or inciting her to come forward. She knew he had integrity issues and didn't want him to be picked from the shortlist. @MICKGUILFOYLE @secupp The rape question goes to his credibility, integrity, temperament. It's not a criminal case. There is no beyond a reasonable doubt standard. @MICKGUILFOYLE @secupp It is not a criminal prosecution of a rape claim. This is not a rape case. It's a job interview to decide whether or not Kavanaugh should get a lifetime appointment to the highest court in the land. A position that gives him power over all of our lives @US395 @secupp Trump promised he would pick judges that would overturn RvW. He said women should be punished.  And the federalist society is committed to overturning as well.  So are we supposed to believe that Kavanaugh was picked and won't carry out their plan? @liberalnotlefty @KLMcFilth @DestructiveChem @secupp We dont know the extent of the evidence because the claims haven't been investigated. They should be investigated @DestructiveChem @secupp Real, actual, sentient human beings have said they were victims of Kavanaugh and his cronies. The Democratic party didn't make this up. If you want to call the women liars, just say it. @DestructiveChem @secupp Dr Ford accused him with clarity and credibility. The Democratic party didn't. @DestructiveChem @secupp Are you calling Dr Ford a liar?  Did she make all of this up? @JustMaintain @secupp It's about all of it @secupp And the fact that this person who made all of these \"boys will be boys\" mistakes as a teenager can now have the power to force a teenage girl to carry a pregnancy to term is downright terrifying. @secupp I hate his politics. But I'm also resigned to the fact that a conservative without integrity issues will make it to the court, just like Gorsuch did. Kavanaugh is a terrible choice even among conservatives I clearly disagree with @secupp And I don't think we've ever seen a court nominee display such disdain for the other political party. He obviously can't be even remotely impartial. @secupp He lied about his involvement in Bush policy decisions and judge nomination campaigns. He most likely lied about the extent of his drinking and other things he could have admitted to. He's not to be trusted. @secupp The biggest problem with him is that he's lied multiple times before the senate, sometimes about things he needn't lie about. @JasonBrandon8 So we pick based on who's most qualified now? What does that even mean really Raise your hand if you believe there's even a tiny chance Kavanaugh has never had so much to drink that he didn't remember some of the night's events.  He's obviously a liar. People keep saying it's not in the Constitution. That's why we have amendments.  The Constitution can change.  The founding fathers weren't divine. @raythemaverick I'm saying the Constitution is wrong on this point. I know what it says. I know that it's completely ridiculous in the real world too @Aftermath8 The founding fathers aren't divine. They fucked up on this one, among other things And obviously the senate needs to be dramatically changed.  California's representation vs Wyoming is a travesty I haven't workshopped this but it ain't crazy. It's like best actor and best actress categories. We should have a man and a woman representing each district and state to guarantee 50/50 representation. I believe Dr Ford. Thank you for your courage Who coached him to sound like a complete asshole? Your vote this November can directly impact the future of criminal justice in our country. To learn how you can make informed decisions all the way down the ballot, visit the @ACLU's new \"Vote Smart Justice\" website: https://t.co/KfxecWoPxX .@mistyonpointe and I challenge you to do some good. Share your Shopping Cart dance with #FillYourCartForGood and @nakedjuice donates the monetary equivalent of a cart of produce to communities in need. #ShoppingCartDance #DrinkGoodDoGood #sponsored https://t.co/xnux6M2X1v \"It’s no coincidence that many of those who himpathize with Judge Kavanaugh to the exclusion of Dr. Blasey are also avid abortion opponents, a position that requires a refusal to empathize with girls and women facing an unwanted pregnancy.\" https://t.co/sl8KWIjqU9 RT @KamalaHarris: There are three women willing to testify under oath about credible allegations. The GOP continues to refuse to call for a… RT @PadmaLakshmi: I wrote an Op-Ed for @nytimes about something terrible that happened to me in my youth, something that happens to young w… RT @rachelpowers: OMG for the *millionth* time:\n\nThere is NO BURDEN OF PROOF FOR A SENATE HEARING.\nIt is NOT a TRIAL.  It is NOT a legal pr… This must be the men's rights version of the white genocide delusion https://t.co/VUTvFPcLGf RT @repjohnlewis: The right to vote is precious, almost sacred. It is the most powerful nonviolent tool or instrument we have in a democrat… RT @MichelleObama: There's a lot at stake this November. If we stay home, critical issues that affect our families and communities get igno… @nhannahjones Congratulations! This National Voter Registration Day, research the voting rights in your state and make a plan to vote. By making your voice heard at the polls, you can determine the future of our country’s criminal justice system. Call https://t.co/2F1Uc6A3TO to know your rights. #NVRD https://t.co/m79C1jayQV @hughhewitt @politicalwire He's literally the least popular nominee for the court in polling history. I had a great time performing at the opening of the #PalisadesVillage! https://t.co/8WouObsqjZ Reunited https://t.co/flbMiGMvtb RT @ASlavitt: NEW: To pay for detaining kids wout their parents, Trump is cutting:\n\n$17 million from Head Start\n$6 million from the Ryan Wh… RT @itsgabrielleu: Please watch this entire clip. Thank you for speaking for so many of us @CharlesMBlow #MeToo #DearProfessorFord https://… Accountability and \"law &amp; order\" don't apply to everyone https://t.co/TPUkMwabVG RT @itsgabrielleu: I have always used Wednesday's to show love &amp; support to women. Today I do so by standing alongside my sisters. #DearPro… Mmmmmmmm.  Peanut Butter.  #Cravings2 #CravingsCookbook https://t.co/BHgAeH1u4h @Heidialagha A reporter who doesn't know how to use Google. How sad. Who knew my tux would blend in to the background so perfectly? https://t.co/sfc9GOjxlH RT @matthewamiller: If you are a GOP Senator or staffer and you're about to start attacking Christine Ford, maybe stop first and think abou… What can I say on a day like today?  I could talk about the 12 beautiful years I've known you. I could talk about the 5 years of wedded bliss, the 2 wonderful children we've brought into… https://t.co/Bbs0b41jcT Just a little marketing meeting https://t.co/uGt648z7gU Chrissy's new Cravings kitchenware line is coming soon to a @Target near you. And it's beautiful!!! https://t.co/F0kohBZVaw So excited! https://t.co/RK5oTyWsZv @rawrenx We also pay trillions in taxes collectively as a nation and I personally pay millions. Our elected representatives have to make wise decisions about how that money is spent. A higher priority should be placed on education, including paying teachers well RT @StephenAtHome: The Trump administration diverted $10 million from FEMA to ICE. So if you need hurricane assistance, just go to Mexico,… Shameful. https://t.co/RdMRb0wBDY Miles inherited my love for lying on mustard colored blankets https://t.co/Ia3O4MQ20k lovely version of \"Hold on Longer\" https://t.co/14ZdCpqima RT @chrissyteigen: COUNTDOWN TIME! 7 DAYS TIL MY SECOND COOKBOOK “CRAVINGS: HUNGRY FOR MORE” IS OUT!!! Preorder in my bio!! https://t.co/Cy… @ashoncrawley There are SO MANY Emmy categories. They can't possibly cover them in the prime time telecast @ashoncrawley They do the \"creative arts Emmys\" the weekend before for all the less glamorous non televised awards. The Grammys do their non televised on the same day as the main show just earlier. And the Oscars make you watch it all in the telecast (that changes next year) @WhoopiGoldberg @OfficialALW @SirTimRice Thank you Whoopi!  So honored to join you! @RWitherspoon 🙏🏽🙏🏽🙏🏽🙏🏽 @TheChainsmokers 🙏🏽🙏🏽🙏🏽🙏🏽 RT @salamishah: Here's my musings for @nytimes: Serena Williams’s Gift to Naomi Osaka, and Women, at the U.S. Open https://t.co/rw6k30aOf7 RT @LVE_wines: Congratulations @johnlegend on winning your Emmy for #JesusChristSuperstar and completing your #EGOT! \nLittle known fact abo… @aliciakeys 🙏🏽🙏🏽🙏🏽 @chancetherapper 🙏🏽🙏🏽🙏🏽 @TheRealTank 🙏🏽🙏🏽🙏🏽 This. Is. Chrissy https://t.co/sNYDyc6Mq6 Other accomplishments today. We finished mixing the Christmas album. And I had Tyreek Hill in one of my fantasy football leagues. #TodayWasAGoodDay https://t.co/ishNcsaxDt @Miguel Love you bro 🙏🏽 @ava I couldn't have done it without you!  Thank you Ava! @tystiklorius ❤️🙏🏽❤️🙏🏽 @CornellWBrooks 🙏🏽🙏🏽🙏🏽🙏🏽🙏🏽 Just posted a photo https://t.co/VdSdFMbgqS Before tonight, only 12 people had won an Emmy, Grammy, Oscar and Tony in competitive categories. Sirs Andrew Lloyd Webber, Tim Rice and I joined that group when we won an Emmy for our… https://t.co/M0baCz0p5V @MikeBStephens7 Happy birthday nephew!! New York! I’ll be performing with @JerrySeinfeld @Lesdoggg @common and more on Sept. 12. Join me to support @GOODPlusFdn’s important work with low-income fathers and families. Tickets: https://t.co/h36Xfay04G https://t.co/ijuhYxrRlr I accidentally preempted the best part of Chrissy's introduction for me. She got a do-over backstage https://t.co/1CE80buMU5 Be an activist and join thousands of Global Citizens on the Great Lawn in NYC on 9/29. Take action on the @GlblCtzn app to earn your tickets https://t.co/Ify8Mp9JLX https://t.co/SoOalt1BTl https://t.co/m9GDOx9jSp This is like when Michael Scott found out Stanley couldn't play basketball. https://t.co/Ix3vp9Rigm @MarsdenPaulie @HillaryClinton Trump literally promised he would only nominate judges who would make abortion illegal. He said that women who get abortions need to be punished. RT @HillaryClinton: If Brett Kavanaugh becomes a Supreme Court justice, will he help gut or overturn Roe v. Wade, which legalized abortion… RT @BritishGQ: . @johnlegend wins @hugoboss Most Stylish Man. #GQAwards #BossxGQAwards #SuitedbyBoss https://t.co/HhVQSbcvgU https://t.co/q… My first GQ cover!  #BritishGQ #GQMenOfTheYear https://t.co/ELDkByjiTD Date Night at #GQMenOfTheYear #BritishGQ #WhatIsThatVelvet https://t.co/m8b2eo1fZx .@LetsFreeAmerica's Unlocked Futures accelerator provides entrepreneurs impacted by the criminal justice system with the tools they need to grow their organizations. Learn how they are breaking down barriers to opportunity in America. @newprofit @BofA_News https://t.co/iojagt1tmA RT @RatedRnB: Today marks the 5th anniversary of @johnlegend’s “Love in the Future” album. What’s your favorite track? https://t.co/sfdzYrA… Jam session https://t.co/t5nywXuCIU RT @ava: “CNN obtained a court filing Thursday that noted at least 497 kids are still in the government’s custody, and that number includes… Surprise show! I'm on my way to @Heritagefw in LA to play a few songs and drink @LVE_wines rosé. #SummerOfLVE RT @HillaryClinton: There's a lot going on right now—understatement of the year. \n\nThe separation of families and the failure of the admini… The choice couldn't be more clear when it comes to character, commitment to justice and the old could-you-stand-being-around-him test Texas, you have the opportunity to replace Ted Cruz with this gentleman. https://t.co/wgdOD6tvqT RT @shaunking: Since the #BlackLivesMatter Movement began, I have sat at the kitchen tables of nearly 100 families whose loved ones have be… RT @EricLevitz: The Trump administration's agenda on student debt is so corrupt and regressive that it's literally unbelievable. A straight… RT @Emma4Change: #FLVotes #FloridaPrimary VOTE IN THE PRIMARY TODAAAYYYYY \n\n💙 RT @BigBoy: .@JohnLegend is checking in on @Real923LA Tuesday morning 😀\n\nTUNE IN: https://t.co/bEvL3cync8 https://t.co/BNExHPpD3X I had a lovely conversation with @baratunde and @annewoj23 about identity and how much we all have in common.  Listen to the podcast here.  https://t.co/dXXrIb34uN https://t.co/bwgL7PVgay ❤️❤️❤️❤️❤️ https://t.co/e94GG1V2oF @ava Happy Birthday, Ava!! .@JerryBrownGov #BailReform is needed, but NOT #SB10 which replaces the predatory for-profit bail system with a system that threatens to expand unfair incarceration of communities of color. https://t.co/zQ7MZyU15o Jim Crow isn't feeling @staceyabrams https://t.co/MRP9oao5tl RIP to our friend Craig. He produced Jesus Christ Superstar with us and also produced the Oscars when Common and I sang \"Glory\" in front of a replica of the Pettus Bridge. A wonderful producer and a lovely man. https://t.co/pFSSSaabhM Preach https://t.co/Tiw63zU4p9 Massachusetts, you have the power to elect a government official who is dedicated to reforming criminal justice in your community. Make an informed decision and learn more about district attorneys by visiting: https://t.co/obrc9bO29a #MeetYourDA https://t.co/E2uVdaVgbi RT @skantrow: An affirmative right to vote ought to be a baseline Democratic demand until the Constitution is so amended. RT @DrVEnoch: .@johnlegend Hey John! I’m running for Congress in your home district in Ohio. Care to retweet my video and help make sure we… RT @Nadine_Writes: Around 1979, #ArethaFranklin &amp; Smokey Robinson appeared on the Soul Train TV show. Host Don Cornelius - God rest his sou… @questlove I play Day Dreaming several times a week. Every week. Every note, every riff, every scream was so intentional and perfectly executed.  What a musician. What an instrument. Another beautiful tribute from my college English professor @FJasmineG https://t.co/3WHhfm4uQ4 RT @ClintSmithIII: If you read one thing today, it should be this 2016 David Remnick profile of Aretha Franklin. It's phenomenal.\n\nhttps://… Great artists never die. Music is immortal Just listen to the Amazing Grace Recordings for the next few days. RT @NewBlackMan: https://t.co/NAmzqTSqZJ Salute to the Queen. The greatest vocalist I've ever known. 🙏🏽🙏🏽🙏🏽🙏🏽🙏🏽 #Aretha My beautiful boy Miles is 3 months old today https://t.co/BQwp4G1Uwp RT @nowthisnews: Fox News tried coming after Denmark's social safety net. This Danish politician's retort was legendary. https://t.co/VLh1G… RT @SamanthaJPower: So awful. Most of the 559 children still (!) separated from their now-deported parents must decide on their own btwn st… RT @jduffyrice: tomorrow!!! @johnlegend joins us on @Justice_Podcast to talk about bail, prosecutors, immigration, race, trump, and more. i… Florida, you have the power to elect a government official who is dedicated to reforming criminal justice in your community. Make an informed decision and learn more about state attorneys by visiting: https://t.co/obrc9bO29a #MeetYourDA https://t.co/HNsGkpVhCy RT @washingtonpost: Opinion: It’s time for Louisiana to strip white supremacy from its constitution https://t.co/3hSkuwQBm2 @Toure Yeah if she's at zero, we have to introduce negative numbers to measure his credibility Beautiful essay by Stephen Miller's uncle.  Shame on Stephen Miller. https://t.co/ACOeba3bGP RT @JoyceWhiteVance: 1. Here's a little public service announcement about your vote &amp; the November elections. If you live in a state that i… RT @EmmaKennedy: It will never fail to amaze me that America is willing to pay for an imaginary Space Force in an imaginary Space War but t… Issa bop https://t.co/T3DRTlc5kg @ira @chrissyteigen Paul Smith!  Bought them at the resort because I forgot to pack my own @chrissyteigen Get thee behind me, Satan There are a surprising number of people sitting in jail each day, many of whom are unconvicted of a crime, because they cannot afford to post bail. As part of the @ACLU's Campaign for Smart Justice, take this pop quiz to learn more about the broken cash bail system. https://t.co/r1RwbjJ9q1 RT @JohnFPfaff: Elections matter.\n\nThis rarely held true for DA elections, however.\n\nApparently that is changing. https://t.co/8v9SsiJT4U Born and raised in a blue collar family in  \"middle America.\" I went to church camp every summer in that district and grew up an hour from there. But continue supporting the born rich New Yorker celebrity apprentice host in the White House. https://t.co/45YyYTu0MM Happy #ObamaDay. We in Indonesia (where he lived for a few years) toasting our President. @chrissyteigen Hahaha Aprons and rubber gloves. Must be cooking class https://t.co/AU7YdDwZCj RT @itsJeffTiedrich: remember how Hillary freaked the fuck out and had a twitter meltdown because she was called to testify about Benghazi?… There are approx. 4 million residents in Illinois who have a past felony conviction and don't know they are eligible to vote. Sign the #HB4469 petition, led by @ChicagoVotes, to ensure these individuals have the opportunity to express their civic rights. https://t.co/iH7U6WDMg7 https://t.co/J8jB0wTt1u @nhannahjones @chrislhayes This was great. Thanks for doing this America spends so much on weapons, prisons, policing.  Just think if we took this approach to schools, health care, community building. God bless The King.  👏🏾👏🏾👏🏾 @KingJames https://t.co/it3XbHRrNG The NRA represents gun manufacturers. They don't care about gun rights like they care about gun sales. https://t.co/otxTrMVWGQ Vermont, you have the power to elect a government official who is dedicated to reforming criminal justice in your community. Make an informed decision and learn more about state attorneys by visiting: https://t.co/obrc9bO29a #MeetYourDA https://t.co/w5z2GiOlLH Living her best life https://t.co/pWfGPTqMW0 Evil https://t.co/VFoiJtkCgJ \"In fact, under Obama, quarterly GDP growth “broke 2%” 16 times, hit 3 percent or higher eight times, hit 4 percent or higher four times, and even exceeded 5 percent once\" - Think Progress (and any other source with access to GDP data) It seems that Junior inherited his father's ability to make you ask, \"Is he this ignorant of easily googlable facts or just extremely shameless about lying?\" https://t.co/WIn1p6xm0h This is utterly evil. https://t.co/q0CIF53kDZ RT @rolandsmartin: FACTS: Zero Republican Senators in 2018 are willing to fix the Voting Rights Act that was gutted by the CONSERVATIVES on… RT @HeerJeet: Rudy Giuliani is of course right that Michael Cohen has a huge credibility problem. After all, any Trump lawyer is bound to b… Excellent! https://t.co/VmiEhAeESI @andrea_viner The audacity of grope. The audacity of don't drop the soap So many reasons to make sure the Democrats take back the House in November. Add this to the list. The audacity.... https://t.co/JBi19fBvgN Babies in Bali https://t.co/hwSKhNqzFW A lesson in American greatness https://t.co/YCKGzQxnbp via @TheEconomist Just had a great interview with @jduffyrice for this podcast. https://t.co/p0CzUKYRMz Missouri, you have the power to elect a government official who is dedicated to reforming criminal justice in your community. Make an informed decision and learn more about prosecuting attorneys by visiting: https://t.co/obrc9bO29a #MeetYourDA https://t.co/l9VaNxOE4c @brianschatz @AndyRichter FEROCIOUS!! RT @HillaryClinton: Thousands of families who have been separated at the border still need to be reunited. \n\nIn some cases, children have b… RT @JamilSmith: I believe that @staceyabrams is the future. Vote her in, and let her lead the way. My print column for the August @RollingS… RT @sahilkapur: Trump has repeatedly depicted war with Iran an something a president would do for domestic political gain.\n\nHere are four e… RT @PeteSouza: For the record, this is our “favorite President.” https://t.co/tDOIY6nVHd @cinemkr @AndyRichter Excellent question @comma_deeznuts @secupp who is James Gunn?  I'm so confused. @secupp they're allergic to logic and impervious to truth. @secupp oh man. the pedogate weirdos stay in my mentions.  they are an odd bunch. @secupp how many current trump officials use personal emails?  hell, they just found out comey used his personal email for some official business.  non-scandal that had to be blown up to show \"balance\" @JoshDuckBurton @secupp I'm in LA (on break at a video shoot).  It's only 10:40! @secupp 'bittergate\" and \"her emails\" similarly overinflated.  it's like a gas.  any controversy, no matter the size, just expands to fit the room.  when there aren't big scandals, the small ones have to be blown up. RT @secupp: This is awful and unacceptable. Please, tell your lawmakers, they must put an end to this, right now. https://t.co/yFP2OBwIKi @AndyRichter Same @jessetyler @JustinMikita Happy Anniversary!! RT @KamalaHarris: Infants cannot defend themselves. Don’t let this atrocity go unnoticed. \nhttps://t.co/e0lV6KstYo Mr. Putin's Pet wants to change the subject. https://t.co/muUtQP4lI1 @JalenRose @MollyQerim Congratulations!! @mattyglesias @jbouie #FreeThought Asking for a Flint How disagreeable are people allowed to be when their governor is responsible for poisoning their water? https://t.co/nLvb1eapGI RT @JohnFPfaff: This by @PykeA is, like so many we keep seeing, horrifying. Our government is torturing and abusing children—and doing so g… Vote!!!!! https://t.co/OwRtC5mttL RT @JCSTheMusical: 13 nominations = music to our ears. Relive the Emmy-nominated live performance of #JesusChristSuperstar at https://t.co/… RT @FJasmineG: Liberal Blind Spots Are Hiding the Truth About ‘Trump Country’    via @NYTimes https://t.co/mM5meCFl8C RT @PabloTorre: How many games if a player sides with one of America’s enemies against the FBI https://t.co/ElFTrHPitu @JohnJHarwood Exactly. He isn't confused. He is afraid of the truth coming out. RT @DanRather: To GOP officials who are speaking out about today's \"Farce in Finland\" - unless you start putting your votes and subpoena po… Trump needs to be removed from office. He's made it abundantly clear he doesn't work for the American people. Thread https://t.co/n0RojfDBN7 @biggpopae They certainly aren't mad about immigration today! All of me loves allez les bleus?  I will leave now. https://t.co/p4dzG8SbLU We had French toast and champagne for our World Cup brunch 🤷🏽‍♂️ https://t.co/HDoU5KBrWR Congratulations to the French!! RT @ava: By court order, migrating children are being allowed to reunite with family. But, migrating parents must pay for flights and fees… @amycarlson5 Hi Amy!!  I remember my bank teller days! RT @DanRather: The U.S. government must be forced to reckon with this failure. We all must. We cannot allow ourselves or our leaders to for… @josephb41123641 Go Bengals! @josephb41123641 You are correct about my skills as a comedian. The president wakes up every morning, gets dressed, looks in the mirror at his scrotum-level tie length and says, \"Perfect!\" That will never not bother me @GellyRoll82 You butchered the spelling but who's counting @ReignOfApril Thank you April! @jenngroh09 @chrissyteigen Enjoy!  Thank you! @iamtikasumpter Thanks Tika!! @salamishah @EW Thank you Salamishah!! This is an appropriate gif for 13 Emmy nominations https://t.co/dA1ztaLVLM I'm so proud of our Jesus Christ Superstar team!  13 Emmy nominations! We really had so much fun working on this together. So happy for everyone involved. @ava Ava!  Thank you!  🙏🏽🙏🏽🙏🏽 Such an honor know you and to be a part of your beautiful work Grandmas in Malibu https://t.co/D7a9lIiYXb @DarrenCriss @antoniobanderas @Jeff_Daniels Congratulations!  Outstanding work! RT @chrissyteigen: 13 nominations for Jesus Christ Superstar this morning! John got two emmy nominations! If he wins, he will complete his… 🙏🏽🙏🏽🙏🏽 thank you!! https://t.co/qvEPZJxLD2 My new guitar tech https://t.co/pRV8ZtLFdI I am strongly in support of the chicken and pancakes movement. May chicken and waffles soon meet their defeat https://t.co/3jFptOCuoD Why don't you just come clean and quit calling all these men who looked up to you liars. https://t.co/raf2665zEK Definition of real news: calling a bunch of sources so you're confident that you're getting to the truth. Definition of fake news: making shit up to fit your narrative. My fellow Ohioan seems to be a bit confused. https://t.co/raf2665zEK This redistricting reform conversation doesn't grab a lot of headlines but is critical to making sure our government represents the people. https://t.co/yXDAGqp3AG #FamiliesBelongTogether #ReuniteEveryChild https://t.co/qiT2xZi42d #BeTheGeneration to end extreme poverty and join artists and activists to honor the life of Nelson Mandela at FNB Stadium on 2 Dec. Learn how to earn your free tickets to the @GlblCtzn Festival: Mandela 100 at https://t.co/524cdBG62z https://t.co/xJoSrsosJ2 RT @Mikel_Jollett: Donald Trump’s campaign manager IS IN JAIL.\n\n5 members of his campaign have PLEAD GUILTY to charges brought by the Muell… RT @naima: We’re taking the “long way” back home so we could stop in Montgomery to visit the lynching memorial. Found the counties we knew.… RT @Ocasio2018: New Rule: anyone that was cool with the GOP inventing $2 trillion out of thin air for freebies for people with yachts that… so relieved to hear this! https://t.co/PaYW3yflVV No but I did invest in the Michael Scott Paper Co https://t.co/jDyQpaDy7f @8Tailor1Made6 Hahaha. Loverboy! RT @jonathanchait: We think know where the Trump-Russia collusion story ends. What if we don't? https://t.co/HijdOwmAkP Today, I am proud to share @LetsFreeAmerica’s #UnlockedFutures series, which showcases the 8 entrepreneurs who are actively breaking down barriers to opportunity. Thanks to @NewProfit and @BofA_News, cohort members like Will have the opportunity to pursue their dreams. https://t.co/bPwq18EXlU This is outrageous https://t.co/d6wGHI085e My little Miles https://t.co/NlsYWgNInm @SamanthaDRS @chrissyteigen It was her idea indeed Celebrating America with the red, white and rosé!  #SummerOfLVE https://t.co/QaCy6ty86z @chrissyteigen I usually civil war after showering .@verainstitute and @NewAmerica are taking action to help reunite children with their families. The Immigrant Connection Project allows parents to track and locate their children, while connecting them to legal services. Learn more: https://t.co/fLhkMS2qNH #KeepFamiliesTogether RT @eveewing: Teachers - a meaningful thing you can do right now is ensure that your students know how truly unpopular Dr. King’s actions w… Making Wine!  @lve_wines @forbes https://t.co/nzcQ16QYie RT @SenGillibrand: Take @realdonaldtrump at his word. He wants to “punish” women for exercising their reproductive freedom. He promised to… RT @chrissyteigen: @KingJames welcome to LA! Friday is sunset rosé, laser facials on Monday. the rest of the week is running into people yo… @chrissyteigen @LVE_wines @LVE_wines @LVE_wines #Preach https://t.co/sDhqmgRD2Z RT @chrissyteigen: There are 600+ #FamiliesBelongTogether events happening TOMORROW. I’ll be speaking and introducing @johnlegend in downto… Grab a bottle of @LVE_wines and get ready to learn a thing or two, @tastemade invited me over to break down some common wine vocab. Watch it now on their Facebook or YouTube channel. https://t.co/R5G8wugqOy Park shenanigans with Lu https://t.co/Y3Ruio1dRd @GinoA797 @POTUS I don't hate you at all!  Trump is an awful person.  He makes it abundantly clear everyday. I don't know you though.  I'm sure you're lovely. RT @SheilaYM: @johnlegend Trump, Kim K, parenting, and oh yes, wine: https://t.co/0TV1WfdA5I @naima Wow. Never even considered it RT @Sifill_LDF: I implore you to direct some attention to Congress which has the power to make @SecAzar account for these children &amp; provid… RT @chrislhayes: The modern GOP is basically Steve Bannon, Steve King and Stephen Miller on one side engaged in a project to preserve and e… @jwpetersNYT The president has repeatedly, specifically called for violence against his political enemies. No Democratic elected officials have. Zero. @jwpetersNYT You're a journalist.  Don't say she incited violence when that's clearly not what she said. RT @jonfavs: The only way to stop Trump from packing SCOTUS with more Trumpists is to win the Senate. \n\nHelp @RosenforNevada, @kyrstensinem… @prisonculture I am stunned @prisonculture Hahahahahahaha he couldn't be serious Keep preordering Cravings 2!! https://t.co/LOmXoYQIKR America’s corrupt money bail industry disenfranchises poor communities of color &amp; capitalizes off of incarceration. Learn how @LetsFREEAMERICA and @ColorofChange are partnering to #EndMoneyBail once and for all. https://t.co/k4wt0ieLbq @TylerLedbetter2 If I ever ran for office I would be happy to release my taxes like every president in recent memory has. What is Trump hiding that makes him want to break that tradition? Please do the same in your testimony to Mueller. And release your taxes! https://t.co/CAwnlJVO4c Let's make a deal with the Trump Administration. Reunite all these families immediately and you can go out to eat wherever the fuck you want. Yup https://t.co/L0ywLjE9lO Cravings, the sequel, is on its way!  Pre order it now! https://t.co/a8JSw9ZVaL @kelly_kov @secupp Cool. Your food probably sucks anyway @Jim_in_302 @secupp I actually think it will work on some of them. Some will be more defiant but some will want to resign and get the stench of Trump as far from them as possible. @secupp If she doesn't want to be held accountable for the administration's evil, she can resign and denounce it. @secupp Her boss is talking about an infestation and invasion by animals and rapists, etc. Intentionally dehumanizing Latinos so that he can more comfortably visit harm upon them. While tearing their families apart and interning them in tented camps  This is Nazi shit. Fuck politeness. @secupp Bottom line is that I'm very comfortable with a non violent form of social censure being visited upon people who implement and defend such intentionally harmful policies. Far less pain is being visited upon Sarah et al than these families at the border. Shame on the whole lot @secupp Who are these hypothetical persuadables hanging on Maxine Waters' every word? Luna and Grandpa (and a stuffed animal whose name we shall not speak) https://t.co/1cGpXOSw44 RT @RonaldKlain: To everyone who has tweeted back, \"Not me, I can PROVE I'm a citizen\" -- you miss the point.  Without due process, who wil… RT @JuddLegum: We are now having a lively debate on the question: What is the appropriate amount of courtesy to show to members of an admin… RT @rosadona: inspired by @chrissyteigen and @johnlegend’s recent ACLU donation, I’m donating $200 to @RAICESTEXAS — $100 for each member o… RT @originalspin: Ladies and gentlemen, @JohnLegend, in perfect pink, singing #LaVieEnRose at the unveiling of his LVE Rosé. #SummerOfLVE h… RT @chrissyteigen: my husband, John, asked me to post this because… https://t.co/mPQiXIUIXK So excited to finally present to you something… https://t.co/Ba7Eb2pEnM RT @FastCompany: .@JohnLegend opens up about how making wine is like making music https://t.co/SRqvPcEnjV What ‘Law and Order’ Means to Trump https://t.co/goitEfzEsr RT @AvivaDautch: I’ve seen several tweets comparing this to Nazis / The Holocaust and saying things like “this is how it begins”. I teach H… RT @samstein: translated: thank you dad, for creating a humanitarian crisis that you refused to solve for days, blamed on others, and said… RT @RepDanKildee: We shouldn't congratulate @RealDonaldTrump on being forced to end his own cruel policy that separates children from their… RT @mlaurahuss: Reminded today of this amazing piece by @DennisRewire for @Rewire_News. \"Miller’s naked espousing of white power ideology a… \"This Juneteenth, that is the daunting threat to American democracy—not only the opportunism of a would-be tyrant but the elastic morality of those who rationalize his actions.\" https://t.co/utx2WqNisA RT @SteveSchmidtSES: Homeland Security Secretary Nielsen is responsible for executing this immoral child separation policy. Where exactly i… RT @JamilSmith: I wrote for @RollingStone about Trump’s family separation policy, his admiration of brutal dictators, and how both things f… RT @nhannahjones: There is no joy from those of us who pushed back at so many in mainstream media when they insisted Trump’s campaign promi… Powerful writing by @AdamSerwer. https://t.co/X0C9o2GflN RT @SethAbramson: (THREAD) Donald Trump and Secretary Nielsen are LYING about how our justice system works to justify tearing impoverished… RT @danielsgoldman: The irony of the Trump admin enforcing misdemeanor unlawful entry because “all laws must be enforced” when he pardoned… RT @chrislhayes: More than a year ago, @allinwithchris obtained exclusive notes from a meeting in which Trump officials discussed implement… RT @Sifill_LDF: Listen to @cecmunoz in this thread. https://t.co/TWIS79tYGw Please follow my work on ending money bail, ending mass incarceration, ending juvenile incarceration #KeepFamiliesTogether https://t.co/hcXPSjETfR Happy Father's Day to my dad, Ron Stephens… https://t.co/Nq4LQ8ElZN @reaghanhunt Donald J Trump, Donald J Trump Jr. RT @saladinahmed: if you think stealing someone’s baby is a reasonable response to them crossing an imaginary line on the ground you are ei… Seriously, fuck you. Reunite the families at the border and we can talk about father's day. https://t.co/bbG0gVqfzq Thanks to everyone who gave! Over $1M dollars from over 20k people!! https://t.co/O5fRYSQRbg I am honored to celebrate Black Music Month and be in the company of music icons who have generated more than a billion spins. To mark the occasion I created this exclusive playlist filled with music that has inspired my musical journey. I hope you enjoy: https://t.co/p7hPx5pFet https://t.co/hKY3AenDcm Stopped by @tastemade to test out some of the internet’s most popular (and slightly questionable) wine hacks. Watch the full video on their FB account and grab a bottle of @LVE_wines to try them for yourself! https://t.co/50gsgLG5bz Join me and @NationalBailOut this Father's Day in our fight to reunite our nation's families and end the injustices committed by the money bail system. https://t.co/7AvxO6mztf RT @SherrodBrown: When I was Secretary of State, we set up voter registration sites in high schools, food banks, in the Bureau of Motor Veh… RT @Yamiche: Sarah Sanders is repeating over and over again that it's the law to separate immigrant children and from their parents. \n\nFact… Happy birthday, @realDonaldTrump https://t.co/WVnUhYDPJk RT @SenBobCasey: I have cosponsored legislation to end the practice of separating migrant children from their parents. Only @SpeakerRyan an… RT @laurenduca: This is what that piece of garbage means when he says \"Make American Great Again.\" It almost seems like an understatement t… @salamishah @janellenlewis @Rutgers_Newark Congratulations!! Luna is my best audience and biggest fan, so obviously I had to write a song for when I'm on diaper duty.  Sing it with me now... #StinkyBootyDuty #PampersPartner https://t.co/7iaZy43q1m RT @NewYorker: \"No one, least of all Kissinger, could have missed her point: You and I were the same as each other, the same as the Syrians… Oklahoma, you have the power to elect a government official who is dedicated to reforming criminal justice in your community. Make an informed decision and learn more about district attorneys by visiting: https://t.co/obrc9bO29a #MeetYourDA https://t.co/ecLkPEGyH3 Ohio, it's time to reform our criminal justice system. Contact your speaker, @SpeakerRSmith, at (614) 466-1366 to encourage him to call HB 394 for a vote, which would ensure children are given age-appropriate sentences. Learn more: https://t.co/Ff1KieXh08 RT @Sifill_LDF: The President of the United States is celebrating the decision in a case that allows voter purges in Ohio as a personal “wi… RT @kenklippenstein: Feel like we shouldn’t need lifehacks just to be able to vote \nhttps://t.co/hqnsGVhEaU RT @genebsperling: $7 billion is about the size of just the 2018 tax cut for 5 of largest 10 pharmaceutical companies. It’s 1/4th of what W… Wild Saturday celebrating #nationalroséday https://t.co/XPJ3QzypN0 RT @ajplus: Listen to Anthony Bourdain's powerful words about covering Palestine. https://t.co/c3XoDzKE8X RT @brianschatz: Whatever your political party or your views on the size of government or social issues or foreign policy or Roseanne or th… RT @chrissyteigen: In my deepest, darkest post-partum depression, I would have personally never called a phone number. If John or my doctor… Malcolm Jenkins is a true patriot.  Fighting for justice is an act of love. https://t.co/3ZiKEWPWj2 RT @paolamendoza: A child is a child\nno matter what country \nthey were born in\n\nA child is a child\neven when they cross the\nborder\n\nA child… RT @jonlovett: Right now important thing is for everyone to vote and vote with a provisional ballot if your name is not on the list because… Vote in your primary today, Californians! Today is election day and @JonesWright4DA is running for District Attorney in San Diego. She wants to end mass incarceration, disrupt the school-to-prison pipeline, and serve our most marginalized communities. Everyone get out and vote! She is the change we need. https://t.co/8qUw48Z0Yv RT @goldengateblond: In hindsight, we should’ve seen this coming. https://t.co/lss96GmRfc Friday night fever https://t.co/06yxYcBCwL I am an emoji https://t.co/syXNM3g2Xp RT @jonfavs: In 3 California House Districts, Democrats could get locked out of competing in the general election because of the top-2 jung… Wow. Terrible officiating to end that game. RT @bcsproul: In Roseanne’s defense, it’s hard to know the difference between racism that gets you fired versus racism that gets you electe… Good piece on how the president should be using pardons. Right now it feels like a cross between an Apprentice casting and a preemptive signal to all who might flip on him https://t.co/pEdFPx6G4w @rileyjsilverman Ok. I'm definitely doing this next time RT @jonfavs: This piece by @Timodc is fantastic, and everyone who works in media should take it both literally and seriously. https://t.co/… I sat down with @PodSaveAmerica to discuss #MeetYourDA and the many ways local prosecutors shape our communities. Listen to our discussion and learn more about the primary and midterm elections: https://t.co/npEK8cv6jz RT @rtraister: Sarah Huckabee Sanders is upset about \"silence from the left\" re Sam Bee calling Ivanka a \"feckless cunt\" for swanning aroun… Elections matter!  Expanding health care availability matters https://t.co/WF02FmIYA9 Prosecutors have the power to end mass incarceration in communities across the country. Learn why your vote matters by visiting: https://t.co/obrc9bO29a #MeetYourDA https://t.co/8JnQPcDa5I RT @DanRather: This number should shock and outrage all Americans. This is a national disgrace. We must investigate and get answers. #Remem… RT @HeerJeet: I don't understand why this isn't a bigger story. https://t.co/j68RpkG577 Maine, you have the power to elect a government official who is dedicated to reforming criminal justice in your community. Make an informed decision and learn more about district attorneys by visiting: https://t.co/obrc9bwrhC #MeetYourDA https://t.co/2AKwVOpyK0 RT @chrislhayes: Please watch this and share it \n\nhttps://t.co/OPgLx2Omhz RT @brianplydon: @danpfeiffer I always imagined this presidency ending with authorities closing in and Trump escaping the White House via h… @rolandsmartin @hautesimons @iamshametral Of course there are no receipts because it hasn't happened. I realize there's a temptation to group all of us together, but facts matter. First post-Miles date night! https://t.co/c4tJrzs4yH Thread. https://t.co/fhLmOCUEnZ RT @jonfavs: It is not a law. Separating children from parents at the border is a new Trump Administration policy. It was not policy under… @RyanWil6klub @chrissyteigen Nice! RT @radleybalko: It isn’t easy for a man to rip a screaming child away from his mother. Most of us couldn’t do it. This is where “animals”… RT @votevets: Yesterday, @realDonaldTrump LIED to troops about pay raises.\n\nToday, Trump LIED to America about his admin's own cruel policy… @PureManhattan But.... I don't follow him. Never have. I'm more bothered than I should be about the repurposing of \"spygate\". This name will always apply to bill belichick and his sneaky ways. Plus Trump is a fucking liar. https://t.co/z07AigZVTF RT @jonfavs: It’s wild that we treat Trump getting caught in a lie as some revelation when he lies nearly every single day. Big lies. Small… RT @tedlieu: Dear @realDonaldTrump: Your Administration made the policy change to separate children from their parents. If you don't have t… RT @jonfavs: Many Trump tweets have enraged me since he took office. This may be the worst. He is flat-out lying about the most cruel and i… Sing!! https://t.co/jHkMBYSLWr RT @Olivianuzzi: Helpful piece from @JohnJHarwood putting various aspects of the Russia saga in context https://t.co/M3puueLGEI @bomani_jones Not to mention an entire union caping for them afterwards RT @JohnJHarwood: in case you wonder why some African-American athletes would kneel during the national anthem https://t.co/mZjH9H61lJ RT @michaeleaves: The irony that this video comes out on the same day that the NFL announces policy intended to prevent players from bringi… RT @JamesSurowiecki: The NFL's new anthem policy should be to just stop playing the national anthem before games. https://t.co/F945tPufFv California, you have the power to elect a government official who is dedicated to reforming criminal justice in your community. Make an informed decision and learn more about district attorneys by visiting: https://t.co/XhItsI9hNG #MeetYourDA https://t.co/rlP7s5Ypl8 America’s corrupt money bail industry disenfranchises poor communities of color &amp; capitalizes off of incarceration. Learn how @LetsFREEAMERICA and @ColorofChange are partnering to #EndMoneyBail once and for all. https://t.co/cvMxR6mGpC #EndMoneyBail https://t.co/U5y1PvPyZf Primary day in Georgia!  Vote, Vote, Vote! https://t.co/ewophJ2EYN RT @AdamSerwer: People say there are a lot of Trump scandals but there’s actually only one. https://t.co/xWqmHaLkab @JustOGG They are.  But they are not a big problem, relative to other gangs and other types of murders and deaths.  For the commander in chief to devote so much of his energy and rhetoric to this one particular gang is odd. \"Instead of intervening to heal or prevent the trauma these children have endured, too often we sentence them to die in prison.\" \n @OHRGOPCaucus\n @OhioSenateGOP\n @OHHouseDems\n@OhioSenateDems\n@theCFSY \nhttps://t.co/bKSG1KpAwy Makes you wonder why the President has become this particular gang's biggest promoter. https://t.co/u3oUGFlCKc @jemelehill Congratulations!!! RT @KamalaHarris: Californians, this is your last day to get registered in time to vote in the June primary. Don’t miss this chance to make… RT @davidhogg111: I keep reading this and laughing. Just think about that the President of the NRA is a man that Illegally gave guns to ter… Hommmme https://t.co/d5lAwScGm6 @happydesertrat *ideology .@chrissyteigen did somebody say short ribs? https://t.co/805SHkx6H1 Thank you #BBMAs for having me back to perform #AGoodNight! And if you haven’t seen it yet, go check out the official music video - captured entirely on Google Pixel 2. https://t.co/lDZl3ofkOc #ad #teampixel Backstage at the #BBMAs2018 with @BTS_twt https://t.co/6zLl1uCKgZ True, true. https://t.co/b3XogUkW6l Tonight I'll be performing #AGoodNight on the #BBMAs - tune in at 8pm EST on NBC to watch! https://t.co/dkAnHIvo7G RT @jonfavs: Until one of these right-wing conspiracy theorists can tell us how the FBI tried to sabotage the Trump campaign by announcing… L.A. is home to the largest jail system in the world - it’s time to make a change. Sign the petition &amp; support the @reformlajails ballot measure to bring public accountability &amp; transparency to the Sheriff’s Dept. https://t.co/sNn9x45Rhm RT @chrissyteigen: Hello, world! This is Miles Theodore Stephens -… https://t.co/YXSKLNHQTr Tomorrow night I’ll be performing #AGoodNight at the #BBMAs! Live on NBC at 8pm EST. https://t.co/0SZ45luNYV RT @WillieGeist: I always think about the victims’ parents on these nights. You pour yourself into your child with every bottle in the midd… RT @EricBoehlert: 34 people have been shot and killed on US campuses this year. \n\n35 US soldiers have been killed in Afghanistan during 201… @Pixielele As soon as we pick a name! I recently realized my bio is a lie. I have two relatives named Arthur. Both chose to be called by their middle names, but their first names were indeed Arthur. I apologize to all those I've hurt.  I'm still not related to THAT Arthur @BrooklynDecker We were watching it in the labor and delivery room haha. Too funny and too real. A whole lot of Americans' ancestors brutally enslaved, beat, lynched and raped my ancestors. A lot of the same folks quick to call other folks animals.  What does that make you?  The answer is that we're all human. And some humans do really fucked up things. https://t.co/XBiyHNhUQR @elliottpatsy1 Some are education related charities, some that deal with criminal justice reform, some that deal with feeding the poor. @OluwaSirdam When did I support evil?  If we want to prevent evil we need to at least confront the realities that led to it. People don't commit crimes because liberals are too soft to call them animals. @OluwaSirdam We are the product of a bunch of decisions, including plenty of our own.  But we all have parents, neighborhoods, governments, etc. whose decisions help shape our future too. @Beard__Chase no, I'm saying some innocent children grow up to be gang members.  do you dispute this obvious fact? @KentBrockman13 nope.  but they're human. nazis were humans.  kkk members human.  the people who do the absolute worst things are still human.  calling them animals may make us feel better.  doesn't make it true. Dehumanizing large groups of people is the demagogue's precursor to visiting violence and pain upon them. It makes it easier to destroy their families and much worse. And we should particularly interrogate the role of American policy in helping to make MS-13 the organization it is now. But it's much more honest and challenging to realize they were all babies once and think about what in society, their home life, etc took them from baby to violent gang member. And then to think about collective action we could take to mitigate these conditions Even human beings who commit heinous acts are the same species as us, not \"animals\". I'm in the hospital with our new son. Any of these babies here could end up committing terrible crimes in the future. It's easy, once they've done so, to distance ourselves from their humanity RT @GavinNewsom: A reminder that Trump also referred to:\n- Mexicans as “drug dealers\" and \"rapists”\n- Haitians as having AIDS\n- Central Ame… @saks @SaksService been on hold this long waiting for a manager to resolve my problem that I've been on 4 calls to resolve over the last week. https://t.co/KO9lU5O3zt @saks @SaksService I'm having an absolutely annoying customer service experience trying to get my car seats redirected to the proper address. Hit me on dm so we can discuss I had a cousin try to raffle off tickets to have \"Christmas Dinner with John Legend\". So, yes. https://t.co/rttOblUcks RT @chrissyteigen: Somebody’s herrrrrrre! 🍼🤗🍼🤗 RT @Sifill_LDF: Just so we remember, this is how it begins. https://t.co/8tsPMEbszx @jbouie I wonder if you've tried Shake Shack's chicken sandwich. It is excellent. Chrissy and I just voted by mail for California's primary! Californians, if you're not registered already, do it now!  Deadline is 5/21. The primary matters!  Make your voice heard!  https://t.co/E72gzDjz6b https://t.co/jANRSpE9WG RT @chrislhayes: Is it the official position of the Israeli and US governments that lethal force is justified for unarmed protesters who ap… In honor of Mother's Day 🖕to John Kelly and anybody else making light of destroying immigrant families https://t.co/7wKxwaIAGU John Kelly is an asshole. https://t.co/bQ8MdTiJVC RT @BrandonVDixon: Check out my new video #WeAre featuring @Dwattswords! Join the #WeAre movement! Downloads benefit @youngnewyorkers. They… Shame on John Kelly https://t.co/xAF2XcP8T7 Luna's Mommy's Day look!! https://t.co/COsWnULwAn Happy Mother's Day to my wonderful wife Chrissy. I see so much of… https://t.co/tHc85o3cxf @secupp I didn't realize these were charitable organizations. Good on them! \"Let Them Eat Trump Steaks\" https://t.co/Y8xLTUJzf4 Oregon, you have the power to elect a government official who is dedicated to reforming criminal justice in your community. Make an informed decision and learn more about district attorneys by visiting: https://t.co/Cq8uS8f79D #MeetYourDA https://t.co/n4tSubbCIJ And it's delicious! https://t.co/IFsfHshkf9 \"I Have a Few Questions for Gina Haspel\" https://t.co/pgoyOgGaKf Real John &gt; A.I. John https://t.co/dX8eq4rUGN @kifleswing My bubble is green. My phone is #GooglePixel2 Well. The Google Assistant doesn't do EVERYTHING https://t.co/5qlO1nFhwE RT @BarackObama: There are few issues more important to the security of the US than the potential spread of nuclear weapons or the potentia… RT @jonfavs: The President’s “accomplishment” today is making it easier for Iran to re-start its nuclear weapons program. \n\nFor this, he’ll… Today, join me in thanking our nation's teachers for their dedication to giving students the tools they need to achieve their dreams. Learn how LRNG Innovators are redesigning learning to shape the lives of students across the nation. #ThankATeacher https://t.co/TFmBrMTP9P RT @johnlegend: Great conversation with the good folks at @VanityFair in the @littlegoldmen podcast https://t.co/gRhXkEJCwy Great conversation with the good folks at @VanityFair in the @littlegoldmen podcast https://t.co/gRhXkEJCwy With #GoogleDuo, I can video call with my son before he's even born! #ad https://t.co/n2HlM2uU15 RT @salamishah: My latest for @nytimes:\nNo, Bill Cosby and R. Kelly Were Not Lynched https://t.co/lACO28LKMa #metoo @snakesgould @chrissyteigen Google duo works on both Pixel and iPhone! RT @profblmkelley: Our ancestors deserved better. A fuller look at my take on Kanye’s comments. https://t.co/x6Ei4zNNVB Californians, you can determine the state of safety &amp; justice in your counties. Thanks to @ACLU, @ColorOfChange, @PICOaction, and @RockTheVoteAF, you can make an informed decision on your district attorney candidates before June 5th. Visit https://t.co/fTJ8EFXWEg to learn more. RT @diallo: So happy. Been waiting years for a network to step up and give Bashir and I a sketch show. Thank you @IFC and @johnlegend and @… RT @BBMAs: #JOHN_BBMAs 05.20 ON NBC\n\n_User: @johnlegend /CONFIRMED https://t.co/f5A0tIh5ek Prepping for a new arrival! https://t.co/zohWkPCK2I @naima They'd run into the school shooting unarmed too @heyheyjanee @chrissyteigen you literally have no idea what you're talking about @ClintSmithIII Facts Wishing a happy #CollegeSigningDay to the class of 2022! I'm proud to be a @Penn graduate, where I learned skills that shaped my future. I know college will do the same for you. #BetterMakeRoom https://t.co/pm5qrUz4Vt RT @deray: Kanye’s rhetoric continues to fuel the racist right-wing folks who believe that black people are responsible for their oppressio… RT @profblmkelley: Haven’t watched the whole Kanye event today, working my way up to it. I will say, that a milder version of the “slavery… RT @HeerJeet: 1. Harriet Tubman never said that. 2. This fake quote is actually pro-slavery since it implies that slaves deserved their con… RT @marclamonthill: There has NEVER been a moment in history when Black people didn't resist slavery. Some did it by jumping off ships. Som… RT @ava: I’ve had it with @KanyeWest + @RKelly using the imagery of lynching as rebuttals re: their dastardly behavior. Evoking racial terr… Congratulations to everyone involved in this amazing show! https://t.co/ftQyZPay5f RT @chrissyteigen: Last night’s feast! Gumbo, chili shrimp, fried chicken, crab cakes, cabbage and ham hocks, mac and cheese, cheddar bay b… RT @HeerJeet: This is a fair-minded &amp; super-informed thread on how the 2 major USA parties have evolved on racism. Of possible interest to… Earn our votes, not by calling us slaves, but by actually passing laws that address our concerns Forget the past for a moment.  The GOP can prove they're the party of civil rights right now. The voting rights act reauthorization. Equal rights for LGBTQ. Stop the Confederate nostalgia Etc etc.  They control the entire fed govt. Be the Civil Rights party! https://t.co/BX3mx7Yjti @thecjpearson @cthagod True! And then all the segregationists and their ideological descendants eventually became Republicans!  The solid south of the Democratic party became the solid south of the Republicans. White southern vote is almost exclusively GOP. Facts bruh. But the party claiming to be the party of Lincoln is living in the present?  Looking forward to 1863? https://t.co/wseZ0Gnzb5 @LilRo627 Done. I stand with the women of #timesup\n#muterkelly. https://t.co/B0yaRj7zdZ @ShellieMac52 The typical Republican usually focuses on small govt/strong military/ low taxes then throws in a few dog whistles about \"states rights\" and welfare queens and inner city crime. But Trump led with bigotry and made it a core of his campaign @ShellieMac52 No I didn't. I didn't agree with a lot of Bush's policies but Trump led with bigotry and made it a core theme of his campaign. Bush did not. Co-sign. https://t.co/Sm8TdmDfRv @SusanDV True. True. Maga's gonna be really disappointed if Kanye ever finds out about their policy positions. https://t.co/x0D2ie1Kt2 Nice!! Thank you, audiences at Tribeca! Can't wait til everyone else can see it! #UNITEDSKATES #GetLiftedFilmCo https://t.co/UD4swYX7MH RT @Emma4Change: my hero  James Shaw Jr. https://t.co/BRnuYEURdv @Philosopher_Dad @kumailn @chrissyteigen At escuela taqueria in LA, yes. Otherwise, soft @kumailn @chrissyteigen Coolhaus was the name of my a cappella group? I don't know about you, but calling a bunch of adult black folks who are freely choosing to vote based on their interests and values ignorant slaves seems a little, um what's the word for this?? https://t.co/GYtsleo2Nu RT @JamilSmith: Ranked-choice voting, @briebriejoy argues persuasively, would address both the concerns about African American allegiance t… @kumailn @chrissyteigen Coolhaus cookie ice cream sandwiches are perfection. Don't @ me unless you agree I'm exactly right @jphilipmettias It was directly related to him trying to limit immigrants from black and brown countries and take more from Norway. He said it himself. @jasehyatt93 @kanyewest @chancetherapper @RealCandaceO Why are you asking me to debate some woman I've never heard of. Is this the Candace that wrote Sex and the City?  Is it Murphy Brown? @jphilipmettias Listen to my ebro interview. I went into detail. @JessieJaneDuff @lionsmds @theglobaluniter @NRA @kanyewest @chrissyteigen Thank you! You can show me all the individuals you want. I'm sure they are wonderful people. The NRA's agenda is to sell more guns and stop any meaningful gun safety measures. You are a danger to America. You are a danger to law enforcement. https://t.co/yIAbotNU8i and it was FANTASTIC https://t.co/EY85FWxktO We did not, however, talk about my new single.  Did I mention I had a new single?  haha. #AGoodNight We discussed the infamous text exchange, why policy matters, why black people tend to vote for Democrats, the history behind our party loyalty (hint:  we ain't slaves), and how we can remember our history and still be fly. Had an excellent conversation with my brother @ebrointheAM!  Listen to all of it here!  https://t.co/WxCZ5bGEBm @BernardKerik @majority4_trump @NRA Police in nations without our addiction to guns almost never have to worry about being shot. And they rarely resort to shooting civilians. The NRA's only mission is to sell more guns. They are dangerous to police. Spent an amazing evening with Kiehl’s celebrating the launch of their sustainability platform last night! Follow @Kiehls and #KiehlsMadeBetter to find out more soon. #KiehlsPartner https://t.co/n5HjDCPAGK Just like Trump to slap his name on something someone else built and take credit for it. I know fact free thought is a major pillar of maga but here's a little chart showing how black unemployment went down dramatically under Obama (after Dubya's financial meltdown) and has continued going down a little under Trump. So we do thank our President Obama for this! https://t.co/Nl0ySJkUt4 Based on the flood of maga in my mentions, they think Trump saved America's economy. And that black folks, in particular, should be grateful to our racist president for our low unemployment rate Hope to see you as Georgia's next governor! https://t.co/4MEiwa8jVP I believe in redemption for the formerly incarcerated. But quite odd that he would choose to lecture me on respect for the law. https://t.co/ndCIxzyexI I wonder what makes life more difficult for police. That we have so many guns per capita in America or me being upset when cops get away with murder.  The NRA is a danger to this nation and to the police. https://t.co/dn1NfFLhIP @beaburns @kanyewest @chrissyteigen Google Pixel @jfreewright Well deserved, brother! RT @JulianCastro: This Administration wants everybody to sacrifice except themselves. Chartered jets, first class seats, extravagant dining… King James!!! And I'mma retweet this ad because I need a break from this shit https://t.co/m7m4n8rcAE Anyway, y'all need to come to Montgomery and see this memorial The defining trait of Trump's campaign and political profile was his embrace of white supremacy.  He made it clear every time he spoke. Some serious cognitive dissonance to ignore that for the other x% you might find appealing. I guess I agree with &gt;1% of anyone's thoughts though I love that great, brilliant artists have the power to imagine a better future. But artists can't be blind to the truth. They see the statistics about black applications for real estate or loans or employment being turned away because their name was Jamal and not James They know their family was destroyed by deportation or incarceration. They know their loved one was denied safe harbor because of their religion. They know their son or daughter was shot because their skin color evoked fear Far too many people don't have the luxury of closing their eyes and ears. They feel it in their lives and can't act like what they see and know doesn't exist. I imagine there's some comfort in imagining a future without racism and projecting that onto the present. Thinking if we just deny the truth, it doesn't exist. If history is erased, we don't have to deal with its consequences. However... RT @ericripert: UNBELIEVABLE night @CityHarvest Gala - Humbled + awed by the overwhelming generosity that raised $4.6M++!! Xtra THANKS to o… Thanks to #GoogleDuo, my stylist is always on-call. #ad https://t.co/UqrysVpBYC RT @jemelehill: So in all the breathless excitement of Meek Mill being free, let’s not lose sight of what happens to those who do not have… RT @prisonculture: If you been meaning to contribute to the Ida B Wells monument but haven't yet had a chance, you can definitely do so her… Proud to help celebrate the opening of this important memorial today in Alabama  https://t.co/SBdT03KC8B My beautiful, generous wife was honored with the Heart of the City Award tonight because she's helped raise so much money for @CityHarvest.   Her speech was gracious and hilarious and we had a blast.  Thank you for all you do, @CityHarvest! https://t.co/B5SZmKLcpb @naima it looks weird, but I bet that idea would be delicious in the right chef's hands. Please stop calling the police on black people who are just trying to live. Please. Stop.  Police shoot us for no fucking reason at all. Please. Stop. https://t.co/HOqZ6t76ca Save #AGoodNight to your @Spotify to watch an exclusive behind the scenes video about my writing process! Unlock here: https://t.co/qIEBwwgcqA RT @ClintSmithIII: Today Alabama observes Confederate Memorial Day. Here is what Alabama wrote when they seceded from the Union in 1861. Th… Timely tweet https://t.co/djaVRIRlB0 Praise the Lord https://t.co/EwqtnDt50e I played Jesus and wore sneakers. https://t.co/1ODxtBoqAv I dont wear sandals!  I have tried them before and found they make every outfit worse. At least for me. But carry on with your sandals, everyone! https://t.co/8QFZD4zvrK RT @JohnFPfaff: Excellent, excellent piece by @jduffyrice on how state-level district attorney associations effectively lobby to gut and th… @alistagnitta @chrissyteigen When I was 5! Want an exclusive behind the scenes look at the making of the #AGoodNight video? @Shazam the song now to unlock! https://t.co/nPjTSZwBnk RT @JamilSmith: Follow the whole thread. https://t.co/iMGPCLYCeu @jming17 @common Me and @Bilal Thanks for the love @iHeartRadio! Listen to #AGoodNight on their New R&amp;B Weekly playlist here: https://t.co/xrIXLwNDoY https://t.co/UQqs5gmyAR Today, I checked in w/ the inaugural cohort of @LetsFreeAmerica’s Unlocked Futures at #ASUGSV2018, and continue to be inspired by their work. In partnership with @NewProfit &amp; @BofA_News, these entrepreneurs are breaking down barriers &amp; building successful organizations. https://t.co/uOlBeZRHXt The only way to build just, equitable, &amp; thriving communities is by giving every young person freedom from systems that hold them back &amp; the opportunity to unlock their potential. Today, I spoke at #ASUGSV2018 about the role that justice plays in transforming our communities. https://t.co/FZD2End3vm RT @IjeomaOluo: The only thing shocking to me about the racism of @Starbucks employees is how shocked people are by it. \n\nY'all have no ide… Thank you, @GovMalloyOffice, for closing all youth prisons in Connecticut and paving the way to reform our country’s broken justice system. https://t.co/l463hzSDBJ Happy birthday Lu! https://t.co/kGY9jHEMgA @foxandelephant @chrissyteigen Fried chicken and Mac and cheese. (My recipes), stove top, chrissys garlic mashed potatoes and gravy, smoked ham hock and cabbage recipe from genius kitchen, jiffy cornbread I've partnered with @Airbnb to curate a list of #AirbnbExperiences designed to have #AGoodNight - one of which is an intimate concert with me featuring @LVE_wines! Check the site to see when more tickets are available: https://t.co/rBDdcCemaZ https://t.co/1kekC0p1D3 RT @CynthiaNixon: Now that public opinion has shifted on marijuana, rich white men like Boehner and companies like Monsanto are trying to c… Annnnd..... she said her first “Ellen”!  @TheEllenShow https://t.co/3f5A7wJNqZ Hey @TheEllenShow!  First of all, Luna loved the show. Still working on her clapping on the 2 and 4 but that will come.... https://t.co/suJoOXh1Qo RT @TheEllenShow: .@JohnLegend is spectacular. This was a good day for a good night. https://t.co/g7FBGtuKt5 Tune in to @TheEllenShow today to catch my first live performance of #AGoodNight! See when the episode airs in your city here: https://t.co/mLvuoskK0H https://t.co/Lpm8IbiUVD @MRS_LEGEND1 @SashaSloan and @raye. They co-wrote the song as well! RT @eltonofficial: Bittersweet to hear because of George but also so beautiful. @johnlegend is making ‘Don’t Let The Sun Go Down On Me’ his… The Grammy concert honoring the great Elton John airs tonight on CBS at 9/8 central!  I covered… https://t.co/GbcUupWMLR RT @neilmeron: #ThankYou @nbc for touting all the amazing critical response for #JesusChristSuperstarLive In Concert #Blessed @johnlegend @… @MsSan211 Hahaha oh man. He does kinda look like me. He probably gets it all the time. @MsSan211 I wasn’t. I gotta see pics of the impostor though! @Cronnor_ @chrissyteigen Moncler “Dada’s singing!” #AGoodNight https://t.co/RL8cq5CwU3 Last night’s #AGoodNight premiere party with google!  Art by @rubenrojas https://t.co/z1HquLph1J @scottl850 Nice!! I know it’s gon be #AGoodNight in Times Square!  spotify https://t.co/c5cSBLqY9w RT @pandoramusic: .@johnlegend and @bloodpop's \"A Good Night\" is exactly the feel-good vibes we need to kick off the weekend. #FridayFeelin… Yes!  Cameos by @JayREllis, @skelechiwatson and @YaraShahidi! #AGoodNight https://t.co/ryicQr2fGn RT @RollingStone: John Legend presides over a club love story in the new video for \"A Good Night.\" Watch here https://t.co/ON6K8ECZRx https… Thank you to all of my friends who helped make the music video for #AGoodNight! We had so much fun and it looks so good! All filmed on a #GooglePixel! Check it out here: https://t.co/lDZl3owVFK #ad RT @TIDAL: Let @johnlegend and @bloodpop make your day with their new song “A Good Night”: https://t.co/bo5eNFG1E1 https://t.co/mQC9vrujzH @chandibretz @Spotify But i did!  I just told you! It’s #AGoodNight on @Spotify! Listen to my new single now!  https://t.co/lg5DEhQI8E Your spring bop has arrived. My new single #AGoodNight feat. @BloodPop is out now. https://t.co/BO4TA02bZp https://t.co/W9BASyI0yx Revisiting this performance of Pride in honor of #MLK50. https://t.co/lpFIFXgZsO via @youtube RT @samswey: This bill to change the California police deadly force standard is the most important legislation to address police violence i… @MarquisBW @breakfastclubam Coming. Soon! @JohnLegere Done! RT @GQMagazine: #JesusChristSuperstarLive ruled, and you should go watch it https://t.co/Wh0qD9IaIh https://t.co/TWxbI4QdZI @questlove Already happened. @MishaGreen Thank you, Misha!! An honor to meet you and perform your work!! https://t.co/I5LnaVCVuX RT @MuslimIQ: In Texas\n\nEthan Couch (White Man)\n•Drove drunk &amp; underage—Killed 4 ppl—0 prison\n•Violated parole by drinking—2yrs prison\n•Now… I love my wife https://t.co/Q1Y1hIZpJr I had so much fun tonight!  Thank you to our beautiful team!  Such a talented group put this show together. I’m honored to have been a part of it. #jesuschristsuperstarlive West Coast, #JesusChristSuperstar is on now! Make sure you're tuned in to @nbc to watch. https://t.co/A7YjUOrSEm #JesusChristSuperstar is live now on @nbc! https://t.co/zLlXAIZEeW Final pep talk from Luna! https://t.co/2TXi79RmI2 While preparing for @JCSTheMusical, themes of redemption have been at the forefront of my mind. I’ve seen what happens when we punish and let fear drive how we treat each other. When we support and invest in people, we can build healthy and strong communities. #FREEAMERICA https://t.co/2KClYo0xDD RT @JCSTheMusical: Practice makes perfect. Our superstars are putting the final touches on their performances in these rehearsal photos. #J… @brian__burks Imma go with @KingJames here That feeling when #JesusChristSuperstar is finally happening live tomorrow! https://t.co/EvuWMqDmpb @TedNeeley Thank you, sir! You’ve set the standard!  🙏🏽🙏🏽🙏🏽 Preview Sunday’s live performance! Listen to me, @SaraBareilles and @BrandonVDixon singing songs from #jesuschristsuperstar!  https://t.co/guq6l5lC2c I joined forces with @skelechiwatson of This Is Us to surprise @DramaClubNYC members w/a backstage visit to @NBC’s @JCSTheMusical! Watch us meet these performers &amp; talk with them about how to turn their passion for theatre into pathways for success. https://t.co/1mZcibFjeK Join me live in concert with @SARABARElLLES, @alicecooper and more April 1st on @nbc for a special performance of Andrew Lloyd Weber’s #JesusChristSuperstar. Hear my performance of “Gethsemane (I Only Want To Say)” now from Masterworks Broadway here: https://t.co/dlJNDOnXBh Still so proud of this record! https://t.co/9hsxPQcWv2 Getting ready for the last supper! Hope to see you there, this Sunday on @nbc. #JesusChristSuperstar https://t.co/GqqdEGbT3S RT @neilmeron: First image of @johnlegend as #Jesus wearing the #CrownofThorns #JesusChristSuperstarLive In Concert #EasterSunday @nbc http… Sneak peek of Gethsemane #JesusChristSuperstar https://t.co/astS0tuUis RT @JCSTheMusical: The wait is over! \n\nGet a sneak preview of Sunday's production of #JesusChristSuperstar with this performance of \"What's… RT @JCSTheMusical: Join Superstars @TheGlennClose, @johnlegend, and @Lin_Manuel in honoring one of theater's most celebrated composers, ton… RT @chrislhayes: US gun culture, astronomically high rates of gun deaths and gun violence, and police shooting unarmed citizens are all par… RT @jbouie: “It’s impossible to look at the cruel and insane experiment America has run on its black residents and say anything useful abou… This Sunday, join me as we perform one of the greatest stories ever told. #JesusChristSuperstar https://t.co/NUohHlu15R Luna’s on set! #jesuschristsuperstar https://t.co/vioAKtj3LB @virgilabloh @deray Congratulations! @BreakMirrors @neilmeron @nbc I do not approve this message @mayne_jon @nhannahjones And Jeff Sessions has been fighting for civil rights his entire career. @mayne_jon @nhannahjones LOL RT @benwikler: Today was the first lockdown drill at my son’s kindergarten. They called it “the silent game.” \n\nAt his request, he and I wi… Good night, Bangkok! #darknessandlighttourasia https://t.co/McWWrLn4ne @lovelifeandyou2 Pancakes all day M.C. @pepperthai2!  I’ll find out what she said later @ BITEC Bangkok International Trade &amp;… https://t.co/KGPNcHZQ4Y The last night of the tour!  In Bangkok!  Thank you to all my Thai fans!  Thank you to everybody… https://t.co/8cWeeyYG4p RT @JoyAnnReid: The Austin bomber’s victims deserve our attention. Stephan House’s family say they still don’t feel safe.  https://t.co/tMW… Manila was so much fun tonight!  Thank you!!! #DarknessAndLightTourAsia https://t.co/L49IZ6OT7M Excited for Manila tonight!  Who’s coming to see me at Araneta? @GlitterSqurly Let me know when you need another snow day. @GlitterSqurly Oh my. @WilbrosLive Happy to be back in Manila!!! @ReignOfApril @joshuadubois @VPIconsulting @BrandonVDixon @SaraBareilles @nbc 🙏🏽 🙏🏽🙏🏽🙏🏽🙏🏽 My first show ever in Taiwan 🇹🇼!  Incredible night!!  Thank you!!  #DarknessAndLightTourAsia https://t.co/ajk4wnDU7d @werockallnight Take a deep breath. Everything’s alright. Thank you to all my Malaysian fans!  We had a great night at Genting Highland!!!… https://t.co/xzI6IEX3ze RT @ScarRoseRussell: \"When you become a parent your camera roll gets taken over by your kid.\" Watch the fabulous @johnlegend go through his… RT @TheSTStyle: REVEALED: Inside the men’s fashion issue, multi-award winning artist @JohnLegend talks fame, fatherhood and of course @Chri… Excited to be on this week’s cover of @theststyle! https://t.co/iEh7QfoisZ Wisdom from @Sifill_LDF on the folly and likely tragedy of arming teachers:  https://t.co/75CEcvvntt Tonight was amazing!!!  I love you, Seoul!!!  🇰🇷 #DarknessAndLightTourAsia https://t.co/9qdyp8g5HB Love and support to all of our young people marching for their lives.  Shame on anybody suspending these kids. https://t.co/AF6x1MU0t2 Mood @ Seoul, South Korea https://t.co/En4YSZxWek RT @billboard: \"Jesus Christ Superstar Live\": Exclusive rehearsal photos of John Legend, Alice Cooper &amp; Sara Bareilles https://t.co/y0OlZys… Another wonderful night in Tokyo!  Thank you so much!! 🇯🇵 #DarknessAndLightTourAsia https://t.co/25fV3lo8VR"}