{"tweets": "#HappyDiwali to everyone. May your lives be lit up and happy. https://t.co/3ppOAvhTmd So you finally settle down on your soft bed, with your softer littlest one &amp; say, “let’s watch something new today...on @NetflixIndia ...” and this banner pops up!! &amp; the littlest one quips...”papa it’s not new...it’s just you!! “ Well... https://t.co/ncu2RA74h6 We have come a long way baby!! https://t.co/ZdiVqIWcFE यह हिंदी में भी है ना??? शुक्रिया https://t.co/Wvan3TTzyq Thank u @MeerFoundation for the initiative of #ToGetHerTransformed and best of luck and health to the 120 ladies whose surgeries are underway. And all the docs who r helping us with this noble cause. https://t.co/gO43Og218A Feels like forever, seems like yesterday....Nearly three Decades and Dearly three kids old. Beyond all fairy tales I tell,  I believe this one, I have got as beautiful as beautiful can be! https://t.co/3qHwP7kjWx As always @Letterman so  erudite...so eloquent...”You don’t even know, eh, may be you do know, but this is eh, I don’t know, you know what I’m talking about...” my most cherished intro for any public appearance...love it. https://t.co/8qHwtcs9zY Thanks again @karanjohar for The Dust of Gods jacket. Will never be able to match your Fashionista sense of style...but trying....( somebody get me my heels!! ) https://t.co/XndrBrvk3j #ChangeWithin And here is https://t.co/AfAs0uCyfq the short by everybody’s favourite Director...Thank u @RajkumarHirani @RHFilmsOfficial for making me a part of it. Thank u @narendramodi for hosting us &amp; having such an open discussion on #ChangeWithin &amp; the role artistes can play in spreading awareness of the msgs of The Mahatma. Also the idea of a University of Cinema is extremely opportune! https://t.co/kWRbNk3xzo They say clothes don’t maketh the man...the man maketh the clothes etc...but the truth is whatever makeths the man is maketh by the woman!! Though have to add the Baazigar jeans were quite a riot!! https://t.co/DFXuIVD9Jb @SGanguly99 Congratulations and all the best for your new and exciting innings at @BCCI  .\nLike always I am sure you well excel at it, like you do in every role. Keep the love flowing. Keep the positivity multiplying. Keep yourself Happy...always. Everything is as beautiful as you want to see it. Love you all... https://t.co/dhyGWKBDsl Thank you for your hospitality and warmth. Had a great time and really look forward to some wonderful stories in films from the Kingdom of Saudi Arabia. All the best for Vision 2030 https://t.co/G3ZSzt0LEy Khan, Damme, Chan at the #JoyForum19. The joys all mine as I got to meet my heroes. \n\n@JCVD @EyeOfJackieChan @JoyForumKSA https://t.co/bwvmmJa2wy Wish my friends @Atlee_dir &amp; #ThalapathyVijay &amp; @arrahman all the best for this one. Like a Chake De On steroids!! https://t.co/pzvpQ3Imko Well tried boyz. Teams’been kinda outta sorts this tournament but still some brilliant individual performances. Well done skip @KieronPollard55 &amp; @SekkugeRSL wot an innings. @DJBravo47 &amp; @Bazmccullum take the boyz out dancing to nite! Shooting for @ICICIBank  Been sometime since I went so ‘Gerua’ https://t.co/lXDA3ffAtl The most fun I’ve had being interviewed. Thank u so much @Letterman for being so gracious and all happiness. U r a gentleman sir ! Also @netflix &amp; @NetflixIndia  for having me over at NY.          https://t.co/3OK6B3plm3 Ok all. Need to go now. @gaurikhan birthday so will pass on all your wishes to her. Lots of love to you all and was good to hear from you on #AskSRK BE WELL. Be happy. And don’t forget to pray. Awesome https://t.co/SLap0VhEpu Have a good show https://t.co/gYZNc7lyJ7 Kyon Birthday pe gift doge? https://t.co/ndjbWvm9p4 Have a good life https://t.co/Cou1horo2T Yeah what a drag! https://t.co/QAzjIh6Tli Thank you. Maybe I should do a movie called Doc 5 ! https://t.co/91jpnxE1fw No routine is the routine... https://t.co/8EsmGR9cht Very good. https://t.co/stp8zUqLex Love you https://t.co/EHQN0FdxnA Yes lovely https://t.co/IoKZ3tQpDJ Black coffee https://t.co/DnP6YqefUi Of course!! My command over the language is so good!! https://t.co/Gi7oLgiwhv Maine bhi suna hai. Tumhein kuch aur khabar mile toh dena... https://t.co/m7y5sEVk39 My friend. https://t.co/0WFjM1FLca Salaam https://t.co/qkw4M6ele6 Thank u https://t.co/rYOWGsCy3m If you have Hair like mine, you can’t be any other way... https://t.co/duMrfovusS Bechara CA akela reh jayega.. https://t.co/NW9Dg6B4ml https://t.co/wzWFiycsLb https://t.co/OqpSNWsYFX Please do well. And don’t use me as a reason for doing well either...study hard that’s all https://t.co/ywaK1eZfII Train your kids the same please... https://t.co/QJ1BpsWbZy Why hints, you will know the actual film when it gets started. https://t.co/hS5CN2tDQc Thanks for your concern and inputs. https://t.co/XfLLp9IAio Better than me for sure.. https://t.co/kYu4KoO0b8 May she get well soon. https://t.co/N1VqgGEWHC Arre kitna jale pe namak chidhoge!! https://t.co/KOUdo7h4zI Try another channel na!? https://t.co/zxxnkEztQd A girls just gotta be happy.. https://t.co/9eQ8tNtCGZ Thank you https://t.co/PBYXeiACMr So well nuanced. So felt...quietly screaming... https://t.co/21Jzkr19CE Ha ha. Main khud Bollywood hoon! https://t.co/XzfLaLwG0a I really enjoy it actually. https://t.co/8EPGGTlwFx We will..we will https://t.co/YYqWeihWcS I love him. https://t.co/emq18i0xoM I think jumping over a camels back....it broke mine! That was like the ‘last straw’ https://t.co/ICUz1NIvSr Insha Allah will come https://t.co/vrCX99wAeg Pyaar Zindagi Hai... https://t.co/zxOt0xErCB Love to Rhea https://t.co/oAG7LW47Bl Will bring Abram when he is legal age and see you soon. https://t.co/aEkAyxEsrC Thank you saved the pics and will print them out and keep in my room https://t.co/qVHjjSra6d Congratulations. Girls are lovely...Masha Allah https://t.co/7J60WAlTDm Next long outdoor I will try and finish it. https://t.co/y3wcZSXzcI Very enticing offer...ha ha. But why do we have to say bad things to each other....when niceness also costs nothing! https://t.co/MrcKhPdHDs Thank you that’s sweet....Pics do overcome time space and reality. https://t.co/Nc9Hn7vvCt Flourishing... https://t.co/tQprhEPxc9 Love to you too NZ https://t.co/xL2yKxwMF6 I inspire myself to go to bed in the morning after being awake all night!!! https://t.co/Q3662KAKtr As soon as I get his dates... https://t.co/CgpHvm2yC2 The hit kind? Hopefully! https://t.co/25xWfHHZ5N To you too. May you and your family have happiness and health. https://t.co/akCACcVxW8 Yeah been a long time. I miss Malaysia too... https://t.co/1jNZrKuDQi Yeah I keep looking younger every year! That’s surprise snuff?! https://t.co/1Eby5v9F81 Working on stuff. Will take some time once I get the material right. https://t.co/iTCFqogrkQ Been a long time. If you guys are around let’s do a #AskSRK  should it be ‘an’ Asksrk or ‘a’ is ok? And you please take a good rest.  So that when I come there you can drive me around. @SunilPNarine74 https://t.co/jMFpdt9aCj Whew!! Yeah man! Well done...Now to start playing how we play...well played @TKRiders https://t.co/UXR1QxQ3uZ Now I know where my entrepreneurship drive comes from! Need to learn some moves from this wonderful Business lady. \n\n@gaurikhan #GauriKhanDesigns @anuragbatrayo @jyotsna_off @BWBusinessworld https://t.co/9NCeblRTAf My best wishes to the young Director &amp; her team for...loving the song! 🕺🏻\nPresenting the official trailer of #BhangraPaaLe: https://t.co/h6y7Sa2A3Z  \n@sunnykaushal89 @RuksharDhillon @ShriyaP @SnehaTaurani @RonnieScrewvala @RSVPMovies @ipritamofficial @jam8studio @tipsofficial Kya baat hai. All the best my friend. All looking and feeling awesome! https://t.co/Eek6DlpslD Did an all nighter...cleaning up my library. A bit shabby &amp; smelling of books, dust and happiness... https://t.co/bRoVDRkRnO Pooja done....Visarjan done. Ganpati Bappa Morya!! May the happiness of the world and beyond come into every household &amp; for every family. https://t.co/D8pKXtZk3K Wow how well he sings. Give him hug from me. Love https://t.co/3Vtg6IKeii Tks @VenkyMysore for getting me a personalised pool table with TKR logo. Loving it Mr.Billiards #mrbilliardstt while listening to music on Tony’s @radio905 https://t.co/2uQLqfypQm May you always be as funny and full of life as you are. https://t.co/7NvKkDxuJ6 It’s always nice to know that in my absence &amp; behind my back , I have surreptitiously signed so many films that even I am not aware of!! Boys &amp; girls I do a film when I say I am doing it....otherwise it’s just post truth. Sometimes we don’t land or arrive at the destination we want to. The important thing is we took off and had the Hope and Belief we can. Our current situation is never and not our final destination. That always comes in time and belief! Proud of #ISRO Keeping up the tradition of Tae ‘Khan’ Doh in the family, the latest entrant to the Kiran Teacher ( @care141 )Fight Club. Yellow belt it is... https://t.co/o8Ie7T2Hso Oh wow! Congratulations Daddy Cool! https://t.co/Kdpj5BULOI Congratulations @Pvsindhu1 for winning the Gold at the BWF World Championships... Making us proud as a nation with your exceptional talent. Keep creating history! Love u @iamkeitan @Harry0073 for the set up. @pooja_dadlani for making it happen. @mitublange @iffmelb for the thought. My Ursa minipro 4.6k is set up! Quite an awesome camera @blackmagic_news now only if I can shoot well. https://t.co/XPDnfo1veg The trailer of our first @netflix series #BardOfBlood is here. A thrilling tale of espionage, vengeance, love and duty. Hope u enjoy it...\n\n@NetflixIndia @RedChilliesEnt @emraanhashmi @_GauravVerma @BilalS158 @ribhudasgupta https://t.co/aftLjq3BA1 RT @NetflixIndia: Where can we sign up to get interrogated by @iamsrk? https://t.co/L8vGhO5hFr RT @NetflixIndia: Still waiting on that callback, @iamsrk. https://t.co/JJygsX9Wfw RT @NetflixIndia: We made @iamsrk an offer he couldn’t refuse. https://t.co/qyO2Nvdf2p RT @NetflixIndia: @iamsrk thought cameras would make him feel more comfortable so we added some CCTV cameras. https://t.co/A8rBfW3S77 It’s such a wonderful university. Please use this opportunity girls. Lots of luck to all of you. https://t.co/xHxRPHXmKh May today and every day hereafter bring peace of mind, patience in our hearts, prosperity in our actions and prayers of thankfulness for the gifts that we have. May you all be loving and loved all your lives. Eid Mubarak to everyone. https://t.co/O87KQDbcPS On the way to @latrobe University.. Thank you for the kind gesture of offering a scholarship to a girl student from India for higher education and supporting the work at @MeerFoundation https://t.co/OfyKLPy3MP What an exciting teaser! Wishing Karan and Sahher all the best with this beautiful film. @iamsunnydeol has made this with all his heart and soul...  Love to the team! #PalPalDilKePass \n\nhttps://t.co/Ig0Ksdgg4f Beautiful homes are made by beautiful home makers. Bas! https://t.co/PXTYIHsrmm Ready ho jaiye, Bauua ki Meerut to Mars wali mohabbat dekhne ke liye, Catch the World TV Premiere of ZERO, tonight at 8 PM, only on @ZeeCinema\n\n#ZeroOn28July #ZeroOnZeeCinema #SeeneMeinCinema @AnushkaSharma #KatrinaKaif @RedChilliesEnt @cypplOfficial https://t.co/HJXf2E51S3 A decade of D’Decor and a family like relationship. It’s so satisfying making beautiful homes. Thank u so much @DDecorDiaries Sanjana Ajay and Sanjay. https://t.co/Mqa56U8MEH A decade of D’Decor and a family like relationship. It’s so satisfying making beautiful homes. Thank u so much @DDecorDiaries Sanjana Ajay and Sanjay. Perfect Handstand. Perfect Harmony. Perfect Sunset. And Perfect wife!! Thank you @JumeirahJV and @MakePlansHols for a Perfect Holiday. https://t.co/yysFHdSJmS Chaand Taare todh laoon. Saari duniya par main Chhaoon! To do that requires hours &amp; hours of painstaking work &amp; integrity &amp; belief. Congratulations to the team at #ISRO for #Chandrayaan2 Feeling bad having to leave Maldives and especially all the wonderful people at Jumeirah Vittaveli. Thank u for a lovely holiday @JumeirahJV will miss u all. https://t.co/sg7Bxmr2pV So happy to hear that so many r enjoying Lion King. A special thanx to my coactors &amp; friends for bringing this film to life in Hindi. @imsanjaimishra @shreyastalpade1 &amp; the amazing @AshishVid  &amp; #asrani sahib. Thx for making me &amp; Aryan sound good! i’m scared to say that #typewriter is now screaming on @netflix .. goodluck @sujoy_g ... hope it doesn’t come back to take badla on you.  https://t.co/YF1TkNT4KN You are the best. His Sacred Games though is wicked!! https://t.co/B2l5Bjx7VH RT @Ishikamohan: This is so hard but so right!\nI couldn’t keep 😷.\n@iamsrk I’ve always said it’s magic working with you:). \nCorrection-the i… Ishika has taken some of the nicest pics of mine &amp; the film. This is so good! https://t.co/RQKUCgCe1W Young Lions don’t tweet so on behalf of Simba #AryanKhan I want to thank u all for appreciating his effort. Also thx to @disneyfilmindia &amp; the team at Sound &amp; Vision ( Mona &amp; Mayur gang) &amp; doesn’t his voice sound a bit familiar? Or is it just me? Mera Simba.. #TheLionKing @disneyfilmindia https://t.co/kC66BMBOVE 27th September, get ready for the action-packed series #BardOfBlood on @NetflixIndia! \n@RedChilliesEnt @emraanhashmi @_GauravVerma @bilals158 @ribhudasgupta https://t.co/H3x6vin5hS My friend Helmet pehenkar, On Drive..Off drive &amp; Straight drive, karna aap se zyaada behtar kaun sikha sakta hai! Will tell my grand children, I got my ‘driving’ lessons from the great Sachin himself. See u soon over some fish curry. Thank u. https://t.co/QGG5YaGnu3 Thank u for your wishes my friend. U have always been a guiding light and so encouraging to the kids....and the strength for their bow! https://t.co/798JN2P6tV Last day at school. To adding new experiences and colours to your life ahead.... https://t.co/NnAIUUYkG8 4 yrs have flown by. Graduating from Ardingly. Last pizza...last train ride...and first step into the real world...school ends...learning doesn’t. https://t.co/hKHPIj0ffe Delighted to be a part of this global legacy. In Cinemas 19th July. Yaad Rakhna. #TheLionKing @disneyfilmindia \n\nhttps://t.co/T2OfU4JspC Thank you for the awesome 27 years everybody and Thank you Sharad for the bikes! https://t.co/UMg6k78C06 Glad to be a part of this journey... a timeless film. Voicing it in Hindi with my own Simba. The last time we did a film was around 15 years ago and it was ‘Incredible’ and this time around its even more fun. Hope everyone enjoys it 19th July onwards. #TheLionKing https://t.co/rJEfxevA9k A foundation I named after my father - @MeerFoundation - aims to create a network of support for women. No better day than #FathersDay for me to introduce our website to the world.\n\nhttps://t.co/BB0Eipnwum Ready for the match with the spirit of #FathersDay. Go India Go!! https://t.co/o09xLTq5d3 Thank u all for spending your Eid with me... May God bless u all with health and happiness. #EidMubarak https://t.co/eXBfmDzVMt Another sweet picture from AbRam’s birthday party... #fathersloveoverload https://t.co/PrZ4yyLZe7 My Trio of Sugar &amp; Spice &amp; everything Nice....and oh yeah!  Gauri’s too. https://t.co/KwtWYZa51m Dreamers r good. But if those dreams r not given a direction they mean nothing.These 2 fulfilled every dream I had,over &amp; above every dream they had for themselves.Adi &amp; Karan. Y share this with all? Cos u should  know, more important than ur dreams r those who fulfil them for u https://t.co/RzsMRYUMet Good luck for #Malaal - Sanjay and my young friends @meezaanj &amp; @sharminsegal. Seen u grow before my eyes and will now see u on the screen. Sharmin be as charming as your mother and Meezan draw the best from ur grandfather &amp; @jaavedjaaferi. \n\nhttps://t.co/gQQH2FEeAx Busy...busy...busy! Time to think out of the box on Ted Talks! Listening and Learning. #TedTalksIndiaNayiBaat.. On @StarPlus @TEDTalks https://t.co/6XkIyZINEy We - as proud Indians - have chosen an establishment with great clarity and now we need to get behind it and work with it to have our hopes and dreams fulfilled.The Electoral Mandate and Democracy is a winner.Big congratulations to PM @narendramodi ji, @BJP4India and its leaders. And this will be fun.  https://t.co/sQYmCqiapF I wish she gave me these gems of wisdom about work at home too! I have to read them online…and learn. https://t.co/F9BEhxMSlm No more footprints...this is The  Abominable Snowman!! Before BatMan &amp; SpiderMan, there is Mr. LetterMan @Letterman Thx for ur generosity. Had 2 much fun being interviewed.Not becos it was about me but becos u were kind enough to make me feel I can be me. U r an inspiration sir. https://t.co/8MkFpWJ0WK Flying into another city that never sleeps... A great idea for someone like me. New York calling. All the best for the Class of 83 cast &amp; crew. May u have a happy shoot &amp; the young ones in the team showcase their talent. Have a good one guys &amp; girls.  @sabharwalatul @thedeol @_GauravVerma @NetflixIndia @RedChilliesEnt Maa  tujhe salaam! https://t.co/mR0zXWhlLF Well done @KKRiders &amp; @DineshKarthik . All played like u should…by backing urselves. @lynny50  #SWarrier  @RealShubmanGill good job. But tonite belongs to Papa! 3 cheers for proud papa &amp; family. https://t.co/KDlvVWmnYT I give this move…⭐️⭐️⭐️⭐️⭐️ 🤙🤙 ‘Kudos’ ‘Yay’ &amp; 5/5. Wot can say? I am an easy critic to please!! https://t.co/D6hztSlIIA Little one was a bit confused between ‘Boating’ and Voting, so took him along to experience the difference. https://t.co/8X6DsTP8bc Coffee with Kalyan jewellers in Dubai. No sugar in my coffee please...I’ll just lick myself... https://t.co/eVHSFk5UQQ ‘You never really understand your personality, unless you have a Mini Me who acts the same way’ https://t.co/skdjZevR3I Thk u everyone for giving so much love to Badla. Congratulations to the whole team &amp; especially @SrBachchan  @taapsee  @sujoy_g on 50 Days! https://t.co/Ag2SeCn4Jh A very happy birthday to my friend @sachin_rt   and thank u for inspiring us to be the best versions of ourselves. May u have a great day. Oh dear!! Why can’t I just travel in cars &amp; trains like normal ppl do! Please don’t try this at home or anywhere.  https://t.co/I9nUDCysAr Thank u my https://t.co/Ka1soprsZf’s a pleasure when people around,can take jokes in the spirit they are made. Thx  for this pleasure https://t.co/MvW35UyaFX PM sahib @narendramodi ne creativity ki liye bola tha. Main thoda late ho gaya video banane mein...aap mat hona Vote karne mein!!! ‘Voting is not only our Right, it is our Power.’  Please Use It. Thank u to @tanishkbagchi @abbyviral @parakramsinghr . \n\nhttps://t.co/9280i8BnK3 Kya baat hai bhai!! Bahut Khoob.  https://t.co/0t8hQoUSbJ May Allah bless his soul. In school we use to hear all his stories of bravery and be inspired.  https://t.co/cbpyGXMttG I feel it’s only fair for KKR to do something in return for @Russell12A  ,like winning a few before the season ends. https://t.co/Lqybf9vK2k Arre nahi Daddy Cool! ‘Grow up’ hon aapke dushman. Hum dono ka dil to baccha hai ji. Come back home let’s start with snakes and ladders and we can move to making sand castles in the air. Miss you. https://t.co/asgWd1N5Cb What a warm and happy welcome here in China by SRK UNIVERSE China. Thx for the gifts, the flowers and the kisses. I am Red all over!! https://t.co/0VFGjPBWQl Thank u Kolkata &amp; thx ITC Sonar for years of hospitality. I would eat the goodies but that would be like ‘eating my own words.’ But love them all the same. https://t.co/ndU2ntD9zs No no yaar. The fun was all mine. You were so cool to work with &amp; so talented.  https://t.co/xqjLC0CRIS Wonderful play by @RealShubmanGill &amp; @Russell12A yet again. Losing is ok but today we kind of lacked heart, especially bowling, that’s sad. Only positive out of this game was that our Dada @SGanguly99 was at Eden on the winning side. Congrats @DelhiCapitals And he was so jovial. Somehow in the midst of all stresses he had a way that could make u smile away ur troubles. One of those people u assumed will never leave your side cos he was so full of life . https://t.co/puJxjA2k2B He loved me so much. Encouraged me. And today if I am used to being mollycoddled on sets it’s because of this man who made a ‘Fauji’ out of a boy, like his own. Will miss you Sir...always. May u find peace in ur new mission. https://t.co/j6LKM2MJpV Sir film aapki hai…acting aapki hai…Hit aapki wajah se hai…aap na hote toh film hi na hoti. Toh party…bhi??https://t.co/7cunRO68rC Sir hum toh wait kar rahein hain ki aap party kab de rahein hain hum sabko! We r waiting outside Jalsa every nite!  https://t.co/9vix8rvwuP Thought while waiting to go back home to Mumbai....I should for no reason do a Chennai Selfie...so..bye Chennai &amp; all the wonderful friends I met from the film industry &amp; of course the sporting crowd at the stadium. Whistle Podu!! https://t.co/lHP5n2T69D Much fun in Chennai today. Well played @ChennaiIPL  &amp; my fantastic @KKRiders we did our best but sometime it’s not good enough. @Russell12A @imkuldeep18 will giv u guys a massage, @SunilPNarine74 will help. #piyushchawla ‘I am in love with ur new body’ How sweet is this from @purevnv  now I have been geared &amp; dressed for the whole year by these gifts from my friend @anandahuja Thank u so much. It’s very kind of u &amp; these r the coolest sneakers I have ever seen. Have to come to ur store soonest! https://t.co/ylnzfJtgML Thanks baby. Got this. Now please motivate me to Work On Time too!!  https://t.co/9qejCH9tIx So well done my @KKRiders @lynny50 give him the SUV! @SunilPNarine74 u r YOU! @robbieuthappa u r STYLE! Bowlers were awesome &amp; u @piyushchawla024 keep doing wot u do...&amp; @gurneyhf welcome to the family. Thx @DineshKarthik I feel on top of the table! CU soon Well played boys @KKRiders @lynny50 @NitishRana_27 @robbieuthappa . Each one in the team did so well but you all will agree all words of praise r worth less than this picture... https://t.co/bak2zQ9NqD And you guys in the Dugout who said game/set/&amp; match......u may know your cricket but you don’t know @Russell12A !!! WOW u CHAMPION. This calls for Wine my MuscleMan! Thank u for the honour @universityoflaw &amp; my best wishes to the graduating students. It will encourage our team at @MeerFoundation to strive ‘selfishly’ to share more. https://t.co/IBI1I6UlFY What a lovely evening @Arsenal congratulations. Thx @MesutOzil1088 &amp; #AmineGulse for your warmth love &amp; hospitality. See u guys soon in India. https://t.co/4rtBJXZ5uW The end of one story is the beginning of another. Who did I invite to go on the next adventure in my #Dubai? Watch my whole adventure now at https://t.co/nBpJTAVmit \n\n#BeMyGuest @visitdubai https://t.co/hzdk7BHcXD All of u please put ur hands in prayer...and say Bhagwan inki zindagi ki nayi shuruaat mein...inpar karam karna...May God have mercy on them...Insha Allah. These r my sisters &amp; need ur prayers for recovery, without distinguishing between the mode of prayer https://t.co/JjE8ZM08mX Aaj ki Shaam Eden Gardens ke Naam...All at KKR @Russell12A @robbieuthappa @NitishRana_27 @SunilPNarine74 @imkuldeep18 #PiyushChawla &amp; #Lockie thank u for the noise!! https://t.co/YV1fgR5csz Next time you please come to the grounds Didi. Thank u we will try our best.  https://t.co/h5WmbHbLdW “Being with you is like being on Stage. There’s so much light, I can’t see anything else”. Curiosity to know New, Humility to accept u will never know if fully...makes u an actor. #WorldTheaterDay https://t.co/7mWCCuHmBz And my boys @Harry0073 @iamkeitan and ARJUN and their team keep on making us prouder!! Love u boys and girls at @vfx_redchillies https://t.co/ZLCJ3A0s05 @Russell12A said to me that he was so overwhelmed with the welcome fans gave him, that he wanted to cry. Then decided big boys don’t cry in public. @NitishRana_27 @robbieuthappa &amp; @RealShubmanGill &amp; the whole team plays for You Kolkata. Thk u for the Love. Make sure they practice hard. Thanks for the support. KKR Hai Taiyyar!! https://t.co/Nk43qc5en2 I hate clarifications on SM. @karanjohar is technologically challenged but has other good qualities like his taste in clothes!?Just like Life, twitter doesn’t come with instructions, so mistakes r natural....&amp; also he has fat fingers. Go easy all, Make Lov not War...it’s more fun Congratulations. To all the participants &amp; support staff &amp; coaches. Jai Hind!  https://t.co/bf2thouZr5 Wishing everyone the Happiest Holi ever! May Allah filll all your lives with the most beautiful colours of life &amp; give u health &amp; happiness. Playing this song in the car on the way back from a busy day at work... Loved the @marshmellomusic mask. Though we should put in the dimples next time. \n\nhttps://t.co/nlStXX1cvL EXCELLENCE is the unlimited ability to improve the quality of what u have to offer. You all r Excellence personified https://t.co/BsmUKnZg0R Can’t thank u enough for being part of Bard, our first series on Netflix.  It wouldn’t be possible without u. Love I https://t.co/r0iaeR9vlr Three coins, one old box and tons of clues to solve. Wonder what my next challenge will be? @visitdubai \n\nCatch the action and find out more on https://t.co/nBpJTAVmit #BeMyGuest https://t.co/Rs8FmQIMKO “You pray for us, we play for you” \nLet's be in it together, Aakhri Dum Tak Aakhri Run Tak. \n\nhttps://t.co/hDfglxXYMh\n\n#KKRHaiTaiyaar @kkriders So glad people are loving #Badla. A big thanks to the audiences who gave a warm welcome to the film! https://t.co/SkDConVF0C Wondering...could this be the cloud that stores my data??! https://t.co/xHcq38SmUz Let’s come forward and change this!  https://t.co/rVXxtidnRb Should I just let the hair grow for another few months??! https://t.co/4udXMXZXtJ Pray we do this right and good.  https://t.co/WeYnr8yQAf Will surely listen to the the music u are listening to my man. Will send u some Indian music too. Love to you &amp; health and life Forever and more to you https://t.co/iAmPIb6sa7 All these young boys &amp; girls dancing to my songs make me look better! How sweet is this.  https://t.co/7lqHCXWG2A Thank you for giving #Badla a warm welcome! Here's a parting gift as we say goodbye to the series!\n\nDekhiye #BadlaUnpluggedEp3 aur di jiye jawab mere paheli ka to win an autographed #Badla poster.\n\nhttps://t.co/13lmgfmjLy\n\n@Srbachchan @taapsee @sujoy_g @redchilliesent @iamazure T4018 - एक ऐतिहासिक पल @SrBachchan sir के साथ | Amidst all the fun, love and talk...we also have a selfie video together!\n\nBook your tickets for today:\n@bookmyshow: https://t.co/uFe7MVDJ7c  \n@Paytm: https://t.co/HqCdo7znQE https://t.co/Ak5h3ZUidE @SrBachchan sir aapko mil jaaye naukri toh mujhe bhi recommend kar dena. The man who made Elections exciting to watch &amp; follow when we were young. #TheVerdict by the man who gave a new meaning to ‘Swing’ @PrannoyRoyNDTV @PenguinIndia @ndtv Pre order here Am so glad ppl r liking the film. Huge thanks to @sujoy_g  @SunirKheterpal @PuriAkshai @_GauravVerma  https://t.co/zsrORo4PuQ RT @RedChilliesEnt: ‘बदला’ पूरी तरह से एक कसी हुई फ़िल्म है, देखिए और क्या क्या कहा जा रहा हैं #Badla की तारीफ़ में | #BadlaReview #BadlaTo… RT @RedChilliesEnt: A fast-paced thriller with fine performances! \nHave you watched this gripping story yet?\n\nBook your tickets now!\n@bookm… RT @RedChilliesEnt: Thrilling and gripping! The critics have all things good to say about #Badla! #BadlaReview #BadlaToday \n\nHave you got y… #BadlaToday https://t.co/SkCa5H7Kzw Thank u @SrBachchan for the awkwardest ‘ode’ to me. Aapne Expose kar diya Sirrrr!! Badumbaaaa!! https://t.co/XprHrgYw6W This was so much happiness.  https://t.co/NWUBJTMrNQ There is no better feeling than Coming back Home, for home is the place of love, hope &amp; dreams. Ur bravery makes us stronger. Eternally grateful. #WelcomeBackAbhinandan https://t.co/NFTRINu6Mw Sorry Amrit I hadn’t seen your video. Please give my regards to mummyji &amp; I will figure out &amp; speak to RAJU soon. https://t.co/hBQvmLqHgQ Rishtein mein to ye sabke baap lagte hai aur naam bhi hai Shahenshah @SrBachchan. But ye chicken wali baat abhi tak dimag mein settle nahi hui #BadlaUnplugged coming soon \nhttps://t.co/CZM0fz6W6B\n@taapsee @sujoy_g @RedChilliesEnt  @iAmAzure Jo dikhe woh sach ho aur jo na dikhe woh jhooth, yeh har baar zaroori nahi. #Badla8March\nhttps://t.co/u62f57ksY3\n@SrBachchan @taapsee @sujoy_g @RedChilliesEnt @iAmAzure https://t.co/BepLEQM8vP Sir this is love in A Major and B Sharp! https://t.co/z1DzhshwUb Heartfelt condolences to the families of our valiant jawans. May the souls of our countrymen who laid their lives down for us rest in peace. #Pulwama This image reminds me of the  Yellow Brick Road....I hope they find answers they r looking for or at least have enough questions to lead a full life....#mysunshines https://t.co/10hdGzZv79 Sach saabit karna aasaan nahi hota, par saabit kiye bina woh sach, sach nahi hota.  Unveil the truth with Badal Gupta in the #BadlaTrailer \n\nhttps://t.co/u62f57ksY3\n\n@SrBachchan @Taapsee @sujoy_g @gaurikhan @SunirKheterpal @PuriAkshai @_GauravVerma @redchilliesent @iamazure Just to feel awesome about myself…I have the whole album and my very own first Polyvinyl Chloride. Thank u Farhan. https://t.co/yoViNGKSWD Ab mahaul kuch Badla Badla sa lag raha hai. Here's the first look of Badla featuring @SrBachchan and @taapsee ! Directed by @sujoy_g.\n#BadlaTrailerTomorrow \n\n@gaurikhan @SunirKheterpal @PuriAkshai @_GauravVerma @RedChilliesEnt @iAmAzure https://t.co/KrbwGrxETZ Main aap se Badla lene aa raha hoon @SrBachchan saab! Taiyaar rahiyega... Let us all celebrate our great country - India. Prosperity, health and happiness to all. Happy Republic Day. Jai Hind! https://t.co/xsbqX0cgEu All the best my friend. So extremely happy for this. Love to you. Also very very proud of all your achievements.  https://t.co/iotCGyyXxr “Winning is only half of it....Having fun is the other half!! Playing is All of it....” The Playboys’  mantra. https://t.co/8SA7DYdsOg Weekend Research: “A survey has found that One in Three men are just as lazy as the other Two! “ We r the other two and we don’t agree....mom! https://t.co/BRhzslpD73 Ek chota aadmi banane ke liye bade logon ki badi mehnat lagti hai. \nProud of the entire @vfx_redchillies for the fantastic work! \nhttps://t.co/yllBknULyn\n\n@AnushkaSharma #KatrinaKaif @aanandlrai @RedChilliesEnt @cypplOfficial Thank You! U took out time from ur holidays. Please give my love to Preeti &amp; sorry to pull u away from her.  https://t.co/Xb1KjcSMF2 Pyaar mein taare tod leta hai, zara chaand ko sambhaal ke rakhna!\nFeel the magic of love this Christmas!\nWatch: https://t.co/qx7UPl7KC5\n#ChristmasWithZero\n\n@AnushkaSharma #KatrinaKaif @aanandlrai @RedChilliesEnt @cypplOfficial Thank u sir. So glad u enjoyed it.  https://t.co/EvcgvTjB8w Height thodi choti hai par chhalaang sab se oonchi hai @BauuaSingh ki!\n\nWatch the promo now: https://t.co/vhAApsepP4\n#ZeroWinningHearts\n\nBook Now: https://t.co/3ypCFSmKi3\n\n@AnushkaSharma #KatrinaKaif @aanandlrai @RedChilliesEnt @cypplOfficial Jin dilon ko achchi lagi.... shukriya!! https://t.co/I8mlxrz3ox BAUAA SE MILNA HAI? Download karo MyJio App aur participate karo MEET KING KHAN contest me. Jio exclusive. Click here https://t.co/eEUeeihnw2 Sitaron ke khwaab dekhne waalon humne chaand ko paida kiya hai…Merry Christmas to you all. https://t.co/NjEImBHtlH Reading msgs that u enjoyed #Zero .I can’t answer individually, so a few lines from a poem I was reading: “The earth is wickedly dark, so why is ur poem so white? Becos my heart is teeming with thirty seas, I answered.(Mahmoud). So thk u all from the bottom of those thirty seas! Thank u Kolkata... https://t.co/CiLr8sVtl8 Bauua loves u too!! https://t.co/mUTtZcIy4S Sach mein... Film Nahi feeling hai. Thank u!!  #ZeroDay https://t.co/YnlBd7c1Kh Thank u all... hope u had a good time with Bauua, Aafia, Babita and the others https://t.co/AmSYvUy8QV Thank u Patna! https://t.co/AljnvQWRdx Love to all of u in Pune... https://t.co/dapolGRDIe Bauua sends his love... https://t.co/p7GysRSjpB Love u... Hope u enjoyed #Zero https://t.co/itwOAObx0p Nice... https://t.co/7SiANNg5bO Thank u Gwalior... Gamchhas are looking cool! #ZeroDay https://t.co/0uRmsDFORz Hope u had fun Nashik... #ZeroDay https://t.co/xKDO1H2UNY Shukriya Jalgaon... https://t.co/HuZmfW9ReZ Thank u Kota... Looks like u had a good #ZeroDay https://t.co/OyoD1YRA8i Thank u all from the bottom of our hearts for making #ZeroDay so special... \n\nhttps://t.co/3ypCFSElGD https://t.co/1k6dbZBcGm My Taani, Akira, Sejal, Aafia &amp; Friend. I am privileged to have worked with u. U make me a better actor. Love u. https://t.co/wJwUxeaRK8 Ek pyaar hi toh hai, jo insaanon ke bhi parr laga deta hai! \n#ZeroTomorrow\n\nBook your tickets now: https://t.co/VOT6yMCzRd\n\n@AnushkaSharma #KatrinaKaif @aanandlrai @RedChilliesEnt @cypplOfficial https://t.co/jpxVLid2HP RT @bookmyshow: Face zero hassles as you make plans for your favourite @iamsrk film, this season.\n\nBook your tickets for @aanandlrai's #Zer… RT @PaytmTickets: Watch @iamsrk say #PaytmKaro! Book @Zero21Dec movie tickets on Paytm &amp; get 50% Cashback* up to ₹150. Use code: ZERO. http… RT @amazonIN: Pay using Amazon Pay to book your tickets for Zero on BookMyShow &amp; get up to Rs.150 cashback.\nTickets are live, book now at h… RT @RedChilliesEnt: The grand finale we were all waiting for has finally ARRived! \nWatch the full episode here to find out who is the authe… Ye ishq nahi sab ka kaam, iss mein na jaane kitni Heer hui badnaam.\n\nWatch #Zero’s new song #HeerBadnaam: https://t.co/QmgYUVSmzp\n\n#ZeroTomorrow\n#KatrinaKaif @AnushkaSharma @aanandlrai @RedChilliesEnt @cypplOfficial RT @RedChilliesEnt: Our lovely cast of #Zero took over @RadioMirchi today! \n@iamsrk @AnushkaSharma &amp; #KatrinaKaif had a lot of fun on air a… @imsmith_bg @BauuaSingh And @BauuaSingh thanks u for that... https://t.co/n9DwbGKvEo @SRKCHENNAIFC @BauuaSingh @SrkPuneCFC @aanandlrai @RedChilliesEnt @KarunaBadwal @khyatimadaan @BilalS158 @pooja_dadlani @AnushkaSharma @Zero21Dec Have fun Pune!! https://t.co/irsM6tq4OP @mkrishnasolanki @BauuaSingh @AnushkaSharma @aanandlrai @Zero21Dec And @BauuaSingh is excited to meet u too!! Have fun... https://t.co/Mk4RHOoidf @SRKUniverse Bauua can’t wait to entertain Sangli... https://t.co/koNvQNuYEs @RaazManish5 @BauuaSingh Film nahi feeling hai!! Hope u enjoy #zero... https://t.co/97ay8fDTNv @PrasadSRKian Have an awesome time with Bauua and team #Zero!! https://t.co/2tLDLaqIwP @itslovey @RedChilliesEnt @BauuaSingh @Snapchat @AnushkaSharma @aanandlrai @cypplOfficial That’s nice!! Enjoy the FDFS... #Zero https://t.co/8DROZgekZZ @moulik_dasgupta @bauaaa @jayanta20197800 You are awesome too... Thanks and enjoy the film! https://t.co/kwy3VMlwMU Aafia, Babita, Guddu, Ashok! Ye pehle hi kam the jo ye ek aur aa gaya! Par cute toh hai ye! \n#2DaysToZero\n\nBook your tickets now: https://t.co/VOT6yMCzRd\n\n@AnushkaSharma #KatrinaKaif @aanandlrai @RedChilliesEnt @cypplOfficial https://t.co/dijcvlNh43 Thanks to @Snapchat @BauuaSingh can take Aafia &amp; Babita for the movie #Zero on 21stDec... Apni aankhon mein bithake...for my eyes only... https://t.co/OX0fXcUx4v Oh this is nice! Now will have to learn how to use Snapchat! https://t.co/Zy5tgORc1s It’s really sweet and touching how you all are booking tickets for #Zero in advance. Thank you &amp; hope u all enjoy the experience. Love u. Aise toh mat karo yaar. Love you both for this awesomeness. https://t.co/4Ji9st3UrK Kya baat hai yaar. Encompasses the whole film feel and more. Thank u. https://t.co/K7pPEZxU0M Sir amazing toh aap lagte hain. Too much respect and love for your friendship and kindness always and forever. https://t.co/oKdIvJvJwK @BauuaSingh and Alexa ki prem kahani. Poor Aafia seems a bit miffed!! Thank u Amazon for this mad love from Alexa...obviously!!! #BauuaOnAlexa https://t.co/NY2zL1ZXY1 @Bhuvan_Bam @RedChilliesEnt @Zero21Dec Thank you so much for all your love and effort. Bless you Titu... @BauuaSingh  happy Burthday. Janam din tumhaara hai, manane ke liye मैं Uttar Pradesh aa Gaya. Lubh you एंड lubh UP ki sardi... https://t.co/eFqb9pkIsf Bhai @BauuaSingh subah se issi soch mein hoon ke tumhe gift kya doon! Tumne mere birthday par sab ko #Bauua gift kiya tha, toh tumhare birthday par, meri taraf se #BookingsOpenForZero\n\nhttps://t.co/3ypCFSElGD https://t.co/HmvA9oO88V Tell her uncle loves her…https://t.co/wx5IbL9ynA Yeh dekho @BauuaSingh Babita Kumari Jaisi humaari ek aur Bhabhi. https://t.co/vdMHW1Svxq You are timeless!!  https://t.co/zJBRtB7CHZ @BauuaSingh chillin’ on Saturday with Husn, Chips &amp; Angrezi fillum. Bauua I am going to Uttar Pradesh...thoda ghar ka khaana bhijwa dena. Tell Ashok to bring it please and no selfies for him!! https://t.co/IBfHds3ekr Itni mushkil se saath aaye hain, aise thodi na jaane denge! #6DaysToZero\nNew dialogue promo: \nhttps://t.co/kZA1gjVmpq\n\n#KatrinaKaif @AnushkaSharma @aanandlrai @Mdzeeshanayyub @RedChilliesEnt @cypplOfficial Bhai ne Phir Jiyra Chakna Choor kar diya. Thank u Big Boss &amp; @BeingSalmanKhan for a great evening starting with #Zero love you all. https://t.co/Ch2lNFMI5p Thanks for having me on the show. U r fun!  https://t.co/6vKpYQzYb4 Launda na samajhna, beta baap hain tumhare! #1WeekToZero\nhttps://t.co/TmCzLvHxCA\n\n@anushkasharma #KatrinaKaif @aanandlrai @Mdzeeshanayyub @dirtigmanshu @RedChilliesEnt @cypplOfficial God Bless you.  https://t.co/A0a7CQ2PXQ “If you hit a wall, climb over it, crawl under it, or dance on top of it.” Dance like Babita\n https://t.co/Ujqr2x3oLK She is soooo hot in Husn Parcham that we have to keep her in a tub on the sets. The Beautiful  Babita. #HusnParcham https://t.co/UzcuxI9ssg Thank you so much for your rap and more. Lots of love https://t.co/JkMJz9r8Yt Deewano ki ye bheed ab na hogi kam,\nAa gayi hai Babita Kumari lehraane Husn Parcham!\nThe most sizzling song of the year #HusnParcham out now!\n\nhttps://t.co/kgrcLJ72jV\n\n#KatrinaKaif @anushkasharma @aanandlrai @Mdzeeshanayyub @BoscoMartis @ajayatulonline @irshad_kamil Somebody asked me what Husn Parcham means. Well it means announcement of ones beauty...roughly. Smoothly it means just this...!!! Song out tomorrow...#HusnParcham https://t.co/idzR6i2Lbs How lovely is this girl!! Can’t wait to show you all Husn Parcham...let’s just elect her in our hearts tomorrow. https://t.co/RYxcONYOHz Poore desh mein chakka jaam lag jayega\nJab Babita Kumari ka #HusnParcham lehrayega.\nStay tuned for the most sizzling song of the year releasing on December 12th!\n\nhttps://t.co/SQkPEdk7Dx\n\n#KatrinaKaif @anushkasharma @aanandlrai @ajayatulonline @irshad_kamil @BoscoMartis https://t.co/buKGxKqYOr Thank u for making Bauua digitally savvy… #BauuaOnAlexa https://t.co/Jhm7MJNOMl Yeh lo…Bauua is with Alexa now. He and his attraction for girls!!! https://t.co/fq8UZh41UG Masha Allah. Thx Al Kout &amp; Cinescape for getting me to meet such beautiful people. Ana Ahbak...I love you Kuwait. Ishqbaazi ho gayi Aap sab se. Let’s hear the song again... https://t.co/c3NANjdCJ7 https://t.co/exj1iMTR3o @BauuaSingh bhai एक फ़ोटो मेरे साथ भी डाल दो…autograph के साथ। और क़सम से, तुम्हारी साइन का ग़लत फ़ायदा नहीं लेंगे बैंक में!! Love you Oman &amp; thanks for taking out time to see me. Insha Allah will come back soon and give u all individual hugs! Thx Vox Cinemas...&amp; all the boys &amp; girls in Muscat. https://t.co/aGvw4d9HwE Reaching reaching boys and girls. Love u all https://t.co/xWqXXusQoB Of all the things I have done for Mere Naam Tu...this is the sweetest. My daughter teaching me to get the lyrics right on the sets. Hope after she sees the song she approves... https://t.co/qfQ2hhEF9F Thank you the lovely ladies at MBC trending for such warmth and the interview.  https://t.co/Ceu2whhfIz So lovely. The song really makes u want to fall in love.  https://t.co/kNlvBPDU3e Ek hi gaane mein main ghutnon par bhi gaya hoon aur hawa mein bhi udaa hoon. \n\nOne of the most beautiful experiences from the shoot.  \n\nWatch the making of Mere Naam Tu here - https://t.co/pMhC7dnVqc\n\n#2WeeksToZero\n\n@anushkasharma @aanandlrai @AjayAtulOnline आज दुबई में गाना सही बैठ रहा है...सबका प्यार देखकर लगा..सच्ची में प्यार दीवाना होता है!!!@BauuaSingh https://t.co/ba40tcGb8W Thank u for making me a part of this awesomeness and especially thankful to everyone who is making Indian hockey so special... https://t.co/jbmuVZAPEh This much love for #Zero , only possible in Dubai. Thanks Global Village for the 100,000 hearts beating for Bauua, Aafia &amp; Babita. Will convey ur #Ishaqbaazi to them in India. Love u Dubaiwaalon yeh dekho Bauua ki selfie! https://t.co/Os5S2VJBnc वाह यार @BauuaSingh! जिस चाँद को चूमने के लिए दुनिया मरी जा रही है, उस @BeingSalmanKhan को तुम चूम आये! और तुम्हारा @BeingSalmanKhan वाला स्टेप देखकर तो मज़ा आ गया! गमछे वाला! https://t.co/AJGoZJeCmW @GautamGambhir Thank u for the love &amp; leadership my Captain.U r a special man and may Allah always keep &amp; happy…&amp; u should smile a bit more Thank u bhai from our whole team at Zero. Phir se aapka gaal choomne ka mann kar raha hai!! https://t.co/Vy2FalolJY Akele chale the ishq ke safar par, karne mehboob ko raazi, dost aisa mila raah mein, kar aaye Issaqbaazi.\n#IssaqbaaziOutNow https://t.co/c3NANjdCJ7\n\n@beingsalmankhan @anushkasharma #KatrinaKaif @aanandlrai @ajayatulonline @irshad_kamil #SukhwinderSingh @aslidivyakumar @remodsouza RT @RedChilliesEnt: Khabar mili hai abhi ye taazi, aa rahe hain @BauuaSingh sikhaane sab hi ko #Issaqbaazi.\n#Issaqbaazi song out tomorrow!… Kya baat hai @BauuaSingh, badi ishqiyaana shayari ho rahi hai? Mere saath reh kar asar ho raha hai lagta hai. Aakhir ishq karna kuch kuch seekh hi gaye tum mujhse. https://t.co/TomN2DGwRg Late nite Dub...play in London...Mumbai 2.0...back on sets for patchwork...’My barn burned down and now I can see the moonlight...’(Haiku) &amp; follow @aanandlrai instructions. https://t.co/cmBsU9TnP5 Thank u sir @Dev_Fadnavis for making me a part of Mumbai 2.0. This is our city and we will do everything with you to make it more creative, competitive &amp; culturally inclusive. Aamchi Magical Mumbai. https://t.co/2pOMcyeGX7 With my Juliet in London. What a wonderful experience and exceptional performances by the whole cast. Congratulations to the whole team. https://t.co/Y4dBdNiiqT .@BauuaSingh se duniya hai kehti ke kabhi toh humse mil,\npar mauka usse hi milta hai jo #BauuaKiToli mein ho shaamil! https://t.co/nQW95gf8JY Personally u r hardly a terror!U r sweetness personified. All the best for this ambitious project my friend. Awesome https://t.co/tEIU7UN9A5 Thank u Odisha for all the excitement, love &amp; the grand beginning to the World Cup Hockey. @naveen_odisha it was lovely to meet u sir. To all the players have a great tournament....&amp; yes..Chak De India! https://t.co/bQ2BajiG7O On our family list of ‘Fortunate’ she is the most powerful! https://t.co/XWi5m1aFzg RT @AmazonMusicIN: #OnLoop the mesmerizing love ballad #MereNaamTu from #Zero \nDownload for free and Listen on Repeat 💞\n\n@iamsrk #AbhayJodh… Be strong and I am not the reason for ur triumph over obstacles. You are!  https://t.co/vkW0GOvtwb Kya baat hai. Very well done. Thank u https://t.co/bIZDBPjSln Very sweet.thank u. Too much kissing though!!!  https://t.co/dKjEXcaFZc Really nice thank u https://t.co/0bgkLB3K4Z RT @RedChilliesEnt: #MereNaamTu, full audio out on:\n\n@iTunes: https://t.co/eUhoLKkPYV \n\n@Hungama_com: https://t.co/4JdOtYe2LG\n\n@gaana: http… RT @RedChilliesEnt: #MereNaamTu, full audio out on:\n\n@JioMusicHD: https://t.co/J99iM4Oas5\n\n@AppleMusic: https://t.co/QJUy09bYft\n\n@GooglePla… Kya baat hai @BauuaSingh bhai! Ye thoda sa bad hai, thoda sa mad hai, par apni lady ke liye ekdum best lad hai! Zara iss par bhi nazar daal lo Aafia, @AnushkaSharma yeh itna bura bhi nahi hai. #MereNaamTu https://t.co/K5FvuDKFMf \n@aanandlrai @AjayAtulOnline @Irshad_Kamil @TSeries https://t.co/c82A7XTPkn Bhai @BauuaSingh din toh bata diya tha gaane ka...time kab bataoge?I am in England...getting restless. Gaana drop kar do yaar please. Abhi!! Bauua ka pyaar hai, Aafia ussi ke naam hai. #MereNaamTu out tomorrow.\n\n@AnushkaSharma #KatrinaKaif @aanandlrai @RedChilliesEnt @cypplOfficial https://t.co/u0CqieDqAQ RT @BauuaSingh: Ab se theek ek mahina reh gaya hai inki dukaan ke bane meethe ko, aap ki zubaan tak pahunchne mein :) \n21st December Zero r… .@BauuaSingh ki ye jhalak zara sambhal kar dekhna, kahin dekhte dekhte pyaar na ho jaaye. Watch #ZeroPromo: https://t.co/b9cr3MkKgB\n\n@anushkasharma #KatrinaKaif @aanandlrai @redchilliesent @cypplOfficial Abe naaaaa! ‘Hafta’ mat badliyo bhai...jeb kharchi kharaab ho jayegi!! Acchha ek baat bataa, tumhaare jaise ladkon se pyaar kaise ho jaata hai...is it your hair? https://t.co/Zc3LIbNI4y Bhai ab se tum hi bataya karo kab kya aayega. Yeh @aanandlrai toh sirf yehi batate hain, ki kulche ke baad chole aayenge! Rumouring keeps flying charon taraf. Ok now batao iss hafte mangalwar ke baad kya aa raha hai....budhwaar ya koi aur plan hai...? https://t.co/4umGWbPsbz Thank u sir for ur graciousness. Hockey ke liye yeh toh hum sab ka farz hai. Really excited to be in Odisha. https://t.co/EzQnWn4Sul Unofficially &amp; Unabashedly I want to declare myself the ambassador of @airindiain ndia. Thank u to the ground staff and the wonderful pilots for a hospitable warm &amp; beautiful journey...Maharaja, Maharaja hi hota hai... Two many beautiful women..Too little time. Will be back NYC to savour their company &amp; love again...soon. https://t.co/easmUspiqZ Oh nice. Grew up on this!  https://t.co/sugLJNAQPx Today @jack made me realise with his calm demeanour &amp; composed, nearly meditative mindset...’that all Work and no Pray, would make Jack a dull boy.” Thx for dropping in &amp; also team @Twitter for a lively evening. Have a happy stay in India. https://t.co/melFfe8NKJ Up and Ready. And shockingly on time...if anybody has warned u about my tardiness they r just spreading ‘fake news...’ https://t.co/LE9ybOyJ3K We play all your songs in our hearts. Happy Birthday to my closest friend and family. Love u.  https://t.co/s2w4nD59IL Next time will do Kaali Kaali Aankhen for you live at the IPL my friend. Keep healthy. Love to u.  https://t.co/vPzChMoWY0 25yrs of Baazigar. A film that defines my career &amp; gave me lifelong friends. Thx Utd 7 @rtnjn @theabbasmustan @KajolAtUN @TheShilpaShetty Thomas Johnnybhai Annu Rakhiji Sid Dilip Sarojji Rekha AkbarB &amp; everyone on the film. https://t.co/5zlmNUXPLL For all the sons of the world...If your Mama is your Queen then there is no stopping you from being The Happy Prince. ( and an iPad loaded with games helps too ) https://t.co/9VUo5Qwh79 Mauli aala re. In which my friend @Riteishd proves, Action does speak louder than words. All the best to the cast &amp; crew of the film. It looks awesome!!\n\n#laibhaarimauli #memauli\n\nhttps://t.co/CJ4mBgY7gG Thank you for your wishes my friend. @ShainaNC https://t.co/iAh49blU9Z Thank you for liking the trailer. Really appreciate it! https://t.co/Li8MpuVxVc Here’s wishing you, all your dreams come true too. Thank you and love you https://t.co/cdVUpy9JZi Big awesome wala hug to you too.. thank you and love you @divyadutta25 https://t.co/zmA3huhkKP Miss you baby. Hope to see you and Anil soon.. https://t.co/jAKdttfI0j Thank you so much for your wishes.. and same from to you for today and always.. https://t.co/uO0Dx0uOVz Thank you Sir. Best wishes to you too. @praful_patel https://t.co/Sqi40BGZdT Thank you as always for your wishes.. love you and hope to see you soon @RituparnaSpeaks https://t.co/FAVQXYi7mr Thank you as always for your best wishes.. see you soon @prosenjitbumba https://t.co/wr3vothNQU Thank you so much.. saw some of your stuff too just now.. it’s looking fantastic!! All the best! https://t.co/gwsINxHcq2 Coming to take you aashirwad soon Didi. Thank you for all your love and warmth. Is baar Ghar ka khana phir khilana.. https://t.co/qgzwXMTQct Thank you baby. Bless you and keep doing what your doing. It’s the best.. https://t.co/6e6BlgO1XN Thank you Sir. Jaldi film dikhata hoon.. https://t.co/SKKDSA9VdQ Thank you so much and your positivity for the trailer.. hopefully will see you soon and give you a hug https://t.co/WpMmgTyMMD You’ve always been and always will be my source of inspiration. Thank you and will try to always make you proud! Baaki sab bakwaas, sirf ek hi aap JHAKAAAS!! https://t.co/k5dakoNoiC Thank you. Love you. Keep rocking!! See u soon. https://t.co/eRQExSC05e Thank you bro. Dua kar tere tarah King ban jaoon.. https://t.co/BNGBIxn2Mz Like everything else too that you have taught me.. love to you.. https://t.co/3UXPqxdDZO Thank you so much my man. Next show with you let’s see if you can do the act of Bauaa!! https://t.co/EtHuDwFK09 Missed you.. missed you... missed you. Love you.. love you... love you https://t.co/LNMZKw8uiQ Thank you Turbanator.. sending you a big hug. Can’t wait to get back one from you. @harbhajan_singh https://t.co/a1QyOoSY2F Thank you my friend.. missed you too much at home during the party.. keep on Singing!! Love you https://t.co/XybMCO9qKt Thank you so much Akki for the birthday wishes and your stamp of approval for the trailer means the world to us..My congratulations in advance for the epic success of 2.0, your look in the film is PHANTASMAGORIC!!! https://t.co/uJ4YXyGPTM Ma ko Thank you kehna aashirwad ke liye.. love you https://t.co/JNpz1PM8UM जिसका फ़िल्मों में father Anupam Kher हो उसको Godfather की क्या ज़रूरत. Love you too much Daddy cool!! https://t.co/YFVfYHu6Xl Thank you so much my friend. To greater, happier moments and sixers in life! https://t.co/HcstVJmj4d Thank you Bhai. Tu bol raha hain toh sach hi hoga. Tere mooh main Ghee shakar aur Gucci. https://t.co/ZzGj1rJ1Ln Aapne banaye 300 se zyada ya Zero. Aap humesha rahoge humare Hero.. Thank you https://t.co/9NSpR0rC8g Thank you.. my feeling exactly for you... can’t wait to see you again and again and again.. https://t.co/5KIAynchnI Thank you Thug Bhai for your love. Keep ‘Vashmalleing’ all your life (to song and dance with happiness) @aamir_khan https://t.co/xdQGXTyhlM Indian sporting history wouldn’t be so proud if it wasn’t for you. Thank you my friend @sachin_rt https://t.co/FsFeSIibke Thank u sir,for making us a part of your fantastic endeavour.The video is so cool. All the best to all participants. https://t.co/8CCsAPbWQp That hammock in the video is mine!!! U guys stole it!!by the way house looks lovely..but the hammock..damn!  https://t.co/51H1gJ9HDq Arre pehle bana dete toh humein itni mehnat nahi karni Padhti. Very sweet. Now AbRam will lov the film even more. https://t.co/uTRW6eCAEY @Riteishd jab chota bhai bahut bada ho jaata hai. Thank you baby for the love respect and largesse of heart you showed me today. Grateful. Touched. I am so happy to have ‘asked’ something of a friend who kept my self respect higher than his own need. Ab aaya sach baahar. Dekhiye poori baat jaan ne ke liye. #ZeroKaSach\n@anushkasharma #KatrinaKaif @aanandlrai @RedChilliesEnt @cypplofficial https://t.co/vQtVNFPOsM Arre yaar suddenly missing lil Aryan.  https://t.co/edwifo4iFo Love you the mostestest. Thank u for bearing with all my wrongness…always https://t.co/RaBJTB5b0k RT @RedChilliesEnt: 54 Million in 24 hours! Thank you so much for watching and loving the trailer! @iamsrk @AnushkaSharma #KatrinaKaif @aan… Thank you all for indulging me. Had loads of fun talking about #ZeroTrailer and will make sure all the good questions get their Gamcha signed and delivered. Love u all. TaTa ByeBye GoodLoo Bauua Singh and all my other family on twitter. Bhai Bauua Singh...Baar Baar karo...Lagataar Karo. Waqt kum ho toh humein bula lena, thodi madad kar denge. Pyaar mein toh humaari bhi expertise hai...Hum bhi Angrezon ke Zamaane ke ‘Jhelar’ hain...pyaar jhelna bahut aata hai humein...lage raho! #ZeroTrailer https://t.co/nIkzdsXswM I do. https://t.co/ICylPL6rjQ Ha ha. Love u https://t.co/XHxIFyEqZ5 Jumme ke Jumme naha liya karo yaar...hum bhi nahate hain...Gamcha tumhei bhej rahe hain phir bhi. #ZeroTrailer https://t.co/lxV9kc5gcZ Depends how big is your heart!! #ZeroTrailer https://t.co/hBxADj6ZQz Bhaiyya main thoda aapka baaki Hindustan ka Bauua hoon! #ZeroTrailer https://t.co/XMzGr1eh5U Yaar tum Flashdrives Digital Zamaane mein bhi Records pe atke hue ho. #ZeroTrailer https://t.co/CWOTihvWJu ‘Bhai’ se badhkar kya ho sakta hai for someone like me who lost his parents so early in life. Best way to describe Salman is Bhai... https://t.co/CaQT780LRG Too much to explain in a word limit reply. Will put out a video as to how we went about it. Harry&amp; Keiten and Red chillies vfx worked very hard on it. #ZeroTrailer https://t.co/f9kFKVGzNi Thank you. I will tell Bauua Singh to do lip synch...don’t know if he can do the dance in synch though. #ZeroTrailer https://t.co/ycRqIz0KMA God bless you both. Happy marriage. #ZeroTrailer https://t.co/qtyo4fIyQ1 Very sketchy!! Loved it. https://t.co/WvgzTsBJ1F Same as jab sabki hoti hai...DamAge mein. #ZeroTrailer https://t.co/VEPfC95lVd Gulaab Jaamun sorry Two ho gaye. https://t.co/cZe0T219v8 I hope u start believing you are Bauua...he is all of us. #ZeroTrailer https://t.co/LDvt0pFWEU Abe na. Madam ka design taste aur Bauua ka match nahi karta!! “Srk ko Mannat mubarak hum toh Jannat ke khwaab dekhte hain!!” https://t.co/sp2fi2t0lf The only 3D Bauua knows are...Deen..Duniya...Daulat... no it won’t release in 3D...the glasses don’t match his dress sense. https://t.co/FLXdYmcKHc Arre yaar...53 ho jayein toh maza aur bhi aaye. #ZeroTrailer https://t.co/DyNkIZP93E “Shuru se shuru karte hain” https://t.co/OsKEl1Qa4B Zindagi kaatni kise thi humein toh jeeni thi..Himanshu Sharma ki jai ho! #ZeroTrailer https://t.co/dSkil6I2Wz Was a bit chilli!!! https://t.co/13V1Abncc3 Bahut saari aayin, itni ki bata nahi Sakta. Par sab bahut zor se aayin. #ZeroTrailer https://t.co/ma9DSb7lGd I said na...Humne toh ‘chaandon’ ko kareeb se dekha hai. Lucky to have had Katrina and Anushka in the film. Extremely loving and supportive as always. #ZeroTrailer https://t.co/AxnGKzmrcL Yes yes par baahar ladkiyon ke saath bread pakora Kha raha tha. #ZeroTrailer https://t.co/pTkhF4WTAK My friend the absolutely wonderful Aamir Khan. He said...’Oye..!!!’ #ZeroTrailer https://t.co/pt6AWX4wgM Yeh Kaise Hoga? It’s so difficult..let’s do it!!! https://t.co/vksTkSvwO9 Bauua has a purer heart... https://t.co/e2Fhx0DYY2 Pehle trailer toh hazam kar lo gaane bhi aa hi jayenge. T Series se ho kya??!! https://t.co/GcJqAlMW9A @aanandlrai and Himanshu Sharma’s belief in the subject. https://t.co/6SJCIrwgkx Bhai ye poocho Bauua kis kis ko saath le jaata hai! Umeed hai aap bhi saath aaoge? https://t.co/ybcU6we4Cj Feeling a bit happy about Bauua and #ZeroTrailer so thought will do an #AskSrk for any questions you may have about the trailer or film. So please #AskSrk away! Best questions I will send u a signed ‘Gamcha’ (red Indian necktie) from the film. #ZeroTrailer ko itna saaraa pyaar dene ke liye aap sabhi logon ka dilse shukriya!Chote aadmi ko itna bada bana diya \nhttps://t.co/l0QUPvvybX Meerut se nikla hai, atrangi iski chaal hai,\nKoi chhoti cheez na samajhna, yeh Bauua toh Bawaal hai!\n#PictureNahiFeelingHai\n#ZeroTrailer \n@anushkasharma #KatrinaKaif @aanandlrai @RedChilliesEnt @cypplOfficial\n\nhttps://t.co/l0QUPvvybX I believe ownership makes one very small. I believe I am the luckiest man that I no longer own my Birthday also...it belongs to all these beautiful ppl who love me and my family so much. Thank you God. https://t.co/YP1d7TGJ3a Working in progression… hoping to bring the table! https://t.co/gtYFJ11cXo Fed cake to wife...Met my family of fans outside Mannat...now playing Mono Deal with my lil girl gang! Having a Happy Birthday. Thank u all...for this amazing love. https://t.co/8IthQY3cxQ Like always whenever I act with you, I want to thank u for making me a better actor my friend! Love you my Guddu!  https://t.co/xu9tHDkEAp Isn’t she the warmest and kindest! My friend...Thanks for bringing Zero to life! https://t.co/I0HKPiznAH Isn’t she the most beautiful!!! My friend with the loveliest heart...thanks for making Zero come true. https://t.co/5dt4C6EptR Hug from the Thug....!! Beat that! https://t.co/4h0LD0qq1g Sitaaron ke khwaab dekhne walon, humne toh chaand ko kareeb se dekha hai.\n#ZeroPoster\n#KatrinaKaif @aanandlrai @RedChilliesEnt @cypplOfficial https://t.co/tegE4RZCSo Iss poori duniya mein, meri barabari ki ek hi toh hai...\n\n#ZeroPoster\n\n@AnushkaSharma @aanandlrai @RedChilliesEnt @cypplOfficial https://t.co/ZdnFLJp2c1 I just feel like thanking all of u making this journey to Mumbai to wish me &amp; be with me on my B’Day. Please be safe &amp; Love u all. I am ok to die of excess...I welcome starving because of want....just don’t let me succumb to an accident with mediocrity! .@BauuaSingh Suna hai tum jiske peeche lag jaate ho, life bana dete ho... tumhare peeche koi lag jaaye toh kya banate ho bhai..? https://t.co/xVEayKqVWQ .@BauuaSingh meri mummy kehti thi aadmi kapde banata hai, kapde aadmi ko nahi! Aapki DP dekh ke lagta hai ki saat janam mein bhi mera dressing sense aap sa nahi ho payega.Baaki dimples hain mere aapke jaise, uske liye thanks! Tum bahut Kachhe insaan!! oops, Achhe insaan lagte ho! https://t.co/aPvh6ajYY3 I'm in. Are you?\n\nSign up: https://t.co/QF3HYKLef2\n\n#Dubai30x30 #MyDubai https://t.co/jBkXgx9sk5 A special journey that began 23 years ago, goes on even today. Your love has kept Raj &amp; Simran's story alive on the big screen for 1200 weeks non-stop. Thank u for falling in love with us so unconditionally for so many years! #23YearsOfDDLJ Thank you @HyundaiIndia for the wonderful relationship we've shared over these 20 years. I am inspired by the Technology and Innovation Hyundai has brought to India. Proud to be here at the launch of the #AllNewSANTRO. https://t.co/sL6tBy5GSF Varun you have made India proud. I wish you lots of success! #LetsGetInspired https://t.co/gXc6JPb2AE No reason..no information...nothing to share, just ‘feeling good about life after a bath’ selfie... https://t.co/I0ZB3uFFau Spent a few hours with the prides of India...Hockey &amp; @arrahman and the talented #ravivarman Thank u the whole team for making me feel so wonderful. #HeartBeatsForHockey https://t.co/8J9feEzzGW A proud moment for both Manish Narwal and Singhraj as they win a Gold and Silver respectively in mixed 50m free pistol in the @Asianpg2018! Well done guys! Many congratulations to Paramjeet Kumar and Farman Basha for winning Silver medals in Men's upto 49kg in powerlifting in para Asian games 2018! Proud of you Amit for bagging the Gold medal in Club Throw. It is amazing that you bounced back to continue after such a grievous injury. So much to learn. All the best. #LetsGetInspired https://t.co/fJHCxeSp9j I look up to you Deepa ji. Your resilience has been an eye-opener for many including me. Congrats!! https://t.co/X0m0W4KVt6 This is one of the most exciting stuff Red Chillies &amp; ur team is doing my man. Love to u all. https://t.co/gKlUM7xYig Ha ha… I know him. He’s the one they call  Cloud Nine https://t.co/SzMZFxst8l Thank u sir.The pleasure is all mine &amp; look forward to being in Odisha &amp; millions of heart beating for Indian Hockey https://t.co/O3vGAFmC5y Neki aur pooch pooch? Mujhe bolne ki der hai mere bhai, main koodh kar pahunch jaoonga! I wish u and our team the best. Hockey is the pride of India. We will cheer Chak De India!  Thank u for thinking of me. Mera Dil Hockey ke liye bahut tez dhadakta hai!!! #HeartBeatsForHockey https://t.co/2F8XA07Khq Glad you made Hansraj and India proud! Truly motivational...\n#LetsGetInspired https://t.co/B55WdtCw3G Most certainly would love to do it &amp; meeting u will be a privilege. Will put my team to schedule it sooner than soon https://t.co/hX9b0ghJxL Extremely glad for Arpita and @aaysharma... love and success to u now and always! #Loveyatri Kyunki desh humse hai aur hum desh se...\n@SwachhBharatGov @PMOIndia #SwachhBharat #MyCleanIndia https://t.co/sDNmrF5ume Ek kadam swachhata ki oar... @SwachhBharatGov @PMOIndia #MyCleanIndia #SwachhBharat https://t.co/x6WGwYElgk Milkar karein apne Raashtrapita aur apne Pradhan Mantriji ke ek #SwachhBharat ke sapne ko saakaar. \n@SwachhBharatGov @PMOIndia #MyCleanIndia https://t.co/D0hU44DwHz Glad to get my hands on the latest iPhone! Thank you @Apple ... really enjoying the amazing Portrait Lighting. #shotoniPhoneXSMax https://t.co/PaRVINYpUW Thx to the Paralympic Committee of India &amp; Mr. Rao  to allow me to get inspired by the Paralympic Contingent of boys &amp; girls. Learnt the lesson of celebrating incompleteness with grit &amp; courage. Jao &amp; Chak Doh Phatte !! Lov &amp; best wishes to all of u https://t.co/XpfnqVGTud @anupamkher wow mere dost. “Daddy cool is like oh Potchi oh Koka oh Bobi Oh Lola”!! All the best &amp; be happy always. https://t.co/YKxkuSRH2G Saw bits of this extremely well-crafted film. A genre we normally don’t push boundaries in. Wishing my friends the best with this venture and hope u all watch it and enjoy it. #Tumbbad the Trailer.\n\nhttps://t.co/UK3JeiMF4J Me for She. https://t.co/6PsXaxyfyU May we come good &amp; more importantly may goodness guide our way &amp; our baby steps.  https://t.co/KDsVLG2yiI @AnushkaSharma challenge done my way. Love u and all the best for Sui Dhaaga. May everyone’s hard work &amp; belief be appreciated and rewarded. https://t.co/Nc1xb3Jlx6 Well done Champion. You all deserved to win. https://t.co/gpBTUZmOeN Well done Champion. So proud of u and wish u the best for everything u do.  https://t.co/EVEKvxmbWV Absolutely!!! https://t.co/bzRykG1SUF Wow wow wow. Wish I was there 2 party with my boys!!! Lov u Trinidad &amp;Tobago &amp; congratulations for the team...the champions dance &amp; music &amp; thx for making me &amp; @TKRiders a part of ur family. This is how we play...boys each one hav a drink for me..Lov yaaa!! https://t.co/Oi62zWnm3g Our Ganpati ‘Pappa’ is home, as the lil one calls him. https://t.co/G7pSAgeQlj Sunday afternoon...for no apparent reason...feel like being a Parent Philosopher. This is to Thank the kids not to give advice to parents... https://t.co/UR5GEwUVwb I jumped even higher on my bed watching our team. Let’s do this… yay!!! https://t.co/qMr5Hdrhmj Was thinking of spending the day at work. Now all cancelled cos Hippie is coming home..!!!Thx my friend for this wonderful gift. Will read &amp; learn from ur wonderful words as always. https://t.co/sAEN1Np9c4 Papa kehte hain...\n\nhttps://t.co/osPpxKtsB4 Don’t you worry guys. The path maybe a bit more difficult...the resolve needs to get stronger. We will play like we play...@TKRiders all the best for the next one. Love u all. Coming back home to change the game again. Now it’s time for Lego Blocks game  with AbRam. Thx London &amp; Economic Times for the honour. https://t.co/HAMY6HnjXp Thank u all for the support in Trinidad &amp; Tobago. Missing the action music and madness in the stadium. Well played boys...&amp; @lynny50  hav a safe flt home. @TKRiders keep playing how u play! https://t.co/oBm4qybcmt Will get back to work now. As always sorry couldn’t reply to u all but then so many requests for hugs and just a hi. To all those who didn’t get a reply...sending u a bright red pic... https://t.co/H9Gqw6mvg3 Wow https://t.co/SM6uXk71Pe Learning should be fun https://t.co/YgwwHxORQ7 Bless u https://t.co/DOTN67PlSN Thank u https://t.co/6vqdZTBTQh We both got old really fast! https://t.co/LgmGxjvrdF Why clue etc? When I sign them will announce them. https://t.co/A0MbFbnBiL Absolutely. https://t.co/S1NI8R7hFO Apna kaam khud karo https://t.co/Uasz8hDOtd Get back to work! https://t.co/SUH7Hidbel I am more coffee types... https://t.co/uczCuYWsor Maa ko pranaam dena. https://t.co/2Vaym1wZPi Just pray that they stay on your head forever... https://t.co/liRvwdyAGF Yes I hope it releases there soon. https://t.co/RltinjHFRB Wow that sounds so intense. https://t.co/zoqxwY42pY Thank u https://t.co/5REuhcyOJv U make me sound like a double insulted Thermos! https://t.co/AGRd8Y1Wpi Audience has to be happy not me. I just do my best and leave the rest... https://t.co/IF3GvXOuGG Will shoot it in the last quarter of the year. https://t.co/8kpZSDDeXU That’s sick!!! Ha ha https://t.co/wI01un2cJm Har fikr ko dhuein mein udaata chala gaya...or is that politically incorrect to say on social media and all hell will break lose!!! https://t.co/nbuulio01w Will do someday for sure. Give my love to all in Nigeria. https://t.co/81hvrz2qYu Agar dil saaf ho toh end mein sab manage ho jaata hai... https://t.co/490Q6hsbBY Somewhere between very well to fantastic.. https://t.co/ZmAzP5Ngjn Don’t know about motivation. But working has become second nature to me. https://t.co/ArLUcS3RjI Best of luck to you and all who are taking exams. https://t.co/W53zVlOn7W No today. Am at home. Dimples booked by family already. https://t.co/qgeM625laL Speculate on speculations. https://t.co/bU33DOg9f8 No no don’t do that. https://t.co/EBb7jKoZJH Please come will make sure the cake is bigger. https://t.co/fqSAdZ546X Oh no. Now my designer will get angry...repeating clothes! https://t.co/laPGB0MfQP Oh oh yeh to Visa lene se pehle fix karna tha!! Disorganised you...!! https://t.co/ub58T2DVaU AbRam just came and rubbed his sweaty face on my nose!!! https://t.co/Ij6DAxOVdk Ok #AskSrk for 20 minutes. Warning: all questions may not be answered which does not mean I don’t love you all. It only means that even with my super powers it’s difficult to answer 36 Mil of you! Go ahead..Ask??? Always wanted to do this myself. Never got down to it. Thank u so much. Extremely grateful and happy. https://t.co/nSsrGazMuH You are the Force! Your love is the Force. Thank you. https://t.co/Zb6oFJeoYT Happy Janmashtami to everyone. May the msg of love and happiness spread far and wide today and forever. https://t.co/X856j97FZt It’s well worth keeping awake when our team @TKRiders plays such an all round game. Well done boys keep doing wot u doing...&amp; the think tank keep thinking as u r thinking!! https://t.co/GIZTGW9Uh2 What a lovely evening with these elegant ladies. The benefits of being in a tub with Lux soap! Thanks @lux_india https://t.co/Ozjw9UbaGt This is how we play! Well done @TKRiders . Great team effort. https://t.co/yL6K1p9McD Raakhi done...with a promise in the family to respect all women. Respect for women will make u inspired, make u tender hearted &amp; morally strong. Happy Raakhi to all ye bros out there...&amp; respect to all sisters. https://t.co/pSpVSs0ojc For us she is the Cover Mother… https://t.co/8nY89EEgX3 Thank u again.... https://t.co/82WYxfNbC1 Eid Mubarak to everyone. May Allah bless each and all with health and happiness. Thank u for coming home and making the celebrations every time so special. Love from my whole family to u. https://t.co/jbfOi6V7Is Wow @manuz05 @DJBravo47 &amp; my boy @DMBravo46 u guys were fantastic. Best when I watch it from home!!  K Pierre well done. @TKRiders this is how we play...too happy. @resulp Sir, it’s the Duty &amp; Dharma of each one of us to stand by our brothers &amp; sisters in times of need. May Allah bless each &amp; everyone in Kerala. For The Poet Prime Minister of our country, love you Baapji...https://t.co/IKTYouMdiy https://t.co/kLO4JAHvNu ‘Tum hi Bhavishya ho mere Bharat Vishal ke, Iss Desh ko rakhna mere bachhon sambhaal ke...’ Happy Independence Day to all. Celebrating at home with our future generation of gentle, kind &amp; pure Indians. https://t.co/2lfHjA8Iv9 ET coming home.... https://t.co/J7dIyxQhMc Was a pleasure meeting you sir. Couldn’t say it then but one of my all time fav players. Please do say a big hello to the commentary team and Mel when u see them. Thks for the love. https://t.co/uWYHlOs7A1 Thks for the love Trinidad &amp; Tobago. Wish could spend some more time with @TKRiders as they get on the road. Play well &amp; stay healthy boys. Will see u soon again. @VenkyMysore &amp; team had too much fun. https://t.co/vOoE80821w Shine on my young Knights! 22 medals at the World Children’s Winners Games in Moscow! Amazed. Love to all of u and continue to make India proud... @MeerFoundation @KKRiders https://t.co/CP5qIdVKAE Thank u this is so sweet. Will show it to AbRam.  https://t.co/oYOV6xnlSq My friend and Captain @DJBravo47 Scores Swings Swags and Sings...This is how TKR play too.  https://t.co/MVtzrPtnvS https://t.co/LjUvMsCOMh Thank you @emaardubai ... was a delight to be there. https://t.co/UO67vvvbkO The full poem I quoted yesterday... https://t.co/J3u6P1D8ap Thank u. Am so glad u felt she is congenial, gives me an opportunity to take credit for no reason. Love to u https://t.co/iRuLMuXtKd This too… https://t.co/SAwo6P4xyE Holding her in my arms again thanks to Vogue. ‘What imperfect carriers of love we are...” except when it comes to our children. So sending u all my love &amp; a big hug. Hello Suhana Khan! https://t.co/RrkhJ8kfz5 My friend the multifaceted @dhanushkraja new film’s teaser. Very edgy &amp; intriguing. https://t.co/5mlf4F3Byq @emraanhashmi Be! Be! Welcome aboard my friend. Here’s to a journey full of excitement &amp; drama.  https://t.co/ZQU7F3IhUc The best message I think this pose has conveyed. Please please follow traffic rules. https://t.co/9lyFqj2ZB6 @jiteshpillaai Happy B’Day my friend. May u be healthy &amp; happy. Also hopefully hav less stress with star managers &amp; their entourage. Keep making stars look beautiful &amp; u exercise a bit. Allah bless u with more goodness. Good going my friend. Lots of love to u &amp; the entire team. Really looking forward to ur work…again. https://t.co/ig3V3BDN8I Well done boys and girls. Goodness begets goodness. Thank u for loving the children. https://t.co/TT6MW2BDEZ @iam_juhi The love u, Bobby &amp; Mom, Aziz &amp; Ratanji gave me in this film gave me the confidence 2 b who I became.Lov u https://t.co/y7KDQsomQm NYTimes is carrying great news.. https://t.co/EaKjcaUYmZ There are so many lovely pictures of her, but this one speaks to me beyond my friends beauty....hope u all also give it love. https://t.co/yYpioBa6ds It’s Katrina Kaif’s Birthday and we all at #Zero miss her!!! Maybe I should put a picture of her from the film and send out a loud Happy Birthday wherever she is??!! Palat palat palat…Hi @ilynnraj sorry I should have hugged u too. Big hug now… and love. https://t.co/UOBYzXRH9B Woke up and felt a genuine wave of Pride Love &amp; inspiration. What an amazing athlete you are...#HimaDas Kya Baat hai! https://t.co/gcDnyXxwRj The women on the sets made us take this...and pyaar ही प्यार, बेशुमार हो गया। Through the windows to our souls...we found the same thing... https://t.co/zNSNXGbC0L Now I will know what my boys are doing even in summer vacations! #KKRAcademy #KKRFamily #KKRHaiTaiyaar https://t.co/Dzw0EDovOc And u will always be close to our hearts…u will always be the one jisne ‘Maar Daala!!’ https://t.co/UgGM7CLqYM Arre yaar…let’s meet soon. It’s fun chatting with u always. https://t.co/RaOSzACWAr Give them my love please.  https://t.co/piCGAEIFvL Thank u this is so sweet.  https://t.co/dn9uVQhvKG @hannahgadsby thk u for  telling ur story. Strange to  just praise #Nanette as a show, but everyone do watch it to ‘feel’ a part of her life Thanks my friend for spreading the goodness. It’s important to inspire so many kids who look up to u as their hero. https://t.co/nTyGVSrrrr After years the wife has allowed me to post a pic I have taken...she’s @gaurikhan all heart! https://t.co/QfAJajRlim Thank u so much. Will see u all when I come to Peru someday. https://t.co/uprPayJ7Cu We don’t keep photo albums anymore… but I will make an album just to keep this pic with the great man forever. https://t.co/gYN24yMNyk Maybe being a little formal but have to thank...my dearest @gaurikhan for putting up 26yrs video.  @BilalS158 @parakramsinghr for making it. @pooja_dadlani for being so kind &amp; my friend @aanandlrai for taking out time to shoot it. Very touched.. This journey is incomplete without u all. Here’s telling all of u who made this possible how happy u make me feel. https://t.co/UERsuXjTiw All this is humbling and absolutely amazing. Thanks for making me the subject of your talent!  https://t.co/xRMUR7f7AT This is done so well. Thank u Peru. My love to u all.  https://t.co/HFSmk2Cjn7 How time flies! Can't believe it's been 20 years since our journey began together @HyundaiIndia. #BrilliantMoments is a wonderful way of celebrating a treasure of moments that we have collected. Here's to the eventful 20 years that were &amp; to many more that will follow. https://t.co/k3rQTxewBY My lov u r a pleasure 2 work with. Wouldn’t go on a journey like this without u. Miss u.Can v call u back for a day! https://t.co/XXEQVwgCpe Uff this Maradona adds so much stress. Love the Nigerian team but have to have Argentina in the play offs. My Phews continue… Tomorrow will be exactly half a lifetime of being ‘others’. Expressing love,happiness, sadness,dancing,falling &amp; flying. Hope I hav touched small bits of ur hearts &amp; hope I can do so for the whole lifetime... ’रोशनी मेरी बहुत दूर तक जायेगी, पर शर्त यह है, की सलीखे से जलाओ मुझको ‘ My favourite teams are testing my blood pressure. Double phew Germany!!! Just…on a Rainy day. When u feel, u r Not the place of truth…when u feel sad…just remind urself, that this world is Tiny, as a matter of fact it’s way smaller than your tear. So don’t waste them… I think it’s that time of the day when I should go &amp; write in my book...or not. @anubhavsinha Dildaara Dildaara have a great day. Be healthy and happy my friend. Happy Birthday. My love to u. Brazil….Phew!!!! A film never finishes...but so many beautiful things come to an end around it. Thanks everyone for a very fruitful &amp; hectic shoot. #ZeroTheFilm https://t.co/Qw5McL2WiQ Notwithstanding that the kids had no other option &amp; yeah I admit maybe there is just a hint of a bias here...this kinda completes a fathers life. https://t.co/UDBVYDzAMp Love is always only in the eyes….here’s all of ours to u on Eid. Eid Mubarak to everyone &amp; may ur families be happy &amp; healthy. https://t.co/afAvn2OJo3 Thank u my friend. U appreciating &amp; smiling is the biggest compliment for the teaser. Will show u stuff soon. Love https://t.co/yZ0caLGK2I A big thx to bro @BeingSalmanKhan &amp; @jaavedjaaferi &amp; @Harry0073 @vfx_redchillies &amp; @aanandlrai for  making the #Zero dream come alive.Dil Se Join in at 7:30 pm tonight and watch the #ZeroTeaser across the Zee Network... https://t.co/5W3QvFWNXZ Our creativity is nothing Sir, if u r not there to put it all in order. U r the Bossman who gives us wings to fly!  https://t.co/npewAFbKiL Kitna accha hai. Sabko bahut bahut pyaar. My love and hugs to the babies. https://t.co/W77sSkTz83 Tell her to keep smiling. I will pray for her recovery fast.  https://t.co/lM2Rw1Mkv8 Thank u so much. U r kind &amp; it’s so nice to have appreciation from an absolutely AAA+++ actor like u. Love to u https://t.co/ZGmGt4yWos The u Zee Group for everything u are doing for our film. Wanted it to premier on ur channel. Please all watch on Zee.https://t.co/s1aFMV4oeS Yeh lo..yeh lo  @aanandlrai ki taraf se...Iss baar Eid Ka Meetha bahut Tez hai. To everyone from me and the whole team of Zero...Eid Mubarak. Love u all &amp; hope u like it. #ZeroCelebratesEid https://t.co/fgynMfTjTX Waiting for the link to reach us so that we can put the Zero Teaser out. @aanandlrai &amp; me waiting on the streets of America to wish Eid to everyone. Just a few moments more!!! #ZeroCelebratesEid https://t.co/ps2hji0PGb The strive for excellence is a lonely strife...mediocrity has no dearth of friends. Or as Alfred Lord Tennyson put it...’To strive, to seek, to find and not to yield’ Was reading and came across this line....’ Life doesn’t come with a manual, it comes with a mother ‘ and then this picture of the ladies...sach hi hai!! https://t.co/sk0CwIMoMP Ok work beckons. Will do this again soon. Thank u all for your time. Love to all Thank u but my problem is opposite...I am always on a high! https://t.co/fsZXEY6ZHt OMG OMG!! Better save AbRam’s clothes just for in case your dream comes true..kaam aa jayenge https://t.co/alixtVHmV6 @aanandlrai has made one for teaser for Eid. Hopefully u will all like it. https://t.co/TtihYdksFE Suggest some haven’t had time for reading...&amp; Netflix is slowly taking over my time! https://t.co/2fuhEyWDGy Thank u for your support. KKR always tries their best. This year was good too...let’s see next year, Insha Allah https://t.co/kW1NxyJz6a Would have been more helpful with her  if she was from Bandra, but all the best man https://t.co/Obz7RljSrY Bhai ab Messi ko bhi wish karna padhe, aise din toh nahi aaye. He makes his own luck and goals. Best to him. https://t.co/CTsDsTboy6 Not real...no animals or humans are hurt during my shootings!!! https://t.co/rEBSXSR630 Padhta hai... https://t.co/Q2GbyMHoZn Close but won’t pass scrutiny!! https://t.co/mom8bTOFwE Wish u the best https://t.co/5tmDLKPqYE Love to u https://t.co/X3T3KmmSSX Like I said I notice everything u all write and send https://t.co/hSWzd0w4Vy Love u too https://t.co/aPYQSv1bSA Would love for Armaan to do music for me.. https://t.co/12rDTHNHNz I have three beautiful children and a lovely wife and sister..have no space for empty... https://t.co/TUnx1laomz Have a good life https://t.co/rNDE1zHMlo Wish u the best https://t.co/ky9BeHQ3VX I would reply to u but I don’t know if u r appropriately and fashionably dressed for my reply... https://t.co/r33eNR3fbs Main bhi usse bahut pyaar karta hoon... https://t.co/tkEkruA0mm Please tell her not to fight... https://t.co/GNwfKP0LnF I will pray for her https://t.co/n6J85HOFwn Jahaan bhi honge Namaaz padh lenge aur sabko gale laga lenge https://t.co/LGJHGoMWdy Aap sabko bhi Ramadan Mubarak... https://t.co/2A1Oo7ZKUW His emotions fly... https://t.co/0nJvMHSMqk Khush raho https://t.co/tQ7rldyND9 Love right back to man https://t.co/t6S9vYScMd I know (sigh) kya Karoon... https://t.co/EwzlbH1msU U should not ever equate your worth to money...u r precious in your own way however small or big...doors close for new ones to open..be positive. https://t.co/rfZALfaB5R One is to one I guess now that I have replied to you... https://t.co/LEQfjYX9Rv Going good by God’s grace... https://t.co/shhJXw8hLu Nahi abhi abhi uthaa hoon...in the coffee phase at the moment... https://t.co/4n4spfDnF5 Been busy with work so haven’t had a chat with you all for the longest time. Let’s do an #AskSRK for a bit... As an actor I have always wondered how closely the expression for reminiscing matches the expression for looking forward into the future. Like the circle of life...like #Zero. Here’s to looking forward to love life creativity &amp; wisdom as we move on... https://t.co/t1VefRdRAE Wishing my Captain @DineshKarthik the happiest of Birthday. Not because it is customary to do so, but because nobody else deserves it more. We have such Few Good Men left...so need to celebrate them. Love u man. Be healthy &amp; happy. My sunshine turns 5 yrs today but he thinks he is 9! Please don’t tell him otherwise if u meet him. Children should hear their own music, sing their own songs &amp; believe in their own lil dreams...&amp; yeah, hug their papa a lot.. https://t.co/sRFxJLdVHh @DineshKarthik u r a fabulous leader. A special thanks to the management which made this possible despite naysayers...@VenkyMysore @jacqueskallis75 #Simon Katich #Heath Streak #Andrew Leipus @adrian_leroux @arsrikkanth &amp; all of u. #KKRHaiTaiyaar Well was not to be. Will have to cancel my flight but KKR well done. U did yourself proud. All of u so so well done. Love you &amp; yes I am smiling. Thks for the entertainment &amp; so many moments of glory. V r an awesome team! https://t.co/BtGDrikag5 Well done yourself mate &amp; keep making the noise in the changing room to keep the spirits high. C u soon https://t.co/QKeBw4RFLu Thx again @DineshKarthik &amp; all u boys for the joy u r bringing to all of us. &amp; especially happy to see @RealShubmanGill coming into his own. Also a pleasure to see Dada with the Dude at Eden. https://t.co/8la7x2yMSq RT @NokiamobileIN: The big win is near and the team needs your support. Send us your own creative cheer using #PlayUnited and tagging @Noki… Missed talking to the fabulous boys from KKR...was getting ready for shoot. So in the middle of my shower sending  all my love. Wow #KKRHaiTayyar so so proud and happy. https://t.co/CAKugAXDik Like all daughters, I knew you were always meant for flying...and now u can also legally do what u have been doing since u were 16...!! Love u. https://t.co/9ZRytlZDN2 Thank u Wangdi Bhutia for your love &amp; this honour. The whole KKR family will pray for ur success on this awesome journey. Really this is a big honour. Love to u. We will all try to be as brave &amp; adventurous like u #KKRHaiTaiyaar https://t.co/WuvjQMa8MC Been awake 24hrs to see these smiles. Thx @DineshKarthik @prasidh43 (well done young man) @robbieuthappa ( v have to exercise 2gether) @lynny50 (wow mate) &amp; @SunilPNarine74 is...Sunil. Very happy cant sleep now!! https://t.co/gdJWwBOG2K “Friday Night: Me u and my leather jacket...” Finally a chilly enough day to wear my jacket &amp; yeah 60’s kinda hairstyle. This is the most fashionable I can get...! https://t.co/gisKHAhyj6 As much as I love my team, here’s the deal. I leave the cricket to u &amp; u leave the acting to me!! Ha ha https://t.co/lJ15cgEYxZ RT @RedChilliesEnt: You’ve seen them smashing it on the field, now watch them rocking the screen - the @iamsrk style 😎 #KKRHaiTaiyaar\n\n@KKR… Thank you Kolkata Fans for always being there. You are the best of the best in IPL. Last home game in the league sorry wasn’t there. #KKRHaiTaiyaar https://t.co/1o9plLQYSL And smiles to go...and keep from @DineshKarthik to me. Well done @imkuldeep18 with ball &amp; interviews. @lynny50 who is getting sane! @prasidh43 @ShivamMavi23 &amp; @SunilPNarine74 is Sunil! https://t.co/UnCsvZbuqZ Yes lets… https://t.co/vDOkpbEhqc My Captain @DineshKarthik asked me to smile cos I was so disappointed at the match before. This pic is for him.  Thx @Russell12A @prasidh43  @SunilPNarine74 &amp; #KKRTeam. Onwards &amp; up... https://t.co/G83DqW8Iwm Sports is about the spirit &amp; wins/losses don’t reflect that. But tonite as the ‘Boss’ I need to apologise to the fans for the lack of spirit Kolkata see u at Eden. Let today’s cheer be the loudest for KKR. https://t.co/oEtKwYFR88 I kind of know, how it feels when a piece of ur heart gets married. Danced &amp; celebrated love for daughters with my inspiration Anil Kapoor. Go KKR!! Great to see @NokiaMobileIn cheering on @kkriders as we move into the crucial stages of the league. https://t.co/XPitgIDplk Calm &amp; collected win like Captain @Dineshkarthik himself &amp; my babies gaining in every match @realshubmangill @shivammavi23 &amp;Narine is Narine Now only if we could have the brilliant outlook u have for life sir. Aapka Nazariya seekhna hai sir! https://t.co/OTiGl6jRcx How much fun we all had doing this. Only @TheFarahKhan could have managed fun and success in such a huge dose.  https://t.co/wMH1hmybl8 Good team effort @KKRiders Happy to c @lynny50 come into runs. Well done @DineshKarthik to go with unchanged team.  Robbie &amp; Russel awesome Thanx my man for a rapid fire happy shoot yet again. U make me look good!  https://t.co/WWzxPb2rrz Was good to meet @bharatrb at @Conares again, at the inauguration of the new 12\" Pipe Mill. Wish u and ur family the best! #letssteeltogether #steel https://t.co/9KECGPxrVa Had so much fun meeting u all. Thanx to my friends @KalyanJewellers &amp; their family for making this possible. Till we meet again...&amp; dance some more... https://t.co/hKZ1Hbn3yG Little tired with work but get all rejuvenated cos of your love. Thank u all... https://t.co/8md5FcZgya So glad to see the babies r settling in, Curran Mavi &amp; Gill. Dk Piyush Rana Kuldeep Robbie all showing the way to them. Sunil remains Sunil &amp; Andre &amp; Lynn ready to explode. Wow! Am I glad to be in ur team! #KKRHaiTaiyaar What is far, is close and close sometimes,\nIs farther than the Sun...that’s our film. Thanx  @aanandlrai &amp; his team &amp; @AnushkaSharma for all they r doing. \n#ZeroTheMovie https://t.co/N45cN35O46 Well done my KKR. After a long time a 200 score. Met Karthik’s mom &amp; Dhoni’s daughter. My day 2/3 rd successful. Thx CSK fans for the love. Bahut acchha hai. Humare anthem se better hai cos KKR is your team &amp; u make it what it is. Love u and thanks. https://t.co/zcROYbYcnH Always a pleasure to be in Delhi. Thank you.  https://t.co/Vh3v5GpM1b Great to see our old friends @NokiamobileIN with @KKRiders again! https://t.co/uJ5zr7uioO We started with 3 guys Keitan Harry &amp; Arjun with a dream to Make it in India a v/fx company that gets our cinema ready for future. Still some way to go but Blue screen Dreams take a bit of time. So proud... https://t.co/IOsCM4q4Ol My Fanboy moment. Inspiring to hear Mr.Nolan &amp; Ms.Tacita Dean talk of the virtues of celluloid as an artist’s medium. Thanks @shividungarpur for having me over https://t.co/08dyi0kmwz It’s #KKR time of the year...again. Korbo Lorbo Jeetbo. https://t.co/uSs52k0cNY I am loving &amp; living making Zero the Film. Thx @aanandlrai &amp; the whole team for this. Only way to describe it is ‘ I am growing up very fast into a child...very fast’ @rahuldholakia yes I remember. I have seen it 200 times since then. Ha ha. A poem I read on way to work...’ I don’t pay attention to the world ending,\nit has ended for me\nmany times\nAnd began again in the morning. https://t.co/MHwkXeaUdg A lovely holiday climaxed with the new Speed Skiing champion of the world by my side. https://t.co/8pjbEH4qd4 @gaurikhan here’s the rest of it...My lil holiday with the lil big skier...in the bed, in the lift, in the Alps...With him, one does get more than one can ski...always. https://t.co/gnVkBeyyC7 So happy for you @juniorbachchan All ur passion perseverance &amp; pyaar pays off for ur team. Congratulations &amp; to many more. Cos she doesn’t eat ice cream in real, Cos she has worked so hard &amp; cos this reminds me of Darr...on @aanandlrai #Zero the film...’I lov u kkkKatrina..’ https://t.co/YWZYClrcOQ ‘Remember to look up at the stars and not down at your feet. Try to make sense of what you see, and wonder about what makes the universe exist...’ thank u Stephen Hawking, for making the world we know &amp; we don’t know, a place to look positively at. My media manager strikes again!! #KatrinaKaif extremely disturbed with my last dark selfie took it upon herself to rectify my photography game. Here is a sample of her amazing love for taking pics &amp; keeping us all so entertained on the sets. https://t.co/OOkoKMljPp I took this pic in colour on the way to @aanandlrai #Zero shoot. It’s taken so long in traffic, the colours have faded... https://t.co/eLfJbYW1jg As we stand poised for a new season of KKR we welcome @DineshKarthik as our Captain. Like our Captains over the yrs we know u will also lead us by boosting the self esteem &amp; dignity of all of us. When the company is sooo scintillating &amp; exciting that u can’t keep ur eyes open! Serves them right for calling me to early morning shoots for #Zero ( Pic courtesy: Katrina my media manager ) https://t.co/eNnzchfVV0 Was watching one of my favourite stand up..@chrisrock and he in his own inimitable style reminded me wot life should be about...The quest to find God before God finds you... https://t.co/EZj4PlLMUH How can one not just feel love &amp; beauty &amp; be grateful for a life that became a part of yours in some small way by making it prettier....isn’t it just easier to feel love &amp; give towards that life, even in death...the comfort of appreciation and gratitude. This truly was business... with pleasure... at the #ETGBS... thank you @economictimes @vineetjaintimes and Deepak Lamba for having me over. https://t.co/IYoD3yHumC You are cooler than the ‘King’ my man. Great to meet you. https://t.co/qheyrOrL5G Public declaration of love for a ‘lady’ who has come to my country, India. U Simulate me, every bit and byte of u, Sophia. https://t.co/HxAhTORpHD Always good to receive gifts that are as beautiful as these... thank u to all the kind hearted children at @ChangeSPARKers ! Keep spreading the smiles... @MeerFoundation https://t.co/pyKPplqdrU Wish this was a post work out pic. But it’s only a post clean up of the gym picture. Came across a Bullworker! in the gym archives, a sign it’s not been cleaned for years! https://t.co/jn7NE1PYLx A small effort in that direction. The ladies were so affectionate and warm that evening.  https://t.co/ItK2DdF6e2 Hand made love from beautiful women. Millions of rural artisans with unique skills; this is them celebrating their empowerment. I’m told women love my voice…will always be a voice that stands by them. #Hansiba\n\nhttps://t.co/5xefC9PERf This didn’t go as planned...but on a lazy Sunday afternoon, with my limited floatation expertise..this is the best I could do! Judge nahi karna, feel karna...Thx. https://t.co/50miTK7QKK Thank u. Always fun to do an interview with u. U r such a decent man. May ur tribe flourish. Bless u.  https://t.co/KhATRpw2Bb Build good associations around yourself and ride on...20 yrs with @HyundaiIndia &amp; learnt that whether it’s a vehicle or success both should be noiseless... https://t.co/daXU1Rtkkh Would love to my friend. But working in Delhi. Have a great show and share some love with Pune.They r with wonderful https://t.co/ho93fbXM95 Man &amp; Machine ...for they shall inherit the Earth..?? https://t.co/R6cvt7V1UD ...for they shall inherit the Earth..??? https://t.co/62tKuko27V Wow. What a proud moment for young India. Well done lil ones…May u keep conquering the world. And keep playing FIFA ...on the side. A great morning. https://t.co/2aLycIud95 So sorry didn’t realise it was u, cos now u r Khilji for me. Bahut acchhi picture hai bhai..I saw it and loved it. https://t.co/9coSNSAmNq Sir I listen to whatever my babies listen to. Ranges from Twinkle twinkle to Rap which I can’t make head or tail of. https://t.co/JNvbKeAgoz U need to go easy on the Samosa and cake my friend that’s why I ended the chat so soon. Ha ha https://t.co/SD8e3tV59N Need to get back to work now. Baby also back. Thank u for ur time. Till next time now…#AskSRK Pyaar mein conditions nahi hoti https://t.co/ZIOdv9ZI0C Yes absolutely in my blue India jersey https://t.co/pYt18laQZp Only the good die young..RIP https://t.co/fwT2otKW4s Will miss him.  https://t.co/cAbW58egDV Kabool hai keh dena Dulhe ko please https://t.co/5JbYmKPzRK Looks r not important. Look at me!! https://t.co/AdipgzMZB3 Oh that’s scary. Please be careful and don’t do such dangerous things. Please https://t.co/qGQHu1scjO He is extremely sweet. Made me a huge hit with my kids by doing a pic with me.  https://t.co/t83VP5y03a I have seen all their matches and I wish them the best https://t.co/gc7GDtaB8s Random thoughts lose space in a calculated zone.  https://t.co/6QEXNHqVhx Thank u https://t.co/SWILyqW3En Our philosophy at KKR is nurture &amp; believe in youngsters. I feel we will come good.  https://t.co/9FyjiilJfu Very little otherwise would have shared it with you!! https://t.co/y3cciYybjz Nooo please don’t. Do a bit of exercise. Read a book. Don’t think too much about yourself. Life is good https://t.co/RqFFTAksuG She was so beautifully strong and gentle.  https://t.co/NI0hTycYzV Both joined to my body… https://t.co/XwPLuUR3Dz Most fun till yet… https://t.co/vykyruIhpi Wow! Thank u. Will tell Hyundai to copy the design!!! https://t.co/xpR5492Tyv Will tell the team to get in touch with u https://t.co/lb1eWYqo3v So sorry. But life has a way to heal itself. Trust yourself more and don’t forget to pray  https://t.co/D1ImprpljI Ha ha. Abhi toh main jawaan hoon. Bahut zindagi baaki hai. https://t.co/dismQj11BQ More responsible to do the most I can https://t.co/u74rLmj6p0 All the best https://t.co/7cxBfi18HU Two words..Aur Paas… https://t.co/LW75vAlkYN Very very good https://t.co/fN3NDkgGBS May God bless her with health.  https://t.co/0NcJAzo6yy Yeh ho jaaye pehle. Then will decide. https://t.co/LXcjYMQQoH Ice ice baby! Did an amazing dance with the lil one on that. My Fred Astaire moment. https://t.co/bKpKYjbMKT One of those rare days when I am free at home &amp; family is working!!! Should we all come aboard for a bit and do #AskSRK LETS GO Best memories begin with insane ideas...Girls taking me along for a ride called #Zero @aanandlrai #Katrina @AnushkaSharma https://t.co/iSgiEF1qY8 Very sweet thank u https://t.co/1qBcIy59z0 Last episode Ted Talks india. Hope the ideas discussed give u all some ideas. Thanx Star Plus Team @julietrblake &amp; all who put it together Goodbye Davos. Thanks Prof. &amp; Mrs. Schwab for the Crystal award. To all  wonderful people  at Davos for being so gracious and lovely. https://t.co/f2CGhuP5Q3 You are the loveliest. Thank u for such a happy day.  https://t.co/84ZKkbf3Dj RT @TaniaBryer: With the legendary @iamsrk today @wef interviewing him about his films, family and philanthropic work #equality #CrystalAwa… Switzerland main aake yeh na kiya toh kya kiya...?! Loving being at the Davos, now to get ready for the Crystal Award Ceremony. #DavosDiaries https://t.co/c95SwSR0v2 Honoured to receive the @wef’s 24th Crystal Award, together with @eltonofficial and Cate Blanchett. My fan moment!!\n\nWatch the #crystalawards via https://t.co/rILPgHRgtL at the #wef18 meeting in Davos. Bhai Sahib kaafi thand hai!!! Hope to find some love &amp; friendship to keep me warm here. Thank u @wef for the honour &amp; having me over. #DavosDiaries https://t.co/4xaQQ3qNbJ Does happiness have an address? Pursuit of happiness on #TEDTalksIndiaNayiSoch, Tonight at 7pm @StarPlus @TEDTalks https://t.co/BsJAGIMwGm This one was special. It was a complete disaster and completely written off. Our failure made us, Aziz @iam_juhi &amp; me stronger. Love PBDHH Traffic maketh you a photo editor...besides late for work... https://t.co/xlvHKY93Xf Celebrated Makar Sankranti the festival of harvesting &amp; happiness for our farmers around the country by flying a kite on @aanandlrai sets of Zero.  Too much fun... https://t.co/P5ftZY3vsI Learning should never stop in the school of life! \n#WonderOfLearning on #TEDTalksIndiaNayiSoch Tonight at 7pm on @StarPlus @TEDTalks https://t.co/Wux7Ai7qpx Come Live your Dreams in Dubai #BeMyGuest @visitdubai \n\nhttps://t.co/JCN5chpYWu https://t.co/qLQieLGKGM Peace and happiness to all of you this Lohri... #HappyLohri https://t.co/BaBGCtLiR8 Come make new memories in Dubai. #BeMyGuest @visitdubai \nhttps://t.co/JCN5chpYWu https://t.co/lo1EU3Scii Come experience Dubai - a place filled with memorable moments. #BeMyGuest @visitdubai \n\nhttps://t.co/JCN5chpYWu https://t.co/DMdqfpXKBm Thank u for this honour. I consider my work with these heroic &amp; beautiful women a great privilege as it imparts dignity &amp; purpose to my life. I hope to spread awareness of the unparalleled heroism of these ladies &amp; reach out to others in order to carry this work to its conclusion https://t.co/i6cEU6go6V It's their first journey together in Dubai. Stay tuned for what happens next. #BeMyGuest @visitdubai \n\nhttps://t.co/JCN5chpYWu https://t.co/ShJNuZg4QA #Mukkabaaz + Baazigar = Mukkabaazigar... all the best team for Mukkabaazi... \n@aanandlrai @cypplOfficial @anuragkashyap72 https://t.co/CBhSPfCneN A little boy makes it to a big game in Dubai. Will he score the winning goal? Coming soon #BeMyGuest.\n\n@visitdubai \n\nhttps://t.co/JCN5chpYWu https://t.co/oVRPr2IhHU Thanks. Is it appropriate that this is lil AbRam’s fav song…ha ha.  https://t.co/og8Y4sG5rY Holidays as they say should really be given a speeding ticket...hate dropping my kids to the airport....when holidays end... https://t.co/B3T4sr6TvC There would be no progress without equal power to all. #PowerToWomen on #TEDTalksIndiaNayiSoch Tonight at 7pm on @StarPlus https://t.co/Kh2QeIIQxy आज रविवार को पहले ख़ुमार आ रहा था। फिर बच्चों पे प्यार बेशुमार आ रहा था। अब कुछ देर से बहुत तेज़ विचार आ रहा है। चलो देखते हैं  #TEDTalksIndiaNayiSoch 7 बजे Star Plus पर। ऐ काश के हम होश में अब आने ना पायें...बस ऐसे ही रेडीओ पे बज रहा था तो अपनी याद आ गयी। ज़िंदगी ऐसे ही मदहोश रहे.... https://t.co/sVjVwLZKQJ For the love of gold... within you.\n#AndarKaSona with #TEDTalksIndiaNayiSoch @StarPlus @TEDTalks https://t.co/YiSOJpNEaI बहुत बहुत धन्यवाद। आपकी किताब मिली और पढ़कर बहुत अच्छा लगा।  सोशल मीडिया पर आपने साबित कर दिया की हर जगह पर अच्छी बातें ही पसंद आती हैं। और “टिक्केटें लिये...” वाली पंक्तियों के लिए भी शुक्रिया । https://t.co/XFg5xhcyeK Thank u all for making Zero feel like a Hero. Sometimes our importance in life is not who we are, but what we make others become by our presence in their lives. @aanandlrai ‘s ‘Zero’ stands for that. #Zero20Million शुक्रिया आप सबका कि ज़ीरो को हीरो बना दिया। आदमी का वजूद अकेले चाहे कुछ ना हो, परन्तु दूसरों के साथ लगकर उनका मान और औहधा अगर बड़ा सके तो ज़िंदगी का मज़ा कुछ ख़ास हो जाता है। @aanandlrai का ‘ज़ीरो’ कुछ ऐसा ही है। #Zero20Million नए साल की सबको शुभ कामनाएँ। सब रहो ख़ुश और आबाद और ३२ मिल्यन के लिए बहुत बहुत धन्यवाद।वाह हिंदी में लिखा तो कुछ कवि सा हो गया!! #२ज़ीरो १८ इतना सारा प्यार!!! #2ZERO18 की शुरुआत बढ़िया हुई...\n3.2 करोड़ लोगो के प्यार के लिए शुक्रिया।\n\nThank u to the 32 million on Twitter! https://t.co/ODZc4Bq1RT Incomplete without u my friend. U make us want to act well with ur ease &amp; understanding of characters. https://t.co/YdUGTRafTZ RT @Mdzeeshanayyub: And here is the title of our next from our best\n @iamsrk @aanandlrai @AnushkaSharma #katrinakaif #himanshusharma\n  #ZER… टिकटें लिए बैठें हैं लोग मेरी ज़िंदगी की, तमाशा भी पूरा होना चाहिए!  \n\nAs promised, here’s the title of \n@aanandlrai ‘s film. \n\n@AnushkaSharma #KatrinaKaif @RedChilliesEnt @cypplOfficial #2ZERO18 \n\nhttps://t.co/V7xtLY2k5u And now let’s watch Ted Talks India Nayi Soch. Star Plus par. And me also waiting for @aanandlrai film Title with the girls and the whole team. Happy New year all u very loved people. #Kal5BajeSRK https://t.co/1904UTRD08 And the lovely away from the glares extremely Unsingle @AnushkaSharma sends her love to everyone as she awaits the Title of her @aanandlrai film. Thanks my scientist Anushka. #Kal5BajeSRK https://t.co/VV0HVwBZwH Single minded Katrina waiting for Title of film with @aanandlrai sends her lovely pic wishing u all a Happy New Year. Thank u Katz #Kal5BajeSRK https://t.co/2okhva1yCc @aanandlrai @AnushkaSharma Chalo to phir done Raha! Kal Shaam 5 baje... \n\n@AnushkaSharma #KatrinaKaif https://t.co/RTS031dMPm @aanandlrai @AnushkaSharma Accha rahega...Par sirf title announce karoge ya kuch dikhaaoge bhi? @AnushkaSharma #KatrinaKaif https://t.co/6g2Ud9QDFD .@aanandlrai sir, title kab announce karna hai? Ya 2018 mein bhi gaaliyan khaani hain?! @AnushkaSharma #KatrinaKaif https://t.co/nGdd7EcH96 Do you know who is TED? #TEDTalksIndiaNayiSoch, Tonight at 7pm only on @StarPlus @TEDTalks https://t.co/1Q39e4c68V Thx @KalyanJewellers for ur lov &amp; hospitality. Muscat, lovely 2 c u all at the Kalyan stores &amp; 2 meet my collegues https://t.co/iZfh1W3ihJ My love and most most happiness to @AnushkaSharma @imVkohli  so happy to see them married. https://t.co/fREWJJ9kYr Create memories that will last a lifetime. Spend some happy moments with your family &amp; friends. And be a good Santa to your kids... Merry Christmas!! https://t.co/4MlSFWj2tM These women are an epitome of both beauty and strength. Join me and these divas on #LuxGoldenRoseAwards tonight at 8pm on @StarPlus #IAmMoreThanYouCanSee https://t.co/YWZH9wUYEh .@karanjohar My friend. A man. A parent. #ChangingRelationships \n#TEDTalksIndiaNayiSoch, This Sunday at 7pm only @StarPlus @TEDTalks https://t.co/j3GxPKCW9y Have seen Akash, Isha and Anant grow up and it is lovely to see them take forward the values and ethos of Reliance with such grace. Looking forward to celebrating with them tomorrow. #RIL40 https://t.co/9eTt9qnhbi Not so sorry! #UnapologeticWalking with #TEDTalksIndiaNayiSoch. @StarPlus @TEDTalks https://t.co/ElU7dxhlUT @JohnCena thx for taking out time to ‘See’ it. Wish I can ‘See u’ someday. Love &amp; health to u my man. https://t.co/P8GyVWjAzT It’s all your hard work @julietrblake &amp; tenacity. Hosting Nayi Soch is making me a better person. Thx for watching https://t.co/8L9fo4eNqM My lov &amp; thx 2 my friend @RealHughJackman for always inspiring us with his performances. U r  The Greatest Showman in Wolverine’s clothing. Hope everyone enjoyed this episode. I loved hosting it.  https://t.co/T2BQ8EaKdR Tonight at 7pm on #TEDTalksIndiaNayiSoch, kuch kuch hota hai with the #PowerOfWords. @StarPlus @TEDTalks https://t.co/5mqW5KdBcg Spectacular DAIS Annual Day. God Bless u Nita Ambani for loving the kids. Made me nostalgic when to act was not important just trying was.. https://t.co/1viUxRJ83h The worst thing about being a father is that u r always taking the pics, never in them. Edits save the day.. https://t.co/iaVcdnJ67m Thank u Ma’m @nsitharaman for the opportunity. This is the least we can do for our Armed Forces.Will convey ur msg to the whole team. Jai Hind https://t.co/0Wq3RsEja8 Ab yeh hui na real Rab Ne Bana Di Jodi. My love to both @AnushkaSharma &amp; @imVkohli May God bless u with happiness &amp; health https://t.co/ymsT2Ay9Fh RT @firstpost: #Review The debut episode of Ted Talks India: Nayi Soch was all kinds of inspiring | @iamsrk | @TEDTalks https://t.co/fLgeK1… Now at Lux Golden Rose awards. Have to get to work, so thanks for all your questions. Some remained unanswered like it happens in life too… Sending u one https://t.co/jHFCaLdGHv Yes https://t.co/Meso74c0qt Will send it as soon. Want my Aadhaar card also??? https://t.co/6qMF8CjKi9 Have a good life https://t.co/kwhRYxQJkt I think so https://t.co/gpRj5NCptx All are not celebrities but their ideas are worth celebrating. https://t.co/4q13iuQEl6 Mostly Just Brian’s but there r some very prominent international personalities too https://t.co/5sXYgPNBCc I hope all like it https://t.co/ac7ZWvWAhT I mostly listen in the show https://t.co/o6iaT7MI0j Yes https://t.co/kwwVyhCuES Write to TEDTalksIndia please https://t.co/c7CTieztqU U should write because that’s the core of creativity https://t.co/Y7okovX1WE I think I have already met the Genie and it has granted all my wishes in this life. https://t.co/XBhr6olpS4 Like Dan Brown https://t.co/giNIbar51A Starting hosting in a bit. All my beautiful lady friends will be there https://t.co/s7pTbS00gO Mind Hunter https://t.co/97bPh3flR0 May all be well for u https://t.co/sfdiEz6C7w Ate some stuff AbRam was eating. https://t.co/piZc3PXtnx Oh oh...watch TEDTalks today I guess romance tomorrow https://t.co/icU4cAg9XS I hope so. Abhi Hindi mein kiya hai so that will help to have a wider reach. Lots of talks on rural India also https://t.co/75UriSxEbf Will do https://t.co/QuebICCT61 If there is a second season we will cover lot more topics. Let’s hope this season is accepted and we can build on it https://t.co/7jWrcWfyQs Babysit https://t.co/ApCrf6XB3Y Been so late my ago I don’t remember now!!! https://t.co/Z8TPRCkHGh The simplicity and honesty of the show https://t.co/uEt6mA6SyQ I also had lots of fun too. I like kid parties!! https://t.co/iTkSl9PL6u I prepare and rehearse https://t.co/d5BmKr47kG About 2 months https://t.co/VPH5x7PZFB Some good thoughts on tech. Making useful things out of fumes on the roads being one https://t.co/Psllxio2OT To me to participate in what makes me happy is important. TV stage films all same for me https://t.co/B5aFSkAboK I haven’t signed any new film...yet except @aanandlrai film https://t.co/VeZ7kunavn All good need to start work out soon https://t.co/YBwLiU5gyt It’s an extremely unique show. I hope viewers feel the Napier’s by the stories of the speakers and embrace their own ideas with belief https://t.co/yGecexPoXh Let us make the film that’s more important. Title will follow. https://t.co/IZjRvOhedc As always on top of ‘my’ world https://t.co/f6jy0uOj4O I realised that an idea is not big or small it’s actually how it changes people’s life for better that makes it big. https://t.co/TMszEHAd4n One very interesting talk on teaching kids through volunteer teachers online across the world https://t.co/jeixgKeYDr Today when #TedTalksIndia starts at 7pm, maybe a few questions on that and more. Lots of ideas to listen to &amp; ponder on. Let’s do #AskSRK #TEDTalksIndiaNayiSoch - The baap of ideas! , Starts Tonight at 7pm @StarPlus. Don't miss! @TEDTalks https://t.co/70xg1LEz8t For kids and their parents... Ideas are currency for everyone! #TEDTalksIndiaNayiSoch, Starts 10th Dec, 7pm @StarPlus @TEDTalks https://t.co/gvvqO8ys1Y Our soldiers give their tomorrow for our today. They deserve our respect and gratitude. @RedChilliesEnt @KKRiders @vfx_redchillies @AnushkaSharma &amp; \n@aanandlrai team supports them this #ArmedForcesWeek. Jai Hind!\n\n@DefenceMinIndia @nsitharaman\nContribute: \nhttps://t.co/08UWFj56je https://t.co/18hoCBKE1a Don't just spread love, spread ideas too...ideas are the new COOL! #TEDTalksIndiaNayiSoch, Starts 10th Dec, 7pm @StarPlus https://t.co/A73AxglbwO What it took to make Phillauri. Well done @vfx_redchillies, Karnesh, @OfficialCSFilms @AnushkaSharma @RedChilliesEnt . Thx for giving us the opportunity\n\nhttps://t.co/YNwKdyMJt7 My new digitized Ember coffee mug. Customised temperature customized name &amp; customised finger. https://t.co/Rzm88GRm8F It is time to open our minds and hearts not just the arms...\n\n#TEDTalksIndiaNayiSoch launches on 10th Dec, 7 PM on @StarPlus https://t.co/jMf5uZ6Qwn From the sets of @aanandlrai film. Techno Dolly,chroma screens &amp; gizmos galore... https://t.co/S91FFn1JGB Early morning wait for a train. Coffee and a book to go with it. Holiday done! https://t.co/5ctEsqtbbd Journey with lil one makes me see places in a new light &amp; also some new toys… https://t.co/bOZZJ7H6dd Thank u for making me feel like a Rockstar. Ab mujhe koi nahi rok sakta! All my love for #Lalkaar https://t.co/shr6izrXoQ Opening the festivities at 48th IFFI, 2017 in Goa. A great platform for filmmakers to showcase their talent and art. Looking forward... https://t.co/Bp5Fnmpj4k Thank u sir. This is a moment he will always cherish. By the way he thinks u r my ‘papa’ when he sees u on TV.  https://t.co/2WUiFPAEWy Should I be worried...my lil son laughs looking at this instead of being scared...Ughh!! https://t.co/jUTX3148ds Think will cast Reed Hastings in the series too. He is a natural… https://t.co/I0uwsA7ELq Netflix &amp; Red Chillies chill... https://t.co/Aew737MtTh Beautiful women…cos each one has helped me be a better man. Thank u girls &amp; be as strong &amp; as gentle as u are. https://t.co/UtdrGORceV Hard day at work…waltzing with the lovely Katrina &amp; a hug from beautiful Deepika. And they say actors have it easy !!! https://t.co/S6e3LsNRIA A madly happily childly dance for Aryan &amp; Suhana by lil AbRam on this day for children. https://t.co/nCl9Iw8GtP Had my cake and ate it too... #ChildrensDay https://t.co/l5KkqkPVbY Over a hundred beautiful souls from the Spark a Change Foundation dropped in to visit me on set! Best #ChildrensDay ever... https://t.co/sYSU07xHeZ Reliving my childhood this #ChildrensDay ! The babies taught me a step or two... https://t.co/IG8e8zUeV9 Keeping with the times…instead of being ‘yourself’ trying to be ‘yourselfie’ https://t.co/Vfo68Bl8VC Too much fun and love at KIFF 2017. Love my Kolkata &amp; as always the warmth of @MamataOfficial…U r the sweetest. https://t.co/rTDwzkT9cJ All the best 2 cast &amp; crew of Shaadi Mein Zaroor Aana releasing 10th Nov &amp; to Ratnaa Sinha’s first directorial stint https://t.co/64ZqI6YPAw Like I have said before. Only for u and nobody else. As Tom Cruise said “ U exploit me “  https://t.co/ncMKqvYHM2 My three vices in pictures: Grace, Style &amp; Playfulness. https://t.co/reXQAxT5q1 Get her to bowl for KKR please. Big hug.  https://t.co/duNmtDKwPW Thank u so much. Big hug to u https://t.co/fXzNGx5JQb U r the kindest. Love to u and see u soon https://t.co/f9WZru14Pz Thanks for ur wishes and love https://t.co/ynDWDLRMGI Thank u and love u https://t.co/LrtgL2ZnAE Keep on being crazy...it’s good. Love to u https://t.co/fmEdkA4qzS Thank u my man https://t.co/FCRnuGGE16 Thanks for the wishes and a big hug https://t.co/75rnSqxSMJ Thank u and loads of love to u https://t.co/UqZ18HgZ07 Thanks for the wishes nevertheless https://t.co/XZDpJ1U43F Thank u and love to u too https://t.co/Jzd10NaV2n Bless u man. https://t.co/rXFCEAEOmM Thank u and love to u https://t.co/j4nu3KfHzG Thank u very much. See u soon https://t.co/RJ1FBMMnj6 Big hug right back. Thanks and love to u https://t.co/ryKD6Yns4F And u be u always too. Thanks https://t.co/3dYNC8yznw Thanks my man do well https://t.co/omYcemAxlz Thank u for ur wishes https://t.co/3tJn9n33Dz Thank u and all the best https://t.co/WljSDDRJfg Ha ha. Here’s to all the ladies...love https://t.co/GPZ5JAd3ih Thanks for ur wishes https://t.co/Bx426xaUou Thank u for ur kind words https://t.co/Q3NVlHZvr7 Thank u and I always thought lean was good!! https://t.co/Zzv7Tmxplr Thanks and love to u https://t.co/dBHYTJSTQE Thank u so much. Bless u man https://t.co/IoqTUp8lFn Thanks and love to u https://t.co/QX1kaseoYk U r kind to say that sir. Thank u and love to u https://t.co/qgOGiI56KQ Thanks and will do my best https://t.co/oR5eK0jsMd Love u sooo much. https://t.co/9ivYkUvfil Thank u https://t.co/1DtmeqNnhx Thanks man. May u be good always https://t.co/2yQliQRSq2 Thank u for the love https://t.co/7dJdYEb5Ci Thanks for always being so loving. Wish  u all best in life https://t.co/nrImatHoR0 Thank U my man and keep cooking and make life delicious https://t.co/TUKNxMHPzn Thank u my friend and love to u always https://t.co/AoC1KQLZ10 Thanks and all the best to u https://t.co/NbBO9VXiJv Thank I for ur wishes https://t.co/a3jnTi1J1V Tussi changeh ho?? Thanks so much https://t.co/yIcCMzPVkE Thank u for ur kindness https://t.co/wOI4j1JgMW Thank u and love to u https://t.co/dqQdLpqsBm Love to u and thanks https://t.co/1mN2pR6MmF Thank u for the love https://t.co/iP7uRwXjKF Thank u for ur wishes https://t.co/G8Hz4UdnDA Thanks man and keep working hard https://t.co/UgXDlzG7J9 Thanks for all the importance and love u give me https://t.co/k1kIUMWDxn Thank u so much https://t.co/RsPkQLrzFx Here’s to many more dreams fulfilled. Love and thanks https://t.co/nwcemVYCRN Thanks for this love down the years https://t.co/5bCHiaUkqs Thank u and love to u https://t.co/BhZhV77TG5 Thank u and love to u https://t.co/JOxnhAnXUh Thanks for ur kind words https://t.co/DHspb11wyi And hope u keep believing. Love to u https://t.co/DAi2ukWT8N Thanks my friend have a good life https://t.co/ztQJv5XcR4 Thanx u team keep shining https://t.co/R40NEPdKKb Thanks so much and also for working so hard last few days https://t.co/WRx59NkdKJ Love to u and happiness https://t.co/Ef1mjEQQMn Thank u lovely one for ur wishes https://t.co/YYV2cEfRy3 Thank u for the wishes https://t.co/6StMfZOlNA Thank u for ur kind words and will work hard on my ambassadorship https://t.co/lq5ndYRo3O Back to u. Thank u my friend https://t.co/L0355ic0zd Thank u Anna for ur wishes. Love to u https://t.co/PQxn1s2fWZ Will celebrate with u tomorrow. Thanks my friend https://t.co/1YW6BzIGFd Thanx Rahul. https://t.co/NrgToHM3yu Thank u for ur wishes https://t.co/5dmGpL7UTe @karanjohar ok sending them in 2 days. Waiting for shot from @aanandlrai set. Pic courtesy @Harjeetaulakh\n@Harjeetsphotography https://t.co/2hPTKlcBPP Thank u so much and keep on shining. Love to u https://t.co/KCfxiJCvo1 Thanks so much and all the best for Firangi. Looking good https://t.co/LkGIgeV2t7 Thank u and do well https://t.co/SaenKAMyhZ Thank u very much https://t.co/RtQCJHXkFe Well done. Thanks https://t.co/OJMAyoCh8s I think I got it finally https://t.co/Y3Qr5jHDOb Thanks for ur wishes.  Love to u https://t.co/7lUS8KE1cF Thank u my friend https://t.co/dBSgN9vPjV U r always kind. Thank u https://t.co/rsigGu4V5f Thank  u so much https://t.co/rXmzPhgDW0 Absolutely will be there or will send the sodas across at least https://t.co/EKyFw30SEs Thank u so much https://t.co/QqK8vi1yE1 Thanks bro. Miss u https://t.co/GdK19dRljh Thanks and love https://t.co/WBS5As2ETq Thank u so much https://t.co/zwCGV3NmAZ Next time let’s do a pic together then. Thanks https://t.co/Nd7oOkOBHr And I am blessed by ur love thanks https://t.co/WmqLMvrkIr Aap se bahut seekhta hoon love to u https://t.co/IyAjr0wY87 Thank u for ur kindness https://t.co/s1ol8lTvGh Thanks my friend. Love to u https://t.co/WP5U7jQnYe Awwwww. Thanks for ur love https://t.co/II4mjKwRH3 Thank u and hope u r well https://t.co/nimqaxR55I Thank u sir https://t.co/MshlFanUKs U r always funny. Thanks my friend for always smiling https://t.co/hLc8DUdZHh Thanks for saying that. Love to u https://t.co/W8FidFFzIe Will remember that line always!! Thanks https://t.co/n1xhkGinTn Thanks for ur wishes https://t.co/1qCXVSWZRo Thank u https://t.co/Avfhzw8Ayy Thank u and that was a fun film. https://t.co/RbNwJQ9XUT Thank u for ur kind words. Do well always https://t.co/0xpGue5XIc Thank u https://t.co/0bODx6dICZ Will try and make some more good memories. Thanks https://t.co/05MrIeWs6a Love to u and thanks https://t.co/Pipm8s26PK Thank u for ur wishes and love https://t.co/mPrFgZuiLl Bless u and thank u https://t.co/RoyJhEk7Bc Thank u for ur kindness. Love to u https://t.co/NFKwYGOmCH Thank u for all the fun https://t.co/rduq4V5620 Thanks for the encouragement. https://t.co/s35aqmJaRE Thank u very much https://t.co/VbyEHH2pCu Wish u happiness and health too https://t.co/MGMcEII7JI Thank u so much love to u https://t.co/IdufS7V1mp Thank u for ur wishes and love https://t.co/cwflT4g7ta Insha Allah. Thanks my friend https://t.co/CodAqY69Df Thanks for your wishes https://t.co/1qxzXNsEoG Thank u my Don voice. Love to u https://t.co/2oWVVvv8Iq Thanks for your love https://t.co/MPlBhOCdBq Thank u very much. See u in Dubai https://t.co/57NnEKi0QX Thank u https://t.co/XNFJuGDRBj It’s all your love thanks https://t.co/u43DU2YI3i You are kind to me to say that. Thanks https://t.co/DDX8oDPgOl Thank u for ur wishes love to u https://t.co/KGCJelTCvV Thanks for ur wishes https://t.co/DFJ4fzHQGG Thank u so much https://t.co/Ofzo0TozAY And like u too. Love u https://t.co/3Vvy4As9Aq Thank u and stay healthy and keep on playing well https://t.co/dp38drZ9N8 Handsome is a state of mind. With u all around I look better cos u make me feel handsome https://t.co/NYp7HRMpBn Thank u and love to u https://t.co/QD7OJ7aZ0j Thanks my man. Stay healthy https://t.co/GZz1W7dS4i I feel 30 now thanks https://t.co/rwZuoTSVxY Will strive hard. Thanks for your wishes https://t.co/vXlNMrRiJW U r kind to say that. Thank u https://t.co/sw7XY8fRLJ See u there and thanks https://t.co/yOQOm56yjT Thank u for ur wishes https://t.co/BdfYafdotQ Thank u so much https://t.co/U3GbQrzmPK Thank u and my love to you https://t.co/y24Ta52438 Quite possible I think ha ha. Love to u my friend. Let’s meet soon https://t.co/222ip1AocS Wow even I can’t do this. Thanks https://t.co/VdfTZSp9oU You are kind to say all these wonderful things. Thank u https://t.co/pBCPn7pnDm Thank u for your kind words. Love https://t.co/u3QOQiN2uI Be healthy my friend and thanks https://t.co/I2DPaFaAL5 May u always be happy. Thank u https://t.co/flClW6CO6z Thank u for your wishes https://t.co/w3x6vjuGV9 Yes that was fun. Love to u https://t.co/SQW4gBBeYL Love to you https://t.co/PWdD2M2FEm Thank u so much https://t.co/7T4O1nm0vI Thank u for ur wishes and the memories https://t.co/58h8Q89hYa Yes will keep trying. Thanks https://t.co/2M6y2TC8Jw Love to u and thanks https://t.co/u9rU8CC1bW Thank u for ur wishes https://t.co/EZXG2o5rHB Will come next time in London. Thank u and love https://t.co/RZVDcSMMEW Thank u so much https://t.co/BgFLETSaAY You are kind to feel that way. Thank u very much. https://t.co/NWfQ0UFuVU Thank u all. https://t.co/gd2fN1uqf5 Very sweet. Thank u so much https://t.co/iZDHxnE3kG Thank U and wish u all the happiness https://t.co/bUC5lKTjlR Thank u and loved the delicious lunch https://t.co/m7MJuYePQy Thanks my friend and love to u https://t.co/j6nAtaN07Q Thanks https://t.co/Fkw42w8fTt Thank u for your kind words and wishes. https://t.co/MW0KVAKrqB Thanks for crushing on. Love to u https://t.co/A7o5MU7JW3 Thank u so much. https://t.co/KAV90Yzr7b Wish u all the best with your new job. Thanks and love https://t.co/mixNTXd1bi Thank u and bless u https://t.co/EnQ337Y7S7 Thank U sir for all the happiness you give https://t.co/PKzntn9F7p Thank u so much my friend https://t.co/3t9AV6YelN Thank u so much. Love to you https://t.co/ksZgiXMr7T Thank u so much. Hope all is good with u. Love https://t.co/QQ8iwhxwhD Thanks for your wishes https://t.co/rIKpeWTkHM Thank you and love to you https://t.co/JXOaEenlTI Thank u so much. Love to u and mom. https://t.co/uSnXFKtB4V Thank u so much sir. Love to u https://t.co/IWu3EQWWf4 Will keep trying. Thanks for ur love https://t.co/O8vIZ99Ryj Thank u  so much https://t.co/mI9pTuzD6t Thank u very much and love to u https://t.co/ejPRrPNMuo It was fun. Still want to be Batman. Thanks https://t.co/P3c3rdl9Ll Thank u soooo much. Love to u https://t.co/Ouows8Xgzw Thank u bro. Love u https://t.co/KF1U9qBtwU Thank u for making the kids so happy. https://t.co/PNkLtJFy6e Thank u very much for ur wishes https://t.co/Nrjc9TCMuv Thank u for all the smiles and laughter. https://t.co/wDPTG7R6m7 Have a great holiday. Thanks https://t.co/iifJGlHJEv Thank u for coming. https://t.co/5zLy39rpVy Thank u and love to u https://t.co/GEQk2iSzeN Thank u so much. Love and happiness to u https://t.co/aEuXw7QiDU Thank u for ur kind words. Love https://t.co/V5eYgWm7Ec Thank u my man. All my love to u https://t.co/DK8tYVudpl Thank u my friend. Love to u https://t.co/R2MttgI0ZH Thank u pretty one. Love to u https://t.co/ohMZi1SCJv Thank u  and love to u https://t.co/GCLy9OF1pV You are kind to say all that u said. Thank u https://t.co/qSHCuWnRP1 Thank u so much and continue being the wonderful actor u are. https://t.co/1NIEoHudLq Thank U and may all ur dreams come true https://t.co/Yvr9qYu2p0 Thank u baby. Lots of love to u https://t.co/j4XzbReg8e Thank u for ur wishes. Love to u https://t.co/WyqwJXWHWK Thank u so much ...always https://t.co/GmmXTbDhG1 Insha Allah. Thanks for ur wishes https://t.co/QGJB8ELrei Thank u and love to u https://t.co/uMaOU4Fagg Thank u and u r kind to say that. https://t.co/xaqKMyD6GO Thank u so much. Love to u too https://t.co/2JCBt2y8s2 Thank u so much. May u always be happy. https://t.co/OPHQOYt5dQ Thank u so much. Love to u too https://t.co/hBzvoUkzt8 Thank u baby. Love and a big hug to u https://t.co/Q9X4uFkasQ Ha ha. That’s sweet. Thanks https://t.co/F2dnXvrghg Hope u have a great trip in China. Thanks for remembering me. https://t.co/eMT1OerXaf Thank u for ur love and ur kind words https://t.co/COkScLJIS4 Thank u so much. Love and health to u too. https://t.co/DtHZgvQy76 Thank u so much. Love to u too https://t.co/UvfrCw4E1s Thanks my friend. Abhi toh https://t.co/Sv5rVMc8v7 hi hue hain https://t.co/vg025WQZ2C Thank u so much. https://t.co/t4oudjndb2 You do the pose very well. Thanks https://t.co/OuMs3ir4Bn Thank u for ur wishes https://t.co/XSUvbr3Bt2 Thanks and keep being as tough as u are. All the best https://t.co/i6fgXglU16 Love to you too. Thanks https://t.co/AyGuWn0PW3 Thank u https://t.co/t67b84Cbpj U add to that always. Thanks my friend https://t.co/bjFvsTzupu Will keep trying to add more. Thanks https://t.co/qnvqqGKRlE Thank u little one. Love to u https://t.co/evipkaYSvp Thank u for ur wishes. Love https://t.co/o6XZIbrUld Here’s to u always smiling. Thanks https://t.co/o6XZIbrUld Thank u sir. U r too kind. Love to u https://t.co/TbMH8OU9Is May good days keep coming. Thanks https://t.co/IsErUSl6Vo Thank u Rajpal bhai. Love to u https://t.co/T69I6C8DFO Thanks my man https://t.co/nGfndjoJcQ Arre maine bhi kuch nahi khaya https://t.co/lAtWb2inoy Apologies for the inconvenience but thx for being kind about it. Lov to u https://t.co/esbmaX7mH1 Thank u for ur wishes https://t.co/ZXTbSj36f7 Thank u soooo much. Love to u too from mars and back https://t.co/02CJkcvXs4 Love to u and family. Thx https://t.co/xNGeeFJRL6 Have to start workout man. Thx https://t.co/js7zTYAozT Have to start work out man. Thanks https://t.co/js7zTYAozT It was lovely being with u. Thanks https://t.co/gHVDTgZc59 Thanks so much and love to u https://t.co/9eHOcGD5wN And how to extend arms like the plastic man https://t.co/OpCJZRb6Ie Thx for flaunting https://t.co/dRAJZd5jbY Thx so much.  Love to ur well wishers too https://t.co/moku1JDGyI Thank u my hero. Love to u https://t.co/A08mQ5zZ6J How sweet r these girls looking.  https://t.co/tERgREIYba A ray of sunshine... A sea of love...\nThank you all for the happiness you bring every year! https://t.co/teTr4FRGC7 When you give out a spoiler, you become one! #SayNoToSpoilers and watch #IttefaqThisFriday https://t.co/EJQ0Ax2FGL Thank u. U sing like a dream  https://t.co/AZVnAnFOoG That is way to sweet. Thanks  https://t.co/cPOznXHD3h Have fun and thank u.  https://t.co/HxrvwUjCGY 100 mins of sheer thrill and suspense... #Ittefaq in theatres 3rd Nov onwards! https://t.co/7ZyJ4CEFyu Wow so many works 2gether didn’t realise how far we have come. May our partnership flourish. https://t.co/OQPvirwpn6 https://t.co/9wvx7hSeT9 RT @RedChilliesEnt: Vikram, Maya or Dev- who do you think is guilty? Vote now! #IttefaqNov3 https://t.co/QRRQbeq1PG What a beautiful journey my friend. Thanks for making https://t.co/jOE1A4Eejh  https://t.co/R43UKY7raC Hum honge kamyaab ek din…https://t.co/1Xf3V4lLEy .@Arunapk57 @akshatkhot @priyankakhot https://t.co/n3HsXqlaqZ One night and two unreliable stories... Was it all #IttefaqSe?\n\nhttps://t.co/qZZQ21ZADa Too early for me on a set but then @aanandlrai makes you hear a lovely song.  #ReasontoSmile https://t.co/JvarI0mN6C Love, light and happiness to everyone this #Diwali... https://t.co/euIGrcOSJu There r no shortcuts to any place worth going... @gaurikhan Ur passion for design and perseverance shines through at #GauriKhanDesigns. https://t.co/CEfeDiophP Watch #JabHarryMetSejal today 5PM only on @ZeeTV  #JHMSOnZeeTV https://t.co/a7cvNgjfNf Oh my friend I miss you. I know u will bring smiles around wherever u are…but this world will laugh less now. RIP https://t.co/3htJoJUtZh Waiting waiting… https://t.co/PrKCGNOUx0 I am waiting.  https://t.co/UinbCJYaFg Hmmm I want to believe u…but…the others seem earnest too!! https://t.co/6UeklUcCh4 I am all ears!! https://t.co/UA5XbMtTgU Are you here or not??! https://t.co/6qMDwaG4XW Between his truth &amp; her truth, lies the real truth! Watch #IttefaqTrailer @S1dharthM @sonakshisinha #AkshayeKhanna \n\nhttps://t.co/z9pwh2ZLeF 'Where there is love, there is life.' Let's spread love &amp; warmth the way Bapu would've liked us to... #GandhiJayanti https://t.co/7gk9GxHcTm Sum nites the stars with u shine brighter than the ones in the sky.Thank u ladies for ur graciousness beauty &amp; love. https://t.co/FNrb5jZZpu Wishing you love, health and happiness this #Dussehra ... https://t.co/eGp1FfqbRs Wow!! And the gentleman is so underplayed!!!  https://t.co/gOEgYvcuWK It was really so wonderful to meet you too. The pleasure is all mine.  https://t.co/qanPhSgReI Aa Raha Hoon! #Raees  9pm https://t.co/JWkHkGl1lm 19Sept. Like my dad(RIP),my only duty 2 my kids is 2 delay the onset of their adulthood as much as possible.Retain purity of their childhood #Newton a special film with my friend Rajkumar Rao &amp; made by a team of my friends Colour Yellow. All the best. 22nd  https://t.co/c730guLdQx Loving the rains….&amp; all the 28 Million of you! Thx for the love, suggestions, hugs &amp; ur tenacity. Be Happy All. https://t.co/2G1P35edtC Great going @HyundaiIndia. Another one of your products takes the market by storm. Over 12000 bookings of the #NextGenVerna. @FarOutAkhtar all the best for the film to the whole team. May #LucknowCentral be ur best one yet. Love to u. Thank u for taking out time and coming over to the shoot. See u soon for longer.  https://t.co/VNrj8x1wwL Absolutely. Well done and thx for joining at short notice.  https://t.co/gKsMBC9798 Thank u mate. Bless u https://t.co/X8XVazbodY @TKRiders    Kevon Cooper you were magical… https://t.co/xOJGbO1uLI @TKRiders absolutely marvellous.Dwayne dance for me tonight. Get the boyz to fly!Thx Trinidad &amp; Tobago for ur lov https://t.co/wv700Htt3N @TKRiders wow a second one. Wow wow wow. Love you for this happiest of parties! &amp; tell @steelydan66 didn’t come so he got sum attention! Thank u for ur hospitality for the whole team and the food was delicious.  https://t.co/kvXe4SGR0X What a fabulous tournament. Has kept me partying into the wee hrs of the morning. Wish I was there. Trying trying… https://t.co/4oTKCnUqvT @TKRiders wow. Congratulations u make us proud. Too happy. Let’s keep the party going into Saturday. Love u boyz. https://t.co/ibRcYghEph Thx to each &amp; every woman,child &amp;man who gave me the confidence to say ‘I don’t know all’ &amp; sorry for being tardy https://t.co/sPN99lR3Ue @sundarpichai will come and see u at the headquarters soon. Thx for ur time and wisdom for the young on the show. Have a good day. Please look after urself my friend. Take rest &amp; as always u will back bigger better faster &amp; stronger.  https://t.co/XmvA9hT7s8 When the little one goes back to school &amp; there is nobody to point out that u r using too many filters! https://t.co/KKU9wRsRi9 One of my favouritest ppl in the world.The very funny innovator boss man @sundarpichai graces @TEDTalksIndia.Thx man https://t.co/hPby1eRFJz Wish u health and the best of tournaments. We have a great team &amp; it's an honour to hav u lead the @CTKRiders https://t.co/9kiVc4Jlgz A wonderful tribute to the Mumbai Police by @DivyanshPandit9 . Do watch it. \n\nhttps://t.co/RVgmFibiur @dmbravo46 @Bazmccullum  #TKR WOW! I think it’s time I join u guys for the biggest party in sports. Well done boyz https://t.co/JmQUT6PyRa Absolutely amazing. Well done my man  @bazmccullum https://t.co/z0SqARUfkh Great endeavour by I&amp;B Minister @smritiirani to make #IFFI the most inclusive, relevant forum for Indian cinema. My unwavering support to u! https://t.co/kd9kDCAYPP @TKRiders @TKRiders @TKRiders Wow!! Denesh Ramdin @shotta8080 &amp; Searles. Well done boyz &amp; thx Queens Park Oval. Travel safe &amp; happy Happy Independence Day to all of us. Well done all over again @TKRiders boys. Thanks to the amazing crowds at the park too &amp; @sunilpnarine74 u beauty! Once again well done boyz. TKR team and the fans at the park…absolutely stunning. Awesome guys. Well played.  https://t.co/9012H4WJUu Thank u it was an enlightening evening for me and u added to it.  https://t.co/SypbZLDOeP Enjoy #JHMS with your siblings today... Happy #RakshaBandhan\n\nhttps://t.co/siaDyudp4L https://t.co/Sz8zTZ5Yau RT @RedChilliesEnt: Happy #Rakshabandhan!\nGift your siblings a perfect day by watching #JHMS with them at the cinemas- https://t.co/SZ21ZV9… Thx @aamir_khan &amp; Kiran for giving me the honour to stand in for u. @dev_fadnavis ur concern for farmers is touching https://t.co/lWX3Rh8xIH Have fun all the Harrys https://t.co/Lx8Ncw7gBD Thanks Nigeria... https://t.co/JcyrtsRrtZ Italy... love to u from Harry and Sejal! https://t.co/EaJB7tIVWh Thanks Toronto... hope u enjoyed https://t.co/1Aq4Y5IYR9 Awesome Austria... https://t.co/COe0S3kUn8 Thanks Tokyo... let me know how it was https://t.co/IwN1C09zSC Thank u Nepal... https://t.co/gAGgcOCflm Celebrate #JHMSwithFriends! Have a good Friendship Day today!  \n\nhttps://t.co/uOYjA5Q4P1 @usainbolt thank u for all the adrenaline speed and inspiration. Harry &amp; Sejal's Safar in the City of Joy was awesome. Love to u all.... \nhttps://t.co/siaDyudp4L https://t.co/g3BVg2Ji6D Thanks trying it now.  https://t.co/5pXMNR3WRP Can I see it online somewhere. On the road. Please tell me?  https://t.co/HJKQLyc4YF Be there in 10 mins. Apologies to keep u waiting had to get a bit of dressing done…for a lil hurt. So had to c a doc https://t.co/W9YosQN9hJ Yay. First match done. Congratulations boys. https://t.co/nwWQfDJDj5 RT @bookmytv: Fans were super excited with the release of #JabHarryMetSejal, here's how they reacted. #JHMS @iamsrk @AnushkaSharma\nhttps://… Thanks Jodhpur!! https://t.co/OMxPSqYzn7 Thank u butterflies!! https://t.co/OPEAbxsatj Nice... Sweet... Radha type https://t.co/g2o6HLkfME Awesome!! https://t.co/fAqnWvSv1o Thanks Jaipur https://t.co/W3jQ1siQqO Thank u all the Harrys &amp; Sejals... glad u liked JHMS https://t.co/bEi0nPVPlr Thank u all the Harrys in Delhi https://t.co/0bLnQhMaJQ Thanks Malaysia... Good to see u all https://t.co/6GA7bxRxHL Thanks again Kolkata... keep enjoying with Harry &amp; Sejal https://t.co/dHHVgkIMff Glad u enjoyed JHMS day , Silchar https://t.co/MCgkBmR1ee Thanks Hingoli!! https://t.co/Wue3e1TjpK Looks like the show went well! Thank u all for the love https://t.co/illUJEd23d Nice!! Let me know how it was https://t.co/xiwxUf0YQD Thank u Varanasi https://t.co/GLCKAoMGli Glad u are having fun on JHMS day https://t.co/Xsm9ombJIk Some great moves! https://t.co/cR1YtKt8YG Hope u enjoy it https://t.co/hpciQa04Us Thank u Bangalore. I'm happy u all enjoyed JHMS! https://t.co/p5z8J6cScS Jab Harry-Sejal met Kanpur... and looks like they had fun. Thanks!! https://t.co/qqYsUV9xUL That's another nice cake. Thank u &amp; enjoy the film Kolkata... https://t.co/x6RYqLBQpX Don't slow down Patna... Keep the celebrations going with Harry &amp; Sejal! https://t.co/aCERXsxDU6 Thanks and enjoy the film, Indore! https://t.co/mQdyhWfZFl Glad u had fun, Delhi https://t.co/vAPcZ6b4AX Ha ha that's awesome Jalgaon... keep dancing. https://t.co/sOkuAnsZs9 You all sing so well... Thanks and love to Arvind and everybody there. https://t.co/pK57VLATM8 Hope u had a good time Chennai https://t.co/bMM65JEHHF That JHMS cake looks nice. Thank u all https://t.co/V3j9VKke8N Awesome... https://t.co/FyT48fHvMQ Thanks... Hope u saw and enjoyed the film https://t.co/lQzmnv1zGd Thank u Delhi... keep sending me pics. Love u all https://t.co/YJk1l0N8mr Thank u for ur wishes https://t.co/XlIUef23B0 Thank u https://t.co/GD8anKqbgE RT @Bollywood_Box: @AnushkaSharma the best role of her career and she is just amazing, her acting in #JHMS is on par with Imtiaz's most ico… RT @iamfarook: Lovedddd #JabHarrryMetSejal. UAE 🇦🇪 shows going Housefull. Hope to see it again just for you @iamsrk. @AnushkaSharma @RedChi… RT @indicine: After weeks of near-empty theatres on Friday morning, audience return in bigger numbers for the 'FDFS' of Shah Rukh Khan's #J… Thanks bhai https://t.co/CI3ty6XCUq Hope u have a good time https://t.co/zw4buWW4XQ Insha Allah https://t.co/b9LZaX2t9R Thanks so much baby. Love u https://t.co/4GsZ749rgR Thanks man. Where r u?? Let’s meet  https://t.co/GGOHYIJ2hu All the best https://t.co/NWLdTl90YP Thank u baby. Love u https://t.co/jDhj7C8Ttw Oh oh. So early! Hope u like it.  https://t.co/P2ILYuK4yg Thanks my friend https://t.co/1NHzQ7KArP Thanks my friend. U r kind https://t.co/vc1bikbjnU Thank u baby.  https://t.co/qLoNb6ibFg Thank u Bomzi https://t.co/lJDhv8Wtwz Thank u so much. Love u https://t.co/64xy9NcXP5 Thank u my friend https://t.co/cEdrDi4kH1 Love u my man. Thank u https://t.co/UyadbJPCbe So glad u liked it my friend.  https://t.co/D6NKp8Qcwf Thank u baby  https://t.co/CYpxMS76Nd Thank u sir  https://t.co/J16ECZfbMO Love u ma’m. Thank u so much https://t.co/cNVAIAF9T7 Happy viewing to all those who r watching #JHMS in parts of the world. Apna Dil saath leke jaana. My lov to u all. https://t.co/c3lPyeIhWo Thank u. Come home and we will chat about film. Aise hi…https://t.co/klSRZVfDoD Thanks my friend.  https://t.co/pZoUXYCjnf Thk u Meri Dilli &amp; SGT for so much love. Sorry couldn’t finish sum of the interviews wil come back soon…&amp; do. them. https://t.co/Glt1tdh0Lp This so much yaar. &amp; as I mentioned ur trailer Secret Superstar is sooo endearing. Let me know when u can watch JHMS https://t.co/2At5jJ7gpi And here it is as promised. Everyone, let's go #Phurrr !!  \n@Diplo @ipritamofficial\n\nhttps://t.co/IBGdkJT2Wd And ‘Phurrr’ out on Youtube full version as Diplo &amp; Pritamda wanted in a few hours. Working on edit to make it as good as we can. When the most beautiful people ‘Jab Imi met Anu’ in my hometown and so Delhi like chilled. https://t.co/WNKTkntSn0 Why do anything else when you can #Phurrr! @diplo @ipritamofficial @AnushkaSharma \n\nhttps://t.co/VOFPp1rIOd Thanks my friend for this journey into my past.  https://t.co/hRN0JL02FB Hello everyone in USA &amp; Canada, will c u in theatres on August 4th! Hope u enjoy #JabHarryMetSejal. \n\nTickets here: https://t.co/vk2KUudaG8 Looking forward to seeing you all as Harry &amp; Sejal... Enjoy the film, Delhi! https://t.co/uOGihRpivT Those t-shirts look very cool. Send me pictures of u all wearing them from the theatres... https://t.co/tZNolX3NNk And Harry &amp; Sejal are ready to meet u too on 4th, FDFS! Have a good time Kolkata... https://t.co/Px0IRV1khb This looks awesome, Austria! Let me know how the celebrations go... https://t.co/28KVJclPK0 Wow... Have fun with Harry and Sejal, Nepal! https://t.co/NNX4zIYzSn Bihar, hope u enjoy the FDFS... https://t.co/HOEcZGmjEY Jab Harry &amp; Sejal Met Japan... Hope u all enjoy! https://t.co/vX19GH74o7 Love to all in Germany from Harry &amp; Sejal! https://t.co/E3l9i0oFAn Hope u enjoy JHMS... https://t.co/ICBgHY6xUM Have fun team... https://t.co/7BxAYMR5vs Please look after her. I will pray for her to get well soon. Give love to both the babies.  https://t.co/cuf4R8AzaD Hav to follow wotever u say @AnushkaSharma . Stuck with U &amp; on U. Can't wait till tomorrow for @diplo &amp; Phurrr! Till then #MiniPhurr will do https://t.co/qtEUJljrdL Thx for all the effort u make for the audiences.  https://t.co/BaUPLpcKed Masha Allah.  https://t.co/BIZY8wniI5 Sir miss kar raha hoon aapko. Love the trailer even more than the first time I saw it. Best of luck to team.  https://t.co/mwkMqwtLm2 RT @Paytm: #JabHarryMetSejal\nBOOKINGS NOW OPEN! \n\nBook tickets: https://t.co/vdPtscyOGT https://t.co/jH454RFzJh Wish u and ur family happiness.  https://t.co/WtJunTIxIN RT @TicketNew: Bookings are Now Open! Save Upto Rs 250 on Jab Harry Met Sejal Tickets. Book Now: https://t.co/LzLF9RYcq2 #JabHarryMetSejalW… RT @bookmyshow: Wish all Mondays could be like this 😃😍\n\nBook tickets for #JHMS &amp; save upto ₹300!!\nBUMPER PRIZE: Trip to EUROPE\n\nTnC: https:… Nice  https://t.co/8RiLiAUONC Let me know my Captain how I can be of use to ur initiative. Bless u  https://t.co/ZD5ewpc3gJ My new Harry shoes. Courtesy @shaleenanathani my stylist. Now if she can get me some new jeans too! Thank u UP tourism. Wish I could stay longer. Will b back soon to enjoy the warmth and hospitality meted out to us. https://t.co/KRshOys8Ib Ha ha nice NA  https://t.co/ThZClUn4sZ Sejal! Yeh Phurrr Phurrr kya laga rakha hai? #Phurrr \n@diplo @ipritamofficial  @AnushkaSharma @RedChilliesEnt https://t.co/CjHwi3W5S8 My best wishes for your dads health.  https://t.co/HVjx2uwJlx Sorry in the rush forgot to thank u.  https://t.co/dRyt1OZgnr Am so happy u r in love. Sending u and Alia the new song. Phurr… u both being young will hopefully like it. https://t.co/adiODL7Zid This was fun and I love dogs.  https://t.co/VWRLZXvFnb Harry, Sejal &amp; Imtiaz had a great time in Varanasi... thank u all for coming &amp; big thanks to @ManojTiwariMP #JHMSInVaranasi https://t.co/rapadJg5F3 JHMS on Aug 4... Waiting to see u all there! https://t.co/WNxvV0y7Q0 Harry &amp; Sejal will see u in theatres!! #JHMSAug4 https://t.co/i5JvqGwz8s That's awesome, Aurangabad!! https://t.co/aVE6yaF6nu Thanks Vadodara... Have fun! https://t.co/GXOS2Bq7qi Thanks Pune... hope you enjoy the ride with Harry &amp; Sejal! https://t.co/TIT2KVZxqn Have fun with Harry &amp; Sejal, Vijayawada... https://t.co/yQco8U7UDg Thank u &amp; enjoy JHMS, Bhubaneswar! Love to u all... https://t.co/OnPO282jYy Thank u Bangalore! Enjoy the film... https://t.co/cpbeINUgyN Hope you enjoy the film... See u in theatres! https://t.co/sVDa80mKTq Thank u for the love, Jalna... see u in theatres. https://t.co/PDWgRBqGRB That’s kinda cool https://t.co/WdJrRShyVk Thnk u to all of u booking your shows in advance for JHMS. I really hope u all enjoy this one…it is extremely encouraging to c this response Waiting for u my friend!! https://t.co/UEv0MF0PSe Jab Harry Met Sejal advance bookings have begun! Book your tickets now! #JHMSThisFriday\n\nhttps://t.co/gywIAhu6nP C u today at Vox Cinemas- Diera City Centre, Dubai &amp; Cine Royal, Dalma Mall, Abu Dhabi. It’s nice to be here &amp; to meet as many of u as I can Australia aur London Harry Sejal ha reached…now onwards to Dubai…even at 5 am Sejal looks resplendent.. doesn’t she! https://t.co/uBTbJSlT2E Thank u and love u all.  https://t.co/PWmwuRGoo1 Absolutely and u r the Guru who inspires us by the new things u do everyday.  https://t.co/Y5rRdGSFEB That’s a good feeling.  https://t.co/rUTRK8A82e Thank u Nilesh &amp; team.  https://t.co/hROQVsD7u0 Thank u Romedy Now... https://t.co/t1neOzZxzq Glares because the Sun doesn’t stop shining on you. Thank u life…it’s wonderful! https://t.co/sxk4NfzOm7 So lovely that Pritamda and Arijit inspire such talent.  https://t.co/WIeVPtngvQ Bahut badhiya!! https://t.co/0yanHpCEWX RT @RedChilliesEnt: Harry &amp; Sejal's story is going to be one mad journey! Just #1WeekToJHMS! Are you ready? #JHMSAug4 @iamsrk @AnushkaSharm… That’s why I love kids. They have a beat of their own.  https://t.co/SIggnrH626 Aaoonga aaoonga..!!! https://t.co/98EQgJQ2el Awesome awesome. https://t.co/WDfWuS9pkd Thank u Star Plus https://t.co/eVpYN8rZ0c Thank you for the love … keep the Hawayein blowing..keep streaming https://t.co/P5pGNf0Tmd https://t.co/gaunyViGrI How lovely is ur voice. Keep singing  https://t.co/oBC8TFYfDg Thank u  https://t.co/eYewneJAKA Should have told me u can do this… would have released the trailer like this! Thanks https://t.co/QUmLQCP7P0 May God bless ur family.  https://t.co/InBcyJHsWU Hawayein Haq mein wohi hain aate jaate joh Tera naam lein…Sejal…how beautiful she looks… https://t.co/P4LGQCHeNQ Sejal, tere hi liye saari wafayein... #Hawayein  #JHMSAug4 \n\n@AnushkaSharma @RedChilliesEnt @sonymusicindia \n\nhttps://t.co/uMUT8E6hLu Girls just wanna have fun. Very sweet https://t.co/bq1Dc9Yq3i ‘Cause when the feelin’s right I’m gonna run all night\nI’m gonna run to you… https://t.co/aKuzryW8Id Thank u all for the love and support.  https://t.co/cQ28xHLIuA Extremely graceful. Thank u https://t.co/VPGuNFE84Y Thank u my man for the kindness and love on ur amazing show. Extremely grateful for the tribute!  https://t.co/3WaPpVPwT2 You all are just so cool. Well done and keep shining. Love to u all and be healthy.  https://t.co/YnGIyrPfGr LA done.Will miss babies.Hav 2 come back 2 bring the Love song of #JHMS to u all. Playing in my cans now…‘Hawayein’ https://t.co/K4oOTALhPg Thank u Bolivia!!  https://t.co/cPJIHxE7xC Better than me for sure. Thanks.  https://t.co/IIScHa93Sz Thank u. That’s extremely noble https://t.co/KyXcYSt95M Thank u guys and girls. Will show it to my kids for a crash course on their dad!! Really kind of u very touched.  https://t.co/gmziAofwTj RT @RedChilliesEnt: What's meant to be, will find its way, just like Harry &amp; Sejal!\nCatch them at a theatre near you on Aug 4.\n@iamsrk @Anu… If I could make time turn into butterflies, 11 days would just fly away... #JHMSAug4 https://t.co/0PM0HUEFVm I wish I was there to give the Lovely Ladies a hug. Be proud girls we have achieved greatness today. @BCCIWomen u made all Indians proud. A film most cherished. Thank u all.  https://t.co/myeCEUf4CQ To the Women in Blue for the WWC17 Finals. You make us the most proud. All the best &amp; have a great game. Love to the Ladies. Thank u. So happy the JHMS trailer is being liked.  https://t.co/8ntaxJ6o5w Walked into the video @diplo is making for Phurrr! Got a starring role in it &amp; his Decent jacket. Wes u r dope! Thx https://t.co/1DLxfcAP3n Took the kids 2 @Unistudios , this time AbRam’s turn. Thx for the hospitality &amp; as always I am a wimp on the rides! https://t.co/33N9oOQ283 Rule the world!!! Best of luck and health to the whole team. Give them a big hug. Love u all.  https://t.co/7Asxg2fb5o “Ab toh dekh hi lete hain…“one of my favourite lines from JHMS… https://t.co/QXfLu3Id8j Arre yaar. Let’s do it in part 2 now. Last nite kids telling me how much they love OSO https://t.co/g0tL0b78zt The JHMS trailer for all those asking, questioning &amp; waiting for it!! Thx for ur patience! C u in Theaters on4th Aug https://t.co/CTRxTMzgCC Technical glitch after preparing it for hours. So sorry all media …couldn’t answer questions.But here’s my solo pic! https://t.co/HZoEwro4mF This guitar has had a Safar of its own. Gave it to @ipritamofficial before the film &amp; he gifted me the beautiful music of JHMS in return... https://t.co/V6apuRQeBQ Wow @Imharmanpreet Go India win this one!! Me missing Radha too https://t.co/u9Z2nBlzdE And I refrained from smoking even though the area sanctioned it! For a break in LA. https://t.co/TeVymKbl7k RT @RedChilliesEnt: Harry's Punjabi or Sejal's Gujarati? Which Tongue Twister Challenge are you up for? Take your pick! @RedChilliesEnt htt… Enjoy Jab Harry Met Sejal in theatres in UAE-GCC, 3rd August onwards! https://t.co/LxadJ6CyFl RT @voxcinemas: Advance tickets to #JabHarryMetSejal is here! Book now for 3 August at https://t.co/jFwFm6sO1F. #JHMSatVOX https://t.co/6x9… U r taking me to my birth city wow!  https://t.co/3n7rtYULHZ @paulocoelho U said ‘Lov can consign us 2 hell or 2 paradise,but it always takes us somewhere.’ It made me a star &amp; u a world famous writer Hope all good with u https://t.co/HbVR3k8YM3 Of beautiful &amp; happy Tales &amp; Head gears of Punjab &amp; Rajasthan. #HarryonTour https://t.co/37iTn8aXU9 Thank u ITC Rajputana…I dreamed of me all nite long and woke up in love with myself all over again…!! https://t.co/vUwvltePoN I am all yours for the love u all show me. Thanks  https://t.co/MjRvDCeeIw Awesum. More than recognition it’s heartening to know that ppl recognise what v fx are. V will make in India &amp; rule. https://t.co/fvqKE4V9u3 Ha ha. It sure looks like it https://t.co/vTMbcZV09O Very sweet. Thank u and hope the fever continues https://t.co/2jIn44Hfc0 Landed in Jaipur. 4 cities 4 JHMS songs. Let me know which is your favourite.  https://t.co/CfeTWcIeDW https://t.co/5YjQhiDZcx I saw u too!!! https://t.co/7qkXBnJgzY Taking my job as a guide seriously…started with a tour of Mehrangarh Fort one of the largest in India. Khamma Ghani https://t.co/yMoQQAf32S Ma Ma main Guide ban gaya (honorary) Jodhpur Tourism Guide Assoc Thx for making Harry a part of ur family. https://t.co/3pySEdXZTt Thx Indian AirForce for ur kindness. Now to Jodhpur we fly….Harry on a tour… https://t.co/XUWcJKkHUs Thank u. U give life to the song.  https://t.co/BUZIHsgjc1 Jab Harry &amp; Sejal Punjab waapis aa Gaye. Wot u seek u find in ur own desh ki dharti &amp; mitti. https://t.co/xL8Tq8y0Dc Bahut Vadia te Changa both Bhaina https://t.co/f3rHp9NOxb ButterChicken,Butter Milk &amp; ButterFly all the way from Punjab.With marvellous Nooran Sisters.https://t.co/X5EAStlheS https://t.co/HU1nEMYdyX Harinder (Harry) heads home. To Punjab to free the Butterfly… https://t.co/x8plqFh4si Thank you Hindware for associating with us on Jab Harry Met Sejal\nhttps://t.co/aSa0VpRF4q Jab Harry-Sejal met the Foodpandas… thank u for associating with us\nhttps://t.co/kmKjQ7HpiV We were happy to look for your ring too! Thank u TBZ for associating with us\nhttps://t.co/4GfX2pqkpR Cheers to a wonderful association with Sejal, Harry and all at Heineken\nhttps://t.co/gUZu7CHrYN This is very sweet. Thank u https://t.co/5frOBP7Xyx for associating with Harry, Sejal and the team\nhttps://t.co/M3bnWbbyUZ https://t.co/zCtC3FIkAr\nC&amp;K Thx for embarking on this journey with us 15 beautiful yrs Devdas.Thx Sanjay Binod Bela @madhuridixit Aish Jagguda @kirronkherbjp &amp; cast/crew for my fav film. https://t.co/gg8c2bS9en Thank u for ur association.  https://t.co/CxupPKa5qW Quite awesome. https://t.co/4vFNZt8r9o Saw Pilgrims determined 2 continue Yatra inspite of the dastardly attack. Faith makes u Brave &amp; will always win over cowardice &amp; terrorism. More than stardom I believe he is born for Lovedom! So fortunate to get such love from so many, he is blessed. https://t.co/xEwz6d6Gjd Thank u for allowing us to shoot in your Iconic museum. Extremely gracious of u. https://t.co/1XiiS0fAi5 Thank u my love. Missing u. https://t.co/qr3SZt4eC4 Saddening to see innocent lives being taken. Prayers for the victims &amp; may God give strength to the families of the #AmarnathYatra pilgrims Safar ka hi tha main, #Safar ka raha...\n\nhttps://t.co/18i6p5cvW7 https://t.co/fDUsdi2cXS Bhai @ipritamofficial ka talent impressive hai u r rite. But uske six pack dekhe tumne?!!No competition to me as yet https://t.co/2MG9RKcDfa Come on convince Imtiaz na..u and i can make it a duet. Please I want to sing this song..I will teach u the Notes! https://t.co/vaRFx1FbTT .@ipritamofficial @irshad_kamil Imtiaz wouldn't let me sing our fav song #Safar. @raiisonai did &amp; yeah it's better.\n\nhttps://t.co/18i6p5cvW7 I want to do this too. Glad u like the song.  https://t.co/EAqiUlCT6N Sending u the next one releasing today. Hope u like that too. Safar. https://t.co/Wriyj1g1Eq When she says my name it sounds like Hairy Dairy Mary Fairy…anything but Harry. But I like it… https://t.co/n3PJ0mpA7t Early morning 2 bed, early nite 2 rise…makes a man cut down his age by twice. Healthy habits bro! Lighting helps too https://t.co/hX0J74JUQT Hectic but fun song shoot. Back on floor on a rainy languid kind of day… https://t.co/OsyI1aZvVj RT @Saavn: #Radha hits the 2M milestone 🎉 on Saavn and rules the Weekly top 15 charts at #1 💪! Click and spread the love 😻👇https://t.co/82t… Thank u so much bro. Bless u and the family.  https://t.co/DqRLpCBHVT Groove with us on #BeechBeechMein full song! \nhttps://t.co/9xcK7OZsut\n\n@AnushkaSharma @ipritamofficial @redchilliesent @sonymusicindia Sur lag jata hai mera tumhaare wala #BeechBeechMein\n#SongTrailer- \nhttps://t.co/9lDTqRcwsd\n@AnushkaSharma @RedChilliesEnt @ipritamofficial Will be at Tamasha in 45 mins. Flt delay &amp; a bit of traffic aapke aur mere Beech Beech Mein https://t.co/AIq7sPkPFO RT @TwitterIndia: And what you were seeking has been found on Twitter! \nUse the hashtags #JHMS or #JabHarryMetSejal to make the ring appear… .@AnushkaSharma You know what ma'am? Aisa kaam mujhse aaj tak kisine nahi karwaya! @RedChilliesEnt #JHMSMiniTrail5 \n\nhttps://t.co/MXqRMUR8l2 For those happy moments…&amp; relationships…which r fun cos they r not complete…sort of #BeechBeechMein Tomorrow. https://t.co/dPzDTYlrMl .@AnushkaSharma Sejal, this one’s for you! #SejalWave @RedChilliesEnt https://t.co/Ku2W6e6ysq Thx for liking this song so much… next one to follow soon. https://t.co/Z6AJcDQZPA U don't need to look far away for what u seek! It's right here altogether, Jab #MiniTrails Met #MiniTrails. @AnushkaSharma @RedChilliesEnt https://t.co/vHuBJ42enS Harry aur Sejal ki tarah idhar udhar bhatakne se behtar hai ki sab kuch ek hi jagah mil jaaye toh... Jab #MiniTrails Met #MiniTrails https://t.co/mybsP4IbnF Ma’am! Kitni baar kahoon, mere liye Sejal hi kaafi hai! @AnushkaSharma #JHMSMiniTrail4\n\nhttps://t.co/YUZKbQ2I7M What exactly happened that night? #ItHappenedOneNight @S1dharthM @sonakshisinha @karanjohar @junochopra @abhayrchopra https://t.co/afZ4akctlE Good idea  https://t.co/8O1Dfscg38 Imtiaz @ipritamofficial @raiisonai Idhar ka hi hoon main,udhar ka raha,safar ka hi hoon main safar ka raha Rain song https://t.co/1l1Ul8KUrr RT @FeverFMOfficial: This is how @FeverFMOfficial is going ga-ga over #Radha from #JabHarryMetSejal! https://t.co/D2sjfUG5d1 Eid Mubarak! Thank you for making my day special. And thank you for joining me on this glorious journey of 25 years. Love you all... https://t.co/QGPWFZ6hwK RT @HyundaiIndia: Buckle up for a new experience! #NewGenHyundai. To stay updated click here.https://t.co/MbPaKxTud5 https://t.co/hu9QcWwltd Coming  out in a bit friends https://t.co/RTpJs3cQIJ The song is lovely and so are you. Made my day seeing u sing it.  https://t.co/lbyyUJdaFu Aap ko bhi. Lots of love to u and family  https://t.co/lnrNnQXQNc Thank u so much my man. Really sweet of u https://t.co/ZVekAbWb3q Went 2 bed early cos been a hectic week.Woke up for no reason &amp; realised I am 25 yrs old.Will deal with all this love tom.Thx for bearing me So special.Thx to Mr.Palekar @SrBachchan Rani Suniel @iam_juhi @AnupamPkher @ravichandaran1 &amp; crew &amp;especially Bobby https://t.co/1UulL1sruP @aliaa08 All my love to u lil one Have a good shoot. U do well Bosky @meghnagulzar https://t.co/fvKOtwR4ve Please catch Raees on Zee https://t.co/Nqb1yBsBhA Wish u all the best https://t.co/MQuXZlbN2F The pleasure is all mine https://t.co/9D6OQW9D15 To all my Tamil friends heres the dynamic trailer of my friend Maddy's film #VikramVedha @ActorMadhavan @sash041075\nhttps://t.co/FVuxuSCn2i Thank u sir. So glad u like it. Let’s shoot na! Missing u https://t.co/21RMikGWAf Thk u hon’ble CM @vijayrupanibjp for regaling us with ur stories of the past struggles &amp; vision of ur future dreams https://t.co/ucleDIWXKK Aah well. That kind of a happy day. Thx everyone in Gujarat for ur love. https://t.co/Krf3bvDBUU Meri Sejals, Meri Radhas... made Imtiaz Ali take this picture so he stays out of it... love you all https://t.co/qSmdTl4M0Z https://t.co/CBD44yhtxS Sejal! Time's up. Bata de will you be my Radha? @AnushkaSharma @RedChilliesEnt @sonymusicindia #RadhaOutNow \n\nhttps://t.co/qSmdTkNaCp Thank u so much https://t.co/JfoMqkYj5f Thank u so much. Bless u https://t.co/tDz0BTlA2P Happy u like them Diana. Thanks https://t.co/PQ9uQKwYy8 Thank u sir. We r trying our best.  https://t.co/7HOSYcWkkN Thank u and thank u for Sita too. Will read in a few days.  https://t.co/4vfhbXgPMd Thank u https://t.co/CztUjkbzGS Thank u for liking them. https://t.co/a26NtSIS6q Thank u lovely one. https://t.co/YSYpJPcyXZ I warned u I am cheap https://t.co/JdlV4RTH0I Glad u r enjoying it https://t.co/sQVBMgGHLM Say what!! Is t it cool. Thanks  https://t.co/yjmHMse9xp Thank u for hosting us https://t.co/VeCHiJWhGy U r too sweet. Thanks https://t.co/UK62dUUDFc Thank u for like big it https://t.co/3lnf3AeSGS Thank u so much https://t.co/P29VdQzFWW Well, they have all agreed to be my Radha! Do you? @AnushkaSharma @RedChilliesEnt \n#RadhaComingTomorrow https://t.co/wWpka5Bbf4 Excuse yeh hai ki main character hu…A1! @AnushkaSharma \n#JHMSMiniTrail3 \n\nhttps://t.co/BFNNFMohTL Extremely happy &amp; proud to be part of Global League. Will try our best to make Cape Town &amp; Newlands proud of us.  https://t.co/WcY81D9gek Ha ha https://t.co/aRSos9uTk9 And a fulfilling Father’s Day at Arth designed by @gaurikhan https://t.co/t371Qq4CFP My pleasure https://t.co/obfbLCmmuN https://t.co/OtFn07awEK This is  a must watch. Ab mujhe darne ki zaroorat nahi! Ye Indemnity Bond hai na! @AnushkaSharma #JHMSMiniTrail2 \n\nhttps://t.co/riXKGtw8KY Me too me too. Love u https://t.co/sMWKNwfNsk Sejal, maine toh pehle se hi bataya tha ki main thoda sa cheap hoon! Aur kal kuch aur batata hoon. @AnushkaSharma \n\nhttps://t.co/n864hYRtFf Yeah sure in my dreams I would ever be able to smash u around!! Ha ha https://t.co/NoG5NDh0Pv Thank u mate. Been so long since we met. Be well &amp; enjoy the match. https://t.co/kEyCJwUfDU All spruced up 2 cheer for CT17 Finals. Also excited to present the MiniTrails to the world #JabHarryMetSejal https://t.co/hPZDXz1uFo Thank u ji https://t.co/ZuBp84aJ9O Am glad u enjoyed it. Thanks https://t.co/XsyJf4jsKj Thank u sir. U r kind  https://t.co/9P2IW4Z4WC Thank u for coming https://t.co/JkaZVRwyZx Yes fun time and win time tomorrow. Thx for having me on the show.. always a pleasure. https://t.co/v4AyyV9PvA Kithe hai kudi... Kithe hai meri Sejal? Aa raha hun dil waapas lene. Let me know your city: \nhttps://t.co/8HF6gVaYUi\n#HarrySeekingSejal https://t.co/gKK4PeUyn5 Jagga Jasoos we r quits now!!! Hisaab barabar. Give @karanjohar his share for the ‘Jab’ part in JHMS please. https://t.co/gPtrUdwedD Leather jacket,the bike with macho Imtiaz sir atop!The pic is self explanatory.V r fans of his model like looks. https://t.co/h0D6sUD7tv Wish u and ur family health and happiness  https://t.co/7cZ61ydSHv https://t.co/NpDl7V7SNL Thx for the tip ma’m we r all set for 2017 too then.  https://t.co/xaiwlRVlA8 https://t.co/cXST7PHl4M U could have used a better picture for Harry…Sejal looks lovely. https://t.co/XhSvvgFADp Was working so couldn’t attend this lively recording for #JabHarryMetSejal https://t.co/2f3VzkBUKL Action comedies. Love u  https://t.co/MTxFXWOMNz Thank u all. Have to go now. Movie time with AbRam. Love and happiness to everyone. Till next #AskSRK https://t.co/JZzhfZ8xAj Love u all https://t.co/cHXZIhDPYB Ab iska kya jawab doon. I love the title! https://t.co/di0p51cJwi Songs are very good and situational https://t.co/RQhVzrkXnQ She is lovely https://t.co/2edANln2bF See it on 15th https://t.co/sE1ABfN3gA In spirit of course. Have shooting here https://t.co/WS47wEwiRY So glad she is doing such varied roles https://t.co/cbR1P020Q6 Yeh joke purana ho gaya...koi nayi baat batao https://t.co/Wfirh8InAX Pizza bhi deliver kar doon ghar mein... https://t.co/l4FzgtZfYg Captain Cool https://t.co/g6XhOylRZa We r a family of jokers...all the boys in the family. https://t.co/WDnILgJnuZ Love u https://t.co/ihqJnVsTOA I like the shape of you https://t.co/uCaB7xAwcx Breakage is bad...period https://t.co/3I62Q9Ke1H For the same reason that Rhythm is spelt like this https://t.co/cbMX7qRea6 Pucca https://t.co/ZRXoh99Hmg Nahi toh... kya??? https://t.co/QHjB4IxV9C U r all beautiful https://t.co/9cXHqu5mje All the best https://t.co/YT9LWdfEhm Red Chillies all films on Netflix...don't know about YRF https://t.co/cmlBTNL4u4 Was fun. And Diljit has sung it awesomely https://t.co/cCrrM7V8qL Yes seeing that one only https://t.co/XrYaQCysDH Dil le gayi kuddi Gujarat ki... https://t.co/NGJzunC6th Taking 10 mins break from #AskSRK putting on A dinosaur movie for AbRam Nahi uss din main Salman ke saath hoon: https://t.co/KgSbA2cpwn Sapien https://t.co/BFKqDMCaHQ And no need for population control here! https://t.co/lAmEbeUnrG I had thought it will be loved...but in life wot u love need not be an object of universal love. So I have Fan to myself forever now. https://t.co/byVWFZDxnx Hello Garib https://t.co/M9r8U6en4Q Puppy eyes work always https://t.co/PeJKYrVkpH Peace Love and Kindness...damn I sound like Pageant contestant!!! https://t.co/G9KO2XeOfr So sorry but main Sejal ke saath hoon uss din! https://t.co/WTZ2TK79Df Tum bhi https://t.co/H47cb9gYTW To begin with it's Jan Harry Met Sejal. U will as days pass. https://t.co/qRBqKa9NoP Love u https://t.co/ID0liH6t78 Awesome and a gentleman https://t.co/qKTcV6iJL8 Choti choti khushi mil Rahi hai https://t.co/EMveJmtRIc Always get so much love when I am there https://t.co/3bx1FO1EBe Love to u https://t.co/nGIXE9LBKl Thanks for appreciating https://t.co/3i2MIKQUKn Hi https://t.co/z9SsctnnLT Marks don't maketh a person ...u have have a lifetime to make a mark in life. I got only 88 I think https://t.co/TR8hMqJp5R Love to mom and u https://t.co/o4qyD1mtXc Butterfly and a Diplo song https://t.co/ghw4riihdN He has a great sense of humour and is very kind https://t.co/i7WKvmG3VF Meryl Streep https://t.co/enwhq0UPKE Been working for 25 yrs to get noticed...don't want to be invisible ever https://t.co/l7NogwCKIt Love u https://t.co/NM9C9JqmLv Yes and it's called Rehnuma also!!! https://t.co/UgUpyLcNWg Jumping in front of me https://t.co/0fR51i7uCs Your own love stories https://t.co/lwMLwduhHp Bech rahe ho kya??? https://t.co/V2nU2szGoA And because it's been a while and exciting stuff happening all around.lets do a #AskSRK 15 mins then I hav to dissolve into work And for those who r feeling like this today….remember there r so many other days…Jab Charlie Met Snoopy https://t.co/YKHMrRe0kD Chalte Chalte our first commercially successful film. Changed the course of our lives. It was lovely Aziz @iam_juhi @RonnieScrewvala &amp; Rani So nice to see sooo many meeting so many. This is my contribution “Jab Harry Met Hair all over the place Ali”… https://t.co/BpMvsD7k71 It’s so good &amp; relaxing to see our team so much in control. Well done Team India. It was fun shooting with u. All the best https://t.co/8PQM1XoJfj I am so sorry Sejal Badala. Hope u like my next film title better..it’s called “Badala oops Badle ki Aag” https://t.co/7cX23EaSH8 Your title I have kept for the film you and I do next…https://t.co/66m0JsJ0mw Exactly.... #JabHarryMetSejalAug4 @AnushkaSharma @RedChilliesEnt https://t.co/yOjlltE2iI Do nothing.... Just... @AnushkaSharma https://t.co/6DD22JotC1 Bhai title mein hi itna time lag gaya trailer ki baat kar rahe ho aap!! https://t.co/ozMrsepJlo Just in case Ranbir Kapoor ever claims it…the title Jab Harry met Sejal was never ever suggested by him!So he doesn’t win the Rs.5000 reward ...is seeking you! @AnushkaSharma  @RedChilliesEnt https://t.co/8L6N7d5req Very beautiful.  https://t.co/mTQpuL1X6R As overplayed as the pun is, I still can’t resist writing…“Hav u ever seen a better pair of perfect fitting genes?” https://t.co/TLhbcBx46U Chulbul Panda!! https://t.co/ZkyCRhxzA7 Have a good day. Thank u https://t.co/SE5NWcrN9y This @aanandlrai brings so much happiness on sets &amp; the reason is cos he has the most beautiful daughter &amp;  wife…dimples overload. Thx sir My friend @mkoirala new film Dear Maya is out today. She is so beautiful in more ways than anyone can imagine…do go and see her film please. TGIF! Survived the week inspite of a plane crash, fatal accident on sets &amp; yet another title of Imtiaz Ali film! https://t.co/5W5DtrrupA And u r doing it all over again! We should hav another nite like this, I still have the shirt.  https://t.co/9iSV9RNBGw Well done. All the best https://t.co/aJXJsP0VkG May you be blessed by the love of God… and be guided by Him. https://t.co/nKRalK2vwp Ur pic makes me miss my beard!  https://t.co/jZe1GFuWWv How sweet are you to say that. &amp; of course when u say it then it’s big encouragement for the little one.  Thanks. https://t.co/hfFW8hx3o2 Exhausted after the little ones party!! Jumping Jacks r a killer. Phew. https://t.co/yGWePeW9S7 I felt that only parents know how to love their child…the overwhelming msgs for AbRam make me realise u all lov him so much too. Grateful. Heat, hard work and happiness beckons to @aanandlrai sets. https://t.co/a6faFonBNb Wow. Daddy cool cool cool. Be healthy and happy my friend.  https://t.co/mbRAPOWHMb My best 2 David &amp; Brad for the release of War Machine on @netflix Pleasure to meet u both &amp; Brad the dance remains https://t.co/mxq0GKrqoL I also couldn’t afford the suit for part2… Dekhna bhai if u get a chance during ur robberies get me one too!! https://t.co/z3ipp9tQMm Extremely sad to start days when innocent lives are lost. Prayers for the deceased &amp; strength to the families of the Manchester victims. And thank u all for the wishes for Suhana. Will pass them on when she is back…am sure she will be overwhelmed with your love. All the best papa. He looks as tough and gentle as you. May all good things come his way.  https://t.co/75DVSGC8J0 Thank u guys it’s marvellous!!  https://t.co/U5f3xQ4MNt Thank u for the 25 millions times love and support you all give all the time. https://t.co/6A5ZwxYr1i U have made my practice sessions public!!!  Now everyone will know I am not smart.  https://t.co/HC5AdAkLb7 Best of luck and have a good show both bhaajis https://t.co/8IYPTf0pIZ Glad on the winning side tonite. But play offs need to have an extra day in case of an abandoned match. Ami KKR onwards with @GautamGambhir Thx IPL for a great season &amp; everything that goes with it. Time 2 leave in a bit if the rain doesn’t stop or the match doesn’t start. Amazing how u take these candid pics my man!! Didn’t even realise when u did!  https://t.co/gqhFAwPE5N Am so happy u feel the msg of love. Hope my expression of it reaches more so that all know that love is all u need.  https://t.co/QxFKlxJPPc My pleasure to help her through the crowd. https://t.co/kbT0ezlCFM Nostalgia heartbreaks &amp; highs. Shared a full lifetime with my team over the last 10 yrs in Kolkata our city.Thx all https://t.co/BsUvVDAuBg TED(dy) Walk https://t.co/g6r02FzVqH TEDdy Talk and walk https://t.co/wjgAGcm5RJ Thank u my man.  https://t.co/sGZ3RxKWmH Thank u so much ma’m.  https://t.co/lx0MBX43HJ Thank u https://t.co/TntMCLDM4C Ha ha. See u soon.  https://t.co/3HfC8NNBGh U r keep me with your words and liking. Thank u https://t.co/8UTXQlU3GP Thank u my friend https://t.co/h5wZkxYkJb Thank u am glad u liked it https://t.co/zW7fPTlMSl Thank u https://t.co/ACpxQw8TP5 Thank u baby https://t.co/Z2tF4XqHCF Thanks love is all it takes https://t.co/cZO1T7NZFQ Am glad u liked it https://t.co/WSEZzcnA7D Sir aap se seekha hai. Thank u and love u https://t.co/Nzy1iSWxYH Thanks for being in Vancouver https://t.co/drw6hoGXKT Thank u baby https://t.co/SLaEWBtLsI Thank u Juliet for being so gently persistent and encouraging.  https://t.co/HLC2YFPMDx Thank u Chris for being so kind.  https://t.co/sZV3BNmizY Thank you @TEDTalks , @TEDChris, @julietrblake and @StarPlus... https://t.co/C2tnyGBf4P 'Create a world which is its own best lover.' My session at the @TEDTalks is now up. Hope u like it. \n\nhttps://t.co/0Xzud4213O A day of heat…headphones and helicopters… https://t.co/huNtvjPF4E Lost our way a bit tonight…does not mean we can’t reach the destination. Onward with more resolve…lov u boys. @lynny50 well played. Ami KKR Please say thanks to mom.  https://t.co/V6QyMpy1Kz It was just the fish &amp; me...till these photo bombers floated in!! https://t.co/RDMPI3m2GN After Kabhi Haan Kabhi Naa in '94, Sunil n Chris come together to make 105... well played boys! Ami KKR... https://t.co/30JSbFaqVE @TVSanjeev @TheAsianAwards Thanks and love to family too. Send me a voice recording when u sing it! @TVSanjeev @TheAsianAwards I lose to my elder son too. Miss u my friend and have a great night. RT @TVSanjeev: @iamsrk This  reminds me of how often I am in the palm of my son's hand. Also how I lose to him in an arm wrestle. Missing u… You well my friend. Let’s meet up soon &amp; dwell on some Raees nostalgia.  https://t.co/DnlNqdMlMx Nothing is more Hand some… https://t.co/CkikRPl4nc 11th May https://t.co/cXP7NOKo6Z  I talk of a journey,mind numbing acronyms,my country,Future Us &amp; Lov made in India https://t.co/B4AKbMZKks Was on way to drop my baby to school. U have a good walk.  https://t.co/NwCGoOVr43 Thank u my friend for having me over. U r extremely gracious &amp; granny is too wild and beautiful.  https://t.co/Q80yylOPkC Wot a class act @davidwarner31  well played SRH. Ami KKR I am coming…we always come back. Rest a bit it’s been a tough day boys. Lov u all After a whirlwind travelling spree spent a quiet evening with friends in LA &amp; met one of my fav stars…Warren Beatty. https://t.co/LPC4IIwrCE Thank u @TEDTalks  @TEDchris @julietrblake for a wonderful time. All who came to lov me in Vancouver…my lov 2 u. https://t.co/FJD3yWgxsQ Glad u had a good time. Thx for the support.  https://t.co/QzT40BPB79 Ami KKR...!!! https://t.co/cgyCqDlIha Windy LA enroute Vancouver. https://t.co/72pvpezoOf Off to Vancouver. Last long stint there was during the Pardes shoot…now for TEDtalks https://t.co/zFXdLi3dAf Looking forward to it and I hope I remember my speech!!! https://t.co/NDpdTWZVeQ Absolutely stunning.  https://t.co/t499UWr3Hk Do I need to say anything…but that I love u all at the Eden Garden. Ami KKR…YAAAYYYYYY!!!!! https://t.co/m6rjTFhOOl Years ago when I saw snow for the first time, took this pic to show my kids. Thx @Ishikamohan for keeping it safe. https://t.co/qL7xVZ3SAX Why so serious?! Actually it’s ok to like me seriously too.  https://t.co/4Us9pKpGot Sadness ko karo bye, Zindagi ko kaho hi! Catch me as Dr. Jehangir in Dear Zindagi, tomorrow 12 noon on @ZeeCinema #DearZindagiOnZeeCinema https://t.co/VUidVBY90E @sachin_rt I believed,when u did well I would 2 &amp; when u didn’t,I will https://t.co/UhouyNYvvx a billion others I miss my guiding lite.ATB for the film How fantastic was this win. Well done @GautamGambhir  &amp; Team KKR.Sum body is watching over us. Main bhi aa raha hoon https://t.co/PfNqq5sYtU Ami KKR. Well done @im_manishpandey @robbieuthappa @sunilpnarine74 @imkuldeep18 @trent_boult @iamyusufpathan &amp; all the boys. Dahaadness! Thx for the  tribute.All at @SFFILM @noah_sffilm @joshua_sffilm @kavitagupta19 u made me feel special &amp; all who came to attend. Lov u &amp; hugs Thx @BrettRatner for a great evening at the @SFFILM  ur doll is awesome like u. https://t.co/eJNTInUHBx Join in and watch me at the SFFilmFestival live on Twitter!\n\n https://t.co/S3wrjVPdnS Frisco such a nice night. Saw the trams &amp; miss Kolkata &amp; KKR weave their magic. Will join soon.Boys u were awesome! https://t.co/ZIUWRYgDgc Reminded of Dard e Disco…onward to San Francisco. https://t.co/Br5KOzmyry Oh well…there will be another knight. Congratulations Mumbai Indians. KKR boys v ‘slipped’ a bit but well played. Good effort. Punjab se Gujarat…only Pyaar…AmiKKR. Awesome @GautamGambhir @lynny50 my KKR boys &amp; @VenkyMysore Thx Rajkot. https://t.co/AlBAiytIEd Lehraate Khet, Ladkiyaan, Lassi Te Love in Punjab. Thk u all for such a great shoot &amp; to Imtiaz for bringing us here https://t.co/wMzexdCfof Thank u for the love the passion &amp; just sticking by ur team. KKR fans u make us!  https://t.co/mW53kxUDaB Super performance by @Pvsindhu1. Congratulations and thanks for making us proud. Thank u so much. U r as always kind &amp; encouraging. U r the role model I follow as always. https://t.co/Ooco3hliD9 Honoured to be at at the 60th #SanFrancisco Int Film festival &amp; looking forward to meeting my friend @BrettRatner. Also memories in SanFran 25 yrs in Mumbai, which has given me my life. For the 1st time at the opening of RC vfx new office  I felt, I must have done something rite. Spidey boom at home. They r coming out of everywhere! On the bright side, at least pizza delivery issue is resolved. https://t.co/DeBccRBuQt Success, love and prosperity to all on the auspicious occasion of Gudi Padwa... #GudiPadwa There are miles to travel, this way or that. \nAnd from where I am, it doesn’t really matter…only the journey does. https://t.co/Q7bBTk2CUE Thank u team Red Chillies. https://t.co/Myujj5X1QJ Sometimes the quiet cold is what u need to make you feel warm…. https://t.co/47xULMvjNh So happy to see magic unfold.  https://t.co/c2thWOeCYH All the best little one. Well done.  https://t.co/gFBSIPTbKR Would've shot Gerua with ice cream instead of going to Iceland had I seen this earlier... Awesome! https://t.co/usmNgu7LDG And guess what I just got three new colours too!!! https://t.co/wk6q2oMmqu Phillauri the attempt at doing wot u believe in. @AnushkaSharma @diljitdosanjh #anshai #karnesh keep believing in the impossible. All good my friend? Let’s meet soon and focus  https://t.co/WwNQT0RDys I Leica this pic. But I Leica mine better.  https://t.co/dMxleC5C9R RT @AnushkaSharma: Bhoot hoon! Apni superpowers use karke Mannat mein ghus toh gayi! Pata hai wahan kya hua? #ShashiWasThere 👻 @iamsrk http… Actors go for roles with possibility.Instead an actor should choose the impossible &amp; give it his/her best even if it means to fail trying it Late nite discussions with my director Imtiaz. He said Aaj Kal main sirf Highway par Tamasha karta hoon. https://t.co/tOyPpd8oAR A little late but my best wishes to Mustafa for Machine. Abbasbhai Mastanbhai &amp; Hussainbhai my love to you. Thx IndiaToday for the platform.Had a great time &amp; happy 2 wear a suit for u. Mr.Puri &amp; team nxt time dinner fr sure https://t.co/tZwKTkO0np Sorry if I bore u with my theories of life. Thank u for the late night stay sir.  https://t.co/FT8kFCdwZg While growing up our mantra was “Any nite, just u me &amp; my leather jacket” Imtiaz reminded us of the same on sets too https://t.co/DY42BbjxvV And the little one spreads the spirit of Holi with little Legos. As long as the happy colours colour us… https://t.co/wAhbbTam7k My beautiful neighbours hav been dancing to loud music since noon. So happy instead of working I am humming ‘I’m in lov with the shape of u’ Yes man.  https://t.co/qnjVbL1YEd Happy Holi to everyone. Be happy and high on life. https://t.co/qL0eR9Uqif Netflixed &amp; Chilled. Thx @reedhastings Ted Sarandos &amp; team &amp; my friend @aamir_khan for breaking his regimen for me. https://t.co/ruFbIozkxQ All the best boys for a happy season. Welcome aboard https://t.co/nWLJRSmXlm Had a minor follow up surgery on my left shoulder.They marked my right hand like this, so there is no mistake. Sweet https://t.co/LH5aoh3X4y Kaise hain aap Aseem sahib. India ka jhanda lehraate rehna US mein. Thanks https://t.co/jNaYIJrvWr Every time the past weighs on ur heart, or the future frightens u..shut ur eyes &amp; make him/her ur present. https://t.co/Lw2kG1qhEH Hold her hand so that she can lead you. Happy Women’s Day https://t.co/U2wogCQiQ1 Thank u little one for the night. Keep doing amazing work &amp; make us proud.  https://t.co/BETr4EhPJE Thank u for doing all that u and ur team is doing. Next time can I eat chicken also and not just wear it! https://t.co/hG1dNsTtL6 Yes never know where and when I may have to celebrate life…so hav party halls ready all over. Ha ha  https://t.co/BbmGFWMS9E Thx @MWSYouth @AzmiShabana @ManishMalhotra #Namrata for making me walk for women equality. It was such a happy show https://t.co/ln1wsm5QtM Thank u ma’m. U r sweet to make me feel so welcome. See u soon https://t.co/GKyBns6Y4E @shahidkamal will mail and meet next time I am in London. Be well and give my love to wife. @shahidkamal let me know where u r at...will come and see u. U still gaming?? @shahidkamal how r u my man. Miss you. U showed respect to taking Indian film stuff into gaming. Thanks. Be well Walking ramp for #Mijwan -Summer17 by @ManishMalhotra showcases chikankari by #Mijwan women.@AzmiShabana Difficult job u hav given me! 5Mar Hair on the chest lady…need hair on the chest!! Working on it though. Love Hugh &amp; Wolverine. https://t.co/LZKOqhLPdU How lovely it was to sit &amp; watch u perform this role. My favourite times as an actor.. bas dekhta rahoon https://t.co/13CgXAcmnV Went to Body Sculptor Bandra first time. Worked out &amp; they serve healthy dinner too. https://t.co/vqaq1cbJtP Very nice https://t.co/82IieCsC16 Was happy for this last night. Thank u all https://t.co/XVWKtnSRWO My dream is to meet u…my magic…my affirmation that life is beautiful. https://t.co/iSIdsCwV7O As Life inflicts pain upon u it balances it by creating a stunningly beautiful thing around u too.All u need 2 do is find it #23YearsOfKHKN U r bloody creative… watch like an.. nice. https://t.co/WOoEIyglOG Raees releases in Egypt &amp; Jordan today. Hope u all enjoy it &amp; thanks for watching Indian films. My love to u all. https://t.co/dbR4Sk2J75 Hope u r well and thank u for the revisit. But I must say u do overstate the importance of Rajma Chawal.  https://t.co/qi5vX2zhRk Was lovely to work with u ma’m. U have such an amazing happy energy.  https://t.co/IJKwNX9EIk I think we are all set. Well done Team.  https://t.co/QB3ebnAYks Ittefaq starts now. Thanx to Juno and his wonderful team. https://t.co/uU8Xt0tmyH My fav films by Yashji #Ittefaq is being recreated by Abhay. Thx  @S1dharthM  @sonakshisinha Akshaye. Also BR &amp; Dharma Films tie up with RCE Let me know the time and place. Will figure out my own accommodation! https://t.co/epmqhSQDIx Thank u it’s nice to read my beliefs lest I forget them to the daily grind.  https://t.co/7Wu2eDfcoH Dirk Gently is a TV series!! And I didn’t know it! Woe be upon me. Sorry Adams. The pic is for no apparent reason. https://t.co/K2BWtCQ32a Am a big fan of TED Talks so this is extremely exciting to be spreading #NayiSoch on @StarPlus with @TEDTalks #TEDTalksIndiaNayiSoch Thank u hope it does well for u https://t.co/On5mEjTE48 Here's the making of the song Udi Udi Jaye from Raees... \n\nhttps://t.co/DuUheAazH8 Work always makes me happy but when it’s with beautiful ppl like Vaibhavi &amp; team and Imtiaz &amp; his mad boys &amp; girls it’s like the happiest. ‘Romance Like SRK’ uff the irony of this trend!! Let me see if I can do a romantic Valentines msg for all of u when I wake up. a late night walk along the juhu beach…hand in hand…&amp; the sand castle we made will last a life time..we r sure. https://t.co/x8jqCQ0wGY Here's what went into breathing life into Raees - the character... From script to screen!\n\nhttps://t.co/ay8BTDGfYI Beginnings.... https://t.co/DkmBxk5Ipv Just heard India won the T20 Cricket World Cup. Couldn’t watch the match. How awesome &amp; inspiring is that. Boys I want to meet u &amp; hug u Thank u so much. My next journey is to try and meet u in person. Love and health to u.  https://t.co/J2hMsBybI6 This is so beautiful my friend.  https://t.co/6K6q3SCLkQ It’s kinda sad too that MNIK is still relevant.But thx Karan Ravi Kajol SEL Shibani Niranjan Deepa Jimmy &amp; all cast/crew for a special film Known each other for 25 years and this is the first picture we have taken together of ourselves. Was a fun night. https://t.co/7aYKOFll1a RT @RedChilliesEnt: You loved her and the song, now see how all of it came to life. Here's the Making of Laila Main Laila from Raees. https… This is so sweet.  https://t.co/xJH8s7YhuP Very cute missing mine now https://t.co/w3jxfN2U4B Thank u for taking out time to do this.  https://t.co/rsCN5ooSuK U r inspiring.  https://t.co/yylr0lw0eT Too too sweet. Main paidaishi bhoot hoon!! https://t.co/1zSqraPmT9 Thanks for seeing it. Been a long time since we met. All good with u?  https://t.co/wSKLFjCFIm Couldn't let this @SonuNigam song from Raees not spread its magic. Thx to @shreyaghoshal too. Here's #HalkaHalka ! \n\nhttps://t.co/mpVQ832Fhx Will see it with AbRam when he is back from his travels. All the best &amp; my love to u. https://t.co/veUnRUNakZ Boys and girls new song from Raees coming up in a bit. Didn’t make it to the film but will make it to ur heart I hope. #RAEES275CRWORLDWIDE “Twice or thrice had I lov’d thee,\nBefore I knew thy face or name;“ Air and Angels by John Donne https://t.co/hRGfOYdh6K Germany enjoy the film https://t.co/T1t1GaqzGU Hope Japan u liked it https://t.co/mvQO7zQdOs Hope u all enjoy it https://t.co/kUVYgnENri U r beautiful to make me look like this. Thank u https://t.co/1XIpuUHc68 And u babies are awesome. Feel happy after a hard days work. All this is worth it… if it makes u dance: https://t.co/YczZ5cWc5H Bahut pyaar aaya tum dono par. Thank u https://t.co/L9KvF5e4X4 Thank u for making me look personable https://t.co/yn6siqce4b Very cool. Think I should get a remix version out too.  https://t.co/0mdarFXcn7 Thank u girls. Sending u love  https://t.co/mbcrIWdaN1 Thank u so much  https://t.co/evJMJkaUXq Stunning it is dada. Now u r working NA for Imtiaz film??? https://t.co/g7lVeNgQoc Thank u lil one https://t.co/hmlP944ozk Thank u Ambajogai https://t.co/OX4z3mBS6P All stories r same…Bye bye bhoots hi Zindagi…https://t.co/2ruyx4tlkB As an actor I want to be in a place that there is no difference in wot I live and wot I do for a living.Ruthlessly turn towards my own truth Goofy yet pertinent for all times… if u r a Woody Allen fan. Liked Crisis in Six Scenes. Thank u my man. Hope u enjoyed it.  https://t.co/3AnPcxDPqO Tumhein kaamyaabi mile. Be well and keep working. All will be well  https://t.co/CeviD3fafy I hope u enjoy it Germany. Meanwhile here we r ready for the second weekend. The party continues.. https://t.co/bFV0uryz3j We did censor bits though… https://t.co/Okp5nX6CEN Have a lovely wedding  https://t.co/4R6BwBCEKL Thank u. Lekin Firki pakadhne ki aadat nahi daloonga https://t.co/tDEXV2ekfF 2. He has keen, fiery insight and vast dignity like the night sky, but he conceals it in the madness of child’s play.” Rumi That kiinda day 1.“There’s no one with intelligence in this town except that man over there playing with the children, the one riding the stick horse.(Cont) Saanson ke kisi ek mod par, mili thi tu zindagi... Meri dost banke. Morose but melodious, really like this song.  \nhttps://t.co/laYenEiT3I My favourite song from Raees. Even better in the film I think. Hope u all like it https://t.co/cTrxcKYXgH So pretty she is https://t.co/XoEQghAQNX Ok done now. Have to be with kids. Love u all for the love. Like Raees ' Ab Jaa Raha Hoon Main' God and audience has been kind https://t.co/92hBT4bs5H As always sorry can't reply to all https://t.co/343ZsEWGyB Was lovely to work with her https://t.co/Ak4C6Ujmiy How much have I paid u tell everyone now https://t.co/HPbr1RvFlL Go on eat me https://t.co/4aQEABdr4n Yes it was https://t.co/UDQNZgQhqe Beautiful https://t.co/ojA15sFsJv First class hai bas! https://t.co/BkHkWRx588 Oh oh how?? https://t.co/KA3cyR1rQj Will be there https://t.co/GPDjfcKpGX Absolutely he is a friend https://t.co/Wh5KMAlj6R Manchester by the Sea https://t.co/CztmUrBIfq Stay in bed https://t.co/9P8y1r9h9B Will come to thank u all. Raees very big there in Kokata https://t.co/FBLHWzgzUV Play with my kids while they read the script. https://t.co/fLU0En6FhO Dhingana means war...war of work https://t.co/Cs1fcVlmD6 Cannot reply to all. Also need questions to answer. https://t.co/HSrTHE1QJp She is awesome https://t.co/yuS4Ro4OmR Will try honestly https://t.co/Z8nhol20MD Love my day job https://t.co/nuCmkify2X I love u too https://t.co/rkiKh8dOTs Oh wow. https://t.co/l4adNhpCgi Happy wedding https://t.co/sQl8CELlOn All the best https://t.co/K6kAvAH7Ix Sorry main unmein se nahi hoon jo picture chalaane ke liye paise de. Kaam Karo kamaaon aur phir picture jao. Lov u https://t.co/MKcrScqLR5 It's like shaving Adonis when I shave...ha ha https://t.co/SjtsYAFJPA Yes I should I think https://t.co/jRNmNshUZt Ja Beta ja...jee le apni zindagi https://t.co/8S6wam9X2B Awesome https://t.co/EFH5NRx23r Very happy https://t.co/gBN1pOsVN7 Very nice https://t.co/HrnlgnyrOa Sookh ke kantaa ho Gaye ho. Kuch khaaya Karo https://t.co/BBlRhjIwA2 Thank u https://t.co/rKjwtieMcT Absolutely https://t.co/kLyZGYL1qr None all very boring https://t.co/jjMubMB5hB Mine is 100 cr ha ha https://t.co/adLTS8LfTi Dhanda Karte waqt Hindu mussalman socha tha joh ab soch rahe ho. https://t.co/nUwbocBCkb Love u https://t.co/VQ05B95c6h I am going to work harder and smile more because of these lovely women from today https://t.co/O3LZT1Qufi Baap par gaya hai https://t.co/Dv9b5Lvog3 You look amazing https://t.co/BUeOIcMKP0 Ha ha. AIB r always fun. Had such a nice time with them. https://t.co/0j2fU466Km Pune was fun https://t.co/DaCLcwzN5p Not confirmed any post ALR https://t.co/zOG6XddcfO Here https://t.co/vOp53Swdef It's the fire in my heart https://t.co/MwQV8NH8YE Very Raees https://t.co/GZLnTUopp6 Bahut https://t.co/w6NJZ8G9kQ It's as good as it can get https://t.co/9BZLdfkr06 Dimples https://t.co/1aJfF1iS1m Le lo https://t.co/bcxwKf0wMY Love u all https://t.co/gOSdmJtUbi Soon will see Raees with u all https://t.co/miYj8KYLKH Feeling very happy. Let’s do #AskSRK for 10 mins. Those  who don’t want their TL inundated with my replies..go on mute mode now! The ladies &amp; the lungi. Can’t get over the fragrance of lov sacrifice &amp; hardships these women surrounded me with. https://t.co/aPF2A3J66q Very sweet. Especially tedha mooh…  @varun_dvn &amp; @aliaa08 look lovely together. All the best bhai https://t.co/olF1QSu94l Tha u  my love  https://t.co/guDvRBshBw Yes I will meet u https://t.co/yddwMMUtla Thank u Outlook. Got me a little sad to meet me all over again…and nostalgic. Thanks for introducing me to me again. https://t.co/Mm7SBpQyTd So glad u enjoyed it baby. Come and spend time on sets again.  https://t.co/lXTRV1Ja4t Yay India…what a performance. Congratulations to us. with @SEWABharat in Ahmedabad. Women r my teachers. Thk u for Really believing in Koi Dhanda Chota nahi hota...lov u all Bens &amp; Rima Ben https://t.co/yfRfQegi7N What yaar??!! Was having so much fun  https://t.co/9Kos289zZ2 Thank u Ahmedabad love u https://t.co/7MfGDPJPKb What a beautiful way to end the day in Ahmedabad. With the beautiful women of SEWA. Thank u girls. Love to Gujarat https://t.co/B3vpXZDy6m At the Sri Darbar Sahib. Peace and love and all feelings beautiful. Thank u Amritsar. https://t.co/gB53l1HJvK That’s sweet https://t.co/Q8MzoQIIhq Awesome u all look https://t.co/3Zf6gw4GzY Thank u girls https://t.co/7Admr8eiqr Thank u https://t.co/r7fdnpazNX Thank u https://t.co/TwVAfKss6V Thank u for watching https://t.co/PmiLxxGdcZ They are https://t.co/RXr8IOQvl4 Thank u for coming https://t.co/YS8QNSYma5 Thank u https://t.co/Z5uAOdUo0K Thanks girls https://t.co/12rGBwGGbj Love to u https://t.co/LJq2sQYHfH Thank u https://t.co/bNCUyAyu4U Thank u for being a part of Raees https://t.co/KDv0O4UtsB You look nice  https://t.co/viTmjFTHa7 Good u came thank u https://t.co/OA7KzNzU7A Thank u guys https://t.co/IDTxHNP1Hd Awesome  https://t.co/jwOW2OyxqW Thank u all https://t.co/lCDVsk05o4 Thank u guys  https://t.co/suJg7SfnwG Happy birthday https://t.co/t6Uq7w10Xs Thanks for your time and love  https://t.co/JvmCGZM6bS Nice to see u have fun https://t.co/TWC7LoYdST Hope u enjoyed it https://t.co/oqPD1D2N3l Love u all https://t.co/NCcvzJyCp0 Glad u came https://t.co/XM442YtSGM Thank u friends https://t.co/Kf9H88PSdS Nice to see u all at the theatre  https://t.co/WumJJ2ZdQo Thank u Peru https://t.co/CdmoVtEUe3 Thank u bros https://t.co/fod8oWIvb7 Be happy always https://t.co/XmFElLde1o Thank u girls https://t.co/HwA8VRDKm9 Be happy always https://t.co/Tkz7OBqox1 Glad u could come and be with Raees https://t.co/jiWj9BZsMu So glad u joined us thank u https://t.co/Ss27ruOsE5 Be crazy always https://t.co/wDYA4Eal5H So pretty https://t.co/nz1h7ObA63 Thank u https://t.co/5lhAeRh7Uy Give my love to the baby https://t.co/5lhAeRh7Uy Love u guys https://t.co/IYBRApgeGN Hope u liked it https://t.co/N1Z0XP6e05 Thanks  https://t.co/LSoSizkMym Thank U for watching https://t.co/RJjapup9nU U r sweet to do that  https://t.co/G6zIfHnHNf Thank u for watching https://t.co/NuEWO7Mptx Thank u guys https://t.co/4rkjUeGKrH How wonderful to be in Amritsar. Last time was here for RNBJ. I like being in Punjab. Thank u so much https://t.co/PQ3oShZzxm Love ur smiles  https://t.co/jczCIB15n7 Thank u for being at the movie https://t.co/YQddx0Lnvk Hope u had fun https://t.co/gi5hN3zZDd Thank u for liking Raees https://t.co/CPvYpWWjIf Love u girls  https://t.co/MbQIIX6wLb U both look lovely https://t.co/pT84EuCNxT Thanks family https://t.co/FfjW71Zs4h Thank u for watching Raees https://t.co/tVZNT2wt91 Thanks dad and son https://t.co/nQcv9hHPc8 Thank u guys https://t.co/zq45l8izPY Love u all https://t.co/DDuZSggMzD Thank u Dadu https://t.co/rreSy8JcfY Thank u as always Casablanca https://t.co/Xao6q2Mn1i Thank u baby Raees https://t.co/WZXoifvtsJ It’s sweet of u all https://t.co/U3KzIObD38 Thank u so much https://t.co/B0knRtqX3r Wow that’s cool  https://t.co/mak3Xl14kA Thank u https://t.co/iw3tvyHqFW Thank u girls. Love u right back https://t.co/eOaGD3w0QF Thank u guys https://t.co/Ih35GReSaL Thank u lil one https://t.co/UXET1W81Kc Damn u guys are already there?? Whose doing the business!!??  https://t.co/OiBAYW5FYA Very handsome thank u https://t.co/X3ewmHKava Thank u for being there https://t.co/4COYMZNPUr Lovely u both look https://t.co/2rLh5xBFWD Thank u and love u all https://t.co/LmYCW53U5s Thank u bhai logs https://t.co/nzKs8KLAmi See it again once free from college https://t.co/gaSTvJSIBY Thank u thank u https://t.co/IPvcMDLRSp Glad u enjoyed Raees https://t.co/zQVAivZUQy Awesome boys and girls https://t.co/iDIcI3s4kv Wow Bhubhaneshwar thanks for making the film such a big hit https://t.co/My3AXggOwX So pretty and no not calling u Battery https://t.co/Np06faVyE3 All looking dapper. Thank u https://t.co/iJebhfO3m5 I like. Thank u https://t.co/Buzl1wpz0Q Shukriya https://t.co/ZOukfr4YEm Thank u ladies https://t.co/V6iUSZ1Asd Thank u family.  https://t.co/kxI6O5hjBQ Looking cool u all https://t.co/b0pT4KtIlE Ha ha.  https://t.co/WATcl8pXgE Thank u  https://t.co/fqTEA1wn3U You all are beautiful thank u https://t.co/YfjZFFNz0O Really sweet thank u https://t.co/8Rst4atmoB Thank Zaalimas https://t.co/DvhORYJOlr Thank u pretty ones https://t.co/tzhQEjhoKc Thank u Nagpur https://t.co/KRDqge7IdI Thank u US  https://t.co/Nh2I4d33VU Thank u Canada for the warmth  https://t.co/49sw51GgAZ Very nice pic thank u https://t.co/NqYOdTiT5w Thanks for ur love https://t.co/8DtkHDYNp8 Bahut badhiya https://t.co/KhSVZq3jzJ Thank u https://t.co/P3ea3x1xQx So sweet the kids are https://t.co/I0zPkkLSXN Wah very cool u look  https://t.co/MH6keGaV7p I am grateful. Thank u https://t.co/r3HcyRKD8H Love to all in Africa https://t.co/z8o6AtUjXJ Thank u guys https://t.co/T47E8kTwQR Thank u for being in the Theaters  https://t.co/vCHNvgPteh Raees is such a big hit because of u all. Thank u https://t.co/eI9IJndXMT Thank u England https://t.co/lab9JcV2Fu Thank u very much https://t.co/JhZh5em7e4 Thank ladies for the t shirts https://t.co/K46XBtkY8x Very cool pic guys. Lov u https://t.co/ncGdUDJdNQ Raees lag rahe ho https://t.co/0MJjHSLIm8 Bahut khoob.  https://t.co/C5lZ39jw6X Thanks for loving me https://t.co/bFHRCgD5y4 Very elegant. Love u  https://t.co/Pv6eepSSwu Wow thank u so much. Love u https://t.co/hUvWNLuKjz Yes u r all lucky to have such lovely friends  https://t.co/YD8xjMgpul Masha Allah how good looking u all are https://t.co/uO4yxzYDlJ Always love u Malaysia https://t.co/LrPoDXiyRY You go girl. Thank u https://t.co/7UD1hVHAME Thank u 5 times https://t.co/gLh0BqieUE Khyaal toh aaya tha, phir socha abhi toh Raees party shuru hui hai!! https://t.co/Nlwe3udxhP The madness of Raees continues all over India... Thank you Pune! https://t.co/OBtPdNEnRy Thank u Pune. Symbiosis students &amp; all at the Seasons mall…and all following me on the roads. Go for Raees now! https://t.co/fwRI8Wqsvq Punewale aa Gaye chaa Gaye. Thank u for making it Raees day in Pune. Love u sooo much https://t.co/wFmPbFg4Hu It was great seeing you all... Thank you Pune! https://t.co/sx8uvg6tT0 Thank you for the love Pune... https://t.co/urZzn3apFc U caught me in my weak moment.  https://t.co/XdieoiE15W On way to Pune tried my hand at copying a sketch of the Father…Thank u Bapu for showing us the path. Jan30th https://t.co/2A0htlBpJL Thank u beautiful people https://t.co/J9TFkBUYX9 Had Too much fun. Now go and watch Raees and then I will invite u for FIFA again &amp; not meet u. Lov u https://t.co/IY3bZLkqas Thank u https://t.co/H5nowPZCsb Hav to get back to exercise soon.Congrats @prashantsixpack &amp; @mayapereira_s  launch of #Bodysculptoratkhar! @BodysculptorIN @kitchen_Lean Thank u boys https://t.co/HPWKvCes6s Congratulations to u sir. Now to the next week https://t.co/QsfBOoxwgX Thank u audience https://t.co/dxttWO04SO Thank u for taking ur family https://t.co/mOgJ8z6vXA Thanks for watching https://t.co/4NqTnjPGbK Hope the kids liked the film https://t.co/Z13U0FCx5u How lovely u all look https://t.co/MKOvGfHsz8 Thanks for ur Mamta! https://t.co/1ggntt6eh5 Thank u for watching  https://t.co/UeVKDFZK1N Thank u miss kyra https://t.co/dsyvujw90u Thank u https://t.co/b9xaR6jRBd Glad u liked it  https://t.co/lYsAP3ySbO This is sweet. Thank u https://t.co/Kecs62BSEa Thank u for ur time. Hope u enjoyed it https://t.co/8yYa2UZWwm Good u took ammi  https://t.co/GdoZAFnIGo Thank u all https://t.co/euXefAoyat Thank u guys https://t.co/y0kBaC7TLU Very sweet the lil one https://t.co/9z3Y961LyE Thank u bhais https://t.co/GPLErT3RLq U r a lovely couple https://t.co/q9apxfjUZw Thank u for liking it https://t.co/D55BBl97RO Go and see it again  https://t.co/fM0AMFXOGH You all look very cool https://t.co/kTnfY1yzMA Thank u kids for being Raees https://t.co/vAfOlk17RF Ur baby is so sweet. Thank u https://t.co/0Zn79TIaff Thanks guys  https://t.co/vtJpNqqd5v Thank u from the bottom of my heart https://t.co/V5zyZjtSnc This is awesome thank u https://t.co/yNS48iuuAA Soon https://t.co/PlLGACWnDk See it one more time https://t.co/71tuCDGX8U So beautiful  https://t.co/oCe7xFBI8L Very cool guys. Thank u https://t.co/aLC2KnFx4g The baby is smothered with love. Nice  https://t.co/AEMN9KrXmy U all are beautiful. Thanks https://t.co/ldBcH7tIw5 Thank u for being there  https://t.co/UBF6M1jkRY Really very very sweet. Thank u https://t.co/Qisx0yIL9X I want to take u in a film!! Intense man https://t.co/KiUR6lhFbx Very good looking  https://t.co/v721jaXAwq So much in love Masha Allah  https://t.co/pjtC1mVVhC Awesome. Thank u https://t.co/Ne2XhV7amh Makes me so happy to see u all together  https://t.co/rvQBlGXWEB Go Dubai thank u https://t.co/Cnds5U2S6W I like red too https://t.co/z1pe637Lwp Thank u for enjoying it https://t.co/ZUS81EaQYI Thanks for watching https://t.co/d8Hf7jvJQG U r kind https://t.co/Tyy4At7HAY Friends and family always best https://t.co/gqHLKIGApR Thank u https://t.co/xoVrvDW7ZG U all look very Raees macho https://t.co/Ao1p6VPRzC Thanks SONALI https://t.co/IcwhyyeJOl Very sweet thank u https://t.co/pxKiNMMTtZ U look very cool https://t.co/EyUWLLX9gg Don’t stop now  https://t.co/f68yIuC2eB Very colourful. Thank u https://t.co/bcKX0GvTX8 Thank u for coming https://t.co/oDajGE7KFU Thank u ammijaan https://t.co/JI8C7qDPZx Go bros  https://t.co/KHI7K4D5aJ With the family it’s better  https://t.co/9Wu3XdGPhS Thank u for the love and the business  https://t.co/l9nvTrSwHN Thank U for ur love https://t.co/uleUlEbN8q Family time is best time  https://t.co/AvRgknHbDj Thank u all https://t.co/LK1hLyoeBH Sooo pretty https://t.co/1eunwT6qM5 Go pathanis  https://t.co/HbJYu7ujOG U look beautiful  https://t.co/3xxnhsZuJ9 This is the best really https://t.co/lbrWbOV8hV U all look cool https://t.co/M1seMoTVCL Thanks for the pic https://t.co/cfvqeGVUVB Good Jodi https://t.co/2w0JgMCMNT Women all over. Thank u https://t.co/O97IJLG6If Thank u I really appreciate https://t.co/AWzu97cuPk Nice https://t.co/GumXXGR56d Thank u world https://t.co/O0240oJjYN Thank u my lovely ladies https://t.co/QH6rqsSQNp Thank u bhai log https://t.co/KsitM0My4n Thanks again Indore https://t.co/T1U82Xtjsy Thank u baby. May u always be happy  https://t.co/m75Wav57Qu Keep going please https://t.co/557bMysFnF U r all so pretty  https://t.co/QZtJHT2LPx Yes wear a dark pink shirt and carry a yellow rose. Will recognise u https://t.co/KutfHty2SQ Wow in Japan!! https://t.co/MVpQ137oNC Yay Morocco https://t.co/ZeQgsxW6eO Thanks garu https://t.co/AHCauS2JNg Will see u soon https://t.co/N3U007FBJN Thank u for watching https://t.co/QENxMQZt0d Thank u so much for ur kind words https://t.co/7gXnzC5CDU Thank u Australia https://t.co/5H3f4fhBUd Yes makes me smile like this https://t.co/NCG986FwPW Don’t let this board come down https://t.co/hriWOyherE Dad liked it I hope https://t.co/gCJ2ZlWs2c Thank u for doing this https://t.co/VvcLJtqzqy Thank u for the interview https://t.co/CKr3xLUgXN Thank u my friends https://t.co/WsS8T40o5j Thank u Gauhati https://t.co/56NfLWjLCg Thank u so much paaji  https://t.co/ceK096N86T Thank u so much https://t.co/wM1JRCWzyF Thank u https://t.co/nLpArASeDS That’s so sweet https://t.co/BYFLDqOjNf Thank u for watching the film https://t.co/xkePIXlLYa Thank u boys https://t.co/9oGibbMFnh Sunday happiness https://t.co/GGUBpTHoXw Thanks https://t.co/6ZasJGWmdM @rogerfederer u r inspirational. Thank u for the tennis. And Nadal u r a sheer pleasure to watch &amp; a great athlete. Thank u https://t.co/Zrdbm9UVpb Aap bol rahe ho toh sahi hoga https://t.co/978OcL1n6k Bajate Raho https://t.co/ngIUFKDb9I Thank u  https://t.co/91JGx9688G Good to see u all https://t.co/yXJNIq3WsE Thank u twins https://t.co/qyYJIfcvcx You guys r sweet to like me so much https://t.co/kUJ2SdvAFL Thank u bros https://t.co/z7QI0gkExk Thank u London wish I was there https://t.co/S14lqGpOUh Good of u to explain gross and nett to so many who keep quoting figures.  https://t.co/bKCvlCXNoI Thank u Jaisinghpur https://t.co/4Yae9GIARO"}