{"tweets": "Just had to emergency land at a different airport in LA because of the fires. Not sure if we can go to our house our city might be evacuated... from the plane window the fires looked close to our area. Praying everyone’s all good🙏🏻 scary stuff. RT @GraysonDolan: Did I say Monday for the video I think I meant Wednesday 😩\nAhh fuck honestly guys we want to make sure we’re 100% happy w… I’m not shaving my face until December @bloomdolxn ❤️❤️❤️:,) We are in FINAL stages of the new vid with the edit. I’m so excited to share with you guys. for some reason when filming this it felt like I was just hanging out like you guys were there. It was a pretty life changing experience too I have a whole new appreciation for home, where I grew up. I never took in the beauty of my surroundings growing up cuz they were simply just there. Sometimes you have to miss things to appreciate them to the fullest... I’m doing happy today @tangibledolan @GraysonDolan ❤️❤️❤️❤️ @Iuxegrant @GraysonDolan ❤️❤️❤️❤️ RT @GraysonDolan: AAAGGGHHHHHH Our fragrances are back! \n\nhttps://t.co/zrniNVbVgD @Mada_G_ Should I tat it Got some new I’m pretty excited about😛 I’ll fill you in fully tomorrow :)) @particularlive @GraysonDolan ❤️❤️ @Iuxegrant @suhdols @GraysonDolan WOOOAAAAHHHHH Today my mom starting pulling notes out of her purse that I wrote her when I was like 10 years old. She kept them all this time. cmon mom that’s cute as shit why’d u do that Really happy with my circle. I love everyone around me @grethanboo Holy shit this is cool Planned so much fun shit today Focused on being present @purifydolans @GraysonDolan 💜💜💜 @ambernitschke_ @GraysonDolan Sending a lot of love to you, I’m always here for you ❤️ @smashthatdolans @GraysonDolan ❤️😛❤️ Tell your loved ones you love them @tangledoIan Hahahaahahahahah Woah https://t.co/XHBD3Puytx Excited for what’s to come I was about to take a nap but I got on here now I’m reading all your tweets thanks so much for being so nice. Missed you a lot https://t.co/IfA8yPDpaA @shanedawson Love you man ❤️ @vanilladolan I am truly happy, thank you for your kind words and wishes. Love you ❤️ Missed you all😢 Thanks so much ❤️✌🏻\n\nhttps://t.co/5NJJXl0tdt 10 minutes!!!!😬😭🤯 RT @GraysonDolan: Tomorrow is going to be a really important day in me and E’s lives. I’m kinda nervous but I’m also very excited. Thank yo… The video is complete 😭🥵 @NYLADOLS @GraysonDolan ❤️❤️❤️ Damn, that was so sweet. Thank you so much for the kind words 💙 https://t.co/eczzCUcODe Ok wow, tomorrow’s the day Hope everyone’s having a nice chill Sunday! I started my day off right :) woke up to Grayson screaming “get up you lazy fuck” at me ☺️ @JeffreeStar Sending so much love ❤️ I’m so sorry Let’s do it bitch https://t.co/ysuzsleeYN Don’t know what I’d do without my friends and family wow @larrayxo No I usually just get stressed Some song lyrics just hit too hard This will be up next week. Thank you all for your patience ❤️ Filmed something very personal and important to us. A message we’ve been wanting to share with you for a while now. Thank you so much @shanedawson for having this conversation with us, you truly helped us so much ❤️ https://t.co/Xt9I0NpfRs RT @GraysonDolan: Hey... There won’t be a new video up tomorrow. Ethan and I want to take our time with this one. It’s a really important v… Good morning everyone :) gonna follow a bunch of you Wow something pretty crazy is happening today.. not sure how to feel about it right now. Looking for the right emoji to use but it doesn’t exist I’m dealing with so many things at once rn I just reapplied deodorant cuz I know I’m bouta start sweating Grayson is sick and I felt bad until he woke me up at 6am by screaming at me from across the room so I could help him make an ice bath he could sit in to break his fever, ok I still feel bad but if you ever had a Grayson yelling at u at 6am you’d understand New vid!! this was ridiculous \n\nhttps://t.co/MPoetXeIdx Happy Tuesday :,) Reading this made me very happy. I’m glad I was able to help you❤️ you mean a lot to me too❤️ https://t.co/Hu45VZXL2b Every time I cry I take at least 3 selfies just so when I feel like I’m not a human because I’m incapable of feeling emotion I can look at the crying selfies and remind myself that somewhere deep down... I have feelings and I’m not a robot Filming something pretty heavy today... first time being nervous to film in a while not gonna lie If you’re going through a tough time, try not to dread the future, Instead, look forward to it. It may hold something great for you that you may not have been able to even imagine. I knowwwwwww it may sound cheesy but it’s really true A lot of crazy things have been going on in my life recently, some not so great. I’m a big believer in the fact that everything happens for a reason, I just didn’t know what reason these shitty things kept happening for. Today the reason presented itself loud &amp; clear. Life’s good I’m such a trypophobe if I put my iPhone 11 down on any surface it has to be screen up I CAN’T look at the back @GraysonsTables @EliDukart @GraysonDolan 🧡🖤🧡🖤 @MIDNIGHT_GRANT @innocentgrayson @GraysonDolan ME TOO AHHHHH NEW MERCH OUT NOW! \n\nHappy spooky szn 👻💀🎃\n\nhttps://t.co/s9VMq8LGDw Just 2 bros being baddies ☺️🤭 https://t.co/sczQRfH8i8 Feelin the love, love you guys ❤️ @JeffreeStar See u there bro My role model, my hero, my big bro. https://t.co/ZvdqNKyXcU Fall candles fuck me uuuuppppp Hooooooolllllyyyyy shit, filming this was insane... \n\nNew vid with @JeffreeStar \n\nhttps://t.co/J61UPdNReG this Tuesday is gonna be a crazy day...😳 Why am I obsessed with candy corn this year I don’t remember liking it last year? Film photo https://t.co/u75sDBURpO Do what you gotta do to be content with yourself when you go to sleep at night. You know when you’ve made the right decisions and you’ll be proud of yourself for doing so. You can’t control what the people around you are doing so just take good care of yourself ❤️ I ALMOST just accidentally ate DAIRY wow full moon Friday the 13th is no joke be careful everyone @LARRAYXO Hard reset it Life keeps throwing bullshit at me like YOU THINK I GOT TIME FOR THIS SHIT? I feel like ass brb putting myself in rice UUUUUGGGGHHHHH I hate being sick this sucks I’m so bored @njhftdolans @GraysonDolan ❤️❤️❤️❤️ New vid! The special guests are cooler than us 😔\n\nhttps://t.co/jGu6Il4jUP Which is today and goes up in 30 mins So excited for you to see this Tuesday’s vid 😭 I need to learn how to 🧘🏻‍♂️relax🧘🏻‍♂️ @globalgrantt @JeffreeStar Yes. @JeffreeStar Yes that or holy fuck Holy shit, I’m taking a bath rn. I needed to. That’s how insane today was Bye bank account💸😳 https://t.co/9q37xZvRpz Bye comfort zones!✌🏻😳 https://t.co/4UzqnkI6XB When you text me that you have a great idea then follow it up by saying it’s to build a new coffee table for the foyer https://t.co/AEgg3sylYv Last night Grayson begged me to watch a movie with him and he passed out 10 minutes into the movie. I stayed awake and watched the whole thing. Today he JUST ASKED ME TO WATCH IT AGAIN WITH HIM WHAT @gamerdolann @RyanAbe @BryantEslava @emmachamberlain @GraysonDolan Wow, definitely did make me smile:) thank you for taking time to make this love you❤️ I hate taking naps but I also always want to sleep all the time...??? @PURGINGANGEL @EthansPig @GraysonDolan GRAYSON I giggle like a little bitch This weeks vid is up! \n\n👨🏻‍🔬👨🏻‍🔬💄\n\n https://t.co/hZI6HCW0ms Good morning :) I hate missing Tuesdays I feel like I’m letting everyone down:/ we’re having difficulties that are out of our control...  we’re going to have to upload tomorrow Shit guys I’m sorry we’re experiencing some complications with the upload 😔 doing everything we can to get it up I woke up to the funniest fuckin text from Grayson I was crying laughing for like 10 mins straight and I haven’t even gotten out of bed yet @LARRAYXO U shred bro I thought we were the garlic twins 😔✌🏻 https://t.co/FJ27JnXwSR You ever listen to a song in the car that puts u in ur FEELS and u start to get emotional but have to play it cool because there are other people in the car and you don’t wanna seem like no little bitch😤 When ur in bed all cozy and comfortable and you realize you FORGOT TO DO YOUR FUCKIN SKIN CARE ROUTINE I like when I like my outfit RT @GraysonDolan: An aesthetic, peaceful beach day ☺️💕🍃🌸 https://t.co/rtNMEkkiCI @Mada_G_ WooooooooW I just got ATTACKED by a GIANT spider it was in my car and I dead ass pulled over, got out and we took it outside like real men😤 it was on my lap I freaked @SICKOGRAY @GraysonDolan Made them make it without dairy peep the wrapper it was special order🤩🤩 I’m all about good vibes lately get the bad vibes OUT Spilled coffee on my white shorts I look soo cool now !!😊 New merch drop!!!! Honestly my fav shirt yet \n\nhttps://t.co/dcLreWzeV5 I’m in this Uber and the seat belt is SQUEEZING me and I have to PISS Says no curse words: 🤓\nSays curse words: 😎 When I found out I was built like a roblox😌 https://t.co/UzqQjdeUad I’ve been replaced 😔\n\nhttps://t.co/3979n2Zlva GOOD MORNING HAPPY TUESDAY A LOT GOIN ON TODAY IM EXCITED LETS GO “I’m stupid” ☺️😌😌roasted😌😌😌 https://t.co/Nnab1juG9p Just ate so much can’t move. I guess Graysons cooking was...... 😳good😳 I feel like it hasn’t been Tuesday in forever And water https://t.co/gPP6UXU2v9 @bombethan Happy tears Grayson just told me he wants to watch a movie and cry tonight..... I’m kinda down @trapsoulethan The jeans tho😖 @mawnikuh Ok I did @attacheddolans I am currently doing just that right now Wearing a hat today cuz I’m too lazy to make my hair not look like shit Can’t believe I’m saying this but I think I’m ready for hoodie season.. summers just getting a little sweaty 😖 Reading your appreciation tweets and damn... wow. I’m really grateful for you all. I appreciate you more than you know ❤️ Love when my sister visits 😊 Good morning! Today’s gonna be a good day I can feel it:) already called my mom to tell her to have a good day and she ended it after 2 rings 😊 Who the fuck let my hair get that long 2 and a half years ago... Gray and I just accidentally burped at the same time. Literally out of nowhere. We just looked and stared at each other in silence immediately afterwards... then let out a synchronized giggle My mom calls me at least 3 times a day and just puts the phone on speaker, gets sidetracked and walks away from the phone. Gotta stop doin that Lisa Wtf was WRONG with me\n\nhttps://t.co/tqm1oPsG9o Hahahaha sugar!! I don’t think he knew what a Tuesday selfie was he was mad confused https://t.co/X9xqCw38D0 Morning happy Tuesday Grayson is putting up Halloween decorations.. IT’S FUCKING AUGUST Graysons just threw his back out while working out and now he’s crawling around the house grunting he’s so dramatic. Gonna go help him cuz I’m a good bro @SykoDolans Asmr 👀 @CravinggCleo I DID THAT LIKE 30 MINUTES AGO. It’s feels so good until you accidentally throw up in your mouth a little 😔✌🏻 @fossildolan Ace that shit @pIayboyethan I’m doing pretty goooood😊 my nose still hurts cuz they had to break it to fix it, but I’ll be able to breathe better than ever soon:) thanks for asking How you all doing?😊 Been trying to just say fuck it and stress less lately ❤️ love ya https://t.co/jY5c9zFUM4 Been spending a lot of time with my family :) I remember nothing \n\nhttps://t.co/jSltojml7v Happy Tuesday:) gray and I made breakfast for my whole fam this morning I feel accomplished Watched the vid \n\nwut the fuck Finally feeling better today! I think we’re going to watch the post surgery footage😳 I remember nothing.. I literally could’ve said ANYTHING No https://t.co/hEwElY1Pcj Hey, been recovering the past couple days just laying in bed waking up to eat pancakes. I know u didn’t ask but yeah Annnnnnd I don’t remember shit from after surgery.... teleported from the surgery center to my bed. What the fuck happened This weeks vid is up! It was just so delightful to film 😊😳😑\n\nhttps://t.co/PtDMnBFOpM I’m scared of how we’re gonna act TOGETHER https://t.co/MZfZyIqw8X We’re all gonna have to deal with all sorts of things our whole lives. We’re going to feel a bunch of feelings we might not want to feel. Face the feelings head on and most importantly, tell yourself nothing but the TRUTH. Progression starts with the truth Finally getting out of a mental rut... sometimes it takes a while to recognize what your problem is and admit that you’re lying to yourself about something. I’m totally fine, just happy that I’m learning everyday, even if it’s from my mistakes 🙌🏻❤️ @innocentgrayson Love ya @twaimz @GraysonDolan Yay:) glad u like I laugh at the most stupid shit Needa do somethin spontaneous today I’m tired of being bored I went to a store today right after Grayson did and the guy at the register said “you look like a guy who was just here, just not as buff” \n\n................ 😖 @RickyPDillon @GraysonDolan HAHAHAHAHAHA Yea fuck ever being separated ever again https://t.co/VehjDfE8N1 Got him 😊\n\nhttps://t.co/BH317WfmEz Happy birthday sis ❤️ Some fuck shit happened to me today.... Sounds a little cheesy but I’ve really been focusing on becoming the BEST version of myself lately and it feels great. Trying to get to a level I’ve never been at before Just sold out of both fragrances again 😭 hope u love them I think I need to go on a spontaneous road trip @RosannaPansino @GraysonDolan Thank you!!!! :) Yo that table/dresser looks so nice wuuutttt you killed it https://t.co/a7x4ck5dkT The restock is now live!!!!!!!! There is a limited quantity😬 I’m excited to for you to have your fragrance :)\n https://t.co/EExygdVIng @innocentgrayson @GraysonDolan Hooooolllllyyyy this is insane ❤️✌🏻 https://t.co/mGSaJsqVss good one gray... 😔\n\n https://t.co/ZkEoE36nB2 Happy Tuesday, have a great day today. Start it off by doing something for yourself ❤️ Gray got me but I already got him back it’s okay 😊☺️☺️ Hate to say this again but don’t come to our house or the cops will be called. No ones home should be invaded. Happy birthday mom ❤️❤️❤️ Feeling extra thankful for my real friends today, of course including you all Yooooo my man! Thanks for changin my life with your music 🙌🏻 https://t.co/MlGDT8R0nI This face app stuff is getting old.... 😳🤭😂😭 NEW VID! Idk how he convinced me to do this \n\nhttps://t.co/mujXSO6WO3 YAY this made me so happy https://t.co/lb9ysb2nxE Mom where are u I need a haircut Good morning :     ) @grethanboo @GraysonDolan ❤️❤️❤️❤️❤️ Guys both fragrances sold out 😭😭 feels so unreal. I’m so happy that so many of you now have them to enjoy😭❤️ @emmachamberlain I’ll tell u where* it is. My house. Now. @njhftdolans 😭😭❤️ I hope you love them! Plz take a vid of your first spray when it arrives. I can’t wait to see:) The fragrances are live! When creating these we made sure they were nothing short of what we believe you will love. They are truly so personal to us. I can’t believe they’re finally here &amp; I’m so happy we can now share them with you.❤️get your bottles here\nhttps://t.co/EExygdVIng GUYS WE GOT 1 HOUR UNTIL OUR FRAGRANCES ARE AVAILABLE FOR YOU GUYS 😭😭😭 Damn. So happy I could cry bottle reveal on wakeheart Instagram and website in 1 hour!!!!!!!!!! RT @wwd: Wakeheart's first influencer collaboration is with @GraysonDolan and @EthanDolan. https://t.co/5yWRdAQQfP @EliDukart @GraysonDolan Whaaaaaaat this is insannneeee!!🤯 I’m too excited to sleep I haven’t felt this way in a while It smells like everything that I love in this world https://t.co/YrK4srA9JD RT @GraysonDolan: I MADE A SIGNATURE FRAGRANCE FOR ALL OF YOU! ETHAN DID TOO! We’ve been working on these for a year now with an amazing co… @trapsoulbailey @GraysonDolan Bottle reveal is tomorrow on the wakeheart instagram ;) @Dolanfam18 @GraysonDolan Yes we did:) they’re very different from one another. They’re each everything that we personally love in a fragrance @chambiescycle @GraysonDolan Yes!:) @stupidfanboy_ @GraysonDolan Yes it is:) LET THE COUNTDOWN BEGIN😭🙌🏻\nhttps://t.co/56Z4DfdI58 Over the past year gray and I have been working on creating fragrances to share with you all.. and they’re finally here!😭 we partnered with wakeheart to create our signature scents for you to wear. We are beyond excited for you to enjoy them❤️ Holy shit woke up feeling FUCKING AMAZING 😭 One of our most special announcements yet coming for you guys tomorrow😊 It’s up! This was a nice bonding experience... \n\nhttps://t.co/P1irdCNdX5 We made it out gray 😭🙌🏻 https://t.co/9hxUzz1hdN Grayson forced me to build with him all day... I’m pooped as fuck @GraysonDolan Maybe like next week idk😳 Bro if we walk into a smashed tv on the floor right when I’m about to watch stranger things https://t.co/rrxuIZhVTB Happy 4th!! Grayson is barbecuing today... I’ll let you know how that goes Woooaaah I just thought I was fainting or something cuz I felt really wobbly and then everyone around me was like whoa earthquake and then I wasn’t fainting and it was just an earthquake I’m gonna tell you this now because I know I’ll be able to tell you very soon... something gray and I have been working on for a long time is coming soon 😭🙌🏻 ITS UP! we got ... delirious\n\nhttps://t.co/CM4OLdR7tu MANIFEST POSITIVE SHIT I love you Going shopping with my mom pray for me HAPPY BIRTHDAY https://t.co/gHcBg5MMUe Just ordered dairy free pizza 🤩 Getting a pedicure finally Oh wow, thank you:) https://t.co/aY40kFO2GV @BryantEslava Oooooh shit imma need one 😳😬😁 I’ve been drinking a lot of water lately and pissing so much it feels tremendous Grayson tried to make me a soft boiled egg for breakfast this morning and every time he opens the egg it’s just mush and spills all over the plate.. he’s being trying to get the perfect soft boiled egg for about an hour now and still hasn’t succeeded. I’ll keep u posted @RyanAbe happy birthday to one of my best friends and most supportive people in my life. Have an amazing day, great things happening for you this year man Shit u not I’m in public rn and this random woman was talking to her other woman friend about her diet and she said she is dairy free and I said “hell yea!” And then realized I wasn’t supposed to be eavesdropping and she looked at me all confused.. I was just excited for her :/ ITS UP!! 👕👔👖👟🎩😳\n\nhttps://t.co/KrW0hXGTmy Damn.. I need a pedicure @DARKSIDEGRANT I really need to Back home!:) I feel reset, wow traveling is so important Just got hit with the best vibes ever and shedded a tear I’m so jet lagged and I’m trying to sleep and Grayson keeps banging on my door and ringing the fuck out of my hotel room door bell and waking me up can someone plz entertain him @GraysonDolan Big fuckin facts Not like glam glam but ya know what I mean \n\nMe = ready for fashion Just got glammed tf up HOLY FUCK JUST HAD THE BEST BREAKFAST OF ALL TIME MY MIND IS BLOWN I LOVE FRANCE See you soon Paris :) This weeks video is live 🤭😮\n\nThis was nervous for me 😳😖\n\nhttps://t.co/zwu4tAqcAc Happy Tuesday ::::))))) I thought there was a ghost in my bathroom because I kept hearing noises coming from in there but it was just the robot vacuum😭🙌🏻 Happy Father’s day Dad. You remind me of my purpose every day. Not a moment goes by that I’m not thinking of you. I’m living to make you proud. Out of the blue Grayson just goes, “I just figured out how to build a table in my head” Jus pierced my sisters ear, she is satisfied. I did a remarkable job her lobe looks tremendous Piercing my sister’s ear brb @RyanAbe Hey bro I’m gonna need that fuckin case The sun makes me happy @RyanAbe Lemme get that case tho👀 My mom just tried to show me a video on her phone and she put her left AirPod in my right ear Sunsets stress me out cuz I know they’re gonna go away so I’m just stressing about trying to enjoy it to the fullest while it’s there @chambiesmain Me too! It was quite relaxing I’ve been going on walks lately.. Take some time to be by yourself. Listen to music, paint, dance, cook, KNIT! Anything that makes YOU happy. Make yourself happy you deserve it :) NEW VIDEOoOoOoO\n\n@noah_schnapp taught us to act and helped us get ready for our audition😳\n\nhttps://t.co/JY8Em4tdvz Out Of Our Comfort Zones finally continues again today 😬 I really believe in myself rn. This is a great feeling I made breakfast for my whole family this morning. They were shook actually Thank you all so much 😭 I’m having a really great day and I couldn’t be more grateful to have every single one of you in my life. You all inspire me to chase my dreams. I can’t express in a tweet how much I appreciate you all. Fuck. Thank you &amp; I love you! surrounded yourself with people who inspire you Oh shit hi Dolan ft Emma coffee, cheerlead, coffee, soul cycle \n\nhttps://t.co/qm5BLC3e8h @emmachamberlain Yeah I’ll put u in rn it’ll be up at 1pm pst Hey @emmachamberlain wanna be in today’s vid? This project was something we had always wanted to create, bringing it to life with all the great people involved was amazing:,) https://t.co/ZWjEO55TWj I slipped in the shower, literally feet to ass. I was laughing so hard by myself... mainly because I was listening to very upbeat electronic music and I was definitely dancing.... anddd that’s why I fell Stayed inside with pimple cream on my face all day I just built a dresser and not gonna lie I’m pretty proud of myself ... 😌 Happy pride month to my lgbtq+ homies :) 🏳️‍🌈 Just listened to a voice memo Grayson sent to a group chat I’m in and I thought it was me and I was like I don’t remember saying that? Then I realized it was him wow that was fuckin weeeeeeird I ate the hottest hot sauce yesterday and I’m really feeling the repercussions today Just made myself breakfast wow I had no clue I was secretly a chef Why did we do this 😑😳 \n\nhttps://t.co/dc19y4T8Rs 🤩HAPPY TUESDAY🤩 Wow feeling fuckin great today. It’s a beautiful day. Gonna make Grayson barbecue me something We finallllyyyyy started filming another Out Of Our Comfort Zones 😬 I’m never honest with myself when I’m feeling like ass. when I finally admit it and tell myself I don’t always have to be on, I start to feel better. Inner peace starts with the truth The weather affects my mood way more than I thought it did h.a.g.b Happy birthday emmo 😁🥳🤩@emmachamberlain Plz tell me what was wrong with me..\n\nhttps://t.co/StzB1W9xBK Very happy Tuesday to u Feels good to be back home with family :) I’m sorry u had to listen to Grayson screaming for 90 hours straight. Also u prob know I’m dairy free now so that’s dope! https://t.co/BjiTnrtAcI Just woke up from a LONG nap it’s 9pm I’m ffucked Back in jersey I’m gonna go chill in the woods I miss nature I need to go somewhere cool ha got em \n\nhttps://t.co/AiqhPkpulF I got gray gud in this vid😁 Tuesday selfie is trending number 1 rn and it’s lowkey Monday but I’m not even mad Really though my mom is the strongest person I know and I love her so much @RyanAbe Always been a turtle guy Happy Mother’s Day mom. Thanks for putting up with us. We really were a lot to deal with as you can tell by this photo where my mom is holding Grayson and preventing me from crawling away with her foot https://t.co/gfwqGcbp31 Goooooood morning 😊 Is it just my mom or do all moms over use bitmojis? I’ll be like “hey mom” and she’ll send me 7 bitmojis of her that all say “hello” in a different way New video up! What would happen if we got lost and couldn’t find each other ...? \n\nhttps://t.co/som3JDXsC2 LIMITED edition purple hoodies just dropped!🥳 they’re only available for a short amount of time then they’re going away forever😳😨 \n\n https://t.co/57NX8ZnjB2 Just got so much work and stuff done while Grayson napped. Then he woke up and started yelling at me calling me lazy I’m so confused Oh btw we have limited edition merch dropping tomorrow for a verrrryy short amount of time 😳👀 Grayson is the worst person to have in ur car as a passenger. If there is an unavoidable crevice in the road and it causes a little bump he freaks out on me and acts like I was the one who made the crevice in the road Feeling mad productive lately and it feels sooooo good RT @GraysonDolan: When we hit 10 Mil, Ethan and I would like to invite fellow YouTubers to join us in a 10M sub Dolan Twins Roast. Who do y… I’m laying in bed and I’m really excited for breakfast Gray dragged me along for this \n\nhttps://t.co/DMaBHJJAqR I’ve been doing this thing where I haven’t been sleeping I just fuuuuucked Grayson up with a lil prank :))))) Gray and I just tried to play a song together on the drums and piano and we kept pausing to scream at each other for messing up every 5 seconds We’re telepathic Gray and I just got a lot closer #NewProfilePic https://t.co/44VNV57Jvm Yo Grayson just threatened to tweet that I ate dairy (which is OBVIOUSLY a lie but he was going to convince you all that I did) because we were arguing. I was forced to forfeit the argument at that moment. I can’t have him destroy my image like that. I’m back. Was just in the middle of nowhere with no phone The new video is up! Here is us finding a pet \n\nhttps://t.co/2q9PswfhIW Ok guys had to delete the vid cuz it was all fucked up idk what happened but it’ll be back up soon 🙏🏻 Video up in an hour.. we search for a new pet 😳😬😍 Happy Easter!!!!!! 💛 My grandma called me today and told me to stop stressing about stuff and now I feel better tbh hahahaha Slowly coming back to life (I think) @ALLTIMEDOLAN Microwave 😞 Gray and I are going back and forth taking care of each other haha. When I’m awake I make him soup when he’s awake he makes me soup. Idk what being sick would be like without a twin but props to anyone who is/has been Ugh im sick NEW VID! U ever wonder what life would be like if you were 2 yrs old\n\nhttps://t.co/cr507yZI2V Happy tuuuuueeesssday I don’t fuck with that dairy Wow Coachella was fuckin nuts Today is the day I wear thay shirt I said I was really excited to wear I don’t think Grayson understands that he’s supposed to start dancing when we GET to the festival. He woke me up this morning blasting music telling me to get up and dance @BryantEslava HAHAHAHAHAHAHHA OH FUCK Coachella eve!!! I’m TOO excited 😭 Happy siblings day :) https://t.co/8m9MAoVvPt I told Grayson I wanted to sleep in today and he woke me up at least 14 different times this morning and each time asked me to do a different activity with him I got this one shirt that I’m wearing to Coachella that I’m really excited to wear lmao idk why it’s just a shirt but it’s a fun shirt to wear NEW VID!!! first time gray and I ever shopped for one another... uhhh umm😳\n\nhttps://t.co/8NYbOtBQqA How’s your Tuesday going?? Mines going great 😝 Grayson is taking a nap I’m so bored. I decided to walk into the middle of the woods and there’s nothing to do here so I’m just on Twitter Meeting some pets as I type this tweet 😳 Should gray and I look to get a pet? Just flew across the country to surprise our sister... it was a success!! Life is fuckin nuts. U ever just like WHAT is going on I found this selfie in my camera roll of myself and I look exactly like Grayson so I was freaking out and sent it to my mom and I forgot it was the middle of the night so I guess she was really tired and accidentally called Grayson raisin https://t.co/r6cnuT8Ami My grandma said my building skills are impressive I’m actually really proud of myself for this one \n\nhttps://t.co/0CPKIcQICU Happy Tuesday eve Hangry is so real I’m not letting Grayson speak a word to me until I eat I just grabbed my shoe out of my closet to put it on my foot and a piece of unchewed gum fell out of it... how did it get there? And do I chew it?? I’m trying to be in a different country I wanna go somewhere Gray and I both have poison oak but we have no clue where we got it Life’s beautiful Here is our mom humiliating us \n\nhttps://t.co/lnRLQ4rPLc \n\nEnjoy 😭 Happy Tuesday!! Doing some fun stuff today I just realized I didn’t eat one thing today wtf how did I not realize I’m mind blown 😳 I...... surprised myself. Didn’t know I had that in me @wxkandaforever 🤔😎 Grayson and I are giving each other room make overs. We have to build everything with our hands, no help, all alone. Idk why he agreed to this New tame impala about to make my year The less I say about Graysons mustache the less of a big deal he thinks it is = the greater the chance of him shaving it \nMe = 🤐 The mind is too powerful We get each other into some trouble... \n\n https://t.co/edS8yUnwR6 Video in 30 mins... before we filmed this one I knew I’d regret it... and I definitely regretted it. You’ll see what I mean🙄 Don’t trip about things you can’t control Kinda jealous of Graysons green toenail polish today I sneezed over 120 times today my allergies have never been this bad I just bought the coolest furniture I’m freaking out I don’t care that I feel like a dad cuz I’m freaking out over furniture it’s too good you have to see this OMG my ACTUAL landlord just texted me- \n\n“Let’s get him back...” \n\nHad no clue he watched our vids😂😭 Wow I’ve NEVER been this red. I need to stay out of the sun for a loonngggg time Just fell asleep in the sun for like 2 hours I’m fried New vid! ...... gray got me.... cool...... \n\n https://t.co/lhlyIrKeSc Happy Tuesday :))) Woke up feeling so alive My mom showed me so much good music I’m gonna be dancing for the next week My mom is embarrassing us so bad for this vid 😭 why did we agree to do this MY MOM CAME TO VISIT. I’m actually so excited. Should we force her to be in a video hahahaha I woke up to Grayson screaming “WOOOOO” I asked him what happened and he said he sawed a perfect cut in this piece of wood for his next piece of furniture he’s making Relax and please be careful with my car https://t.co/L9os7oxC4z Today is one of those days My grandmas are the best they really got my back The nose is the worst place to get a pimple by far. And guess what I’m forming on my nose rn 😃 Alright so I didn’t shave my head... but I was tempted to My sister just sent me this-\n\n“Why is there porn on ur story?? \n\nJust kidding, in case your heart dropped! 😜 send this to 10 friends to scare them”\n\nAnd I had a heart attack We talked about things that I didn’t even know about myself yet.... 😳\n\nhttps://t.co/zclCPC1SSE We get pretty real In our vid today I’m shaving my head tonight not even kidding Why am I like attracted to furniture does that mean I’m getting old? Wow Grayson is really impressing me with his building skills not gonna lie Grayson just left to go to a junkyard. He told me once he returns he’s going to hand craft a coffee table from scratch using retro speakers in our living room before my eyes. I’d like to see it happen 😖 https://t.co/R3Rw9qNpQC Gray just got me 😑 Wow I feel really good Just visited the @PSYCHICTWINS and wow. I’m mind blown. RT @tangledoIan: ethan’s stomach when he eats dairy https://t.co/I5PMgKhgM9 RT @GlamandGore: Can’t tell if I’m seeing double because of my concussion oooorrrrrr..... https://t.co/w7y7xtnq8t @EthanDolan  @GraysonDolan This weeks vid is up!! We found out what people ACTUALLY think of us.. \n\nhttps://t.co/BxpOVETK1R Video in 20 mins! I actually like this one A LOT hahaha I laughed watching it back LMAO wut https://t.co/oL0GhdhA1a I think gray and I might need a pet 😯 Happy I got to see my mom today wow I love this https://t.co/Yskf7BaL68 Love you all. Equally Just tryna live life as hard as I can as cringey as that sounds lmao Haven’t slept in the past 30 hrs I feel crazy @shanedawson @YouTube @YTCreators That’s so wack wow Just got a back tat SEE! What the fuck!!!! I actually meant to write completely** https://t.co/qJXLZs67Bk Sometimes I competent forget how to write. And spell. And talk. Grayson tries to dress like me. \n\nlike if you agree Grayson used to be the stylish twin but it’s me now woops I was walking down the street alone so I called gray and we started making jokes and I was dying laughing walking down the sidewalk alone and people were looking like wtf Good morning :) today is already amazing, only thing is I had a dream that I got a parking ticket last night but I’m not 100% sure if it was a dream or if I actually got a ticket and just lost it and now I’m gonna have a warrant out for my arrest cuz lost it so I can’t pay it @YTCreators @JeffreeStar ❤️❤️ Such a good day today 😊 RT @JeffreeStar: 🎨 NEW VIDEO ALERT!!!!🔥 Body Painting Clothes on @GraysonDolan &amp; @EthanDolan!! 😱 Watch: https://t.co/vqPgaJe3Kh THE VIDEO IS LIVE!!! ft. @JeffreeStar  🤭\n\n https://t.co/Hisl5nZUk8 THE VID IS PREMIERING Ok we’re gonna have to push the upload back just an hour.. so the premier will start at 1:30 and the vid will go live at 2 PST!!! YO TOMORROW’S TUESDAY AND WE’RE BACK My pink toenails match my outfit rn Im pumped. painting my toenails pink was the best thing I’ve done all 2019 I’m staying home and practicing my dance moves tonight. That’s my Saturday night I just spelled a big word correctly without autocorrect and accidentally said “fuck yea” out loud @JeffreeStar Excited for Tuesday 😎 Good morning !! Everyone always thinks I need sleep but I just got permanent bags @dreamsethan I know!!!! That’s what I’m saying Everyday Grayson and I have a battle to see who gets to pick the temperature in the house. Grayson likes it on 90 I like it at 70. Why can’t he just be normal and agree to 70 degrees I’m not trying to be drenched in sweat just chillin on the couch RT @JeffreeStar: Oh hey there 💅🏻 @GraysonDolan @EthanDolan https://t.co/8fCZMjIrH9 Filming something crazy today 😳 Thanks for being so supportive and allowing us to take our time. We’ll be back with a vid next Tuesday ❤️ Happy Tuesday! No video today but we’ll be back soon enough. Love you guys Oh shit annual naked snow run time Hi hope you’re doin good Thank you ❤️ If you are a fan of Grayson and I we love you and appreciate you so much. The best way you could support us during this tough time is to NOT show up at our father’s wake or funeral. thank you guys and please please please respect my wish. @RyanAbe Love you so much man. Such powerful words. I’m speechless. My dad loved you man. Love you like a brother Life feels like a nightmare. Taking some time off to be with our family. I love you so much Dad. I’ll see you guys soon I know I’ve been inactive for a little while now.. just spending time with my family. Thank you for caring and your kind words love u guys Wow 100 MILLION VIEWS on our YouTube channel this month!!?!?! Thank you guys ❤️ I did gray dirty as you can tell by the thumbnail 😳\n\n https://t.co/mF1SAFoVsu I got gray the best I’ve ever got him in today’s vid Oh damn tomorrow is Tuesday 😯 Everything will figure itself out Hi NEW VID IS UP! Grayson did as I said. 😎 \n\nhttps://t.co/UCWqkzE7qe What? She’s always putting chapstick on everyone knows that?!? Happy Tuesday 😯 Her lips deffffinitely aren’t crusty https://t.co/yEECaTyfLz Ooh una hermana que peude usar el traductor de google https://t.co/KdAbkEsow8 I think I want to become bilingual in 2019 Cyber bullying isn’t creative. People really selling their souls for views 🥺 Today was a good day 😎 RT @BryantEslava: go become a channel member for @ethandolan &amp; @graysondolan on youtube\n\nthey’ll be posting the funny/outtake pictures from… RT @forever_dolans1: @EthanDolan @GraysonDolan \nI just want to say:\n1. Look who joined the club\n2. This video was so amazing \n3. Look how c… Yay😊 I hope you like the vids:) https://t.co/GFdCiNBGm2 OK CHANNEL MEMBERS IS LIVE!! here is the sign up link:) \n\nhttps://t.co/jJ2uICXVZd Figuring out channel members 😂 there will be a video up on there today Finalizing channel members page right now! We’ll let you know as soon as it’s live! I wish stores were open 24/7 and you could go shopping at like midnight that would be great RT @GraysonDolan: Channel members is going live tomorrow at 1 PM PST - 4 PM EST 😊😊 BLOOPERS 2018 ARE LIVE !!!\n\nhttps://t.co/y2nd4z9mTB First day of the new year is tuesday! Let’s start this year off right Happy new year!! Thanks for making 2018 the best year of my life :) Why can’t I sleep Getting this 2018 blooper reel together rn.... good memories @christina_b56 @GraysonDolan Looks so good @hookedethan @GraysonDolan Signed with luv 💜 I’m seeing that so many people got our merch for Christmas.. that’s so cool😭 really feels crazy. I hope you all love it. You look great in it @jamescharles I won already and it didn’t even happen yet It’s 2pm and I still don’t wanna get out of bed We got each other our dream gifts for Christmas :,,,,) @GraysonDolan @jamescharles @emmachamberlain \n\nhttps://t.co/QGSllLJsav At first I just thought james’ system malfunctioned but then he got embarrassed for the first time ever and in that moment I realized he might actually be a human being https://t.co/PQmxGtriqb RT @emmachamberlain: sitting on santas dreamy lap😎\n\nhttps://t.co/YqwokvbWQX\n\n@EthanDolan @GraysonDolan @jamescharles RT @jamescharles: RT to be the next video's sister shoutout!!\n\nSISTER SQUAD BUILDS A GINGERBREAD DREAM HOUSE!! MERRY CHRISTMAS EVERYONE! ❤️… Ok James’ vid comes out at 12PST Emma’s at 12:30PST and ours at 1PST. ITS A CHRISTMAS SPECIAL MERRY CHRISTMAS!🎁🎄 I hope you gave a gift that made you happy to give ❤️💚 Brought* It was thought to my attention that there is a rumor that there is a Christmas party tonight at my LA house. It’s completely false, obviously. If you heard about it do not show up police will be there. I hate having to say this all the time but please never go to any of my houses Christmas Eve 2000 https://t.co/TVnd9wAYYE @dolanflicker @GraysonDolan Omg you look great in that We have a FULL ASS CHRISTMAS SPECIAL COMING TOMORROW ON OUR YOUTUBE CHANNEL I’m anxious to give everyone their gifts I got them 😳 It’s up! Grab a snack and come hang\n\n https://t.co/wtPIc1DjV8 New video tomorrow 😎 I’m having the most unlucky day of all time I’m becoming a pro babysitter This was my fav video to film ever \n\nhttps://t.co/LZZCA1ogOj Wait tomorrow’s video is one of my favs of all time :,) I had THE MOST fun filming it. You guys are really special to us so we wanted to do something for you 💙 Grayson found his blankets from when he was 3 years old and he’s be carrying them around everywhere and sleeping with them. They’re also torn to shreds because he used to chew them like a dog back in the day @YTCreators @GraysonDolan Thank you💙 @RickyPDillon @GraysonDolan Thank u Rick 💙💙💙💙 Holy shit thank you guys so much 😭💙💙💙 https://t.co/CQwx3AEfVM Thanks bro https://t.co/1uUdZDWN83 Fuck I’m getting old @grantsvertigo @GraysonDolan Thank you 😭😭😭💙💙 @grethanboo @GraysonDolan This is amazing 🤧🤧🤧🤧.........................................................................................😭 Happy birthday @GraysonDolan keep it 💯 this year bro ur 1️⃣9️⃣ and that’s lit 🅱️ro Thank you💙 you’ve always been my fav daughter... ok these tweets are both scary https://t.co/ZaQLuJHZGD @RyanAbe @GraysonDolan Thanks bro💙💙 I def aged better than gray @BryantEslava Bro we’re bouta both be 19 at the same time Last day of being 18 tf?! New video up right now... gray got me. About to watch it for the first time 🙄\n\nhttps://t.co/avaJ3bkY2e I’m going hard with gifts this year Grayson make prank on me 😭 video goes up today😳 The nurse screeched 😭 https://t.co/BsidO3SBHi Respect https://t.co/ZD9LOyArMF I have the best friends I really do New video ft. Ace Family is UP!!\n\nhttps://t.co/uzHu0I0w9B Happy birthday dad RT @emmachamberlain: ok can u just love me already im so fed up @EthanDolan @GraysonDolan Just wrapped one of my favorite vids of all time The holiday season is so great I see so many people doing amazing things for others, it warms my heart @CatherinePaiz @grethanboobs 😭😭😭 I just hit my head really hard on a cabinet and Grayson asked me if I could do it again so he could film it... @mutualdolan 🤔🤔🤔🤔🤔🤔 ......\n\nYes😳 Babysitting tonight 😮 We went undercover 🕵🏼‍♂️😮😳\n\nhttps://t.co/ChPVfgud7g Wasn’t just dms 😮 https://t.co/4Z8HY9pHtQ Ohh btw we went undercover for this video and none of you even knew 😛 Lots of bonus videos this month 😮 @jamescharles https://t.co/iJzcHlYd8M I almost bit my tongue OFF today this is bad I’m talking like a dumb man Do u ever catch a random ass vibe that comes out of nowhere and is really nostalgic and brings you back to a really good time but only lasts 4 seconds and you start trying to get it back but it’s long gone Pizza again for the 4th night in a row NOT KIDDING @jamescharles @MorpheBrushes Holy fucking genius caption 🤯 Annual mustache photo https://t.co/GKJo94mocF @grethanpuppy Vegan pizza tho I’ve worn the same outfit AND had pizza for dinner 3 days in a row. I’m doing really good or really bad you decide Last day of my beard😭 I’m gonna miss him too much I might have to keep a mustache or something to help me get over it 😭 Grayson sent this to me today https://t.co/CIuqT3MbrX Damn it I opened my dms and my phone froze ok let’s try this again We got real jobs for the first time 😳 see how we did... \n\nhttps://t.co/X6PUXD1vGU Big rt https://t.co/xTk0YeREa5 I’ve been listening to the same music for like 9 months how do I escape this A couple days ago I couldn’t wait to shave my beard... now I’m kind of attached to it 😳 Graysons been yelling all day I’m popping an Advil Glad you guys love the merch. Makes me really happy we’ve been working on this stuff for a while now Things are selling out and the neon sign is going fast 😮 We made a neon lamp and it’s finally available on https://t.co/ZTZrPfHOhh 😭 actually my fav merch item we’ve ever made. There aren’t many so get yours today!!! My favorite merch item we’ve ever made is dropping in 5 minutes @KidCudi Thankful for your music and message. Has truly impacted my life in a positive way I’m thankful for my family and all the time I get to spend with them I’m extremely thankful for you guys everyday. Love you This thing earth is doing where it gets dark out way too early is depressing One of the scariest things I’ve EVER done in my life. Thank you for the challenge Molly I feel like a bad ass now https://t.co/SWQJy3utq7 New video up!! With @MollyBOfficial \n😮😮 \n\nThis one was fun and interesting \n\nhttps://t.co/vVSZSaZqFm Hi happy Tuesday I just heard the most touching story I’ve ever heard in my life FUCK I’m crying Wow I really love you guys Damn one more month of being 18 tf Why is this actually us @emmachamberlain @jamescharles @GraysonDolan https://t.co/nwDSYYJrqm https://t.co/Tru54uLmel That wasn’t a dream... https://t.co/jcjfnCe5Fq Grayson NEVER pays attention to details of anything. The other night he had us show up to a party an hour EARLY and today he had us show up to an appointment an hour early... why do I continue to trust him this happens all the time Annnnd Grayson is decorating our house for Christmas already CONGRATS ON 10 MILLION SUBS @jamescharles . holy shit sis This was SO FUN filming 😃\n\nhttps://t.co/9jkHSMbkYB Remember when we were handcuffed to each other? @CHOOSINGCV I swear it actually just did Every time someone calls us the wrong name I’m gonna tweet about it We’re driving and someone just rolled down their window and asked if we were the “Garlic Twins” \n\nD O L A N = G A R L I C \n\nok I hate when people aren’t open to learning :/ 😑 Some people need to invest more time into themselves and chill on the worry about other people @BryantEslava I think I took this Someone called us the “Grayson brothers” the other day... I haven’t been the same since :/ I can see the smoke from the fires from my backyard... so scary, I’ve never seen anything like it. I hope everyone’s okay💙😔 Wow surpassed 1 BILLION views on our channel. Thanks for watching us do stuff 💙 Gray and I just drove to the same location in separate cars. We called each other the whole car ride and talked about stupid shit and we we’re dying laughing Grayson said today is homemade banana pancake day, I thought this died in early 2017... ordering food on postmates immediately. THIS. IS. WHAT. IT’S. ALL. ABOUT. love you guys https://t.co/1zRD8zQeNE We finally decided to settle this argument once and for all \n\nhttps://t.co/H7xTqxedbR Happy Tues:) I just realized that when I’m alone... I talk to myself A LOT?! Wtf kinda worried Good morning everyone. Honesty is key, be honest with everyone including yourself and it’ll get you to where you’re supposed to be. I feel like a fortune cookie why did I just do that So happy you guys are loving the merch. Let’s all wear it together haha @JADORETHANN They’re so comfortable tbh. Def one of my fav items from this collection. Gray and I are reeeeaaallly happy with the way they came out The amount of hard work you’ve put into this project is unbelievable. When you had to redo all the looks😭 you worked your ass off on this because you wanted to create something you would be proud of and your fans would love and you definitely succeeded at that. Congrats sis💙 https://t.co/2YgG5wlXt7 Just dropped a bunch of new merch😬 we’ve been working on this for a while lmk what your fav items are :)\n\nhttps://t.co/9VLFvij2xr Wow I’m really excited for this merch launch. Been trying to get these products right for a long time, can’t wait for you to see them! Wow. Ok you’re insanely talented https://t.co/EeIg7uFxj5 It’s November.. I guess I can’t shave now By* fuck You voice text Just surprise visited my grandparents buy trick-or-treating at their house HAPPY HALLOWEEN I’m going trick or treating today I swear idgaf @jamescharles 💙💙💙 Yay glad you’re loving the vids :) https://t.co/FPiUWOTuiP RT @emmachamberlain: its up and its 20 minutes late 😘 happy halloweener 🎃 @EthanDolan @GraysonDolan @jamescharles \n\nhttps://t.co/uFaRzkOuqu RT @jamescharles: RT TO BE THE NEXT VIDEO'S SISTER SHOUTOUT!\n\nDOING MY BEST FRIEND'S HALLOWEEN MAKEUP!!! ft. @emmachamberlain @EthanDolan @… THIS WEEKS VIDEO IS UP 🧟‍♀️🧛🏻‍♂️🧙‍♀️\n\n@emmachamberlain @jamescharles @GraysonDolan and I visited some haunted places \n\nhttps://t.co/7E3GS6x1vx And me I’m in it too https://t.co/64lR6gG31m I can’t wait to see what amazing Halloween makeup look you did on me that I had to have on my face for 12 hours that day!!! 😄 https://t.co/ykPQl0WxWo Woke up today and saw this on Snapchat. What the fuck and also what the ffuuck? https://t.co/ti0X8Xl1BS These spooky Halloween Tuesday selfies are setting the mood for tomorrow’s video Something really exciting dropping this week 😳 My mom told me I’m the palest she’s ever seen me in my entire life.. would you judge me if I got a spray tan 😖 Your not even that tall. Your only 5 feet 11 inches in a half. Your just a idiot anyways https://t.co/sQ0J3Wa1zl Long\nAss\nD a y I’m delirious rn who wants to talk about stupid bullshit? Shout out to my mom for answering the phone in the middle of the night when I’m being a little bitch and hear a noise and immediately think it’s a ghost @jamescharles Ready to film for 12 on Friday ? 😃 Making Grayson soup rn because he’s sick. I’m tweeting this so you all know how good of a person I am not because I actually care about taking care of Grayson I just watched video of monkeys driving mini cars and motorcycles for a whole hour It’s up. Our dance performance.... \n\nhttps://t.co/qOLENBodqD 30 minutes until the dance 🤯😭 Hey @GordonRamsay I sent you a DM! 🙏🏻 Wow part 2 goes up tomorrow 🤯 @RyanAbe @GraysonDolan 💙💙 @jamescharles @GraysonDolan Thank you sis💙💙💙💙💙💙💙😭 Thank you so much :,) I love you all :,,,,) wow I feel weird. We were just about to film a very special video and Grayson split his head open on a door way while we were play fighting like 7 year olds. Now I need to crazy glue the cut shut so we can film 😭😂😭 we knew we were Idiots but not THIS BIG of idiots... Now Grayson is sleeping and I want to do activities but I can’t be caught doing activities alone I must wake him bad headache + extremely loud twin brother = crying blood YouTube is back from the dead it really is spooky season YouTube is back!! And guess who else is back? Me and gray with a new series that you can watch if you just click this here link below  \n\nhttps://t.co/b9fGcV6WYR Shit man, good thing you said you don’t know why because before you said that I thought you were the only one that knew why it crashed and our only hope to ever watch a YouTube video again was solely in the hands of you, Grayson Bailey Dolan. https://t.co/FAFsKJjjwj It’s not working 😭 you crashed it https://t.co/pCN5bw5ubd OF COURSE YOUTUBE IS DOWN ON TUESDAY WHAT THE FUCK My mom just called me Grayson... annnddddd back to LA time to go! 😳😎 https://t.co/TbFfE9wuKg ITS UP... 😟\n\nhttps://t.co/b9fGcV6WYR\n\nThis was nervous for me😟 Wow I’m excited for Tuesday I just drooled while being awake for the first time Watched the first episode of the new series last night... I don’t think I’ve ever been this excited to start something. Really loving the way it turned out and I hope you will too I watched a Halloween movie last night that was me gray and my dads fave Halloween movie when we were little, I felt like I was little again If u wanna get in the spooky mood drink some hot apple cider Wow I have really good people in my life right now :,) Some adults really act like children wow Whenever I can’t finish my food Grayson finishes it for me. I respect him for that. You may never think of us the same ever again... \n\nhttps://t.co/4FajnlgLMK We answer like... everything in this video today😳 Why am I such a paranoid person Wow, just wrapped the first “episode” I guess u can call it, of this series. HOLY SHIT. I’m so excited for this. Today is a big day for gray and I... I’m pretty nervous 😅 you’ll know soon... 🇮🇪*** lmao Back at the hotel. That was a crazy fight LETS GOOO🇨🇮 Seeing my family this weekend 😊 It’s getting spooky out and I love it Found out Grayson is allergic to pigs:/ we’re going to be pet-less forever 😭 My mom is very camera shy. Go watch the vid and tell her she did a good job 😂 https://t.co/ufk7fOryep MEET OUR FAMILY IN THIS WEEKS VIDEO they were all very nervous \n\nhttps://t.co/sdo5ifU9IQ you guys meet our family tomorrow 😬 Says....... YOU?! I tell you this at least 5 times a day but you don’t even hear me because you’re on your phone https://t.co/m4PMiE1vaP Nothing is too personal for this vid... ask away 😳 Guys, idk why I’m doing this... but ask us questions you want to know the TRUTH about. Going to a real detective with a lie detector to answer YOUR questions 😳 My mom just called me 5 times in a row then texted me telling me to call her... I call her back ANNNDDD guess what?!😃 no answer Just thought of A CRAZY series idea for our YouTube channel... never been this excited about making videos before... 😭 Thanks, fuck that really means a lot 💙 especially coming from a statue pee pee https://t.co/hq5hpgkOhi Can someone photoshop my tattoos on a baby picture of me so I can feel like lil Wayne plz Mr. Game and Watch tat grew on me and I will not be covering it up Ok so we filmed with pretty much our entire family. All of our Grandparents + our parents 😳😭😂\nfirst time ever having them in a vid. This should be interesting Holy shit this new phone is huge I love it It’s bed time also time to feel like I have enough energy to run 13.109 miles and wanna eat a full ice cream cake with cookie crunch in it I left the house to get food and Grayson called me off my moms phone FREAKING out cuz his Face ID and password weren’t working and he disabled his phone for 30mins then realized he changed his password after blaming it on me and spitting at me over the phone Yep that’s gonna be there for the rest of my life.... \n\nhttps://t.co/S0Tq1uZMR2 You’ll see in 5 minutes https://t.co/NyrNOuusVt New vid in 10 minutes🤭 being honest, my skin got pretty bad for a little while and def made me insecure. If ur having problems with your skin 1. It’s not nearly as bad as you think 2. cutting dairy completely out of my diet has been the only thing that really worked &amp; it makes u feel better all around Tell someone you love you love them Just filmed with my grandparents... I- ... Ever since I went dairy free, Graysons been having ice cream like every night. This is some sort of torture Back in jersey with the family So I’ve been eating dairy free for like 3 weeks now and I accidentally just ordered NUTELLA FUCKING PANCAKES. I was about to take a bite when I realized the mistake I had made. dw I made Grayson eat them for me but still a despressing moment :/ I hate taking accidental naps I just sat down and knocked. I woke up and I’m still just as tired as before except now I’m sweaty and I have bed head Went Halloween decoration shopping then practiced partner cheerleading? (I think) moves in our living room today. What’d u do It was our first time... \n\nhttps://t.co/TV6u8xSseN h a p p y t u e d a y Putting lotion on when u feel all dusty is such a fantastic sensation Grayson made me take the doors off my car cuz it was too hot out then he started bitching that it was too cold cuz the doors were off and asked me to put them back on... tf bitch put them back on yourself Hi I’m alive wtf am I doing Grayson is getting dog allergy shots now.. hopefully one day we can get a little fury mans 😭🙌🏻 💙💙💙💙💙 this is amazing. I’m so happy for you https://t.co/NMxyn9PkO7 Wow the reactions to the video are really hitting me hard. Seeing that this video is helping people be comfortable in their own skin and being happy with their true selves makes me happier than words can explain @RyanAbe 💙💙💙💙 ❤️🧡💛💚💙💜 https://t.co/mvTKGDppw5 I might’ve reached an all time personal record for happy. Idk if I’ve ever been this happy 💙 https://t.co/75IdfQKaeW Wow, it’s up... :,)\n\nhttps://t.co/Cf2Wy5zO84 10 minutes!!!!! RT @GraysonDolan: GUYS THE MUSIC VIDEO DROPS TODAY WTF IM SO EXCITED. I wrote this story with E five to six months ago and now it’s real an… .... music video today😧 Giving feels good HAPPY 21st @BryantEslava 💙💙🎁🎈🎉🎊 THIS TUESDAY😝 HOLY FUCK 💀💀💀💀💀💀 https://t.co/PPgNYhdQRh 😕😔 https://t.co/6S3qq9FvA7 Going in on this music video rn. We’re really proud of it :,) can’t wait to show you THIS TUESDAY RT @GraysonDolan: MUSIC VIDEO \n\nTHIS TUESDAY\n\nOUR CHANNEL If you intentionally sleep with socks on I do not trust you Ethan is my day I got a little bit more than a half day of school to be done today so I’m sorry to miss y’all too much I love ya bro bro I gotta is a time to come home from the house tomorrow and we do have it for dinner tonight or something haha was a way of a day off I just https://t.co/gm9wRC395F Wow I finally have a tat idea for a spot that isn’t my thigh😃 Oh wut this is cool https://t.co/V6Tktf2zot I HAVE A CRAMP IN MY FOOT HELP Hahahaha I love you I not scrawny 😢😓 GRAYSON DOLAN EXPOSED HE’S A MEAN GRAYSON DOLAN IS A MEAN https://t.co/TFFP1i3u1t I think there is a ghost dog in our house... Grayson keeps getting allergic randomly I think the ghost dog came with the haunted cabinet that gray got from the junkyard Lmao for real tho I don’t think you guys understand how much gray and I fuck with each other daily ITS ALL FOR FUNZIES!!! NEW VIDEO IS UP\n\nThis was weird for me to see and remeber after I didn’t remeber anything that I was seeing before watching and reacting to this video \n\nhttps://t.co/b9Sa95kkgR @BryantEslava The big 1-9!!!! Just fell asleep and woke up and it’s not Tuesday yet:/ also Grayson was smacking my back when I woke up so that also sucks Ok now Grayson just ORDERED a bunch of Halloween decorations on post mates and they’re being dropped off at the house.. WTF WHY The fall is my favorite season and I don’t realize it until it’s starts to become fall every time Can’t relate 🤷🏻‍♂️ you should prob step ur twit game up https://t.co/gWTqVPJpBC My grandma has BDE My grandmas mind is so powerful My grandma texts me photos of food she makes everyday and it’s really not fair I think it’s her way of making me wanna go back home.. maybe my grandma is smarter than i think she is and has a master plan. I’m realizing so much as I type this tweet out Grayson went to a junk yard the other day and bought this dresser and we’ve been hearing noises around the house like ever since.. like LOTS OF NOISES it’s DEFINITELY haunted Why is Grayson Halloween shopping in August THATS A FUCKIN WRAP HOLY SHIT I CANT WAIT TO SHARE THIS VIDEO WITH YOU Just realized I haven’t gotten a tat in way too long Thanks for always catching my typos so quick so I don’t look like a dumbass and leave the misspelled tweets up for too long. Y’all are the shit Glad you guys are enjoying the videos. James’ was s’cute and I actually cried laughing 9 times watching Emma’s. I love my friends RT @emmachamberlain: vEgAs BaBy\n\nhttps://t.co/YMPbAGE6c8 RT @jamescharles: RT to be the next video's sister shoutout!!\n\nBEST FRIENDS BUY EACH OTHER'S OUTFITS ft. @EthanDolan @GraysonDolan @emmacha… “Thanks for fucking cropping me out kitty bitch” https://t.co/lKHFZChqdz This is why we didn’t remeber anything that one time \n\nhttps://t.co/t8e3CE1twN 5 minutes!!! Been getting nice with facetune https://t.co/b8v98s5L8W ok remember when Grayson, James, Emma and I filmed a video and we said we didn’t remeber anything? That vid comes out tomorrow😬😳 Grayson made me do a juice cleanse with him so he didn’t feel alone then he quit after 2 hours and told me I had to complete all 3 days or I’m a lil bitch. I had nothing but juice for 3 days all by myself plz feel bad for me😟 U know you’re excited about something when you don’t sleep but still have more energy than ever before in your life You don’t understand how excited I am to share this project with you Wrapped filming at 2am. First day of directing was a success Gray and I only yelled at each other like 50 times If you have the right attitude you can actually do anything. Attitude is so important Thank u guys for the support I’m so excited ITS UP! Part 2 is WAY more intense \n\nWe got caught in a storm and had to eat bugs.. \n\nhttps://t.co/pBcWy1cNWZ Nothing like getting out of bed when u still want to sleep for 5 more hours then going to take a shower to get ready when u don’t wanna be getting ready for anything and then seeing a spider in your shower. That’s me rn. I have to battle a spider that is in my shower Wait.. SURVIVAL PART 2 TOMORROW. ngl its way more intense than the first one ..😳😬 It’s something very different from anything we’ve ever done before... we’ll explain on IG live Wednesday https://t.co/er8xwPVUMA Love you too @NICKIMINAJ 😘 https://t.co/qOuT6JaR2S Got a pedicure today my feet feel fantastic It’s so hot out I’m sweating up this sisters hoodie Don’t be mean to people FINALLY getting a haircut I’m having so much fun honestly I hate when I type “haha” and accidentally start it with an a like “ahaha” Me with hoedown throwdown https://t.co/E9yYUWGD3v I just got a new car 😃 It makes me really happy that you guys are liking the video 😬:))) ITS UP! \n\nWe either survive or die... u find out \n\nhttps://t.co/b81BuQMrjH Ok the vids gonna be up like 5 mins late sry thx ily Went shopping all day. I kinda want to die but also I’m glad that I actually have clothes to put on my body now and also my mom can stop roasting me PART 1 OF THE SURVIVAL SERIES COMES OUT TOMORROW😧 No joke I woke up like dancing this morning Grayson blasted music on my Bluetooth speaker to wake me up and when my eyes opened I was just getting it @jamescharles See u tomorrow @dslanhearts @headassdol Videos** I FUCKINGLOVE YOU @GraysonDolan If you stayed up past 10pm you wouldn’t have this issue My mom roasts me for wearing the same outfits all the time:/ I just HATE shopping it’s so boring 😭 😭😭😭😭😭😭😭😭😭 noooooooo https://t.co/Rsl7zks1Rz Just woke up with poison ivy rashes all over .... I think the survival videos are going to be my favorite videos we’ve made so I guess it was worth the itchiness love you💙 https://t.co/XoUWUmb2G8 My sister just made me homemade pizza and I think she needs to open a restaurant.. I’ll be there everyday The first thing Grayson does when we finish filming the survival series... shaves everything on his face... besides his mustache. why This video was pretty painful to film...🤢\n\nhttps://t.co/gJMtbUhchc New video in 1 hour! We filmed this one like a week ago when we were in LA and it made me sick to my stomach😧🤢 Thank you everyone for the get better wishes, love you all. I’m doing good, really appreciating life right now 💙 @RyanAbe Love u bro💙 Thank you Shane 💙 https://t.co/LwCScmzATm Not riding again, don’t worry lol I’m very much over it I got into a pretty fucked motorcycle accident.. I’m completely fine. Somehow. I realize no matter your ability, anything can happen. Just in general anything could happen, enjoy everyday and just be grateful to be here💙 Feeling extra blessed right now love you all Happy to be alive I know we’ve been joking about surviving in the wild for a while now, but it’s happening for real very soon. IM SCARED U made my night with this tweet https://t.co/pA1yYnfiSB That wasn’t a dream best friend. I’m getting revenge next time we play laser tag. I let u win https://t.co/cbZMJQjdT5 GUYS HOLY FUCK. This month we are literally working on the biggest projects we have ever worked on for you guys. I will fill you in as soon as I can but just know I’m going hard with this stuff everyday and I’m crawling out of my skin I’m beyond excited. I feel like a lizard Slept in for the first time in 9 years today GUYS we got a home makeover and it’s actually insane. It’s on Mr. Kate’s channel!! https://t.co/5tiPKaLYDr @BryantEslava EXPOSED Probably my favorite video yet... this was extremely complicated but I pulled it off 😎\n\nhttps://t.co/bCJQSabbQU Today is the day this video goes up... can’t wait to show u guys it’s actually  crazy/spooky/intense/stapitchulous/funny Can’t believe we hit 6mil guys like what. Seriously never thought I would have that many amazing supporters, it’s still really crazy to me. You guys make me happy thank you and love you Grayson has gone full dad at this point.. he woke me up from a nap to take me grill shopping (the kind you cook food on) we’re at the store rn and he’s lifting the lids of all the grills and goes “damn I never thought I would love grills so fuckin much” Happy birthday to my sister We’ll see ☕️ https://t.co/01s6j1zg8E Just watched this upcoming Tuesday video and ...... holy shit. I got Grayson real good Sometimes doing what’s best for you is the hardest thing to do WE FINALLY MADE T-SHIRTS! New design and everythiiing 😯\n https://t.co/9VLFvij2xr Holy shit just filmed an INSANE video  with the squad lmao. WE DON’T REMEMBER ANYTHING Doing something PRETTY SCARY tomorrow. And we’re filming it 😳😭 Honestly so happy with life at the moment. Thank you guys for being in it Guys Gray and I are going to be on fear factor tonight 10/9c on MTV. We had to do the craziest shit we’ve ever done in our lives by far. Don’t miss it😳 YA SE SUBIÒ!!!!! This weeks video is up we learned Spanish the hard way😳 thanks to our teacher @ElJuanpaZurita \n\nhttps://t.co/gugMxUH7J2\n\n#Dolanpa Happy Tuesday and feliz martes I played around in mud today like a pig I’m not kidding at all GRAYSON WITH THE YOUTUBE COMMUNITY POST AGAIN 🤮🤮 We just ordered pizza and Grayson got half anchovy half plain and he expects me to eat the plain half. FUCK NO THE PIE IS CONTAMINATED Happy birthday mom My sister just texted me this... https://t.co/QoGukZVNZ9 Guys I’m the smarter version of Grayson Guys I figured it out Grayson is the dumber version of me I’m having such a good morning for no reason hope u are too :) We switched lives for a day.... probably one of the most challenging things I’ve ever done. \n\nhttps://t.co/AUPQfqm9Hm @ElJuanpaZurita @GraysonDolan Idk what this means but WOOO Just played my best game of Fortnite and it FROZE during final 2. IM SO MAD. Someone calm me down before I destroy something that means a lot to me Our house is getting a makeover rn!!!!!!! I’m so excited This world isn’t fucked! Certain people just are. Don’t continue the negative chain, if someone is an asshole to you, go make someone else’s day ✌🏻💙 I’m not offended or anything, negative words are just a result of people being overwhelmed by their own problems and insecurities being built up. Just sad about those little kids having to grow up in that negative enviroment with such irrational and immature role models. A car just pulled up beside me and yelled discriminatory slurs at me for actually no reason. They had children in the backseat, and I was really disappointed to see the bad example they were setting for them. Always make sure to set a good example. Kids are the future Really feeling like myself lately:) Grayson just tried to start a fire with a taser and burnt some of his hair off... Sometimes I wanna be an astronaut. Is it possible to do that part time? I still wanna make videos but also be an astronaut Gray and I just officially started a project we’re extremely excited about and never thought we’d actually be able to do. Can’t wait to tell you guys soon:))) Do you guys want to see us make any videos in particular orrrrr? Ideas...... orrrrrrr? Alright, going thru out old phones...😭\n\nhttps://t.co/uo32IJpYal Happy Tuesday love ya Yeah, why would I want salmonella? I’m not eating your dish https://t.co/QcSPXzx0SU Grays making me dinner. I’m so desperate I might just have to eat it😭 I’ll lyk how it goes Grayson just asked me to call his phone because he lost it. So I picked up my phone and started calling it and he immediately goes “who are u talking to” WTF IS WRONG WITH HIM. He needs help like actually I didn’t know what day of the week it was until just now.. not even kidding I thought it was Tuesday and I started panicking because I didn’t think we would be able upload on time Good morning! Gray and I made something yesterday that we’re really excited about 😳😬😭 James came over and had chocolate in his pocket. It’s 115 degrees... @BryantEslava @emmachambie @GraysonDolan EVERYONE GO WATCH IT WE HAD SO MUCH FUN Orange is the new snack. I really struggled to type that Grayson told me to caption this that. UGH IM STILL THINKING ABOUT THAT WHY IS HE SO CHEESY HOLY FUCK https://t.co/V60YWaH3vd Thankful forever for you **Driving on the highway hitting bumps**\n\nGrayson - “am I in ethan’s lane right now cuz it’s really bumpy” \n\n... Just got off a jet ski HAPPY 4th! Thank you. I’m gonna show Grayson this https://t.co/N1c06NCqAL @RickyPDillon @GraysonDolan I think they are but I’ll ask THIS WEEKS VIDEO IS UP\n\nhttps://t.co/ldjLmUfYzy 👨‍🍳 What do I do about my hair ? I hate when I make a joke and no one knows it’s a joke it really makes me die Dynamite by tio Cruz&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; \n\nNever forget. NAHHHHH GRAYSON AND I JUST HAD A REAL TELEPATHY MOMENT WTF I always gleek on my phone screen by accident when I chew gum My mom just texted me a video of her and my dad and Grayson picked up the phone and started talking to it like it was a FaceTime call for at least 25 seconds before he realized it was a video 😭💀 I have reverse trust issues... I trust everyone too much Pay yourself in memories Memes are great Gray and I actually made it ourselves... we worked really hard on it☺️ so happy you love it 😊 https://t.co/UXYHCMB2rJ ITS UP! 😳😳😬😬\n\nhttps://t.co/lYEKAgqsEk Video in 30 minutes?!?! Early??!! And it’s going to actually be up on time today?!?!? You know when ur just writing and you accidentally draw the PERFECT LETTER and u wanna frame the letter cuz you will never be able to create a better version of the letter you just wrote I want a pet pig so bad but I feel like I’m gonna buy a small one and then it’s not actually gonna stay small and then become 1,000 pounds and then it will lay on me and break my femur and I won’t be able to walk for 8 weeks minimum Life is amazing and sometimes it’s not BUT RIGHT NOW IT IS Graysons phone is broken... I told him not to take it in the ocean but he didn’t listen. He wanted me to tell u it’s broken tho Obviously Grayson 🤮🤮 https://t.co/0jn3lnOGQS The video is ACTUALLY up!\n\nhttps://t.co/rmFUvoTtF7\n\nIt was a requested one 🤔 WAIT GRAYSON UPLOADED A WEIRD ASS CROPPED ASS VIDEO IDK WHATS WRONG WITH HIM. reuploading rn Grayson just FaceTimed me and asked me if I can go to his room and deliver him a squirt of shampoo because he ran out ... good morning I guess? BONUS* BONUS VIDEO FRIDAY https://t.co/JL3NREPwaX BONER VIDEO ON FRIDAY RT @GraysonDolan: I SMELL A BONUS VIDEO IDK WHERE IT IS BUT I SMELL IT Good morning 🐢 YAY I’m seeing people tweet me about us sharing the same phobias WE’RE ALL WEIRDOS TOGETHER THE VIDEO IS UP! \n\nThis is what would happen if you sat at our lunch table \n\nhttps://t.co/U5dbDPwEYS In the meantime, I’m going to look at some Tuesday selfies and peep nicki minajs’ IG Delaying the upload until we’re all ready JAMES AND EMMA GET YA SHIT TOGETHER What kinda of vids do you prefer? Happy Tuesday:) in today’s video we: laugh a lot, get real, 3 way collab, is our longest video 😯 You are what you attract. As long as you are not evil, you will not attract it. Make sure you’re a good person, good things will come Life is so short, make sure you make a difference. Tomorrow isn’t promised, everyday is a blessing. If you want to do something, go after it NOW. There is no time to waste, no time to second guess, and no limits. This world is fucked. Don’t lose hope though RIP xxxtentacion, regardless of his controversial past, he did not deserve to die, especially so young. I respected him for preaching/spreading positivity and the lives he touched in a positive way. Gone too soon, so terrible. His music/art will live forever. Happy Father’s Day to my dad who I’m very proud of and extremely thankful for :) I wish my room was further away from Graysons, he connected to my Bluetooth speaker this morning and BLASTED it to wake me up @BryantEslava @GraysonDolan Thankful for you too, beanville 💙 Girls are confusing🤪 Life is starting to throw really cool stuff at me PLEASE KEEP IT COMING James just asked Grayson when his birthday was and THEN HE ASKED ME WHEN MINE IS. sister brain malfunction Everyone is saying that my Dutch and German is bad.. don’t blame me blame the robot voice on google translate that taught me Wow today is amazing AskEthanAndGrayson4 IS UP!!!!\n\nMore intense and longer than any other ask video yet 😟😯\n\nhttps://t.co/B9ugMUvuKr Our new video is going to be a LONNNGGGG one Make sure you’re not allergic to your eyedrops. https://t.co/iTfAX7NI5X So I’ve been taking eye drops for the past 5 days and today I learned that I am in fact allergic to them!👍🏻👍🏻🤪 Dming a lot of you guys rn. I wanna talk to u :) Not feeling so well🤒..... UGGGHHHHH AHHHHHHHHHHH AHHHHH UGHHHHHHHH FUYUCYYWV ASK ETHAN AND GRAYSON 4 GOES HARD. Harder than any other ask E&amp;G and we’re not even done yet 😳 KIDS SEE GHOSTS. Gray and I are freaking out rn . CUDI IS A GOD My grandfather told me “always be an idiot. If you’re not being an idiot ur fking up.” And I trust everything that guy says Pineapple pizza is not to be slept on anymore. I will not allow it. I just heard the words “I kinda fk with my mustache” leave Grayson’s mustache covered mouth... can’t believe it’s almost summer already but I’m not even mad https://t.co/t4jDzFPB96 Who leaked this.... https://t.co/yLzPsVTaDM We’re all so similar for real. We like a lot of the same stuff, we share a lot of the same thoughts, we have really similar views on certain subjects. I feel really close to you all and  I’m really grateful  for you this weeks video is UPPOPOOOUp\n\nhttps://t.co/UeS6wzB8cV\n\nWe confess 😟 TUESDAY I’m thinking about good things Up too late thinking too much starting to think about the meaning of life and idk what’s going on and why but I’m glad u guys are in it with me I’m happy right now I’m happy right now I’m happy right now I’m happy right now I’m happy right now I’m happy right now I’m happy right now I’m happy right now I’m happy right now I’m happy right now I’m happy right now I’m happy right now I’m happy right now Alright my pimple cream worked overnight it’s gonna be a good day🙌🏻 Wrong hashtag.... it’s #AskEthanAndGrayson https://t.co/ZJFMqMZn1l ITS ABOUT TIME FOR ANUAL #AskEthanAndGrayson it’s been a year!! Ask us bad questions First live steam was a success! \n- Grayson didn’t know how to invite me \n- Grayson leaked his number \n- Grayson glitched out and had to end the live \n- I had to take over for Grayson as host \n- and new merch on https://t.co/ZTZrPfqcSH Love that and love you https://t.co/UF057Cl576 I hate coming across tweets that are like “Rt if you love your mom, if you don’t rt you don’t love your mom.” I don’t rt but I still love u mom I promise😟 Make sure everything you do is fun. Don’t let yourself get bored, we don’t have enough time for that. Challenge yourself, easy is boring I had to tweet that again cuz I made a typo that RUINED THE WHOLE TWEET It’s crazy that I can tweet and have all of you amazing people reply with such kind words. U lift me up, thank you. Also, I read your replies all the time I think way too much . Trying to figure things out in my head 🤯 Gray just hung art up on my wall and it’s FNK LOPSIDED NEW VID UP 😟😟😟\n\nhttps://t.co/JJB4WhXjeK GOOD TUESDAY MORNING AHHHHH I hate sitting STILLLLLL You’re beautiful https://t.co/PThIwjLJDy Grayson just walked into his room and disappeared. Idk where he is. It’s like when u put ur phone or wallet down and it’s disappears except he’s a human and can talk but I still can’t find him :’)    this made me smile!!! https://t.co/DcoX2EiIEe Adventure day with Grayson So apparently it’s #BrothersDay .. happy brothers day Gray! and um..... yeah just Gray I thought you said you wouldn’t tweet this. I’m just gonna say it now... you look more like Nolan. https://t.co/01ZvrrlNiK I have bad helmet hair I look like a parrot Annnnnd Grayson is snoring I’m gonna up for a while... what’s up Happy birthday sis 💙 @jamescharles New video up... \n\nhttps://t.co/jTMRLd8pxs\n\n😟😟😟😟😟😟😟😟😟 wait it’s Tuesday isn’t it Words can hurt but they can also make people happy. Choose the good ones :) Grayson always turns the music down in the car to SAY THE MOST RANDOM SHIT. **lowers volume** “yo by the time we’re 94 do you think they’ll have printers that you can just look at and think about it printing something and it’ll just spit it out instantaneously?” Grayson and I just crashed a drone in the ocean.... I won’t blame it on him. It was a team effort fk up Confession... I enjoy writing... what am I a 60 yr old? \n\n*waiting for triggered writers to be pissed at me and tell me writing isn’t just for old people, but I guess I’m one of them now.. minus the triggered part but still* Sick Grayson = Ethan getting ordered around all day :))))))) Only difference between gray and I... Laurel and yanny. I hear laurel I have no clue how he hears yanny Grayson just bursted I’m my room almost panicking asking me why his head looks so small right now..? Wtf THIS VIDEOS IS UP! \n\na house tour of our new house... that’s all!!...?😬\n\nhttps://t.co/g5WGlPKWMw Tomorrow’s vids a pretty requested one 🤔 Happy Mother’s Day:) thanks for everything moms There’s a baby video of me spitting on Grayson when we were like 2 years old and idk where it is but I really wanna find it Grayson beat my ass with our new merch pillows this morning. So I guess we dropped merch today so ya Nolan better not put his balls on my new drum set Doing more stuff just for fun Nolan just asked me if he could make an Instagram and twitter account... I knew seeing himself in a video would get to his head ITS UP!\n\nIt’s time we told you... \n\nhttps://t.co/OVP6SOk0Xg Vids gonna be up just a coupppplleee minutes lates Love this 😊 https://t.co/GTjNKLs2gF anyway happy video tuesday :) Omg what are u wearing on ur body 🤪 that’s so weeeeeiiirrrrddddd🤪🤪🤪 Who gives a fk what clothes people are wearing that’s so irrelevant. How did humans evolve to this... As much as it sucks that we lost the footage I’m actually having fun with this whole process cuz I really miss making vids:) btw there WILL be a video on Tuesday that I’m really excited to share with u If this vid can’t go up and we post the next one up it’s ALLL GoOd these are my fav 2 vids we’ve filmed yet He came back with a lot of cereal, no milk. Just sent my son Grayson food shopping for the house Happy to be home:))))))))) Don’t waste time complaining, change your life for you :) I’m bored I’m tryna learn a new language A problem on the internet..\n\n“Idk why no one understands my sarcasm”\n\nUm prob cuz ur just typing a bunch of mean stuff and not saying it in real life with a sarcastic tone of voice Grayson fell asleep 4 times throughout the day today I feel like he is a newborn and I am responsible for him Happy to be back :) \n\nhttps://t.co/mTBfsNMgbH 10 MINUTES AND WE’RE BACK ITS TUESDAY. The Tuesday we return🧐 Tomorrow Coming sooouesday Inspired to inspire myself more Grayson drive like an IDIOT he just made me spill coffee all over myself and we’re on the way to a meeting FUUUUGEHRHWH There are some really good people out there. Just let your guard down and look 👀 There are some REALLY talented people in this world. Still coming soon lol Surprise there’s a new merch item 🧐 https://t.co/ZTZrPfqcSH Just finished a big ass milkshake and I was so full I didn’t wanna finish it but I had to cuz it was a milkshake Good things don’t come easy. Tbh if they did life would suck. Life is the most interesting game of all time I have to pee pee 😟 Can’t hide it any longer. Just filmed one of my favorite videos ever. Coming soon ... Creating coming soon Happy Tuesday everyone:) I’m stressing cuz I haven’t gotten my shit done that I need to do but I don’t want to do my shit that I need to get done I’m laughing rn Woke up to a dog without a collar on our porch. She looked scared ran away from us:/ called animals services and they’re looking for her Grayson just texted me this “🤫” emoji with no context. Wtf did he do I’m actually kinda worried Just lost the most heated game of Fortnite. All I can say is I love u! No one knows what goes on behind the scenes🤔 Trust issues maxed out What am I supposed to do for the next 50 days tho? https://t.co/yaRmt4gCP0 Just did so much stuff 😯 I think u guys are gonna like it I’m honestly really excited rn. I’m gonna scream irl real quick.\n\nAlright I screamed that felt good It’s getting closerrrrrrrrrrr Happy Tuesday :) I’m happy No sleep I cut my finger ripping Grayson’s jeans idk if u wanted to know that or what Just realized I left everything I was going to wear to Coachella in jersey.... and Coachella in in 2 DAYS I just spilled a smoothie on my shirt and kinda started bitching about it and Grayson was saying that if it was him he wouldn’t care so I made him switch shirts with me Building something today 👨‍🔧🤔 Hopefully Grayson won’t leave my car a mess now that he has his own So Grayson just left the house with a collared shirt on and I asked him what’s up with the collared shirt and he wouldn’t tell me. He just texted me that he bought a car? I guess the shirt was to look professional at the dealership. Wtf is wrong with him ... https://t.co/fzaMkJkp54 Happy Tuesday... we’re getting there No one has their life figured out. Shit changes everyday I NEEDED SUN Nah I love you Thank you thank you thank you thank you thank you I appreciate every single one of you. You make me happy. I tried not to sound cheesy but I couldn’t help it 😟 I’ve sneezed about 76 times today Grayson just told me he’s happy to be doing my laundry and he meant it? Idk what’s going on with him Why is everyone always so triggered if ur a non triggered person I like u automatically GRAY AND I JUST GOT A HOUSE BIG DAY TODAY NEW MERCH u can put them on ur feet\n\nhttps://t.co/lY3Ek5fzxy Should we drop new merch tomorrow ? If Grayson turns the music down to talk ONE MORE FKN TIME Gray and I have been working on A LOT... I just wanna show U already 😬 AHHHH IM EXCITED OK The new stuff is gonna be NEW HAPPY EASTER 🐣 💙 Update Grayson is sleeping.....🤔 Grayson just told me my eyebrows are disgusting. I’m gonna shave his off while he’s sleeping Everything is falling into place :))))))))))))))))))))) \n\nCouldn’t help it had to tweet those^ Ok, I’m excited now Figuring some things out.. looking forward to the future Hope you guys understand \n\nhttps://t.co/c8nzXGp9oQ\n\n💙 Hey, open and honest conversation with u guys coming Tuesday. Love u I haven’t able been type lately everything is backwards and stuff don’t mistake grayson for an artsy man. I take all of his photos with the nice aestheticles On the east ! Pulled an all-nighter with Grayson. Our conversations keep getting weirder and more pointless as we stay awake longer U ever think of something so crazy that it blows your mind so much to the point where u feel like someone or something made you think of it cuz there’s no way you’d be able to think of it on your own? Just fell off a chair. Ate shit completely Not too sure what to do .. I was about to get in the car and Grayson drove away from me and left me in the pouring rain.. Great night. I have some good friends:) ITS UP! Opening your mail😳\n\nhttps://t.co/Xtguzhk6kk\n\nWe also constructed something out of the mail🤔 The videos gonna up but a LITTLE later than usual today.. sorry, there were a lot of boxes TOMORROWS TUUUUEEEEESSSDDDAAAAAYYYY But for real I was OVERWHELMED by the amount of love we received thru the P.O Box. thank you thank you thank you. Just wait for the video😳 it’s 😯 Guys Grayson and I by ourselves gathered THOUSANDS of packages from the P.O box. We went everyday so we wouldn’t miss a package. The post office was overwhelmed, had to close the P.O Box and had to begin mailing packages back. If you sent anything I love u I’m a little addicted to tattoos... Why am I so confused Grayson got hit in the head with a surfboard and his face is so swollen he won’t let me take a pic of him Grayson just ruined my fking Instagram photo FINALLY CRAWLED OUT OF BED TODAY Life’s hard enough let’s make it easier for each other I’m not “dragging” anyone in specific and I’m not trying to be “woke” im just saying in general wouldn’t it just be better and easier if everyone was just nice to one another. It takes just as much energy if not LESS than it does to be mean to someone Let’s all just be happy and nice. If not just turn ur phone off or something The internet is poisonous So we got tattoos that you guys drew that are on our bodies forever now... here’s the video! \n\nhttps://t.co/dsQ5cJzaKb Just woke up I’m so confused but it’s Tuesday and that tattoo video comes out today!!¡ I can’t get out of bed😷 My mind is open, I’m looking at the bigger picture. Everything is so small Productive conversations &gt; Holy MAIL.. I’m scared to open some of these.. Graysons really good with the Aux. very talented with it actually, I’ll give him that. He might even be an auxiliary master now that I’m thinking about it NEW MERCH IS AVAILABLE😯 \n\nhttps://t.co/9VLFvij2xr Happy women’s day women ! MERCH DROPPING TOMORROW. ITS LIMITED EDITION U guys can always tell when my energy is eh or I’m feeling eh, I honestly feel like I’m friends with all of u. Thanks for always being there and sorry if I’m boring I just feel eh sometimes I’m happy like I’m actually having fun Good thing graysons car just broke down in a parking garage 😍 new videoe is up!\n\nhttps://t.co/O0LYqZvQSB Really excited to get this tattoo😬 These tattoo designs are so cool idk how u guys do this so much creativity in******* I swear auto correct will be the death of me White sands. Waited until the end of the trip to get this photo so we were tan enough to not blend it https://t.co/c5aMnXUB2f YO Gray and I are going to get a tattoo that we want one of you to design because you guys are really talented and mean a lot to us. Tweet us your designs! Gonna look thru #DTtattoos Grayson just got dressed up cuz we were about to go out and just passed out with his shoes and jacket on... we’re so jet lagged I just slept for 2 days straight I think. What did I miss I feel alive I’m red RT @GraysonDolan: Gonna make a video getting tattoos you guys design. :) we’ll get anything\n\nYou guys are really creative and your art insp… I miss my sister 😭 U live 1 time so what’re u gonna do about it ? I DONT WANNA LEAVE AUSTRALIA New video is uppp\n\nhttps://t.co/0Tz0DZm9L9\n\nTypes of fans 😯 New video in 3 mins!!!!! HAPPY TUESDAY 🤯 The video is another “Types of” video... and it’s the most requested one 🤔 REMINDER: posting on our first ever Australian DT Tuesday! The video will be up at normal time TOMORROW. So that’s a day early for u guys back in the states😝 Holy shit the stars are so bright here the vibes are pretty effervescent I’m trying to find a wild koala hahahahahahah AHHHHHHHH..... ha....... yea GRAYSON KEEPS WAKING ME UP BEFORE THE FKING SUN COMES UP instagram vs real life https://t.co/Ybmjc6n3LZ NEW VIDEO UP\n\nhttps://t.co/xnfMnqS6KE\n\n......😟 I’m so tired of squinting when I look in the mirror I need to get tan I’m so pale Haven’t been able to say I’m happy and genuinely mean in it in a while, but I’m happy and I mean it 😛 Thanks for the warm welcome AUSTRALIA TODAYS THE DAY I got no sleep and I feel amazing Nothing that has happened so far has been anything we could control You guys are funny as hell Im trying to get out and go do something but Grayson won’t stop tweezing his face idk what he’s even tweezing anymore his eyebrows are completely gone I just had to kiss Grayson on the shoulder for a free burrito at this place cuz they had this Valentine’s Day special Just now realized that it’s Valentine’s Day... only cuz my grandma texted me and asked if I received her chocolates she sent me. I’m not kidding at all. AHHHH WTF I ACCIDENTALLY MADE THE VIDEO PRIVATE WHEN I WENT TO FIX MY TYPO. ITS BACK THO I STILL HATE COMPUTERS the video is up finally!! And u might possibly be in it 🤔\n\nhttps://t.co/hTC1zrvAKt Yoo gray and I are starting this thing where we post YouTube videos every Tuesday and today is Tuesday ! Idk I almost just freaked out Hey I’m back did the snap update go away I’m going somewhere far in a week guess where I’ve been having the most vivid dreams lately and they’re so weird it’s making me question my sanity really. Idk how I make these dreams. How do I make something that I don’t understand while I’m asleep We’re in the car and Grayson’s freaking out saying he’s too hot and keeps sticking his head out the window.. he doesn’t realize I put his seat heater on😭💀 Why do I have no clue what to say Grayson told me “take the helmet off this isn’t spy kids” :/ I got a new motorcycle helmet and I’m wearing it walking around my house cuz I think I look cool Being alone sucks but I like it Here it is... the new fandom name...\n\nhttps://t.co/iP21GY1BcV I guess today’s video is kinda of a big announcement Happy Tuesday Fandom name... taking suggestions \nLmk I’m so indecisive sometimes I don’t think I’ve ever been this cold in my life gray and I are so dumb im smh at us:/ Hey good vibes I missed u! Happy day &amp; happy night I’m never waking up after Grayson again. He beat the piss out of me with a pillow this morning to wake me up I told Grayson I didn’t wanna shave my face and he said it looked bad and I said idc and he grabbed a buzzer and shaved my face I feel ehh I think it’s the weather Not one article of clothing on Grayson’s body is his. He steals all my shit New video up of old videos but it’s New we made a new videos but watching the \n\nIt’ll make more sense when u watch it \n\nhttps://t.co/X9QREwMipS 😂 New vidina couple mins I just woke up and found out about it being Tuesday. @GraysonDolan wake up we have to make a video If you’re in a slump something great/unexpected is about to pull you out of it. I don’t make promises I can’t keep Never trusted the universe more than I do right now I see a bunch of you with the DT beanies on in my timeline so I put my on so you could think I’m cool and maybe be my friend or something I love tattoos Sometimes I’m like maybe I should grow my hair out then I’m like no i def shouldn’t then I’m like maybe I should or maybe not idk I just said lmao out loud in real life by accident. I hate myself I cringed so hard I’m thinking too much.. ok now I’m thinking about thinking too much Ok I’m going in the hot tub Holy cute https://t.co/mMtakSwVY2 Wtf are you talking about? https://t.co/Ah7VeGIDQt Our most requested video of all time is up! \n\nhttps://t.co/PcPExPTe03\n\nwe figure skated and it didn’t go so well Definitely not orange https://t.co/BIO7NzvdK3 I’ve been pretty bored lately tomorrow’s Tuesday though Grayson just called me and made me go all the way outside because his motorcycle wasn’t starting up and he didn’t know why... I get out there and HE DIDNT HAVE THE KEY IN WTF. Idk if I get mad about this or feel bad for him idk Just ate way too much ice cream I was driving behind a car and because of how slow the car was moving I immediately thought it was a grandma. So I pulled up next to the car at the red light ready to finesse an old lady’s number, but it was just Grayson... :/ Grayson drives soo SLOW Ready for it to be warm out... or maybe I’ll just go somewhere where it is 🤨 Somewhere FAR very soon🤔 I just took a nap and Grayson rearranged our whole room?! I’m in my bed on the other side of the room rn wtf when did I tell him this was okay vids up:) \n\nhttps://t.co/TPBsohtRT4\n\nThank you all. We did some random giveaways and surprises in this video🤔 Hey guys, thank u all for your supports and being understanding.\nThere WILL be a video today, so...... happy Tuesday😊 I’ve never been into glorifying a sub count b/c it doesn’t make you better than anyone else, but I am beyond thankful that 5 million people consider having me as part of their lives. I respect you all so much- wish I could hang with u all at some point in my life u guys are cool Just did the craziest shit I’ve ever done in my life Guys it’s up!!\n\nhttps://t.co/mnMZQCRkJg\n\nWe’ve been waiting to make a vid like this for the longest time. We had a lot of fun with it hope you like it!:) today’s vid is a special one If you believe people are less than you do to their skin color, ethnic background, OR HOW THEY WERE BORN, please unfollow me, you are not welcomed here. For the rest of you, love you and continue to lift each other up. We’re are all human 💙 I’ve seen posts stating I have been avoiding commenting on this issue.. which is false. If I see something like this I will address it immediately. Just because I’m not on my phone all day, doesn’t mean I’m running away from an issue that needs to be resolved Hey guys. I’m seeing a lot of discussion about racism in my notifications. Also seeing some false accusations about myself for some reason.. please know that racism is something that I will never tolerate. It’s disgusting and I can’t believe it still exists. My dad came out to cali today glad he was able to make it out here:) Gray and I are planning on going somewhere very far soon ✈️🤔 We’re all the same I have to pee so bad and Grayson’s driving so slow AHHHH get me tfo Grayson is such a little bitch with scary movies no way we’re identical I need some new pants Excited for tomorrow😊 It’s up! Bloopers 2017. \n\nhttps://t.co/yOdmzcPxui Uploading now! The video should be up very soon I’m going to speak up and use my voice from now on. I’m tired of people steering this generation in the wrong direction. Not at all saying that I control an entire genertation, but with the gift of this platform I’ve been given, it’s the least I can do. The horrible measures people will go to in order to have content to stay relevant is absolutely disgusting. Being blinded by your ego so much so that thinking it is okay to make insensitive remarks about suicide, and broadcasting it for millions of CHILDREN to see is sickening. I’m in disbelief right now 2017 actually kinda sucked in the beginning but your constant support def helped turn it around for me so thank u for that :) let’s all have a great 2018 Happy NEW yeaR my resolution is to idk Can’t go into 2018 without a 2017 DT blooper reel? Grayson ditched me and went snowboarding today. He’s not a caring brother like he portrays himself to be online! Exposed! Can’t wait to feel 100% this is so boring New video up! \n\nStill can’t believe Grayson did this :,)\n\nhttps://t.co/CrmPevCAww Just realized it’s Tuesday the videos gonna be up just a little late I just took like 5 consecutive naps with only a 3 minute break in between each one. What day is it?! Someone made my 3 yr old cousin wake me up by calling me e-tee-wee-tee who tf has done this 💚❤️💚❤️💚❤️ https://t.co/VrenZwY1Rl MERRY CHRISTMAS 💚❤️ Merry Christmas Eve from my bed that I haven’t left for a week Grayson just surprised me with the gift of my dreams... TOO NICE DON’T DO THAT TO ME BRO😭 HE’S LOOKING UP GIFT WRAPPING TUTORIALS He accidentally just wrapped his foot in wrapping paper ... Trying to watch Grayson wrap a Christmas gift rn and my eyes are burning out of their sockets this is so painful I’m taller than Grayson for the first time in my life rn I’m confused HAHAHAHAHHAHAHAHA https://t.co/acfrhPilCZ Holy shit my voice I sound like a toad Thanks for making all my days better :) I’m dead this is amazing https://t.co/a0DgH2A1H5 WARNING ⚠️ : \na new merch item has appeared... dropping sometime this week🤔 About to get surgery I might have to be boring for a little while 🙄 AHHHHHH ITS UP \n\nhttps://t.co/Icl039WkDb\n\nWatch until the end it gets intense 😳 This video is gonna be up just a couple minutes late lololololol im so weird at night Hey just want to say I appreciate your existence. Ik we all didn’t come here on purpose but I’m glad we’re all here together this is cool ily I’m being so serious right now tomorrow’s video is insane First day of being an adult I made Christmas decorations using beads Thank you guys for all the birthday wishes. Made me smile. Thank you Happy 81st @GraysonDolan Couple more hours and I’m officially an adult wtf Yo I’m about to follow a bunch of people retweet this and I’ll follow you! Wow there’s 5 million of u here now I’m gonna follow a bunch of you at 5 mil 😯 Next video consequence is BY FAR the WORST one yet😭 We’re finding out something that’s been a mystery for nearly 18 years... Thinking too much lately Good thing I remembered Grayson’s birthday pickles this year 🙌🏻 I got Grayson good. \n\nhttps://t.co/cBFItOpnGx\n\nOne like = one good I just asked someone at a store if they could help me find something at the store but turns out she didn’t work at the store. So awkward I really screw myself over sometimes I got Grayson good... just a little birthday surprise😈 A little kid just threw a snowball at our car It’s SNOWINNG❄️ Happy birthday @NICKIMINAJ 😊 Next video is our last video as 17 year olds 😶 New profile picture by Bryant and my header is a photo I took of the moon haha I have a typo in my bio? https://t.co/0J60zMH3TX I need a new layout🤔 Been listening to lil peep for a year now but for the past couple weeks been listening everyday.. so terrible to see him go at such a young age. truly one of the most talented artist. U ever just think... what tf am I doing? New video is up! sooo I saw some tweets requesting Cameron dares ethan and Grayson soooo... https://t.co/OMATIk1oSZ If you feel stuck a new opportunity is about to present itself. Keep yourself busy in the mean time and work on improving You guys look amazing okay We did ourselves dirty.. you’ll see tomorrow We’re getting a Christmas tree and Grayson won’t let me cut it down.. I hope it falls on him I really should have. https://t.co/6cKKKifHU8 This little kid just whispered to his mom “that kid is scary” and pointed at me.. wtf did I do My aux just broke in my car and I thought it was too quiet so I tried to have a conversation with myself but he didn’t want to talk🤨 RT @GraysonDolan: No shave November before and after https://t.co/OFjU8N4A2N I embarrasse myself at least 6 times a day today was a good day only 5 Movember it’s been real I got a green mustache I kinda feel like a green mustache man now https://t.co/VlD3UE22Uw 🍍🍕🐢 I just went to the store and everyone was looking at me so weird I was like wtf then I remembered I have a red beard and a green mustache so It all makes sense now Grayson tried to shave today.. what a poser I️ look ridiculous... new video\n\nhttps://t.co/hBRQJgvipT I’m hiding until the video comes out... It will help me explain myself Idk how Tuesday selfie became a thing but it’s definitely a thing and I def like It Ok me and Grayson did the dumb thing we look like idiots you’ll see Tuesday 😶 People play games like they’re gonna live forever wtf just talk to someone if you want to Grayson and I might do something that could be really dumb and film it Just decorated tf out of my house with gray:) Grayson is so dumb sometimes It hurts 🙄 I’m kinda almost 18 this is weird IT’S BLACK FRIDAY SO LIMITED EDITION HOLIDAY MERCH AVAILABLE AT https://t.co/9VLFviADW1 I’m gonna wear these everyday now to get in the spirit if u think I’m joking ur wrong Trying to figure out the sold out merch situation... but we are releasing holiday merch today😮😬 Happy thanksgiving😊 have a good day with your family/friends My mom just pulled up a photo of me and told me I look like a bicycle seat i wish I was lying Tomorrow? https://t.co/2PLBND1a87 This week’s videeeeeoooooo up\n\nSome say this is a good video \n\nhttps://t.co/EsZN5Tc2QV 😂😭 If someone takes advantage of you because you’re a nice person, don’t let that change you. Continue to be a good person. It’s still good to be a good person even though it’s hard to believe with the way people can treat you sometimes. Wait wasn’t It just Tuesday last week? we just filmed a vidoe Sorry I’ve been so inactive it’s Grayson’s fault! I’m gonna look so weird when I shave wtf I got bored so I got a face mask then looked in the mirror and got scared cuz I forgot I had It on my face.. what has my life come to? Hahaha that’s me and me in the thumbnail😂😭 https://t.co/rS3fv76hAu I’m back I told sick ethan gtfo Grayson is dancing rn. Very stiff, needs work. RT @goodolanvibes: @GraysonDolan tuesday just became TEAsday\nft the doLONDON twins.\n☕️\nwarning: the tea is scorching hot!!\n⬇️⬇️\nhttps://t.c… NEW VID UP\n\nWe were in London so we spilled some tea about each other 🐸☕️\n\nhttps://t.co/lxWOOBFPg0 Grayson just left the house and as he was shutting the door he looked at me and said “peace out sausage link”.... ?????? Happy Tuesday I will crawl out of bed to upload the video today I’m so sick and in bed grayson better not make us look bad on TV today... It’s also important to show respect today on Remembrance Day.We’re sorry we can’t do the meet up. London we love you.We will make it up to u We really want to meet you all but i would feel so awful and selfish if someone were to get hurt. Everyone’s safety is most important Hey idk if u know or not but we dropped new merch today and u can get it at https://t.co/9VLFviADW1 if you want :) I’m kinda screaming too plz tweet me a photo in it when you get it! https://t.co/Wva6cdz9CZ AHHHH I hope u like everything :) https://t.co/XTLiRcYUka YO MERCH DROPS TODAY WHAT TF On my way London Holy piss rocks I just took a chunk out of my tongue AHHH Sign up if u wanna be the first to hear about new merch! Grayson just signed up he can’t wait for the news https://t.co/9VLFviADW1 Don’t stress about things you can’t control Says a grayson account ☕️ https://t.co/CPfaZtuwQh ITS UP!\n\nWe get makeovers 😳\n\nhttps://t.co/v7VkrtsZGd 5 MINUTES! Or maybe a little longer but ya 5 minutes I’m pretty sure it’s Tuesday Dolan Twins dot com? 🤔 btw I’ve been inactive because I’ve been with my family. Hug your family and tell them you love them. It’s a blessing to have them here. People try to drag you down because they want company in their misery. Keep your head up and let them be miserable People don’t want you to be happy when they aren’t happy... smile at them:) Disappointed by all the negativity lately... people will say anything for a reaction. Don’t stoop.. rise above. NEW VIDEO UP! I️ hacked Grayson’s iPhone X 😏\n\nhttps://t.co/WlbJA3NcV2 Grayson and I️ just had a full fake conversation about how I’m gonna be next years soup master Bonus video uhhhhh..... today.?? I just unlocked Grayson’s iphone x using my face I wish some people would take life less seriously and be less judgemental Not shaving my face this whole month and neither is Grayson. If he does I will attach chip clips to his nipples while he is sleeping Ok I’m ready for Christmas I hate when I’m joking and people thinking I’m being serious it’s so awkward My eye liner won’t come off I look like a true emo rn Figured out what I’m being 🐺 What should I be for Halloween? Hahaha a little late Ik RT @Graysonspeego: SCARING EACHOTHER CHALLENGE\nNot gonna lie i got scared👻\n\nhttps://t.co/XRB8uHJpuF\n\n#DolanTwinsNewVideo @GraysonDolan @Eth… NEW VIDEO UP! \n\nscariest most intense video yet 😳😵\n\nSome special guests???!!!\n\nhttps://t.co/ydnYYM1qEj\n\nHappy halloween👻 5 MINS UNTIL MOST INTENSE VIDEO HAPPY HALLOWEEN HAPPY TUESDAY TODAYS BOUTA BE CRAZY U DONT EVEN KNOW FAV HOLLIDAY &amp; DAY OF THE WEEK There are also some surprise special guests in tomorrow’s video 😮 Gray and I are trying to figure out how we’re gonna 1 Up last years Halloween costumes 🤔 Not kidding Tuesday’s vid is prob the most legitimate thing I’ve ever done with my life When Halloween is on a Tuesday you have to be extra af and film the most intense video you’ve ever filmed in ur life The haunted house is scary and it’s not supposed to be scary yet 😰 Just slept for a year that felt so good Today was very eventful muy contento Gray and I have been watching jersey shore all morning... good times WOAH WTF!!?? Open this!! https://t.co/LClym8mHQj I love the east coast Trying to find someone to have a convo with that will text me more than once in a row The water in Hawaii was the best liquid I have submerged myself in thus far in life https://t.co/N7B8Nr8vRY Well🙄 https://t.co/ONTv7JxaKQ He can explain😭 https://t.co/RQTq3D0ZhY NEW VIDEO\n\nthis was pretty awk to upload😭😳\n\nhttps://t.co/Tq3YRwQ1rb\n\n#DolanTwinsNewVideo TEN MINUTES😳😳😳😳😳 Today’s video is prob our most scandalous? video yet ... not even exaggerating I love how we have inside jokes together I’ll say things in public that only we would understand and people look at me like wtf Tomorrow’s Tuesday and we filmed a very awkward video......... Just swam next to a sea turtle Feeling very thankful right now. Love you all. I’m really trying to get a Snapchat with the chicken but they all keep running away from me wtf U know when u remember something embarrassing that you’ve done and IT MAKES U SO AWKWARD AND U DON’T KNOW WHAT TO DO WITH YOURSELF Hey I’m in Hawaii My favorite color is clear 💜 **scrolling on explore page on IG**\n\n**scrolls past photo of random girl**\n\nMy grandma- is that your girlfriend??? WOO https://t.co/uYo11MidTg NEW VIDEO UP! \n\nWe give each other rlly bad spray tans..🙄\n\nhttps://t.co/yfGV01fcfh\n\n#DolanTwinsNewVideo 🤘🏻 AHHHH 3 minutes wait tomorrow’s Tuesday????! Not me though I’m awkward and it sucks Some people are good at being awkward. Idk it just works for them I like deep convos they’re productive Do u ever wonder what the cavemen would think about the things we stress about nowadays? Am I the only person who can’t wake up from alarm clocks?I’ve never met anyone else with the same issue I’m feeling very alone in this world HEY The way u just made eye contact with me was spitious @GraysonDolan Yes it is: something causing sudden urge to spit https://t.co/ZZvba9MQND I’m making Grayson go fetch me food rn. He’s obeying as I expected. He wouldn’t dare talk back to me or ask any questions. ITS up! Bob and Rob made us make the video😭\n\nhttps://t.co/FX8fxlVEQF\n\n#DolanTwinsNewVideo 🤘🏻 We watched bob and rob season 3.... and I guess you will too tomorrow.... Woah. 💙 https://t.co/QBu4iEwqQa Turtle man wanted to be on tv 🐢 https://t.co/LkUjEqjQHC Bob and Rob season 3 is haunting me I fell on purpose!!.... 🙄 It’s our first day on TV today with @MTV !! plz watch cuz the only person who told me they’re gonna watch so far is my grandma.. TRL 3:30pm😝 TOMORROW is going to be CRAYZY I’m..... ExCiTeD?! Noooo not happening those are being destroyed https://t.co/7k63QwzTpy Oh no..... I found something... NEW VIDEO! \n\nLoser gets their TONGUE PIERCED👅\n💉😳\n\nhttps://t.co/GA15Wy1jN4\n\n#DolanTwinsNewVideo 👍🏻 RT @TRL: 😵💀☠️  this picture is not a big deal like it's fine calm down 😵💀☠️ https://t.co/hgArGwvyTa Tomorrow’s video has the gnarliest consequence in DT history 😳 Wow I’m a happy guy right now Extremely heartbreaking what happened in Vegas. I’m at a loss of words honestly. Praying for peace and those affected 💙 Gray and I built a toy car for our lil cousin to ride in and it took us like 8 hours grayson is so bad with directions He saw me and pissed his pants it’s all over the seat now and WE SHARE THIS CAR ugh backfire! I’m in the back seat of our truck and Gray is driving. I just put a gorilla mask on and he hasn’t noticed yet. I’ll let u know what happens Watching my favorite movie of all time rn Next video is crazy I promise 🙄 you’ll see😳 So much in the works for you all:) Thank u everyone who voted for gray and I😊 Love u guys for real u guys are the best and everyone knows it new video is finally UP!\n\nI rlly like this one :)\n\nhttps://t.co/CJjiSO2cEz\n\n#DolanTwinsNewVideo 😬 Anyway happy tuesday this will be a good one😊 Gray and I are sitting on opposite sides of this plane texting each other dumb shit crying laughing wtf is wrong with us. We’re delirious Very ready to be back on the east coast And probably a lot of other parts of the world I went on tour I should know these things sorry I’m bad at geography Shoutout Australia for having Tuesday on American Monday. Now there are 2 Tuesday selfie days haha Finishing touches being made to tomorrow’s vid and it loooooooks crazy. Sorry I keep tweeting bout the vid I’m just rlly excited to show u:) HEY TOMORROWS VIDEOB IS ONE OF MY FAVES AMD I CAMT WAIT TO SHOW U THO Videos up! Just explaining some stuff.. not sad or dramatic haha hopefully?! Just an update\n\nhttps://t.co/cINcZuNFIZ Today’s vid isn’t the vid we planned on putting out next but we needed to say some stuff so we filmed that and it’s going up today Hey we’re dropping an explanation video tomorrow about some stuff.. GRAY AND I ARE GONNA BE ON TV ON MTV @TRL !!!!! So excited to be working with MTV on this AHHH. Stay tuned u guys are gonna like this😝 The announcement is not that I’m pregnant that’s just the warm up announcement I JUST TURNED MY SHOWER ON AND THE SHOWER HEAD HISSED AT ME WTF I hissed back at it out of pure reflex Big announcement today😬 I'm really excited to show u all our next vid 😬😬😬😬 I broke 2 phones this week I’m definitely cursed I'm actually rlly ready for fall and Halloween and stuff Having a real good day😆 hey rt this and I will follow u Following a bunch of people in 5..4..3..2..1 Hey might as well do a follow spree at 4m Well don't forget that I'm extra it might not be that bad https://t.co/8E1dCxTsaK RT @zobee111: shocked af when I saw the title 😱\nhttps://t.co/YaJpkgbJxI\nLIKE &amp; SUBSCRIBE 👍❤️\n#DolanTwinsNewVideo\n @EthanDolan @GraysonDolan… New vid! Watch me give birth!😭\n\nhttps://t.co/Qzv6J8rAI2\n\n#DolanTwinsNewVideo Bout time for Tuesday I'm excited when vibes are so good they make u say \"ugh\" but in a good way. u kno what I mean? Big announcement coming soon, sooner than you think. Watch out for an announcement soon. Because soon there will be an announcement Tuesday's video will hopefully make up for it😈 also we're making another adventure vid😬 Hey... I'm sorry but gray and I aren't gonna be able to put a bonus video up this week. stuff got crazy with traveling. Hope U understand places like this make this planet look like an actual planet / I was so scared not gonna lie https://t.co/hwWRw67S35 🐢 I needed this road trip.. seeing new stuff is great I needed to gtfo Me- Gray how are you gonna propose to ur wife?\n\n\"I'm gonna make a flipagram and the last one will say will u marry me\" If I see a random with a selfie stick I always have to hop in Facial recognition on new iPhone X.... looks like I'm gonna be needing a passcode .....  @GraysonDolan New video is in fact up \n\nWe explain what our tattoos mean😬\n\nhttps://t.co/Gk0F7qA0yH\n\n#DolanTwinNewVideo FIFTEEN MINUTES then we drop a video revealing our tattoos and what they mean to us shit I just gave it away Road triiiiiippppp💁🏼 happy Tuesday :) RT @iamdolangarner: This video was probably the weirdest one you've made yet😂 @GraysonDolan @EthanDolan x1\n\n#DolanTwinsNewVideo https://t.c… Grayson is a level 6 dumb ass there are only 6 levels NEW VIDEO UP\n\nIt gets a little steamy I think \n\nhttps://t.co/RoqJp1LH7w YO new vid tomorrow 😊 and the next day 😊 Really happy @ life right now. Glad I can honestly say that hell yeah Happy birthday to one of the realest people I know @BryantEslava love u bro💙 Great night, very nice Thank g I have Grayson I'd be so much more awkward without him around My insides always have a party every time I get in bed. I'm very excited but will never show it on the outside Officially made a plan to travel somewhere far very soon 🙌🏻 Now gray got a grill to cook burgers... when did he turn 46? Grayson's been talking about getting a monkey, pig and goat all day today.. wtf Grayson is so lazy someone smack him with me ITS UP! \n\nI can't believe we revealed these videos...😳\n\nhttps://t.co/W9HLyWU88q\n\n#DolanTwinsNewVideo 👍🏻🤘🏻 Ok word video donneeeeee ur gonna like this one! Just realized tomorrow's Tuesday... brb gotta make a vid I swear u guys invent new terms every other day I love how u guys can here me out and give me honest feedback about stuff.. y'all are my bffs hahahaha for real tho Check this out if you can. Real thoughts, 100% honesty, how we really feel. Very glad I was finally able to say all that was said in this. https://t.co/VQq1o2rZMq Gray and I actually talk about how funny you guys are on a daily basis La is really not my place I need nature Ha ditched https://t.co/6q6zoh4Czz I need to go somewhere I've never been before 😭😭 https://t.co/Mc0IjS6iZW NEW  VIDEO\n\nwe did something really dumb...\n\nhttps://t.co/eQ8tVDAasQ😳😭 I can never sleep.... but I can make videos that I'm going to post tomorrow so at least there's that I just saw a real cute baby and said \"ahhh there's a baby\" and he got mad and said \"I'm not a baby\" I really didn't think he could talk yet I think I'm tanner than Grayson for once in my life 😭🙌🏻 Looks thru drafts** \n\"Wow I've grown so much:,)\" 🏃🏻 https://t.co/fnYd913VEL Hi I need a jet pack My tweet replies get weirder and weirder day by day I swear Grayson is funny but also really annoying get him away from me immediately I just got really inspired for some reason 😭😭😭 so embarrassing https://t.co/eSlFL1O59Z VIDEO IS UP\n\nGray and I have children...\n\nhttps://t.co/YdP1hevCoJ\n\n#DolanTwinsNewVideo 🤘🏻😭 Just a couple more minutes then we're dads! HOLY TUESDAYMORROW 🤘🏻💙🤘🏻 https://t.co/uCZv1Ogh02 We panicked when the flash went off https://t.co/xijTAXBRe3 Grayson shaved his legs... like completely shaved everything gone. He was so excited to show me. Idk what his deal is Drama is cheap Gray always gets way cooler clothes than me im jealous Gray is the man. Really. Love that guy I have stolen your old @. now I will blackmail you for life @MrEthansMinion Now you will truly do as I say @MrEthansMinion TODAYS VIDEO IS UP! \n\nu guys have some weird account names...\n\nhttps://t.co/f6BDydGcSq U might be in tomorrow's vid😬 I've been inactive I know... I was taking care of a baby all day 😭 I just read the funniest dm I've ever read in my life holy piss I'm pissing I can see my cheesy mustache when I look down at my nose... I feel like a man hahahaha yay https://t.co/JDBNx34ALg NEW VIDEO! \n\nTypes of YouTubers😳\n\nhttps://t.co/bIVeToWCWW\n\n#DolanTwinsNewVideo 🤘🏻👍🏻 Can't wait for the solar eclipse tomorrow😬 got my glasses ready😎 No joke, Tuesday's vid is probably my new favorite Grayson and I bought a bag of candy to eat during our brainstorming sesh. Didn't come up with a video idea but still ate a full bag of candy Ooooohh btw new \"types of\" video coming out Tuesday 😬 Gray actually just seriously said \"oh you know what we should order today? A bike for 2. We can bike around so good on that.\" He's losing it I wish it was socially acceptable to be nocturnal U made my day YNEW VIDEO UPPPPPP!\n\nCrazy warehouse obstacle course haha pretty intense tbh \n\nhttps://t.co/4luW2IKrSV\n\n😂😭 I need to start traveling more Tomorrow's video and Tuesday's video both made me laugh real hard I think u guys r gonna like these 😬 every time I'm talking about something like VERY random I open up my phone &amp; see something related to what I'm talking bout immediately Whoooooaaaa https://t.co/wNMmmlpm06 I'm feeling kinda sick today... gray if u see this can u carry me to the kitchen I'm trying to get some cereal Pursuit of happiness will never not be the greatest song of all time Every time I'm about to do something stupid I make Grayson do it first to see if it's a bad idea or not ITS UP!!!\n\npeep my intro 😏\n\nhttps://t.co/XCMZCg70GK\n\n#DolanTwinsNewVideo 👍🏻🤘🏻 This Tuesday is gonna be somewhat legendary Just finished a 6 hour video shoot... UNDERWEAR SKATE SESH NOW I'm also very appreciative of the love &amp; support you show one another. Always be there for each other and continue to set the good example Wow you guys are really the best. I actually mean that. From the heart. Y'all changed my life and make me smile everyday Thank u guys for everything:) NEW BIDEO UP\n\nWas pretty intense tbh and ft @Caspar_Lee also\n\nhttps://t.co/VrCcZkx8dg\n\n👍🏻🤘🏻 Scratch that just filmed 2 crazy af vids Just filmed a CRAZY vid holy piss I just accidentally did the turtle man face Just got some spontaneous tattoos Back in California gray and I have the good vibes going :) I did a face mask thing and my face is burning The sky is pink rn I like it 😰 https://t.co/pD7e5jq92O In this NEW VIDEO Gray and I were spies and made fake fan accounts to talk to u guys 😳\n\nhttps://t.co/TDN52z81NH\n\n#DolansTwinNewVideo You might be in tomorrow's video and you don't even know😈 I just remembered tomorrow's Tuesday NEW VIDEO IS FINALLY OUT \n\ndid something different this week \n\nhttps://t.co/faRyBDQ0Zd\n\n🤘🏻👍🏻 Uhhhh uhhhh guys don't spank me but the video is actually coming out tomorrow. just wanna make it the best it can be HAHAHAHAHAHAHAHAHA😈 Soo the new video is actually gonna be here tomorrow.. I was rlly excited too post it but forgot it wouldn't be possible until tomorrow my b New video coming tomorrow😬 it's very different from what we normally do but I really like it Grayson stepped on my foot 😑 Reeeeaaaalllly hype about the clips we got for our next vid😈 Sometimes I scream when I get in bed cuz I'm excited to be in bed 😂😂😭😭😭😭😭 https://t.co/7jtWg6K8Gq So yeah... the bob and rob vids are now on the internet... great \n\nNEW VID \n\nhttps://t.co/bpKhpOULzE\n\n#DolansTwinNewVideo 😭😭 It's gonna be really hard to push that upload button I really hate Bob and Rob you don't understand I've NEVER cringed so hard Make sure you're all having fun everyday of your lives no joke sounds rlly simple like duh but just make sure ok hahaha I really wish I could get around to dming every single one of you. I truly wanna just have a conversation with you all I feel like it hasn't been tuesday in a while Our drone just got possessed and crashed itself into a tree😑 New profile pic https://t.co/BUz5n4ADfN I'm honestly scarred. We watched bob and rob and I feel like everything I do is cringe now Happy birthday sis💙 ur 20 wtf RT @GraysonDolan: Oh shit @EthanDolan https://t.co/nJ8MiGh4eb Grayson and I found something....... Also just got a camera we've always wanted... gonna make a fun ass video with it I'm honestly in a way better frame of mind now. Not just saying that. Still learning more about myself but that's how it should be u kno Been out adventuring in the middle of nowhere..also got some photos in the process. Probably my favorite shoot I rly wanna show u these pics Thank u for the love 💙 Hey guys had some stuff we felt we should tell you about \n\nhttps://t.co/nxCkfnHcGs Hey... we're gonna put a video up tomorrow explaining everything. Love u guys Prob not going to be able to get a video up sorry guys... just had hand surgery today and recovering. I'll be okay all good I'm done faking it I'm honestly at a really shitty place mentally 4 MIL ON YOUTUBE WTF?! thanks for the love I love u I need to chill tf out. I stress myself out so much sometimes wtf is my deal I got poison ivy can someone itch me plz jk that would weird right yeah uh 💙 https://t.co/6ADTsMrB9l New video.. we say some stuff we've been wanting to say for a while in it sooo yeah\n\nhttps://t.co/FvJ5FAH2UC\n\n#DolansTwinsNewVideo Been working on this video for 3 straight days and just finished the edit. I'm really proud of this one hope you all like it:) You guys are so cool tbh. U never fail to amaze me We really wanted to fill you guys in on things that we feel are important... so we do that in tomorrow's video Our next video is going to be a different type of video I just typed grayson and it auto corrected to crayon New video is upppppp\n\nWrote some weiiirrrdddd fan-fic about gray😳\n\nhttps://t.co/TrQN6ZRH6c Yooooooooooo video today Thank you all for all your positivity, it really saves me sometimes Sometimes crazy shxt happens and you just have to look at it as a lesson I need to get better at shaving my face I always let it go for too long I accidentally kicked a rock now my foot hurts Stop snoring @GraysonDolan You guys got us nominated for 4 TCA's wtf!'\n#ChoiceMaleWebstar \n#ChoiceYouTuber \n#ChoiceComedyWebstar \n#ChoiceComedian \nWHAAAAT thank you 😊 I love JERSEY Thanks for always being there for gray and I. Haven't said thank you in way too long I DID NOT TWEET THIS. that felt so good to say https://t.co/6apLsooKCB Gray went into this store and left me in that car and It's toooooooo hot in here he needs to get back rn im gonna give him the sweatiest hug 😭😭😭😭 https://t.co/RnKJWlMweK It was unbearable this week. These past 2 days have been sooo uncomfy from the vid😭 https://t.co/MXnjDVuk8Z Video is up\n\nPlease watch I have explaining to do \n\nhttps://t.co/AukvCBPmje\n\n#DolansTwinNewVideo Finally Tuesday Btw I just graduated high school &amp; got my diploma haha a year early too If you watch the post-outro-blooper every week you're a real one. Just met a very sweet person who put me in a very good mood:) I'm gonna bite that tattoo on your shoulder Being surrounded by nature in the middle of nowhere is really clearing my mind and I like it it's good real good And maybe google boobies Gray and I have been constructing a tunnel in the forest nearly all day long. When it's complete we will secretly watch slime videos there So yea new vid up\n\nWARNING: it is awkward \n\nhttps://t.co/RkYQV4Dt7D\n\n😳😳 Actually second guessed uploading the video cuz I thought it went a little too hard so yeah it's one of those 😳 it'll be up soon😬 Honestly just live how you want to live if someone wants you to do something with YOUR life but you don't wanna do it just don't do it Tomorrow's vid is coming out tomorrow I had a dream that gray kicked me out the house cuz I had more followers than him on twitter I'm not even joking wtf hahah I meant to say what's up earlier but I fell asleep in the grass I'm up tho hi Just got an ice cream cone AND a milkshake cuz i couldn't decide I got a runny nose and it's really annoying Hi I'm here Top 8 Scariest moments of my life https://t.co/konuVJzy8m 💀💀💀💀😂😭 https://t.co/9kyOjx3HrF TUESDAYS VID IS UP!\n\nGray and I get real close \n\nhttps://t.co/tTQEZBi0pz\n\n#DolansTwinNewVideo 🤘🏻🤘🏻 And HAPPY Tuesday HAPPY 4th! tomorrow's TUESDAY I like being far away from civilization lol On a boat YEEWWWW VIDEO\n\nFind out why grayson is bald in this extreme mystery box challenge😳😂\n\nhttps://t.co/O2yOs9lTTt\n\n#DolanTwinsNewVideo 🤘🏻 New vid coming later today😬 We're watching old videos from when we were 5 yrs old on Christmas and the only thing grayson asked for that year was an egg HAHAHA Actually in tears with gray watching our next video😂 not being cocky we're just idiots and it's funny to watch how stupid we are *Walks in elevator*\n\nGrayson- \" technology is so crazy.. imagine George Washington walked up in this bitch.. he'd be like wtf\" You guys inspire me daily. Hello I have awaken from beneath the foam pit sorry for being inactive it's dark and scary down there and I couldn't see shxt Gray and I just broke our favorite camera... is there a curse going around? I need to see a wizard The warehouse sign is fixed! No more daily spankings Hahaha gray and I filmed such a terrible video yesterday no way we're posting that ok NEXT RETWEET this here tweet for a FOLLOW or DM dog Follow spree time peep my next tweet😬 RT @rivetingdolan: NEW VID IS UPP\n\n https://t.co/Loxp3KBlZz\n\nethan is a weirdo \n\n#DolanTwinsNewVideo \n\n@EthanDolan   @GraysonDolan follow&amp;… NO THE VIDEO- :/ plz watch I promise just watch https://t.co/Ps0pxWfCbQ Newewww video!\n\nI get dared and it also explains why I love being called daddy 😳😭\n\nhttps://t.co/njwYJdNioa\n\n#DolanTwinsNewVideo 🤘🏻 When gray hits 3 mil on here (which will probably be tomorrow he's a little slow with these things) we're gonna do a follow spree together I love all of you even if you don't follow me I love you even if u despise me I kinda love you Wait what 3 mil of you!!!!!???? HI! Almost follow spree time 😮 About to drive around in my underwear   No one will ever know😈 I can't wait for Tuesday cuz I need to tell u all something.. I feel cool when I pick objects up off the ground with my bare feet Just plz wait till Tuesday 😑😑😑😑😑😑 I love it when you call me daddy I just ripped Grayson's eye brow hairs out with my fingers So yeah at 3 mil I'm gonna do a lil follow spree😊 .. big follow spree actually This was my idea stop taking creds https://t.co/95bUrzhi7f Good people make good people better people. I would have a real hard time being happy in life if it wasn't for u guys Y'all are cool Things are getting out of hand, however I will admit this was a pretty good moment for us https://t.co/MXqVYBtQAR New videooo! We see how good we are at lying to our sibling basically.. and also telling the truth about some stuff😳 https://t.co/tvOT0AH2DZ new video todaaaay with a special guest lil guest action in the video we're posting today I know it was just a concert but it left me feeling very inspired. Ur the man @KidCudi Been surrounded by good ass people lately :) How come grayson always gets to choose where we go for lunch dates Oh I'm back in California btw Just took over the intercom in a grocery store my life is nearly complete THIS WEEKS VID UP\n\nWe busted all twins myths and conspiracies 😮\n\nhttps://t.co/ClVxfJ0c0C\n\n#DolansTwinNewVideo 🤘🏻 20 mins In lil kid mode today Can't wait to upload tuesdays vid. I really like this one 😬 My allergies are making my eyes so puffy I look like chameleon Grayson just jumped in this pond naked and try to capsize my boat Happy Father's Day if ur a dad I hate buying cards at the store cuz I look at the cheesiest ones and imagine giving them to who I'm getting the card for and cringe so hard New vid... GOT EM \nhttps://t.co/XDS29klgq5\nI pranked Grayson \nI got him \nI played a prank on my brother \nHe got pranked ✌🏻💙 Gray's salty cuz I got him pretttyyy gooood. New video tomorrow 😎😜 Ok ok... Shout out for shout out? @GraysonDolan Yeah talk about how I have more followers than you on twitter again it'll be the try not to cry challenge https://t.co/NwDFElD7DJ Guys we're not gonna do it dw... and to the lil guy who requested I'm sorry:/ plz don't unsub🙏🏻 A little kid told me I should make a full vid about all types of fidget spinners haha wtf is life I needed some jersey in my life so glad I'm back rn Saw 3 turtles today already Ur grandma was almost right... I sharted in this https://t.co/ogY9tHvF74 HAHAHA https://t.co/T87GnyDRZi TUESDAY VID IS UP!\n\nwe react to and try to RE-CREATE edits of us😂😭😭💀\n\nhttps://t.co/Io9NJzd4Uk\n\n#DolanTwinNewVideo 🤘🏻 Ooooooo some of u are in tomorrow's vid 😬 Tuesday\nTuesda\nTuesd \nTues \nTue\nTu\nT\nTo\nTom\nTomo\nTomor \nTomorr \nTomorro\nTomorrow I will never fail at eating a peanut butter and jelly sandwich Cmon guys it's fire don't lie to ursleves. \nlol why did we spend time making this wtf https://t.co/nnlZXlsIXr don't have to make someone feel smaller to be a bigger person The foam pit is magic or something I don't remember going in there but I somehow just woke up in there...?? Grayson just told me he's going to get really good at making rice pudding and that will be his specialty? Oh cmon man! Fine.. I'll follow you https://t.co/6Z791KmHrH New vid up with a surprises guests 😳😳 https://t.co/9syUW5oO9s 😂 I've watched tomorrow's video 5 times I'm not over it yet I just broke down a door like a fireman and busted a whole in the wall Editing... u'll like thi won i hope https://t.co/OIK8UJ482H Grayson just yelled from the bathroom \"yo I'm so hydrated my pee is blue!\"\n..... uhhhh I don't think that's uhhh Filming crazy stuff everyday 😝 I'm happy I read ur mind that's how we got the idea https://t.co/hIsdLvuGEs YOOO tuesdays vid is UP\n\nWe confess some dirty secrets😳\n\nhttps://t.co/QYobywwIuZ\n\n#DolanTwinsNewVideo Tuesday wtf is good Just found a very important package.. tomorrow's video will be able to happen now😅 OOOO new vid up! https://t.co/q5f2YWEohh 😮 Something is happening in like uhh 1 minute Laughed a lil too hard editing tomorrow's vid we're idiots haha Feeling motivated is like the best feeling of all time to me ... 1 .... year... since 4ou.. \n\nI was gonna add an emoji to this tweet but idk what emotion this is making me feel Every time I order food before Gray he orders the same thing as me and makes us look like FREAKS. we already look alike y he do us like that Just had a conversation is Spanish with a stranger using the Spanish speaking skills that I acquired while on tour. I'm proud of myself Flimingovideo Just saw 2 old ladies wearing tie-dyed shirts that said \"bitch number 1\" and \"bitch number 2\" on them wtf I have such an good vibe Grayson just told me that when he's a dad and senses his baby has to sh!t he's going to stick it on the toilet and potty train it at age 0 So yeah the pipes in our warehouse exploded and the place became a rain forest but hopefully it'll be fixed soon cuz uh I'm tryna make a vid HIS NIPPLES NOT MINE. GRAYSONS NIPPLES HAHAH he's so mad that I just tweeted that Grayson just said my nips are so hairy ugh Just ate shxt on my bike gray and I just got some bikes we're gonna ride around and have fun on them and stuff 😏 hahaha 🤘🏻💙 https://t.co/m919LnIoGE RT @_GrayAndE_: Ummm I'm shook?\n\n@GraysonDolan @EthanDolan \n\nI might cry😩\nObviously done\n\n#DolanTwinsNewVideo \n#AskEthanAndGrayson \n https:… AHHH ITS UP\n\n#AskEthanAndGrayson 3 with a BIG announcement \n\nhttps://t.co/XTqvM65BBZ\n\n:)))))))😳😖😟😭😂 Stayed up so it would officially be Tuesday. I think urs gonna like this ones Just filmed #AskEthanAndGrayson THREE. Craziest ask vid yet. I feel all sorts of stuff after filming that Every time I look in a mirror I yell \"WHO ARE YOU\" then punch the mirror and shatter it😑 gotta get used to this new haircut Wtf ethan get on Twitter Whoa these are gooooood😂 gonna be so hard to decide 😮 #AskEthanAndGrayson volume 3. Crazier questions... weirder answers. ASK AWAY! Told y'all I wasn't being extra Welllll yeah... new video up! Gray cut all my hair off pretty much😳\nhttps://t.co/gffHeT0C7y In about an hour the vids gonna go up and y'all are gonna be like \"wtf\" Will a video tomorrow get you to believe me? https://t.co/ifHTCLleWZ GRAYSON just cut my hair off. like all of it what am I thinking ... You guys r very talented and make me very happy damn IM PUTTING BUTTER IN MY HAIR This is my hair.. and there is a gum-like substance in it.. help plz https://t.co/ppn6zbvZ8R Just failed so hard at making a video and now my hair might have to come off New vid up! \n\nThanks for tweeting me the nast photos of gray the other day😂\n\nhttps://t.co/gcW4Og1Huf Gray and I are gonna upload today.. hopefully we can make some of u smile. I laughed a lot while filming and editing this one I know there's nothing I can say to fix anything..but let's all just spread positivity to make this world a better place. Love to Manchester Just saw what happened in Manchester. This world needs help. My thoughts and prayers are with everyone affected Ready for tuesday😊 Attempting to self customize my own car by myself... probably going to fail. Probably going to ruin the car... here we go😳 WOOOOOO :)))) Every time gray and I go to a store we always FORGET WHAT WE CAME FOR WTFF Just filmed a vid and laughed very hard in the process It's so easy to make me laugh ha Really good vibes today. Ugh my imposter Jason is out meeting people on my behalf again😒 https://t.co/Ykn7quSuQM Good morning \n\ngOoD mOrNiNg Purple \n\nI can't think of a caption https://t.co/gzHXMSZYuk Maybe some off guard meet and greet photos 😬😂 Anyone have any really nasty photos of gray? Hahahah Sry 4 promo but THE 4OU WEBSITE IS CLOSING so it is your last chance to get merch😧clothes that remind me of the greatest time in my lyf:,) Wow we're dumb (me and gray) Yo brain can u stop thinking so hard I'm trying to sleep Grayson now has more twitter followers than me... I'm going to cry myself to sleep I promise I'm not boring I'm just in a weird situation Ugh it sucks not being able to be active:/ I have an idea😏 idk if ur gonna like it tho https://t.co/TFXhlRqncA Goin out with gray and my dad tonight BOYS NIGHT💁‍♂️ Found out I popped my rib out of place.. the doctor told me I need to take it easy but the crazy vids must go on... I'll figure it out hahah Lolololol😂 https://t.co/WSuAyxb5la MEW VIDEO UP! \n\nhttps://t.co/8kSuJJ70do\n\n😬😬😬😳😳😳\n\n#DolanTwinsNewVideo 🤘🏻🤘🏻👍🏻 Tuesdayyyy this is gonna be a good one 🤘🏻 Uh oh Grayson's singing 😕 yo I appreciate you a lot. I really mean that. You guys are the only reason why I'm able to be happy most of the time Happy Mother's Day mom💙 if u see this get off my twitter plz:) Saturdays are great tbh New video😇\n\nGot em:) https://t.co/C6WgMgOqjD Update: it got worse https://t.co/eDEujtR9F1 Ok I need a pancake break been editing for some time now Just wanna say I love you all and I mean that. Also, you're worth it. You're all here for a reason So happy that worked HOLY Ooh we went somewhere amazing and took some crazy photos yesterday Just ate sh!t now I look like this on my face https://t.co/a9We6W6ktc The only reason I'm mad is cuz we didn't film it I just hit my face on the ground real hard. Why is my face and the ground in love Why do I have such a thing for being in the middle of nowhere? I'm a way happier person lately There's an infinite amount of things to experience on this planet. Go out and explore you won't regret it 😳😳 https://t.co/GaN1Yx81Rb Video is up!! 😳\n\nUhh here it is uhhh\n\nhttps://t.co/gcDDe0Vr7s\n\n#DolanTwinsNewVideo 🤘🏻🤘🏻 I just realized my dad and I have matching tattoos haha besties!! Wait tuesday is TOMORROW? I actually forgot for a second like we have a video and everything but I just had no clue wtf day it was haha This quote gonna get more favs then ur tweet watch.... plz help me with this one guys I'm trying to be cooler than gray here https://t.co/wnCBrLaDN3 Feeling very inspired... very motivated Value your energy. Don't waste it on bad people We uploaded a video today and we uhhh might have a special guest in it 😬\nhttps://t.co/vAphoNzfRN Grayson just grabbed me by the back of the neck and made me shave my face cuz I apprentaly looked \"scrap master\"??? Laughing so hard at this video we're uploading tomorrow haha... oh my b just spilled the beans Sorry it took me so long to notice idk where I was from 1773-1999 https://t.co/1E9PNQHjkW Subscribe and put our notifications on for our YouTube channel so u don't miss surprise vids. I'll also follow u if u tweet me screenshots:) How do we know who to follow? https://t.co/r7rSsFoQti Keep an eye out 👀 My hair is bored of not being a color I think The free food here was too healthy so I ordered pizza I just clipped hot glass why was that so satisfying Now.. one video on a random day of the week..... I know it might not be today.... but what if it is😏 I love how y'all are friends it makes me happy every1 get along life is great:) HA https://t.co/ul3JQAqbP9 It's UP! \n\nWe got real dumb on the zip line 😳\n\nhttps://t.co/juCMNJaTYb\n\n#DolanTwinsNewVideo 🤘🏻 The new vid is almost up it's being sloowwwwwwwww for some reaso Ohhh wait it's Tuesday isn't it I'm home grandma where u at i miss u JERSEEYYYYYY It's may... you know what that means TWO TIMES A WEEK I miss traveling I wanna like go places and stuff Lost all my earrings in the foam pit ... there is no difference between me and you. We are all human I love this https://t.co/9D7aBf1CyK I'm an idiot because it's comforting l. I'll never feel like and idiot if I'm too busy being one :) I just banged my face on a lamp right in the spot where a pimple is chillin at so it hurt 10X more than it should've AHHHHFUUUU good https://t.co/5hzP3zMIny we love making vids. Thank u guys for watching them every week honestly Sleep thru day (kinda not rlly) then we play (make videos &amp; edit) all thruuu the late night Filming a vid everyday this week I'm actually real excited about it 😈😈 https://t.co/ac86Ya4Wuu ITS UP! BIG ANNOUNCEMENT IN THE VID\n\n https://t.co/1nYsFiNkRT\n\n😬😬😬😬😬😬😬😬\n\n#DolanTwinsNewVideo Video going up any second now... keep an eye out😬👀 today's vid... the wait is nearly over 😬😆😭 ANNOUNCMENT: IM WANT TO MAKE THIS ANNOUNCEMENT IM PUMPED WE ABOUT TO GET CRAZY Tomorrow is the day life isn't as complicated as it seems. make it exactly what you want it to be:) we're all just animals at the end of the day YOUR CHARACTER HAS NOTHING TO DO WITH YOUR GENDER OR SKIN COLOR. we all live and die. we're all human. everyone is equal. Media is annoying af when they put down a gender/race to try to make another superior. It's a thirsty ass move to get attention. Messed up. I'm laying in bed and I actually can't wait for breakfast I'm not even kidding that's all I'm thinking about rn If you see a little kid at a lemonade stand and u have cash on you and you don't stop you're evil The wait is coming to an end 😬 Gray snapped me a pic of food he got for both of us and I just got home and it's all gone. Food for 2 men in one mans belly. Thx gray! Do whatever it takes to make good memories Y'all are talented af Alright gonna take a nap until Tuesday Not getting any sleep but it's worth it I eat dry spaghetti as a snack that never happened ur just lying to get likes https://t.co/oh8x3Tpw69 Can't sleep cuz something is happening very soon and I can't wait so I can't sleep Damn I'm excited I just woke gray up and he's acting like he just got his wisdom teeth removed wtf he's delusional af I gotta let the boy sleep hahaha ahhhh😳😩 https://t.co/WUi4IBubM4 NEW VID LIVE\n\nWe get hooked up to a lie detector test to find out the truth about each other😳\n\nhttps://t.co/2DVExLqIjJ\n\n#DolanTwinsNewVideo yoo happy tuesday it's gonna be a good day wait, got it. I don't have to explode anymore I was just editing for hours and our computer crashed the the video is gone. I have no idea what to do rn I'm up... time to edit🤘🏻 I hate parties just a fun fact Shout out to anyone who keeps it real Spread love and always be there for each other. This world needs help. Let's make it a better place 💙✌🏻 HAPPY EASTER YOS RT @GraysonDolan: CHELLLLLAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA 💁 h… UGH I got glitter on me.... it's spreading.. THIS IS SO STRESSFUL I've eaten 8 pancakes today Bouta snooze hope y'all have some nice dreams Goatchella thank you all for being trustworthy. I really appreciate you &amp; want you to know that I do. NOTHING IS IMPOSSIBLE THE WORLD IS IN YOUR HANDS I love things that make me say \"wtf\" (in a good way) crazy day today I love craziness AHHHHFFFUUUGHDTHRBD I just slammed my finger in a door UUGGGGH hello Today, a lady gave gray and me a dollar and said she liked our energy haha?! yay https://t.co/k39YZxiGJb BEW VIDEO UP\n\nOur reality show!\n\nhttps://t.co/Ldkodjfftm\n\n#DolanTwinsNewVideo 🤘🏻😝 One of my fav vids going up in 10 mins 😬 Gray and I are REALLY REALL REALLY into tomorrow's video😂 Can someone invent a flying superhero suit already I miss gizmo Why is it that when a dude proposes he gets a girl a ring why can't he get her like a live salamander or something interesting we keep having to reflim cuz we can't stop laughing AH Gluing Grayson's cut closed rn😍 I wanna follow someone on IG It takes just as much energy to make someone feel good as it does to make someone feel bad. Make people feel good about themselves Do something that you're always gonna be able to look back on a and be happy about today Eating breakfast before I go to bed so I don't have to wake up early u ever seen someone so good looking ur like \"ok, imma just sit down.. and take a deep breath.\" I have a great feeling about life right now The world should do a thing where humans become nocturnal for like a year Ok ok fine I'll admit it I have a mustache and I wanna keep I'm sorry Just ate some fruit. Good stuff. Thx nature I'm craving fruit. I've been craving it all day. I can't find any anywherrrreeees Been working on some next level crazy shxt all day what's up Grayson just told me that in the future people are going to wear slime jackets and they're gonna look cool Yeah you did😑 https://t.co/48z7i8On0e NEW VIDEO UP or something like that\n\nI got gray pretty good😏\n\nhttps://t.co/pTQxKfw47O\n\n#DolanTwinsNewVideo 🤘🏻👍🏻✌🏻 I think there's a videos going up in 30 mins or something idk something like that video something I forget really tuesday! It was honestly a good day tho. I hope you had a great day Anywho, I got new speakers for my car today, blew them out &amp; they started smoking. And I also lost my wallet WOOOOOO I'm not subtweeting, I'm just speaking in general. Some friendships aren't always perfect/don't necessarily last forever, but life goes on Since we don't like to promote drama, we end up getting accused of dropping people and using them when gray and I aren't like that at all I'm over seeing people accuse gray and I of \"dropping friends.\" We wouldn't just not be friends with someone unless something went wrong Yo I'm not tryna be negative. Good vibes always, I just wanna say something that I feel I kinda need to talk about your brain is admirable https://t.co/zt2WcdM98y I love seeing you guys supporting each other. THIS HOW A FAM SUPPOSED TO ACT I LOVE IT editing😬 got grayson pretty good yesterday lol That more like it gotta fix my layouts it's old news You don't understand how excited I am Grayson quit foolin me Working hard on something that we're about to be very proud of😊 Y'all are funny thanks for making me laugh Not trusting anyone today. I'll trust you again tomorrow The hashtag with pictures of the microscopes💀💀💀 I'm dead Ugh.. congrats u got me😑 I'm going back to bed 3 different types of appointments today I feel like and adult lol Got a haircut There's always so much more I wanna say and I don't wanna sound basic. But thank u all let's get crazy together Here's a vid of me lookin like a dumb ass being pretty awkward. Just wanted to say thank you. There's so much to say I always freeze lol 💙✌🏻 https://t.co/LKxRVW9Ai9 You guys are the dopest friends Gray's trying to grow a mustache I'm gonna do him a favor and shave it off when he's sleeping I'll always be Jersey good vibes only today you guys are everything to me. I'm thankful for every single one of you. people who say otherwise, go for it. I know what I'm thankful for No ones allowed to talk negatively about you guys. Not gonna allow that to happen I'm not a serious guy One of our mini bikes was stolen. I'm getting on my other mini bike and I'm coming for your head Good thing breakfast is a thing.. otherwise idk if I would get out of bed at all When I favorite a tweet my phone vibrates it's so nice 10 out of 10 perfect https://t.co/KJqokmMN75 MEW VIDEO!\n\nWe get nutty with a TASER \n\nhttps://t.co/KuUKJEojKm\n\n#DolanTwinsNewVideo 😂😭🤘🏻 There's uhhh new video or something in 5 mins Gray and I just found an old secret cudi album and we're shook bout it rn tomorrow's vid made me laugh a lot while editing it haha My feet smell like vinegar Slightly sunburnt and I'm pleased about it The vibes are better at night hey Bouta throw a party and invite the whole fandom here https://t.co/O09SsGJUuo Just met a fan &amp; he was holding ice cream &amp; I asked him where he got it and he showed me the spot. Truly a great person I now have ice cream I don't use a highlighter my skins just oily haha Just filmed a nutty video Telling myself to be patient but I can't wait I gotta change up my hair color Too nervous to film our next video.. waiting another day Not being able to sleep is ultra frustrating Just ordered something for a video 😧 Just an idiot lookin for some dumb stuff to do Just woke up and did a triple backflip out of bed and landed at the kitchen table, inhaled 3 pancakes and put my robe on 😭😭😭😭😭 https://t.co/JOgueCSPlR It's up and it's intense \n\nWe blindfold and do whatever we want to each other \n\nhttps://t.co/O505ESnd4e\n\n#DolanTwinsNewVideo 😵🤘🏻 I promise the video is crazier than the thumbnail we just suck at click bait haha I stuck a sticker on gray's back this morning and it's still there Omfg this weeks video... I'm not just saying that it's actually intense lol Grayson just said \"I'm making dinner tonight, don't ask questions, just eat it when it's done\" uhhhh do I eat it? Orrrrr ugh not enough crazy stuff to do around here Tryna eat some sushi Lol gray and I just roasted the anti-LGBTQ people protesting on the sidewalk I need sleep lessons I just woke up and I CANT STOP SNEEZING WHAT TF I love animals even the scary ones Just had a movie date with Grayson. went well. \"Ethan and Grayson why do you have laundry on all of your couches?\"\n\nCuz it's a teenage boy house hahaha https://t.co/Gw22RnDeAx NEW VIDEO\n\nWe left each other for a week😰\n\n https://t.co/FFTt7k1MBg\n\n#DolanTwinsNewVideo 🤘🏻👍🏻 happy tuesday. today's vid is gonna be super different 😬 I've just been blessed with homemade pizza Still haven't slept since the night before last night Grayson is peeling like a lizard he better not get that stuff in my room Editing the vid😯 Let jag fa We need this @GraysonDolan https://t.co/wOIfXd5Ddu I'm back and I'm searching for Grayson I just saw a couple mountain goats wyd? I'm addicted to eating ice it's bad I miss gray that kid makes me laugh Holyyyyffffff I'm laughing so hard at this one clip I took today Going crazy today This is getting really weird I got some chapped lips Today's vid actually gave me some feels tbh haha There's always more too see. Life is cool Omg the replies... I messed up by tweeting something with the word \"choking\" in it The air in Colorado is so thin I'm choking haha It's chilly https://t.co/Dw7PfEaYDE 😭😭 https://t.co/Fg03Khnq78 RT @saphirdolan: What an emotional throwback guys but the vid is still funny tho😂💙\nhttps://t.co/7DzwVmT9ky\n#DolanTwinsNewVideo \n@EthanDolan… Sooo apparently THIS WEEKS VID IS UP!\n\nUhhh we watch our old vines😳\n\n  https://t.co/qzdecKIjCi\n\n#DolanTwinsNewVideo 🤘🏻 Today's gonna be good af Oh yeah wait tomorrow's Tuesday Large pineapple pizza pie vs. ethan....\nbattle over in 38 seconds this took some effort https://t.co/j8NsMiWBK2 I definitely need to be with nature. I'm not a city boy Anyone else get extremely hype when u remember a random af show u used to watch when u were a little kid I just thought of a song in my head and couldn't remember wtf song it was. I couldn't live the rest of my life until I remembered the name Too much ice cream ow my stomach why did I do this to myself I just went so hard to music in my car I'm sweating so much rn If you're ever stressed out or don't know what to do just make yourself pancakes and everything will be alright Wow today was a day.... good thing it's Friday hell yeah weekend time Just beat gray in tennis now I get to racket slap him Just worked out half alseep. Weird mental experience See u in the morning:) Is it weird that I wanna be stranded on an island ? I was such a BAMF in 4th grade I just realized gray and I can communicate with each other without speaking The good kind of cry... hope😳😂 https://t.co/32FlikgqXG RT @realestdolan: 💯NEW VID IS UPPPP💯\n\n👏🏼Ethan u savage \"Dolan Twins Nudes\" HAHAH👏🏼\n\n#DolanTwinsNewVideo @EthanDolan @GraysonDolan\n\n18\n\nhttp… Vid is up yo's!!!\n\nWe googled ourselves..😳😳😳\n\nhttps://t.co/IEAA1SyIfe\n\n#DolanTwinsNewVideo 🤘🏻 Should I upload before I eat another pancake orrr....? Pancakes on a Tuesday morning😍 whatever to everything TOMORROWS TUESDAY Sh!t happens. But everything happens FOR A REASON I'm really being tested rn Just make it thru the hard times If you're going through something very challenging right now it's only because something amazing is about to happen Grayson is an evil genius Holllyyyyyyy I'm shaking Editing https://t.co/FGAFirc6mY I just drank so much juice I have a juice baby wtf is this I need to travel asap I wanna be with nature Sometimes gray and I will randomly have a kicking battle and kick tf out of each other for fun My day has been made A baby was just running around by me in this store and just threw up. I'm out this place BYE I feel like I lost 2 pounds just by trimming my hair Life sized cardboard cut outs are scary Gray and I are crying laughing. I can't breath I'm about to pass out while tweeting thi writing...🖊 The hairs getting v long... today's the day ✂️ I only know how to be an idiot I will never be able to explain how much I really appreciate you AHHHHH😭😂 https://t.co/PvMniXGhri It's UP 😳\n\nwe read our dirtiest comments \n\nhttps://t.co/MG9eywIyFO\n\n#DolanTwinsNewVideo 😫😵 The videos ready to go up i just.... don't know....... Tappy huesday aH I'm hype for the near future NICKI FOLLOWED ME ON IG😵 Holy the water is so rough today gray and I have been getting smacked around by waves all day Ugh road trips with Grayson… he acts like my driving coach the whole time🙃 Guys... should I do it? Should I pay this man to edit our videos? https://t.co/tgzOjfMEvS Filmed some more weird stuff today... WOW I LOVE YOU Big things coming soon Rainy days are just free car washes Just now realizing my shirt as been on inside out all day Wearing bummy clothes puts me in such a good mood Grayson just ran full speed face first into a \"pull\" door thinking it was \"push\" Filmed some weird stuff today... yo gray and I are thinking about filming a video that we've been super scared to film for the longest time just woke up and great, Grayson drew on my face while I was sleeping oh cool and he posted a pic of me sleeping on my IG 💙 https://t.co/iS6sxK7zNJ I wanna go run around in nature and be a jungle boy Relatable. Mine has been uploading a video and eating a lot of junk food🤘🏻 https://t.co/efpBTtiyo0 YOO it's up! \n\nour Valentine's Day special challenge \n\nhttps://t.co/q5LZOrfnCX\n\n#DolanTwinsValentuesday ♥️🤘🏻🌹 YouTube crashed were trying to figure this out Happy Valentuesday Let's all just hangout sometime I got a valentine for tomorrow there are no limits every time I'm upset/stressed I feel like I will feel like that for the remainder of my life. not true. Everything gets better b4 u kno it yo if you're having a bad day or just a hard time in general right now, it's gonna get better and everything will be great Happy day today 😆 I wanna go to outer space one day it's crazy how much your mood can change in one day I'm trapped in my mind I like learning about interesting stuff Just ate a lot of pancakes I feel very much alive I don't want to sleep. THERES SO MUCH LIFE THAT NEEDS TO BE LIVED You're perfect as you are literally don't listen to anyone So glad we made this fam. You guys keep me thinking positively I peed myself😫 https://t.co/Jkgs2l5JLg It depresses me when people forget where they came from SOOOLLLDDDD! To the man with the tampon earring! https://t.co/QsN9RrojSX being adventurous is probabaly the most attractive trait of all time lol I hope it makes u laugh or something like that https://t.co/l2ZxGp4gAP VID IS UP\n\ntypes of drivers 🚗\n\nhttps://t.co/ow6tKt3OMN \n\n#DolanTwinsNewVideo 🤘🏻 happy Tuesday dog I really miss the U.K. for some reason rn GRAYSON wtf yo were almost at 3 MIL on YouTube AHHHH Night time, why do you make me think so much ? I'm so pumped to edit this weeks vid tbh Humans need to start treating humans like humans Got a flat tire... in the middle of nowhere........... at 2 am.................... U make a lot of people happy And it's fine🙌🏻🙌🏻😭😭😭🙌🏻🙏🏻 OMG I was just driving and realized I left my phone on top of the car so I pulled over and the phone went flying off then I ran it over Let the happy outweigh the sad well tha got a lil crazy In the middle of filming some shiiiiii I'm really liking it hahaha Been brainstorming all day with gray and oh boy we got some ideas Maybe I'll go hit up the frozen foods isle. That might be interesting.... WHAT TF AM I DOING I'm aimlessly walking around a grocery store only bc idk what else to do w my life rn. I have only been this bored one other time in life Guys my grandma likes the video that means u have to watch it now https://t.co/gNu4gJyE0h I normally don't tweet when I do stuff like that cuz it doesn't need to be on the internet but I'm just super confused rn lol A homeless guy just told me he was hungry so I got him a cupcake and he turned it down cuz it wasn't healthy enough? LA be like"}