{"tweets": "Ps super happy to see @billieeilish crushing it. I wish I had someone like her to look up to when I was growing up. she’s unstoppable. Going back to bed. Again, love you! deleting and ignoring all negativity. BTS deserved many nominations. I am however, unsurprised that they weren’t acknowledged. the US is so far behind on the whole movement. the time will come. CHERRY! EASY! https://t.co/efq1Z50Ejl I love you guys too! https://t.co/8MP980sDoT congrats to the nominees. so much great music nominated this year. definitely see a lot of my friends and colleagues missing from the nom lists, but the music speaks! this is how it goes every year right? my fans 💕 please do not waste your anger or frustration. i see a lot of you are upset. of course im sad too. none of it matters. literally none of it. you’re here. im here. + everything is gonna stay exactly the same and without me is still a super tight, record breaking song 🌟 well good morning. I love you. 💗 i bought this hat on amazon and i didn’t realize it wasn’t for grown ups. https://t.co/ByglS08rPR pregnancy is a super sensitive subject. some celebrities are open about having any struggles with reproductive health. some are not. either way it seems really inappropriate to target someone and speculate about something so precious and personal. Is it a boy? Is it a girl? It’s pancakes. Still not pregnant. Still just allergic to gluten. Still love pancakes. 💗💗💗 @madeon 💗💗💗 yes. https://t.co/DDzoH7S0e4 It’s that time of year again. Joining  @MostRequestLive on Saturday 11/30 and doing an @iHeartRadio @AskAnythingChat. Send me your questions. I’ll do my best to pick the coolest wildest nicest ones. https://t.co/YTGXhE4JdO Thanks @OnAirRomeo 💕 Joint account !!!!!! https://t.co/UTXuAgL0D9 want to quit music and join anime twitter full time Cute thing bc I need to tweet something cute. My dog will be in the other side of the house minding his own business. n then as soon as I shut my bedroom door he comes RUNNING and whining like “ARE YOU SERIOUS? UR GONNA SHUT THE DOOR WHEN I DIDNT EVEN WANNA COME IN THERE ANYWAY?” That’s all I’m gonna say on that for now. You shouldn’t have to live in fear of protecting yourself from the people who are supposed to be on your side. And most young, wide eyed artists, don’t have the foresight to think they will need to. And it’s sad they would ever need to.. artist trust labels. It’s supposed to be a healthy symbiosis. You have holidays with these people. dinners. deaths. Watch babies be born. They watch your lowest lows and highest highs. Sometimes things are unspoken. Legal doesn’t mean moral or ethical. Ps. My first radio play, charting records, and extended play were all seen independent as well before I found a home at my label. I know both sides of this very well. https://t.co/EKeG2G6Q2A Hey man. Good for you. But you don’t become Taylor Swift that way. It takes an army. Everyone wants a different career and a different path, 100% But insinuating she should have known or done better to reach her magnitude is negligent. https://t.co/2viXU8NRGu @jennarosee I’m telling her to stop making it seem like Taylor put herself in this position and could have known / done better ??? It’s negligent ??????? road to manic, episode 2.\n\nhttps://t.co/8dl6uL3O4i I think I died @Pink 👯‍♀️🖤📷: @yasi https://t.co/3156Fg2bNV Y’allsey....I’m- https://t.co/sp49z3o8Xj 💗💗💗💗 https://t.co/fhmJbpYJ2j thank u i did it ma self!!!! https://t.co/oaoAmlEdmc see you guys tonight on the @CountryMusic awards https://t.co/AEtpdCW43Z Harry Styles on tour during my birthday? yep! Graveyard (Stripped - Live From Nashville) \nhttps://t.co/bXwnDB87FW @youtube @Vevo ya girl don’t miss a beat. (but almost dropped the umbrella twice) #PowerbeatsPro @beatsbydre https://t.co/kOPLAnWulI https://t.co/HEqGiVghPl This one....... I believe.... https://t.co/TyKDkA7gFI People can photoshop literally anything and everyone will believe it. It’s honestly terrifying. No 2 songs on the album are alike! https://t.co/yIZmgObVNe Not necessarily. In a weird way it is. It gets very grand and delusional and colorful at times. And then some times it’s very *tiny voice* and straight up. It’s called MANIC!!! Haha https://t.co/Jhxy5GYfYS my friends and I think so. it’s just a different thing. it’s sooooooo real. https://t.co/nhi0jWvnHE badlands hit different at this age. I’m the youngest artist on this list and 2 albums deep. I am SO honored to be included with these amazing women wow. This is major to me! https://t.co/qQxQfha3J3 And YES @DonsLens made this because he has tirelessly provided me with amazing visual content for years. Love him v much https://t.co/h93UmKKYOJ road to manic, episode 1. https://t.co/hFXayDeGcr 💕💗💕💗💕💗💕 https://t.co/rlZBXG5JGu U guys are always like “UGH TO BED” without knowing where I am. It’s 9:21 am right now for me hahaha. https://t.co/gzG4B6filO THAT PAAAAAAART! go off. https://t.co/9m1AunTevo This one took you guys waaaaaay longer than I thought haha. Good work! https://t.co/T1346UirQN gonna try No Nonsense November and see if i can shut the fuck up for the remainder of the month or maybe even the rest of the year. the rest of my life? who knows RT @naminluvv: Butterflies will always be part of @halsey and ashley life🦋 https://t.co/LdjjSVbENK W O W ! https://t.co/cBDtgfxH1k It’s always been more my style to go onstage alone. 🧚🏼‍♂️ It’s spiritual for me. I love the freedom of the space. Limitless transformation and instinct. Thank you @mtvema for letting me bring this fantasy to life. https://t.co/GxCcMfA3VZ something for everyone! 🥳🥳 https://t.co/uxxf7Rz6rO I have 4 looks tonight :-) RT @MTV: @halsey Yes, I'm absolutely swoon by @halsey. \n\nYes, she KNOWS 👏 HER 👏 ANGLES! #MTVEMA https://t.co/pO3zHSx6rV tonight @mtvema 🌸 https://t.co/pwtfxb64GO @orionnichole @en_jajaja @MidsommarMovie FUCK @93AngelOnFire I don’t think that one is about me! I didn’t crash a Range Rover I can’t even drive! And I buy all my own designer things... haha. @sydneycarlsons YES!!!!!! One of my favorite films. Been wanting to go this color since I was Poison Ivy last year. 1 year later and it’s time! 🍁🍂 https://t.co/WRSpNUryJF This was on purpose it’s Halloween https://t.co/l5pLoHfxYL I. Died my hair I love everything Halloween forever all the time always thank u for ur time 🖤🖤🖤🖤 @PHOENIXmagUK https://t.co/ATHiVy0o7L I am: always kidding. Please calm down 🤡🤡🤡🤡 I want to! But I hear it makes your night/dark vision bad which means I would probably have a hard time onstage at my concerts :( https://t.co/MMo0mdo3zK I can’t see my own tattoos on my arms when I take off my glasses haha https://t.co/UWSuTJj34N I have almost 20/20 vision with my contacts! Not quite but almost. So I can see you guys still haha https://t.co/HIBvEjbY8X bebe....it doesn’t mean one eye is 20 and the other is 500 https://t.co/SEFfkON8y6 @sweetstplums That’s my actual vision! basically from 20 feet away I can start to see what people with 20/20 vision can already see from 500 feet away. https://t.co/2DZfUHuQ9F I have 20/500 vision 😬 https://t.co/zovWtyXu4U i started wearing my glasses again after like 5 years of almost exclusively wearing contacts. and they are hard to get used to. so if im giving you a dirty look it’s because i, truly, cannot see a thing. I hope people have figured out by now that it is 100% how we joke around with each other 😫 https://t.co/f87BQfWkhX bruh absolutely fuck ur self. I made a typo cause I’m dumb as rocks and this is how u exploit me https://t.co/jFRzQVreqI FUCK I MEAN PEEK. Thank you @TheEllenShow for letting me be the first to do augmented reality on your show! Hope you guys enjoyed the little peak into my world https://t.co/MS9t04ds8G I want to know why I scare like a colonial wife. “OH DEAR YOUVE GIVEN ME A FRIGHT!” https://t.co/Ty5KpuzrID It was actually hoseok https://t.co/4luyigeulN Sometimes I forget how much is coming and I’m like omg how are u guys gonna keep up I dm fans every day 🧡 https://t.co/0UALF4dnYu I think I mean talk about personal stuff! Not like promotional updates https://t.co/X5tbkwFBS6 Feel like screenshots from that would become even more valuable and it would just make it worse https://t.co/g4wEwkmAY6 Can’t do that with thousands of people! https://t.co/YsMefKwXiv Wish there was a way I could talk to you guys without everything I say turning into a tabloid article :/ now u know what u know 💕 @ILLENIUMMUSIC answer ur phonnneeeeee Payton about to fight in the coffee shop bc the nice barista said libras were cool and she was like “WHAT ABOUT ARIES”. The aggression. How do fire signs function. @goldenbIush I don’t think that’s me! Haha Honestly I still have time https://t.co/wMlbSvPk3E very happy I got to do a scary/cool costume and a funny/glam costume this year. I feel very fulfilled. Love you her mind https://t.co/Vtb59FMtLU Yes! https://t.co/y23Q6fUf2u Yes!!!! https://t.co/fyf5MdixPv wanted to try this makeup look for so long 💙🧡 @cher https://t.co/ReOSMr7j82 So @madeon just played shelter at my party and I am peaking in life 🤟🏽 https://t.co/qcrTykhtm2 Today. \nIs my favorite day. \nOf the year 💀 whenever I go onstage I just hope to deliver my songs with the intensity of which I deliver nicki’s “bottoms up” verse when I’m singing along in the car. wowowowow woke up to 3 @AMAs nominations,  including artist of the year! thank you! 🖤🖤🖤🖤 https://t.co/FCQ1jJtOlO Sevian!!!!!! My sweet stubborn boy. weepy baby must be right about everything. But so wholesome and charming. Everybody loves you. https://t.co/DfAfZOFYuB it’s honestly.......cinematic. https://t.co/T1nKd8gPyK I LOVE Aries! Payton Nathan AND Sheppard!!!!!!!! Come on now! My literal family. My opposite sign. Mars and Venus baby. https://t.co/e5ooJ7YlLe Maria, Erica, and my mom! I surround myself with cancers. the most loyal. The only people with enough patience for my messy self. support me no matter what. bad at taking advice. Lol. https://t.co/j3OyHdAd5h how can u not love a Leo. Even when u hate them ur like damn ur so likeable and charming. the ego tho....woooo chile.... https://t.co/C3FqEwtnhb Luv. In my experience: Weirdo cuties. Creative! Like to be alone. Secretly needy tho. They go against the current. But are tough cookies to access emotionally. Rewarding when you do! Soooooooo FUNNY! https://t.co/2LS4tVrjYf annoyed. https://t.co/H7aipku8vu @scotterkinz Three the heart has its reasons whereof Reason knows nothing. hoping my weird lifestyle doesn’t get in the way of me being an awesome class mom one day haha https://t.co/aCdLsO6FdV I luv Halloween https://t.co/UomBDrAObF i’m playing a little set at LA LIVE for opening night of the @NBA! and it’s a free show!!!!! super excited!!! RSVP hereeee 🏀 https://t.co/MOD25UOKAj saw bon iver last night. think I died at some point. @iamsomeya Lmao I said “accolades.” Def not broccolis. Still tru doe nothing’s changed tho be yourself. @scotterkinz CHILL RT @ARIA_Official: .@halsey's coming to the #ARIAs!\n\nhttps://t.co/9HHYBiXJoK https://t.co/aJR3gndOw7 Hahaaaaaaaaaaa welp https://t.co/iYx6dmwDGL holy shit u right damn. https://t.co/fqUM0XavWL stan twitter is crazy cause i met some of you in my meet and greets when you first discovered box dye and doc martins and now some of you are literally lawyers and teachers and doctors. like excuse me SAM how are u saving lives i just saw u cry to colors. ur doing great sweetie I’m just really glad I wrote this song.  https://t.co/K8k7SmvlC0 😋😋😋😋 https://t.co/oF4y7kbRv2 Crossroads is happening tonight rain or shine! Nashville is in for a sick show tonight me and @KelseaBallerini are in a MOOD!!! happy #ComingOutDay ! To everyone who has, hasn’t, wants to, can’t, and those of us who feel like we are coming out all the time and will continue to for the rest of our lives (!!!) haha. it’s a living breathing journey and it’s yours to design. love you. @tearschimi I caught it before they could do anything but wipe my page. That’s what happened. It’s not a thing. Just got hacked haha. anyway: I tweeted joking I got hacked cause of my tweet about Harry and then someone actually hacked me so be careful what you manifest folks me online: Cool™️\n\nme in my group text: omg harry is doing a thing This is the cutest thing I’ve ever seen I’m so happy this has a good home with you. I love you!!!!! https://t.co/cmmBjRcttL RT @MTV: .@halsey and @sydney_sweeney embark on a euphoric carnival trip in her new video for #Graveyard: https://t.co/HJjKvmNYoD 💫 https:/… merciful. you guys have already figured out so many clues. so quick! Graveyard\nOfficial Video out now\non @Vevo/@youtubemusic \nhttps://t.co/F0tbVkFkif https://t.co/TVl6QaZqFt Graveyard: Let your imagination run wild. \n\nOfficial Video out now \nhttps://t.co/F0tbVkFkif 17 minutes until the Graveyard video!! i’m joining the @youtubemusic chat now! \nhttps://t.co/aZVPwt3f6F good morning it’s almost music video time !! Graveyard video tomorrow\n1:17pm EST \nhttps://t.co/aZVPwt3f6F https://t.co/h7uiN4dpQb Queen! This is epic! https://t.co/oStjCRcEKO Graveyard. \nLet your imagination run wild.\n10.8 🧡🍭 https://t.co/4U4l3pjQK3 woweowowowow. Eastside makes 5 billion in audience for my songs and collabs on American radio joining BAL, H&amp;I, Without Me, and Closer! thank you @iHeartRadio and thanks America for letting me be a voice on ur stations 😢 https://t.co/ITIev01KoM It’s so funny cause I don’t know how to explain to u guys that PB&amp;J is probs one of the most popular foods in America. like a lot of people ate them almost every single day growing up. I can’t believe it’s such blasphemy internationally YES!!! https://t.co/IRFMsqXiyT im the only American awake right now and i’m being attacked. real mature of u guys to wait till i’m defenseless https://t.co/46LYMdM6v9 Jell-o https://t.co/L7rjzjtC7f Yes it’s Jam! But with no seeds https://t.co/AdwOvnhNKX https://t.co/PdWUSpvcA1 https://t.co/536JM8PH1F The amount of people tweeting “ew” about a peanut butter and jelly sandwich is staggering..... is that not a thing outside North America?????? Jet lag, an ode to thee. it’s 3:30 am and I am eating a peanut butter and jelly sandwich. I have written 3 tv pilots. One is good. Should I do my laundry? My dog thinks it’s breakfast time. I’ve deceived him. “My mind is alive.” - Taylor Swift, 2019. @earthlycruel Hey thanks I’m glad you wrote this bc it is 100% the entire point. I know a lot of people have had strong opinions about why I chose this photo but you Nailed It !!!!!!! damn I wasn’t playing. shit was foreal my insides. look where we are now. https://t.co/0nrdpDxHf4 when i said \n“i keep that MF thang on me” \n\ni was talking about a dry sense of humor, debilitating empathy, and body dysmorphia 😍😍😍😍 I can’t believe we are doing Crossroads together. a formal pinch me moment!!!!! https://t.co/sL6x96ETMp RT @PopCrave: A year ago today, @Halsey released “Without Me” from her upcoming studio album ‘Manic.’\n\nThe single was a smash, becoming her… mhmm 💙 https://t.co/JNQhL49QgM the last verse in clementine is a small poem i wrote last year about having a black eye. then it became clementine. October 8th,\n1:17pm EST 🎡 https://t.co/Uyk3SDkTu5 dove into graveyard with @amazonmusic to talk about Amazon Music HD and how the song is layered and layered with little secret codes and pieces of me. https://t.co/SSkmi71rbO https://t.co/VFMGOyp15x Exactly 25 years ago to this moment I was born. I wanted to celebrate today by sharing a new song called “clementine”🍊and a cute lil video for it that i made with my brother Sevian. Enjoy :) https://t.co/1HkK3HIJrc thank you @designdain for making this incredible art piece for @spotify come to life! (literally!) I am so lucky to know an artist like you. vertical video out now https://t.co/EPR3oRJenQ fuckkkk ticket day makes me so nervous I love you guys !!!! I can’t believe I get to tour again. So many nights of spilling my guts. This is going to be the most fun tour yet. Every night it will grow and breathe and evolve. Tickets are available now: https://t.co/CFxXNPcdSW 🍊🎂🐠 https://t.co/thfKATPoNk can you feel it too? made u look https://t.co/618iejvyYy 🥰 installment 1 of the manic world tour presale tix r sold out!!!!!!! general onsale is tmrw ! So many songs to play with 3 ALBUMS. ur gonna have so many new favorites.... https://t.co/1ZvsEcsFQD 🎨🎭🧠  https://t.co/LKxkIc5fk8 🍊 I lub dis version! https://t.co/ScqkI2LLN3 I....... Wow. https://t.co/aYj93bGa1Q @scotterkinz Also apparently I only like your tweets after tweets about snakes It’s bi visibility day, the beginning of libra season, and Bruce Springsteen’s birthday. Today is my entire personality. I’m going to be far too powerful. Manic World Tour\n(First Installment) \n\nTickets on sale Friday!!!\nhttps://t.co/CFxXNPcdSW https://t.co/ViSqIU4A5h It b like that https://t.co/T8zmVVPvEq i DO https://t.co/E2P6Ilnvjw That mic flip is a classic https://t.co/ASCi32dRdF RT @iHeartRadio: Thinkin you can live without me?! \n\n#iHeartFestival2019 https://t.co/aSLki2q2vm Mint chocolate chip! Dairy free! https://t.co/gTdyjN89TJ uh @RyanSeacrest made me a homemade ice cream cake for an early bday present I’m honestly on the verge of tears how nice is that 🖤🖤🖤🖤 https://t.co/K47ekJdvHP @MarinaDiamandis EXCUSE ME! this is POWERFUL did you watch? @SavageXFenty #SAVAGEXFENTYSHOW @PrimeVideo https://t.co/Grv75Zu0yG so honored to be a part of this historic moment. 🖤 goddess @rihanna 🎬 @SavageXFenty #SAVAGEXFENTYSHOW @PrimeVideo https://t.co/ByhZ6U1uQO sign language covers of my songs make me so https://t.co/jZrwde5ZHF @hausofIau O.....kay? I said what I said! ANGEY! Me: I thought I was gonna make an angry album but I didn’t. :) \n\nMedia: HALSEY makes ANGRY album ! \n\nMe: no it’s—\n\nMedia: ANGEY!!!! @itsmekaram U look amazing!!!! Graveyard available now &amp; Manic available for Pre-Order on iTunes \n\nhttps://t.co/YF8zEOS1wf @joecoscarelli @mehpatrol Oh cool so my song wasn’t “good enough” (despite researching well and certifying gold with minimal radio play) and its not a boys club, cause there’s 2 female fronted acts (on the entire format). (Also, we played Alanis! 20 years ago! Hello!) And yeah. Ur a PD. Break female acts. @joecoscarelli @mehpatrol “Does anyone really go into guitar center anymore and pick up the guitar?” \n\n:/ :/ :/ :/ :/ I talked to Zane about how I sat down to make a dark mean album and found nothing but calm, introspective, acceptance in my heart. 🖤 https://t.co/dT9xMFaX9I watch my interview with @zanelowe on @applemusic 🌸\n https://t.co/ZcFrHEG2Hm Jon is da 1 ☝🏽\nbeen a massive fan for ages so this one was a very exciting collabo for me 🌸🌸🌸 https://t.co/t2MJWVYq06 @visitkingdoms For u to come around and try me liv *weight. And wait..... I guess. I never said it’s a pop album. I just said it’s not an angry one. and thank god I sat down to write and realized I wasn’t angry anymore. it feels good to have that wait off my chest. @yungbaegod It is! :) It’s full of introspective lyrical content that takes responsibility :) idk why I’m explaining. u’ll see :-) I painted my album cover in 7.5 hours and a lot of you watched the entire thing. here’s the whole process in 3 minutes. sorry for finessing you. I love u\n\nhttps://t.co/2ekK8NRAj8 thank u @amazonmusic\nalexa, play Graveyard 🌸\n\nhttps://t.co/PGN08TSOzv https://t.co/nBnGuZXKkw @HalseyInsiders This is really awesome! I know some of you are confused but this is purely with solo purchases :) anyone who got graveyard through preordering the album doesn’t count to the chart so this is an insane position! Thank you!!! u can listen to “Graveyard” on @Spotify now 🌸\n\nhttps://t.co/qaVLlOwH1q https://t.co/6gC1oNcHHZ my new new new single “Graveyard” is on the new #NewMusicDaily playlist 🌸 on @applemusic, https://t.co/QhVU66rLDL https://t.co/TWhVTAA8Az GRAVEYARD is out now. \nmy 3rd album “Manic” available for preorder now. i can’t wait to meet you. \n\nhttps://t.co/kytFngTmkv https://t.co/KfxwLpv1UU Graveyard \nOut Now \nhttps://t.co/QPE4bs5dZH https://t.co/ed2JITZ1xV https://t.co/kytFnhaXJ5 \n1:17PM PST @harinef My fav look ever RT @ellieliima: maci is an accurate representation of all @halsey stans at the moment https://t.co/vCf2v1P9Ns two days https://t.co/0xBf90jcm8 RT @steffigreen11: You sly dog you https://t.co/yXeuubYtSP 💌 https://t.co/VWrh0wmoiD There! Are! No! Words! @rihanna just changed the game forever; as she always does. Thank you for letting me witness and be a part of this incredible event. @SavageXFenty 🖤 https://t.co/bLB3TJLCaV I would love to forget all of 2014 to be honest https://t.co/PI4RGQZY0J double facts 💞💞💞 I stan, but this been me forever!!!!! https://t.co/jQXp2Bhunj 🌿🌼💞🦋😛 https://t.co/9WqrLT7096 🎭 3 days till graveyard https://t.co/uzaCi8Gb6b I’m 24 years old and I have spider veins. You can’t scare me. 4 days till graveyard https://t.co/XfjbIvfAZE fold 👏🏼 ur 👏🏼 pizza 👏🏼 https://t.co/I4YQaTZ6eK Shhhhhhhhhhh https://t.co/ymcUoC98qK 5 days till graveyard https://t.co/jv7DRQmNxp 6 days till graveyard. https://t.co/PaBGr82tJD @bearfaceington Nailed it @MOMAMGC Parkedt I don’t even drive 😔 https://t.co/DaAAKKJjoX 🌸🙂💞 https://t.co/eO0012FVnK @hunters Please do it u don’t have to say I’m crazy, cause I kno....\n\nnothing’s changed tho :-) grew into a savage and that’s why they gave this verse 2 me. 🤘🏼🤘🏼🤘🏼🤘🏼🤘🏼🤘🏼 https://t.co/4HFWRE3HuZ thanks for having my back 🖤 Thank you to @Cosmopolitan for an amazing interview that was fun and interesting and gave me a chance to show my personality as a human with a heart and a sense of humor. Not a series of dramatic events. My heart is heavy today. Today, no sigh cuts deep enough. I love you so much. mic drop 🤘🏼🖤 https://t.co/2uvUqDPCZu Misogyny is.....crazy. lots coming between now and then. look alive. GRAVEYARD\n9/13\nhttps://t.co/VusddMdZjg https://t.co/QQC7XHJUVh 1:17pm RT @Cosmopolitan: Cosmo's October Cover Star Halsey Talks Breakups, Breakthroughs, and Why She'll Never Be the Pop Star She's Supposed to B… Y’all just said hurry up bc..........you know what \n\nnvm. https://t.co/zmQthCbYPZ seems like it, doesn’t it? It’s the most peculiar thing.... https://t.co/gn9FhFE8KQ Just for this I ain’t even gonna put it out !!!! You shoulda just sat there and ate the food I made u!!!!! https://t.co/Sw39XggXc7 I. Love him. https://t.co/L7Y7ESQ8bb there’s not enough awareness about random boob pains. why do they happen? why must I fear death routinely? i think you guys are incredibly smart. that’s why I don’t spell it out for you. 💞 https://t.co/0fTRjpwcch it’s the amount of posts I have https://t.co/gOtmO97qiq idk. eventually. https://t.co/KVNhlSilhC new album is nothing like HFK same way HFK was nothing like badlands. it’s not fun for me unless it’s \n🌈 total reinvention 🌈 https://t.co/yvnuNDxKrV just posted a 2 year old draft by accident. pls forgive me I’m getting too old for technology. ngl still think it’s pretty wild I had the balls to go completely bald right in the beginning of my career lol. I did that !!! thank you !! https://t.co/ZKj8pxNevp Seems like I made a much different album than you are expecting https://t.co/GuCSGIpQfC I don’t. So see ya later hahah https://t.co/uS7DF9uUUx a face is full of spiderwebs\nall tender yellow\n\nblue i love dominic fike who the fuck writes music journalism headlines. come outside baby i just wanna talk. ain’t nobody gonna jump u RT @ComplexMusic: 2015. https://t.co/yJRefDv1HF @writingvee Room 93 wasn’t an album!!!!! Maybe it was a movie after all. #4yearsinthebadlands 💘 https://t.co/dgpQ5p9YNl My first child, Badlands is 4 years old today. It feels like a million years and five seconds all at once. Thank you. https://t.co/szqMxNmeut unacceptable. https://t.co/PGd9b6y588 It’s a sickness https://t.co/RgJodEyEvC IM SCREAMING @ YOU 3 TOGETHER!!!!! https://t.co/Gma9J0qjQJ poor anthony. He isn’t even white!!! https://t.co/LTurA1H18M award show season is really just *so fun* for me because apparently both my managers look like my ex boyfriend. lots of white dudes with black hair in suits happening. everyone relax. Lots of watching her music videos! Haha https://t.co/Mlxt95cid6 can everyone stop saying I was checking my phone during Shawn’s performance I was texting my mom to make sure she was ok in the audience!!!!!! (and also I was dancing!!!!) @zaralarsson You don’t owe anyone a deadline. It says so much about the artist you are that you want it to be perfect. When the music is great, the timing is always right. Sending you love mama. this is wildly wildly wildly wildly freaking me out. Are you KIDDING ME?!?!? https://t.co/T5HzanmyCi Yeah but this also explains why no one gets my satire hahaha https://t.co/zuthk0xYxJ Yes https://t.co/1o1PBo9CAc I’m volunteering to be eaten. https://t.co/fYXvDo5yII A Modest Proposal, (2019 edition). everything is exactly the same except we eat the rich instead of the babies. I volunteer to go first. It’s me. I’m the heartbreak prince. FACTS!!!!!! https://t.co/rmknYDmzna *sent. Fuck lol I gained weight when I quit smoking but it all went directly to my butt so one of those email forward chains I said as a kid must have worked out. @LEOBlTCH ❤️❤️❤️ good afternoon ☀️ https://t.co/7uCajpEuV2 Payton got me highway flowers 🌹🌹🌹 @paytonselzer https://t.co/panilBb8YM Literally have never experienced worse carnage https://t.co/zhZJrGPuP1 AMBIDEXTROUS! https://t.co/fWOmR0fZc0 In other news I learned how to give myself acrylic nails AND a gel manicure so now I never have to leave the house ever again :-) Can’t believe I’m even apologizing to harry styles stan twitter lol but, I was explaining why u can’t compare artists and their songwriting processes cause the credit system is outdated. I would never come for harry. He literally gave birth to me. @LarryisReal_2y @stylesscreature I didn’t do any of those things and nothing I said was even about harry specifically. I was just saying we shouldn’t use artists to compare unique situations. because production and lyrics are both recognized as equal parts of songwriting 🖤 and that was the discussion at hand. @stylesscreature 💞💞💞 wowwwwwwwwwwwww @Normani is THE girl. THEEEEEE girl. Bye!  https://t.co/bp3lDmj9dD Gaga...is.........so funny. Haha yes I rode it most of the tour! https://t.co/uME0YgbRTo Prolly straight up like a shark fin https://t.co/3PTannaisE ur secrets are safe wit meeeeee! https://t.co/H3apIsVatS everyone is so Dumb. I successfully quit nicotine a few weeks ago after smoking for TEN years. I gained a lot of weight and probably lost some friends forever bc I was being a NUT (lol) but I’m so happy I did it and I feel v goooood. just wanted to share. I haven’t been on tour in almost a year and lil man has baaaad travel anxiety ! https://t.co/2iFqql2TmN This is my house and I’m with Jagger literally every day why do y’all talk about him like I abandoned him lmao https://t.co/f8plxnZtud @sansjuniperos Songwriting is a really weird system, if someone played the guitar, and the drums, and added a piano part, and suggested a harmony, and both the artists, and the Og writers who started the idea for the song, etc,,,,,,, they all get credit. It’s a weird system. :/ RT @natthetaurus: It’s 2014 you’re getting ready for a halsey concert u put your blue hair into space buns and apply glitter to your face.… GANG! 💞💞💞💞💞 https://t.co/ffeZo2WazX weightless,\nbreathless,\nrestitute. I gotta delete that ima get in legal trouble lmao. just know, I would have done it if I knew. 😫 best interview ever https://t.co/A1WwomaNAF just woke up and saw the CRAZIEST push notification for The Pattern and i scrambled into the app to read it but i can’t find what it said anywhere and now i’m scared i was hallucinating.. Yes! I posted it with the film loosies but i wanted to give it its own moment 🖤🖤🖤🖤 I was writing a really important song here I jus wanna remember it forever https://t.co/EIJBukRN62 @keIseazy @paytonselzer Dey gone. I missed the all black. But they were so fun!!!!!!’ writing writing writing 📷: @paytonselzer https://t.co/dKcy7ZESiW bold of u to assume I haven’t been intimate with most of the women “on my side” 🤷🏻‍♀️ https://t.co/jM54Lka3UG @cloudaureum @SLlMJESUS every single day of my lifeeeee @SLlMJESUS I’m with him right now he not salty Hey tigerbob. Doesn’t surprise me that ur saying this and ur page has u crying about Brie Larson too! Stop being afraid of women who aren’t afraid to do what pleases them and not other people :-) https://t.co/uPyB1cXE0D I literally love all of them ok https://t.co/H2uiFnHqgP The cutest. I SCREAMED in the theater when I saw her in once upon a time in hollywood https://t.co/4lF4CZuvwA jacob elordi in the new calvin klein commercial is really damaging my “fuck nate jacobs” narrative. @yungbaegod @devulinme Because it came out ahead of the release or roll out for an album inbetween cycles. 🖤 @yungbaegod @devulinme I don’t remember confirming any of those things tbh @chrissyteigen this energy. she’s a fire sign isn’t she anyway just take care of urselves pls 💞💞💞💞💞 idk which one of you needs to hear this but: that bath bomb isn’t good for ur pussy. @alexander_olly i only see facts. alessia in her bag rn foreal @alessiacara https://t.co/hUh4jE3l7W Yeh ur right I’m gonna delete everything lol I was just inspired by the similarities https://t.co/do5zMKdFJ1 @goldenbIush I guess I realized some things were similar but I was watching old videos today and was like WOWWWWWW this is actually super parallel!!! maria was in line at a store and i went to toss her something to add in the cart and i had keys in my hand and accidentally threw the keys directly at the guy in front of her.\n\nguy, if you’re reading this i’m so sorry and probably won’t forget this embarrassment till I’m dead. @orionnichole @gucci these are stunning Orion !! I did a really awesome in-depth interview today about music and existentialism within the millennial identity and billboard pulled the quote “it’s a miracle I haven’t killed myself yet” as the headline.\n\nstan twitter humor ain’t really connecting in the real world. I only had chickpea ones in my kitchen that morning 🤷🏻‍♀️ I love corn tortillas it’s nothing personal lol I was just using what I had available https://t.co/xnOEja70nO It’s still fuck Nate Jacobs Anyways I gotta stay off twitter till I watch the euphoria finale but I been so damn busy. bye see u soon happy birthday squish\n🖤 @yungblud 🖤 https://t.co/0mluZ5pdUk It’s doms birthday at midnight so I can’t watch the finale of euphoria :/ badlands still bangin 🖤 thank u https://t.co/UrfTCQCPLB i will be lonely a lot forever and this brings me peace RT @neutral_fleur: https://t.co/WKt3rj8bl7 I’m gluten free so I made the chickpea flour tortilla chips myself at home. firm tofu + beyond or impossible meat scramble, avo, onion, rainbow bell peppers. Salsa, hot sauce, and a homemade cashew crema. Salt pepper garlic powder cumin lime juice! https://t.co/BJS8PMDM4f https://t.co/VMJ5D4Zims Omgggggg omg omg https://t.co/wrNkcXeiDH VEGAN CHILAQUILES! I been plant based chef of the year these past few weeks. \n\nplant basedgod we in this bitch NZ https://t.co/3XVu6V0N3Y film randoms 🧚🏼‍♂️ https://t.co/4pCxpBy32g @hopIesskingdoms @aworldaIone Mind ur fuckin business @aworldaIone No, I, didn’t? you know,\nthe good die young,\nbut so did this,\nso it must be better \nthan we think it is. 🍒🍑🍋💦🌊 https://t.co/1BytTwtcWQ whatever you’re expecting it to be, it’s not gonna be that. no matter how smart / on-to-me you think u are ;) I usually favor the darkest of the dark songs on the record but my favorite song right now actually has a hint of bubblegum. It’s amazing how all these genres appear on the album but it still somehow manages to sound authentically and earnestly like *me*. so many of the new songs are special little babies to me. they are all so different. truly the best and most concise songwriting that has ever come out of me. 🖤 just wanted to tell you that. brat®️ https://t.co/pkp9b08YQ3 i love casey frey but I don’t love that i can’t listen to tame impala in public without bursting into laughter bc of him Why would you post this :/ I didn’t want anyone to see this.... https://t.co/9UBhIz4hLd I could prolly win in a knife fight but a bagel would eliminate me https://t.co/zU8iXfx4OE yeah I’m trying that too! lol https://t.co/QMrVAeLWOj guess I never brought it up specifically. And also I used to take rly bad care of myself and eat it anyway. but I can’t anymore cause I gotta be healthy for you guys 😭 https://t.co/t4rW7wgWGP within t-minus 80 seconds of eating it my belly swells up like I’m legitimately 6 months pregnant and I feel like someone tryna carve their way out through my bellybutton haha. it ain’t fun. https://t.co/aVuchIdUjZ one of those....people who will straight up keel over in pain if they have gluten? yes haha. https://t.co/ZCQTSdscxO the best gift I ever got in life was Cheerios being gluten free. shit not tryna spoil anything. saving to my drafts !!!! euphoria is 100% still *chefs kiss* stan halsey for animal facts https://t.co/tJAtIKy1UE even ya own fans be doing it for the clout. damn. ur absolutely savage https://t.co/rJAX9n6WZ1 got my entire kneecap tattooed so now I’m officially not afraid of anything RT @nowthisnews: ‘Many people know that I was working in a restaurant when I got elected, but they don’t know why.’ — Rep. @AOC opened up a… Blockedt https://t.co/PJvVOZWiWh easy, scorpio rising. https://t.co/mpYTWcaLSV Haha I didn’t mean I should play her! I meant I’m just excited for more spinelli content. I think I accidentally based my whole identity on her https://t.co/Qo3KjstxUf my ashley spinelli moment has FINALLY arrived https://t.co/SM173GpTCi just saw two bros trying to ride one bike in the most hetero way possible. mans was going .01 mile per hour cause buddy on the back damn near had his feet on the ground so he wouldn’t be touching guy in front. how do straight people function???????? I only miss baldsey cause it’s 102 degrees in London i miss baldsey “is it too crazy?” 👁‍🗨 @JordanFish86 @olobersyko https://t.co/Q2LJoE8YaP 🖤🖤🖤🖤🖤🖤🖤 https://t.co/Zft3P2FQsS @tyszal An ancient relic am I having a fucking stroke https://t.co/gBnXWt2XYp vous et moi et le diable sont trois https://t.co/Cfv3LxQ37m Purple ! https://t.co/zPFt7GOz2z Turns out I’m lack toast intolerant https://t.co/RFjkT6GfR6 Bury me in mine https://t.co/d1VPMFr58Y still glitter fairy sometimes sis. I covered Anthony’s laptop in holographic chibi stickers last week https://t.co/vspEQbrTbn No not pretty much. I literally WAS https://t.co/9Q4WTBaSFl child I still love space buns !!!! https://t.co/pDk6dyo1Ok you’re being SO loud https://t.co/lTTc16a9VT I wear my crown with pride. Sorry for every and any awful trend I accidentally started tho https://t.co/PRDegJfPDH “Date With Harry &lt;3” https://t.co/Sa5M2JJx8T this one cuts DEEP https://t.co/rA1qm7i739 turns out i wasn’t born from a womb in 1994, i was born in 2014 on We Heart It ♥️ I’m 5’4” and size 7 shoe! https://t.co/ss1smAekyn https://t.co/DtxjHrjQ6x https://t.co/OVcEOqGDp3 In my defense my assistants name was strangely on it too so she opened it 🤪 https://t.co/CnWcNPnrRO Sorry! I was live tweeting a tv show without spoilers so it was pretty limited to “omg” and “what?!” Haha https://t.co/j7H8hsH0a2 WAIT WHAT Euphoria’s Nate is so far one of the most complexly awful fictional humans ever. A Day To Remember’s video for “All I Want” was truly the greatest crossover moment in history to me at 16 years old. for Christmas this year I want @mPinoe to step on me, thank you peak bi gurl evolution in São Paulo https://t.co/78mUaKYk1q I feel bad for every animal thats dealing with earthquakes and fireworks this week :( pls keep ur babies close. I miss mine so so so much and wish I could hold him. Thank you brasil 💖 The nerd alternative to being a HS quarterback stuck in his glory days. https://t.co/UxrU9eAlGr Im superrrr proud of you!!!! https://t.co/xi0RojAKWV I was! but I still took AP exams for lang &amp; comp, lit, psych, French, gov and fine art haha. really putting them to good use these days lol. https://t.co/LmyVqOQMRU sheesh. just saw AP exam scores are coming in and immediately got a feeling of terror in my stomach. I graduated high school 6 and a half years ago but shout out academic anxiety for being impervious to time! hoping you all got 5s and if you didn’t, it’s ok u did ur best. I just don’t picture myself as a 25 im more of a 24 I think https://t.co/4DV27MYXTk I don’t wanna be 25 how can I die before September mama said knock u out \n💪🏽🕷⛓💎\n @donslens https://t.co/vOznz0SF04 Finally got my cute anime side character haircut!!! Hair b growing! https://t.co/8UVMPWtaGl me, dumping a puddle of sweat from my baby oiled body beneath my costume, thinking to myself “yeah wear latex for this era. awesome idea.” Details https://t.co/YOgsdvydBo 🤮🤮🤮 $ick @DonsLens https://t.co/loijzxGX5o Brasil is so 😍 and say I love you by sending a mariachi band playing Oasis to greet your girlfriend 15 minutes before she leaves for the airport so now she unfortunately has to murder you https://t.co/YtjPKkvmOa I have never been so tired in my life I just said “I feel like I’m on planet Zenus” ???? Spider food https://t.co/Smp7R9gCHT @dreamsiinflate @flourishedfern ʢᵕᴗᵕʡ RT @dreamsiinflate: Brendon Urie deserves all the fucking rights thank you very much https://t.co/VKTX3NLCUZ 🦋 @taylorswift13 https://t.co/1iI2tCr8my Idk why I made the taco sexual. Happy pride. #mexicocity @donslens https://t.co/8yqUf6l0tZ I lub @thisisLANY THIS IS SO FCJKING CUTE https://t.co/KZRYHIU1hq yeppppp https://t.co/jRYNEceOxO you’re like a painting \nand the colors blow my mind, \nbut I spend morning until night \njust trying to keep you in the lines.\nBut honestly I love it \nwhen you catch a certain light.\nYou can transform \na thousand times\nand I’m still proud to call you mine. hell yeah I will be https://t.co/OL0FtIvfj5 It’s godly https://t.co/aV7xutKKuF @feeIsomething Wrong i lose my phone once a week but i have NEVER lost a laneige lip mask so that’s that RT @CapitolRecords: RT to vote for @halsey for #ChoiceFemaleArtist at the @TeenChoiceFOX awards! #TeenChoice #Halsey https://t.co/tLcTVqiPF7 RT @MandaBrown22: I went to a women’s right rally in Columbus today &amp; took pictures of everyone’s wonderful signs. So here’s a thread of si… “pop’s queen of chaos” says thank you, @RollingStone https://t.co/ZRYslUdiV2 RT @RollingStone: Halsey appears on our latest cover. In the in-depth interview, she discusses her “manic” new music, sexual assault and ma… the more things seem to change, the more they stay the same. https://t.co/tZu0yj6jKK @aureumnightmare @MostRequestLive @AskAnythingChat @OnAirRomeo @iHeartRadio Fun!!!! I’m about to go onstage! ♥️♥️♥️ @niightmarenik This is notttttt me haha. I actually eat really really really clean. I just like to treat myself sometimes!!! u can watch my @MostRequestLive  @AskAnythingChat here:\nhttps://t.co/0whzGztKwD ⚡️💕 @OnAirRomeo @iHeartRadio IT WAS YOUR WORLD BABY AND I JUST LIVED IN IT!!!!!!! Some of my favorite interviews happen with @zachsang1 @ZachSangShow he asks such great questions and actually allows the time to think and respond. https://t.co/sXNgLVBqAl No not at all! Zach is amazing. He was continuing on to say it’s not true that having power protects women because they are unfortunately still susceptible to abuse! https://t.co/jUytuevSD6 RT @romanmourning: GO FUCKING OFF @halsey!!! https://t.co/X3zOKDnQ4s @sellachich I always have been! It’s just extra nice to date someone with the same taste in music as you! definitely accentuates your love for it. ♥️ If he’s slowly walking down the hall, how the fuck he is faster than a cannonball? Besitos ❣️ @mtvmiaw 📷: @DonsLens https://t.co/0zQObsvdN0 lmaaaao fair. https://t.co/DTHrNGN1BG muchacha con el cabello azul is my new name please refer to me as nothing other than such from this moment forward https://t.co/TRZTQuoLHs Soooo excited! https://t.co/U01CJZR7nO @rosecolorboy @LlTTLEBOYBLUE I just took a melatonin turns out I’m 100% bouta pass out. Ps I saw ur other tweet and I’m proud of you. @LlTTLEBOYBLUE Ok but also see: dying my hair constantly, using tattoos as a coping mechanism, tweeting my feelings at 3 am, and thinking liking ghibli films is a personality trait shae honestly don’t do this to me rn https://t.co/ggHS9jx2Na Idk if I like dark slash lights out mode :/ I’ll give it a few days but it feels weird ok I’m in night mode now everyone leave me alone I keep saying I’m gonna do it and then forgetting but I’ve done it LEAVE ME ALONE I’m gonna charge my phone I promise tag urself I’m the fig newtons one. https://t.co/0TU66Ot5hx RT @ZachSangShow: Our full interview with @halsey is up now!!-- https://t.co/v4EYQTiHy8 https://t.co/5a8cmyJ43k Thank u beautiful angel babe !!!! 👼🏼 https://t.co/IBFLDjC8tR me: “now I know why I’m feeling so weird it’s cancer season” \n\nmaria, my cancer friend: “I’m here for it.... and I’m here for YOU.” had to do it. https://t.co/aS5n9OyBOO Have you ever seen me without this stupid wig on? That’s weird. https://t.co/Kdy39vCSsp true. but some people do and that’s why I have the best weirdo fans and that’s all the matters. 💖 https://t.co/vyXX6lwuM4 THE HOT ISSUE @RollingStone https://t.co/PnyyAQB6BN when u have one hair that won’t stop doing That Thing™️ https://t.co/vVVvCqyNGy *release date? I guess lol https://t.co/7pZ40vFLX0 I promise when my album has an official release I will be the first to tell you :) Zendaya and Hunter are breathtaking. I’m just wow @euphoriaHBO @feeIsomething @HoodratHalsey I get what u mean bb. Between me and u gonna delete that tweet so people don’t give you shit! @HoodratHalsey I don’t particularly drink anymore! A glass of wine a few times a month is really my limit. Or I nurse a pint if I’m with Dom haha. @halseyrem He here https://t.co/ADBX6lDQOo I’ve had the worst headache for like 48 hours straight and I’m so upset I can’t figure out how to make it go away. :( and yes OBVIOUSLY I’m drinking water and taking OTC pain relievers lol next saturday is my @MostRequestLive @AskAnythingChat w/@OnAirRomeo &amp; @iHeartRadio ⚡️💕 send ur questions here. ask fun stuff!!!! \nhttps://t.co/YTGXhEmkCo HELP https://t.co/EQehvKu4Xa If I die they killed me. https://t.co/KuEyvYzPoP Ashley is my real name hahaha https://t.co/Do9OE0OnHo The world will never know https://t.co/mHtAr6xwJc Black Mirror episode about a popstar named Ashley with colorful hair. Existential crisis: Engage. Absolutely can do https://t.co/JtT5b4Ugwc maybe one day haha https://t.co/i2iY2sIHmu I play violin viola and cello! https://t.co/iMXGv8QChq Yo I was like 9, hence the practice tape on the neck haha. I obviously improved. Also look at my baby pinky trying to balance the bow WHY IS EVERYONE BEING SO JUDGEMENTAL I WAS A CHILD !!!! https://t.co/OVq5q6ho3o so much to unpack here. the evanescence shirt. the hot topic pants. the look of determination. the Costco glasses. the secondhand violin that got me into music. this post is a whirlwind. https://t.co/BFESTnO0k3 Doing 2 intimate shows in Mexico City and São Paulo while I’m there for the MTV MIAW awards. Tickets go on sale Tuesday. Can’t wait to see you guys there. https://t.co/iOfyVnXFaE https://t.co/99f41dhy38 I am wildly honored. Tonight was a very special night for Ashley. Halsey had to take the passenger seat. Thank you for this honor @SongwritersHOF https://t.co/mDk6AA2l2L @SongwritersHOF @GettyImages 🖤🖤🖤🖤🖤🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼 I am absolutely beyond honored RT @SongwritersHOF: Congrats @halsey on your induction to the Songwriters Hall Of Fame you may say you are a songwriting \"toddler\" but you… Imagine being this iconic https://t.co/Fyar6m5gHW what are some POC led LGBTQ charities that you think need more attention? @wheelsupemily As is an old bruise ;) Me going through immigration when I have makeup and wig on in my passport photo https://t.co/HawEAIlYm1 a partner who accepts you for who you are, is patient and understanding with all your evolutions, but politely encourages your authenticity because they know the most uncensored version of you and they want you to retain it. that’s it. that’s the tweet. I am chartreuse \nlike an aging bruise.\ntender to the touch,\nfragile from abuse,\noccasionally excused\nwhen used\nto seduce. \n\nand I might have, back then\nbut these days I refuse. Sleep me is the least reliable and most convincing person of all time. You could wake me up and tell me the house was on fire and I would have an amazing argument as to why it’s fine and I should really stay in bed and you know what, why don’t you get in bed with me too? I fucking love these small shows we’ve been playing I feel like myself in my fuckin skin again CAMDEN https://t.co/Vg2vujuNGb RT @MyHarsh_Reality: THE QUEEN OF FEMALE EMPOWERMENT SLAYED IT TONIGHT. THE SENSE OF PRIDE AND STRENGTH IN THE ROOM WAS INSANE 🖤 WOMEN DON'… RT @iamsuckeriam: Halsey getting a room full of queer kids to scream “I WILL NOT BE AFRAID” after two women were beaten for being gay in th… send me ur questions &amp; i’ll answer them 6/22 on @MostRequestLive @AskAnythingChat w @OnAirRomeo &amp; @iHeartRadio ⚡️💕\n\nhttps://t.co/YTGXhEmkCo Cute cute cute cute https://t.co/2vB0XrFyXg Who Is the Boyfriend and Who Is the Girlfriend? 99% of People Get This Wrong https://t.co/qD2iQk2jxY RT @41Strange: Persepolis (2007)  \nDirectors: Marjane Satrapi &amp; Vincent Paronnaud https://t.co/axgt9BHZSB I would uhhhh die. Haha https://t.co/eoZvCiJETc Nope just me playing as many songs as I can till I pass out. https://t.co/ieSgQeKmnU Actually CALUM I tweeted it during amnesia https://t.co/IPl5zntfLK how to get ready for a show: @BTS_twt ⚡️🌸 https://t.co/wOgPiYIhln ☺️☺️☺️☺️ https://t.co/4uEzg1bIos I love stories like this and I’m so happy you guys have each other 🖤🖤🖤🖤🖤 https://t.co/TjcIz2GVw4 Anyway. I’m excited. Lol. Not sure but I’d trust me over Ticketmaster probably :-) https://t.co/awFNbiOCdQ Probably just misinformation on the site hence the “approx”. It’s full capacity! https://t.co/UIp6z1RIxQ as if I’m playing a 1500 cap show in fucking Camden tomorrow One of my favorite things I’ve ever written 💕 https://t.co/t8D9PW3vus “Apprehended” and “children” in the same sentence. Man fuck absolutely everything about this. https://t.co/LtRPusSxr0 I’ve been watching 5sos play shows for like 5 years now and they are just so so so so unbelievably good live. feeling supersonic. excited for wembley tomorrow!!!! https://t.co/nvVB8YSUSj sorry nicky stole ur parking spot https://t.co/eMaqd6nQ3V I looooove this bb https://t.co/ww9PiVlW4L @newamericanas ceiling....please. I literally did 2 performances, 3 interviews, and a photoshoot today. I will ALWAYS find the time to be extra. I feel like I need to post my art more cause every few months it seems like I get a wave of new fans who don’t know that I paint! Oh and anime. I weirdly don’t have a particular style. I used to do a lot of photorealism (when I had the patience or the pencils), I love really detailed pen &amp; ink, recently this contour line drawing based style, and lots of acrylic or oil surrealism featuring cute people with weird faces. https://t.co/5sx8g6Ml4G I can’t stop drawing fuckin weird shit. haha! https://t.co/iFkjxn7uqJ there wasn’t a tutorial LAUREN https://t.co/MAO9SMSgfC i made a triller account bc u guys all have them and i felt left out https://t.co/F6es5wd40X This is it. This is the peak headline of my career. Goodbye. https://t.co/XdZPzs9Uj9 I’m dying listening to @grimmers do an impression of me doing jazz rn and, the now @jonasbrothers approved, SUCKER 👅 @BBCR1 #LiveLounge https://t.co/taA9AamJHj NIGHTMARE! in the one and only @BBCR1 live lounge. https://t.co/uGdqYQl66z A whole jobro hat trick! 😍 https://t.co/KemKfHPhjh 😍😍😍 I love you guys too!!!!! And I love this song! Thank you!!!!!!!! https://t.co/XiSvi3Zt7x Holy fuck https://t.co/Zxk8knr33N @toothbats @elijahdaniel I have literally no idea what’s he’s talking about. Is this a like a bit I don’t know about? @elijahdaniel ???????? Uh??? Haha @lucyj_ford This was literally minutes after I left you hahahaha she’s electric ⚡️ https://t.co/RYzmpcOw3d tie-dye tide pod tadpole baby. https://t.co/NJV0aPSHDx London you know I wouldn’t come here without a few tricks up my sleeve....\n\nSee you for one night only, June 10th, for an intimate show at the electric ballroom. tix on sale 5pm tomorrow, June 5. 💥 https://t.co/iOfyVnXFaE https://t.co/3qQ3uqSl5U London 🖤 Eid Mubarak babies! be blessed and be refreshed 🌸✨ Thanks to your ever-inspiring action, we have collectively raised $100,000 with the proceeds from this shirt, for @yellowfund. Thank you. 💛 https://t.co/QlAr4VBLUl UK BBs! Help! Me! Pick! A! Song!!!! https://t.co/BihN2lOqGK LMAAAAAAO @anthonyli @jasonaron https://t.co/m9WPxqLdp5 Manic ass. me to my managers at 11pm: “listen I really need to sleep so please don’t bother me with anything tonight!!!!”\n\nme, awake at 4 am with a million ideas after telling my managers to go to sleep and leave me alone: https://t.co/j9HfmS3Ejk I actually started messing with my mic bc I am a huge TBS fan! nice catch!!!! https://t.co/blIGhEy5dx RT @iHeartRadio: How does @halsey make this look so easy?! #WangoTango https://t.co/0qbAwwMus5 4 years ago my debut album wasn’t even released yet. We have come so far. Big emo feels tonight. I love ya. happy 2nd bday Hopeless Fountain Kingdom. I wanted to make a baroque-pop album inspired by the works of Baz Lurhmann + u guys said “sure we love it! also we are gonna change your life with it so have fun!” my first arena world tour and first songs on the radio. YOU GUYS DID THAT! https://t.co/8VlSgcHk6d @bedroom93 Cinnamon Toast Crunch I love Shawn Mendes RT @21sst: Let it be known that Donald Trump supported the crooked cops that lied about these kids crimes. He paid for FOUR full-page ads p… Awhhhh this is so sweet! Wow!!’nnn https://t.co/QN4E2oUrHZ Oh no I meant FLAME like roast me !!! https://t.co/WmcfQNmdct People are gonna think this is me and flame me for it merel come on u cant do this https://t.co/NM6SuzH2kD I won’t smile but I’ll show you my teeth https://t.co/BWKmsGeL9v Click bait fuck This is for sure about to become a clipbait news article and I’m just shit posting lol Hold on I think you just did something https://t.co/mYRx1Etp2g ugh you’re so right https://t.co/3MLVxpgBL0 If rpatz is Batman I wanna be the joker heymomimgonnabeamoviestar https://t.co/zY2JqgcVsD Are you talking about urself or what https://t.co/ZhhKXSfFhL https://t.co/pgvSTGSmg1 freshly washed boyfriend looks https://t.co/v06VRKLITL 100% of pregnancies are caused by ejaculation 🤷🏻‍♀️ why don’t u control that?????? https://t.co/cw4edtdJ6U following bc i feel like it ✨🌸🕷 THINKING AND CREATIVITY !!! GOOD THING I DONT NEED THAT RIGHT NOW ! UPSIDE DOWN SMILEY FACE !!! https://t.co/OzNhdt0l0p LMAO OH WAIT IT SAYS POWER TODAY FOR THE FIRST TIME IN 2 YEARS! LADIEZ WE DID IT!!! Bad At Love, sponsored by Co-Star https://t.co/if9heOIeAN FUCKING TWO YEARS https://t.co/6TbyqBiRJe sparkly and cute ✨ https://t.co/OdButIDOuU I have a uterus, mark. https://t.co/EkCjmBzY6F Shout out to the low life who papped me going to the doctors office! Got the fucker back. Say cheese! https://t.co/HZh0nx09cj @ChrisEvans Earring is a whole mood Everyday I strive to have the confidence of the man who gifted me “Just Kids” by Patti Smith this year and told me to “check it out” cause he thinks I’d “really like it”. @Michael5SOS @gibsonguitar Michael dis so so so so cool. RT @whatifkingdom: you say chameleon, i say @halsey https://t.co/NmsYh76Vqv BAD!!!! Hoping that it heals in the next two days haha https://t.co/p54IhFWdF4 v excited I get to play nightmare this week at 3 different California radio shows. attention all moms and dads: being hype is not optional. https://t.co/x04gQDO7vu If people r jerking off to my broken toe, what can I really do about it https://t.co/ponJZHcPvh today: \n\nI was trying to save a hurt butterfly in the jungle. I broke my toe. turns out the butterfly was already dead. I have alien feet I know. I sacrificed having nice feet when I committed to a life of dancing on stages and saving dead butterflies. this hurts. https://t.co/RphsngRUsy @nikszabo @kkyyyliee Epic let's be clear:\n- abortion is a right\n- abortion is legal\n- abortion is YOUR decision\n\nstand with me, the @aclu, and the abortion providers fighting on the front lines. none of us can be silent. #stopthebans https://t.co/KYym1fJYxp https://t.co/9rlpprexBv https://t.co/BPu8Bp3RsM https://t.co/MhByOOpxTV me: 😕\n\nCarol Danvers: belonging to no city and belonging to no man, not owing anyone a goddamn thing, not smiling but showing her teeth, tired and angry, meaner than her demons, bruising anyone who tries to break these walls down, not playing no games.\n\nme: 😃 what a wife https://t.co/CltTYkWqkX RT @halsey: birds of a feather... tennis skirt adidas superstars. bonus points for space buns https://t.co/VFUskWqpgv I agree. https://t.co/Qq1SKhovsZ both hahaha https://t.co/SkOtnIMCzc “Are your fans more tiny shirt big pants or big shoes big shirt?”\n\nTell me why this made complete sense to me @babyhnoey Tell him Stream Nightmare xo ashley but in tiny font https://t.co/1mtynwSXap thank u for an incredible release week. i hope ur enjoying Nightmare &amp; if u haven’t listened yet, listen NOW \nhttps://t.co/W5rpFGe4aQ https://t.co/4GLJ4MWPxa wow @missmaro slayed these portaits. bohemian rhapsody vibes !!!! https://t.co/RrHhAabA1Z thanks @Spotify for adding Nightmare to today's top hits, u can listen now!  https://t.co/o9JSCGuGJW ayyy. girl squad on @NBCTheVoice https://t.co/C6GOzLNTw2 This is absolutely a personality trait and I am the same. https://t.co/UY0y1Xk56V 66.6k followers. A cursed imaged. (Ps love u) https://t.co/Wla6KY9SJn @itsmekaram Me dis time A mullet is a girl’s best friend. 🍏 https://t.co/CI0V8ZgMre so I don’t usually talk about stats like this but I found out Without Me is the #1 most played song on pop radio this year, and Nightmare is the most added song at radio this week. I am so beyond speechless. Thank you for taking my voice to places I never thought it’d touch 🖤 Uploaded nightmare from the armory for those of you who missed the livestream. This was absolutely chaos thank you 🔥 https://t.co/TH65ewXJAR happiest 🖤 @BTS_twt \n📷: @yasi https://t.co/bj6LE5LPOJ he is safe. this is adorable. https://t.co/fVvSteUCNC https://t.co/aj3yqor2RH so is jimin. let’s do it baby I know the law. https://t.co/nfxMXFATpU just landed in New York. somebody tell jimin and hoseok to hide before I find them and box them for clowning me onstage at MetLife. my own home state. the audacity. 😤💜 What’s your Venmo. I’ll pay your ticket. DRIVE SAFELY PLEASE!!!! https://t.co/rZJxRXb7Nj Been doing the backbend for like 5 years now, if I can’t walk when im old I’m blaming all of you. OK! Goodnight foreal this time 📷: @yasi https://t.co/P31KZSmCfj @FRESlTA I had to walk THROUGH the crowd to get to the stage! Humbling and amazing hahah. one more thing: \n\nthe rooms are bigger, the radio plays the songs, but my love for you will always remain the same. If you think this “direction” is “new”, it’s because you weren’t here when it all began. 🖤 to those of you who had my back for years in tiny clubs, thank you. https://t.co/vle5R6BsVe @feeIsomething Ok same. Ps saw u during ITS love u Not a chance I could be happier rn. Love you goodnight ❤️ we’re just getting started.... @teddyice13 @ArmoryMn This brought tears to my eyes. Thank you so much for letting me be a small but familiar part of your journey together. i LOVE you. i cannot even begin to explain it. you take my breath away. a whoosh in my chest like a vacuum cleaner that sucks both corners of my mouth up into a smile. I love you. @Theunlitfren You: a beautiful passionate beacon!!! I saw you so many times!!! @campcopes My PLATINUM certified B SIDE castle ?! Yesss bitch! Haha we were only gonna stream nightmare but since I’m nuts I pulled a last minute and wanted to stream some fan favorites so our amazing team did the best they could to cut all those songs together in less than an hour! They crushed it. https://t.co/59KgKQAbic Thanks for being patient with the stream. I wanted you all to watch it together. family styleeee. I feel on top of Venus!!!! that mood when 8,000 people show up with 2 days notice to see you play a surprise release show in MINNEAPOLIS!!!! There’s a reason this is one of my favorite cities to play too. And they fucking proved it tonight ❤️ 📷: @yasi https://t.co/dJSo33yZLy It’s going RIGHT now. Lmao fuck my life. Enjoy guys. 🖤 https://t.co/fHQykQKvwv Who says you won’t ;) https://t.co/a52mpzXhXH YES! Everyone was SO respectful and in the moment I couldn’t believe it. It was amazing to watch I felt SO connected to everyone cause when I looked at them I saw right into their eyes!!!!!! https://t.co/lmAF35T1SU Guys holy wow. Just wow. Craziest. Show. Ever. I just got off stage and these are some fancy ass cameras so the live stream is gonna be 30 mins late. Thanks for bearing with me it’s gonna be worth it!!!! Minneapolis holy shit!!!!! https://t.co/fHQykQKvwv Tonight’s gonna be so fun FUCK! That’s why there is a stream! Haha so no one is left out! I know you guys love watching the videos after and that’s why I hired an entire crew to film it for you hahaha https://t.co/uA5DvbPEoA Yeah and I want the video to show how amazing and passionate my fans are. Not a sea of cellphones 😅 https://t.co/pCSIf1HJhg I saw u guys were upset about the phones tonight. I’m gonna let u guys keep em but u gotta promise me you aren’t gonna have em out during the show. The whole point of this was to create a once in a lifetime moment for us. I only get 1 chance to sing Nightmare for the 1st time 🖤 TONIGHT: A SPECIAL EVENING \nLIVE AT THE ARMORY\nhttps://t.co/TH65ewXJAR\n\nMinneapolis:\n5pm CT - Doors Open @ArmoryMN\n7pm CT - Show Starts \n--\nYouTube:\n10pm ET / 9pm CT / 7pm PT - Streaming Performance  Globally https://t.co/eNYdKRsAuW @hfkayIa @ArmoryMn How venue gonna allow us to have more people inside tonight. 🤘🏽🤘🏽🤘🏽🤘🏽you can pick up your wristband \nstarting at 3pm at @ArmoryMn Box Office. first come, first serve. no rsvp required. see you tonight. make sure you check your email and pick up your wristbands today for the MN show 🖤 @joanjett https://t.co/33ee34QROH ICMYI: Nightmare video out now\n\nhttps://t.co/xKFnYOGnzY “Do wit my bed” !!! https://t.co/Ke7577chN0 special edition NIGHTMARE shirt. 100% proceeds go to the yellowhammer fund for abortion accessibility. 💛\nhttps://t.co/TQ0m3CxC9L https://t.co/wxEJHBCdho @ine8s You are unbelievableeeee !!!!! RT @ine8s: I've tasted blood and it is sweet #HalseyNightmare (ig: ine8s) https://t.co/L3ezEu4WXV @badlandmermaids we are so much the same ? I love them and I hope New Jersey showed them the best time ;) https://t.co/wLeinSOPeB @sighingzach Literally what? Haha no. RT @coupdemain: “I'm tired and angry, but somebody should be,” says @halsey in her powerful new single ‘Nightmare’ - an ode to not giving a… Challenge excepted! Thank you for playing my music in the state that made me an artist! https://t.co/7c1G06NnY4 I just heard 3 different songs of mine on @Z100NewYork in the past 25 minutes lmao. are y’all good over there? Not tour! Just the voice 😅 sorrrrrry. We got a long album to go folks. https://t.co/EDVOCCmfab She’s an icon. It was a no brainer! We’ve done interviews together and she presented me my billboard women in music award a few years ago! https://t.co/Ea0W1zOlNX some of my favorite stills. there’s too many to go through. https://t.co/AvlVJJ6dAH RT @nowthisnews: ‘I’ve been polite\nbut won’t be caught dead \nletting a man tell me what I should do with my bed…’\n\n— @halsey’s new track #N… polite 👼🏼👼🏽 @Caradelevingne https://t.co/trPA9V2FO4 It’s all right here bb 🌸🌸🌸🌸 https://t.co/h4yhSHnMGY Drought: over. Hi hello I love you. https://t.co/AhCJXVJ9i8 @gayotine Ahh I’m sorry! 100% noted and tweet deleted. I’ve heard people say they prefer either and I went with the wrong choice! Thank you for letting me know! This is SO EPIC !!!!!!! https://t.co/l7cehEsPbc We almost used shibari on the tour in 2017 but I killed the idea to save it for when we could REALLY nail it. some of you probably remember this pic from before the tour. inspiration for the nightmare scene ❤️ https://t.co/HmCVrkIeE4 nightmare is so close to #1 on iTunes wow wowowowow @applemusic 😈\n\nhttps://t.co/5bXwSZlFlJ so much love from @Spotify streaming #HalseyNIGHTMARE !!! 🖤🖤🖤 https://t.co/rtBrQxeSlt https://t.co/tLu9KXBpvl imagine getting onstage every night and seeing young women sweating mascara tears, lightning in their eyes, throwing elbows and raising fists, screaming till the veins in their necks raise under warm skin,\n\nand not being inspired by it.\n\nthis song is about you, for you.\n🖤 “IM TIRED AND ANGRY,\nBUT SOMEBODY SHOULD BE”. I’ve been polite\nbut won’t be caught dead \nletting a man tell me what I should do with my bed... NIGHTMARE OUT NOW https://t.co/x04gQDO7vu https://t.co/SbD6zbyMyX RT @HalseyUpdates: #HalseyNightmare @powersIiding I’ve spoken like 20 times! in the chat rn !!!! cause Minneapolis go hard. it’s always been a very beloved audience for me 🖤 https://t.co/fOcZqkUOL0 NIGHTMARE video tonight. i’ll be in the chat later. you’re not gonna wanna miss this. https://t.co/lMRxBQlcJc well boy do I have a song for you. https://t.co/lkMOXGhQKc FREE SHOW MONDAY AT THE ARMORY IN MINNEAPOLIS, RSVP HERE https://t.co/3TVEQXtfS2 https://t.co/Gfea7jG9PD Midnight EST / 9PM PST 🌒 You guys are in the time zones of whatever color your region is! It’s by time zone not country 🖤🖤🖤🖤 https://t.co/8exjnUVvCQ More coming soon. But just know, your exhaustion and your anger is good. Use your voices. Watching our own government be immune to our experience, and the social temperature regarding abortion is another fatal failure for humanity. This is deadly. Assigning felonies to people who seek abortion is a means to assure that those with that autonomy are stripped of their right to vote. And therefore perpetuates the cycle. i’ve always been open about my struggle with reproductive health and pregnancy. what happens to the body that I live in, that you live, is nobody else’s choice. i’m working on a long form video on up subject, but can’t just keep my mouth shut till it’s finished. watching the demise of our reproductive rights sends a sickening rage through my core. autonomy is the basis of our humanity. the ability to feel and the right to choose. can’t. it speaks for itself. 🖤 https://t.co/caybDAH79T all cowboy-ed out. gonna take off my makeup and make some ginger tea and listen to NIGHTMARE 100 times love u bye xo https://t.co/q3KEnfDvxn RT @cedricjoshuaa: C’MON LITTLE LADY GIVE US A SMILE. NIGHTMARE by @halsey out on 5.17. If you’re in the LA area make sure to check out the… Whenever I post videos of me dancing silly, having fun ppl r like “wow! she can’t dance!” Like yes ! Bitch ! I know ! That’s the Joke! when someone says “cowboy themed birthday party” and you already own the chaps @LilNasX https://t.co/domL4lpP5i @djgeordiegray .....yes. no sweet dream, \nbut im one hell of a night \n◾️ 5.17 https://t.co/30n8VUNQeU @yungblud excuse u !!! @newamericanas @vintageboombox @laufeenstra Its called therapy, seal. @vintageboombox @laufeenstra She knows I lub her @laufeenstra u need to get off stan twitter and get in a mosh pit then, miss lau. “little” lady..... NIGHTMARE 5.17 https://t.co/wePvUDucZU ➿➰➿\n ➰➿➰\n👁.     👁\n .:’ .👃🏼’ :, .\n      👄 https://t.co/hB4EfZTsdL “c’mon little lady,\ngive us a smile?”\n\nNIGHTMARE. May 17th https://t.co/ezZogX14fz happy mother’s day. to the moms, moms to be, could-have-been moms to be, want-to-be moms to be, to the aunts and big sisters who stepped up to be moms, moms missing their babies and babies missing their moms. today can be beautiful and today can be hard. thinking of all of you 🌸 I see he is still insisting on clowning me right in front of my! face! https://t.co/Bed6Lp9hzK been doing it since day 1 and I always will 🖤 https://t.co/gW769SuaaS RT @itsmelaurab: found a little something driving down sunset this morning @halsey https://t.co/2QcLoRmFOZ RT @glitterkweenbex: Can you tell I’m excited about finding @halsey SF clue? https://t.co/9nieQFea0c Anyway fuck page six, tell Madonna I love her. 🤘🏽🤘🏽🤘🏽 https://t.co/WRliUSfYcX @mickie310 It’s the same parameters I gave every other city !!!!! SF / Oakland https://t.co/khTYg9LbhZ tried &amp; angry 🙄 https://t.co/uZrLVu8SJt 💉💉💉 https://t.co/5q2Rxc5Z4W different https://t.co/AcYtgSGQ2n you should probably hope you don’t... https://t.co/YBNKlp7Lrs 💤💤💤💤 https://t.co/SAIHlytMhc New York. Lightning speed as usual. https://t.co/faNoomHS0x Los Angeles - Dallas - Chicago - Bay Area - New York City.\n\nI hid lyrics to NIGHTMARE in your cities. Let me know when you find them.... sweet dreams are made of this. @DonsLens https://t.co/wJzHfUM9gZ gotta wake up. \n\ncome back to life. new single. NIGHTMARE. may 17th https://t.co/RT7fGXvb5i back to the Badlands for Night 1 of my series for @WebsterHall tonight we enter the Kingdom. I love you. 📷: @DonsLens https://t.co/DseQ3oo5gq what a beautiful thing to perform my first album tonight, in its entirety, in front of the fans who shaped me. to realize I truly keep a record of the wreckage in my life. and you celebrate it none the less. \n\ni’ll see you tomorrow. you are the blood in my veins. \nI love you. @Iuvwitch It obviously took some time to get the tickets back. I tried to do something nice by making the tickets 17$ and an intimate venue and now I’m trying to do something nice again by doing everything in my power to maintain that original intent! I’m sorry for the delay Pre existing resale tix on sites from the original allotment are valid. The ones I got back and am selling today for the original price have to be picked up at will call with ID. https://t.co/Y3LJOkgIv2 If you already bought resale tix they are still valid. Only the ones you buy today will require ID for pick up. I took tickets back from scalpers for the Webster Hall shows. \n\n5:17 PM today I am putting additional NON. TRANSFERABLE (!!) tickets online at https://t.co/iOfyVnXFaE\n\nsee you soon. https://t.co/uHXufGLlBh https://t.co/BSxR7Ieehv https://t.co/PKAJPjoqXF https://t.co/ZfHMWoAKfu https://t.co/AIwB4VljHk https://t.co/RrORvIsZyN https://t.co/S6AELuqrK5 I’ve waited all my life 🖤 @BTS_twt 📷 photos by ig: @/samdameshek https://t.co/0MkCR43eMP sweet dreams 🔚 goodnight 🖤🔜 @93hurricanne Mine says “BABY”. I’m gonna be in labor one day and they’re gonna be like “yeah. We know...” cause I’m stupid and tired 😅😅😅 SORRY!!!! https://t.co/NKveI3Qc9r when u can’t fit on the couch bc\n \n...too many\n\n@bts_bighit 🖤\n📷 ig: @/nathangroff https://t.co/Hn4ZanJnRv this is absolutely wild. thank you guys for still listening. this week will probably be my last televised perfomance of the song so I hope I knock it out of the park for you 💗 what a journey..... https://t.co/IQaM1NjDXN @colorstripped @nytimes Unbelievable I know @colorstripped @nytimes A woman wrote it 🙄 What in the literal fuck is this @nytimes https://t.co/nRq7XkbU1c hurricane Arya confirmed Halsey stan.\nA+ mic flip. What are we naming the baby https://t.co/UZlUslaqXh I would love to, I STAN stan. https://t.co/Rdg2s88WPo I know what I’m sayin !!!!! https://t.co/H9c8SIdXd8 Mostly gasolines https://t.co/ctoAdH5pkA Better https://t.co/cjCNnoyczA It’s gonna be better https://t.co/PSetpJSfQd “It’s not every day that punk rock perfomance art feminists over 30 sell out the palladium” - @theebikinikill FUCK. YES. 🤟🏼 @LaLaChuu This is such a: look @HalseyInsiders he is so ʕ •ᴥ•ʔ its moments like these i yearn for the comfortable chaos of the stage. i sang this song to myself in the dressing room everyday on the last tour and it still fills me with the feeling of home. i wanted to share it with you. see you soon. https://t.co/yrZeljnNZG i: trust her.\ni: love her. https://t.co/EyJ9oCJ2pp mommy https://t.co/QUwet97Kbz what’s wrong with ashley :( https://t.co/Aj2HQGyYBn @nikszabo Not when I was little 😫 we rented apartments and def couldn’t have animals lmao that part too https://t.co/CYmU2xowLz It seems like every celebrating family has a different Easter tradition. My mom used to leave jelly bean trails all over the house and each kid had their own color. We’d follow the trails to our baskets and little prizes and candy. We had to pick them up 1 by 1 😫 What was yours? @Chimsmissingjam I did it on purpose so I’d have an excuse to not make eye contact with jimin at BBMAs Rubbed my eyes after peeling garlic. Goodbye cruel world. Prepping Easter dinner for your friends when you have a variety of gluten free, vegetarian, vegan, lactose free food restrictions means 5 different trays of baked ziti and a tired Ashley. birds of a feather... togepi!!!!!!! 🐣 https://t.co/2Xt6EG7gXE I just thought the tiger face was cuter 🤷🏻‍♀️ https://t.co/L3a7o9qb7J 🐯🐯🐯 meeeeeeeow 👅 #WeLoveTheEarth https://t.co/JJr6vmKG7U OH!!!! MY!!!!!! GOD!!!!!!!!!!!! https://t.co/mHouHHo1qc gang gang. #TheHandshake https://t.co/T1UVQlnSBr @orionnichole Abort mission ! It’s not about me!!!! It’s about the other women who work so hard in alt music just to get neglected by a platform that plays 90% men! It’s outrageous. https://t.co/qbE8ASlIKK the silence has a purpose. hand painted these overalls for @itsbennyblanco to wear onstage last night 🌈 https://t.co/TuiXrHY9tZ @badlandsgirls She showed me this backstage its amazing! I have an appointment on the Eastside in a few minutes 👀 https://t.co/vKMiN1l6Xd ♡ I ♡ love ♡ @turnoverva ♡ RT @notlesli: Nobody: \n\n@halsey: (っ◔◡◔)っ ♥ 𝓲 𝔀𝓪𝓷𝓽 𝓲𝓽 ♥ Wild businesswoman mom. I have never read anything more me in my entire life. https://t.co/wALUn9Kff5 I came out to have a good time and honestly I’m feeling really attacked right now https://t.co/QlnOkNibb2 me and joon handshake is actually a lot longer and more complex than the clip in the MV. we will show you one day 😊 https://t.co/i2Qes5NaE7 @districtonfire I wrote/sang the entire chorus in the streaming &amp; radio version! 💗💗 Check out the album/streaming version! It’s different 💗 https://t.co/PcmaXOzHCa I wasn’t nervous about that! I was nervous cause I’ve never done choreo in a video before! But they were so awesome haha they made me so comfy and gassed me up. 💕 https://t.co/9AkADAnvNO I WAS NERVOUS !!!!! https://t.co/cHFgMBnyVJ there’s a slightly different version on the album! check it out! 💗 @bts_bighit #boywithluv https://t.co/XOtcOPIbTk Thank you! The chorus is soooo addicting! It was stuck in my head for weeks after I left the studio! #boywithluv 💕 https://t.co/92GyurJ3Xi my pink dream with my pink friends \nthis is: #BoyWithLuv \nthis is history! @bts_bighit 🍿🍧\nhttps://t.co/bewfhBtjzh Been in 3 time zones in 3 days. #SleepScheduleIsOverParty This has been a historic opportunity and we’ve had a blast. 🚀🚀🚀 I’m so glad to see everyone excited + talking about #BoyWithLuv! all your ???s will be answered when it’s here! ARMY thank you for embracing this collab + remember your boys love you + always want to make you happy. And as for my crew I can’t wait for you to see this side of me! Just wait till you hear “Africa” by Toto https://t.co/vnfgaRoedF thanks nick!!!! massive honor 💕💕💕💕 https://t.co/pJyXhuXlyz can’t believe I’m saying this but I’m honored to be receiving the Hal David Starlight Award at this years Songwriters Hall Of Fame Gala 💕 joining this list of writers who have inspired me is top 10 career moments for me https://t.co/lfMKzkw6bj https://t.co/VwGgHjIk7i woah. whattttttt https://t.co/mz9KfHTgrn tokyo my second home foreal foreal 🌸 \nみんなありがとう！だいすき https://t.co/Hv74C5XV1I showtime baby 🎥\n@bts_bighit + halsey\n\nhttps://t.co/y0PiWH4rrq\n\n#boywithluv 💗 This is CRAAAAAAZY who is this girl holyyyyyyyyy https://t.co/b9gDSmqVSQ every few months I post a pic of my hair without a wig on and there’s Angry Men™️ who don’t understand wigs in the comments like “U LOOK BAD WHY DID YOU DO THAT?” \n\nDo what bitch? Exist? woke king https://t.co/TfoRnn6CIq This is so true!!! I hear this a lot as well. https://t.co/QoN5iNutP6 it baffles me that some people consider short hair “not feminine”. Obvious evolution of gender stereotypes aside, if we’re using ‘social standards’ as a regulator for arguments sake: these women are all considered “feminine” ? 🖤 https://t.co/5RhryOq7Qu chicken soup 4 the soul. and scalp. https://t.co/cGmQHkTxRr @MarkRonson Yeah but u look somehow....right...as an egg @JosieCanseco Lmaaaaaao why \n\nare there so many videos of people putting makeup on eggs My entire work related group chat is me sending copious amounts of photos from @nathanwpyle’s “Strange Planet”. https://t.co/z9ZEuQsQcQ I can’t believe I finally did it. After all these years. I used “except” instead of “accept”. I’m disgusted in myself. I MEANT ACCEPT IM SORRY I WAS EXCITED omg this is the best day. I would except baby punches in exchange for cuteness I may have to take you up on this offer 😭 ❤️❤️❤️❤️❤️❤️ https://t.co/Wy0FTJva4t oh she big mad 🌶 https://t.co/Z2nXyEpps5 yeah it’s exhausting to hate urself this much https://t.co/WQc8C16Al3 paint it black 🐾 https://t.co/CY7pg5zX6m this bouta be awkward lol ❤️❤️❤️❤️ https://t.co/DWjwMB19Al you guys did that !!!!! i just be working and singing and writing ! And trying to only tweet marginally stupid stuff and acceptably half nude photos! https://t.co/BLNbZ89xNV @LEOBlTCH @torikelly Fuck off nat I’m sorry some tour dates were accidentally uploaded to my website. Those dates belong to my labelmate @torikelly ! I’m am not touring but while you’re here, I encourage u to check out that beautiful princess on the road. ✨ 1 billion each! That’s 2 billion baby! 🖤🖤🖤 Thank you @iheartradio and thank YOU GUYS for listening https://t.co/vciiuxCtuO Anyway, not knocking what people find fun or fulfilling just sharing my personal experience! Love you!!!!! I walk onstage in front of tens of thousands of people and I watch sweat tears and glitter fly through the air in slow motion while they scream. Why did I think drinking warm tequila and orange juice beneath blown out speakers was gonna fulfill me for even 1 second lol. Also: I fucking hate going out and going to clubs and I’m so annoyed it took me like 2 years to figure it out but it could be worse I guess. LA transitionary period. shrugging my shoulders into an oblivion right now. I made some serious changes in myself first and that cleaned up / freed up my energy for something else to come in my path bb. I’ve learned, the universe won’t drop a gift into a pig pen! ya gotta create a sustainable environment for a blessing to flourish! https://t.co/1p5Rmeh3g3 there’s so much more to life than going out every night. i’d choose to be friendless, healthy, and creating everyday over wasting it all away for nothing, anyday. if you’re a fan + you noticed this change in me in the past 8 / 9 months or so, know it’s not accidental. love you 🌱 udon even know how much I luv Tokyo 🌸 https://t.co/HSjGKOnETK @arfhhfza Because I’m not allowed to like anything haha sorry if u got it twisted but I’ve been a blackpink fan for a long time and I was watching their TGC performance to pump me up for mine today because theirs was so good!!!!!! 💗 getting ready for @TGCnews 💕✨ https://t.co/w7VcFlcCVE when it’s time, it will be time !!!! https://t.co/6IUZqWXO2K @LlTTLEBOYBLUE Imagine wanting myself to be dragged that much. I’m good. when the hell did I say it was called- nvm. https://t.co/l3vze2CzMD @visitkingdoms Sometimes I sit on a song concept for months before it wants to present itself as a real thing. Keep incubating it. It will grow and mature and spit out of u when it’s ready. 🖤 100 letters started as me obsessing over the concept of King Midas for months. joon. king 🤙🏼🎥 https://t.co/xrcrLMAsos #MAP_OF_THE_SOUL_PERSONA Alright cool. The internet really has lost its mother fucking mind. bye! https://t.co/dgHpdiInEO goodnight I love you ❣️ yes ❣️ https://t.co/5XEyRHYJlK Writing this album has been a lesson in forgiving myself. In being proud of myself and kind to myself despite how much this world is designed to make you hate yourself. I hope when it’s finally in your hands it brings you that same peace. It’s not a quiet peace. It’s a loud one. I know you guys are anxious for new music and new memories. for touring and traveling with your friends. for events and pop ups and meeting new people. for music video screenshots. for group chats and late night. thank you for being patient with me. I want it to be perfect. dearest universe, \nplease forgive me and have patience with me in moments I have ever been ungrateful. that thread of all your halsey tattoos really moved me in such a massive way. huge waves of emotion and gratitude right now. thank you for choosing me. \n🌻 I can’t get over this I’m legit bawling my eyes out what the fuck ??? https://t.co/JznzR934zd this thread 😢😢😢 I really love you all. I really. Really. Do. https://t.co/VhKc9vY72f RT @sailorcbot: https://t.co/kLuro98g9K Umbrella academy...\n\n...but love and support them so they prosper. https://t.co/Wrvqz2LXxY tru https://t.co/U2hXu0DZYP bouta quit music, adopt 8 kids, and raise em on a beach somewhere. shave my head (again) like it’s nobody’s business and then write a couple novels. I’m @ human interaction overload. RT @TGCnews: 💘#TGC'19 S/S 出演者第15弾💘\n3月30日（土）横浜アリーナで開催の #東京ガールズコレクション に#Halsey（@halsey）出演決定💋スペシャルライブを披露✨\n\nTGC公式LINEとお友だちになって生中継をチェック！\nhttps:/… me: sick\n\nsomeone: omgyourealwayssick!!!\n\nme, with a chronic illness, \nstaring into the camera \nlike I’m on the office: I’m a pretty competent individual. But I’m a whole entire idiot when I’m sick. You don’t understand the true meaning of “im baby” till u see this shit. I need to retire from life. @yungblud Amy Gonna watch it tonight!!!! https://t.co/12eZfBmq48 “Us” was so awesome. I had a really bad cold when I saw it and I was holding my breath from suspense and almost passed out like 3 times. Weirdly made it more fun. Peele is a mastermind. I can’t wait until 5 years from now when we’re all viciously debating our favorite Peele film. I hope you guys are more mature than attacking people just cause I tweeted them. especially on the occasion it’s a sensitive subject. Twitter is good because it opens conversation. It bad when you bring blind hate into that dialogue. 🖤 glad we’re all on the same page https://t.co/zMyjXp7nhN The Woodstock lineup seems to be a bit divisive. but I am very honored to be included in a lineup of artists who all appear to be constantly influencing culture or representing social activism. Using their voices. That’s Woodstock to me 🌻 I’m honored and I can’t wait. i am: joking 💕 https://t.co/54uTEliCzb what are u talking about? It’s not pronounced ooo wooo? ???? https://t.co/RnSu6VaBC5 u \n(and I cannot stress this enough)\nwu https://t.co/lvz159bRzj Yeah I love u guys. I am what I am today because of you. No one else. I have an amazing team and label who facilitate my vision but that vision is useless without your ears and eyes and hearts to absorb it. Don’t ever forget that shit. YOU gave me a voice and they listened and amplified it. I’ll be damned if somebody calls me an “industry plant”. I was signed to a boutique dance label off 1 song for the smallest deal ever and YOU GUYS made me what I am today by coming the shows and loving the music and telling your friends before I had even 1 second of radio play. @readyforpayne @xowenm lmao WHAT yeah for fucks sake I can’t believe I’m saying this but I’m headlining fucking Woodstock. fuck me. see you there 🌻 https://t.co/33YhapHOXC babe babe babe!!!!!!! mega babe!!! 🖤🖤🖤🖤🖤🖤🖤 https://t.co/FdT2rEtPVw I’m so here for an inclusive brand that celebrates the power of unique individuals. @ModCloth 👊🏼https://t.co/PgdcPvxHgJ #OwnYourOwn #Ad https://t.co/USmp67PEAH I have so many secrets inside me I think I’m gonna have to glue my mouth shut. @NOVABRASlLIANA @yungblud @iHeartRadio Haha can’t give u everythinggggg ❣️ fun fact: the sg @yungblud played on the @iheartradio music awards was a xmas gift from meeeeeee 🧚🏼‍♂️ https://t.co/WHbZEc4SvI One of my favorite bands of all time @themaine covered Without Me and I’m trying to figure out where within the giant crack in the simulation I was given this blessing 😍😍😍😍😍 !!!!! https://t.co/g5Nk0O6IAN I AM 24.\nNOT 28. \nNOT 30. \nI AM 24 YEARS OLD. \nI’m freaking out that I’m getting old enough y’all gimme a break. \nPLEASE !!!!!!!!!!!!\n😫😫😫😫😫 #christchurch 🦋 https://t.co/AduOq3SIYe @VampWarrior It wasn’t supposed to be strapless 😅 running with guitar + mic flip + broken dress + cute guy in front of me. somehow i defeated every single mini boss and made it to the final level. 🤘🏼 https://t.co/RMV5BPTZOr Thank you guys so much for this moment. Don’t ever let anyone make you feel stupid for putting your heart into something. Passion is a wonderful thing. 💗 @iHeartRadio #LOrealParis  https://t.co/ysbFGD5rnL very happy to be me. The butterflies came to LA to wish me luck for iheart tomorrow I love this for me I knew I could trust y’all which is ur favorite throwback of mine This just revived a dark part of my subconscious https://t.co/gzFfUPRgTk I mean like writing / doodle pen.... Not weed pen omg what’s ur favorite pen @EuroWaterHound I have a lot of deaf fans. Being deaf doesn’t mean you can’t enjoy music!!!! RT @zjmdivide: @halsey your video with a brazilian song!!! perfect 🇧🇷😂❤\nhttps://t.co/1ch9B6k7WP RT @esme_e0: @halsey Im just leave this here, ily💕 https://t.co/smei251uqA TRU https://t.co/tfzQBW8Nxk u know my Manic ass isn’t holding any idea in for that long https://t.co/DY4FMASQDK lmao I’m jus playin https://t.co/qUDqXc0IvG At least a couple years https://t.co/AW884KlYTn nah wait till you hear what I’m cookin up for the next one 💗💗💗💗 https://t.co/Apph3hE7OH No way!!!! Insta gets a photo or video every few days. You guys get all my waking uncensored thoughts lol https://t.co/mpt3LzTk4g I know I take forever to repost my instas on here but I forget sometimes ok I’m sorry I love u Twitter bbs 💗💗💗 me ending a business call like: 💕 https://t.co/Kn5dZS909s @h0llowmind The only ones I’m in long enough to justify purchasing art supplies hahaha if you live in LA or NY I go to Blick a lot and do my little sketch self portraits on the marker tester. haha. so if you’ve ever seen one and though “hmm...” it probably was actually me! Haha. @iamsuckeriam @illvminatro Oat milk is superior @campcopes I intended noooo aggression! I was just asking a genuine question in case something outside of my own experience went unnoticed to me! I’m sorry. This is unbelievable!!!! I’m honored 😭😭😭😭😭 wow !!!! I love you 🦋🦋🦋 https://t.co/aUWCX3wNhZ 💕💕💕 https://t.co/htYHaQymaz @campcopes It’s a song about bisexuality. But just out of curiosity. How is it transphobic to say your male partner has feminine qualities ? my guy pretty like a girl. 🎗💛 you go, babe. right here with you!!!! 👊🏼 https://t.co/jr981PC0X3 @blessedswift @visitkingdoms u know for a fact I be fucking. ok, I’m always here to talk about my experiences with endometriosis and other reproductive health issues, however I am not a licensed medical professional so it’s irresponsible for me to continue! Haha please talk to your doctors!!!! Love you guys! ❤️ @shilooooh @visitkingdoms You are completely correct that was a mistype. Most of the people I have talked to about the experience are Cis women and that was entirely my mistake ! @autumnrebeccaaa A laparoscopic surgery! They take a camera and put it through your belly button and 2-4 small incisions on your waist line and go look for endometriosis cells in your uterus and abdomen! They are blue you can see them! Haha @visitkingdoms The insertion causes cramps for a few days but I think it’s been largely over exaggerated. Once again it’s different for everyone. I think medical anxiety causes a lot of the tension because most women get by with an Advil the first day. But some it’s different! @bronas_jothers @isabelleprimave I never even feel it! It doesn’t bother me at all, and the initial pain of insertion was a small price to pay in exchange for managing the debilitating pain endometriosis causes. my IUD helps me get on stage every night I love it! @halseycvlt @isabelleprimave Well I have a reproductive illness so it’s the best option for me but everyone is different! @devilsheadlight @isabelleprimave Yeah I take a daily pill for endo pain in combination with my IUD but no matter the dosage, I can’t really control if my hormones give me my cycle or break through bleeding lol @shilooooh @isabelleprimave It’s different for everyone. I didn’t get it the first year and now it’s back. @isabelleprimave wow we are getting really personal on the time line. Lol. I use an IUD so my menstruation is sporadic :) That’s the one !!! https://t.co/Y7zhTq3jK0 “I think I’m gonna get my period soon”\n- me eating an entire jar of cookie butter by the spoonful it’s what she deserves https://t.co/xN29PZ6ffw ok same https://t.co/K0beudIU3O who saw captain marvel already? I saw it at the premiere and keeping my mouth shut was hard as hell. what did you think !!!!! Me too!!!!!!!! https://t.co/26TIKyb6H3 So bizarre to me! Like what do you do when ur sad? Or driving? Or happy? Or getting ready? Or in the shower? Or like....existing?????? https://t.co/QcX4AMYpBV can’t trust someone who says “I don’t really like music”\n\nah cool! how’s being a demon? seems quiet that’s for sure ! guitar face. everyone has one haha. https://t.co/9XaGM1A9zD It is! https://t.co/iyHU3W4SjZ u can find me serenading my dog https://t.co/7PUmPGSFaR you guys    VS    you guys when \nwhen ur                im sarcastic \nsarcastic                     to\n   to me                       you https://t.co/5UE72X243G u bully me anyways https://t.co/iMemjqvKR6 twitter is so weird as an artist bc u guys tweet me all sarcastic and sassy and mean out of love but if i do it back all of a sudden everything is very serious and literal and i get very confused and i’m sorry i will only be mushy gushy from now on 💕 @HALSEYSHEAVENs I know it wasn’t mean!!! I wasn’t being mean either bb! @colorstripped Holyyyyyyy shit hahahahaha. RT @poetastrologers: Libras on Tinder: Yeah I went to art school\nAlso Libras: MFA in taste bitch 🦋🦋🦋 thank you.\nI am genuinely just happy to be here. https://t.co/vifMWEgvTx I’m returning to Twitter only to ask this question did cobra starship have a snakes on a plane music video or did I hallucinate that okkkkkk I think I’m done with Twitter for a while.... https://t.co/Nq4yaAxQH5 I’m In This Photo and I Don’t Like It https://t.co/xNwJTiW4c7 📌📌📌 https://t.co/w554Hgugsv I’m all 3 tag urself https://t.co/QAr2hXdFoS Alternate Headline idea: \n\n“.@halsey who admires Gerard Way so much she’s seen him live 5 times, binge watched his new series, and dyed her hair to match his, makes a joke on twitter” https://t.co/TloedPXRJ1 Love a good suit want to wear more suits. I \nLOVE\nWOMEN \n!!!!!!!!!!!!!!!!! wait I found them... I don’t even know the words to explain how good captain marvel is. 👆🏼 that part https://t.co/ZJFUAvrcOp 🚨🚨🚨🚨 wowowowow THANK YOU! https://t.co/Q9778yG7Qa I can’t believe I’ve been arguing with a comic book fandom on Twitter all day this is Gerard Way’s fault Who woulda thought it would be this ! https://t.co/WlYBuDCpXn UA fandom coming for me because I had a moment of empathy before finishing all the episodes. IM SORRY LOLLLL Ohhhhh. I just finished UA. Now I know why u guys hate Luther hahahaha ok ur right..... resident empath here in my feelings; feeling bad for literally: everyone I’m not defending him. Everything is definitely: his fault. I was just saying!!! Hahahah https://t.co/5hEk4ogM26 OK I KNOW!!! IM JUST SAYING https://t.co/IIntWrRck0 OK YEAH but don’t invalidate his situation from the jump! https://t.co/md28mx5MGd me: why are you guys so mean about luther? his father sent him on a suicide mission to DIE and he had his whole body transformed into something he rejects and now he feels alone, unwanted, and dysphoric. he feels literally inhuman.\n\nyou guys: ape man !!!! 🤣🤣🤣 @cherygloss Go ! Off ! RT @sailorcbot: https://t.co/tkMef7zUMg I’ve seen it like 100 times haha. It’s a routine thing. https://t.co/2krJSDOypG Am I gonna have to go all the way to like target or Best Buy or some shit to watch it? Because......i ......\n\nwill. https://t.co/hIsxdsAceX I have the dvd. Just no DVD player 😫 lol https://t.co/DjPundrWPp It’s 2019 why can’t I rent / stream spirited away online. the essay on songwriting @taylorswift13 did for @ELLEmagazine is gorgeous. being specific = your audience will trust your experience, (ex: “there’s no way she could have made that up...”) &amp; no one does it better than T, who taught me this a decade ago by calling a redhead by name bc I luv it 💜💛💜💛 https://t.co/S2Qfy3z7nX is this.......my wife ? https://t.co/zsxJZqTlOC BRONNNNNNN STOP HAHAHAHA https://t.co/CUta2Gzh6P I think being on stage makes me feel like a giant. I look at my friends who are 5’10 and 7 inches taller than me and I’m like “...yea I’m prolly as tall as u.” I have “Tall Friend Energy”. It’s like BDE, except it’s when all my friends are really tall so I believe in my head that I am too. even tho I’m..... not. https://t.co/l6vc3vUYxR RT @iHeartRadio: Let the countdown begin! We can't wait to watch @halsey's performance at the 2019 #iHeartAwards 😍\n\nYou can be there too: h… love this new @rexorangecounty https://t.co/yiUmvBKEsH ok that’s all I’m gonna answer lol u guys know I can’t keep a secret and ur trying to take advantage of that fact!!!! I still have a ways to go to make it perfect for u!!!! bye !!!! nah. there’s two types of honesty. answering a question with the truth and offering the truth without being asked. this is the latter. https://t.co/CG7ytVtCId all of them! one i wrote yesterday is deeply personal and from a pretty unique perspective. I think when you guys hear it you’re gonna be like “......fuck.” And maybe see me in a diff light https://t.co/p52U9ID6ph it’s just so candid. like when you sit down with someone you kinda know and have that “deep” talk where u understand them a lil more. This album is kinda that talk between you guys and me. https://t.co/Nb4OMEqHsD I am making the best music I have ever made and I sleep like a baby in the comfort of knowing I have grown into my own skin. 24 thank you for being kind to me. @ashvalentinex @Ashton5SOS this just made me so happy NO I’m watching ALL OF THEM https://t.co/YKfSqVsoI5 I just need you to love me with all my flaws https://t.co/E7Ws75xaNg Bi culture is wanting to fuck every single Cullen @HoodratHalsey Yes lol I GOT EMBARASSED I was trying to make fun of myself and it just made it worse lmao https://t.co/pVtsGLSkvC ok now I’m literally gonna damn myself to fangirl hell. see u when I finish breaking dawn ✌🏼 everyone is being so nice to me lately i’m nervous my beautiful tiny baby angel debut album i will protect you with my life you are the best thing i ever made https://t.co/i1hbXG4QDs lucky to have talented friends. @LaBouquetBand I love this video so much. 🌹🌷🌻 https://t.co/yIhvNkPoTf @thegreatkhalid i miss u come celebrate wit me madness. @ItsBennyBlanco 🌸 https://t.co/tu1pNkT9pS ❣️👑  @VanityFair @FollowWestwood https://t.co/Ip845Dgq5U in all seriousness, Gaga is the greatest inspiration in my life. Her and Bradley choosing me for that tiny little scene was an indescribable honor. She makes me want to be better every single day. Her courage and talent and vision are one of a kind. I stan her to my grave. GAGA! How great! in case u wanted to cry ur eyes out https://t.co/iOvqeUaZy6 just how my arms have always been. my elbows hyperextend lol they are like 〰️ instead of ➖ https://t.co/b3GOCiUfck just can’t 😭😛 https://t.co/X6X5ZtQc2C pretty close tbh. i’m here for it. https://t.co/rAQk4L15Bx literally...... yes. https://t.co/ZGKtiUwAgX Why is NyQuil so hard to open. I’m already sick and weak ur gonna make me feel dumb too????? I love Scottish Twitter 💕 i want to say 💕\n\n✨ so many things ✨\n\n💌 but my heart says 💌\n\n💭💭💭💭💭💭bitch, \n🗣 shut the fuck up 🗣 Yes haha https://t.co/4qy8Kw6mVC Tons! Easter eggs galore https://t.co/BIvcJdPpxe this video was, yeah! Dom sorta steered the ship musically and I did visually. It was really collaborative. https://t.co/epkw3gxNZz Yes 🖤 https://t.co/Xs5xD09vGG The now or never ones (nostra) are the same kind of thing, it’s connected in a way sort of. just parallel universes where people explore fate vs free will and a higher power tries to mediate it https://t.co/dEU8vkPAA9 @tpwkliablity It was a joke 🖤 he said “fuck” on the radio! Higher power / hands of fate trying to stop him from interfering with destiny. nuns; demons; oracles; which ever represents the hands of fate to you! https://t.co/SaK2b0eH8Z Unnecessary period. I see it. Ok. Shut up. have u guys seen the “.11 minutes” video yet? what do u think? https://t.co/sEup7wbui8 science? really? right in front of my poetry? https://t.co/meUmEeZlGp well some people are made of the more special kind !!!! https://t.co/NCBi2JU1QS I am so happy I saw this today. 💕 some people are just made of stardust. https://t.co/4jbTn3APqq omg 😮👀 https://t.co/e78q8nKqhe the princess Ariel saga continues. 🧜🏼‍♀️\n(2 smiling pics in a row? who the actual hell is she ????) https://t.co/zXphKNGoc6 isn’t it neat? 🐠 https://t.co/7eNPBwkHvj oh yeah we did this in Sydney and it’s fucking SICK. Sort of a double entendre song choice if you’ve seen the 11 minutes video. https://t.co/FVIFRDlsHL i can’t wait for rocketman, jeeze louise 🚀 🧡🖤🧡🖤🧡 https://t.co/KRhdao0BAN 11 Minutes - video⌚️🖤 @yungblud @travisbarker by Colin Tilley https://t.co/WUcyFyUlzr 1 HOUR TILL THE VIDEO!⌚️ #11Minutes omg me too https://t.co/HlV1wrR9mS This music video is so fucking cool. I can’t wait for you all to see it. Fucking so sick. 12 hours !!!!! 🖤 ❤️ https://t.co/W1s5O7YTh2 i hate myself https://t.co/27tdNwt0Uv honestly i was Drunk &amp; Single. the White Girl was in the driver’s seat https://t.co/bbf4kLiNsR Okay........you’ve made....some points https://t.co/1d0EPXIXjP why the fuck my little brother in this video https://t.co/FaTBxP1236 OMG I WAS KIDDING https://t.co/1VRkSMpBli unfortunately.... https://t.co/S0cgPEymxL nothing at all!!!!! I feel really good right now tbh! https://t.co/obuFyAwWvQ people think my last tweet is me hinting I’m pregnant, which means I’m either: \n\na. gaining weight\nb. acting weirder than usual \n\njokes on u, I’m doing BOTH! however STILL not pregnant! I have The Biggest Secret (unrelated to the album) and when u guys hear it, some of you are gonna explode. \n\ninto actual pieces\n\n                                         💥💥💥 Or perhaps I have similar interests to my audience and that’s why they identify with me and, possibly, why they are my audience! https://t.co/oRfw7CROfL wow ENERGY !!!! fuckkkk this is amazing @denzelcurry https://t.co/2yxzis5d6T Alice and Jasper, bi legends. https://t.co/I5gkc2DsJS u r very cool I love u https://t.co/8KU3YZrJr0 twilight but make it Gay https://t.co/qM5MJuWozL i miss when vampires were cool can we make vampires cool again this is honestly amazing!!! without me is really Doing That ! I haven’t released in album in like 18 months?!? also HELLO eastside!!!! @ItsBennyBlanco @thegreatkhalid this is madnessssssssss https://t.co/FEiHy0sji7 @HiiiPowerrTDE I just wrote this tonight! I write the same way I paint; mostly about faces. So maybe that’s why it seems familiar :) if only i could be small enough\nto lay across your eyelashes, \nas a hammock. \ndance and splash \nin the tiny mud puddles \nof every single umber freckle. \ncrawl into the lobe of your ear \nand hide \nin the seashell cavern \nwhere i would hear the ocean \nand whisper it back to you. lmao I’m really sick. my only two moods are:\n\n-invincible Brie Larson in a captain marvel advert. great hair. powerful. \n\n-tiny fetus voldemort from that scene in deathly hallows. no powers. sick and gross. I KNOW. ALSO protecting new born babies when they come home from the hospital 😩 https://t.co/mqIYK5Nviv honestly nothing beats “kids finding out they’re getting adopted” I’m in ruins.... https://t.co/MrPZJDjWxO me, minding my own business:\nsinus infection, suddenly: https://t.co/IovB60obU6 I have a bad cold or somethin and I’m on my couch watching videos of cute babies and doing that thing u do when ur sick and start crying for no reason help me please. @beamiller This is stunning bb be EXCITED about stuff. have passion. you need it to survive. and let people like shit without tearing them down bc it’s not your taste, you big fuckin baby. don’t let anyone convince you it’s cool to “not care”. apathy is wack. be passionate about the things you love, and the things that you fear. \n\nthe greatest young creators and activists of our times cared. A LOT. \n\n“idc lol” is waaaaack. we can do better fucks sake. 11 minutes. Video. Feb 21st. \n⌚️@yungblud @travisbarker https://t.co/0kBMfYZPaM can’t believe there’s a new song out RIGHT NOW and I’m about to do a free surprise meet &amp; greet in a country I wasn’t even supposed to be in for months. We love spontaneity !!!!!!! 🖤🖤🖤 call me stupid, call me sad.... ⌚️ @yungblud @travisbarker https://t.co/iw76UfWdS0 https://t.co/sQFwn3AoY2 I’m excited to finally be back on @kroq !!! I missed you guys 😛 https://t.co/yMQGXucCGg https://t.co/Xt1zdrEVsw 🖤 https://t.co/BeiLrVhSyj Marilyn. not Charles. Sheeesh lol got manson tatted on my ribs I love Adelaide so much already. Damn how tf did that happen !!!! https://t.co/F1F2xGeCZ8 I do actually 💕 https://t.co/eM19jsoARr The line was “Queen Bae” I know my Bey ;) https://t.co/XCPI5jpYdz I painted on SNL bc it’s my favorite artistic medium 2nd only to music. I wish I could have done more with the  3 minutes I had. but, if you’re *interested*, here’s some examples of my other styles of art 🖤 the way I draw/paint is always changing. I love it so much. https://t.co/itEcEedPiY ok now I’m frfr so tired. nap time. @MarinaDiamandis luvvvvv u 💕 @Sensimilla7 I drew the stencil too! I just needed to make sure the proportions would be right for the camera because....well... it was upside down haha. I just wish I had longer than 3 minutes !!!! Next time !!!! the cast is A+, the crew and staff as well. I learned so much about myself and my craft this week! double duty is hard but i smiled literally the whole time. 💕 still totally wired. Painting a 10 ft canvas upsidedown while singing into a headset mic for the 1st time while hosting SNL,\n\ntakes the cake for biggest \n“dumb ass shit I took onto my plate for no mf reason (bc I thought it was cool) that actually worked out considerably well.”-type moment of my life as an artist, I have a privilege to remain honest and write about what’s true to me.\n\nas a woman, I have a responsibility to not allow myself to be silenced by someone who has done me wrong. \n\nmy truth will always come through in my art. death over silence, yo. I.. am going to cry. I saw u at staples the night I found out I was hosting. I cried and laughed and you reminded me why i do this so this goes -such- a long way. Kelly thank u for being one of the reasons I write ur a queen. https://t.co/4hQwLxp1VN SORRY IT TOOK SO LONG TO TWEET. THAT WAS. THE BEST THING....\n\nIf you believed in me. \n\nThank you.\n\n@nbcsnl 🖤 till next time It’s not over baby! We do a rehearsal and it’s LIVE live. About to air ! Let’s go! https://t.co/tf0gIrzHIk let’s go!!!!! https://t.co/8lEfSxqMX7 @MitchyCollins Great record Tomorrow is gonna be so wow RT @NitaLowey: Flashback Friday: In 2017, @halsey explained the importance of Global HER Act, a bill Sen. Shaheen &amp; I introduced to repeal… The black parade-esque coat. The danger days hair. The general feeling of despair. https://t.co/xm52F36ECK BIG TIME mcr mood this week. @DonsLens https://t.co/AJDhLGhqVr RT @nbcsnl: ✨ @halsey is your host 𝗔𝗡𝗗 musical guest this weekend ✨ https://t.co/77FjR8eiqe @ArianaGrande can we learn this choreo. Like obviously not as good and also in sweatpants but like. I’ll grow some hair for the flips. https://t.co/9Fxj0ISBkt 💕 Goodnight I love you. The best thing that happened to me when I turned 24 was realizing it was more important to me to be smart, driven, and creative; rather than be beautiful. Far fewer days of waking up and looking in the mirror feeling inadequate because I’m loving myself for what matters. 🖤 RT @nbcsnl: [@halsey intensifies] https://t.co/dKNmR8UpLf someone: “what’s anxiety like?” \n\nme: *fell asleep for 30 minutes and then woke up cause my chest was beating so loud and fast it sounded like a phone trapped vibrating in my mattress so now i’m trapped in a modern adaption of Poe’s “The Tell-Tale Heart*\n\nme: “it’s not that bad” Humans are supposed to be creatures of exploration, advancement, critical thinking. We adapt &amp; evolve. So why are we so afraid of change when it threatens our routine? If a system has proven to be broken why choose to favor “what we’re used to” over what could make things better? RT @nbcsnl: It’s @halsey week! ✨ https://t.co/V3DYjT8Xzu I been drinking like. So much water. Is this what having your shit together feels like ??? 1 and 4! 💕✨💕✨💕✨ https://t.co/EVlhUqGt2v @5SOS rude https://t.co/yqV3oX0D10 But hey I’m #1 on @Z100NewYork so that’s pretty sick, even if i AM living in a simulation. Lmao no joke @RyanSeacrest just said “Halsey tweeted.....” but he was talking about something else from a few days ago but when he said my name I deadass looked around like I was being watched. Listening to @Z100NewYork and heard someone go “Ryan Seacrest, z100” and was like “woah lol that sounds like me” and then it happened again a few minutes later and I was like....”ohhhhh. it’s me.” thinking of you in this difficult time. https://t.co/TTlUAonlME people to not trust:\n-robbers\n-thieves\n-politicians (mostly)\n-men who routinely fall in love with a new “way-younger-than-them, manic-pixie-dreamgirl” thinking she’s gonna be the one to change them\n-your big cousin who kept that draw 4 on deck during Uno Whatever it ends up being has to be epic because I loved both of these set ups so much!!!! The! Memories! https://t.co/5jnSsW7Vhu we are ????? https://t.co/XFA0GyGkDg I guess I consider trouble part of that cycle cause it was the badlands era in my brain. The room 93 EP extended into the cycle of the badlands album https://t.co/17Wp8iUTKJ I put a piano ballad on every album and this is the first one I ever wrote. I went years without playing “Trouble” but when I performed it in Berlin, it kinda lit a spark. I can’t wait for you to hear the piano ballad on H3 :) https://t.co/PNlYRI5f67 I’ve shed a remarkable amount of tears in my life over My Chemical Romance. I know this is my 3rd post about hosting @nbcsnl but prepare for a billion more I’m JACKED!!!!! 2.09.19 @sohotrightnail got me in the mooooooood. https://t.co/pD3SOTvaGS holy shit https://t.co/elfHIIQQyA RT @blackvoices: Let's not forget about these trailblazing women this Black History Month. https://t.co/Y55ReWRaGm BLACK\nBLACK\nBLACK\nBLACK\nBLACK HISTORY MONTH\n\nBLACK IS NOT A BAD WORD. https://t.co/rO40yOxoZg Per usual, posting WIPs. I was sick today and it was raining. Acrylic on wood. 🥧🥧🥧\n\nHuman pie inspired by Ashley Newman‘s incredible sculptures! Love good horror art! https://t.co/f59qbrBb6p Can’t wait to host S&amp;L next week. https://t.co/m5cx75ljoe Sometimes I paint or draw some weird shit and when it’s done I’m like “damn. am I alright? u good in there brain? need some water or oxygen?” @yungblud I thought u were 18 and I was 30?????? Siiiiiick https://t.co/RxkaokD8tI @visitkingdoms U were wearing American apparel tennis skirts 6 months ago Olivia sit down haha omg no. just sooo sensory sensitive sometimes. especially when I’m writing music. I’m like I CAN HEAR U BLINKING ITS DISTRACTING SKDJSLKD https://t.co/qUXNfXQBh1 everyone:\n\nme: can everyone just SHUT THE FUCK UP. GOD. An attempted lynching in 2019. Where’s the “get over it, it’s in the past” crowd now? This is absolutely disgusting and it’s a reality. Justice for #JussieSmollett I’m sick. 🖤🖤🖤🖤 thanks for everything Samantha! https://t.co/79GFUBcu4H RT @glamourmag: #Halsey has gone from Internet emo kid to stadium pop star, but her rise didn‘t come without challenges. In our February co… just not fuckin’ having it\n@glamourmag 💕 https://t.co/SxI18dJKhY 2019\n\n             🕳 🙃 https://t.co/ECdDC058kD u guys r so cute omg u think I’m gonna drop the album in 2020 😢 They say what the devil can’t do, \nhe’s gon send a woman to. \n\n                                    ⚰️⚰️⚰️ have inexplicably had “thunder” by boys like girls stuck in my head today. @Halo 🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼 RT @Halo: @halsey https://t.co/1ZxekrRjdP Also a big yes from me https://t.co/oioSoKWCt7 I FUCKING W I S H !!!!! https://t.co/2hKKiPOSYf birds! of! prey! case + point https://t.co/utLYfJtjIv this: is incredible. not enough halo jokes about my name. https://t.co/EsUmSNWWWt u guys think blurred out photos of spongebob with the colors turned negative and the word “yeet” in caps over it is funny, but MY humor is questionable? https://t.co/aQVEDRIbdC had 2. I couldn’t help it. another LA winter 🤷🏼‍♀️ https://t.co/5qtXMJNEc7 “you’re killing people!”\n“no i’m killing BOYS.”\n\n                               💉 Too* excited for good grammar as well apparently I am really to excited to sleep. life is absolutely wild. \n\nthank you guys for the support. it’s all the fuel my fire needs to make this 3rd album perfect. I’m jumping in circles every day. \n\nI love u. RT @nbcsnl: We're back in February with @halsey! #SNL https://t.co/AnSpCoR3cj Feb 9. HOSTING &amp; PERFORMING on @nbcsnl ITS SATURDAY FUCKING NIGHT BABY https://t.co/lMbUS6cDbH holy fuck for sure weird. https://t.co/ItpRHUoLyV pls don’t take any of my tweets seriously (unless they are about how much I love you guys). not a vampire. not a complete dickhead. just think I’m funny sometimes when I’m prolly not. 🤷🏼‍♀️ all those rumor articles about me? they’re all true. i’m dating all of them. every single one. i collect them and drink their blood and that’s how i got a #1 song. i’m becoming too powerful. yes bc I’m working with cashy !!! @CASHMERECAT 🐱 https://t.co/aPTKOa3wwi yes bc I’m also #soft https://t.co/rhMPybXnQk prolly a few I’m feelin myself in the studio these days. wild uncontrollable thing. exactly how I like her. https://t.co/thYzHErHvi u r all so cute. and dress so cute. and look so cool. i love you. i promise i’m gonna put out a cool album so you’re excited to b my fan. \n\nnot too cool tho. bc it’s still me we’re talking about here. Aaaaaaaaaaaayyyyy https://t.co/CP0nGU5XE2 Loooooooooooooooooooveeeee omg https://t.co/2fkgM2gaSp I just started :) could be done quick. could take a while. all I know is this is my favorite one yet so far. https://t.co/yEmTtudYMO idk yet. I hate everybody. jk https://t.co/EGhXGqnD3f Nooo they are actual covers glued to the wall and covered in a gloss! Haha. sorry I’m talking about this so much but everyone keeps asking questions. https://t.co/dJnoTw2lUq I actually didn’t know she had one till everyone just told me just now but that’s awesome! I applaud anyone who pulls it off, finding all the covers is tedious work 😫 https://t.co/Px9BNbmsi6 wow. this is a call out tweet. https://t.co/8YZxc5tW8w I’m not at all. My room is a mess. But the fridges? Stunning. Perfect. Color coordinated. I have selective organization. https://t.co/SDLdZVL9DA The fridges are a real cause of discourse here. Because \nA. Yes we do. \nB. I am very particular about making sure I always re-align everything up perfectly and no one else respects the order hahahah https://t.co/oG7qSeqdgg The visuals actually inspired the bar! Haha. Talk about taking ur work home with you. https://t.co/KJLXkE1AFP @campcopes How is that roasting?! Actually it’s the only thing of me I hung in my house. I have a storage full of plaques and awards but I don’t like to hang those things. They had to twist my arm to get me to leave that cover up hahah. I’m pretty shy about that sorta stuff. https://t.co/yZZ5vvcuqm dis it. https://t.co/C5q4mZ0akn i have a room in my house that’s wallpapered floor to ceiling with vintage playboy covers; and now I can always tell when a LA e-girl has been to one of my house parties cause they got one too. slowly making naked women a socially acceptable choice of wallpaper one place @ a time my amazing (Grammy nominated!) friends @bmthofficial just dropped a new album and it’s a technicolor, emotional, trip. ❤️🖤❤️ way to go guys. https://t.co/2DL8FGKL1v i rewatch it every year! 1st n 2nd gen mostly. https://t.co/qSD4dCh52I see, I’m a fucking basket-case\nuntil I'm able to see your face\n                           🌻🌻🌻🌻 RT @badlandmermaids: same energy https://t.co/MS38s9mo8O where is this generation’s “As Told By Ginger” that show SLAPPPED worm. https://t.co/7t5V2WJCkj new song :) https://t.co/3yDxUT7egy “this song is libra culture.” cinnamon sugar butter toast still hittin https://t.co/1x2Wry71uW I just. do. https://t.co/zoVF2kBn8q u don’t know my needs https://t.co/NkhFmTAyGT A modern tragedy https://t.co/qR55ixxjF5 💭💭💭 https://t.co/Zveb8IVnXq *chance voice* we back, n we back, n we back, n we back! 2nd week being at number 1! This is craaaaaazy 💧 @billboard https://t.co/Cpa8j85i5x come on boys..... @TJANI Is this a direct shot at me or what I just remembered in 2015 when fans would dm me their passwords and I would “hack” their accounts and tweet from them. “hey guys it’s halsey on jamies account :]” woaaaaah we’re halfway there 🎵\n\n...\n\nWOAAAAAAAH. 🎶 \nLIVIN ON A PRAYER https://t.co/L056mirvDZ @paigebackstage WHAT @frangilana https://t.co/dQTVp155Hy RT @TeenVogue: \"This is the beginning, it is not the finale.\" \n\nRevisiting Halsey's powerful poem at last year's #WomensMarch: https://t.co… Honestly I’m covered in paint and I’ve been up since 3 am dog hair is truly the least of my worries Jagger said “fuck ur black hoodie here’s some fur” https://t.co/VegcXIkW8d DITTTTTO. I’d walk away from oil and be like “oh yeah I forgot about this thing that is just a layer of skin rn” https://t.co/wDhBPyJZtg Acrylic on wood :) I never really use a knife though, and I wanted to challenge myself this time so I incorporated it a lil https://t.co/v2vVCZtmuJ started this portrait of @yungblud today cause he has a very cool face. and a very cool new single called “Loner” that came out yesterday. yay @ art that inspires more art. https://t.co/Xd0vOQ6wJu Working on it 💕 the rain in California brought some extra special stuff. Knocked on my cerebral door at 7 am and it’s been banging ever since. https://t.co/Qh0X4VEg0d @bisexting Megan please try to eat more than gushers pringles and cheez-its @ArianaGrande I’m only here for ur tweets tbh Does this mean..... let that sink in...... I’m logging off forever https://t.co/JbvFq94Zby sometimes logging on Twitter is like opening closing and re opening an empty fridge bc u think something good is gonna suddenly appear https://t.co/mHbI5002b3 satire is entirely lost here Usually cute stuff like tattoos and fan art. https://t.co/JDSCVZFDDJ No just for a few minutes every few days https://t.co/a6Mt9OWvqT if this is about my bmth tweet I saw them live for the first time in 2009. ur obviously new around here if u dont know that I was an emo since the dawn of time. https://t.co/RMRpyX57so BMTH is rly THAT band. 🤘🏼🤘🏼🤘🏼🤘🏼🤘🏼🤘🏼🤘🏼 https://t.co/764X5dx1tf Absolutely ridiculous coincidence hahahahaha https://t.co/5Du03AOTlZ a face of tender spiderwebs.\nall violet, yellow, blue.\nit seems with one eye open,\nstill all I saw was you.\n\n                                        🕷 Eastwide lol.... 2 songs in the top 10 on billboard! Without Me at #2 and Eastwide with @ItsBennyBlanco @thegreatkhalid at #9! WOOOOH! \n\naaaaand congrats on da #1 boys! 🖤 @PostMalone @goSwaeLee you two are rare ones. ✨ u r 16 to me https://t.co/5PltVgsGub u r 16 https://t.co/jAMBzVHmxY :( this hurts my feelings I don’t want to be old https://t.co/jyPjz6t8vd tru https://t.co/JJkoFrbxXE I am 24. 2002 👼🏻 https://t.co/4ReogwvthB @bearfaceington @brckhmptn 💛 a large portion of it is because of you guys. so thank you. and thank you for being patient with me while i take my first time off in a while to write this album. love u i realized the other day I’ve been sat looking out windows in the backseat of cars, smiling to myself like i’m in an indie movie thinking “like, damn this is happy?! this is extraordinarily tight!” and catching myself in that moment of innocent bliss is truly priceless. *nic Can someone send me the 50 mic / HIS NIC LEVELS ARE OVER 9000 / do it for the clickbait video it’s important ICYMI u can listen to Without Me ft. @JuiceWorlddd on @Spotify now \n🦋\n\nhttps://t.co/inJHS1CQ0P @towertarot Part of being an artist is that I can subscribe to whatever brand of myself I wish. Anti-popstar is more about a mentality I think. It has little to do with genre and more about denying the notion that female pop artists should succumb to the social expectations of the genre! suddenly I can’t read https://t.co/hUXmKQxKT8 RT @halsey: How to Disappear Completely (And Never Be Found) so many dogs look so cold in the winter :( I rly love @joeandthejuice 💕 everytime I’m in London I go like once a day. honestly excessive. RT @billboard: .@Halsey on top: \"Without Me\" reaches No. 1, and a pop star levels up again https://t.co/EtCj6A3Zsx https://t.co/yn9ErKAUVo my hair has been lilac since yesterday btw bc I am a strong independent woman who lets young people on the internet decide what she’s gonna look like via twitter poll. save the lucid dreams for another time 💤 when the events that inspired Without Me went down, this artist helped me through it all. now that the song is #1 this only seemed fitting to release... thanks @JuiceWorlddd 💚 https://t.co/oc8LCbao4v Without Me Limited Edition 7\" Vinyl available now 🦋https://t.co/4b7pGhKvc3 https://t.co/QWkfiP5uCZ Nothing quite like celebrating a #1 by having one of your favorite artists ask to jump on it. Without Me ft. @JuiceWorlddd is out tonight @ 12am EST  lets go bbs 🦋 https://t.co/7qFy3ERJSA @anthonyli because it is. what is HAPPENING ? i’m fully freaked https://t.co/Uf7UiX3v5b Some cool stuff coming to celebrate #1 ☺️ Are you kidding https://t.co/VLpqldnAN6 Thank you for making Without Me #1 on Billboard 💕 https://t.co/cievF1M1Yd i really need a sec to collect myself so i can properly express my gratitude...i’m so confused?¿ and happy?¿ thank you. this song came out of a very lonely place and the past few weeks have showed me just how loved and supported i could be. thank you guys for everything. i don’t even know what to say. @billboard 🦋💀🔥 https://t.co/z42ZnQWZVO i’m speechless. https://t.co/GVuLic3xiv Injustice is Unacceptable. Everything Must Look Beautiful or I Will Die. I Think, I Can’t Decide.. https://t.co/8R89e24uOO will u give it a rest it’s been years https://t.co/rorpzRugnh brockhampton with that top line govball billing is what I like to see. @brckhmptn 💆🏻‍♀️ What’s the new wave. Slime green? Gerard Way red? Lilac? My brain arguing with me over whether I should grow my hair, cut it, or dye it a bright color https://t.co/H1Esysz5By connoisseur! candy + breakfast are my two greatest passions in life probably. besides music or whatever. https://t.co/fMYsc7UO3i hagelslag gets melty kinda. fairy bread remains crunchy/candy consistency no? https://t.co/AWhhM14cY2 u think I don’t also fuck with hagelslag? ur trippin. https://t.co/TFs8zxMaDI It’s a bar of chocolate shoved inside a semisweet bread. AN ENTIRE BAR OF CHOCOLATE. https://t.co/JbxyJvLSvb Omg don’t drag me into this cultural discourse. I’m just an American https://t.co/ZJ9PpW0olH i would like to extend a personal thanks to the maniac who popularized pain au chocolat. candy for breakfast? je suis d’accord !!! i agree !!! they will mislead everyone so that you look like a liar. \n\nand this is how they continue to silence you, even when they are gone. lemme do my mf thing I was feeling bad about myself FOR FEELING BAD ABOUT MYSELF! How dare I be insecure! Bad bitches only! \n\nover it. it’s ok to be vulnerable and insecurity is natural sometimes. I’m excited for what this means for my next album. For this creative process. To be vulnerable and accept my weaknesses. \n\nBad bitch culture is tight, and I love all my devil-may-care cuties I’m surrounded by but it’s OKAY to feel insecure about yourself sometimes. “confident girl” has always been my ‘brand’ + for a while I felt really scared to be myself\n\nbut then,\n\nI was ashamed I could be so insecure. I wasnt allowed to be. it was “weak”\n\nRecently I accepted I won’t feel 100% all the time + it’s given me access to a new range of emotion Sleepy ting 🇬🇧 https://t.co/7gIG7s4vSY if u drink and drive, lemme know where ur at so we can meet up and I can punch u in the fuckin face until it’s flat wow we are so close to our second #1 song ✨ not getting my hopes up but it would be my first one as a solo artist and I just can’t believe it. If you’re from jersey and in your 20s it seems like we might have been! https://t.co/6TzfgM0JM5 !!!!!!!!!!!! 🦋 !!!!!!!!!!!!!! https://t.co/seJRFXuSKS RT @NYRE: You're about to feel this in your ❣️... @halsey performing Without Me. #RockinEve https://t.co/v499Q5Xqvf RT @GiphyPop: We see you, @halsey 😍😍😍 \n\n#RockinEve @NYRE https://t.co/Zlyx0Y1oI3 @yungblud st-robbery when you haven’t seen someone in a long time, the last couple hours before ur about to see them feel like CENTURIES you don’t grow from “I told you so”. remember; if it’s buried down 100 feet its not worth digging up just to wave in the face of a person who will believe what the want to believe in the end. you gain nothing from a “LOOK! SEE!!!!” work on yourself. focus and grow. RT @UMPG: There’s no stopping @Halsey this year, earning her 16th @RIAA certified single with her platinum record ‘Without Me’ 👏 https://t.… YEAAAAAH BABY! Fam jam ✌🏽 https://t.co/OaPPWbDGlp Merry Christmas 🎄 xo @kylekuzma lets go @Lakers https://t.co/fQnFNSZVZE Ok zubac you’re me? I think? https://t.co/qjZmwFCpkN Izzie and Casey laying in bed together and First Day of My Life by Bright Eyes is playing? I’m gonna combust !!!! Thanks !!!! One of the most exciting things about the holidays, to me, is the idea of how many people got instruments as gifts and are about to start a journey into inspiration. So many artists “born” in the winter. Sending love and creative energy. 🤘🏼✨ RT @xowenm: most celebrities: hi\n\nHalsey: oh yes I remember last time I met you it was April 24th at 2:30 pm and you are wearing a blue rai… @laufeenstra This is peak comedy. @cherrylipsh I donate to places in need I think someone resold this to wasteland Haha it’s just a tiny little thing! Not a big thing! Sorry to get everyone all riled up. https://t.co/jDY1uuedF9 If you are a Halsey fan and you live in LA check my story quick ;) WOW! So much to do today !!!!! hahahaha Christmas Eve everyone ! One day I hope lol https://t.co/lcenczt4oT excuse grubby guitar hands but hi I found an old doodle book. done somewhere in Europe 🦋 https://t.co/9peye6z87S Excited to be helping @tiktok_us give some love to https://t.co/5rQ6HVPNWn this holiday season. https://t.co/5rQ6HVPNWn is creating &amp; distributing bags full of winter essentials for homeless youth this year. download TikTok and help give! 💚💙❤️🎁 #TikTok #CreateForACause #ad https://t.co/ZclixlnDjT @heavenstripped @colorstripped I mean.... I feel like I’m in a pretty qualified position to judge it’s realism hahahaha @colorstripped tell ur mom i said it’s lightweight pretty realistic. Cancer moon lookin ass ok real emo hours have lasted about 6 days for me is this gonna end ever or ???? 🖤🦋🖤🦋🖤🦋🖤 https://t.co/XE8m462Eru wrap presents or keep watching videos of 20 year old tom hardy praying for love in a lap dance, \nand paying in naivety. @ShadowTodd Hahaha. I just figured I’d offer an explanation ;) thank you for liking it!!! 💕 @ShadowTodd Also bad at love, is intended a bit more facetiously and self deprecating like “shoot must be my fault!!!!” My lack of responsibility whilst also playfully blaming myself is projection. Really just 22 when I wrote it and not good at figuring the whole thing out just yet :) @ShadowTodd I think I describe my poor choice of partners. Partner A. Alcoholic who calls me a bitch. Partner B. Wanted me to put my career aside to cater to him. Partner C. Addicted to drugs. Partner D. Wanted something casual not indicative of love. Better analysis maybe ;) @badlandmermaids I was doing CHARITY U SMARTASSRS Me on Halloween eating my shake shack burger after all the pics of my Poison Ivy costume had been taken. https://t.co/gQkfsIZbco pls stop I’m cry https://t.co/gZl8Z84vie Fuck typo lol when I stand onstage I become a void. a void for you to scream your insecurities and griefs and triumphs and vindication’s directly at/into and I absorb it all and feed rigorously off the connection. you help me understand myself. You guys are literally the sole purpose of my existence. Everything I do, eat, think, exercise, write, watch, draw is with the intention of becoming better. So I can continue to create experiences in which I feel so very, very connected to you. Thank you. Sorry for spamming your timelines. I just really love being onstage and I get kinda down when I have off time. Playing for you guys is my purpose and without it I get a lil low. Thanks for the little pick me up. I love you more than you can imagine. I really think about this show a lot. Like a lot. London outdid itself for me on the HFK tour. 10,000,000/5 stars. https://t.co/ie4jEii0mv Some of my favorite visuals ever of all time 🖤 https://t.co/ripHD3EsjS Omg this sent me into flashbacks you shoulda seen how sweaty I was when that hoodie came off hahahahah https://t.co/q4Hm6jrL1H Damn the MASK the fight choreo at the end. That’s it I’m doing the whole tour over again who’s comin https://t.co/XPefowQ6PJ For anyone who went to HFK tour this was an unplanned technical difficulty (scary moment) that inspired the show stop we do during castle now! Little “if u kno u kno” 💕💕 https://t.co/HgGW9cwm3O the butterflies. Now I’m rly sad. https://t.co/EQy8otKsa8 The night I proved to all of London I am VERY strong in my upper body lol https://t.co/bjH84oe9z3 this is breakaway right???? A vibeeeeeey vibe. Ohio showed out for me this night. https://t.co/ci6jjQxc9J DAMN I WAS IN MY BAAAAAAG THIS NIGHT!!!!!! https://t.co/3amkyA1gN5 !!!! Selenas outfit! Lovedddd this show https://t.co/GxKuym2G3g RIP angel on fire https://t.co/8aRI4A6fNZ BITCH IM BACK OUT MY COMA !!!! https://t.co/BzODx2hDPb Paris!!! You guys killed it during Castle!!!!!!!! https://t.co/X9JwjzSZV1 Now I’m in a Don’t Play wormhole wow banger https://t.co/fbRjGuIxaI Imagine not being excited to go onstage when u get to do this omg. Also was this Australia when I was like dealthy ill? https://t.co/6Ew6Gi2c1F My new tour photographer nat https://t.co/IA9vJnOJO6 Is this billboard hot 100? Seeing that tour outfit with my bowl cut is making my brain fry hahahah feels like 2 separate timelines https://t.co/Iicqnp9qk0 i miss touring :( if ur awake can u send me ur favorite videos u took I’m being sad. I miss you guys. Lmaaaaaaaaaao https://t.co/ypyMhinjo9 Without Me is platinum!!! 🥂 and is now my SIXTEENTH @RIAA Certified single ☺️ working on a few special things to say thank you to you guys. This shit is bananas 🍌 wow 💕 https://t.co/sxEfCrwDRj 2 bobble. https://t.co/YE3RvrRtDV I have baked so many cookies this week I feel like I’m gonna actually turn into mrs claus. currently seeking more bellies to deposit said cookies into. Like I feel so dumb even having to address this lmao i don’t get why everytime I do TV people say I’m “lipsynching” like it’s 2018 are people even allowed to do that anymore? I’m not even sure these programs would allow a singer to do it if they begged to cause they’d be scared of tech difficulties compromising the show’s integrity This made me choke in laughter. love is love, baby. And jade, the dancer accompanying me is as much of an athlete as these two 💕 rock on https://t.co/pyz4d3fLxR I too find hugs DISGUSTING !!! https://t.co/8jFyUTonX9 Holy fuck lmao https://t.co/YLYL4PaHoD 💕🦋🌈 https://t.co/4SXWckx5uo Represention matters. Thanks @NBCTheVoice for giving a space for this vision to come to life. 🦋 and thank you @JadeChynoweth for being an incredible human who used her body like the ultimate instrument for this collaboration. Very proud of the emotional performance i did with @JadeChynoweth on @NBCTheVoice tonight. And also very proud to have pissed off thw homophobic viewers at home who missed the message. Thanks for watching. 🖤🦋 Cold brew + oat milk 🌾 https://t.co/HJ0pFQ28KL thrifting kween. I think it’s a school uniform haha https://t.co/Izv8RFbQZL Off to Christmas shop pls send 100 iced coffees https://t.co/2D09aRNSs0 💕🖤🦋✨ https://t.co/tVVUuIriGz I can’t believe this! Deuces bb!\n🤘🏼🤘🏼🤘🏼🤘🏼🤘🏼🤘🏼🤘🏼 https://t.co/sCfz1lB24F @ieuanofficial I would send it if you didn’t leak a video of an unreleased song in a private moment at a members/friends only show!!!!! Come on mate!!!! *~*~*~*imaaaaaaaaagine™️ a world LIKE THAT!**~*~*~~ Uh @JuiceWorlddd 🔥🔥🔥📩📩 can we just collectively forget the past year where I was being weird. I’m back to being my colorful, andro, sappy self again. sorry for what happened or whatever 💕🦋💛 🐷🐷🐷 https://t.co/YE5ooBzMRA I deadass LOVED that performance hahahah https://t.co/HreOAbYXKf I LOvEd ThIs PErFoMAnCE!!!!!!!!!!!!!’ https://t.co/2M5RNAB9Ul @BestCoast Ahhh. Scorpio. Of course. @BestCoast Are you a Libra or a Capricorn @laufeenstra Queen!!!!!!!!!!!!!!! Everyday I log on like hmm what did I do wrong today Cute pic of me https://t.co/728vPSzcLu ya see, i’ve started taking down\nall of my favorite little sounds,\nthat waltz around you in 3/4 notes\nwith each word you pronounce. Idk why I said mami/papi I typed this immediately after waking from my terrifying sleep limbo please cut me: 1 (one) break. my sleep paralysis is WILDIN. where my clairvoyant psychic ass mamis and papis at. help. me ! @MitchyCollins @Delta Laughing emoji unintended this is srs business @MitchyCollins @Delta Mitch that fuckin sucks. If you wanna come by and borrow one of mine please feel free. 💕💕💕😂 you can’t help someone who doesn’t want to be helped. Yes. https://t.co/Mu1qhcUwZu craving hot chocolate but I can’t be asked to make it so I’m eating handfuls of marshmallows from the bag. are non s’more non hot chocolate marshmallows considered raw marshmallows? you are the smell before rain. No way! So much to catch up on but I wanted to start here. https://t.co/VQZHLYh4iw back home in LA which is AMAZING cause it means i get to binge watch atypical for the whole week. Im calling the police... if this is how y’all are living I gotta hurry up making this album https://t.co/OYzz1tUV0Q @bisexting Can’t believe I have a crush on u RT @LybergIngrid: In Sweden, a woman is killed by a current or former partner every three weeks. In England, it's two women every week. In… I’m doing the best I can. y’all need help https://t.co/3ldlhnxnoL @JordanFish86 Wish you could have heard the SCREAM I emitted when I saw that hahaha. YES BOYS. What an incredibly unexpected year. I promise 2019 is going to be even better. I am so unbelievably proud and grateful. Thank you. Thank you. Thank you. 💜 https://t.co/IpFBKTDLPk @aureumroses Neither are eligible 🖤 they are hard deadlines. HFK came out in 2017 and without me came out past the date. Thanks for the support though guys hahaha What is HAPPENING !! https://t.co/rT8sigbqMo Without Me is in the top 20, THREE TIMES. Damn son. @ILLENIUMMUSIC 🦋🤛🏼 (also didn’t realize the clean version was so popular lmao. Fuck) https://t.co/dyFJEhyVPo Genuinely considering Lasik eye surgery so if there’s ever a zombie apocalypse I won’t die cause I lost my glasses. @Maggie_Dickman @Spotify Wait this is so cute what @gradybrannan Stacy’s Mom is an unmatched banger. 😍😍😍😍 how beautiful is this!!! https://t.co/MoCaRRGBgW Cute old friends and cute new friends. Holidays happening. ❄️❄️❄️ @iHeartRadio 🎥: @nathangroff https://t.co/p18WnWPjcX @brysapeters @enews We don’t get paid to do the show, love. @jessbelmosto @GLSEN The message clearly states “comments were made AFTER my performance.” @cloudyflicker @GLSEN The message clearly states “comments were made after my performance” 💕🦋💕 @GLSEN - https://t.co/XdQMPro0KC https://t.co/agOzSYREkX sad little bitch™️ this movie came out in 2006 so that means i was about 12 years old when i first experienced the sensation of “i would risk it all”. i was in 6th grade like, she a gymnast? i’m a got damn gymnast. https://t.co/uCq3cSq4xB What are some of ur favorite essential oils and what do you personally use them for? Apparently me excitedly tweeting about how much I love a band/concert, just like any other person, is enough to cause outrageous anger in some people. \n\nI’m really just growing too powerful tbh. @jjustpeachy Beauty must protect face. too much to do/film this week 🤸🏼‍♂️ https://t.co/AH8lNfDrtX lmaaaaaaaaaaaaaaaao 100% https://t.co/WV2fqeXini when @thestorysofarca closes with quicksand 🤷🏻‍♀️🤷🏻‍♀️🤷🏻‍♀️ https://t.co/CgX7Cbe1mq WOW UR SO RIGHT. OFFENSIVE !!!! https://t.co/dB33nvZGz8 Also. High Regard ¿¿¿¿ @AnnieEnright @brettyfabs Well ur a comedic genius. I applaud u. I love my Entire Life™️ and I’ve loved this band with my crew for my whole career and tonight was Tight™️ Take Me as You Please remains ethereal. I went so hard during roam both my hoop earrings swung out of my ears. If you ended up with them please don’t sell them on EBay. Parker was wearing the best jacket. \nParka Cannon Ok updates from TSSF: fucking stoked for @thestorysofarca tonight. catch me in the mf pit for Roam 🤘🏼 you guys are gonna flip when u see the thing we worked on today :) that’s all I’m saying byeeeee May I ask; in 2018 are we really incapable of printing physical forms of identification? This seems like a fear tactic meant to make you draw the inevitable comparison... does it not? https://t.co/iFGrSbpvVl so how historically formulaic does this need to be before we recognize the path this is taking... fucking hell...\n\ndon’t say “numbers?! what’s next?!” \n\nbecause they aren’t hiding the pattern from you. you know what’s next. https://t.co/hW8rUkJNwA RT @ILLENIUMMUSIC: My remix for @halsey is out now!! Stoked to finally get this out 🎉🎉https://t.co/2nRJHcBP8V https://t.co/EIKjONM9Or RT @billboard: From \"Hurricane\" to \"Without Me\" 🌟\n\n@halsey https://t.co/IraKAqh0If this period of time is the happiest, healthiest, most productive, intuitive, creative, and calm I have been for as long as I can remember. I am starting a journey of some very special music. and I’m not afraid of fucking anything, anymore. just wanted you to know 💗 💗💗💗💗💗💗💗💗💗 https://t.co/q7znpva9jq It’s time. @themaine https://t.co/agBemViYHk https://t.co/TOQjQKGFfK \n\n🦋 https://t.co/ay8sUIH2Z6 cause I’ll be you and you’ll be me.\nthere’s lots and lots for us to see.\nthere’s lots and lots for us to do.\nshe’s electric, can I be electric too? This Is Your Brain on Writer’s Block: everything I write today sounds like my myspace song in 2008 or a poorly disguised Beatles rip off someone send help. https://t.co/FFI3HdjkHJ Man shut the fuck up. https://t.co/1hYvjOKBz6 @ArianaGrande ari the world could only dream of being as compassionate and gentle as you. and since ur being, as always, so classy and nice, allow me the honor of telling them to shut the fuck up. if I could...\ni would make a bed of your smile.\ncrawl into your open mouth,\nand curl up in your bottom lip\nthat hangs like a hammock. @TheAdamAlesch That’s why I used PB as the gif!!!! 🎀 LGBT 💃🏻 characters🕺🏻 are more 🤸🏼‍♂️ than 🤾🏼‍♀️ a plot device!  🎉 https://t.co/Zp2cIlkMAn while I'm away\nI'll write home every day,\nand I'll send all my loving to you.\n🖤 u getting so mad at me wearing a t shirt is proving the point 😇 https://t.co/vcuMGj5Pny @bIushedrose We deadass made them cause I saw u bitchin about how I only make baseball caps lmaaaaao y’all really made the most beautiful children. tell arrow I said give me at least a year before she grows another 6 inches. my heart couldn’t take it. https://t.co/LTplBER8Cj you’re the fuckin acid to my alkaline... 📷: @nathangroff https://t.co/094OtEipSP Also. I’m a CHEF chef. https://t.co/NdQh0E7c5f Thank you for your kindness and patience and faith. You can always count on me. I’m so excited for what the next few years have to bring and I am so thankful I have millions of you to hold me and help me find my way. the first part of the HFK tour ended exactly a year ago. I have changed so much since then but all signs point towards me finding my way to the person I’ve always known I was supposed to be. I’m thankful to have wandered back to where I belong. I love you tremendously. you make me\nsee the world\nin different colors.\n🌎💛🌺☀️🚀 Incredible https://t.co/LX7WeU01PT Black all day. Yellow is delicious but not spicy enough. https://t.co/VRsDDSI81m I learn a very important lesson every time I go to Mexico. \n\nValentina is the superior hot sauce. WICKED !!!!! https://t.co/gbM6hVlsAT Watch my @MostRequestLive @AskAnythingChat here https://t.co/OQxFZXfZVN \n\nthx for the q's &amp; to @OnAirRomeo &amp; @iHeartRadio for playing Without Me 🦋 🖤 https://t.co/PJfCGtMh1m @badlandsbri @alessiacara Ya something about it makes it easier to copy or manipulate or something idk the details but it’s IMMEDIATE eBay giveaway all artists know about haha @alessiacara Blue sharpie 😫 u glo grl. https://t.co/m4NT6Lmltu Holy fuck that’s a big face https://t.co/bl0xsbvjNf @frangilana @anthonyli being a control-freak caretaker (cough. libra) is preparing to cook an entire 10 course thanksgiving dinner by myself, denying anyone’s help, and already knowing I’m gonna be stress crying over the consistency of some cornbread. https://t.co/CZm0v8Cibj @djgeordiegray I mean really geordie u don’t look anything like me at all. wow. Without Me is #1 on itunes. damn... manager woke me up at 7 am to tell me. how am I supposed to go back to sleep now. g’morning everyone. hello world. hello iTunes. i luv u. wow. WOW ! RT @LatinGRAMMYs: 🎶My Only One🎶 @sebastianyatra @halsey 🎶Without Me🎶 👏👏👏 #LatinGRAMMY https://t.co/9uY8aIX1c0 my first Grammy nomination was a massive moment in my life and I was so excited to hand @KarolGmusic her award at the @LatinGRAMMYs tonight. So well deserved beauty 🖤🖤🖤 felicidades one of my favorite performances of my lifetime tonight. @SebastianYatra you are a dream. gracias por una noche maravillosa y gracias por letting me into your world. and thank you @LatinGRAMMYs for allowing us to create this blend of culture! 🖤 there’s this tune i’ve found \nthat makes me think of you\nsomehow, and i play it on repeat.. @astraldaze Same jesus christ that’s a pretty face. Omg rehearsals with @SebastianYatra just went so well. He is sooo sweet and nice and funny and talented! Tomorrow is gonna be amazing I feel so lucky the @LatinGRAMMYs asked me to be a part of this! I’m freaking out. 🦋🦋🦋 It’s actually the only thing of mine I hung in my house. I don’t hang plaques or display awards or anything. But I really love that cover. So it’s in there with the others 🖤🦋 https://t.co/GCiGJD2Moj he gone. I like him. But he had to go be free. https://t.co/bF0KlE6EUA I always forget I have a wall in my house that’s entirely covered with naked women / playboy covers and when strangers come over I’m like “oh yeah this is not normal 2 u” she said, \n“ive had a hell of a summer so, \nbaby, don't take this hard. \nbut maybe we should get an annulment,\nbefore this goes way too far\" @LEOBlTCH Same. highkey kinda disrespectful Not a typo I just like saying eye latches https://t.co/QfHHw9lpkC I love eye latches. WOWwowowowow https://t.co/ZCc930XXPZ oh FIRE yes! 🔥💉 https://t.co/nHB9gBdrfK lemme b ur boyfriend https://t.co/sB12p1DIBU RT @glamourmag: \"You were not put on this earth to make everybody else’s life easier. Be inconvenient.\" - @halsey #GlamourWOTY https://t.co… Most of the time I write them stream of consciousness. A poem like this takes about an hour and I’ll freestyle different sections and then put them together and make them cohesive ❤️ https://t.co/9C6nm4HhFd It’s actually vintage and I got it a while ago. I was sooooo excited to wear it 🖤🖤🖤 reminds me of a watercolor painting https://t.co/lu1ifbpaH8 Take it up with Christian Dior 🤷🏻‍♀️ https://t.co/2REZAv37C1 Today I performed my first poem since the March, at the @glamourmag women of the year summit. Making yourself smaller is not the way to create space. This is titled. “An Inconvenient Woman.” Thank you. https://t.co/6YzKZvr9Qb I have never been so grateful in my life. What a week. And it ain’t even over yet. Blessings on blessings on blessings. I love u guys so much. RT @xowenm: Halsey and Lil Wayne......I love it  https://t.co/GCznlsMCFf RT @halsey: I'm a libra and so is lil Wayne and that's all you'll ever need to know about me. 😭😭😭😭 like what?!? https://t.co/HZlvg744S0 “On my Libra scale I’m weighin sins and forgiveness.” Got this yatted by @jonboytattoo seconds before walking onstage. thanks for writing this one out for me @LilTunechi ⚖️ #libragang https://t.co/gtYheVYKJL Thank u for making this lil girl’s dreams come true. Just performed “Can’t Be Broken” on @nbcsnl with @LilTunechi !!!!! PINCH ME! https://t.co/E93CB34ijg RT @GiphyPop: .@LilTunechi + @halsey 💕💕💕 #SNL https://t.co/mM3PqgR2tB TURN ON SNL RIGHT! NOW! damn near gonna faint \ni’m so excited for this rn ⚖️ don’t forget!!! next Saturday I’m doing @iHeartRadios @AskAnythingChat send ur q's here - https://t.co/P4ZFEc959Q \n\nshout out @MostRequestLive &amp; @OnAirRomeo 🦋 lightning fast ⚡️ I love you I love you I love you https://t.co/J9zSh2OwHY so many communities in California being blindsided by unspeakable tragedy in the past few days. My heart is aching for what has become my new home. My thoughts are with the families effected and I’m hoping for safety and peace for everyone involved. 💔 homesick. oh....it is 2018.....welp. ok sorry back to ur regularly scheduled programming 👯‍♀️ queen crushed today 💋 @bellahadid #vsfashionshow https://t.co/Y2EgPlu67E omg been tagging the wrong year in all my posts 😂😂😂 I don’t know what year anything is That’s a wrap! 🕊🕊🕊 wow! #VSFS18 https://t.co/l81MtW6SQN Lmaaaao this is our backstage outfits! My stage look is sooooo much cooler. But I appreciate that yo hahahaha I’m just happy to be here!!!! https://t.co/uHpR8WYrfE Worked so hard for this! 💋💋💋 #VSFS2018 https://t.co/QmDDCcuqtM ur platform literally put out the article this tweet is about..... am I being punk’d rn????????!!!!!! https://t.co/hvUGlBiK2C 😍 https://t.co/kRXQgSyKyk I love hearing it every single time. 🖤 always want u to be doing well and telling me every single detail bb. https://t.co/2YPo3SCljw No u were not u were so cute and our picture is adorable stop it!!!’n https://t.co/el7CaRBN2Y It’s because I’M Santa. It’s me. I’m Santa. https://t.co/jF4qbArVFa I just had a ground breaking idea. What if...we let female artists...have friends...without assuming that they are sleeping together? \n\nI know I know. It’s like, completely ambitious but like, imagine if we like, tried ? I also did a stripped performance of Without Me in London. For ur more mellow emo moods. Hope you like it 🖤 @BBCR1 #R1LiveLoungeMonth - https://t.co/lCQ0yydPci I covered Lucid Dreams for @BBCR1 #R1LiveLoungeMonth 🤘🏼🕷 @JuiceWorlddd - https://t.co/pNXcM1FhQx RT @drloganphil: When @halsey said everything is blue she wasn’t talking about a person, she was predicting the mid-terms A Conversation On Breaking Through with #HXOUSE \n\nhttps://t.co/wE0IkDubfd @OGKcutYou I’m literally about to get another puppy friend for Jagger this video put me over the EDGE !!!!! u ever try to be nice to someone who’s a dick and ur like\n\nwelp. never doing that again ! ❤️🦋❤️🦋❤️ https://t.co/yo53cLBVfk I am crying U G L Y tears. https://t.co/FABXuFguRD @zaralarsson Soooooooo cute cute cute ! thank you 🖤 sing ur hearts out bbs. I’m over here like a stage mom cheering u on and clutching my heart. https://t.co/fvEUtRNneD oh fuck without me is #9 on the @billboard charts how did I miss this I have so many fun things / surprises the next few days. Little things and some big ones too. Big days! 🖤 love ya a very special live TV debut of “without me” on the @mtvema stage. i spilled my heart in those puddles. 🖤💦 https://t.co/Lcq83lJiE3 it’s that time againnnnn. send me your questions. don’t yell at me about jagger. he’s fine. still cute and still annoying. https://t.co/P4ZFEc959Q \n\n i'll be answering all da questions on @MostRequestLive @AskAnythingChat on 11/17 with @OnAirRomeo Thank you. This means a lot to me 🖤 https://t.co/DyEISKOybr i love you so much. you’re gonna be okay. How about don’t talk to me about anything but WOMEN for EVER. https://t.co/3GEy0Ilkzx asked @billieeilish if she would meet my 13 yr old cousin in new york last night and she made her life. that lil girl looks up to her so hard and I owe billie so major because she was so kind and gentle and amazing with her. really just in awe of amazing female artists today 🙏🏼 Don’t talk to me about anything but Ariana for the next 72 hours pls. Guys I’m so excited for EMAs omg ✨ Nope. I use cbd+ and thc+ based products for anxiety, insomnia, endo symptoms etc. but no smoking. Just ingesting via liquid or applying topically, usually. https://t.co/nIYQYTZbcK I’m cleaning a lot and drinking water so like damn shoulda done this a lot sooner. https://t.co/ktbNRtD2Hm Cold turkey baby! https://t.co/SfzhzaTJIz That is exactly what I’m telling you. And exactly why it was time. Long over due. I’m too young to have been doing ANYTHING for a decade.... besides like....listening to panic! at the disco https://t.co/bg3bDp94I5 I was a smoker for 10 years. TEN! A decade of a habit that ruled my life until I just woke up one day and decided “no more”. I’m REALLY proud of myself for quitting and I’m looking forward to all the fun health milestones I’m getting to reach now. The hardest part is over! 🖤🚭 This @mtvema performance is about to be WILD. https://t.co/MC1oaCUyUM @frangilana Lmao SHHHHH why are u being so LOUD Dane DeHaan has been my celeb crush going about 8 years strong without faltering so if anyone looks like him, just @ me pls. this is what I imagine myself looking like eating sushi. https://t.co/yvry4iwHDp I’ve lived too long in absolutes. A control freak who needs to know the out come of everything. Only “forever” and “never”. I hope I can finally learn how to bow at the hand of “maybe” and let life take the wheel. That is my wish for myself. Lately, I've been thinking. I want you to be happier. Wormhole blackout ! https://t.co/SVnmTGBji6 just blacked out and watched an hour’s worth of Irish stepdancing videos what new music are u guys liking rn? We love to say women are “crazy” instead of addressing the thing that puts them in the position to lose their composure. I will perform in basements for 10$ till I die or retire. Best bet that baby. 🖤🖤🖤 thank you for the love. https://t.co/GGtTbd72oa And milkshakes bb. And tequila shots lmaoooooo https://t.co/GzdUOLj6X0 Secret’s out! I’m performing at the @VictoriasSecret fashion show this year! Can’t wait to be on the runway with these beautiful ladies! 💕👼🏻 Hahaha referring to my transformation abilities ! https://t.co/EU5hQt6FjS I love being a chameleon. “You’re lime green jello and you can’t even admit it to yourself.” https://t.co/V8zPIJfZjk I hate these “$100 dollars to any girl who didn’t dress like a hoe this Halloween” tweets. How about I say $200 to any girl who DID. I hope you felt fabulous. Come get this money, baby. The Without Me video is out now! 🦋💀 https://t.co/tRzd6YBsC2 Without Me - Official Music Video is here 🦋\nhttps://t.co/mLxkk5phEf It will be alright. It will be just fine. Daily thoughts: I wish everyone would shut the fuck up. Mhmm. There is a note under the item description that specifies it’s supposed to ship at the end of October. Should be arriving any day! sorry if there was any confusion. 🖤 hope u love ur shirt bb https://t.co/IO2oDfxkP9 at my shows in brasil over the years I have seen fierce, strong, proud energy from my fans in the lgbtq+ community. keep yourselves safe but keep your energy. do not let fear compromise who you are. the world is standing with you. my heart is breaking for my brasilian fans right now. my women. my lgbtq+. i know you are afraid. this is not the loving brasil we know. we are here for you. stay strong. Accidentally used pure frankincense oil on myself instead of the one diluted with argan oil and now my face looks like a giant bee sting. Super L rn. Going into hiding. @irideschampion Oh foreal? How much u got 💵 I’ll consider selling @irideschampion Bruh lmao artists “rent” the wall! They’re lease was up !!!!!! 😂 artists been putting murals there for years Without Me. \nTomorrow 10.29.18\n - 9 AM PST. 🦋®️ https://t.co/igx1w2rsmy I brought these boys on tour when they were just a little tiny baby band and now they are MASSIVE superstars. congrats on TWO (!) sold out palladiums, and a live show you should be so so so proud of. I love u to death. PJ u da one. ILYSB. 💚💚💚💚 @thisislany https://t.co/AT5qytWQ96 Miss the days when I was a meteor ✨☄️ ok I see u guys. Wonder Woman IS tight and all but I prefer a little Poison.... 🌿🌿🌿 hope you loved it ;) Damn tonight went off. Thank you @TJANI @murdabeatz_ @goSwaeLee @awonderland for performing and making the 3rd year legendary. Tonight is all about https://t.co/3EvynvWQa2 and giving back so thank you everyone for your donations! Happy Halloween 🎃 RT @awonderland: What’s up Gotham City https://t.co/91XYtHogm5 Halsey Presents: Gotham City 🌿🦇 party time... https://t.co/VD0SeRUVv6 Why would I get dressed on east coast time for a west coast party ??? Y’all r smthn...s2g https://t.co/lu4REZDBf0 I Am Not Dressed Yet bc It Is 7 PM lol https://t.co/kJZOW6Ypco It Is 7 PM. https://t.co/KDj5gzbR6D My fingers were icicles and they just stopped working lol. It was cold !!!! All good things must come to an end eventually I guessssss https://t.co/IiJaRE2l9f tonight is gonna be crazy. Woah woah woah woah. U mean to tell me that my butt looked like this at some point? I fell off. https://t.co/tLNcvsneob tru https://t.co/8zk8rGE3hP emotional pickpockets. if ur gonna steal someone’s private moments u might as well reach into their wallet too since we’re out here violating. https://t.co/QJgYGLVR0Y tabloids = poison\n“sources” = fraudulent \nhumans = just human-ing 😍🕷🖤🕸 https://t.co/JbpADpxRvv Lauren is so special because best friend or not, her music would still be exactly what I need in the moment and it gives me goosebumps. It’s just even better that I’m lucky enough to know and love her 🖤 RT @LaurenJauregui: ITS OUTTTTTTTTTTT https://t.co/EUgFowExH4 https://t.co/5c2K2erAsx Watch the video. Stream the song. Buy the song. Tell your friends. @LaurenJauregui is here and she is not playing around. #Expectations So proud of you baby. 🖤🖤🕊 https://t.co/k2y1tATyQE @badlandmermaids https://t.co/HygxWyCVK0 I interpolated the “cry me a river” lyrics in “without me”! It’s the most memorable -breakup song- of my childhood and I wanted to nod to it in my own way 🖤 https://t.co/h11RLoTYzH you don’t have to say\njust what you did.\ni already know.\ni had to go and find out from them. @ me: now remember that u dummy. @ me: life is not pain vs happiness. one does not replace the other. they exist together. happiness doesn’t arrive as a replacement. it arrives to assist u in carrying the weight of the pain. reminder to self: happiness is not a replacement for misery. it’s an addition. pain will always be there. but that’s okay. u allow happiness to join as another option. so when the time comes, it’s there waiting, existing; a possibility for when you’re ready to choose. Without Me. Video. \n10.29.18 - 9 AM PST 🦋®️ https://t.co/RpSLYxnApd Too many feelings. But I also learned I’m a terrible judge cause I want everyone to win and no one to lose Can’t believe i get to be an advisor on @NBCTheVoice My god. @billieeilish https://t.co/UhtQhhZYgp RT @ALICEGLASS: 1.4 million Americans identify with a different gender than what's on their birth certificate and they deserve to be recogn… RT @xowenm: I think about this EVERY SINGLE DAY https://t.co/1ScwWO06Gk Only @ myself lol 🖤 https://t.co/rnc3QcAg85 How you gon win when you ain’t right within? @jisoouI I was only trying to be kind 🖤 I don’t mind fans taking photos at my concerts!!!! I was only saying how I had never experienced anything like it before! https://t.co/cb0uFndeIj Last night, I saw EXILE perform at Tokyo Dome and it was 53,000 people without a single cell phone in sight! It was truly an unbelievable experience. New toy 🌊🌊🌊 https://t.co/bhN16DElub RT @billboard: Halsey has two songs in the #Hot100 top 20 with \"Without Me\" and her @bennyblanco &amp; @thegreatkhalid collab \"Eastside\" https:… YOURE GONNA GET ONE !!!!! https://t.co/MGeNVFhq4e Without Me is just zoomin up every chart right now. I’m so so so beyond grateful but damn.... Y’all okay? Y’all goin thru some shit? DAMN. thank u guys 🖤💀 https://t.co/fmrVG8zCGh @bisexting I can’t stop laughing at this @bisexting This is art mhmm! I can’t sleep I’m having so much fun ! https://t.co/uU7jTJGKjF I can’t believe it took me so long but I finally got an iPad + Procreate! so be prepared for many experimental doodle updates. 💕 Totally Wicked™️ in Tokyo. https://t.co/xNvZrVcwJs 24 and a Twitter stan since 2009 at ur service! https://t.co/dzQjK9BcIx Nothing lmao! everything I named is things I love. I’m self aware enough to know when a meme / drag about me is true hahahaha https://t.co/SUzEtrWwtC And just to make it worse, I’ll appear smoking a cigarette, wearing doc martens, and holding a copy of Just Kids by Patti Smith ://// https://t.co/rUomHNPrCk RT @mtvema: 🚨🌟🚨🌟🚨 \nINTERNALLY SCREAMING because @NICKIMINAJ, @halsey &amp; @rosaliavt will be performing at the 2018 #MTVEMA on 4 Nov!! 👏👏👏 \n➡️… Looks like somebody swiped the domain after i tweeted it and tried to trick u guys https://t.co/fQIk6xLiKP I’ve been on tour for years and I spit HFK out inbetween all that. I want to take some time to discover more about myself and the world I live in. I will start the 3rd album very soon, but please don’t believe/spread rumors. I always make sure u guys know when we are starting 🖤 I’m not lying but u guys can exhaust urself all u want. I haven’t even started the 3rd album yet 😂 I have some life to live first 🖤 https://t.co/ldHViIbocO It was a drunk tweet that said nope dot com. What are you talking about 😂 https://t.co/afGEvLzBeW Y’all really made whole entire threads about some poor stranger cause of a tweet. This isn’t me leave the kid alone 😂 https://t.co/qqLsjXoMp9 per usual: when it’s time, you’ll know it’s time. https://t.co/4X16sILiRg hey what up i’m jared\ni’m 19 and i...\n\nfuckin hate myself. I’d rather not. https://t.co/MkgNoSzVFx This is the kind of Libra I aspire to be. https://t.co/MJY61btyvY jimin. truly a man with taste. https://t.co/GtrvURPGjz @xowenm U mean like all ur tweets ???? Time never cooperates. It either passes by faster than you want it to, or drags on longer than you can seem to bear. Today’s doodle: Tokyo. https://t.co/XfMf3Y8pzs RT @youtubespacetok: ⚡️今夜19時からライブ配信！⚡️\n\nHalsey @halsey さん\n植野有砂 @alisaueno さん\n大屋夏南 @KaNaOYAofficial さん\n\n豪華ゲストでお送りする一夜限りのトークセッション！\nMCはサッシャ @s… That’s just how the pic is haha it’s film. https://t.co/m7es2Q482r today’s doodle. https://t.co/AqpvKuWflf @Kehlani If this ain’t me. nails? guitar? girlfriend? clicks sound when I type? the struggle EASTSIDE IS #20 AND WITHOUT ME DEBUTED AT #18 ON BILLBOARD WHAT IS HAPPENING WTF OMG https://t.co/qOzW07NUPM omg https://t.co/RdCtp6JPUy the best running song ever https://t.co/ydJaeAtz4N How to Disappear Completely (And Never Be Found) Maybe it’s time to let the old ways die. I’m so happy I put out the vertical video today cause if I didn’t I would literally be exploding inside to get the actual music video out to you guys. It’s just...wow! So many feelings and they are coming through in the art in such a big way. There’s a long story to be told here. yooooo who’s listening to Without Me on @AppleMusic’s Today’s Hits playlist?? https://t.co/FwQ1Tlf5sd https://t.co/j0UUMbpkoi the #WithoutMe vertical video is popping up in all kinds of places on @Spotify 💚 hope you love this special thing I made to hold you over till the music video comes out. 💦 https://t.co/Jhxv0rJxre RT @badlandswar: thanks queen ✨ @halsey https://t.co/SpgCenBM3R Happy #NationalComingOutDay! ya girl is #OutAndProud. Here’s a throwback of me covering @papermagazine’s PRIDE Issue! One of the 🏳️‍🌈proudest🏳️‍🌈 moments of my life! 💖💜💙 https://t.co/PX1hy4tFyD RT @chancetherapper: Remember when dealing with friends or family with mental illness, that your expectations and their progess will always… #WorldMentalHealthDay 🖤🖤🖤 https://t.co/9sXwbMzHOc Twinny babe looked sooo gorg. Great minds think alike 💜💜💜 https://t.co/NJjZdXxKPl RT @PopCrush: .@halsey and @thegreatkhalid are all of us during their performance of #Eastside with @ItsBennyBlanco #AMAs 🎶 https://t.co/KY… On stage right now at the AMAs. Wearing my favorite Jordans lol. Tweeting during my performance. #priorities ❤️ I can’t believe it!! Thank you so much for supporting this record i am outrageously stoked. let’s go guys! https://t.co/qhgVY2BoyP This is “Without Me” the way I want you to hear it. \n@beatsbydre https://t.co/dkOoyc7yl8 @BandofNOTHING No way man. I have no reason to be mean to you. just suggesting maybe we don’t create things in a vacuum and maybe it’s possible we had the same inspo. The OG version of my shirt is orange. And there’s a blue one. The purple was an Asia exclusive. Just happened to pick purple 🤷🏻‍♀️ Such an amazingly honest and comfortable interview! The whole thing felt like I was just talking to friends. And it always does with this bunch ❤️ watch this if u wanna see what I’m REALLY like.. https://t.co/O33N0FHmRY @BandofNOTHING Oh damn. That’s crazy. We BOTH ripped off Nirvana. Wild https://t.co/0yNVPHjjNC RT @amazonmusic: #AskAlexa, \"Play the Song of the Day\" &amp; stream @halsey's \"Without Me.\" https://t.co/i2tcAbupZD #SOTD https://t.co/WRNh0yKF… Thanks @applemusic UK for adding Without Me to Today’s Hits playlist! Listen here! https://t.co/IX2FWkPUKH I guess I spend a lot of time in Target bc I just suggested going and G visibly shuddered. Omg so cute! My mom is my best friend too and we used to go to concerts together all the time when I grew up. So happy to have been a part of this memory ❤️🦋 https://t.co/WoBQgyjkUN Does anyone know how to tell if an eggplant is ripe enough. Where the fuck is @chrissyteigen when I need her. 🦇🦇🦇 https://t.co/GactgAkPbB Maaaaaaaayhem. Reminder! #WithoutMe is out now, listen here \n\nhttps://t.co/MG2LgYJgsN RT @1027KIISFM: ATTENTION! @halsey is joining @JoJoWright at 9PM!! Tune in to hear about her new song #WithoutMe! https://t.co/PkQboszyuU https://t.co/TOQjQKGFfK https://t.co/BAFgqIuEn0 @douglasgrnwd No you’re just an absolute star !!! ⭐️ Wow an @NME cover! I always wanted be voted “worst band/artist” at the NME awards but I guess they have other plans....much nicer ones.... head to their website to check out genuinely one of my favorite interviews I’ve ever done. Love always. Thanks guys. 🖤 https://t.co/B4d9fMV2rq ITS YES HAYLEY THE ANSWER IS YES !!!!! https://t.co/qpDnecvz6i #1 ON NEW MUSIC FRIDAY and cover photo!!! thank you family!!! @Spotify https://t.co/9wZdM0rgr4 https://t.co/Y1cev11zbL @tiredbrooks U r way prettier than me 🖤 thank u for your unwavering support since day 1. the realest homie with the best sweaters. I’m really proud of this one, friend. https://t.co/DOVmFHqEOP Today is wild !!!!! https://t.co/KIUgoJn2FY @arjanwrites you guys really gassed me up about my release today and didn’t even mention it was your birthday. Humble king didn’t want to outshine the moment. Thank you for everything ❤️ hope you have the best one, HAPPY BDAY! For those of u asking it’s not a true sample. I just use a lyric from the CMAR in the bridge because I felt like the song had CMAR vibes! It’s not actually a direct sample 🖤 https://t.co/DjG3qk23Md RT @RollingStone: Halsey unveiled a defiant new track, “Without Me.” Hear it here https://t.co/zwAqqtLZbY https://t.co/ojeD4puZfg Listen to #WithoutMe on @Spotify now!! https://t.co/XyOZoowN9V Without Me is out now. Here are my insides. Handle them with care. https://t.co/MG2LgYJgsN https://t.co/41aiOtt0td AHHHHHHH!!!!! Tune into Beats1 nowwwww to hear the premiere of #WithoutMe ! And hear @zanelowe reach into the mushy parts of me. Spilling my guts. \nhttps://t.co/l4gE90QpIp Wow seeing it like that with the cover art and stuff is crazy! I can’t believe it’s coming! Less than 1 HOUR ! https://t.co/YtukVFujNg Cathartic BOP ! is the best way to describe it haha. #WithoutMe https://t.co/7ntHKna7UU Some very special songs demand to be given life. This was one of those for me. 💕 #WithoutMe https://t.co/b0CqpNk01T I cried the whole time I recorded it. But now I feel proud. And empowered. https://t.co/BRfPZsMKjc I think it will make some people feel sad, some people feel empowered, some people feel a combination. It’s different for every person I played it for. Some get emotional. Some throw their fists up and slap their hands on the steering wheel like “fuck. yes!!!!” It’s dynamic! https://t.co/LlYjDVLsl2 Wowwwwww I’m listening to it on repeat imagining ur first impressions putting myself in ur shoes wowwww 2 hours and 15 minutes till #WithoutMe is out everywhere! too excited rn. Just a reminder #WithoutMe comes out OCT 4 @ 12 PM EST. \nPM. \nnot AM, cuties. \nNow get some fuckin’ sleep ;) 9am PST! Sorry the top part is wrong. The map itself is right. Lots of numbers hahah https://t.co/JQj1ed3niP #WithoutMe Worldwide https://t.co/QmxFliMeUu Did You Think That You Could Live #WithoutMe ? https://t.co/FZLMxGrMGx #WithoutMe \nTomorrow 12pm EST https://t.co/op23OmZJ5E Retweet this and @beatsbydre will send you an exclusive clip from my interview with Zane Lowe on Beats 1 about my new song #WithoutMe! https://t.co/ytR1cgnp0L @ashleyophoto You go mama 🤘🏼 ur here because of your incredible talent, your work ethic, and charming personality. fuck emmmm. I think u guys are gonna like it 🌿 https://t.co/gGlv8aQ0Kv Nooo I was only joking with u. I know u bb. I hope people leave u alone now ❤️❤️❤️ https://t.co/KNRiD78IHr I feel like an artist can never fully assimilate with stan culture because one cannot exist without the other. So if they become the same the whole thing falls apart. In other words: Jesus Christ I’m sorry... https://t.co/SzjVr16eOq @cherygloss Second one look like angel wings 👼🏻 I can’t believe I’m releasing a new song in 3 days. \nTime off? We don’t know her.\nWorkaholic? We stan. 🍒🍒🍒🍒 https://t.co/nm6F4bMvxm Without Me\nOctober 4th\nhttps://t.co/Tp5pt9cle1 https://t.co/iaB22Trd5Y @charli_xcx Oh I have pics......ha hahahah RT @yourvenicebih: @halsey missing u ♡ https://t.co/SIldi7TwKI RT @gaystasya: @halsey These are so powerful we stan one (1) legend https://t.co/9dPmwcL8kt RT @20smnthng: @halsey https://t.co/4c0lOBLnU2 RT @cherygloss: @halsey my favorite part :”) https://t.co/V0ZJlW4lqn RT @achingblush: hfk has been a year and a half long soundtrack to my life and i’m so grateful to have been able to experience all the magi… Send me your favorite pictures from the HFK tour so we can reminisce together. I’m feeling Nostalgic™️ Can’t believe the HFK world tour is over. Thank you so much for everything. You guys have made me a better performer and a better human. When the world hardens me, the love you provide softens me once again. I love you. @MitchyCollins Uh..so....Can I get a bacon egg and cheese sandwich with no bacon and no egg? So a cheese sandwich? It’s a grilled cheese. I want a grilled cheese. Women have been afraid since the dawn of time....spare me your hidden guilt tears. https://t.co/7mwX0EogM8 Time to wake up and Get In My Feelings ! @6LACK #eastatlantaloveletter https://t.co/iEeME5m2fm No something else ❤️ https://t.co/isyHgRLvTl Come and make a home in me. \nLeave your things strewn across the floor, shut the windows to keep out the cold, and throw yourself down onto the sofa with a contented sigh. \nThese walls are breathing to keep you warm. Without Me\nOctober 4th https://t.co/tZ3HcYmGUn Amsterdam knew I’d be gathering all the gays in one place today so they put up the bat signal. 2 shows left! See you tonight! https://t.co/FP2toi2skN Bad At Love - Halsey.mp3 https://t.co/sKpfLyXRZY RT @CelebMix: Halsey’s hopeless fountain kingdom tour arrives in London https://t.co/GRNWza3OtL https://t.co/K6rE7LcHEO Just mental. Broken backs and ski masks. @DonsLens https://t.co/UOeYjUpvKR Did I ghost write this??? https://t.co/hWIFlQ2iG2 “But I don’t have to fuckin’ tell you anything.” LDN NIGHT 1. @DonsLens https://t.co/FuU4aI5sHy that gud shit for LDN 🖤🔥 https://t.co/LhNt0ZsTEN London! Can’t believe I get to party with 10,000 of u this weekend. Haven’t played a show here in nearly 2 and a half years. We have a lot of missed time to make up for tonight....let’s fuckin go! “It is a good lesson, though it may often be a hard one, for a man... to step aside out of the narrow circle in which his claims are recognized, and to find how utterly devoid of significance, beyond that circle, is all that he achieves, and all he aims at.” - The Scarlet Letter https://t.co/odPOTqskA3 the future is iridescent 🤘🏼\nhttps://t.co/8BOCSnOcLO @frangilana There is no reason u EACH needed ur own bottle of wine at noon Did you know, Closer is the 24th song in all of history to be certified Diamond, and I am one week away from my 24th birthday? I love science. I imagine this experiment proposal going down like:\n“we should do this” \n“why?” \n“Um. CAUSE??????” https://t.co/dfKXZv0TOh Honestly I just didn’t think of the idea until a few days ago hahahah. https://t.co/0a7zikO6ws @KristinaShaw17 Tell ur sis if she ever wants to come kick it with me at a show I’d love to have her. Bald is beautiful. And she is most certainly a shining example of that. https://t.co/PXnoKqRnbg This was my reference haha. “It’s a bustier!!!!” https://t.co/h5K7QWPj1p 😍😍😍 https://t.co/bT6s8B3NW5 🚭🚭🚭 https://t.co/yMunmLt4G9 how *absolutely* pathetic. Brussels. ❤️ smokin’ hot show. Y’all did that. I like 3 and 4 but all are cute! https://t.co/8jQrW90Ovq I don’t remember asking for a chocolate covered waffle in my sleep but nap me was definitely looking out for awake me cause now I have one and it’s TIGHT. Hey Brussels! I’m the only one who posts from my socials! I don’t have super controlling management. Just my best friends who happen to be really good at business stuff haha. It’s always me on here :) https://t.co/3L9dKMHkUv 💙☁️♥️⭐️ https://t.co/LwZ0a8IW19 ON GOD? https://t.co/LrnRTNx1VI Thank you @beatricepirate for making such a beautiful song that made me fall in love with the French language years ago. I hope I didn’t butcher it too badly tonight 😬 it was a beautiful moment all because of you! I was sooo nervous 😭😭😭😭😭😭 thank you!!!! https://t.co/nI16ZPhgPf Paris I’m doing something special tonight :-) We would never tell fans they can’t bring in flags. It must be a security measure beyond my control. I’m sorry someone lied to you like that you guys know me better than that. https://t.co/Zzt2ih9skB comme des enfants. this just further amplified the original statement https://t.co/TOZ0ZU3vT6 “so, did u get a pet snake or did you get your belly button pierced?” we going ✈️ manic hours, folks. Ok when u say it like that..... my mania is showing lol. https://t.co/VcSoH9x0wS oh wow. just wait until you see it. Olympia is so beautiful ❤️ I can’t wait for the show tomorrow, Paris. @brielarson ur panicking and I’m currently peaking. HI I CANT WAIT FOR THIS MOVIE AND I LOVE YOU! Do any of my followers have ball pythons ? Can u tell me about them ? (ﾉ◕ヮ◕)ﾉ*:･ﾟ✧ @IiIacsunrise I love you both. Brie Larson? I love: https://t.co/RjwUJ1R1i8 Whenever I’m introduced to a stranger I hug them and I’ve just been informed that that’s weird. If you’re camping outside the venues on this tour please be safe and take care of each other. ❤️ @z_flexing Yeah but you’ve retained ur youthful glow. 🙌🏼 skin care god, give me ur secrets. 👶🏻 Madrid is so beautiful. Aight back to your previously scheduled programs. American Animals is HECTIC. Damn. I can’t believe it took me so long to see this. Must watch. 🤷🏻‍♀️🤷🏻‍♀️🤷🏻‍♀️🤷🏻‍♀️🤷🏻‍♀️ https://t.co/x2L1tLexMo my birthday is in 2 weeks! and I’m kinda freaking out! 23 was truly my lebron / jordan year. Lighting a candle for kobe every night till my birthday so this whole 24 thing works out. @gradybrannan Best thing that could happen to me is I turn *grady 24* cause that’s basically like turning 21 I don’t wanna turn 24 😩 Dave Grohl watched some of my set last night and I almost threw up mid song I was so nervous. I love u!!!!! You’re an Aquarius aren’t u https://t.co/poOih3FAxQ Uh..... maybe I’m havin second thoughts https://t.co/m7ZbjXje5v I guess they never went “out” but I don’t see a lot of performers with them any more. 🤔 feel like I might get mine done... Can we all mutually agree to bring back bellybutton rings. Dippin dots 4 life https://t.co/p30WOZIcVY Bend it like Beckham @DillonMatthewC https://t.co/43SbGh51Xg @Emilyy_Finn I assure you I was not. I’ve never lipsynched in my life. Also, could you not hear me heaving and breathing running around the stage?! RT @halseyonchart: “Closer” has just been certified DIAMOND in the USA, for selling more than 10 million units in the country! 💎🇺🇸 https://… and from this day forth she learned to let go. Fell in love when I chose Lulo to be in the Hurricane video. Absolute lovely angel. 👼🏻 https://t.co/PU7qbZ5wzM Ok too petty for 11 am lmaooo Everything is gonna change. said I’d catch you if you fall. 💡 https://t.co/bb9hOYY7N0 @SevianFrangipan Are u kidding me RT @poetastrologers: Play Stevie Nicks at the club I wish the media would have a shred of sensitivity. Humanity. There are humans behind your headlines. Gross. I wish people wouldn’t put words in artists mouths. It’s insane that there can be a literal video of an interview or question; and the corresponding text article can report a completely different quote. Like the evidence is right there. big cancer moon mood. https://t.co/GyZSI6lVi9 do u ever wonder what ur skull looks like 🖤🖤🖤🖤 https://t.co/uvBCpROKBg I play myself for a very small moment! Which is insane because it means Gaga and Bradley saw me worthy of representing a piece of the current state of music in this film forever. They could have picked any artist. It was so humbling and unreal. https://t.co/GnLTIydTX6 I guess now is a good time to finally tell you guys that I have a little cameo in A Star Is Born! Thank you so so much to Gaga and Bradley for including me. It was an honor to watch both of your talent and dedication on set. ❤️ an all time life highlight for me for sure. big uwu. And if u can’t get a job in the future cause of ur dumb / cute tattoo, I will personally hire u. https://t.co/TDBCZ36o0f seeing fans get tattoos in my handwriting makes me: uwu. \n\nIt’s that good shit. BRUH! Number 1 on the charts in the UK?!?!?!? Might have to add this song to the set for the UK/Europe tour 🤔 if you guys will sing along...loud....! Congrats fam! @ItsBennyBlanco @thegreatkhalid @edsheeran https://t.co/tTYyFUvMte Since it’s still the 3 yr anniversary of Badlands release week. Every night I sing this song on tour. And I say “This song is a reminder you don’t belong to anybody but yourself.” I was 19 when I wrote it. I knew my worth then. And I know it now. 🌧☔️  https://t.co/7CZ2csN2aN Stay away from people who only “give” when you “give” first. Josh you’re doing great sweetie I love u too. https://t.co/VMhZKUPu6y Strangers is so powerful. The visuals during that part of the show feature real couples. Most of which are lesbian, gay, and/or include a trans partner. Tonight I brought 2 sweet fans onstage with a (Canadian themed!) pride flag &amp; I was just bursting with admiration. Rock on 🤘🏽 can confirm this is true. 🤷🏻‍♀️ also if that was ur boyfriend with u tell him I said “I’m sorry” and also “way to go”. Hahaha https://t.co/QtL8b08fHj No I said “you’re so hot” to a gorgeous tatted chick with blue hair 😂😂😂 https://t.co/i5Ll5KhFrp On the 3 yr anniversary of BADLANDS I played 2 tiny shows in Calgary &amp; Edmonton to close out the North American HFK shows! the last NA headline shows I’ll play for a long time. a quick run in Europe im back to the lab to make Album #3! ❤️ love u always. https://t.co/3O1TovHG21 wow all I did was invert my colors from white hair and black clothes to black hair and white clothes... \nHer mind. https://t.co/KJiw4HhOLH @IiIacsunrise Do it @RIAA 🙏🏼🙏🏼🙏🏼 thank you guys so much! RT @RIAA: @halsey probably goes without saying but not many debuts (or any album really) wrack up that kind of 📀💿! Well done 👏 👏 Here’s the… I feel like I haven’t played there in so long I’m SO excited https://t.co/efdgR0Ja4M Yes that’s why I joked back https://t.co/ADT1y7W2xV Autoimmune issues are incredibly hard to diagnose which makes them hard to treat. They can disguise themselves as other illnesses and symptoms from one illness can play off symptoms of another. Most people spend years looking for the right diagnosis before they can treat it! https://t.co/9zX0CFzLlI @IibragIow It’s not that kind of sick lovey ❤️❤️❤️ Endometriosis puts you at higher risk for having auto immune illnesses like rhumatoid arthritis, IBS, MS, Lupus, and lots of other inflammatory illnesses. When you have more than one it’s called a “cluster”. Which feels as gross as it sounds hahaha. https://t.co/n4Y7r5jRDR u can stay home. https://t.co/H97jQ2EBJf Already take it! I take a lot of supplements / vitamins / herbs. https://t.co/jI57KngbOt Because I have an auto immune disease hahaha. https://t.co/o757MfJ71h I’m having a really hard time shaking this flu / sickness / whatever I have going on. 😫 gonna drink my body weight in blue Gatorade and turmeric tea. I better be doin cartwheels by tomorrow. I can’t ever thank you properly. You kept me alive. You helped me fight my way out of my own personal mental badlands &amp; allowed me to emerge stronger. You are all an integral part of my development. I am nothing without you. I’m a human built out of your voices, laughter + tears. You built me into an artist who is so lovingly attached to every one of you. I see the “lightning in your eyes” when the first few notes of Roman Holiday play. The vindication when Control begins. Your voices carrying the chorus of New Americana. Your lights in the sky for Drive. You guys made Badlands special. There are b sides on that album PLATINUM bc u picked the songs that spoke to you + didn’t need some campaign to tell u. You make creating a setlist near impossible bc every song is a “fan fav”. You wrote your own story into the fabric of that album Badlands Air was pretty legendary! We created an entire fake airline and had people go to an actual fake travel agency to pick up fake boarding passes / passports to enter an album release concert at a secret location? the attention to detail TRULY jumped out ✈️✈️✈️ https://t.co/Nhkzf7V5Co Haha a bunch of awkward/cute shit very similar to the first day we met. We had a session and I drove him home from the studio and we had a very awkward goodbye when I dropped him off #3YearsOfBadlands https://t.co/CWap2L6rSI Castle! I made it in a pillow fort in a basement with @Lido ! Hahah. I picked a bunch of sounds I liked from some folders and handed them to him like a puzzle and said “make this a song!” He made the castle beat and I wrote the song/ cut the vocal 20 mins later! #3YearsOfBadlands https://t.co/Mi6VDY01Vi That’s actually how we do it live! So I think I kinda subconsciously agree with you. Haha. #3YearsOfBadlands https://t.co/WUyF3nXC8n Roman holiday! It would have been so colorful and nostalgic. Or Strangelove very dark and cool. #3YearsOfBadlands https://t.co/OnMSO5dDIk Bruh you guys just assumed 😂 you created an urban legend about a video that didn’t exist. https://t.co/wAkSrOXd23 I guess after 3 years it’s probably time to tell u guys there was never a Drive video and we only implemented Drive as a creative tool in the scene to make u realize that she makes her escape lol whoops https://t.co/c6yn5O362C This isn’t a movie... these are the Badlands. #3YearsOfBadlands   https://t.co/dgpQ5p9YNl #3YearsOfBadlands https://t.co/qk4GF1YdAJ RT @ComplexSneakers: February Sneaker Shopping guest @halsey showing off some new ink. https://t.co/Y3OlrCWHmb RT @FLAREfashion: “I think if you end up with a platform, you need to use that platform to uplift the people that gave you that platform to… I am happy when they leave. My show is a safe place. Plus they’re out numbered lol https://t.co/MneP4Klrg9 people bring anti-LGBT religious propaganda to my concerts a lot and it’s like, I feel like I’ve done enough good in the world that God’s gonna forgive me for eating some pussy. RT @iHeartRadioCA: Congrats @halsey for winning Artist for Change!  #iHeartRadioMMVAs @ctv @much https://t.co/8XRN7ZaEOz Me trying not to read Sharp Objects spoilers https://t.co/H0Oc12IHnh Toronto! Won an award and performed “Sorry” for the first time on television! #MMVAs a success! Thank you so much everyone! #6goddess https://t.co/neUQdlqLam if they laugh, then fuck em all. pre show gentleman’s club. Thanks Toronto https://t.co/eeYhNn1kYO @Camila_Cabello People get so mad at me when I mix those but it’s legit my favorite thing. @visitkingdoms This better mean what I think it means I’m really really really really really sick today. I haven’t been this sick in so long. Some weird flu. Hello to the fans who waved in the rain during soundcheck. #MMVAs gonna cheer me up tomorrow. Can’t wait to see your faces. 💕 hit records that are 3 times platinum like a hat trick. angel in a dress and a devil with the mic flip. 👼🏼 https://t.co/mb1Hji84xg RT @animevisuaIs: isn’t it? https://t.co/3qazoHo4Hx Can’t sleep cause I’m just sitting up dissecting the @BTS_twt #Idol music video. No one makes better MVs than these guys. NO ONE !!!! https://t.co/jGGzjIFIkl CBUS was legendary. you guys always go the hardest. crazy asses. love u. YES! Never disappoint. New pre show pump up song. @bmthofficial 🤘🏼🖤 https://t.co/A2hrkMdpqp Is there for real an anime convention in Columbus today?????? the only “bad” in that scenario is a bad idea. lmao https://t.co/ZJC8WMznuS @waxingcrescnt https://t.co/g4nqxIDYJx ok so here’s the thing. I’m so proud of us that we’ve become a festival headliner and it’s literally so amazing. but tbh I fucking hate it bc it means I can’t watch anyone after my set 😭😭😭 like everyone just goes home and I’m ready to party! Columbus see you tonight 💕 😇 https://t.co/FKIUKlUj8p 🤘🏼🖤 https://t.co/F6RdhYI4lW 🚕🚕🚕 https://t.co/yGOht5kYTw RT @ErickFernandez: This is so gross and the level of racial profiling going on here will make your blood boil.\n https://t.co/XRV116dayV Kinda miss legos. @LaurenJauregui Thank you bb. We trained our asses off to make a kick ass video this era and I’m so so proud of it. AND im proud of the strides that song made for LGBT representation in mainstream music. I’m lucky to have u in my corner. Both literally and figuratively. ❤️ Yep that sums it up. https://t.co/DET2bYuFAl Help https://t.co/aHTdVKjAKD sad bitch https://t.co/zJSMoyJceJ freak hoe https://t.co/DyJWVvxmYR For all y’all askin..... sorry in advance https://t.co/bZOoHoZDiR @lourambeau . Sad Hoe™️.... hahahahaha https://t.co/la2hY8pUvN bc I directed all my own music videos this album just to have @MTV “#wcw” me to death and not nominate me for anything so it didn’t feel right to go. I’m happy you guys liked the videos. That’s all that matters to me. 🖤 https://t.co/lprzIrTUHg I wish my horoscope was a friend I could text. Like “yo what’s the move tonight? Is this a vibe or nah?” You’re my least favorite in the band. https://t.co/T5ZhVtelWk @hopelessreprise No they quote tweeted it haha what kinda time do u think I have Ok so what’s next week’s lottery numbers ? https://t.co/jgLXyGwKgL NUMBER 1!!!!!!! 🥇🥇🥇 😍😍😍 thank you so much guys!!!! https://t.co/qBjYBD2nkK Can u believe I sang my favorite song with one of my favorite bands tonight ???? @AllTimeLow @ashleyophoto https://t.co/KHzWgCM79N 🖤™️ honey I’m home. https://t.co/l4DW829G0q where two raging fires meet together, they do consume the thing that feeds their fury. RT @StageRights: Halsey was so much fun to 💃🏻 along with tonight! #Hot100Fest https://t.co/UelyqIIuYX BILLBOARD! It’s pouring!!! I see all your dedicated asses in your seats! So when I get onstage we are gonna go fucking HARD in the rain. 🤘🏼💦 @Hot100Fest little baby :( that desperation in his voice..... he’s lucky to have a sister like you. keep your head up little man. you’re better than all of them. 🙏🏼🙏🏼🙏🏼 https://t.co/tYoEPgiEFH MOOOOOOOOOOODDDDDD ! https://t.co/boq2FZ7pzv your actions scream through a mouth sealed shut. Damn I do!!!!!!!!! https://t.co/0iv9Hp2ohy Woaaaaah cooooool! Love love love this! https://t.co/kMztkr0Vuf @CRobertaaa I was jumping off cliffs in water and climbing rocks haha! My feet are tough but not THAT tough. I look like a grown up with cartoon chicken pox cause the mosquitos love me. Help! @taylorswift13 meet ur girl. she’s the coolest, ur gonna leave best friends. https://t.co/fg9UqmC8gF Leonardo DiCaprio as Frank William Abignale Jr. https://t.co/cTMHEu9F8Z I’m usually really good at keeping things a secret like songs and albums and videos and collabs. But sometimes I just get reaaaaaaally juiced about something and everyday feels like I’m gonna explode with the secret. PSA! If you’re going to outdoor shows this summer, and you’re in the pit, and you’re binding, PLEASE do it safely. 🖤 it’s hot and exhausting down there as it is. we don’t want you passing out and missing the show! Haven’t slept in 36 hours and all I can think is that the police rapid sirens in Jakarta make the same sound as an F-11D blaster rifle. I love Star Wars and I need sleep. That is all. Pin up ting. Jakarta ! You were beautiful. https://t.co/yJwxYLLw4R AGREE!!!!!! peter don you are the greatest! @DonsLens https://t.co/IvPBiKKv5T kiss me kiss me kiss me 🤷🏻‍♀️ Little sisters* 🙄🙄🙄🙄 be gentle with the young ones in your life. your little brothers, litter sisters, nieces, nephews, cousins, neighbors. the way you speak to them becomes their inner voice later in life. raise confident and compassionate young people. ❣️ in Jakarta for the first time ever headlining ON OFF festival let’s gooooooo!!!! @IsmayaLive 🌸 i can’t believe I spent a whole damn year growing out my curls under those wigs for y’all to say my natural hair looks like a wig... some fucked up shit lmao. Still trying to get everything healthy again. I was blonde a few months ago and an inexperienced colorist fried my head 😞 it’s s journey but I reaaaaaallly don’t wanna have to chop again. 😫 https://t.co/iaZ49gB733 lmao u big mad. @twinfiresignss That’s why I’ve been wearing wigs! So my hair can grow underneath them! Worked v hard for this hahaha thank you ❤️ https://t.co/6ZPrhBAC02 new growth, new growth; all these fades I outgrew ❣️ https://t.co/EfYax1Wvo0 heartbreaker. 💔 https://t.co/u7ec9VZX8c Manila was so loud and so special. What a night. 🖤🖤🖤🖤🖤 @amirah @seIfIessdrunk They decided the show wasn’t safe. And yes OF COURSE we are donating to local recovery charities. This is devastating. Actually.... yes! https://t.co/hAr6RjDSPO @seIfIessdrunk There was an earthquake that killed 90 people you can’t be serious right now? Does it ever get lonely? graphic novel / comic book hero vibes in Singapore 💊 https://t.co/ZUOg24b3vs flames, friends, food, fun. first trip to Seoul = SUCCESS! A few more dates left on the Asia tour 🌸see you soon! https://t.co/UXeAJofski https://t.co/2Q4uv6XU8p We have been friends for almost 2 years! I am so lucky to know them and they inspire me so much. 🤘🏼 your boys are A+ https://t.co/wsnKKLen1n you know there was no way I’d come all the way to Seoul without seeing these guys. 👼🏼 can’t wait to see them play Staples center!!! I’m HELLA proud. 💗💖💗 @BTS_twt https://t.co/RF4vqE9G0J i love my loyal ass lil ass taurus ass brother. one of the only people in the world i don’t feel like im bothering when i need someone to talk to. too smart for his own damn good though. little brothers are precious. i’m not worthy. 🙌🏼 Soju novice turned pro 🙏🏼 @JAYBUMAOM https://t.co/TXmmo5Zv7N 🍬🍭🍡🍧 bubblegum stage makeup for tonight. https://t.co/rj5d44XsuN Backstage mood in Seoul. @chancetherapper making little booties werk all around the world. 🧠 https://t.co/inhnWiQRAL YESSSSS !!!!! https://t.co/mfC7SpwMv7 Very excited for the show tonight Seoul 😊😊😊😊 YAY! 🍉🍇🍏🍋🍊🍑🍒 https://t.co/1cUzh8o0XX @DanielPlatzman You couldn’t keep up ;) Wonder why I never learn. I AM IN SEOUL!!!!!! MY CHEEKS HURT FROM SMILING I HAVE WANTED TO COME HERE FOR SO LONG! 🌸 thank you to all the fans who greeted me with cute presents and happy faces. I AM SO HAPPY 💐🍃 @austinjrandall He was already blonde. I bleached his roots so I wouldn’t have to bleach a freshly shaved head cause that would burn really badly... My other job. https://t.co/2We5rTxnN7 fate in your hands, while you're waitin for me. Hahaha it was yesterday where I am in the world. I still had to give my post!!!!! I love her so much even if I’ve fucked it all up because time zones! @charli_xcx ❤️❤️❤️❤️ https://t.co/9WWt6X76pg @Kehlani 🙃🙃🙃🙃 bless the ocean and it’s superpowers. no longer cheating myself of happiness and it feels DIVINE. ✨ @helloitsaisley Haha no I was just jumping into rough water Good morning Honolulu. Ready for the show tonight? 😊🐠 https://t.co/9wsKakWW7o Lotta the time I’m laying awake at night I’m thinking bout deep shit...\n\nLike Beyoncé’s Coachella performance. I got to see that shit with my own two eyeballs and y’all want me to just be able to sleep? bruh I’m talking about the reef in the ocean 😂😂 https://t.co/MILFT1VfQU reef fucked me up real good today folks so if I’m limping onstage in Honolulu u know why. 💔🐠 Oh. My god. https://t.co/pIieBmPmiO wonder what the mirror’s telling you these days. Last American HFK Tour date is in a few days! ASIA, ur next! 🦋\nGet ur tickets @ https://t.co/UXeAJofski https://t.co/Xx7d5pfb7J SOLD OUT Red Rocks. My 2nd time and it always feels like home. https://t.co/jetcahMehN Tonight's show in Las Vegas is SOLDDD OUT! But after the show, i'm performing &amp; hosting @Playboy's Midsummer Night's Dream Party at @marqueelv! https://t.co/tuZg4mg8Ce RT @lyderz_: Here’s an iconic Halsey mic flip for ya https://t.co/59syj1ifr2 Pride is a choking hazard. Bay Area Baby. A dream. Thanks for being my 2nd home. Tonight was ours, and no one else’s. https://t.co/aUhedNpEQs 🤷🏻‍♀️🤷🏻‍♀️🤷🏻‍♀️🤷🏻‍♀️ https://t.co/34Ke4MoasK ❤️❤️❤️❤️❤️ best night. https://t.co/NYnh1zm0BZ Bruh I’m freezing. Y’all so weird in the bay ITS COLD HERE https://t.co/DtsXyN7wx5 Someone: has short hair\nA comedic genius: “lmao is that Halsey 😂😂😂😂😂” BAY AREAAAAAAAAA. You guys ready for tonight?!?!? @laufeenstra I play her every single night sis. It’s like THE song hahahahaha 🤘🏼🤘🏼🤘🏼🤘🏼 https://t.co/kRvjlBFNNx RT @IGN: The Justice League make an appearance in this clip from Teen Titans Go! To The Movies! https://t.co/21dHODOUO6 So happy!!!! https://t.co/s3u23XUzah Paul Rudd. That’s it. That’s the tweet. Only 4 US shows left on this leg of the tour!\nAsia, ur next! Tickets &amp; tour dates @ https://t.co/UXeAJofski https://t.co/3239qlxczp I think I’ve seen Forgetting Sarah Marshall 100 times and I still laugh so hard I think I’m gonna die every single time. the hopeless fountain kingdom world tour has sold HALF A MILLION tickets. I can’t FUCKING believe this. I used play to 50 people!!!! you guys! https://t.co/b14m3LvHBe tbfh i love seeing pictures of you guys meeting up and going to shows on the tour. even if every single one is just you all juuling ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ 🍊🧡🔸 @kellyshami @danielleguizio @DGNYOFFICIAL https://t.co/UI9psQuQAh LMAO bitch WHERE. Watch the video again 😂 https://t.co/sklzZskB3n RT @aureumaura: cannot believe u waited a whole ass 3 years to come back to portland and stunt on me like this @halsey https://t.co/kPixtck… RT @bIushedrose: this pic has such big dick energy https://t.co/iS34pqWuvn Portland that was the sickest show. I had so much fun onstage it flew by waaaaay too quick. I forgot to acknowledge onstage that the venue was on HALSEY STREET!!!!! 😍 He came to the meet and greet and has been a fan for a really long time. He was sooo sweet and soooo amazing. I could literally cry rn this is so cute/cool. https://t.co/bKkjapl11l @goodygrace I think about this probably more than is normal. Sending all my love to @ddlovato. I hope she is given the privacy, respect, support and compassion she deserves right now. Demi you’re a warrior and you’re going to get through this. Your bravery is unbeatable. Just tryna fit in wit the kids https://t.co/Fal8Qn40F3 finna steal ur man’s shirt n then steal his girl too 💌 https://t.co/1xrgC6bKnL Going to see myself be Wonder Woman 😍 @TeenTitansMovie #TeenTitansGoToTheMovies https://t.co/TTyNo2mKKL maybe there's a God above.\nbut all I've ever learned from love, was how to shoot somebody who outdrew ya @g0thbbyx I pick at them way too much hahaha. I’m not responsible enough to have them 😫 This is so accurate hahah. https://t.co/RhHvBylzqq I stuck to my word and wore no make up &amp; just my fake eyelashes on stage tonight ! .......and then peeled them off and showed the camera man because they were melting off ! lmao Thank u guys for letting me be the mess that I am. It’s liberating. And also fucking sick. Lol. Arkansas is so modest. Y’all seem so quiet on the map, but this crowd was RAGING. Who knew this whole time I was missing out on such a lit crowd. I’ll be coming back here always and forever. We fought through the heat, sweat our makeup off, screamed, cried, laughed, danced, DAMN. @peskyybee Think I mean more so bullying people because they think it’s funny. https://t.co/AavEfRCVRX No I think that would provoke immediate death I was being dramatic haha https://t.co/x7bKU3zgdw Anyway, it’s 145 degrees in Arkansas so I’m not wearing makeup on stage tonight and my boobs are definitely gonna be sweating. Enjoy my tomato face. Thanks for coming to my ted talk. @ people on the internet who use drug addiction as a meme/troll concept: enjoy every second of your privilege. because you’ve obviously never had the disease effect you or someone you love. i pray you never experience the horror of the thing bringing you a quick laugh. 🙏🏼 GUYS please PLEASE be careful with the heat advisory today in AR! I’m soooo nervous and I keep checking in to make sure everything is gonna be okay. Drink water and DO NOT push each other today! I want a safe show! ❤️🦋🎈💙 https://t.co/isbaojOn3q Can’t believe how insanely my brand this is. https://t.co/79GGFbxPsn Well me and @KelseaBallerini ended up doing a karaoke rendition of “Picture” by Kid Rock in a dive bar where no one knew our names, so how was your night? Nashville if you’re in the crowd right now make sure you go nuts when @lovelytheband plays “Broken” it’s my favorite song! @bIushedrose @VUMCchildren Urban yo! Sitting side stage watching @lovelytheband perform. I’m so happy to have my friends here today! Thanks for coming on the show guys 😊❤️ I love you so so so much. Spent my morning at @VUMCchildren in Nashville hanging with the most special friends and amazing caregivers. Thanks Seacrest Studios for always having me in! You make my day every time! https://t.co/bXQpIkm8pg @EssenceOfHalsey @xowenm It was a front handspring.... @xowenm hmm u can watch the colors mv @NOVABRASILIANA I’ve been doing it during hold me down for 2 years every single night, but one video of me slipping on water during young God and now u guys wanna get brave and make fun of me????? @softglittr Of course it was real! I’ve thought about it. I have all this tumbling skills that literally go to waste. But if I hurt myself even one night it wouldn’t b worth risking the rest of the tour haha. Gonna have to save it for when I’m slightly drunk &amp; brave at holiday parties. https://t.co/7f9waXxDeV Nashville! I just heard tonight is sold out! This entire tour has been sold out so far every single night! My stomach is doing a round off back handspring back tuck. 🤸‍♂️ Hahahah Indy was a wholeeee entire vibe https://t.co/kS0NLSQDUr you’ve got a warm heart, \nyou’ve got a beautiful brain \nbut it’s disintegrating.\nfrom all the medicine. Listening to @the_wldlfe open this show in Indy from backstage. They sound sooooo great. ❤️🦋 If you aren’t attending this tour, worry not. This energy is growing and incubating a love that will last forever. They will always feel this way. I’m just appreciating it in the now :) This is by far my favorite tour I’ve ever done so far. I wake up in a great mood every day. The meet and greets are thoughtful and honest and loving. The show is so raw and real. You guys are really something, this summer. Thank you for your energy. It’s keeping me alive. So lucky to have this lady on the road with me. And so lucky to hear this anthem every night. Yes b empower me let’s go. @Jessiereyez  https://t.co/RlJxxjQkC4 So happy we could help in anyway. We appreciate all that you do and you were missed tremendoussssly. Welcome back! Hopefully I make u proud with lots of good stuff to update ❤️😊 https://t.co/bmCTKzfIfT Welp. Sharp Objects is WOW! (A lot of disturbing themes so warning) so beautifully shot and so dynamic! New obsession. Amy Adams is a forever favorite. And Sophia Lillis as young Camille is so compelling! Stunning, talented women. you make me, como se dice, sick. @hiddleheirs It is kate winslet 💙 from eternal sunshine of the spotless mind! ❤️ for those asking. Clementine vibes tonight. https://t.co/kL4znf83JC Why do I forget to blink when I draw. Wow! The stage looks so cool here!!!!!!! https://t.co/XNTOnNNsZi Peace, calm and crickets. The sounds of reflecting on a porch in Virginia. This muggy heat reminds me of home, but the kindness is like a warm hug I really needed tonight. Thanks for the show, Vienna. You’re super stars. It’s riding thru. I just WISH it was riding u. Lol https://t.co/l7EKRCY90T London gurl with an attitude. Never told no one, but we looked so cute. Both got way better things to do, but I always think about her when I’m riding you. 🤷🏼‍♀️ So many cute cute fans. Thank you for making my day, every single day. There is no better moment in my life than the second I walk into a meet &amp; greet daily. How lucky am I to get to know you!!! How fortunate that you will share your secrets with me! Hometown. ♥️♣️♦️♠️ https://t.co/leTMb0UiLi @heavenstripped this is what I was talking about! https://t.co/J5E05estaL What do you guys think of Eastside?! And so it begins 🌿\nhttps://t.co/UXeAJofski https://t.co/UQK1GmVJR2 @tyszal @State_Champs We’re doing an after party it’s gonna be fun!!!!!!!!!!!!!!!! @tyszal @State_Champs Fuck bus call. I’ll call u an uber. Hahaha noooo I wish. I’m on my own tour. But warped is in the same city as me today. Maybe I’ll pop up one of the dates as a surprise with someone tho! Could be fun. https://t.co/UrK3aFmw00 @kryystaalp @State_Champs Ah I didn’t know they were on this date!!!!! Yes @themaine pls come too!!!!!! @mattielucky @State_Champs @yungblud I looooove him. Big fan. Playing in Jersey tonight! All my warped tour friends pls come hang after your sets! And by warped tour friends I mean @State_Champs @badgalmichy Truuuuu I mean YOU’RE about to be if you keep riding my dick like this. https://t.co/YgRkscjUsl @weakisses Of course @NOVABRASILIANA It’s not a concept it’s just a movie I really liked the week I did that interview. I could also visit the moon or relocate to a remote island. It was a hyperbole packed in a sentence full of other “I could”s that imply the possibilities are endless. Don’t worry :) the only baby I’m making is my next album!!!!! https://t.co/zFi7MSI6Zh WOW!!!! I LOVE THIS!!! RIGHT NOW I AM JOY! 🌿🌿🌿🌿 https://t.co/Lu8CT8AHc2 Saratoga Springs, NY! I’m here!!!! 🍃🌿🌱 @DonsLens https://t.co/AXVVQ75Iia Ehhhhhhhhh not quite. Hahaha https://t.co/0KHcJhhz52 WELL HERE’S EASTSIDE! This video holds so many personal pieces of me :) https://t.co/FuQGn11xha @ItsBennyBlanco @thegreatkhalid Let’s try that again :) EASTSIDE!!!! @ItsBennyBlanco @thegreatkhalid @edsheeran @me! https://t.co/SXEcO9GKZO RT @thegreatkhalid: eastside 💖🤘🏾🌊\n@ItsBennyBlanco @halsey \ncheck it outtt \nhttps://t.co/6TfHST6Rpc friendly neighborhood corpse bride 🦋💀💍 https://t.co/flBo6X86pI Providence 🦋 @DonsLens https://t.co/9sAe3pkCB7 LMAO SOMEONE BROKE MY NAIL https://t.co/zKH41ag46v This was SO cute. Thank you guys for this PRICELESS moment!!!! https://t.co/aBvaFOJ6zX @meetballsubs My throat 😫 lmao The set changes every night! I have so many songs I can’t possibly play every single one! https://t.co/JVVuYo7ZzG Sorry my boobs came out of my shirt tonight I’m gonna fix it 🙃 but also ur welcome I guess u got ur money’s worth lmao Never satisfied. @pinkmoteIhalsey Maybe I do and that’s how I know when y’all are TALKING SHIT @newamericanas  https://t.co/A5nsmS8B1m @LlTTLEBOYBLUE I see all of them. All. Of. Them. Sometimes I see ur tweets about following the tour and I wanna fuck wit y’all and say some silly shit like “don’t come” “stalking me again!” but I know someone outside the fandom will take it wrong so I’m just gonna sit in my corner and laugh to myself alone. RT @kimyoogyeom: My friend is teaching elementary schoolers about sex Ed and she typed their questions out andddd 😭😂 https://t.co/HVNPbk1R50 Idk we’ll see!!!! https://t.co/TrYHcJUveE 🙃🙃🙃 https://t.co/AXth1WWmA5 This makes 0 sense. How can the first thing be different than the thing before it if there was no thing before it because it was the first thing? My head hurts. https://t.co/ebHmOgepb6 New stage looks, new(old) songs, new setlist, new interludes and intros, new stage, new stories, new energy, new life. Oh and the encore changes every night. We are going✈️ HFK summer tour tomorrow, Ladies! Life these days. @DonsLens https://t.co/HrqW14OmP3 @SenatorTaco @CatinoJocelyn I didn’t cheat on anybody and G was my only serious relationship for years. Do y’all just make shit up and say “hmm that sounds good. That seems believable.”?????? 🤘🏽🤘🏽🤘🏽🤘🏽 https://t.co/k4Ytun2EdO It’s crazy how people who know absolutely nothing can be convinced they know absolutely everything. RT @ItsBennyBlanco: i’m fancy @halsey @thegreatkhalid https://t.co/msaRynutZL “I don’t know what the hell this song is talking about....do you? I been spending all day trying to figure that out.” KANYE WEST REMIX. HOW DID I FORGET ABOUT THIS payton just sent me this with no explaination and i’m- https://t.co/q7nyDmF1oZ @RansomMeachum I’ma be looking for you ;) RT @iHeartRadio: Gotta secret can you keep it??? 🤔🤔🤔 #iHeartAwards2018 https://t.co/7NLHTA4lk8 A mans!!!! https://t.co/RDhE96fTK3 RT @halseysupdating: iamhalsey IG story https://t.co/KOwMZ2rfkR I’m not with anybody. That photo is 2 years old. Everyone mind they damn business. https://t.co/3ZttyGcd3P RT @sadgirlsloan: hi montreal im opening for @halsey tonight maybe i’ll see you there 🤷🏻‍♀️💕 https://t.co/dI7NgZIfNo I’m not at the beach. I’m on tour. Alone. Slow news week I guess. @aureumangels @aureumroses No it’s not. New production &amp; setlist and costumes don’t hit till providence! What’s ur energy today? @deeplyoung hahaha non c'était embarrassant 😭😭😭 @deeplyoung j'ai parlé français pendant le concert à paris! 💕 @gabriellebabyg je t'aime aussi. ❤️❤️❤️❤️❤️ je te verrai prochainement 🇨🇦 montréal 🇨🇦 je suis tellement excitée pour ce soir!!!! ça fait trop longtemps. LETS GO!!!!! @djgeordiegray Holy shit. @cluIess Little babes! I’m so happy you are still friends!"}