{"tweets": "The planet is rad. - @tryguys\n \nJoin the #teamtrees movement: https://t.co/HWnMfdbnwq  🌲 https://t.co/g3ThdsH9aA @Red_the_IT_Guy it all counts! @norblorb love it! @donttrythis @smartereveryday This is such an important mesage. Thanks Adam! #teamtrees 🌲 @YesTheory @MrBeastYT @MarkRober This is HUGE! #teamtrees 🌲 @AmiYamato @MrBeastYT Can't wait to see your vid! #teamtrees 🌲 @Hevesh5 @MrBeastYT @MarkRober THIS IS AMAZING! #teamtrees This is how @PastaGrannies wins #WorldPastaDay every day: by traveling all over Italy shooting vids of iconic nonnas cooking with their most delicious secrets. https://t.co/ESDJf4M2OH https://t.co/D8KQqE8NPV @tryguys A surprise we love to see. 😍 #teamtrees @funforlouis @MrBeastYT #TeamTrees 🌲 @MrBeastYT 😍😍😍🌲🌲🌲 @moon_yeca @MrBeastYT Holy wow is riiiiight! 💪 @willie1121 @MrBeastYT 🙌🙌🙌 @OfficialJlipper #TeamTrees all the way! 🌲 Creators are joining together with a goal:\n\nto raise $20 million dollars\nto plant 20 million trees\nby 2020\n#teamtrees\n\nGet involved at https://t.co/HWnMfdbnwq 🌲 https://t.co/43i1BnDzVU @markiplier Anytime. ❤️ We miss #YouTubeBlack Creator Summit already. Thanks again to all of our wonderful creators for joining us (and @TherealTaraji and @Tip, too)! https://t.co/Rss9Fhcn2x RT @youtubemusic: .@QueenWillRock asked. You delivered. The Champions have arrived! Now you can watch new fan music videos for 3 #Queen cla… RT @youtubemusic: 📢 ATTN: Nashville! We’ll be taking over from #CashFest on Nov. 10th to celebrate the premiere of @YouTube’s ‘The Gift: Th… The #MindField Fear special is finally here! Watch now to find out how @tweetsauce determines \"What is the Scariest Thing?\" → https://t.co/7fVRrMYZpK https://t.co/94r4zspZsB It starts with a heist. How it ends is up to you. Watch A Heist with @Markiplier on October 30th. #AHWM \nhttps://t.co/Pm8JQjpJ2N https://t.co/MfPkBJ7ulj Skating through life like ✨ #YouTubeBlack https://t.co/zCSEmZVQ2g @dieserpan 😻😻😻 @jacksfilms https://t.co/kvD62xBlDi @mani_masteriza thank you @GeleiaPlays_ thank you @Spark_Is_Tired thank you @dylansinclair03 CORRECT!! @DJ_Dat_Dude15 ok that's fair @calebguitarist_ you can do anything you set your mind to. 🥺❤️🦋 Oh so you love YouTube? Name every video. Same tho. 🥺🥺 ICYMI: https://t.co/mFkjuM45du https://t.co/XILQbGA6Qm Get to know the man behind some of the biggest hits in How To Be: @MarkRonson. Stream the #RonsonDoc now: https://t.co/V7Cq16i5Wj https://t.co/8YkDsFxkIu The only way to kick off #YouTubeBlack Creator Summit — a family reunion! https://t.co/Zb7NH4QfDh @GlamandGore @a_bossy_bee ❤️❤️❤️ @aphanofdan @danielhowell @AmazingPhil Thankful for them both! @raphablueberry @LikeToBeFranzi brb crying. 🥺🥺🥺 @ArielleScarcell @millselle We love Elle! ❤️ Wish you were here 🔥 #YouTubeBlack https://t.co/19a5ZQdg9s What creator inspires you and why? 🌟 Classical 🎻meets contemporary 🎙️in a one of a kind collaboration.\nHave you seen Bey-Thoven: An Unofficial Mashup from @samueltsui  x #EnsembleConnect in partnership with @carnegiehall &amp; @googlearts yet? → https://t.co/sJpqo76EOY https://t.co/uhGI84XMCV #YouTubeBlack FanFest in 🔥lanta is underway! Live stream it here: https://t.co/R35BUB731r https://t.co/ojFzXGFLKU #YouTubeBlack creators are arriving for FanFest! You don't need to be in Atlanta to join the live stream at 8:00 PM ET: https://t.co/R35BUB731r ⏰ https://t.co/gKZ10QX0k3 @quenblackwell pls!! @MisterPreda @JoeyGraceffa 🐾❤️ Do you think YOU could survive Back to the Future? To find out, catch @jakerawr, @thephysicsgirl, and @bealsscience in the first episode of Could You Survive The Movies?: https://t.co/TzD6SQNTJZ #CYSTM https://t.co/ViEXyuvAUt Still thinking about how sweet this video is. 🥺 https://t.co/4fl61UotCl https://t.co/19hWLenxJl @MsRebeccaBlack We'd watch that! 🎶☀🎶 P.S. It's Friday! @kkyb_xlv decent revision actually. will consider working in pops to future tweets. @mineman_marin *flips hair* @anujan253 hi @Progressives92 gross, but also YES @AMGGLS63 🌈 the more you know 🌈 @zxvc2 rest and relax! @Pinsky https://t.co/IX3LsvsZno @1_shot_0_kills @LeonLush yesssss! @UmairRaza666 It's the worst... but also the best. let's give chiropractic YouTube the recognition it deserves. could listen to those skeletal cracks for HOURS 🔴 LIVE 🔴 It's time to make history with @NASA again! Tune in to watch the first all women space walk. 🌑 https://t.co/PjyeZPomxr Bringing his passion for science to investigate human behavior, @tweetsauce returns in a #MindField Special to find the scariest thing possible. Coming to you on 10/24. Check out the trailer here: https://t.co/AmZq0AFpEA https://t.co/GhiSk0axpN Attention all book lovers! Check out the newest episode of #BookTube featuring NYT best-selling author @MalcolmGladwell and #booktubers discussing his latest work, Talking to Strangers → https://t.co/l068EEiiAL https://t.co/lEbQ3srZUp How are we celebrating Filipino American History Month? Learning to cook durian and fried bananas with @ChesterSee and his mama! https://t.co/0gE531dS4I https://t.co/oT89fJMBkA Teleporting us back to Reston with Season 2 of #ImpulseSeries. Catch Episode 1 streaming now! → https://t.co/EnR2qLkl8N https://t.co/j8Yc9vlcVA #PronounsDay is important for all of us - as the young LGBTQ+ people @ThinkingFilm interviewed for this video put it, \"You don't have to be trans to respect pronouns.\"\n\nWatch them explain why respecting pronouns is important: https://t.co/peZsHoriIS https://t.co/sSiBy3JH3q @KDTrey5 @nikebasketball Ready for these ones. 💪 @mygetawaycal @tyleroakley we'd love to see it. @danielhowell Cheers to 10 more years of internet 🥂 Congrats to all the creators nominated in the @streamys! Let's get these awards. 💪 https://t.co/UQhc1H7Z8I @Alexiious1 🌈 Time zones 🌈 @Mattymanu9 6.2/10 - We can't tell what the pattern is, but appreciate the color. @edwardxgays 🥺🥺🥺 @Robloxian25 go off @edwardxgays Love this song! @onlytriplet Okay, do what you need to do. 😴 Rise and shine! 🎶 RT @YTCreators: Your favorite creators are coming to Atlanta for #YouTubeBlack FanFest on October 21! See the full lineup, get tickets and… @dannygonzalez @kurtisconner @drewisgooden Ya'll did THAT! Cinema meets science as @VSauceThree (aka @jakerawr) explains the science behind iconic movie scenes in the newest #YouTubeOriginal series, Could You Survive The Movies? Check out the trailer here: https://t.co/roT8yUgGQi #CYSTM https://t.co/bIFmesalJW @ColtonLHaynes We're ready! Watch @TamangPhan turn herself into the Mistress of Evil and see yourself as Maleficent with our new augmented reality technology! → https://t.co/zfMJF9MV3X\n#Maleficent https://t.co/XgtLzupEw0 #Inktober2019 is all about challenging yourself to create new things, even if it doesn't turn out. 🌟 Who's participating alongside @drawwiffwaffles this year? 🖌 https://t.co/pT3F8oZIRB https://t.co/nRaqzIQJg3 Sundays are for following delicious ASMR-style sweet treat recipes. 😋Sound on: https://t.co/K6GgFqFD3H https://t.co/HIFNgZitsw Just say yes and figure it out later... 😂 Words from the wise Will Smith in @GavinFree's latest video. → https://t.co/pfguVTHP9G https://t.co/faNDX1pn8w @rkyncl @ElJuanpaZurita @ElJuanpaZurita, come stop by again anytime! @SayItLoudPBS The '100k subs' dance looks good on you! It's #InternationalDayOfTheGirl and @MalalaFund is celebrating the women of YouTube who inspire and teach us every day. Check out the #WatchHerShine playlist: https://t.co/wmmwi2VmfC https://t.co/wlwCavJcAs @MarcelasHoward SWISH!! 🏀 Literature lovers rejoice! #BookTube, an all new #YouTubeOriginal series launching 10/17, is the dream monthly book club meeting that everyone is invited to join. Check out the full trailer here: https://t.co/YbUa3OlpdR https://t.co/mwAZOZydcG Today, on #WorldMentalHealthDay, we've put together a playlist of resources to learn more about anxiety, depression, and fighting mental health stigma: https://t.co/QwgAiNZJ1a https://t.co/q2qWJVixcA @Jenna_Marbles Sweet dreams, @Jenna_Marbles ✨ Congrats on hitting 20 MILLION subs! @ThatWasEpic11 Love seeing you pay it forward, @ThatWasEpic11 We knew you from your Awkward days, and love seeing you back at Google, @IssaRae! #TalkLikeIssa https://t.co/rLUtkI9D2n Take a trip to Indonesia with K-pop acts #TVXQ! and #SUPERJUNIOR! Watch Episode 1 of #AnalogTrip→ https://t.co/9OC3x0vP3C #YouTubeOriginal https://t.co/ZKt2JcpyQB @GamingWithNuke A classic! @WhosNastyFox That's pretty much all there is to say! @Big_Fronc Throwbackkkk! @ZeeRee__ @ItsMyRayeRaye A day one fan. 👏 Nothing else like a family moment. 🙌 Check out our Hispanic Heritage Month dinner celebrating amazing creators. #YouTubeLatino https://t.co/R6nXRSPmzL We’re proud of the Dolan twins. And all creators putting their well-being first. https://t.co/OjRN28WS8D @devanshu895 https://t.co/gSqFwkqk44 What was the first YouTube video you ever watched? 🤔 Why do we cry? 😭\n\nWill we ever survive on Mars? 🤔\n\n @Voxdotcom's Glad You Asked is a YouTube Original driven by discovery for the answers to all your burning questions.\n\nWatch Episode 1 now → https://t.co/flp18nGjTU\n#GladYouAskedYT https://t.co/GgP0YOK3uR Watch @reginacarrot's #HispanicHeritageMonth edition #YouTubeSocialimpact playlist about following your dreams, loving yourself, and being proud of who you are. → https://t.co/TtziB5Au4H https://t.co/cV02wx8hfn Just a little coconut crunch to get to you through your Monday courtesy of @mayapolarbear. → https://t.co/7InJjkqTrA https://t.co/vKFL8OWYR8 Lipstick, but make it huge. Watch @safiyajn make what might be the world's largest lipstick! → https://t.co/ohopT6Thei https://t.co/vcv2bjU8Pc .@ahsanteb creates videos that help you move consciously and creatively through life. Watch her #YouTubeSocialimpact playlist → https://t.co/wnOMbAK9ue https://t.co/Zv3BHxvlBT For #HispanicHeritageMonth, @ARamosofficial shares the artists who have inspired him along the way→ https://t.co/0fYsBEklow https://t.co/tzFcHrJie1 Brb vlogging with RM @BTS_twt https://t.co/It13TZMFPq RT @YouTubeTV: Ten years later the @WWE #SmackDown brand is STRONG. 💪\n\nDon't miss the beginning of a new era tonight when @WWEonFOX premier… @DougYeager4 https://t.co/OuPahip4h2 Serving you the videos you deserve. https://t.co/fZlrsFeQAz #NationalTacoDay mood. 🌮 @rhettandlink https://t.co/8rLzWW7Y12 @ZeeRee__ https://t.co/tifUFA6JjT @ZeeRee__ Come through promo! 🤣 Love your channel. Make fetch happen. Get your Mean Girls on: https://t.co/RvfLxeqWvV https://t.co/Szj98WhQPa It's October 3 and the house isn't gonna spook itself. Get to budget DIYing with helpful tips from ChicOnTheCheap. → https://t.co/z3sxRTLb2Z https://t.co/g08TW9CaX3 @EllyseAnn @juliensolomita 🗣🗣🗣🗣 @YaBoiADash @juliensolomita would love to watch a Kermit cooking show. @juliensolomita Anytime. 😉 Love your channel! Why buy your fave snacks when you can make your own? Watch @JulienSolomita make his own cool ranch chips. →  https://t.co/CoWp4hGmud https://t.co/rkeoQIQ9IC The Gift: The Journey of Johnny Cash explores the artistic victories, the struggles with addiction, and the spiritual pursuits that colored @JohnnyCash's life. Watch the full trailer here: https://t.co/V1QvwXrbl5 #JourneyofJohnnyCash https://t.co/uuP0qCC6Qd Giving your visit 100/10 https://t.co/XiLzLsYkXe @jamiebyrne330 was waiting for this one. @Sayo_Nara_88 omg who is heeee @dmoura_22 Feeling this @CameraLizard Spooky spook! @chAiNNEdynasty_ will do 🤪 🎃🎃🎃🎃🎃 Discover more #YouTubeBlack creators here → https://t.co/xnJeP5QKwx and let us know which creators we should be adding to our watch list by tagging them below 👇 Fitness vlogger @gabriel_sey_  is active in the gym, active with his family, as a dad and as a husband. We can't get enough of his family vlogs https://t.co/ab1XzH66O1 We love @sarahdestinyx philosophy that you should never base your standards of beauty on anyone else's but yours. The perfect channel when you need to be uplifted https://t.co/Io5BvNAYRP The Unknown Vlogs @icykofi documents youth culture and fashion, giving us amazing insight into what's trending around the world https://t.co/HNFUMYDxZy London-based @NeffyFroFro is all about kinks, curls and a sprinkle of Black Girl Magic. Her videos inspire women everywhere to love their natural beauty https://t.co/yEPdVlQ5JU We’re kicking off #BlackHistoryMonth in the UK by uncovering some amazingly talented #YouTubeBlack British creators: a thread 👇 People on social media have lots of questions for @WWERomanReigns. Watch @GQMagazine take him undercover... internet style! → https://t.co/gsiD4D3NIQ https://t.co/TCLNw6Dnnp @etfnespinosa @FriendZonePod @ThisIsTheRead 💪💪💪 @AbedAlHamid2 @WVFRM We love it. 😎 @offthepill @TheRealRyanHiga Confidence is key. ;) @YaBoiADash A classic! Time to share what you've been diving into! Drop your fave podcasts you've been listening to on YouTube below. 👇 #InternationalPodcastDay Happy #NationalCoffeeDay! Thanks to knowledgeable creators like @jimseven, you don’t need to be a barista to learn how to make great coffee. Why not spend today exploring the YouTube coffee community and learning a new skill? → https://t.co/ztRIYTw3B0 https://t.co/OwkYLfwYum Suraj Fine Arts videos are as soothing to watch as they are to recreate. Watch his latest tutorial now. → https://t.co/G6YW4WHaTz https://t.co/vdOsOwZamY @lifeofrickey Iconic. 🤩 Watch @chloekim learn some new moves from the choreo boss himself @MattSteffanina. →  https://t.co/ORgDuIVbAB https://t.co/nrbQMK27zU RT @YouTubeGaming: [LIVE] 🔴 Watch @Jack_Septic_Eye's charity livestream now with Emilia Clarke -- Mother of Dragons, Breaker of Chains, fou… @VidCon Shoes 👠 Storybooth is a digital platform that animates real stories submitted by real kids all over the world, and their mission is to empower young people through storytelling.\n\nCheck out this #YouTubeSocialimpact playlist supporting the power of acceptance. → https://t.co/LZxjqsH73H https://t.co/rw1n54qdS5 @JLo An icon! 😍 #LizaOnDemand Season 2 premiere drops today! Make sure to watch right at 2PM PT so you can chat live with @LizaKoshy @Travisties &amp; @KimikoGlenn → https://t.co/ka9Avck2Af https://t.co/1gLpXplRrk Travel to Indonesia with K-pop acts #TVXQ! and #SUPERJUNIOR in #AnalogTrip, a YouTube Original premiering on 10/9. Catch the full trailer here: https://t.co/9qheKm7tjO https://t.co/OVcw3kWaFC RT @YTCreators: You had questions, and @JessicaOOTC has answers. Has she always dressed in vintage? Has she always wanted to be a creator?… RT @YouTubeGaming: Ah, the sweet taste of nostalgia.\n\n@sugarhighscore's latest recipe is a cake inspired by Link's Awakening → https://t.co… School's back in session and @HelloMelissaM has all the study tips you need for those hard to pass classes. Let's get to work. 📚→ https://t.co/6Gc5HYVugS https://t.co/0Lns5VAz34 @LouisVuitton We're tuned in. 🙋‍♀️ Grab your scrunchies and get ready to take things to the next level. watch @MARKOTERZO_ 's video. → https://t.co/Nwuvb469B0 https://t.co/ZUhIz09tJn RT @SusanWojcicki: UPDATE 2: Like in the past, channels that reach 100k subs will be eligible to apply for verification. To better clarify… RT @SusanWojcicki: UPDATE 1: We heard loud &amp; clear how much the badge means to you. Channels that currently have verification will now keep… RT @SusanWojcicki: To our creators &amp; users–I’m sorry for the frustration &amp; hurt that we caused with our new approach to verification. While… This is not a drill. @GretaThunberg's #naturenow video shows how nature is one of the tools we can use to repair our natural climate 🌎💚🌿 → https://t.co/4PfFleRfr8 https://t.co/sjaAbdmuDj @Caspar_Lee @RTS_media Dream collab ✨ PSA: Use headphones https://t.co/PoEzr3Rwf0 @shaymitch Let's do this. 🙌 RT @shaymitch: T-MINUS one hour until Episode 4 premiere with my.....um....baby shower. I'll be live chatting with you on @YouTube during t… @StevieWLevine Rhett and Link are the best way to go to get the other news and stuff like that...\n\nWell that’s not entirely wrong? 😂 ASMR. https://t.co/rb4qiq2VCU Elde Art shows you how to give any drawing that digital effect. 🎨 → https://t.co/olzHy1PBhb https://t.co/mVvDWlpNol Summer night slow down courtesy of ASMR rooms. 😴 She combines 3D animations and calming sounds to create hour-long works of art. Who's watching?! 🙋‍♀️→ https://t.co/b8ErwDW0UU https://t.co/h8l9YUQDB8 @lillyismylife_ @latewithlilly @Lilly #TeamSuper always! 💜 Tonight we’ll be watching the premiere of @latewithlilly live on YouTube, when the one and only Lilly Singh as she embarks on the latest step on her journey.\n \n@Lilly, we’re so proud of the superwoman you are and always will be.\n \nWATCH: https://t.co/JwbX9djDmr https://t.co/YPELtY2NMn @MichellePhan welcome back! 😍 Claire Wineland used her YouTube channel to chronicle her struggles with Cystic Fibrosis before her death at age 21. \n\nWe're proud to present the documentary Claire as a YouTube Original, to continue Claire's legacy: https://t.co/p0TVVPsvXd https://t.co/Ru4aarBjD5 RT @Lilly: Tomorrow the entire premiere episode of @latewithlilly will stream on YouTube EARLIER than the premiere on TV b/c I love Team Su… German #CreatorOnTheRise Näh Café has everything you need and then some when it comes to DIY tips on making your own clothes. Check out her channel and get to sewing. ✂️ → https://t.co/bAoXbrJtMq https://t.co/7hLg3DZnTV A @brittany_broski kombucha review? Love to see it. → https://t.co/3zHWRThRqH https://t.co/0DOofSZFjK RT @MichelleObama: Adjusting to life on campus can be overwhelming—that's why I'm thrilled to team up with @nowthisnews and @youtube on a p… @toryburch Can't wait for the show! cultural impact:\n\n         █          　　\n         █　        \n         █　        \n         █　                           ＿\nEvolution of Dance       Darwin's Theory \n                                          of Evolution @pewdiepie Now it’s really custom! Jk, that's embarrassing... we're on it. Be in touch! .@ijustine giving us the full range with the 360 video how to. → https://t.co/szoJDYU009 https://t.co/luaVzfQ2gJ @antoniiogarza21 us when you upload @Brittany_broski *smashes subscribe button* Last night's #YouTubeFashion launch party was 🔥 Watch our stories for the full recap → https://t.co/BlzORzcyAS https://t.co/UDbaEEpyqU For #NationalSuicidePreventionWeek, \n@KatiMorton's shared this important video to learn more about how to help a friend in need, and to support \n@CrisisTextLine: https://t.co/IUTV11uuor .@makeupbycamila is giving us the full run down on tonight's #YouTubeFashion launch party on our Instagram Stories. Follow along at https://t.co/BlzORyUXJk 💃 https://t.co/bDeLkg3f64 Mexico City street food tour done the @Mikexingchen way. Who would take one of everything?! 🙋‍♀️→ https://t.co/ztjKUOO1cd https://t.co/ecgW52a1Rc Just in time for Fashion Week. Watch @jasmeannnn recreate the iconic @rihanna look. 💖💚→ https://t.co/YFxHWZnqUt https://t.co/0UOzzy7d3t From the UK, this #COTR documents his life traveling in his van alongside his pup, Sherpa. Follow their adventure. → https://t.co/aRyUXgwmiE https://t.co/HUT0FLCdOr @TSeries @pewdiepie ...oh and that fancy crystal work? That's from our friends @Baccarat. TAKE A LOOK: a behind the scenes look at the making of the Red Diamond Creator Award! The 100M subscriber record has been surpassed, and that means we have the new creator award! Introducing: The Red Diamond Creator Award, named after one of the rarest colors of diamond. 💎❤️ @TSeries and @Pewdiepie, check the mail! 😏 https://t.co/ZONYFEiVkk .@NikkieTutorials taking waterproof to the next level. See how these products stand up. → https://t.co/WdiAQIvjK8 https://t.co/0GJ2qRi1H6 @GabeRoberths @MisterPreda Riiiiiight!? 🙌 @colleenmerrells Always serving a look! @lovebugkels 👏👏👏 @AmberScholl But wouldn't we all? If you could shop any creator's closet, whose would it be? 👀👀👀#YouTubeFashion @aaronsky4 🛹🛹🛹 @tiggatiggatight Learning alllllllll the things. @youtubemusic @rihanna never not stanning. Biggest fashion inspiration told using GIFs. Go!👇#YouTubeFashion 💄Introducing https://t.co/AIGyJv5SsH 💄\n\nYour one stop for all things fashion and beauty. Find inspiration. Follow the latest trends. Walk the runway. 💃#YouTubeFashion https://t.co/5D0a7MIXRB Ironed a shirt, played a banjo, learned Japanese. What else you got? https://t.co/3SgoMbrStq 9.5.2019 💃 https://t.co/9Tm0tjszjE More about why we’re making these changes here: https://t.co/yPHApGxF6l We know a lot of parents and kids watch YouTube together, but for kids watching alone, we recommend using the YouTube Kids app. It’s been available since 2015, and we’re continuing to invest in it with more parental controls and a higher bar for qualifying channels. 4. Creators will have to identify content made for kids, and we’ll additionally find videos in this category using machine learning. 3. Features like comments and notifications will no longer be available on videos made for kids. 2. Personalized ads will stop running on content made for kids. 1. We will treat data from anyone watching children’s content on https://t.co/alxrZsi5Vw as coming from a child, regardless of the age of the user. This means we will only collect the data needed to support the operation of the service. Today we’re sharing several changes designed to better protect data on children’s content on YouTube. Starting in about four months: \"I can't even make a DiGornio pizza.\" — @DavidDobrik. \n\nLet's see how well David keeps up with @bonappetit 😅https://t.co/hdB0a7QWKD https://t.co/IG7fKONKB9 Tips for easy living, clean eating and home organization courtesy of #CreatorOnTheRise Kyra Ann. → https://t.co/Q2OOCAHoTg https://t.co/P9QWCzAF8x For all of those with Euphoria shaped holes in your heart on Sundays. 💔 Watch @daisymarquez_ tutorial. → https://t.co/tSdGsAoeKh https://t.co/Otr1jrFiNd But can we get this collab? https://t.co/dnrrWRYxXx @kevleeb @MrBeastYT never heard of it. How many of you could have solved this one?! 🤔Watch @chrisramsay52 solve this puzzle. → https://t.co/rzyqLgbQcc https://t.co/Jqwp6DfFrf Last but not least, @BBCEarth is partnering with science and tech creators like @Colin_Furze to put the most out of the box ideas in science and tech to the test in #EdgeOfScienceYT #YouTubeOriginals https://t.co/7A1VRlpolO @TheSchoolOfLife works with all-star creators to answer some of the world's biggest philosophical questions.  Special guests include @TweetSauce @LadyLeshurr\n@imartinezp_ @emartineeez @omgAdamSaleh @Luzugames @HannahStocking https://t.co/pe1eZmDLwO Prepare to be blown away when Seasons 1-3 of #Mindfield with @TweetSauce come to you free on 10/1 #YouTubeOriginals https://t.co/MYdKsfc3je @ImpulseSeries is coming back for Season 2 on 10/16 , but you can catch up on Season 1 right now #YouTubeOriginals https://t.co/RCNlpf4Yte https://t.co/J2NONbHBpi @CobraKaiSeries is crane kickin' its way back into our hearts. Watch Season 1 now and check for S2 for free now https://t.co/93KA5kgIku #CobraKai #YouTubeOriginals https://t.co/tcWYqRn3KL @LizaKoshy is coming back at you with #LizaOnDemand. Season 1 is out now and Season 2 is coming 9/25 https://t.co/kgMMBbRckY #YouTubeOriginals https://t.co/RqGyD27bNU That's right! #YouTubeOriginals are about to be free 99. Check out some of your faves right now or hit that subscribe button so you can be the first to watch. #Thread https://t.co/HpJbhoa7Gv @oliverpbeagle Too adorable not to! 🐶 RT @youtubemusic: 🙏🏽Thank you @waze 🙏🏽Took the 405 to the 10 and got off at Cahuenga, without switching apps or missing a beat! \n\nNow #YouT… 4 minutes of @oliverpbeagle making cute noises, because why not? → https://t.co/jKpEbfRu7H https://t.co/katws7k1nb Another year older, but @lizakoshy and friends definitely haven’t gotten any wiser.  Catch the full trailer for #LizaOnDemand Season 2 → https://t.co/BajhdTetKo https://t.co/dS18rVzHhO RT @YTCreators: Balancing an open platform while protecting our community isn’t always easy, but it’s worth it. As @SusanWojcicki points ou… Meet @hallease, #YouTubesocialimpact creator who tells her story of \"chaotic good\" through vlogs, short films and more → https://t.co/KAW3mlk34A https://t.co/3TdXxrDYT3 :’-) https://t.co/rmHgwGc2Mf We know Rachel Ama always comes with the 🔥 recipes. Watch her talk about how she turned his passion for food into a career. → https://t.co/Xl1ODde0n3 https://t.co/TorM9biRVt Married to @marziapie 💍\nRevived our love of Minecraft ⛏️\nReached 100 million subscribers on YouTube ✔️\nWhat a month to celebrate and congratulate @PewDiePie 👊 https://t.co/4rGuNDDwyx .@mattdavella is here to give us all tips to becoming a productivity master. Get ready to take some notes. 💡→ https://t.co/vqz76OvYDM https://t.co/H5x5NAEpcv #CreatorOnTheRise Ben Marriott is a motion graphics wizard! Looking to learn? Head over to watch his tutorials. → https://t.co/ptkq6iFozj https://t.co/9kILWSHJK6 RT @youtubemusic: 🔴 [LIVE]: It’s almost #Lover time!! Tune in to @taylorswift13’s #LoversLounge for a special performance, Q&amp;A and more → h… Truth or dare, @tryguys edition. → https://t.co/VU6prLiq3R https://t.co/Bi67FiJhuc @MKBHD You never know when we'll resurface the greatest hits 😉 The more you know. 💡 Watch @MKBHD dive into the newest advancements in mobile tech. → https://t.co/VHX8QyTWqt https://t.co/gLZYXFrBq2 @Casey The dog definitely made some points! 🐶 You're going to want to have your sound on for this stop motion masterpiece. 🔈→ https://t.co/BINev7ZPH5 https://t.co/cvnrVEMTx6 .@RealDoctorMike walks us through his diet and daily life in his new video. Watch his new video and follow along with his life in NY. ☀️→ https://t.co/QNjDBs86Vr https://t.co/pDHRUolpPN Setting our alarm for December 13th. 🚨Cant wait for the 2019 #Streamys! https://t.co/9asQniSGCm It's #InternationalOrangutanDay! Celebrate these beautiful creatures with this new series from the @Smithsonian Channel: Orangutan Jungle School 101 🐒 → https://t.co/PUS9qwt2VA https://t.co/ehEln65Vio Technomad's got all your video and photo tips. Head over to his channel and tap into your creativity. 💡 #CreatorOnTheRise → https://t.co/PtaMjiFmNG https://t.co/S2gsqPbiTt Don't try this at home... Unless you're @antoniiogarza21 then do whatever you want. → https://t.co/3DpyzH2Bc2 https://t.co/WZvmjKYk4W Would you let someone order for you for a FULL WEEK?! Watch different YouTube creators tell @brookandbailey what drive thru orders to get → https://t.co/NYbvudQ4qc https://t.co/D3xztsaGAS RT @youtubemusic: ☀Tune in to #SummerSonic this weekend 🙌\n👀Watch @ygofficialblink @the1975 @ChiliPeppers and many more on the official @sum… *gone fishing* @DudePerfect battles it out in his bass fishing video. Who do you think will win the challenge?! 🐟 → https://t.co/4wTMF0OzUy https://t.co/tGlziMcC3G A new semester is right around the corner! In this @TomFrankly curated playlist, you'll find videos to help get organized, stay motivated, and mentally prepare yourself to make this school year your best one yet 📚→ https://t.co/XthoTYVZjx https://t.co/pjgENedehi This #InternationalYouthDay is all about \"Transforming Education.\" Watch these young people fighting hard to raise awareness for the causes they believe in → https://t.co/rPIsb3N8gR https://t.co/7pNSiaH18P \"I'm your bleached nightmare!\" @tweet_joana visited @bradmondonyc IRL after his reaction to her new hair transformation. Watch Brad give Joana the hair makeover she deserves → https://t.co/JDzA5A5pJy https://t.co/5UYcApJxX8 The '90s makeover of your YouTube dreams! @Jenna_Marbles gives herself a Claire's makeover to keep up with '90s trends → https://t.co/4ypJYStggp https://t.co/DpzW5YnyPc Soccer or Football. The beautiful game. Whatever you call it, whoever you support, we’re celebrating the @PremierLeague kick-off today with the launch of their brand new official YouTube channel here → https://t.co/Ac5EoZYtxK ⚽️ https://t.co/oqzudUx8Mh RT @YouTubeTV: 10 years ago today, @ABCSharkTank came into our lives.🤑\n\nSo we are celebrating the iconic sharks that make us shout \"TAKE TH… RT @youtubemusic: 📢 ATTN: Students 📢\n \nFor a limited time, new members can enjoy 3 months of the #YouTubeMusic Premium or @YouTube Premium… Do these YouTube creators have what it takes to become an @americasnavy sailor? Find out if @DALLMYD, @CrabsAndScience, and @VsauceTwo are up for the challenge → https://t.co/laKpSps3aW https://t.co/YpW2zvULyQ The \"Papa Don't Preach\" music video was iconic hair inspo for @tweet_joana. Watch her take the plunge and transform here 💇‍♀️ → https://t.co/oEVFpVZAS6 https://t.co/8kjorxBD4o @IvyKungu We can't believe it either! Congrats @NikkieTutorials 🎉 RT @IvyKungu: Omg..... her last name isn’t gonna be Tutorials anymore 😳 https://t.co/gO5J8lc4K8 In 2013 Toni Morrison told us, \"The whole world is such a lovely place, I cannot begin to tell you how fascinating, and how overwhelming and lovely it is to be here. I can't tell you. I'd hate to leave.\" We hate to see you go Toni Morrison → https://t.co/mx0Lqiv3lA https://t.co/dhyIcoF4vm College can be stressful, scary, and overwhelming for students! Prepare for back to school season with #YouTubeLearning and watch videos from @MichelleObama, @ReachHigher, @TheCrashCourse and more 📚 → https://t.co/Bbc0ZmGz6i https://t.co/vWlpmYmQo2 Make squid ink pasta like a pro! @bingingwbabish walks you through this delectable dish and even includes some internet cooking pro tips for you to use → https://t.co/onUmeyxIWY https://t.co/zde1GcK3i2 @DalasReview ¡Wow! 😍 🐩 😂 RT @YTCreators: To mark his 10th anniversary on YouTube, @AlfieDeyes sat down with YouTube's CEO @SusanWojcicki to talk about freedom of ex… Surf's up! Enjoy the US Open of Surfing this week with the soothing sounds of this ASMR surf video 🏄 → https://t.co/fsZIRngMdu https://t.co/cT65bAm9RZ RT @youtubemusic: 🔴 [LIVE]: @Lollapalooza Day 2️⃣ is here! Our #Lolla live stream with @tameimpala, @nfrealmusic, @halfaliveco, @conangray,… It's the summer of SPACE! Watch this cosmic playlist celebrating all things space from your favorite PBS creators 💫☄️→ https://t.co/wizniexaHB https://t.co/a0noHAWBmx Grant Thompson had an immeasurable impact on the creator community, inspiring budding scientists and instilling a love of learning in his fans even after stepping back from hosting. Watch this tribute to the original King of Random → https://t.co/IFeNNosGyb https://t.co/4Zom0XQbba RT @youtubemusic: We’re partnering with @QueenWillRock to create three new videos, and this time #YouAreTheChampions. Head to https://t.co/… @jacksfilms #YIAYtube Already working on Rewind. Laughter is the best medicine! @RealDoctorMike breaks down popular internet memes for a good laugh 👨‍⚕️🤣→ https://t.co/Bfm579pYqA https://t.co/QV85VUv578 We're deeply saddened to learn of the tragic loss of Grant Thompson, a gifted, passionate and endlessly curious creator. We send our deepest condolences to his loving family, The King of Random team and fans. https://t.co/pUY4q1EWcU https://t.co/oL3VVSXacf Curious to see what happens when you bring a bucket of blood to shark infested waters 20 miles away from land? @MarkRober tested whether or not sharks really can smell a drop of blood. Tune in for #SharkWeek all week long with @YouTubeTV!  🦈→ https://t.co/45vBxTvywB https://t.co/pjq5lTDGLc These two beauty queens have teamed up! @NikkieTutorials is joined by @iambeckyg for a very special \"Salvaje\" makeup session 💄→ https://t.co/mH0PQN56d8 https://t.co/rCjlu81d2j Need brunch inspo? 3 chefs try to make pancakes their own way. Whose 🥞 are your favorite? → https://t.co/OPpnSxTQ59 https://t.co/yaloGEkIn5 National Dance Day is here! Move your body to the rhythm with this playlist featuring Misty Copeland, Dytto, and Michelle Khare → https://t.co/LpaKJrtH7P https://t.co/GyTxeXo8N2 Surprise! The @tryguys transformed Zach and Maggie's home office from a makeshift storage room into a place where they can both work productively → https://t.co/qRTlI6wsj7 https://t.co/rSJJcTYsa6 👀👀👀 https://t.co/QiMMmoZixn @TheSorryGirls 👏 here for this! RT @TheSorryGirls: We're in this video!! Go give it a watch! https://t.co/MgISRWCNFM RT @YTCreators: “I found my community who embraced who I was.” -@NickEh30 \n\nWe sat with 25 creators during the #VidCon 10th anniversary to… @teertho_hridoy 🙌🙌🙌 We sat down with 25 creators on the 10th anniversary of #VidCon to talk about their origin stories and what they’ve learned in 10 years. Watch the confessions now → https://t.co/lfdTFG78Ly https://t.co/RjXMcoeMaO Introducing Learning Playlists - a more structured way to learn on YouTube! \n\n🔤Playlists organized from basic to more advanced \n\n🎯Video recommendations hidden from the watch page (to keep you focused!) \n\n🎓Starting with trusted partners\n#YouTubeLearning Ever wanted to install an elevator into your home? @ZacksJerryRig takes this massive home improvement challenge on! 🙌 → https://t.co/MCgMp0b4ie https://t.co/XjLNkmu3qY Watch videos from @reimagineATL, the organization that is empowering the next generation of storytellers! This playlist showcases the original work from the student creators themselves → https://t.co/3fyWLIOYGj https://t.co/Fyawa3OIxT RT @youtubemusic: A historic milestone for @QueenWillRock 🙌 Congratulations on 1 billion views for Bohemian Rhapsody! Watch the iconic vide… @DangeRussWilson @dkm14 @KingJames We are here for this training! From ancient temples to deadly gardens to underground towns: Planet Earth is truly amazing. Take a trip around the world and watch videos from @greatbigstory's trip around the 🌍 → https://t.co/7QNhKJYZJY https://t.co/VlpYQblQUQ A little Sunday dinner inspo from #CreatorOnTheRise @littlechefasia. Watch their channel for amazing recipes with an ASMR twist 🔊→ https://t.co/Ywb6QUy9AN https://t.co/Dvhg5e97Fh Brb...teleporting to the nearest screen to watch the #impulseseries teaser https://t.co/tTw59dbX4E https://t.co/Ef9ePXDMYI Watch @AwesomenessTV's new series with @lifeaseva! Eva shares the heartbreaking, and sometimes hilarious, ways to get over a break-up. Join the live chat now until 12:30pm PT →  https://t.co/deHKtvWuvA https://t.co/SFPWzNeD71 In 1969 people gathered around their black-and-white TVs to watch the Apollo Moon landing. Had to miss it because you weren't born yet? Watch @NASA’s 50th Anniversary livestream of the Moon Landing now → https://t.co/orNgcZIRp0 https://t.co/CvLUuDT2aQ @Casey Welcome to the West Coast! Enjoy the board. 🏄‍♂️ Talk about van goals! Jennelle Eliana has lived in her self-converted 1995 GMC Vandura Explorer Limited for about 2 years. Watch her give a tour in this video → https://t.co/7BeppbXuff https://t.co/MBs1rVgvDy Where is the lie? https://t.co/bogNiB6SVY Nelson Mandela was jailed fighting for equality in South Africa, and became the country's first democratically-elected president. On the anniversary of his 101st birthday, learn more about his quest in search of peace and reconciliation → https://t.co/bMS0OOKx66 https://t.co/Lz1fCXHnOs Take me out to the ballgame! ⚾️ https://t.co/huqedodKWe In honor of the 50th anniversary of the Apollo 11 moon landing, watch videos showing images from the moon and learn some science history 🌙 → https://t.co/r6ESap2xug https://t.co/OZIuilqi1T @julioprofenet ¡Seguimos adelante Profe! Apreciamos mucho tu trabajo. 👨‍🏫 Let’s play ball ⚾️ On deck tomorrow - Dodgers @ Phillies LIVE at 9:30am PT/12:30pm ET. Set a YouTube reminder now to get notified when the game starts → https://t.co/idnQutLe3j https://t.co/VemdL97fM7 RT @levibernhardt: i’m about to do a You&amp;A takeover on the @YouTube instagram story!! come participate or make fun of me or just watch from… @BigLadDogg yes. @3n3j0ta Live footage of them moving out. [Not Clickbait] I’m Moving Out of The Retirement Home https://t.co/2CB9seaZyM Starting this week, you can watch live @MLB games for FREE on YouTube! Subscribe now at https://t.co/wq0CPWBQRb to catch all the action and set your reminders for upcoming games. https://t.co/0K9iOmzc4U Watch your favorite creators from across Europe, Middle East and Africa decide what their fellow creators vlog about at #creatorsummit Paris Edition  → https://t.co/jj1wNXdRrl https://t.co/0XiGxFHMYJ Can you really fix anything with ramen noodles and super glue? @thekingofrandom finds out! → https://t.co/6t40i28LeR https://t.co/wd5m0pkB1k RT @milesjai: monochrome looks for vidcon💛💖💜 https://t.co/j7xhfIxxtq @emmachamberlain 👋👋👋 hi @emmachamberlain RT @YTCreators: “Storytelling is an amazing way to create peace.” #CreatorsForChange @MILCKMUSIC, @BeleafMel, and @ehbeefamily discuss what… RT @VidCon: Oh hey @emmachamberlain 😏 #VidConUS https://t.co/QyAmNkRP7B The gang’s all here! Some of your fave LGBTQ+ creators stopped by the meetup at #VidConUS. https://t.co/sFz7Tke5Yv 👋from #VidConUS! Look who came by the #LatinxCreators meetup today. https://t.co/KpigKRGcIz @noobde @VidCon @Twitch What was the best thing you learned?! Who’s ready for #LizaOnDemand?! @lizakoshy hosted a panel, Q&amp;A, and shared exclusive clips today at #VidConUS. https://t.co/moIo2zlLTG @blackprints_ @AndreaRussett @TTLYTEALA @lifeofrickey @KristenMcAtee @tanamongeau @JoeyGraceffa @RosannaPansino Pics for days!!! @ItsFunneh That's what we love to see! 🙌 @TimothyDeLaG So happy you came by! RT @TimothyDeLaG: Thanks for having me host, guys! Youtube has def played a major part in helping Asian Americans get more representation i… They’ve arrived! Creators from all over the world came to hang out at the #RepresentASIAN meetup at #VidConUS. https://t.co/8fXzhcu320 @Toomuchabi @JoeyGraceffa @EscapeTheNight @VidCon @ijustine @tanamongeau @GabbieHanna @RosannaPansino @ColleenB123 @TimothyDeLaG @AlexWassabi @DeStorm What's your favorite part?! @JoeyGraceffa @EscapeTheNight @VidCon @ijustine @tanamongeau @GabbieHanna @RosannaPansino @ColleenB123 @TimothyDeLaG @AlexWassabi @DeStorm We're definitely watching! Who else is excited that the #LizaOnDemand trifecta is back at #VidConUS this year? If you're in Anaheim, now’s your chance to see them! https://t.co/yM9aJMZZmT RT @JoeyGraceffa: Damn, we look good. The gorgeous cast of @EscapeTheNight ALLSTARS taking over @VidCon. 🔥 Episodes 1 &amp; 2 are now streaming… IRL → BFF4L! #YouTubeBlack creators met up tonight at #VidConUS to say hello and meet new friends 💫 https://t.co/wMdLCEdAbs @AndreaRussett @VidCon Here for the hugs! 🙆‍♀️🙆‍♂️ RT @thephysicsgirl: I finally got asked to DO science rather than talking about being a [insert human category] on YouTube. Today should be… RT @VidCon: HERE FOR THE @tryguys 👏😍 #VidConUS https://t.co/PgQoOCBVxL @Hevesh5 @VidCon It's so fun having such amazing creators come together! RT @Hevesh5: how is your #VidConUS going so far?? ☺️ @vidcon https://t.co/4gokZaWXe7 The best part of #VidConUS? Meeting and hanging with creators. Look who stopped by the creator lounge today! https://t.co/S3Gv8JPcft @RosannaPansino @ColleenB123 *heart eyes* for you two 😍 @RosannaPansino We're so glad you were there! @noobde Any top highlights so far?! @terrysongtv Who have you gotten to meet this week?! @AndruEdwards @VidCon @YTCreators What'd you think?! Thanks for stopping by! @alonzolerone We wanna see you bring your best! @sydneyitssydney @sofiedossi @NextTownDownNow @SamuelTsui @tryguys They all brought their A-game! 👍 @PhoenixFromYT @sofiedossi @NextTownDownNow @SamuelTsui @tryguys It was a blast! RT @RosannaPansino: Day one of @VidCon was amazing because of you all! Thank you to everyone who came to the Q&amp;A Panel. Had a wonderful tim… Creators gathered at the YouTube party last night and served some of their best looks! #VidConUS 🤩 https://t.co/ya5hb9GFaL @RolandCalvinDu1 @sofiedossi @NextTownDownNow @SamuelTsui @tryguys We can't wait to see what you create! RT @YTCreators: “There are a lot of risks that pay off and a lot that don’t.” @Jarvis shares and explains why it’s important to experiment… Music, dancing, and more! It wouldn’t be #VidConUS without live performances from creators at the OnStage show. https://t.co/omGvUYW2GE It's that time of year again! Go behind the scenes at #VidConUS with some of your favorite creators and follow along on our Instagram Story: https://t.co/UFNSjocKBD https://t.co/48biePx214 RT @YTCreators: Live from @nealmohan at #VidConUS, YouTube updates that will help creators make more money &amp; more impact: https://t.co/dgnY… RT @VidCon: The Expo Hall opens today 😏 #VidConUS https://t.co/DPSiHaTOyN RT @YTAdvertisers: 10 years. 40,000 fans. Tons of content. #VidConUS is here and we’ll be giving you an inside look at all the trends and i… Happening now: @EscapeTheNight All Stars! Watch the first episode with @JoeyGraceffa himself → https://t.co/gOcEJs2tcH https://t.co/tL9xuYnPWs We had a great day connecting with some of our educational creator friends at #YouTubeEduCon 2019! Lots of lessons learned but the 🔔 just rang and it's officially time for #VidconUS! https://t.co/K3C1JeFiuL Meet #CreatorOnTheRise, Stephanie Moratto, who vlogs about her daily life with her 59 animals! 🐴 → https://t.co/3nGLyjBLeD https://t.co/rS1MJPup83 RT @TeamYouTube: Lots to come w/ copyright – today we’re starting w/ a few changes:\n\n☝: Manual claims now require timestamps showing exactl… Ever wonder what it would be like to play cornhole with bean bag chairs? @vat19 built the world's largest cornhole game! Watch here → https://t.co/hvr3m4btw5 https://t.co/9bd8ZCSgZA @Melissani_MUA Nice work, Melissa. Keep up the top vids – so beaut! RT @amazonfiretv: The official YouTube app is now available on Fire TV. Learn more here: https://t.co/ST9Uh8RorG https://t.co/tBjhSjlWiw \"Someone asked me to turn myself into a disco ball.\" Watch @Jenna_Marbles's disco fever transformation! 🕺 → https://t.co/7DJc8KUbch https://t.co/IY0c8nmiVz @matthewencina @thefuturishere @theChrisDo @YTCreators Congrats, Matt! Have you ever wanted to know what it would look like to drop 5000 bouncy balls? Watch @howridiculous take on the challenge → https://t.co/CF2G5P7p2Q https://t.co/PlUuhlVWob \"I'm a 90s baby!\" Watch @carolinericke live one day using just 90s technology → https://t.co/qieQ8wnbce https://t.co/h1v7iqUT8C According to National Geographic, 91% of plastic isn't recycled. Learn how single-use plastic bags are affecting our environment and how we can keep it clean → https://t.co/TLWooxnrNL #CleanBeachesWeek https://t.co/ppZnTbAZGW Celebrate #4thofJuly from anywhere and stream the celebration live at 3:30pm PST 🇺🇸 https://t.co/WAaXj733GB America the Beautiful. This #4thOfJuly, check out this playlist featuring landscapes from all 50 states → https://t.co/zGSGDSVVTW https://t.co/NyF4MDvVFS It's not #4thofJuly without fireworks! Prepare for the holiday and learn the science behind how fireworks are created with this playlist → https://t.co/GNVq9c4ZOY  🎇 https://t.co/LWFWJZnDqs RT @youtubemusic: The story the Mellogang has been waiting for. The latest installment of #ArtistSpotlightStories has arrived with @Marshme… Learn how musical chords work with this catchy song and music video from @everydaylouie! → https://t.co/shBTIpfM1C https://t.co/TB0j9GDnCT Want to hear from @millselle herself? Head to our Instagram to check out her You&amp;A on our Story Highlights → https://t.co/iPx6xmm1V5 https://t.co/i9oEPF6NB7 They're turning out looks, giving you tips and sharing their stories. 🙌 Get ready for #WorldPride with your fav creators 🌈 → https://t.co/t45vxUx1x2 https://t.co/SQBAsuXI84 #Pride celebrations come to the US, UK and other countries, this month. Check out the videos in this playlist encouraging others to accept themselves → https://t.co/Prt4HpnD0I #Pride2019 https://t.co/MGv3XUQsM4 @itsmemaryclaire @TheGigiGorgeous *heart eyes* https://t.co/ruepaKEtR5 RT @TheGigiGorgeous: This was so fun to shoot!💖 Happy Pride 🍾 https://t.co/5YuRgseyYn @itsmemaryclaire @TheGigiGorgeous We are too! https://t.co/inqcL22NI9 @ItzRath @YTCreators @TheGigiGorgeous She's a vision! https://t.co/EUNoDqXH8x RT @YTCreators: There’s always room for a little more glam. 💁‍♀️Get ready with @TheGigiGorgeous as she talks #Pride and everything she’s le… \"This Starry Night is unlike any I've seen before.\" \nWatch #ArtZoom: a @googlearts guided tour like you’ve never been on before → https://t.co/ZKQybU20fz\n\n🎨 Vincent van Gogh 📅 1889\n🏛️ @museummodernart\n🎙️ #ArtistOnTheRise @maggierogers https://t.co/TMlHuO8q4j For #Stonewall50 we worked with @StoryCorps &amp; @WorldOfWonder to bring voices from the Stonewall Riots to life. Watch @ConnorFranta @AmbersCloset33 @Miss_Benny @AlexisGZall &amp; more honor this day in #StonewallOutloud → https://t.co/rHCCAheiQN #Pride https://t.co/TVaP34mWBd @ChristyRomano @willfriedle We are def watching! 👏 @BstylezsOrleans @YTCreators @itstarekali We can picture it now 👏 https://t.co/80PcIIkZJW @XanderAscends @YTCreators @itstarekali We stan! 👏 https://t.co/zc4GOdUnwg @itstarekali There he is! 😎 https://t.co/TeC762aj99 RT @itstarekali: Oh em gee. It’s me https://t.co/xsQaGg1WYx @kingsleyyy @itstarekali https://t.co/tghs7Tervh RT @YTCreators: We’re here for a GRWM moment. 👏 Watch @itstarekali get #Pride ready and talk inspiration, his experiences online and more.… @Moriah_Naomi_ Love it! @DikshitaPunetha Great haul, we'll have to give some of these a try! RT @TeamYouTube: Starting today, we're rolling out several new features to help you more easily find and enjoy videos on Home and in your U… .@IngridNilsen put together a #Pride playlist, celebrating some of her favorite creators in the LGBTQ YouTube community. Watch the curated playlist here → https://t.co/CoF4yzswdX https://t.co/8HfRFeUgVh @GraysonDolan The Paris Fashion Week content we never knew we needed! @EthanDolan *watches immediately* @NaomiCampbell @NARSCosmetics A beauty queen! 👑 RT @NaomiCampbell: New episode on my @youtube channel 🖤 I noticed you all have been asking for videos about my beauty routines. So here’s a… RT @YTCreators: Attention LGBTQ+ creators: We want to help you grow your channel! Apply to get all sorts of training + $2,000 in production… RT @YTCreators: #YouTubeBlack creators: Here’s a chance to connect, learn and get resources to bring your channel to the next level. Apply… Think you have a dirty car? James from Stauffer Garage found the dirtiest car he could and did a full car interior cleaning. Watch the before and after here → https://t.co/Ap3dYN5C0H https://t.co/LFslrdOfg8 Guest curator, @jessiepaege put together some of her favorite LGBTQ+ YouTube videos. Watch her #Pride playlist here → https://t.co/1T9OkIpoQP https://t.co/b5PhyHqMVp Now that it's officially summer, make sure you're being safe in the sun and learn about the benefits and dangers to sun exposure and how effective sunscreens are → https://t.co/4AuZU1rRWw https://t.co/3ke3RJ3R3n Ebony and Denise from Team2Moms curated a playlist for #Pride! Check out these parents who are doing an amazing job raising their kids and watch the playlist here → https://t.co/ZycjViS9bM https://t.co/w0j6oRiaHl @dragunbeauty @NikitaDragun @kimpetras *screams with excitement* ❤️🧡💛💚💙💜 https://t.co/erWTlnqQ7Q RT @youtubemusic: #Señorita is here 😍 @ShawnMendes + @Camila_Cabello back together again → https://t.co/L8pwEDlNVR https://t.co/EOnSM3Ll87 What happens when you melt every lipstick 💄 from a drugstore together? @safiyajn finds out in her new video → https://t.co/8KCacXaW4S https://t.co/97a7cIJwoG @alyonnaxv @YTCreators @NikitaDragun @kimpetras So do we! https://t.co/IAsp1LbRmn @1994uglygirl @YTCreators @NikitaDragun @kimpetras That iconic look! https://t.co/rH2mkuAQMu @rein_kambala @YTCreators @NikitaDragun @kimpetras 👋 woo-ah! https://t.co/jrJa4LUyQ4 @iiamjulius @YTCreators @NikitaDragun @kimpetras We're so happy to hear that 🥰 https://t.co/GqPYWkDhl3 @transegghatcher It's true! https://t.co/agoxqFcSBy @feelgoodclubb @kimpetras @NikitaDragun She really does! Woo-ah! https://t.co/KAgobwyIJb RT @kimpetras: Talked #Pride n more in a vid w my bbrl @NikitaDragun ! it’s out now on @youtube !! 💕 https://t.co/J8v1jZVC5e https://t.co/f… RT @youtubemusic: Thousands of iconic music videos are coming YouTube Music in HD for the first time. Watch @ladygaga’s Bad Romance now and… @karloscyrusLL @kimpetras @NikitaDragun Cue the eyelash bat! https://t.co/Z1JqM9WvRT @travii98 @kimpetras @NikitaDragun How can you not?! Woo-ah! https://t.co/xm05eXhLfC @yeetusmeatus13 @kimpetras @NikitaDragun It's not #Pride without @kimpetras and @NikitaDragun! https://t.co/RAinSmyTUa @alycatvideos @kimpetras @NikitaDragun That makes US so happy! Woo-ah! ❤️🧡💛💚💙💜 https://t.co/XHolFAluZN @IAmxMadameX @YTCreators @kimpetras @NikitaDragun An icon! https://t.co/a1GdvRTHzq @worldmehndides1 @YTCreators @NikitaDragun @kimpetras *waves back* 👋 https://t.co/19kq89n21c @GPBGeorge @kimpetras @NikitaDragun Happy pride! Woo-ah! https://t.co/GzHCzqAcOE @pctras @kimpetras @NikitaDragun Two mega icons! https://t.co/LXH0rpCPte @AthanMoonchild @kimpetras @NikitaDragun So are we! https://t.co/dIwSFLNYUi @youtubemusic @NikitaDragun @kimpetras It's a WOO-AH moment!!! https://t.co/oHS1xTv8rm @JAXPRUS @YTCreators @kimpetras @NikitaDragun Queens they are! 👑👑 https://t.co/nDbU4Luo4L @hillsidegirl27 @kimpetras @NikitaDragun So much love ❤️🧡💛💚💙💜 https://t.co/CTNwKuRByA @salvimp3 @kimpetras @NikitaDragun *bats eyelashes* 😍 https://t.co/CA8ZKgdYly @JAXPRUS @kimpetras @NikitaDragun Yesssss!!! 👏👏👏 https://t.co/G0TWbNwPUS @Shooketh_camila @kimpetras @NikitaDragun That she is! 👑 https://t.co/Yu9woGMA5y @ultraviolensx @kimpetras @NikitaDragun Such icons! https://t.co/H6DkwdVyWL @alycatvideos @kimpetras @NikitaDragun Here you go! → https://t.co/hUT1Xp9ELz https://t.co/P85Ntq3rJw @kimpetras @NikitaDragun Can we get a WOO-AH! https://t.co/EWBGTbEi1m RT @YTCreators: Creators @nikitadragun and @kimpetras come together to talk about living online with #Pride. Watch the full video now! → ht… She really did it! Watch @SimoneGiertz transform her @Tesla into the world's first \"#Truckla\" → https://t.co/LiGGXeLXtt https://t.co/I55h5zQH4I @vickipoem Wow, they look so good we'd be tempted to take a bite! 🍎 Someone went sugar shopping! @thekingofrandom took requests from fans to find out what ingredients they could turn into cotton candy → https://t.co/8G9mQsefnq https://t.co/XamJV4zhSb RT @youtubemusic: Who was your favorite cameo in #YNTCDMusicVideo? 🍔🍟 Watch the latest from @taylorswift13 now on YouTube Music → https://t… Though their fathers are behind bars, their love is unbreakable. Watch this year’s #LoveLetters → https://t.co/EmEBTHaEnL #FathersDay https://t.co/JgOp6n5jOv Happy #FathersDay! Celebrate dads everywhere with this Father's Day playlist → https://t.co/f1sD7obgTT https://t.co/hVymzllRdz What do you do when your kids don’t think you're cool anymore? We know a dad who went from wanting to be a cool dad, to a dad who started a business. Check out what his kids think now → https://t.co/Dcc1ieMJNS #FathersDay https://t.co/rYhlmNn5T1 For this week's Social Impact global playlist, hear from vloggers in your language who are strong advocates for what they believe in → https://t.co/6NKT5SnCWC https://t.co/DNArqbVQKx RT @youtubemusic: Continuing to honor the legacy of @TheRealGrimmie this week with her new video Hold Your Head Up. Play now → https://t.co… RT @youtubemusic: It’s #GrimmieThursday! Tune-in and help us countdown to the Premiere of @TheRealGrimmie’s new video Hold Your Head Up → h… RT @TheRealGrimmie: [TEAM] #TeamGrimmie Join Marcus Grimmie and LIVE CHAT tonight at the Official Premier of #HoldYourHeadUpVideo on @YouTu… How do YOU pronounce \"macarons?\" Join @tryguys and @gabbiehanna in a macaron bake off → https://t.co/Ro88RMs6T5 https://t.co/qAgSlQHvF9 @marnie What are you currently obsessed with on YouTube?! RT @marnie: Anyone else obsessed with YouTube? Its literally replaced tv for me 😂 Learn more about men's health from YouTube Creator and family doctor @RealDoctorMike's curated Playlist → https://t.co/IL8TREjPsn https://t.co/EzLi8M609N RT @TeamYouTube: Want to learn more about the bell notifications changes? 🔔\n\nTake a look behind the scenes with our notifications Product M… @BrookeTheMouse @TheRealGrimmie The donate button is visible on the watch page, next to each individual video in the playlist → https://t.co/e3wrCFGc6x Today we celebrate the life of @TheRealGrimmie in partnership with the #CGFoundation. Honor the legacy of Christina Grimmie with this commemorative playlist and an option to donate. #TeamGrimmie → https://t.co/McJ8k4breM https://t.co/ANChGlrtkM RT @YouTubeGaming: [LIVE] 🔴 Look alive! It's go time for #E3 Live with @geoffkeighley!\n\nTune in now for some world premieres, creators, dev… @KiguStudios Love it, thank you Pierre. So many hats to choose from! 🧢🎩👒 @Vale_Yard Brilliant! All that hard crafting paying off. @LifestyleMing Nothing more satisfying than a good declutter 🧹 @JamsSloppy BB really is the king. You do him a real service though, love your playing! 🎸 @JeffreyMoffat4 Creativity is whatever you want it to be, Jeffrey. Looks like you've got it in bucketloads. Love the vid! @babbletop 🙌🙌🙌 @Ms_Nerlinde Great tutorial. You killed that contouring! @mzkatecatalina Great vid Kate! Your grandma sounds like an incredible source of inspiration. @DanaC_ @YouTubeTV @YTCreators @BerlinTourism @visitberlin @beBerlin @Berlin_de_News @konzerthaus @aiww Great tour of the Gendarmenmarkt, Dana. We'd love to visit! @pazricgaming Getting Over It is frustrating even to WATCH! Your gf did great though. @SmeeKevin Okay, you're good…Excited to see more, just hope we don't end up in your lobby! Are you ready to hear more Stadia news? Watch #StadiaConnect this Thursday on YouTube at 9:00am PT → https://t.co/EEdVS78ljM https://t.co/i2wiOBAN60 @emmachamberlain We’re only just getting started!! 💕 RT @TeamYouTube: If YouTube isn't loading for you or you're experiencing error messages, we're working to fix it! @theanjulisymone Thank you for sharing your story! @SamAndShanyn @lexbegay Congratulations! We can't wait to see what you create on YouTube! @ChloeKim Welcome to YouTube! We can't wait to see what you create 🎥 RT @Adaripp: Another #BreakTheIce with @raymondbraun. He kills it on the ice and love all he does off the ice too ❤️🏳️‍🌈 https://t.co/mHBKy… Multiple Sclerosis is a disease that impacts the central nervous system. See how those effected by the disease cope and learn what can be done in the fight against it → https://t.co/8dBsJVTeBg #WorldMSDay https://t.co/l8ID7U0cti Hey @TSeries, you might want to make some space on your shelf for something new and shiny... 🏆 Congratulations to @TSeries for reaching 100M subscribers! 🎉 https://t.co/6kHopm2GAZ Watching others share their mental health journeys can be a great tool in learning more about our own mental health. Watch our “How To Speak Openly About Mental Health” playlist now → https://t.co/BqG4ot75a3 https://t.co/jshnV5NLJA RT @kylekrieger: Words cannot describe how it feels to watch you shine @raymondbraun!! Go stream, watch, and support this wonderful film. Y… RT @tracelysette: #StateOfPride 🌈 https://t.co/mFIZBmqb5c RT @meredith_bagley: Proud to be featured in the documentary State of Pride they released today worldwide on YouTube Premium. And we’re goi… @raymondbraun A must watch! RT @raymondbraun: STATE OF PRIDE is now streaming! Available for free at https://t.co/9mYrQjiCDP.\n\nFrom Oscar-winning filmmakers Rob Epstei… We traveled across the country with @RaymondBraun to explore what Pride means to LGBTQ+ people 50 years after Stonewall. Watch the new YouTube Original, #StateOfPride today → https://t.co/pX4LCHgL5f https://t.co/riaUBfXr2d Warning: this sandwich is so big that you might get full just by watching this video from @migrationology! → https://t.co/9RyrP2r47L https://t.co/TX19xQKHqu This Memorial Day, explore the history of the United States Military and what it takes to defend the country → https://t.co/K13AC4YkxR https://t.co/5oduwd6sIw #CreatorOnTheRise, Jon Schmidt, is a potter and business owner from Waconia, MN. Check out his channel for everything from making pottery to being an entrepreneur → https://t.co/LzVc2g7vkU https://t.co/8NO2Z9lN5v ☑️ Rest and relaxation\n☑️ Spending time with loved ones\n☑️ Exploring passions\n\nThese are just a few of the self care suggestions from @KatiMorton's guest playlist this #MentalHealthMonth. \n\nWatch now → https://t.co/QnHjeJBjgl https://t.co/Bs0AaM8nw9 RT @youtubemusic: This Week in 🎶\n\n🏍️ @djkhaled x @iamcardib x @21savage  \n🕷️ @youngthug x @JColeNC x @trvisXX \n🌌 @flyinglotus \n⚡ @emelisand… Watch these creators shine bright in this playlist celebrating Asian American &amp; Pacific Islander Heritage Month →  https://t.co/wYuLRBud28 https://t.co/nV0A6rC3GQ RT @youtubemusic: From London to the 🌍 Say hello to @Mabel, our UK #ArtistOnTheRise → https://t.co/xlnBinZafp https://t.co/KAAYeUqlSa \"This is the future!\" @sssniperwolf is here to share some of the craziest vending machines from around the world with you → https://t.co/vhfYUqrsle https://t.co/zOVFyyxJuw Meet Cheong, who found a way to connect with his daughters thanks to his rainbow loom invention, now a successful business thanks to the power of YouTube tutorials! → https://t.co/3shLg0yQTX https://t.co/4U8eC9bvEw RT @Adaripp: .@maddieziegler &amp; @kenzieziegler are my guests today!! We talk their lives as performers, try to master the Swizzle, and dish… RT @SmithsonianChan: Join us as we explore how scientists are fighting to save some of the world's most endangered species from going extin… We'll take one of everything, please! Welcome to @amberscholl's Tokyo shopping spree extravaganza → https://t.co/QQJC8kAGks https://t.co/36xtf9thuB @RosannaPansino Now we're feeling hungry! We all have different ways of coping with our stress and anxiety. This #MentalHealthMonth, learn new coping techniques from creators: https://t.co/EcXSmK8TxC https://t.co/5nt69P78c9 RT @SusanWojcicki: Sharing a video that reflects my latest letter to creators (https://t.co/nJkvRRwarf) on @YouTube's 2019 priorities, incl… RT @YTCreators: Thanks to all the creators who joined us for #YTNextUp #YouTubeLatino at @YouTubeSpaceNY! ❤️\n\nIf you want to learn how to l… What do you think Thomas agreed to do? Watch this spontaneous adventure from @YesTheory, saying \"yes!\" to a DM request → https://t.co/H7ouS1LxZV https://t.co/U0EqCnGcq7 RT @MarkRober: YouTube asked me to make a playlist. I picked videos that I find myself referring back to regularly because they changed how… Mechanical engineer, Mark Rober, is here to help you come up with practical solutions to real world problems. Watch @MarkRober’s \"Refine Your Mental Model of the Physical World\" Playlist here → https://t.co/QfrP2DPfOw https://t.co/SYnh8LwfGK @kandeejohnson Yes yes yes! Make a YouTube comeback! Not everyone has experienced living with mental health issues, so these people described what they feel on a day-to-day basis to help broaden understanding. Watch and learn more → https://t.co/65ZnjJ2HFO #MentalHealthMonth https://t.co/sOH54pBl3x Think you have what it takes to be an ~*internet baddie*~? @hakeypham takes on the challenge → https://t.co/5heFJi9XLg https://t.co/Slwfg8NiLr Did you know that 850 million people attend museums per year? That's more than amusement park and sporting event tickets sold per year! Watch this playlist to celebrate #InternationalMuseumDay → https://t.co/d19mwbVFKb https://t.co/FIHyAH72n0 \"Rarely can a response make something better, what makes something better is connection.\" Watch @BreneBrown explore empathy → https://t.co/YgLSyc970i #MentalHealthMonth https://t.co/ELJceuhptj RT @SusanWojcicki: Thank you for bringing so much joy to people around the world @RealGrumpyCat. We'll miss you! https://t.co/3MzzcsT3t0 @tyleroakley Practice makes pretty! @RealGrumpyCat We're thinking of you today, @RealGrumpyCat ❤️ Today we celebrate the legacy of @RealGrumpyCat. Watch her first video and more → https://t.co/eFNPffzWKU https://t.co/oKoB1cleTh @youtubemusic @edsheeran @justinbieber *playing on repeat* RT @youtubemusic: Just 1 hour until @edsheeran + @justinbieber's #IDontCare video is here ⏰ Head to the Premiere page and get in the chat n… @missremiashten We’re so happy to have you! 😭💕 @MacieJayGaming Mistakes were made. 😱 Looking for the world's largest spoon to go with @MrBeastYT's largest bowl of cereal → https://t.co/AEU2F5EOWk https://t.co/HGNOqhMyHI RT @yamimufdi: SO HONORED TO BE HERE! https://t.co/yGJsgrrJIO RT @AndreaLausell: Ayyyy 🙌 https://t.co/ABdDxh3pWq #CreatorOnTheRise, @StylishDad, shares everyday tips for how and why it’s important to tailor your clothes 👔🧵 → https://t.co/OQ91n7FtOe https://t.co/xhWUCYPG4s RT @youtubemusic: We are now LIVE in\n\n🇵🇱 Poland 🇨🇿 Czechia 🇷🇴 Romania 🇭🇺 Hungary 🇧🇬 Bulgaria 🇲🇰 North Macedonia 🇨🇾 Cyprus\n\nWelcome to #YouT… .@wearemitu discuss therapy to help address stigma within the Latinx community → https://t.co/URrQjsxZXO #MentalHealthMonth https://t.co/QClOA4drjB Can't. Stop. Watching. → https://t.co/iYGfsKRkud https://t.co/VssMmeQ1TQ Here’s a cat video...well...just because → https://t.co/LRMchONoX5 https://t.co/h2ceic2SES Congratulations to @realstoriesdocs for winning Best Short Form Program at the @BAFTA Television Awards in London with their original film, Missed Call. The first ever BAFTA win for a YouTube first program! Watch here → https://t.co/XkeeWsPoaF https://t.co/lXLqpr1a33 @Twankuyper You guys are too cute ❤️ In honor of #MentalHealthMonth, @traceymarksmd, a psychiatrist and YouTube creator, curated videos all about self-care and mental health. You can watch now → https://t.co/JtOj33fcg2 https://t.co/bJeXcWnF7c @for91days Love your style of shooting. Feels like we're really there with you! @lawrencekitema So glad to be able to award @HenryDeSagu his Creator Award. Looking forward to seeing more incredible creatives coming out of Kenya 🇰🇪 #YouTubeCreatorAwards Every mother has a story to share. Watch the highs and lows and in-betweens in @Google's \"Becoming Mom.\" #MothersDay → https://t.co/UhieMybROg https://t.co/HMqIVoWYOY No one journey is the same. This #MothersDay, watch inspiring women across YouTube share their stories. → https://t.co/J8dGLgFaWZ https://t.co/nvmk7AwSmb This can't NOT put a smile on your face 😀! #CreatorOnTheRise @ohponyboy_ is a French 2D animator and songwriter with musical webseries' on YouTube → https://t.co/tBh2lvB46N https://t.co/VB3dv2xUJN Go behind-the-scenes at the biggest fashion event of the year with some of our fave #MetGala videos! Check them out here → https://t.co/AhzZ3owIAx https://t.co/RhvGBh0vrK For #MentalHealthMonth, @alimattu has curated a playlist exploring mental health topics like stress, empathy, OCD and more → https://t.co/DL5Jv2XaFJ https://t.co/25pgcC6gsU @Hevesh5 😂👏 It's #TeacherAppreciationWeek! This playlist celebrates the importance of teachers and why they deserve our appreciation today and everyday → https://t.co/5TkvxoZvw3 https://t.co/aJP2cFuEr1 RT @YouTubeGaming: What does it take to make a Game of the Year? Go behind the scenes with @SonySantaMonica in their brand-new God of War d… @kieranpauljay We're not surprised! So many great moves on there. The Kings...wow! 🕺 Always smiles, missing bones, eats slime... 👀 Watch these creators take on your assumptions. → https://t.co/LAFrUGThGx https://t.co/VFApljlC96 Where could your late night YouTube searches take you? Check out three amazing people who are changing themselves, and the world around them with skills learnt through YouTube →  https://t.co/dMKn8yp8Jj https://t.co/TYhSfXAXAv @IISuperwomanII We love a glamorous moment! 💕 @jamescharles 🙌💃🏻🙌 RT @IISuperwomanII: God bless a full service CEO who not only runs YouTube but also helps my dress not drag through a puddle. You’re a real… How many of you knew these answers?! 👀Watch @VanessaMerrell and @veronicamerrell answer the internets biggest burning questions. 🔥→ https://t.co/EJsXsCttPc https://t.co/1KpP1d6Vr0 @IISuperwomanII 😂👏😂👏 RT @SusanWojcicki: And look who was at the top of the red carpet at the #metgala ! @lizakoshy interviewing stars for @voguemagazine includi… 😍😍😍😍😍 https://t.co/WggWH1yIw9 @IISuperwomanII Like a bawse! 👊 @jamescharles Yes you are!!!! 🙌 @jamescharles @AlexanderWangNY We love a sister slay! 👏👏 RT @Fashionista_com: And the @DerekBlasberg-led YouTube takeover of the fashion industry continues with @jamescharles at the #MetGala in @A… RT @YTCreators: Liza Koshy but make it fashion.#MetGala https://t.co/WSh3GM0L1b RT @karliekloss: I'm sharing my #MetGala  make up look before it even hits the red carpet tonight ➡️ https://t.co/Z8dm2OB3km https://t.co/h… @karliekloss Here for this! 👏 RT @YouTubeTV: It's the first Monday in May and we're dressing up in our camp finest for this year's #MetGala. \n\nKeep your eyes peeled for… @IISuperwomanII The anticipation! 😱😱😱 @AlexanderWangNY 👀👀👀 Brian McLogan's #YouTubeLearning playlist is making math easy as pi(e)! Celebrate #TeacherAppreciationWeek and watch the full playlist  → https://t.co/FQ7aE8uYxG https://t.co/oPn4gwmASE It's a slow cooker kind of Sunday. #CreatorOnTheRise @cookwithry will keep you feeling full all day long → https://t.co/zfiWq3qW3B https://t.co/BE6OEaMp2h Is Liza Koshy a professional ballerina now?! Watch @lizakoshy master ballet → https://t.co/YmggA1PxOK https://t.co/jEFzturW2a When you get 120 creators in one place, magic happens. #CreatorSummit https://t.co/fdWy8lOu1M RT @TeamYouTube: Have questions about Viewcount freezing, Content ID claims for singing a couple of lines of a song, or the Reused Content… *Turn up the heat!!* 🔥🔥 Watch @CollinsKey go to town on some giant food → https://t.co/34D78V5doD https://t.co/ObbF4wpJHv @blogilates @IISuperwomanII @RosannaPansino @LindseyStirling @ijustine 👯‍♀️💕 From K-pop idol to global artist, watch the decade-long evolution of @JAYBUMAOM now with YouTube Premium #JayParkChosen1 ☝ https://t.co/mXfhkqPdFZ https://t.co/oWScDNDfWm RT @SusanWojcicki: Loved spending time yesterday with @YouTube creators at the North America #CreatorSummit. Thanks for the great conversat… RT @YTAdvertisers: #Brandcast is here! 🎉\n\nFollow along for updates on all the top creators and marketers taking the @YouTube stage tonight.… RT @YTCreators: Skaters gonna skate. Creators gonna create. 💿 #CreatorSummit https://t.co/Wnzg9QxKQp @Malala @MalalaFund Can't wait to hear these stories! 🙌 @Adaripp @IISuperwomanII Love this! 🙌 RT @YTCreators: Learning + NYC + old friends + future collaborators + fun times = #CreatorSummit https://t.co/QmFniZrBE1 Krystyn Keller used YouTube to learn how to make natural skin care products at home! To see what she’s learned from @abetweene, @PinkSoFoxy and more, watch the latest #YouTubeLearning playlist. → https://t.co/KZHI2FSOyB https://t.co/eJnv73PSTc RT @SusanWojcicki: .@YouTube's past, present, and future success starts with creators. Just posted my quarterly letter with an update on ou… From iconic cuts to colorful dyes — watch creators share their styles and stories from behind the chair. #NationalHairstylistAppreciationDay → https://t.co/8kriv0VZWP https://t.co/lMaErJVY6I RT @YouTubeGaming: In addition to Gaming's new home on the main YouTube website &amp; app, our team’s working on tons of other exciting things.… @RosannaPansino @ijustine @Husky Safe travels and have fun at #CreatorSummit! @RosannaPansino Loved every minute of this! 😂 Gotta be careful around some of these kitchen gadgets. 😂Watch @RosannaPansino and @ijustine try all the things. → https://t.co/jZ03wb153V https://t.co/jhQQhDNy0L Who said brunch needs to be trendy? 😂 Watch @Mikexingchen do convenient store brunch. → https://t.co/tzbjMzgide https://t.co/hhIMrmzAPf RT @youtubemusic: With 65.2 million views, congratulations @taylorswift13 + @taylornation13 on breaking the record for highest  female and… Watch BestDressed's tips on essentials every wardrobe needs. 💃 Which staples do you own? → https://t.co/4E9DX2Eo8y https://t.co/KczD48Qeiy RT @youtubemusic: Submissions for the album title theories + time code from the #MEMusicVideo are open ⬇️ https://t.co/ag2LoD1zws It's #ArborDay and this #YouTubeLearning playlist has information about just how important they are within our ecosystems, from cities to forests! 🌲Let us know what you learned. → https://t.co/TTgcCj691X https://t.co/9fz1Zc2KGe RT @youtubemusic: .@taylorswift13 has returned. Play ME! (feat. @brendonurie of @PanicAtTheDisco) now on YouTube Music → https://t.co/yY6Gk… RT @taylorswift13: On @YouTube answering questions. Send help. \n\nhttps://t.co/vljvOeYo6R https://t.co/jleC5nRXca RT @youtubemusic: Blessed with a new @taylorswift13  single AND video tonight 🙏 Don't miss the premiere of ME! featuring @brendonurie of @P… @GermanicShepard 🐨🐨🐨 This cuddly koala is everything we need to get us through the rest of the week. 😭🐨 → https://t.co/n6QzBjYoFQ https://t.co/PFIYowyCwE @Adaripp All of the uploads! Congrats. 🙌 RT @CobraKaiSeries: It's here! #CobraKai season 2 is available NOW with @YouTube Premium: https://t.co/MtCScdbeDg https://t.co/h4tHt35QCs #CreatorOnTheRise Dan and Chelle are allowing their photography work to take them on a journey across the World! 🌎Subscribe to watch their travels. →  https://t.co/tlkRf625B2 https://t.co/TXu9udC2N7 RT @VereenaSayed: hi hi so i’m doing a you&amp;a on @YouTube’s instagram story so send me questions on there! Living large 🙌Watch the assembly of this miniature hamster spa. → https://t.co/6ediGH6fdM https://t.co/V6WmSUIR2D Nibras, a college student and Yazidi refugee, shares her story of how she navigates her new life in the U.S. in this new video series by @MalalaFund https://t.co/8E0jx5XqeP These creators from around the world are leading the way to a more sustainable future. Check out this #EarthDay playlist to see how they're making an impact. → https://t.co/Fq5KKneIuf https://t.co/g5VxN2tMHt #CreatorOnTheRise, Alex &amp; MJ On The Go, film their adventures as a traveling couple with a goal set out to film every day this year. 🌎 \nSubscribe to watch all the places they'll go! → https://t.co/GhXFxzgmg7 https://t.co/OTnMrFiXyx RT @SusanWojcicki: Appreciate the time and more importantly the conversation @CollinsKey @devankey!  Great hearing all of your thoughts abo… RT @youtubemusic: You’re invited to spend #SundayService with us at @Coachella. Tune in on 4.21.19 at 9am PT on #YouTubeMusic → https://t.c… .@mayapolarbear crunch crunching away is the puppy pick me up we need today! https://t.co/3lt9J6Kadl https://t.co/qM6zUkHErx RT @youtubemusic: #Coachella is just getting started! Tune into the official @Coachella Curated live stream all of Weekend 2 on #YouTubeMus… Taking carrot cake to the next level 🥕 Watch @theicingartist build this bunny abode! → https://t.co/Vw8iNkaCjI https://t.co/SmG4ETCyvv RT @YouTubeGaming: The original Game Boy turns 30 this week and @MKBHD is examining its impact on culture in his YouTube Original special R… @whatsinside We are truly everywhere RT @SusanWojcicki: The tea — actually the diet root beer—was great ☕️.  But the conversation and your insights were even better!!  We are w… RT @SusanWojcicki: Was *sister super* meeting you, @JamesCharles :) Enjoyed hearing your feedback and ideas for @YouTube over a pink drink… RT @youtubemusic: You can now enjoy YouTube Music in the background on your Google Home speaker, @madebygoogle. Try it now → https://t.co/x… @jasonnash For the win! 🙌 The house always wins, but at least in @rhettandlink's world, you get a cool outfit out of it. Watch @emmachamberlain play thrift store blackjack poker 💃 → https://t.co/rMUhaQofl3 https://t.co/M20LwqeItF We'll take all the grilled cheese. Watch @BingingWBabish's spin on a classic. → https://t.co/dXgQIMOqS5 https://t.co/bmKCbZ8BUI .@SethEverman recreating Bad Guy by @billieeilish is everything we needed and then some. → https://t.co/NwuA7v0ePA https://t.co/8TV7eprk7Z Say hello to the NextUp #YouTubeBlack London Class of 2019! These creators spent a week at the London YouTube space learning how to level up their channels. Subscribe here. #YTNextUp → https://t.co/zIEPYO7qVJ https://t.co/gY993r8Qq2 RT @YTCreators: WATCH: YouTube CEO @SusanWojcicki talks to creator @iamMostlySane about YouTube's past, present and future. https://t.co/c6… These Springtime recipes are guaranteed to make any party next-level. For all your baking needs watch @gemstaff16's #YouTubeLearning playlist. → https://t.co/LdcAApZ6hp https://t.co/ByqGahic7z RT @youtubemusic: What a weekend so far. Have you been watching the @Coachella livestream?? → https://t.co/WEcc8w00jZ https://t.co/VJ41FmdO… RT @youtubemusic: 👀 See who's stopping by the #YouTubeMusic lounge at @coachella! And tune into the live stream both weekends here → https:… RT @youtubemusic: Yes, we're still running the numbers, but we can confirm that #BoyWithLuv (ft. @Halsey) is now *officially* the most-view… RT @youtubemusic: We're just getting started. Keep tuning into the @Coachella livestream all weekend long! #Coachella2019 🎡 🌴 → https://t.c… RT @youtubemusic: Cannot WAIT to see what Donald has up his sleeve. Tune into @ChildishGambino performing LIVE from @Coachella in 10 mins!… RT @youtubemusic: IT. HAS. ARRIVED. You can catch the official @Coachella livestream BOTH weekends on YouTube Music, whether you're here or… Breaking boards left and right! Watch @lizakoshy and the vlogsquad try martial arts.→https://t.co/pI7eAMilGQ https://t.co/ySmIos0sih RT @youtubemusic: What happens when we throw your favorite creators together on a party bus to #Coachella2019? Tune in today and all weeken… @Kaeith_ Anytime. 😏 What more could you need?! 😴 \n\nWatch @williams_tyler and @safiyajn give Tokyo's capsule hotel a go. → https://t.co/brNpSgtsGh https://t.co/dqG3w23Iiq It's #NationalLibraryWeek and there are always more reasons to read! \nThis #YouTubeLearning playlist gets into all the benefits of reading.→ https://t.co/IT70y8EyT8 https://t.co/8hX65nveHS Merch @laurDIY style. ✂️ Watch Lauren make it her own. → https://t.co/Xvc1eOlvM7 https://t.co/aFObj9uiFf 👀 @lilmiquela @youtubemusic Be right there! https://t.co/DHJ3ig32U6 RT @tannerfox: I’m doing a “You&amp;A” on @YouTube’s Instagram right now, come ask me some questions to answer 🔥 RT @youtubemusic: ⏰ Rise and shine ⏰ @lizakoshy stars in the video for Woke Up Late, from @DraxProject, ft. @HaileeSteinfeld → https://t.co… They are truly living their best life. Check out @celeb_dachshund's snow day. → https://t.co/tbrpPdwAvR https://t.co/Jt18ZdnhXN @thisfarmwife @sandibrock 🙌🙌🙌 #CreatorOnTheRise @sandibrock is giving us the best tour of all... a farm tour! Check out a day in the life of this farmer. → https://t.co/dqNTfVTtz0 https://t.co/VIQFjgJeeo .@jofranco is doing France shut up and go style. 🇫🇷 Head over to @damonandjo's channel to watch Jo travel Bordeaux like a local. → https://t.co/O8RnbcjAMO https://t.co/x1D8E3av1O Old age simulators are a thing and the @tryguys are here to give it a go. 😂→ https://t.co/I8BzZchCxO https://t.co/C7DzIZZr9C RT @hitRECordJoe: Music shows often pit artists against one another. With winners... and losers. \n\nBut @Logic301 did something completely d… @Ginger_Ale25 🐍🐍 RT @TeamYouTube: Catch our NEW series on the TeamYouTube Channel: the TeamYouTube Monthly Roundup 🎬✨\n\nGet the top YouTube product updates a… DIY Dolan style! 🔨Watch @ethandolan and @graysondolan give each other room makeovers. → https://t.co/Ec1p4bUD70 https://t.co/jyBDCQB3ZR Are you #TeamMiyagiDo or #TeamCobraKai? The @CobraKaiSeries rivalry continues April 24th. Watch the full trailer here: https://t.co/UfqJlzoh5D https://t.co/wKa9438I9Z @NatashaMaksimc1 This is amazing! 🙌 Only @jamescharles could make painted eyes look this real! 👀 Watch the full video. → https://t.co/ggWNpuqoIv https://t.co/KN5wTtvUiG Time for the real Pokémon Onigiri — watch @BingingWBabish's latest video. → https://t.co/RBFvsrmnbh https://t.co/G6LTmFM6zg 🤠 A day in the life of the one and only @antoniiogarza21 🤠 →  \nhttps://t.co/Y6iMmtnY6X https://t.co/Yb0ZQrk8JB Top of the week food inspo brought to you by plant-based #CreatorOnTheRise, Nicole Rizza. → https://t.co/KUZI4U53hp https://t.co/v6QGJRBhHO Your daily dose of puppy goodness. → https://t.co/pLRSPnuDsz https://t.co/S7gWmfrbL6 Let’s do this! 👏 Join @ZacEfron live now. → https://t.co/NzL3KHCV4J https://t.co/d7p2ohbcj8 First prank, kiss, vlogsquad memory... Watch @DavidDobrik recount all his favorite first moments! → https://t.co/sQfFOJ79Dt https://t.co/cGbEt9ljWK #CreatorOnTheRise, Planterina, has some tips for all you plant lovers out there. 🌿 Check out her house plant jungle! → https://t.co/daB5vpYO1o https://t.co/NwHNeJCgez RT @YouTubeTV: #WomensHistoryMonth may be coming to an end but we're celebrating strong, ground-breaking women all year long.\n\nOur newest @… She’s baaaaaaack! @lizakoshy https://t.co/tPisY3ji8s We’re celebrating #MuslimWomensDay with @xoamani, 2017 #CreatorsForChange Fellow and founder of @muslimgirl, a platform empowering Muslim women to share their stories. \nHere’s how you can get involved with Muslim Girl. → https://t.co/bbydVoIexy https://t.co/0WeVg3Z6L9 🚨 Not a drill. 🚨 https://t.co/a43TKiOB5k RT @SusanWojcicki: Thank you to the tens of thousands of creators and EU citizens who spoke out about the unintended consequences of Articl… .@DudePerfect's taking paper airplanes to the next level. 😱 → https://t.co/34arNqjS2l https://t.co/hOf84BeS7J RT @YTCreators: Update: The European Parliament has now voted on the EU Copyright Directive. Thanks to all the creators who spoke up about… Watch the @smithsonian highlight all the women who have shaped science from past to present in this #YouTubeLearning playlist! → https://t.co/1gB9u1pCg1 https://t.co/U6wWuIW1LU Waffles, waffles, more waffles. \n\nWatch our #InternationalWaffleDay playlist. → https://t.co/d2meZpiNlg https://t.co/1b4CjdkwOk We need all the tacos. 🙌🌮 #CreatorOnTheRise @Recipe_Tin's has delicious recipes for days. → https://t.co/EaHe3VficW https://t.co/jnv42bjORR Look at these little guys go. 😭Needless to say, we'll be watching this #NationalPuppyDay playlist all day long. → https://t.co/VvWAonu7rV https://t.co/ePZfrzEju6 Dress up, but make it fashion. Watch @formichetti glam out @summermckeen. → https://t.co/gOj0rYaaxK https://t.co/BPQHX7POPn RT @YouTubeTV: The games continue today and we're still here to be your partner in crime. 🕵️‍♂️\n\nTell us what you need to get out of and we… @karliekloss @emmachamberlain That was the ride of a lifetime. 😂🙌 RT @YouTubeGaming: .@markiplier gets personal in this Autocomplete Interview with @Wired.\n\nWatch him talk about his life, channel, and char… #StepUpSeries Season 2 is finally here with better dance, better music, and even more drama. Catch @NayaRivera  @JadeChynoweth @NeYoCompound @ashleymgreene in the new season now 👉https://t.co/jzqhdxOV8k https://t.co/juuc37bpj9 RT @YouTubeTV: Today is all about ball. 🏀 \n\nNeed to get out of a meeting, an appointment, a date or anything else so you can watch the game… .@johngreen of Vlogbrothers sat down with the one and only, @michelleobama. For advice on relationships and more watch their interview. → https://t.co/xCEtIp5MSe https://t.co/NMX7VJwfqg RT @YTCreators: Most people watch YouTube with the sound on. That’s why @hankgreen thinks YouTube is a great platform for Stories— because… The more ya know. 🍍Watch @emmymadeinjapan put the pull apart pineapple method to the test. → https://t.co/KSJIE223S6 https://t.co/xYlSS8H8NP Celebrate all the women who have changed the workforce over the years with this #YouTubeLearning playlist. → https://t.co/F0zvQHTdHl https://t.co/8JYqUStIZf RT @YouTubeGaming: This cake by @BingingWBabish is a triumph. We're making a note here: huge success.\n\nWatch him re-create the famous treat… RT @youtubemusic: Winter is *finally* over. What was the Song of the Winter? Help us decide: check out the playlist, fill out your bracket,… RT @MichelleObama: Recently I sat down with some of @Youtube’s #BookTubers and creators to talk all things #IAmBecoming. We covered everyth… RT @YTCreators: It's here! In a YouTube Original special, \"#BookTube: A Discussion with @MichelleObama” creators @arielbissett, @chescaleig… If only they could all be as cute as Lucas the Spider! → https://t.co/ZXW3NuJALW https://t.co/ztUol230XL Our hearts are broken over today’s terrible tragedy in New Zealand. Please know we are working vigilantly to remove any violent footage. Pie, pie and more pie!\n\nWe've got a #PiDay celebration playlist for ya. → https://t.co/h0ZPy8cHuz https://t.co/zGkYny5XEX Math's favorite number: Pi. \n\nLearn a little more about #PiDay in this #YouTubeLearning playlist. → https://t.co/d7rqmAmInt https://t.co/3KoNJSAFu1 @tanfrance No one does it as well as you. 😉 Brb watching @tanfrance's tutorial. 💇‍♂️\n\nFor his signature hair and more subscribe to his brand-new channel! → https://t.co/LSjZ8h86JL https://t.co/7Rv7hfAgha RT @youtubemusic: Welcome to YouTube Music Premium 👋\n\n🇮🇳India 🇿🇦South Africa 🇦🇷Argentina 🇨🇷Costa Rica 🇪🇨Ecuador 🇩🇴Dominican Republic 🇬🇹Guat… @tanfrance Here for all of this! 🙌 Watch @emmachamberlain get the full @LouisVuitton glam experience for Paris Fashion Week → https://t.co/dfL0RaTE8W https://t.co/bbzoveWZuM Watch @imdrewscott give DIY tips on turning everyday thrift finds into unique looks! 😎 → https://t.co/sFqMWYWM5s https://t.co/DGw6eImdtA RT @hitRECordJoe: .@Logic301, Bobby Tarantino himself, joined the @HITRECORD community &amp; made a new song w/ the help of complete strangers… RT @googleafrica: We were born to be superstars, CEOs...\" - @tenientertainer. ICYM, watch Teni, @muthoniDQ @symplysimi @lady_zamar @shekhin… Need some clean eating inspo for the week? @TishWonders has got you covered. \n\nHead over to her channel for simple weekday recipes! → https://t.co/qVIEioBuaZ https://t.co/73mSd29A2u We're not crying, you're crying! 😭\n\nWatch this little guy's story via @dodo. → https://t.co/4JrtF1hQnM https://t.co/NLro2hnivR Would we eat this stuff? No. \nWould we watch the @jonasbrothers do it? 100%\n\nWatch at your own risk. 😂@latelateshow → https://t.co/zNU5H7g0jF https://t.co/w6k5wWkSqj The women of YouTube have taught us strength, self-confidence, resilience and more. For a little inspiration visit our channel for #IWD playlists: https://t.co/7Zyq5OVh1u https://t.co/w8oltjeWjK In honor of #IWD here are some revolutionary women sharing their wisdom with the world. \n\nCatch @priyankachopra in the trailer for our newest YouTube Original #JustOneThing with @Simone_Biles @DVF @Awkwafina  → https://t.co/SSJqQBiNuF https://t.co/RWpjNRy9VW RT @SusanWojcicki: This #IWD2019 @YouTube playlist shows some remarkable stories of courage and resilience. Truly inspiring on any day of t… RT @NikitaDragun: support your sisters\nnot just your cis-ters\nhappy #InternationalWomensDay\nto ALL women RT @YouTubeGaming: It's #InternationalWomensDay! Who are your fav women gaming creators? \n\nCheck out our playlist starring @SuzyLuGME, @Lau… This #IWD we're recognizing history's most important trailblazers!\n\nFor more about their impact watch this #YouTubeLearning playlist. → https://t.co/8QWg3IhbAu https://t.co/VkFLcumYLb In case you were wondering how that pants chair works IRL... 😂\n\nWatch @Jenna_Marbles build one. → \nhttps://t.co/tTU6rCVStP https://t.co/HJzk9bHWTp Prince William learned how to do Princess Charlotte's hair from YouTube tutorials and that's the cutest thing we've heard all day. https://t.co/ONs07SDDTW RT @CobraKaiSeries: Will you earn the title of karate champion? Show no mercy to unlock the season 2 premiere date. \n\nLet's begin with roun… This week’s #YouTubeLearning playlist covers mental health and the effects of Seasonal Affective Disorder curated by therapist, @KatiMorton. \n\nWatch the playlist now. → https://t.co/TUwWBAXG55 https://t.co/asxDLUadUc There are lots to be learned from #CreatorOnTheRise @theatlaspro!  \n\nFor all things history, geology, geography and more subscribe to his channel. → https://t.co/OPBXx6S7M0 https://t.co/T4dAgXLnCv RT @Google: From living legends to future leaders, the world is searching for “black girl magic” more than ever before. Explore more #IWD20… Who knew an orange could so be mesmerizing?! 😱\n\nWatch @kevinbparry deconstruct fruit in this oddly satisfying video. → https://t.co/PF6ixP3HSI https://t.co/4jzdbUDJYF RT @SusanWojcicki: Important Article 13 update: The latest version of the copyright directive will still hurt creators more than it helps.… @NaomiCampbell The Queen! ❤️👑 RT @YTCreators: The final Article 13 will hurt, not help, European creators. Important update why #SaveYourInternet isn’t over. \n\nFor more… Many of you have been closely following what we’re doing to protect young people on YouTube. Here’s an update on our most recent actions. → https://t.co/6315XSUfbR Thanks, @PhillyD,  for debunking the Momo Challenge and encouraging parents to flag inappropriate content to us. https://t.co/svMcqLXBQy If you see videos including harmful or dangerous challenges on YouTube, we encourage you to flag them to us immediately. These challenges are clearly against our Community Guidelines. More info here: https://t.co/H0C5tCfn5S We want to clear something up regarding the Momo Challenge: We’ve seen no recent evidence of videos promoting the Momo Challenge on YouTube. Videos encouraging harmful and dangerous challenges are against our policies. @CameraLizard @dejashu Right! #CreatorOnTheRise @dejashu documents her travels and life as a freelance videographer! \n\nFor food, travel diaries and more subscribe to her channel.  → https://t.co/oBCx2w3wnk https://t.co/chZU9WGFXO RT @youtubemusic: 🥇 @LuisFonsi + @daddy_yankee keep making history 🥇 Congratulations on SIX BILLION → https://t.co/rnqkY2ZreP https://t.co/… Still feeling the #Oscars inspiration? \n\nFind the steps you'll need to take to become a filmmaker with this #YouTubeLearning playlist. → https://t.co/x1GYmidVlh https://t.co/TX8bfioyo0 @emilydidonato1 Happy birthday ❤️ Who knew baby bats could be so cute?! 😭\n\nWatch @BBCEarth's rescue process. → https://t.co/1JcO1G5Ine https://t.co/t95duhvtVb Island Vibe Cooking is serving up delicious Caribbean food and we want it all. 🙌 #CreatorOnTheRise \n\nFor recipes and more subscribe to their channel. → https://t.co/MEMhWjZ1XO https://t.co/jvpV3Ub8AU Some of your fav #YouTubeBlack creators stepped out for a family dinner. It was a vibe! #BlackHistoryMonth https://t.co/MRSis9iLsA RT @YouTubeTV: We're two days away from #Oscars Sunday! 🎉\n\nTell us your favorite #Oscars2019 nominated movie + your zodiac sign and we'll g… @Hevesh5 @FallonTonight @jimmyfallon Always amazing! 🙌 RT @Hevesh5: we set up dominoes on @FallonTonight to celebrate @jimmyfallon hitting 20,000,000 subscribers!!!!! take a look below 👀 https:/… Congrats on the milestone, @JimmyFallon. \n\nCelebrate with @FallonTonight and watch their insane domino trick. → \nhttps://t.co/aIcEznFiSN https://t.co/R3aDLAzwdJ RT @jimmyfallon: Hey @YouTube, are you seeing what I’m seeing? 19.9 million subscribers!? Let’s push it over the edge and make history TONI… RT @youtubemusic: We're now streaming live from London on @YouTube. Watch the awards show here → https://t.co/IqeS7pkGkN #BRITs https://t.c… 🔴 Watch the #BRITs live stream hosted by @todrick NOW: https://t.co/Giu7KxVDNy https://t.co/wtJklxRzFv RT @youtubemusic: Welcome to The @BRITs 2019 live from London. Get all the action from the red carpet to the backstage on our Twitter &amp; Ins… RT @TeamYouTube: 📢 Starting Feb 25th, we’re updating the way we give Community Guidelines strikes. Here's what to expect:\n\n✅ A new, one-tim… #CreatorOnTheRise @jaazzmary has natural hair tips and tricks for days.\n\nSubscribe to her channel.  → https://t.co/3alWTy9goH https://t.co/PqGiMWeSez Last night's Victoria Beckham x YouTube Fashion and Beauty After Party at #LFW was 🔥 #VBxYT\n\nWelcome to YouTube, @victoriabeckham ❤️ https://t.co/v5bYRoO0Em https://t.co/ycMFb2mVZI An at-home spa? Nothing could go wrong. \n\nWatch @safiyajn build one herself. → https://t.co/oVzsSXoReU https://t.co/r2MvEsmjBs Smash and Grab is tale of two robots on a search for freedom. 🤖\n\nView @DisneyPixar’s #SparkShorts. → https://t.co/Nn3lImBeUS https://t.co/9sJlG56kBD EduTubers came together at the latest #YouTubeEduCon to share experiences, knowledge and inspiration this week in London. Check out our Instagram Story for a recap. #YouTubeLearning  → https://t.co/3A37lntIUs https://t.co/01zwnpim7z RT @youtubemusic: #CantJustPreach is a call to action from @JohnLegend. Listen to the song, watch the video, and consider donating directly… @CaseyNeistat Thank you for the birthday wishes! To many more! 🎉 RT @YTCreators: Happy Valentine's Day!\n\nUse #LoveNotes and post a message of appreciation for a creator who has changed your life for the b… Single? Taken? Either way, you're gonna need @iisuperwomanii's Valentine's Day dessert. → https://t.co/ZqwNa5CxrI https://t.co/vp6uoX5Bnr RT @YTCreators: V-Day is coming up! You never forget to like and subscribe—and now you can send your favorite creator a Valentine’s Day car… RT @YTCreators: ⚡ Important Article 13 update ⚡ Thanks to everyone who spoke out to #SaveYourInternet. The final text of the EU Copyright d… \"I like to create as much complexity and contradiction as possible.\" — Rashid Johnson\n\nLearn more about black influencers in the arts via this #YouTubeLearning playlist. → https://t.co/zz7h7g6pzX https://t.co/VYwedOfIZO Dating is weird. Valentine's Day is weird. And @dylanobrien thinking he will be single forever is VERY weird. \n\nWatch @JordanPeele and Charlie Sander's #WeirdCity now. → https://t.co/rTIw0WAqAv https://t.co/eogPaWGsmP You'll score Valentine's Day bonus points with these DIY gifts. \n\nWatch the #YouTubeLearning playlist now.  →  https://t.co/z2QCOgrNlr https://t.co/JzN1UZuiNe RT @SayItLoudPBS: 👋🏿👋🏿\nWe're here! @SayItLoudPBS is covers topics around African American history, culture, and context -- because black hi… RT @YTCreators: We remain concerned about #Article13 and its impact on Europe’s creator economy. There’s a lot at stake - as you can tell f… RT @StoryCorps: On 2/10/15, three Muslim students were shot and killed in Chapel Hill, NC. Our former producer @liynaanwar helped to bring… Take notes from @mayaleex3's easy morning routine. \n\nThis week's #CreatorOnTheRise is 5th-grade teacher Maya Lee. Check out her channel for easy life hacks.  → https://t.co/hZzaY78BKE https://t.co/M5RLNiEBdQ RT @rkyncl: .@YouTube agrees with artists and songwriters that transparency can benefit the whole industry and supports a copyright proposa… We're full just watching this. \n\nWatch the @tryguys eat their weight in dumplings.  → https://t.co/ZXqMk0wA6W https://t.co/GPIv9E9QPg It's so small. 😭\n\nWatch this baby koala's first time out of the pouch. → https://t.co/hNH4bNKzne https://t.co/zOSvpWdYBS 3 hours deep into \"do dogs have feelings\" YouTube https://t.co/W4BVFfDCh2 RT @youtubemusic: Live from Pleasant Park, it’s @marshmellomusic featuring @bastilledan 🔊 Play now on the new YouTube Music app → https://t… RT @YTCreators: 🚨There's a new version of Article 13 that will likely be approved next week\n\n🚨 It will still have unintended consequences &amp;… How much sleep do you really need? 😴 Let science answer that one. → \nhttps://t.co/mHzbHpFVTF https://t.co/zgtzBM5Ibz The collab we didn't know we needed. 🙌\n\nWatch @mrkatedotcom decorate @jamescharles' house. → https://t.co/it9n7kYquX https://t.co/QbQhHQEG79 🔴 LIVE: Watch the Democratic response to the #SOTU → https://t.co/df1DMZYJcB https://t.co/KagGWmL7nn 🔴 LIVE: President Trump delivers #SOTU to Congress: https://t.co/LxonvWLmjv https://t.co/zMGZ4WfWt7 @ColleenB123 ❤️❤️❤️ RT @SusanWojcicki: 2018 was a year of growth… and growing up.  Reflecting on this past year and sharing our priorities for supporting @YouT… It's the #YearOfThePig\n\nHere are 8 things to know about Chinese New Year. → https://t.co/zk7ysToHsE https://t.co/0i8ngEZ2zy This #SaferInternetDay, take the time to create the right online experience for your family. Built specifically for kids, YouTube Kids is a space for them to explore… with a host of parental controls to guide them.\n\nDownload the YouTube Kids app here: https://t.co/MpcQdQmA0T https://t.co/7hmkQxd6za Live coverage of President Trump’s State Of The Union Address will begin today at 9pm ET: https://t.co/LxonvWtLrX https://t.co/7qDZZX0q6y Purl's just a ball of yarn making her way through the corporate world one thread at a time. View @DisneyPixar's #SparkShorts. → https://t.co/E53xgib6CG https://t.co/iBCyXMYLo6 So. Many. Pups. → https://t.co/lxYbUE2T2a https://t.co/XSARc8tVpM RT @YouTubeTV: 90 seconds remaining! Anything can happen. \n\nCatch the action: https://t.co/AAt4okeRHM RT @YouTubeTV: Party Pro Tip #1: Let us be your wingman. No seriously, we'll literally be there with while you stuff your face with chicken… You've got your wings. 🍗 You've got your lucky jersey. 👕 Time to get YouTube TV. 📺\n \nWatch the Big Game TODAY with YouTube TV. https://t.co/eiAKW4Ty2f https://t.co/jthGrP9blW What's the Big Game without some snacks? Check out our #YouTubeLearning playlist for recipes to inspire you —&gt; https://t.co/r7vzfAWHBM https://t.co/ItqLBKpHLx Hyped for the Big Game? Get your game face ready for Sunday with this #AdBlitz playlist --&gt; https://t.co/eTe6KHOHrm https://t.co/mT9JnWDYQB We’re celebrating #BlackHistoryMonth by spotlighting amazingly talented #YouTubeBlack creators like the incredible @AkilahObviously. Who do you think will #CreateBlackHistory? https://t.co/WJv1CNphY7 RT @YouTubeTV: No cable? No problem. You can still watch the Big Game with YouTube TV.  \n\nNow available nationwide. 🎉 https://t.co/AAt4okeR… RT @YTAdvertisers: We’re celebrating all of this year’s game day ads and some of our old favorites with #AdBlitz. Watch your favorites, dis… RT @RollingStone: YouTube is aiming to bring suspense back to music videos with a new premiere feature https://t.co/cVc867ui2s https://t.co… It's amazing what you can do with a glue gun.\n\nWhether you're looking to up your home decor game or you're looking for something to do indoors away from cold weather, check out these DIY ideas → https://t.co/SD8GD6n7OR https://t.co/BCtB6XU4YK Here's some hot cocoa for all of those who are experiencing chilly, sub-Arctic weather -- and for all of those who aren't, because hot cocoa is always 👌→ https://t.co/pAvtj0EOEW https://t.co/L0aYRvOPc7 RT @youtubemusic: Shout\nOut to our\nNew friends\nOver at\n@Sonos. \nhttps://t.co/yDGY0BLNI5 https://t.co/hTW4D66zqY Everyone's favorite least watched show. Ryan Hansen Solves Crimes on Television* Season 2 is now available with YouTube Premium. #RHSolvesCrime \n\nWatch here → https://t.co/uJFfdp0VCs https://t.co/Z4NlJMw3d4 This @BBCEarth shows how humpback whales are coming back with style → https://t.co/B0VaBxRWEN https://t.co/2fNicZgbbY Self-discovery and self-expression -- @JadeShamraeff and #IrregularLabs partnered with @gucci's @chimeforchange campaign to bring you #TheFutureIsFluid. \n\nThis short film about gender debuted at Sundance and is out now exclusively on YouTube --&gt; https://t.co/hdZfeuG4AB https://t.co/pFc0LGVKib Here's an adorable beagle playing in the snow, just because → https://t.co/53NRTRpsgm https://t.co/3dvWChbthv RT @YouTubeGaming: We always knew Ocarina of Time was a masterpiece, but this video from @JavedLSterritt takes it to a whole new level.\n\nWa… Shake off the Sunday blues with this video of two adorable kittens becoming best buds from @ColeTheBlackCat → https://t.co/5taOp3RW9o https://t.co/vHyjHxBu3C If you're looking to relax this Saturday, try this honey cheesecake. It's the bee's knees → https://t.co/UPad1vCCW9 https://t.co/6MguQbRF3y Did you spot the hidden lyrics?\n\nHere's how @doddleoddle secretly prepared a music video over several months → https://t.co/u5r8LmEPC3 https://t.co/X0SrPxgnO1 Need help sticking to your New Year's resolution to be tidier? Watch this #YouTubeLearning playlist on how to declutter your life —&gt; https://t.co/GOQEMw6ee3 https://t.co/ucrCNkdePo RT @chrisdmytriw1: Better than what's on tv. #YouTubeIn5Words Internet, you did it -- @GordonRamsay is on @firstwefeast's #HotOnes 🔥🔥🔥\n\nWatch @seanseaevans kick off Season 8 here → https://t.co/3froeKYB7m https://t.co/YbVRnGsMZS RT @StepUpSeries: They only have one shot to get on top. The #StepUpSeries squad return to the grind March 20th for the Season 2 premiere.… RT @YouTubeGaming: [LIVE] 🔴 Tune in now to find out what @DeepMindAI and @Blizzard_Ent have been up to → https://t.co/XOOnQkcJFA https://t.… They say you eat with your eyes, so here's some tasteful art in honor of #NationalPieDay→ https://t.co/5WNZGFr8pb https://t.co/cgLsba4pmJ RT @YTCreators: Creator @DoralysBritto stopped by YouTube's office in LA today!\n\nFor lifestyle and beauty videos from Doralys, check out he… RT @YouTubeTV: From Bozeman to Gainesville, Anchorage to Yuma, Erie to Topeka and so much more. Starting today, YouTube TV is going nationw… RT @SusanWojcicki: Great read about many of the creators who are shining a light on accessibility through their @YouTube videos: https://t.… That moment when you use your spot at the #AusOpen to plug your YouTube channel 😂 \n\nCongrats to @StefTsitsipas and good luck in the semi-finals! https://t.co/VwOpYZGvLY This #MLKDay, we honor Dr. Martin Luther King, Jr. and reflect on his many words of wisdom. His legacy continues to inspire us all. \n\nLearn more about his remarkable life in this video from @HISTORY: https://t.co/amku3Lcb2P https://t.co/LB1Ah488hQ This little hamster is a-mazing. --&gt; https://t.co/NaQVZTYOw8 https://t.co/rf2e55FK6E This guitar made from colored pencils is weekend project goals: https://t.co/opWV3586uT https://t.co/65D1NYU23W @JeffreeStar @shanedawson What's that saying about too much of a good thing? Sorry you had trouble with the video! We're so glad to see it was fixed. You've had a long week. You deserve a burrito. A giant burrito: https://t.co/3BCf4Xyi4n https://t.co/sYN2LHm7q3 Years of blood, sweat, and tears have led to this -- and @bts_twt is just getting started.  \n\n#BurnTheStageTheMovie is out now on YouTube Premium! Watch here → https://t.co/HfNMcrn9dt https://t.co/nfOUEpzrAi RT @Senficon: My favourite coverage of #Article13 this week: What @MileyCyrus’  birthday tweet to her hubby has to do with EU’s upcoming #C… People asked us what YouTube would look like if Article 13 gets implemented in the wrong way. \n\nSo we mocked this up...\n\nDoes it scare you too? If so, click here to #SaveYourInternet → https://t.co/UzaIKzKpj1 https://t.co/obaNTfKlQD @kandeejohnson Thanks for inspiring us with your story! ❤️ Thanks for coming by to visit us, @Globies! \n\nCheck out more of the Harlem Globetrotters' videos here → https://t.co/qLSLO4hU8M https://t.co/1dPrFMSxqw With their family of friends and each other for support, @bts_twt never walks alone on their way to the top. 💜 \n\nWe're counting down to #BurnTheStageTheMovie on Friday. Set a reminder to tune in for a 5-minute sneak peek → https://t.co/IXu6bdJBxY https://t.co/3XjUfFg1qb For your heartwarming moment of the day, here's Jason Momoa visiting his family in Iowa ❤️→ https://t.co/4a63f0Yx5Q https://t.co/8PT3QOouBQ RT @YouTubeTV: Last night we got a preview of @RENTonFOX at @YouTubeSpaceLA and it's going to be INCREDIBLE. If you need us, we'll be doing… “Do we need to protect Wayne from the world, or do we need to protect the world from Wayne?”\n\nFrom the writers of Deadpool, #ThisIsWayne is here. Watch now with YouTube Premium → https://t.co/Dy6b9EwA3W https://t.co/HSp6k3XSEN RT @hankgreen: To all of my extremely talented YouTube friends...It's ok to put out a video that isn't better than your last one. If you ke… It all boils down to this: @patrickstarrr shows us how to look like a world record-holding egg ✨🥚✨→ https://t.co/5PPn6tHyYM https://t.co/HQMh0fCJ6x RT @TeamYouTube: Heads up! Your feedback helped us identify 3 areas of our Community Guidelines where we can clarify policies &amp; strengthen… It’s official -- #BurnTheStageTheMovie is coming to YouTube Premium! 💜💜💜\n\nJoin @bts_twt on their journey this Friday. https://t.co/mooHcUBDgc RT @Globies: Next stop: @YouTube! Fun day in the Bay! https://t.co/SFs5797ngH RT @TeamYouTube: Rolling out this week on the YouTube iOS app (for 6S phones &amp; above)!\n\nFrom your video player:\n👈Swipe left for the next vi… It’s #NationalDressUpYourPetDay and @AaronsAnimals is dressing his cats for success: https://t.co/8tR3TlTt34 https://t.co/QCRaxN1ZJV 💜 https://t.co/AXfYlSfChC How was braille invented? \n\nFind out the whole story in this video from @TodayIFoundOut1 → https://t.co/q0YbpiMYkg https://t.co/lNwESgAQtL Reposting this baby meerkat video because it's Friday and you deserve it: https://t.co/J7H4GGEsZE. https://t.co/4eR8JHU967 What makes a fine cup of coffee? This #YouTubeLearning playlist goes from bean to brew. \n\nWatch creators like @SciShow, @AsapSCIENCE, and @HTMEverything here —&gt; https://t.co/YO11r6JLcu https://t.co/2nMJcj6bIY @SubTheGamer @Google @TeamYouTube @YouTubeGaming @YTCreators We'd love to have you and your wife for lunch at YouTube HQ if you're still available! @YTCreators just sent you a DM to discuss details. When it's the second week of January and you've already broken your New Year's resolution: https://t.co/0kjRjWqHr3. https://t.co/WzgrVIWVpq RT @YTCreators: UPDATE: Lawmakers in the European Union are meeting again on January 21 to try to finalize the text of Article 13. Thank yo… STEP ONE: Make an ordinary wheel of pecorino cheese\nSTEP TWO: Infest it with live maggots\nSTEP THREE: ???\n\nGather round and hear the tale of Casu Marzu, the World's Most Dangerous Cheese: https://t.co/fMwkL3gmYC. https://t.co/7HYpLu59OS Did someone say a new anthology from @JordanPeele and Charlie Sanders? Yes, please! \n\nThe trailer for our new YouTube Original @WeirdCityShow is out now. Check it out here → https://t.co/tYfFGgAWh9 #WeirdCity https://t.co/9E4KrOtMjF RT @TeamYouTube: And YouTube is back! Thanks for your patience while we worked to fix it. https://t.co/fyO7zaWBpe RT @TeamYouTube: If YouTube isn't loading for you or you're seeing error messages on the site – we're on it! More updates to follow. Celeste Godinez is a powerlifter who has already broken 18 records for her weight class. She is 10 years old. https://t.co/Wy1Reunyqh https://t.co/DXJs8EhDbJ RT @StepUpSeries: New Year, New Season 🙌Season 2 is about to be 🔥🔥\nCatch the full video here: https://t.co/s3y6BZUnED https://t.co/0VATfA6q… That time some polar bears decided to play football with a spy camera: https://t.co/RPyFeXQPwK. https://t.co/FShEf1BxFi RT @youtubemusic: 🙌 We’ll be livestreaming BOTH weekends of @coachella this year. Start prepping now 🎡 Check the official playlist now on t… Happy #NationalSpaghettiDay! @PastaGrannies is a channel where real Italian grandmothers teach the secrets of homemade pasta, like this delicious spaghetti carbonara: https://t.co/r0EnJa80bR. https://t.co/3ZhHjgwCZy Thank you, Eiji, for your smile and inspiration. Rest in peace. https://t.co/c11iYbuZER New year, new tech! @MKBHD explains what he's looking forward to in 2019: https://t.co/8OFYGYGiEN. https://t.co/5FZb4enEh0 Here is a video of a penguin protecting a group of baby penguins, in case you need it: https://t.co/gEAmBGQvkY. https://t.co/LQts68J2mc Happy New Year! Start 2019 off right with @blogilates' fitness playlist for #YouTubeLearning: https://t.co/Mwm5SHwOsN. https://t.co/R7E0sa3QLj 🎇🥂 We’re ready. Celebrate #NewYearsEve with @zane, @glamlifeguru, @poppy, @mrkatedotcom &amp; @joeyzehr! https://t.co/DCwAWonGx0 https://t.co/L5Y93TX21k There's no place like home. But then, there's also no place like these homes: https://t.co/LYdaztLxqe. https://t.co/QXcBtqRopX The @OregonZoo released their 2018 Year in Review, and we're going to be watching it on loop until 2019: https://t.co/7WKPTlqdut. https://t.co/H5tlEJjlRi RT @Hevesh5: Merry Christmas to all who celebrate! 🎄 Enjoy the holiday season ☺️ https://t.co/3cAuRmeRrB Our mistake–we forgot to credit @Hevesh5 for this video! Check out more of @Hevesh5's epic domino art here: https://t.co/O7it1xtd5l https://t.co/lzZwu3a692 Boxing Day mood: https://t.co/MQJrIRvgr2. https://t.co/OCGDFhkvNr That moment when everything falls into place. Merry Christmas! https://t.co/g43Ph7RMUd Make an effort this Christmas: https://t.co/ZUKMeKrVdi. https://t.co/scJPbTvkT5 Here's to making new friends this holiday season: https://t.co/h4lldUmD9r. https://t.co/d90Vrd9pTG Everything you ever needed to know about building a gingerbread house: https://t.co/wrow3og66t. https://t.co/4OyVyonGud On Christmas Eve of 1985, Juan and Wilson decided to make history by committing one of the most infamous heists in Mexico's history. Watch 'Museo' on YouTube Premium: https://t.co/tb1KDTxzzW. https://t.co/iveGUijSdx RT @brat: 🎄 HOLIDAY SPECTACULAR 🎄\n\n▶️ Premiering Now: https://t.co/lrzsjzxFuT https://t.co/tlHVkD8MPD Surprise surprise! #DangerousWomanDiaries merch is here. Tweet ‘#DangerousWomanDiaries + 🌈☁️’ to get yours https://t.co/kzUTIcBZjq RT @YTCreators: Creator @LuisitoComunica asks YouTube's Chief Product Officer @NealMohan his toughest questions yet→https://t.co/GR8FwrcC8I… RT @youtubemusic: 👑 @jlo has returned with #Limitless, her music video directorial debut 🙌 Play now on the new YouTube Music app → https://… All episodes of #DangerousWomanDiaries are finally out 🙌🙌and let's be honest the rest of the day is a wash since we'll be bingeing all day. Catch the final episode here: https://t.co/oebPuNyCJz and check back tomorrow for a super special surprise. https://t.co/7LfCxfLvYX RT @youtubemusic: PREMIERE: @JLo is about to drop her video for #Limitless ⏳ The countdown starts now ⌛  Join the chat + watch with us → ht… RT @youtubemusic: From @BTS_twt to @ygofficialblink to @nctsmtown_127, K-Pop won 2018 on its own terms  🔐💘  Who won it for you? 🔐💘 Play now… Pixar's full short film, \"Bao,\" is now on YouTube: https://t.co/IMQyI1mJvI. \n\nWatch it again and cry! \n\n...again. https://t.co/W2GhGiPode \"I guess I'll learn to be a regular human woman.\" Watch Overthinking with Kat and June, available now on YouTube Premium: https://t.co/BSiggz4WRE. https://t.co/R5f51DQOKW @VeliaBlues Next year! Us when we look around YouTube every day: https://t.co/ToHhDZ0Rwp. https://t.co/htRf6Ud6Ph Some facts about this playlist full of facts about the history of chocolate: https://t.co/FK3X3EfIV3\n\n1) It's this week's featured #YouTubeLearning playlist\n\n2) It will give you something to talk about with your family over the holidays https://t.co/7scwSHJ6b3 RT @lucyhale: I had so much fun shooting Ryan Hansen Solves Crimes on Television* Season 2. Check out the full trailer here https://t.co/Ku… RT @youtubemusic: 🚨 Attention Walkers: the debut album Different World by @IAmAlanWalker has arrived. Play now on the new YouTube Music app… Thanks to everyone who participated in India's first #YouTubeEduCon today! We're celebrating the creators who help millions across the globe learn something new every day. Check out @YouTubeIndia for more quotes and photos from the event. #YouTubeLearning https://t.co/74b19Mw5VI Yes, this is a Dr. Who-themed Yule Log video.\n\nYes, your holiday party needs this: https://t.co/nPE4SHMOKM. https://t.co/qUXtDjPPCv \"It's too late for our loved ones. But it's not too late for yours.\"\n\n18 months on from the Grenfell tower fire that killed 72 people in central London, survivors, celebrities, and bereaved families have come together in an appeal for change: https://t.co/9V79X2Rncr. https://t.co/o0vhk8qPyt Happy #NationalMonkeyDay! Spider monkeys got their name from the prehensile tails they use to swing from tree to tree, giving them the appearance of a many-legged spider.🐒\n\nLearn more facts about monkeys in our new playlist from #YouTubeLearning: https://t.co/wDOXp0HHF0. https://t.co/cV8rYCxNVz RT @youtubemusic: 🖤 #imagine is here 🖤 @arianagrande 🖤 Play now on the new YouTube Music app → https://t.co/7TRi2OCEsq https://t.co/dI0KGhP… On Christmas Eve 1985, two students made history by committing the theft of the century. #MuseoTheFilm: Coming December 19th on YouTube Premium. https://t.co/R18sFwROwR https://t.co/uSMa0D94Zs RT @ArianaGrande: episode three: grateful #dangerouswomandiaries is live now @youtube @alfredoflores https://t.co/dAjexE6Y7C enjoy Thanks to the creators that took part in Rewind, and the community that responded. We hear what you're saying, and we want to make next year better for all of you. Watch this space! New record!! Oh...wait. https://t.co/hgmHkV8tK5 RT @youtubemusic: GLOBAL 📈 CHARTS 📈 ARE 📈 HERE 💥 See who’s climbing our Top 100 Music Videos Global playlist this week on the new YouTube M… @JimmyButler Welcome! \"I thought I was going to see the Colosseum.\"\n\n@JimmyButler goes to gladiator school: https://t.co/6wlyzZL5EZ. https://t.co/F2oOlu56Ka Some things don't change that much. \n\n90 Years of Christmas in New York: https://t.co/lvXr064qft. https://t.co/QpWx0Q76ZO #Priorities. Catch @AdamPally and @SamRichardson in our new YouTube Original series #ChampaignILL, out now. Watch it here:  https://t.co/VVg4PZUjt8. https://t.co/L5mYwbe6Es RT @youtubemusic: .@NigelSylvester just released GO - Miami, the 6th installment from his adventure film series. Follow his journey around… Congratulations to @daddy_yankee on an incredible year! #YouTubeRewind \n\nWatch his most recent video, \"Adictiva,\" here: https://t.co/dz2N957Iem https://t.co/FrlzIpTpYq @MassFolds @suckmytears Happy birthday! December birthdays: we see you. https://t.co/1FRSwBpvF1 https://t.co/qQasShGWnV .@YouTube will be live on the red carpet at this year’s @BFC #FashionAwards in partnership with @swarovski. Join us at 5:30pm GMT on Monday, 10th December. Set your reminder now → https://t.co/rs9ieylClS https://t.co/pNRfc8kfG9 Mastanamma was 105 when she started her YouTube channel. By the time she died, she had over a million subscribers and had become the world's oldest celebrity chef. Her legacy lives on: https://t.co/PyvaEWjI5R. Hey Arianators! If you're in NYC or LA, we have a special treat for you. Head to https://t.co/YwVBCzyQ7V on your phone to check it out. Share what you find using #DangerousWomanDiaries and don't forget, Episode 2 is out now: https://t.co/0VWWeiFwJg. Thank you, Mastanamma, for sharing your recipes and wisdom with the world. https://t.co/JHEYuGMYwt @TrueCzechCloud @rkyncl It really is important that you keep spreading the word! Make a video about Article 13 and tweet it with the hashtag #SaveYourInternet. Get a behind the scenes look at our new YouTube Original #ChampaignILL starring @AdamPally and @SamRichardson. All episodes streaming on 12/12. Watch the full video here: https://t.co/SMHUEoSC4l https://t.co/W6qzFXLNO1 1) @NatGeo has a new YouTube show called \"Untamed.\"\n\n2) This episode is called \"Hummingbird Battleground.\" \n\n3) It is a MOOD. https://t.co/FSOYkgPlKt https://t.co/WPQsXUOJb7 RT @rkyncl: Growing up behind the Iron Curtain in Czechoslovakia where access to information was limited, I feel strongly that we must prot… We let the creators drive this year's #YouTubeRewind. Here's what happened: https://t.co/r7XpCWRugk https://t.co/zTpKtbH4G7 .@ArianaGrande is our forever mood 🖤. #DangerousWomanDiaries Episode 2 out now. Link here: https://t.co/0VWWeiFwJg. https://t.co/tDBIGKKbmX #YouTubeRewind is here! \n\nSee the people, music, and moments that defined 2018 on YouTube: https://t.co/r7XpCWRugk. https://t.co/YncuFmaeNt RT @tryguys: them: \"So for this year's #YouTubeRewind you're going to be dressed as goofy 1920s waiters in @MollyBOfficial's dog's dream 🐶… RT @NikkieTutorials: #YoutubeRewind 🤭❤️ have you spotted me? (freaking out that I’m in the thumbnail!!!!!!) @YouTube https://t.co/rhQ1znJAFP RT @millselle: hey 2016 elle working her ass off to get 1000 subscribers\n\nkeep at it\n\ni think you’re gonna be very happy with the results #… Thank you to all the creators, artists, and fans who made 2018 their own. This is your Rewind: https://t.co/r7XpCWRugk. #YouTubeRewind https://t.co/Sd3zhuO8j4 It's almost time...\n\n#YouTubeRewind drops at 10am PST TODAY at this link: https://t.co/PuZvz15aWX. https://t.co/vKFEaOsMbh RT @CBSThisMorning: NEW: @YouTube has unveiled the top trending videos of 2018 and two of the top five videos are tear-jerkers. \n\nYouTube's… You've made it halfway through this week. \nYou've made it almost all the way through this year. \nYou've earned this baby koala video: https://t.co/HqrvUugzDu https://t.co/nfmoBptNCS There are 2 kinds of people: people who think computers are cool, and people who are wrong. Watch this playlist to see how wrong: https://t.co/255ZpN4q8N. #CSEDWeek #YouTubeLearning @codeorg @tedx @dominicwalliman @NatAndFriends @thecrashcourse @ELICOMPUTERGUY @majorprep1 https://t.co/5j2EkZwPkH \"Here's to all of the women who stood up for themselves in 2018.\" @Wengie is ready for #YouTubeRewind. Are you? \n\nWatch the trailer here: https://t.co/wfKXUQVwHJ. https://t.co/xkEDwuohF7 RT @YTAdvertisers: Last call! In 12 hours, you’ll find out who will be taking home the Ws for #TheYouTubeAd of the Year. Until then, keep v… RT @THELOVEMAGAZINE: Here's a teaser for our new video series #movingLOVE, (ft. @Caradelevingne, @KateMossAgency, @bellahadid). It all kick… @LumFog IT'S A THING. 🍪 Happy #NationalCookieDay! \n\nCheck out our playlist of the best holiday cookie recipes on the new #YouTubeLearning channel: https://t.co/ejGRfMT3Da. https://t.co/uH5434F4sZ Happy #Hanukkah ! Learn more about the history of Hanukkah and other winter holidays in our new playlist curated by #YouTubeLearning: https://t.co/Ls7WmCmOSP. https://t.co/W6p7YppTYD RT @TeamYouTube: Coming to Android &amp; iOS over the next few weeks... Autoplay on Home!\n\nPreview a video while you scroll or watch the whole… RT @YouTubeTV: It's an honor to be the Fan Favorite, @GooglePlay! Thanks to all the TV lovers for making us one of the Best Apps of 2018! #… It’s almost time to hit Rewind. #RewindisComing December 6th, 2018. https://t.co/wfKXUQVwHJ https://t.co/zERRrQgErw Which #YouTubeGiving charity did you support? RT @MSF_USA: @YouTube Check out @jubileemedia's latest episode, they're fundraising for us @MSF_USA for #YouTubeGiving https://t.co/Xkx2Ajw… Thread! There's still time to support our 5 featured #YouTubeGiving charities—click the \"donate\" button to the right of each video to make a difference in someone's life. https://t.co/P2gES1R1ea RT @YTAdvertisers: From tears to cheers – they gave us all the feels. Vote now for #TheYouTubeAd of 2018, in partnership with @TheWebbyAwar… RT @youtubemusic: Who else can't wait for @arianagrande to drop thank u, next? the countdown starts now, watch + chat with us → https://t.c… Mental health matters.\n\nWatch @RachhLoves's video and click the \"donate\" button on the right to make a donation to the Brain and Behavior Research Foundation: https://t.co/Eo9uOIzAI0. #YouTubeGiving https://t.co/aqnJ5C79PY Welcome to YouTube, @NaomiCampbell! https://t.co/7vhZkU47Yb https://t.co/BaUN0ZiC5J Dr. Shilpa Bhatte knew how to prevent blindness in poor children. The hard part was reaching them. Watch her story and click the \"donate\" button in the sidebar to make a donation to Doctors Without Borders: https://t.co/rO1Re7TfeV. #YouTubeGiving https://t.co/4rdAh23SIn RT @YTCreators: WATCH: #CreatorsForChange Ambassador @Jouelzy sat down with YouTube Director of Content Partnerships @MDucard to talk about… RT @YouTubeInsider: European creators sat down for a roundtable discussion about Article 13's unintended consequences. Here’s what @gugliel… TFW you know #DangerousWomanDiaries is finally out💃💃. Watch now: https://t.co/2wsiX86DEl. https://t.co/3GlY8NNn3m RT @TeamYouTube: As many of us enter the busy holiday season, it's important to keep health &amp; digital wellbeing top of mind.\n\nCheck out thi… Help @marshmellomusic help 🐶🐩🐕! \n\nClick the \"donate\" button to the right of his video to make a donation to @HopeForPaws animal rescue: https://t.co/1KblgsK4Z9. #YouTubeGiving https://t.co/pvYaCyUzgD RT @SusanWojcicki: Nobel Peace Laureate Kailash Satyarthi has spent his life working tirelessly to end child slavery.  Today, we are proud… The Price of Free tells the inspiring story of Kailash Satyarthi's journey to liberate every child from slavery. Click the \"donate\" button to the right of the video to support his work: https://t.co/j2TpEuv1q2. #YouTubeGiving #GivingTuesday https://t.co/lwMmmYoQWw Anyone else feeling a little dangerous? #DangerousWomanDiaries 11/29 https://t.co/3LXJXLAjqL RT @youtubemusic: 👏STU 👏DENT 👏 DIS👏COUNT👏 Students can now subscribe to YouTube Music for $4.99/month. Screen-off, ad-free, background list… Now students can access ad-free videos, our new music streaming service, @YouTubeMusic, and a library of YouTube Originals for only $5.99/month! Introducing the YouTube Premium student plan: https://t.co/JvqQxYQwGI. https://t.co/27iYYamObP #DangerousWomanDiaries https://t.co/kDRJpQCXDX Chef May wasn’t born one of the most beloved chefs in Manchester. She became one watching YouTube. Learn to cook authentic Thai food at https://t.co/4LzUNDlUE6. #YouTubeLearning https://t.co/EOIPDnXuLD There's still time to revise how Article 13 is written, but the language could be finalized by the end of the year. Learn more: https://t.co/DbEKWdeaOK. #SaveYourInternet https://t.co/bx1gtHjXed This is what we want, what we really really want. https://t.co/08aCbfOROG RT @NoahJ456: IN TWO HOURS WE RAISED $3,035 FOR THE KIDS AT ST. JUDE CHILDREN'S HOSPITAL!\n\nYOU GUYS ARE NUTS. \n\nThis is what the holiday se… RT @MatPatGT: I'm doing WHAT today?! Come donate during our massive Charity Livestream starting at 12pm PT, help hit our goals and you get… 🔴 LIVE: Watch from mission control as @NASAInSight lands on Mars. https://t.co/Xp34xEUEC9 #MarsLanding https://t.co/INahigNgh0 After Thanksgiving comes...#YouTubeGiving. \n\nIt's #GivingWeek, and our biggest creators are using YouTube Giving to raise money for charity. Help @rhettandlink raise money for @StJude by clicking the \"donate\" button to the right of their videos: https://t.co/tgpLe0z6tI. https://t.co/ynedbrrgbc We believe there's a better way with a partnership between rights holders and platforms. Learn more at https://t.co/inSBdDO4Bo. https://t.co/8wo8Qgbrwj Happy #BlackFriday! If you search \"Brick Friday\" and click on the ad, you can watch the entire first Lego Movie for free, only on YouTube. #BrickFriday https://t.co/LHkX34deo1 To everyone searching \"How to carve a turkey\" on YouTube right now: you've got this. https://t.co/bOvvL0LSR5 #HappyThanksgiving2018 https://t.co/AumawNABcx @InfinBoi We're asking everyone to make videos explaining Article 13, and to post about Article 13 on their social handles with the hashtag #SaveYourInternet. @dimmadomesdale A lot is still unknown about how Brexit will unfold. Until it takes effect, the UK will continue to be bound by EU law. If Article 13 passes before Brexit, the UK will have it too. If it passes after, it will still have an indirect impact. There's still time to revise how Article 13 is written, but the language could be finalized by the end of the year. Learn more: https://t.co/DbEKWdvMdk. #SaveYourInternet https://t.co/y4odw46MvW We support the goals of Article 13. But Article 13 could have unintended consequences that could change the internet. There's a better way. https://t.co/DbEKWdvMdk https://t.co/5ZXiP0GsUx RT @TheGigiGorgeous: Transgender Day of Remembrance was started in 1999 by advocate Gwendolyn Ann Smith to honor the memory of Rita Hester,… RT @youtubemusic: What does Article 13 mean for artists and the music industry? Lyor Cohen, Global Head of Music at @YouTube, lays out the… RT @YTCreators: ⚡️ “What is Article 13?”\nWe explain more here ⬇️ #SaveYourInternet \nhttps://t.co/y6vB2pmV0Z \"If you run around righting wrongs all your life...that'll be your life.\" \n\n#ThisIsWayne arrives January 2019. It's from the people who wrote Deadpool. You should watch the  trailer: https://t.co/ATnjzp0gP7. https://t.co/KsHM67ptEN We can't make Thanksgiving with your family less awkward. But we can make dinner pretty amazing with this cooking playlist from @bonappetit: https://t.co/4kUMDGUHlt. #YouTubeLearning https://t.co/Jn296VHnN7 RT @YouTube: Imagine if you couldn’t watch the videos you love. We support copyright reform with an Article 13 that works for everyone. Lea… For more information about Article 13: https://t.co/DbEKWdvMdk Imagine if you couldn’t watch the videos you love. We support copyright reform with an Article 13 that works for everyone. Learn more about Article 13: https://t.co/E1u4WyFCKr.  #SaveYourInternet https://t.co/wwR7na57L8 Convention? More like epic grown-up science fair 🧪🥼🚀 #ThinkerCon x #YouTubeLearning brought out the best in our #EduTubers this weekend with a packed schedule of learning, teaching, and fun! Get a peek behind-the-scenes on our Instagram stories: https://t.co/BlzORyUXJk https://t.co/rURMU1i54k #CreatorsForChange visited the @UN for #ToleranceDay! \n\nThey brought their to-do list with them so they wouldn't forget anything. \n\nWatch their work here: https://t.co/YcWdrEgYTk. https://t.co/rFNXJBW10Z RT @TeamYouTube: Soon is NOW! \n\nIn case you missed it earlier this week, YouTube VR is now available on Oculus Go!\n\nHead to the Oculus Stor… Creativity is solving problems the way you'd like them to be solved. What will you create? https://t.co/d6nuhBSBS7 #HourOfCode https://t.co/Kty8kM5I2W RT @YTCreators: Answers to all the questions you've been having about Article 13 → https://t.co/pn60hkHIhr #SaveYourInternet https://t.co/L… @Imnickconti516 SAME RT if you want to be friends with Lucas the Spider. 🕷 https://t.co/0iWrWJGWfc It's hard for Lucas to make friends. So he built an elaborate friend-catching device. https://t.co/kkb5z9NWmV https://t.co/qrr8irDX1o RT @youtubemusic: What happens in Vegas... ends up on our story. Tune in all. night. long. for exclusive coverage from Ritmo Global: A Cele… \"If you see any kind of abuse or exploitation of any child, anywhere, break the silence.\" \n\nThe Price of Free, coming 11/27. Watch the trailer now: https://t.co/SzdVnihWEF. https://t.co/KbXHJmpDWd RT @YTCreators: Too many for Carpool Karaoke? @JKCorden takes a 📸 with the #creatorsummit squad. https://t.co/XCqtTKflMa RT @YouTubeTV: We'll be there. This is the best! \n\n🙏🙏🙏 let there be some #Choni talk! #Riverdale https://t.co/iOgWUVYqor Never trust a clean slate. Stream all episodes of @OriginSeries now only with YouTube Premium. #LeaveEarth  https://t.co/G8EWeU8WsD. https://t.co/DjLFy9jYjY RT @YTCreators: All 😀 from 🇧🇷 and 🇲🇽 talent\n\n #CreatorSummit https://t.co/hgStucIUkK Why does it take a disaster to bring us together? Watch #Rising, an original short film from @LoveHasNo_: https://t.co/oS0ZbVyS41. https://t.co/VuODXTQ01s RT @YouTubeTV: 🚨 @Showtime is now only $7 on YouTube TV. This is not a drill.🚨\n\nThat means for only an additional $7, you can add @SHO_Sham… RT @YTCreators: ¡Hola!\nOlá! \nHello! \n\nCreators from all over Latin America have gathered for the LatAm #creatorsummit! Let the fun begin! 🎉… Cancel your #GeographyWeek plans, because @NatGeo has a playlist to cover all your geographical needs: https://t.co/ce6T2eW1wh. #YouTubeLearning https://t.co/nCKiAhLtRO RT @nealmohan: While we support the goals of article 13, the European Parliament’s current proposal will create unintended consequences tha… Happy #WorldKindnessDay! These #CreatorsForChange are using their voices to create empathy: https://t.co/BFvpXqOMRP. #MyViewCan https://t.co/pEUgASCCWr RT @TeamYouTube: Love YouTube in full screen? \n\nNow you can scroll down to Like, Comment, and Subscribe without ever having to exit full sc… RT @IISuperwomanII: brb.\nhttps://t.co/uL0RG3BNDP RT @RealAndyFancher: This Veterans Day I had the honor of working with @Google, @storycorps and @YouTube on behalf of a short-film showcasi… RT @Google: When he was 16, Andy Fancher created a @YouTube channel with a mission to preserve #VeteransVoices. Through our partnership wit… Rest in peace, Stan Lee. https://t.co/S8rdoBIdZ1 https://t.co/kPKG4L4adT Your view makes a difference. Use the hashtag #MyViewCan to tell us how you use your voice for good. https://t.co/3QQGlrS58O RT @maxthebody: As a Veteran myself I know what it’s like to face inner battles. My film, Discharge, tells this story (Watch @youtube :  ht… Take a sneak peek at @TomFelton's #OriginSeries...from space.✨💻✨ #LeaveEarth https://t.co/r3LnxD4whF RT @YTCreators: 6 myths about Article 13 and why they are false. #SaveYourInternet https://t.co/RvD8Xkl1uV RT @rkyncl: Worth reading @SusanWojcicki oped in @FT. A great description of the real and unintended consequences of certain versions of Ar… How do you make a difference? #CreatorsforChange use video to inspire empathy, build tolerance, and show people the world. https://t.co/hU6HAfHlEo. https://t.co/36ydo3xC6e Read this. It's important. https://t.co/6o9awsSj0o There are more than 21 million veterans in the United States. As we honor them, take some time to learn about the facts and history behind #VeteransDay: https://t.co/zNSAK0fCHx. https://t.co/Rkfj6BlH2C \"A veteran is someone who served. A veteran looks like me.\" Veterans discuss life after service: https://t.co/6drDb5Nm1T. #VeteransVoices https://t.co/MNq6XlCIfh \"You should honor their memory by living the life that they didn't get to live.\" Veterans tell their stories in their own words: https://t.co/a2OcKS7Ale. #VeteransVoices https://t.co/jN3zHQjM2G Happy #VeteransDay! These are our favorite videos of veterans returning home to the ones they love: https://t.co/MQekkpELKk. https://t.co/7t3ia255LB @tpmedia Our entire Spotlight page is devoted to #VeteransVoices right now—check it out! https://t.co/4zAyC0xEnO ⏰Yes, you need to get up early. \n\nCurrent and former members of the military show what a day in their lives is really like: https://t.co/FVB9i3UHZ2. #VeteransDay https://t.co/kQQVlq0m4z \"You feel the emotion. You get to hear, firsthand, what they experienced.\" This #VeteransDay, we're encouraging everyone to interview the veterans in their lives, because the world needs to hear more #VeteransVoices. https://t.co/aGFMOUKjon https://t.co/uXYqfHlOOl Life is stressful.\n\nHere's a cowboy cooking a steak: https://t.co/mtmLQwoXML. https://t.co/uAQrYlxMr9 RT @TeamYouTube: The YouTube app is now available on the Nintendo Switch™ system! \n\nTo watch your favorite YouTube creators &amp; videos (inclu… RT @EmmaWatson: 🌴🤡 Tom’s @OriginSeries is out on 14th November. Congrats dear friend. https://t.co/P5LzXOkKBH TFW your meal ticket runs out. #ChampaignILL comes to YouTube December 12th, starring @AdamPally, @SamRichardson, and guest starring @JayPharoah. Watch the full trailer: https://t.co/EboZDOkl2i. https://t.co/Zxs4NJYrll RT @YTCreators: From the factory floor to your mailbox, the father-son duo from @whatsinside gets a peek behind the scenes where the silver… Here's a baby sea lion who isn't afraid of anything: https://t.co/TW8Oe8uPfI. https://t.co/oYauFHS1wT Watch live results from the U.S. midterm elections: https://t.co/Y6DJG9kTYq. #ElectionNight https://t.co/ctccdHNESf RT @itsdougthepug: If u have time to like my photos u have time to VOTE https://t.co/hB4udRp0NN @CaseyNeistat ▶️💔 RT @YouTube: 🚨 Don't forget to vote! 🚨\n\nIt's #ElectionDay in the United States. Use this tool to find your polling place: https://t.co/nK1r… 🚨 Don't forget to vote! 🚨\n\nIt's #ElectionDay in the United States. Use this tool to find your polling place: https://t.co/nK1rV6rrPK. https://t.co/FsZMCzkUNy We needed to watch this: https://t.co/6xlesBR9ix.\n\nHappy #NationalDoughnutDay! https://t.co/Stx2DMHS3e Tune in to meet the stars of science at the @brkthroughprize ceremony → https://t.co/yOyPyffPRJ. https://t.co/D9ZkHhLaJj RT @lizakoshy: Voting is easier than marching. So easy, I can show you how to become a more educated voter, in less than a minute. Do ya jo… It's @IanWright0's birthday, but he's the one giving us a present. Welcome to YouTube, Wrighty! https://t.co/9Pp2oX4quW #ARSLIV https://t.co/Rq576t8hVH Constantly searching for satisfying answers to unusual questions?\nWho isn't, right? Well, @thephysicsgirl has an appropriately titled playlist just for you! https://t.co/QBFdK6RlaH #YouTubeLearning https://t.co/KjYjvwxvq3 @QueenVitani @MadeULookbyLex Happy Halloween! RT @QueenVitani: @YouTube @MadeULookbyLex Happy Halloween!! I'm a #Jester today and I used a @MadeULookbyLex tutorial for this:) https://t.… Happy #Halloween2018 ! \n\nThis cuddly rabbit is so friendly, he'll eat right from your hand: https://t.co/eh1aCKVUQN. https://t.co/VKazkhrTNQ @ddickersondc @MadeULookbyLex This is great! #HappyHalloween! We love this look from @madeulookbylex: https://t.co/ODSpAewpdk.\n\nDid a YouTube tutorial help you with your costume this year? \n\nReply to this tweet with a photo + a link to the tutorial you used! https://t.co/fBvt5ZZUEe RT @Lex_Glitz_Glam: I tried special affects makeup for the first time yesterday and I think it went pretty well. I learned from the best on… RT @YTCreators: |￣￣￣￣￣￣ |\n|       SAVE       |\n|      YOUR       |\n|   INTERNET   |     \n| ＿＿＿＿＿_  | \n(\\__/) || \n(•ㅅ•) || \n/ 　 づ\nhttps://t.… RT @YTCreators: WATCH: In this @FBE video, creators react to potential consequences of Article 13 \n\n(featuring @PhillyD, @ClaudiaSulewski,… This is important. https://t.co/RqObtQhQzy. #NationalCatDay https://t.co/UtdnX5FrND If you use the internet, you need to understand Article 13.\n\nLearn more here: https://t.co/DbEKWdvMdk. #SaveYourInternet RT @YouTubeTV: Travel is glorious whether you live large or pinch pennies: Watch @Tastemade's Basic Versus Baller starring @YTCreators  @va… Oh. my. gourd. \n\nThis stop-motion pumpkin carving video was years in the making: https://t.co/NNV50DeEtq #NationalPumpkinDay https://t.co/a9V01lLNj4 All month, we've been highlighting creators who use the YouTube community tab to build outstanding fan communities. Our final champions, @dearra &amp; @rollplanes__, post GIFs from their upcoming videos to let the #DKGANG see what's coming next! https://t.co/oQrTnYlCPn https://t.co/P2uCTtDzYe RT @YTCreators: #YouTubeBlack: Class of 2018 https://t.co/bzXYAfqKRi Yes, you should be worried about this: https://t.co/YxtC0Lb00m. #SaveYourInternet https://t.co/Aqnr6fUpCP RT @YouTubeTV: 👀 Did you see that? @GuavaJuice took on @Its_TeamEdge for the glory of throwing the first pitch at the #WorldSeries. Check o… RT @YTCreators: Have questions for @dearra and @RollPlanes__ ?! Ask them now in our special #YouTubeBlack Instagram You&amp;A! https://t.co/GY2… RT @YTCreators: Season 4 of Foursome is back! Episode 1 is premiering TONIGHT at 5pm PT and is FREE to all! \n\nHit that 🔔to watch the episod… RT @YTCreators: #YouTubeBlack FanFest family photo with #JheneAiko 😍😍😍 https://t.co/ap8y6y5dD7 RT @YouTubeTV: When the battle goes from coast to coast, anything can happen. All the action starts tonight when the dominant @RedSox take… RT @YouTubeFanFest: TUNE IN: #YouTubeBlackFF livestream at 7:30 ET\n\nFeaturing  @dearra, @RollPlanes__ _Summerella_, @Tpindell, @KhadiDon, #… RT @rihanna: Issa Halloween loooook sis! new #tutorialtuesday is up at https://t.co/dKBkLo9C0Z featuring the perfect black #STUNNA lip and… Article 13 would put the creator ecosystem at risk. READ THIS THREAD.👇 https://t.co/D1AxG1L4Qr Our expert partners @GoodwillInt, @YearUp, @CareDotCom and @ScoreMENTORS have helped us curate some of their favorite videos that teach career skills - check out their playlists on our #YouTubeLearning channel: https://t.co/4LzUNDlUE6. https://t.co/aRDlDMTyUC Curious about those weird superstitions your mom hangs onto or whether we Earthlings have some extraterrestrial neighbors? Satisfy Your Curiosity with our playlists dedicated to doing just that on our new #YouTubeLearning channel: https://t.co/xIASFJjqww. https://t.co/ldUdWa9Zgs Whether you’re interested in learning how to make a mean chili or how to strike your best pose for a photo, our Learn Something New playlists have the answer. Learn all that and more on our new #YouTubeLearning channel:  https://t.co/6z5sbHvqcG. https://t.co/kK7hL3V22z RT @voxdotcom: 1/ Ever wish you could give us a story assignment? Now you can.\n\nWe’re launching a new show with @YouTube Originals, and it’… We want to support #EduTubers and organizations who make some of the best learning content on the internet. That’s why we’re announcing a Learning Fund as part of our #YouTubeLearning initiative. Apply now: https://t.co/lwQp089ZXD. https://t.co/qpjwyyZBfT RT @YTCreators: A message from @SusanWojcicki includes what you need to know about Article 13 and how to #SaveYourInternet 🔽 https://t.co/j… Every day, people go to YouTube to learn something new—like Joshua, an Army veteran who became a physicist after he used YouTube to teach himself trigonometry. Check out his story (and a playlist of the actual videos he learned from): https://t.co/dDunbTh3OI. #YouTubeLearning https://t.co/vMUFB7N9YZ Introducing our brand new #YouTubeLearning channel, home to some of our best educational content. Here you can easily find tutorials, DIY videos, explainers, and skill-based videos. Check it out and learn something new today! https://t.co/4LzUNDlUE6 https://t.co/VYL5bScPCn Today, we’re happy to share that we’re investing $20 million to expand #YouTubeLearning—our initiative dedicated to supporting all those who use YouTube to share their knowledge with the world. Read all about it here: https://t.co/mkXrV2829Y. https://t.co/Yuw49VsiUY RT @SusanWojcicki: Thank you to creators around the world who continue to make YouTube an incredible source of creativity and inspiration.… RT @YTCreators: GET EXCITED!!! \n\n#YouTubeBlackFF is coming soon! Who are you most excited to watch?! https://t.co/hwSZOEdN5i https://t.co/3… Elephants + giant pumpkins = oddly satisfying!\n\nBehold, THE SQUISHING OF THE SQUASH: https://t.co/dipcvckgQr. https://t.co/AdklplWChl RT @rclbeauty101: YASS GUYS UTILIZE THAT COMMUNITY TAB! https://t.co/3Z906AG84G What's in the hot tub? \n\nThis month, we're celebrating creators who use the Community Tab to nurture outstanding communities. This week's champion, @rclbeauty101, posts photos from forthcoming videos and asks the #Levinators to guess what's coming next! https://t.co/ytfDiapt2d https://t.co/PHIOzleZeM \"Don't be scared that you have no one in your city, in your town. Reach out online and find people that love what you do.\" —@patrickstarrr \n\nHappy #SpiritDay! https://t.co/wSCXoCifjE https://t.co/QAZFBkNCED Don’t miss @Dearra, @RollPlanes__, @TPindell, @Dormtainment, @NextTownDownNow, @AriLennox, @kingsleyyy, @KevOnStage, @4YallEnt, @_Summerella_, @KhadiDon, @shanboody, @AvaPearl, and  more, with special performance by #JheneAiko! https://t.co/H5dRkliMft #YouTubeBlack FanFest is back!\n\nThe show will be LIVE at @HowardU and streaming for everyone else on October 23. \nSet a reminder here: https://t.co/H5dRkliMft. \n\n#YouTubeBlackFF https://t.co/RDOh6yZj2s Lucas the Spider is back, and he wants to tell you a scary story. 👻 https://t.co/Y47p0hxrzp https://t.co/PmuDNQB0mg @HodkoV4 @HowardU @dearra @Tpindell @Dormtainment Fear not. RT @TeamYouTube: We're back! Thanks for all of your patience. If you continue to experience issues, please let us know. https://t.co/NVU5GP… RT @TeamYouTube: Thanks for your reports about YouTube, YouTube TV and YouTube Music access issues. We're working on resolving this and wil… @EDWANmusic Pretty sure that's next. @dokimachine Good night! @ursoulle Good night. Good morning. https://t.co/AZxAjYjSuR https://t.co/c9F0tBz0nu In case your Monday needed some magic. https://t.co/YecEaFA5ji https://t.co/mP5gL2LzSO @RoderichEdelst6 Same. Here are some baby meerkats, because it's Friday and you've earned this: https://t.co/J7H4GGEsZE. https://t.co/DewXUjbS9Q 🔴LIVE: Watch as Princess Eugenie of York marries Mr. Jack Brooksbank. https://t.co/TmKAHamDqW https://t.co/kKF5xUHWsX These are 10 of the most-viewed coming out videos on YouTube: https://t.co/x02M9nlhLG. #NationalComingOutDay https://t.co/oTNICDkORa On Friday, October 12th at 10am BST, Princess Eugenie of York will marry Mr. Jack Brooksbank. Subscribe here for updates and to watch the wedding live on YouTube: https://t.co/WzJbpmJWPA. https://t.co/Fy8qgvW33h @SamTsuiUnited @SamuelTsui We do too! Happy #DayOfTheGirl! #CreatorsForChange curated this playlist to celebrate: https://t.co/dvfjeK2K9E. https://t.co/rl9U2HLiEE Every Thursday in October, we're honoring outstanding communities on YouTube! This week's champion, @SamuelTsui, uses his Community Tab to bring the #Samily behind the scenes with photos, news, and polls: https://t.co/Wg3g9Mx39G.\n\nWho do you think uses the Community Tab well? https://t.co/INwM3UeROX Happy #NationalComingOutDay! These are some of our favorite coming out videos on YouTube: https://t.co/ob6xKJTMo1. https://t.co/RLyu6ZbfmU It’s #WorldMentalHealthDay and these organizations have curated playlists of mental health resources. Check them out! \n\n▶️@crisistextline: https://t.co/wsnPZ9YsgB\n▶️@BC2M: https://t.co/n2ksY9D0z7\n▶️@EvrymanBelongs: https://t.co/ogtWZJcVD5 https://t.co/UyAhV8UyZK \"I've seen first-hand experience of what can happen to somebody who doesn't speak about their mental health.\" Talking about black mental health: https://t.co/H7CI9pRnzZ. #WorldMentalHealthDay https://t.co/Az0a1N3cpa Step 1: Watch any of these videos for a guided meditation → https://t.co/aPjpKT4WMn\nStep 2: Don’t feel bad when your mind starts to wander\nStep 3: Repeat Step 1 and Step 2 again tomorrow\n\n#WorldMentalHealthDay https://t.co/qug24pdOSQ RT @youtubemusic: 🔴 [LIVE]: Bringing classical music to a global audience, @DGclassics and @googlearts have teamed up for a 360° stream fro… RT @youtubemusic: She performed it last night at the #AMAs and @camila_cabello is back today with a new video featuring @dylansprouse 😍 Wat… Sometimes it’s hard to relax. But ASMR and other soothing sounds can calm your nerves. https://t.co/kMvNheS7i5 #WorldMentalHealthDay https://t.co/xBGg2iq8QR Mental health matters. For #WorldMentalHealthDay, we’ve put together playlists of resources to help you learn more about anxiety, depression, and other mental health issues. https://t.co/4zAyC0xEnO https://t.co/RqO62eQfBU RT @youtubemusic: Welcome to the 2018 @amas! Make sure you’re following our Instagram for red carpet coverage, performances, behind the sce… Voter registration deadlines for the U.S. Elections vary by state, and some of them are today! Thankfully, @hankgreen, @johngreen and team have you covered with all the info you need → https://t.co/sWyk40GOky. https://t.co/9AfTr5yRkK Now you can access your favorite YouTube recipes and tutorials with the sound of your voice. Introducing Google Home Hub: https://t.co/H3nEbAV2Zy. #madebygoogle https://t.co/qJQTAyWBNC Today is #IndigenousPeoplesDay2018, when we celebrate the indigenous peoples of America. #CreatorsForChange curated this playlist in honor of the occasion: https://t.co/sPTjXbTWIQ. https://t.co/OAlF2HcflB RT @hankgreen: Retweet this if you are going to vote every single chance you get until you're dead. RT @YouTube: Happy #WorldTeachersDay! Today we're celebrating all of the amazing teachers who use YouTube to share their knowledge with the… This #WorldTeachersDay, we're celebrating all of the teachers who use YouTube to teach people around the world—like @Rachels_English, who uses video to teach English to non-native speakers. Meet some of our favorite teachers here: https://t.co/Im55TCzmwN. https://t.co/RUmex1BRm0 You can't get an \"I Voted\" sticker if you don't register. Watch @IISuperwomanII's new video, then go to https://t.co/UGuqCOgypl to register to vote in your state! https://t.co/lWFOWmgl73 https://t.co/sPX4RRFVTy RT @YTCreators: #CreatorsforChange Ambassador @connorfranta is running a marathon to raise money for @GLSEN, an organization that supports… RT @YouTubeTV: You asked, we listened. Enjoy more of your favorite recorded shows with full control to pause, rewind, &amp; fast forward anytim… @ShidiNakajima @SamuelTsui What a great suggestion! @iVexusHD @HannahStocking We're looking forward to expanding access in the future! Happy #WorldTeachersDay! Today we're celebrating all of the amazing teachers who use YouTube to share their knowledge with the world. Meet them here: https://t.co/nsI62qgDxS. https://t.co/GoMqr0yjYu Every Thursday in October, we'll be honoring some of the most outstanding communities on YouTube! This week's winner, @HannahStocking, uses polls, photos, and questions to keep in touch with her community. https://t.co/6dq1NuEqNH\n\nWho do you think uses the Community Tab well? https://t.co/IARFqPVM6e Happy #NationalTacoDay! https://t.co/YFpcQoDKSK https://t.co/pJnNghdzTt RT @YouTubeGaming: ICYMI: You can play #AssassinsCreedOdyssey right in your Chrome web browser with @Google’s Project Stream. \n\nIf you live… Happy #MeanGirlsDay! https://t.co/6ffQqnCQ9N https://t.co/uagnuZ6YQl \"We scientists like to puzzle as to why something is working.\" Listen to an interview with Donna Strickland, the third woman ever to win the @NobelPrize in Physics! https://t.co/MHP7WHdFGW #NobelPrize https://t.co/MkSwnhxPJf Happy #FilipinoAmericanHistoryMonth! \n\nFilipinos have been living in America since long before the country was founded. Learn more from this playlist curated by #CreatorsForChange: https://t.co/2uSoCg40yp. https://t.co/yU9vd40jpk @cracklekpop Hi, Community is still in beta while we continue to test and optimize the product. Thanks for your interest—we look forward to expanding Community access soon! Technology can help us all become more productive at work.\n\nThis is probably not the best example: https://t.co/8GMQ0yMfVN. 🤖🌭 https://t.co/SJGORwbUXL When it's finally #October1st. https://t.co/V8PCwfORCo https://t.co/czqFH9sxPQ RT @Iron_Spike: So everybody else regularly searches YouTube for relaxing art restoration videos, right? https://t.co/Po1YqnSi8y Anaheim --&gt; Mexico City --&gt; Rio ✈️ Our #EduCon family is growing! Today, 150+ #EduTubers came together @YouTubeSpaceRio to share their experiences and passion for education content. 📕✏️🍎 Follow our #YouTubeEduCon Instagram story for more highlights: https://t.co/BlzORyUXJk https://t.co/gFbq4CBSKD RT @OriginSeries: Had enough? This #WorldTourismDay look beyond Earth. The journey to #LeaveEarth begins Nov. 14th. #WTD2018 https://t.co/A… RT @18kYearOldSoul: @YouTube For anyone who'd like to know, this is JunsKitchen. His cats are in all of his videos. @IlmaSmile YES Here's a video of a cat eating sushi. https://t.co/zwvS7AkWTU https://t.co/Ci4qc6nhuQ @dromvladiczinn Good choice. @Jc_Champion_ Exactly. Zoo videos. https://t.co/rX361wUkBu #LeaveEarth #WorldTourismDay https://t.co/uGWqqn59Is ✨ We're LIVE from the YouTube Fashion &amp; Beauty party! ✨\n\nIt's in Paris. \n\nAt the @usembassyfrance.\n\nThe @MerrellTwins are here.\n\nSo are a bunch of other ⭐️s.\n\nVisit our story for live updates: https://t.co/3A37lnc82U.\n\nBecause you're one of the beautiful people too. https://t.co/R7bcTOVskq RT @TeamYouTube: YouTube VR → coming soon to Oculus Go\n\nSoon, you’ll be able to watch YouTube's entire library and over 800K immersive VR v… RT @TeamYouTube: 👉 In case you missed it: Last Friday, the @youtubemusic team joined our Help Community to answer top questions via our fir… Us. We do. https://t.co/yf7rd2JVWm HE JUST DID THAT. Watch Will Smith's jump into the Grand Canyon: \nhttps://t.co/BKT9wY3Nv1 . #WillSmithTheJump https://t.co/x3kYmVcl9i RT @YouTube: It's Will Smith's 50th birthday, and some friends have a special message for him before he jumps into the Grand Canyon! Watch… It's Will Smith's 50th birthday, and some friends have a special message for him before he jumps into the Grand Canyon! Watch the jump LIVE at 3pm PT today: https://t.co/hNrs3Fmnfq. #WillSmithTheJump https://t.co/5cTCa096Nf Have you registered to vote? Make your voice heard in this November's U.S. Elections → https://t.co/kAUqQ6P0hu. #NationalVoterRegistrationDay https://t.co/Biuib0cHJm @BalorClub_Kyle He is truly the world's most musical spider. They said he couldn't spin webs. Lucas knew that meant he just needed to be a little bit more creative → https://t.co/2vzWE3cNr4. https://t.co/VBl1xRvQbm RT @youtubemusic: SHAWN MENDES.\nDirected by @CaseyNeistat.\nComing 9/28 on YouTube Music. cc: @ShawnMendes https://t.co/bszxpiujGp RT @party_of_foor: Here’s the link to her first Fat Rant video. Enjoy!\n\nhttps://t.co/9yl6hs2txb RT @party_of_foor: Know how it feels to think your whole life that only thin girls were allowed to be in front of the camera and then sudde… RT @party_of_foor: I won’t repeat the content of her Fat Rant videos here because they’re just too good not to sit down and watch yourself.… RT @party_of_foor: The video was simply called “Fat Rant”. The focus of this short film was a beautiful woman by the name of @JoyNash. She… @party_of_foor ❤️❤️❤️ RT @party_of_foor: I remember logging into YouTube, just created 4 years prior, to see if I could search for videos on how to dress to hide… @wepurpleyoutae Seems legit. @Welsh_Fox Hang in there, buddy. YOU DID IT.\n\nIT'S FRIDAY.\n\nYOU SURVIVED. https://t.co/aKvGnInP61. https://t.co/Yf1vWBlESG @sydneyalyse02 @zane This is also a good idea. RT @MobileFilmFest: The 14th edition of @MobileFilmFest with @Youtube #creatorsforchange, @eu_eeas &amp; @unhumanrights is open !\n🎬The rules ar… Friday goals: \n\n1) Look for the helpers\n2) Be one of the helpers\n3) Listen to this on loop: https://t.co/ijtDLfMtit\n\n#GoogleDoodle https://t.co/wngoP4Zems RT @YTCreators: Here are some of #CreatorsForChange's favorite videos showcasing Hispanic and Latinx creators, @theFlama, @lifeaseva, @anni… RT @StephenAmell: Hello my name is Stephen and I go on YouTube deep dives with chiropractic adjustment videos. PIZZA VIDEOS, RANKED: \n \neating a pepperoni pizza 🍕\nmaking the perfect pizza 🍕🍕\nmaking a giant pizza       🍕🍕🍕\neating a giant pizza         🍕🍕🍕🍕\nsinging to your pizza       🍕🍕🍕🍕🍕\n\nHappy #NationalPepperoniPizzaDay! https://t.co/0SfpSv18H9 https://t.co/ExkyjQnlEq RT @YTCreators: MUST WATCH: @Caspar_Lee asks YouTube exec @rkyncl about trending tab, monetization, and lots of other questions that creato… RT @TeamYouTube: It's finally here! 🙌\n\nDark theme has been rolling out and is now available to all on Android. Toggle it on/off in Settings… He was the best pirate. https://t.co/a9PvYdfpXH #TalkLikeAPirateDay https://t.co/VcxRTf8SXL #YouTubeEduCon goes global! #EduTubers gathered today @googlemexico for the first ever EduCon in Mexico City 📕✏️🍎 Check out our Instagram story for all the behind-the-scenes action: https://t.co/BlzORyUXJk https://t.co/MuOwitbkSC Keep those videos coming! Tweet your video wishing Will Smith a happy birthday TODAY with the hashtag #WillSmithTheJump, and we'll collect our favorites for a birthday video that will be sent to Will! https://t.co/q0ET8alApR 🚨🎂 Today is your LAST CHANCE to send a birthday message to Will! Tweet your video with the hashtag #WillSmithTheJump! https://t.co/PUWbPgRduk RT @YouTubeGaming: Starting today, gaming has a new home on YouTube where you'll be able to easily find gaming content and creators. You ca… RT @YouTubeGaming: We’re also excited to make it easier to find new creators to follow. Every week, we'll feature a new Gaming Creator on t… 🍔 This is how to make the perfect cheeseburger for #NationalCheeseburgerDay: https://t.co/EgpRJFxw3Y. #YouTubeTaughtMe https://t.co/y0RFzBAHBL RT @youtubemusic: “To me, love is a force that cannot be contained.”  Watch Janelle Monáe: A Revolution of Love now → https://t.co/DwdyQDBs… If this plucky orphan could survive to become one of the oldest sea otters in the world, you can get through this Monday. https://t.co/m24Soj4NeJ https://t.co/ZKAANbUxoJ RT @DwyaneWade: One Last Dance. https://t.co/amr0xjgDun https://t.co/flRbAK6X8m Happy #HispanicHeritageMonth! #CreatorsForChange curated this playlist to celebrate: https://t.co/59lDia9OCN. https://t.co/0wzHJgK6Ic @Rahul129K This is a mood. When you're at work but you're going out later. \n\nGET THE LOOK: https://t.co/N8E5NXt19O. https://t.co/EwuABz5l5T 🚨 ONE HOUR until tonight's @BingingWBabish livestream! 🚨\n\nWatch here: https://t.co/xOVkXsBYh0. https://t.co/e7TmGcllLc 🎉Will Smith is getting ready for his 50th birthday jump, and we’re celebrating with an epic birthday video—but we need your help! \n\nFilm a short birthday message and tweet it with the hashtag #WillSmithTheJump. We'll collect our favorites for a video that will be sent to Will! https://t.co/Yhi9RaBh4P RT @youtubemusic: 🔴 [LIVE] Enter the world of @SavagexFenty by @rihanna → https://t.co/Evk1YJ4bm5 RT @TeamYouTube: Rounded up #ytdarktheme questions and feedback, including: \"What’s the hold up on Android?\"\n\nCheck out the full video → ht… @FionaJo147 He got knocked down, but he got up again. Hamumario is ready to celebrate #NationalVideoGamesDay. https://t.co/nfSmyCbrUm https://t.co/A5lQy8bL4z RT @LowiSahiNazal: Ask me anything on https://t.co/ce1DvAHOWO #CreatorSummit https://t.co/1y6cXZ4uqE RT @YTCreators: It's the final day of #CreatorSummit! For more of your fave creators from Dubai, Italy, Turkey, and all around EMEA, go to… @yngbloodcalum So do we! He made yogurt, blueberry jam. and butter. He made cheesecakes. He topped them with agar, marbled white &amp; matcha chocolate, spun sugar. and a buttercream🌹. He plated them with dry ice.\n\nCats are hard to impress: https://t.co/uAd71apg9l. https://t.co/kY3Li1TTe2 RT @YTCreators: WELCOME CREATORS!\n\nSo much amazing talent from Africa, Asia and Europe are together at  #CreatorSummit. \n\nWatch @YouTube's… This is your Monday: ⛈📅😞\n\nThis is your Monday with a playlist of our favorite BLACKPINK \"DDU-DU DDU-DU\" covers: https://t.co/Pc3h4dPz7L. https://t.co/XwTJTU3plc We’re live from New York City with @PaulMcCartney. Watch with us: https://t.co/U0aJtBVbHB https://t.co/QouGOxGvO2 \"It's all in my head. And then I'll start giggling.\" \n\nTop creators @markiplier, @harto, @lizakoshy, and @rhettandlink share their secrets: https://t.co/C2au5yoXI7. https://t.co/JNLodv4HLd One more day until #PaulMcCartneyLive where @PaulMcCartney will perform some of our favorite Beatles tracks and some music from his new album #EgyptStation. Watch with us on 9/7 at 8PM EST. Which songs did you think he'll play? https://t.co/r0GH4gsQme #ReadABookDay mood: https://t.co/HefBOqua91. #Booktube https://t.co/p5Y3IHBxPC RT @youtubemusic: 💜 @BTS_twt + @nickiminaj 🦄 Watch the video for #IDOLftNickiMinaj now → https://t.co/VYytfBU4Tp https://t.co/2wL6sk0cqk Sending India's LGBTQ+ community all our ❤🧡💛💚💙💜❣️https://t.co/af7D5ljR97 RT @PaulMcCartney: Paul to livestream special New York concert: https://t.co/QTtcBEWCHj @YouTube https://t.co/OLBKIEs1EF RT @YTCreators: We mourn the loss of @clairewineland, who inspired us with her honest and open depiction of living with cystic fibrosis. RI… 🚨 Calling all @IBGDRGN fans! 🚨\n\nOur newest YouTube Original, Kwon Ji Yong Act III: Motte is finally here!  Check it out now: https://t.co/62R1lLrdKe. https://t.co/tZcsxC32aE @jack6959 eh, there's cheese underneath. Happy #NationalCheesePizzaDay! https://t.co/7UBOosNbXQ https://t.co/sUdXXNStCr @NinjaJXN yes Post-weekend mood: https://t.co/3OhFC0Txey. https://t.co/eMvP4dsh5I Tag yourself: Which Lucas are you? https://t.co/f67CeYWT28 https://t.co/snI4HvXyqE RT @youtubemusic: Happy Birthday Beyoncé!! The only Virgo who matters → https://t.co/CWQfrYbmVD https://t.co/o7quk5fEvs How well do you know @IBGDRGN? See Kwon Ji Yong AKA G-Dragon like you've never seen him before in the new YouTube Original, Kwon Ji Yong Act III: Motte coming 9/5 Get a first look at the trailer here: https://t.co/SStAoAZiZs https://t.co/4n3HkoYOqQ RT @YTCreators: For the past 10 years, @HopeForPaws has used YouTube to share the stories of the dogs they rescued. Now, through YouTube Gi… It’s #Up2Us to take cancer down. On September 7th, tune in to @SU2C's digital live event streaming on YouTube at 7ET/4PT. Visit this link to get notified when we’re live: https://t.co/hnU5XG25iv. #StandUpToCancer https://t.co/umUEySSx0D RT @YTCreators: Introducing 2018’s #CreatorsforChange APAC Fellows! Congratulations, and thank you for using your voices to make a positive… When there's one day standing between you and the long weekend: https://t.co/yAmsjZMfrO. https://t.co/Iivier7m12 RT @googlearts: Learn about the life of Discovery, #NASA's most accomplished shuttle with 39 missions ➡️https://t.co/Bhz6Y6JPhD #onboarddis… Hello Kitty started her own YouTube channel, and suddenly the world is a little bit cuter: https://t.co/gPSAN9NaqA.\n\n(Yes, there are English captions available.) https://t.co/SHWZIjwxEI RT @Over9000coffey: This such a wholesome idea from the internet\nhttps://t.co/sNGduItgMf https://t.co/nHARZD4Sao RT @YouTubeTV: The 2018 @WNBA Finals aren't here yet, but we've already got some legends in the making. https://t.co/0jUJH8YAeK How do you measure a year?\n\nIn daylights, in sunsets\nIn midnights, in cups of coffee\nIn inches, in miles\nIn laughter, in strife\n\nMeasure in stars\nOrigami stars: https://t.co/c7mWBxOYGb.\n\n#CreatorOnTheRise #YouTubeTaughtMe https://t.co/tmAKkPlV18 Here is a basset hound dressed as a Canadian Mountie. He is trying to catch the thief who stole his maple syrup. 🇨🇦🥞 → https://t.co/7ndW6BWgri https://t.co/LJPbpfEc0q Congratulations to BTS! 'IDOL' now holds the record for the biggest music video debut in YouTube history, earning over 45 million views in its first 24 hours. https://t.co/ZqZmVpbIJF https://t.co/G3cx51eRmC The important part is getting back up again. \n\nThe Chainsmokers x Biggie x Chumbawamba x Limp Bizkit x Grandmaster Flash x Survivor, from @HappyCatDisco → https://t.co/oziOGH5N9X. https://t.co/AC3WMZ3NW2 Now you can track how much time you spend watching YouTube videos, so it’s easier than ever to know when to take a break. Learn more about our tools to support your digital wellbeing: https://t.co/OFmyxkCRuA. https://t.co/NWA8Ujt1XL @JIMINIE24149263 Hi—we often slow or freeze the view count for popular videos while we verify that views are real, but we're still counting every view! Once quality views are counted, view count updates more frequently. The process can take some time. Learn more here →https://t.co/znnXB8GhRj. @MyLoveForYouBTS @TeamYouTube Not hard at all! But this is a normal part of how our system works. During the first few hours after a video is uploaded, we might slow or freeze the view count while we make sure the views are real. We're still counting every view. More info here→https://t.co/znnXB8GhRj. This #WomensEqualityDay, #CreatorsForChange curated a playlist of videos that trace the struggle for women's equality from the 19th century to the present: https://t.co/ohR4DjRMwy https://t.co/25X5qjDk5N RT @youtubemusic: Calling all WALKERS: @iamalanwalker is taking over our Instagram LIVE from his B-Day Bash in Norway! Follow along for exc… It's #NationalWaffleDay! \n\nSo.\n\nDo you like waffles? https://t.co/Sk16ZuDJ4n https://t.co/cD377Jmsh0 RT @youtubemusic: 💜 IDOL 💜 @BTS_twt 💜 → https://t.co/f1MfebZUGp https://t.co/oBe0ZdujVv RT @YTCreators: CreatorSummit_Final.mov 🎬\nSigning off from #CreatorSummit Asia-Pacific 💕 https://t.co/uAgbV99pWd Story vs. Gameplay: https://t.co/vudh4N2zzr. https://t.co/c36t5pBnIA @taeismybae4 @btschartdata We're ready! But this is actually a normal part of how YouTube validates views. Temporarily slowing down or even freezing a popular video's view count is expected. Here's more info: https://t.co/znnXB8GhRj. @snowberrytae We don't delete views! We do slow or freeze the view count for popular videos while we verify that views are real—that shows the system is working as intended. We still count every view. Once quality views are counted, view count updates more frequently →https://t.co/znnXB8GhRj We won't! During the first few hours after a video is uploaded, we might slow or freeze the view count while our system makes sure the views are real. But we're still counting every view. After quality views are counted, view count updates more frequently→https://t.co/znnXB8GhRj https://t.co/gB9It9CMEx When your video won't be released until tomorrow, but the trailer is already #3 on Trending. \n\nAre you ready, #BTSARMY? https://t.co/cN7HsrvqMX https://t.co/qTyTMDoPjh Playing this on loop all day. \n\nStefan Karl Stefansson, 1975-2018: https://t.co/S3uU1Sj9YD. https://t.co/kOfxmrDKGi @StephenRocha Especially panda yawns! We interrupt whatever else you're doing for this video of a mama panda snuggling her newborn. https://t.co/j8qMPWOTl6 https://t.co/QcQSvwivUc The Tooth Fairy works EVERY DAY. \n\nShe deserves a holiday. \n\nAnd now she has one: https://t.co/Xcl6vKVsCO.\n\nHappy #NationalToothFairyDay! https://t.co/DGCULWvBWa RT @youtubemusic: Super excited to announce that we will be the presenting sponsor of this year's @amas. Stay tuned for more details about… @Rainforest2429 Right here: https://t.co/XqFz0jya3i Happy #SeniorCitizensDay! Pasta Grannies is an entire channel full of real Italian grandmothers demonstrating how to make pasta—like 95 year old Rachele, shown here making cavatelli by hand. 👵🍝 → https://t.co/XqFz0jya3i. #CreatorOnTheRise https://t.co/TBU6w5NcwM RT @YTCreators: Wearing their hearts on their sleeves (and fingers), the Indian creators represent at #CreatorSummit👌♥️ https://t.co/Za9Ebu… 🎶Wild, wild horses\n🎶Couldn't drag me away → https://t.co/t4csPjFmCs. https://t.co/2TkHd0a5xn #NationalRadioDay mood: https://t.co/AAlmzHn6mS. https://t.co/DYAQG5JMbc RT @youtubemusic: .@janetjackson and @daddy_yankee show you the real Brooklyn in #MadeForNow, directed by Dave Meyers → https://t.co/sX3iCH… When you're cute yet misunderstood. \n\nHappy #BlackCatAppreciationDay! https://t.co/W5G2NIKlZr https://t.co/Mz0Kutc1zg RT @youtubemusic: .@QueensChristine makes getting ready for work look easy. Watch 5 Dollars now → https://t.co/BBzpSAOAKe https://t.co/43qi… RT @youtubemusic: Remembering the irreplaceable Aretha Franklin with some of her iconic performances → https://t.co/cTGVCKYQs9 https://t.co… RT @youtubemusic: A trailblazer, an icon, the Queen of Soul. You will be missed, Aretha Franklin. https://t.co/VKWZxrdqF1 YouTube's video player automatically adapts to fit the shape of the video you're viewing -- helping @dillonfrancis and Young Ash look good in vertical. BaBaBa (Vete Pa’Ya) → https://t.co/NL3UqXUvbT. https://t.co/RMeU6L8t6N @baileysteresa @emmachamberlain You're telling us. This spring, @yestheory challenged Will Smith to bungee jump from a helicopter. \n\nOn his 50th birthday, he's finally going to take the plunge...over the Grand Canyon.\n\nHere's how you can watch live on YouTube: https://t.co/wKlwLrKnap. #WillSmithTheJump https://t.co/lE8OwUYGrO @VBaurens @PaulMcCartney We do too. Happy #LeftHandersDay to @PaulMcCartney and all the other lefties out there. https://t.co/q3ny7VgDa4 https://t.co/4pMTJqWhaA RT @YTCreators: Well, this takes the cake for #YouTubeCreatorAwards celebrations.\n\nIn honor of 10 million YouTube subscribers, @RosannaPans… That moment when you realize you're probably not going to finish the World's Spiciest Ramen Challenge. \n\n@shaymitch and @IANMHARDING ate 🌶🍜 so you don't have to (except that now we kind of want some). → https://t.co/bszMW7LVBV https://t.co/2hPekKSWte @emmmabooks Happy #BookLoversDay! Happy #BookLoversDay to everyone who makes YouTube feel like the best book club. https://t.co/JvM2ket8ol https://t.co/HWgPtk97uq Today is the International Day of the World's Indigenous Peoples! #CreatorsForChange curated this playlist of indigenous voices to celebrate: https://t.co/Otj5wajFua. #IndigenousPeoplesDay https://t.co/Tv8S5AKl5E RT @youtubemusic: Show up, show up. New @twentyonepilots → https://t.co/OonbCTp9KB https://t.co/HOyFNEVLZO RT @YouTubeTV: We may never know what this cat is reacting to, but our best guess is that someone finally told him you can download the You… Happy #InternationalCatDay ! https://t.co/WwcudsL70O https://t.co/0HoqbU21gV Is this reel life? https://t.co/ZQdsllwkRX https://t.co/1ykwTqHp2l When everyone else is talking about regrets from their past, but you're holding a puppy.\n\nMonsta X plays with puppies while answering fan questions → https://t.co/wHDex1Y3lE. https://t.co/NIO9YyhHqB YouTube twins as the astrological signs. #NationalTwinDay https://t.co/oCsc8aNgaA RT @YTCreators: Happy #NationalTwinDay! On YouTube, being a twin is a really big deal.\n\nSo in honor of this holiday, @Refinery29 featured Y… Happy #NationalTwinDay! https://t.co/PgN3deMZrC https://t.co/rb8wylXOMb RT @FallonTonight: .@JBALVIN &amp; @NickyJamPR play \"Truth or Challenge\" backstage before their performance on the show! https://t.co/V8lb6w81Y… We made it easy to share videos and message friends on YouTube. Just hit the share button, choose some contacts, add a message, and hit send. You can also start group chats! Learn more: https://t.co/gVQ4A3b51V. https://t.co/U40tiRb01d Maybe the real giant gummy pizza was the friends we made along the way. https://t.co/KzbENlBipA https://t.co/IEnHNuCUkz RT @RealJayWilliams: I may or may not have challenged @KingJames on the court! Check out this week's new episode of #BestShotSeries on @You… On his last day in the Air Force, he finally revealed that he could sing. And play guitar. And write songs: https://t.co/mxysx7W0Xt. https://t.co/K5FzZSu48V RT @YTCreators: BookTube is in the New York Times!\n\n@XTineMay, @JessetheReader, @missmareadsalot, @maureenkeavy, @ArielBissett and other Bo… There's a kid version of \"Dance to This\" and it might be the most adorable thing ever: https://t.co/hA3gDppG3O . https://t.co/suk1gVq4Uf RT @KelseyEllison: Woah!!! 😱✨✨ https://t.co/mHvQl8pcvJ RT @YouTubeTV: 🌟Product PSA🌟: Did you know you can add up to five people to your YouTube TV family plan? Everyone can use their own logins… @x_sunil @Nickelodeon @kevineastman86 We're really excited about it. Teenage Mutant Ninja Turtles: \"Who needs weapons? We're ninjas!\"\nAlso Teenage Mutant Ninja Turtles: *quickly steal a bunch of magic weapons*\n\nWE MISSED THESE GUYS. Watch the first episode of Rise of the Teenage Mutant Ninja Turtles free on YouTube: https://t.co/lYiOFrOpnz. #TMNT https://t.co/amlXDNY9ak RT @youtubemusic: “Who says that you have to sing in English to be global?” @JBalvin’s Artist Spotlight Story premieres this Wednesday at 7… Happy #NationalAvocadoDay! Here's 10 hours of guacamole: https://t.co/Z9BGmMY226. https://t.co/OHccQAtnyw RT @StephenCurry30: Brand new episode of my #5MinutesFromHome series is now up ft. the director and YouTube legend @Jessewelle . Watch now… @LyssLyss15 @KelseyEllison She's so good! RT @YTCreators: It's all happening! Congrats @CaseyNeistat on 10 million subscribers! 🎉🎉🎉#YouTubeCreatorAwards https://t.co/mFi54zkpfY 🎂🦉✨#HappyBirthdayHarryPotter! https://t.co/M7evSn9zg6 https://t.co/twZ5CLAUOG Happy #InternationalFriendshipDay! https://t.co/XDKwLr8RBP https://t.co/byZ6w1fscl RT @YTCreators: Olympic swimmer and @Refugees ambassador @YusraMardini sat down with 2017 #CreatorsforChange ambassador @RosiannaRojas to t… Monday mood. https://t.co/Feq8txJVKL. https://t.co/Wwc3c4TDhd Happy #NationalDanceDay! Celebrating with some #BLACKPINK choreography from Matt Steffanina: https://t.co/MhbIAISOEZ. https://t.co/XtrOSy57cT RT @youtubemusic: The next chapter of the World Of Walker trilogy is here. @iamalanwalker’s Darkside, featuring @heyitsau_ra and @TomineHar… RT @annersss12: tonight’s plans include eating an unreasonable amount of rice and falling deep into a youtube hole can i get a woop woop RT @youtubemusic: 🔴 [LIVE] @FujiRock_jp Day 1. Tune in to watch @PostMaIone, @NERDarmy, @odesza, @yearsandyears and more. #FRFYouTube #fuji… RT @YTCreators: We're going to use the fact that #FridayReads is trending to plug the fact that #BookTubeAThon —an annual YouTube read-a-th… Here's 12 corgis swimming in a pool, because it's Friday and you've earned this: https://t.co/5CwonAwsOz. #FridayFeeling #FlashbackFriday https://t.co/6ClItjl59d This video argues that if we all used Super 8 film our lives would be an endless montage of fun, friends, and skateboarding. We're not sure we believe them, but it is very pretty, and we hope something today makes you feel like this → https://t.co/B40SmztcjA. https://t.co/Zkg82wyna2 This isn't going to end well. https://t.co/EhNuK96X7a https://t.co/C3Wmg8bF5H @humansofny ❤️❤️❤️ \"I ended up finding Matt’s videos on YouTube. He was sort of documenting his own experience with antidepressants. He was black. He was male. He was queer. And he was doing fine. It just made me feel a lot less alone.\" \n\n❤️ this story from @humansofny → https://t.co/7F4JoZEcjC https://t.co/w3vMI4vO9e ✅Hibernate all winter\n✅ Swim all summer\n\nThis bear is our new favorite lifestyle vlogger: https://t.co/VGpv7KLJgH. https://t.co/HQZI3PmYo7 \"Raven! If you're part demon, then what other part are you?\"\n\"Annoyed.\" \n\nThe Teen Titans answer your questions → https://t.co/ofR8j60DMX. @TeenTitansMovie https://t.co/ZBMeplBCog 🔴LIVE NOW: Watch  @jimmyfallon  interview @tomi_adeyemi, author of Children of Blood and Bone  → https://t.co/a2qGJFGMm2. #TonightShowSummerReads https://t.co/gwfi9XbGEW @jiminteIIectuaI @nayoxx @BTS_twt Absolutely, here's more info: https://t.co/oXIftJYzbv\n\nAfter quality views are counted, view count updates more frequently. The process of including all quality views can take some time depending on a video's popularity and viewership. @nayoxx @BTS_twt He's amazing! \n\nRe: views, sometimes views freeze or are adjusted as part of our auditing process to make sure views are real. This is a normal part of the process, and no genuine views are deleted! Still not over this. https://t.co/dPbJsCwJm1 #HopeOnTheStreet https://t.co/halbaqGgzC It's been 10 years since Breaking Bad, but @BryanCranston and @aaronpaul_8 are doing just fine. https://t.co/fOwJ2v2h4V https://t.co/WfEOgYlt3M IT'S LEO SEASON, KITTENS. 🦁🎂 https://t.co/qvAiDvNLVe https://t.co/JG7YcGpCdA 🎉🎓 We're proud to announce a new initiative, YouTube Learning, through which we’re providing grants and promotion to support creators and expert organizations who create educational videos. More here: https://t.co/5AG9CXKIAR. https://t.co/STu5vbYfiy RT @SusanWojcicki: Sharing an update on my priorities for creators in 2018. Read my letter to creators (https://t.co/Z8my6kUKlz) or watch t… @_AmandaNolan_ @CanadaDan55 @jacksfilms It's a great video! On this day in 1969, humans set foot on the moon for the first time. Watch the @CBS broadcast of the #Apollo11 moon landing on @NASA's channel: https://t.co/WKBdaO1BGf. 🚀🌕 #NationalMoonDay https://t.co/yZXM8bBWei RT @_AmandaNolan_: Holy crap THAT’S ME!!! https://t.co/kfz0RRFSss @CanadaDan55 @jacksfilms @_AmandaNolan_ We didn't know her Twitter handle, but she's incredible! Today's reason the internet is amazing: @jacksfilms asked people to record new YIAY outros and got submissions like this → https://t.co/ZuNHwRpr8U. https://t.co/CMkWoX4ahN You can make okonomiyaki at home, and you definitely should: https://t.co/COnfZ4IgY5. #YouTubeTaughtMe https://t.co/Qvb5hm9eL0 RT @youtubemusic: 👀 ATTN: New @chancetherapper. What's your favorite? \n65th &amp; Ingleside → https://t.co/FWc0TS4Avz\nWala Cam → https://t.co/z… It's finally here! @RealJayWilliams stars in our new docu-series #BestShotSeries executive produced by @MavCarter &amp; @KingJames. Check out the first episodes for free here: https://t.co/qeE07hgH0X. https://t.co/c2ZNavhWO6 \"There's no way this is legal.\" Behind the scenes on Will Smith's #DoTheShiggy video: https://t.co/UG9vcPL7ey. https://t.co/80ibsK4ZmR @Sweetsgeeks always One is an internationally famous competitive 🌭 eater. \n\nOne is a tiny hamster. \n\nWho can eat more hot dogs? https://t.co/uGCjh9d4Is \n\n#NationalHotDogDay https://t.co/nQDQOGd6K7 @DavidJBradley1 Yes! Happy #WorldEmojiDay! The most popular animal emoji on YouTube is the 🐼. https://t.co/jV4Q7RtCwd RT @YTCreators: Welcome back, @SimoneGiertz! We've missed you and are so glad you are doing so well ❤️\n\nhttps://t.co/CEIWcy2Ome RT @youtubemusic: We're feeling Tiwa’s Vibe, the new video from afrobeats ambassador @tiwasavage → https://t.co/bitVUVSA2A https://t.co/Kv3… 🎉🎊🍾 Happy #WorldEmojiDay! Here's how to make a new emoji: https://t.co/BQHNbUC10v. 🎨💻📲 https://t.co/mDL9CGqmKb RT @YTCreators: So @Zane invited his friend @mattrking over for dinner, and his sister @hidayahijazi's reaction shots are a thing of beauty… 🔴 LIVE NOW in 360°: Watch @BarackObama deliver the Nelson Mandela Annual Lecture. https://t.co/ZLQgBCGcW4 https://t.co/t1gLDtB0Ww RT @YouTubeGaming: We've struck gold. 🗺\n\n@NathanFillion stars as Nathan Drake in this #Uncharted fan film by @Allan_Ungar\n\nhttps://t.co/svS… *writes essay on \"How I spent my summer vacation\"*\n*essay is just this GIF playing in a loop*  \n\n@DudePerfect's Ping Pong Trick Shots 4 → https://t.co/RaAeZQCtZl https://t.co/Rzp3vxSHsL Here's an entire channel full of panda videos to cleanse your timeline. https://t.co/v0YU8YTz11 #CreatorOnTheRise https://t.co/hcneKED7Cz Gangnam Style was first uploaded to YouTube on this day in 2012 → https://t.co/sX6NSQu77O. https://t.co/LF1lnmBc8N RT @TeamYouTube: ⚡️ “Copyright on YouTube: a collection of updates, answers and resources\"\n\nhttps://t.co/TTL420Llbl Sometimes. https://t.co/TddOBTq856 @Sarahlee0912 Lucky you! 🍟Potato cannons\n🍟Optical scanners\n🍟A freeze tunnel\n\nThis is how your french fries are made: https://t.co/vX5A4a5NIm . #NationalFrenchFryDay https://t.co/mgGx3uQuOa RT @youtubemusic: #GodIsAWoman. The latest single from @arianagrande → https://t.co/3IKiV4fXFw https://t.co/SljIGymORR Happy #FridayThe13th to all the strays and misfits out there: https://t.co/W5G2NIKlZr. https://t.co/EcZPY4K8KP Sometimes when you fall, you fly. https://t.co/Qu8XfysxRn https://t.co/Tbdr6Woy3s RT @lecrae: Everyone needs a few coaches. We need them in different areas of life. Financial, spiritual, relational, etc. My mom is one of… RT @RealJayWilliams: It was an incredible honor coaching w/ @ShawnMcCray4 . I wouldn’t be where I am today if it weren’t for the mentors in… @HippiePanda96 We're all that duck. Swimming towards the weekend like...https://t.co/KOaidZkyCu https://t.co/pKqLldq9JL RT @JoeyGraceffa: LOOK AT THAT HOLO! 💎 Who’s gotten their tour tickets today? Special pre-sale today only (use code EDEN) and make sure to… @pinot It's great. We've featured your most recent video in a post on the YouTube Spotlight Community Tab and in today's Instagram story: https://t.co/3A37lnc82U.\n\nThanks for sharing your work on YouTube! RT @youtubemusic: NEW CHILDISH GAMBINO\nNEW CHILDISH GAMBINO\nSummertime Magic is out now → https://t.co/5obh6bjIPI https://t.co/O8BwUhkwxj The much anticipated #GFunkDoc is finally here: https://t.co/YHBQMbepNE. \n\nanyone else suddenly have the urge to take a ride in a low rider? @Regulator @SnoopDogg https://t.co/fIgtLOXtX1 Almost time to find out! ⚽️▶️ https://t.co/J0129eQAmj https://t.co/ZFUMed5fsY @pinot WE LOVE THIS. This is how @Pinot created his pixel animation of \"This is America.\" https://t.co/mqj5ZqTLkf. https://t.co/6qwbtAkhB6 This starts out as a soothing video about how mozzarella is made and turns into a son's tribute to his immigrant father. \n\nMeet the Mozzarella Kings of New York: https://t.co/ZE415Cx4p3. https://t.co/ksdRVTr2pB RT @YouTubeTV: See you on Sunday, #FRA! DROP EVERYTHING AND WATCH THIS 8-YEAR-OLD GIRL PLAY THE DRUMS → https://t.co/MhgTjsnmjo. #CreatorOnTheRise https://t.co/4zyoIPTpMM When Dwight was a young calf, he was attacked by a coyote in an open pasture. He lived with a broken rear leg for a year and was rescued by @barnsanctuary. Now watch him meet new friends as he takes his first steps in his forever home: https://t.co/C7gdTFRfC7. #CowAppreciationDay https://t.co/fzTiBdPFDm We can forgive a man for making a useful thing as long as he does not admire it. The only excuse for making a useless thing is that one admires it intensely. All art is quite useless. \n\n—Oscar Wilde discussing \"Overcomplicated Life Hacks: Hot Glue Edition\" https://t.co/2Z13cGrlpS https://t.co/eWv5d0GhVK @giaventi *stares*\n\n...we're gonna need a bigger chart. @NoseNest It will definitely be one of those two teams! ⚽️📈 Daily UK views of #ItsComingHome reached their peak last week. Wonder what will happen on Wednesday....https://t.co/1Rn81mgSli https://t.co/9icKsnuOKF RT @youtubemusic: Take a trip back with @TheBeatles on the 50th anniversary of Yellow Submarine #itsallhere → https://t.co/80beaudE6U https… Happy #WorldChocolateDay! Make it a sweet one. https://t.co/Z9QWKA5ICj https://t.co/3CuVcKOZJJ RT @youtubemusic: Philly stand up. New @MeekMill: #LegendsOfTheSummer → https://t.co/Hqq04IsZXD https://t.co/QtFOicrlq0 Relax with the tiniest 4th of July leftovers: https://t.co/dAos7Zp2C5. 🌭🍔 https://t.co/N9MzkYxEa6 RT @youtubemusic: CHRIS IS BACK. @QueensChristine is everything we want from a pop star in 2018 → https://t.co/YRg8CIMcXA https://t.co/AQp5… Happy #FourthOfJuly! We're celebrating with 50 beautiful videos from every state in the U.S. Find yours! https://t.co/wCZM370Y2v https://t.co/GCZPTygDSy In which @JohnGreen explains the #FourthOfJuly, and also America: https://t.co/sFCWehSDyo. https://t.co/30wuHibiUk 🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭🌭\n\nGet ready for the #FourthofJuly by learning about the science of competitive eating: https://t.co/LZeqzrQ9LY. https://t.co/iNwGIjLCLA Jumping into this week like...https://t.co/KRKzTPEuJg https://t.co/mGFZf3QoXv It's critical to us that the LGBTQ community feels safe, welcome, equal, and supported on YouTube. Your work is incredibly powerful and we are committed to working with you to get this right.4/4 We’ve taken action on the ads that violate our policies, and we are tightening our enforcement.  And when we hear concerns about how we’re implementing our monetization policy, we take them seriously and make improvements if needed. 3/4 But we’ve also had issues where we let the LGBTQ community down–inappropriate ads and concerns about how we’re enforcing our monetization policy. We're sorry and we want to do better. 2/4 It’s the last day of Pride Month and we wanted to reach out to the LGBTQ community. We’re proud of the incredible LGBTQ voices on our platform and the important role you play in the lives of young people. 1/4 🌈#PrideLive is a queer extravaganza and it's happening RIGHT NOW. Watch live as @harto brings together creators, musicians, actors, and more to raise money for LGBTQ youth: https://t.co/AmKEUfDlc1. https://t.co/Uu79OdNQ0d @EliRoss77 Hi, sorry to hear about your views. This sounds like it might be a question for Creator Support—you can contact them here: https://t.co/FGuiQLgSCc. Maybe we'll just retweet this every Friday for the rest of the summer. https://t.co/H7WISqbwRd RT @youtubemusic: Your weekend is officially cancelled. @drake’s #Scorpion has arrived. #itsallhere → https://t.co/9w4WGJWhJX https://t.co/… The best thing on the internet this week = the videos of Mexican ⚽️ fans celebrating any random Korean person they can find. 🇲🇽🇰🇷 https://t.co/0zsZwBHELK https://t.co/znMS8i5Mpw RT @TeamYouTube: We're also passing along all of your feedback–about the experiment itself and the communication around the experiment. Rea… RT @TeamYouTube: Sharing answers to top q's we’re seeing about the thumbnail experiment:\n– Custom thumbs aren't going away\n– 99.7% still se… Two little goats meet the tallest goat they've ever seen. https://t.co/oDd9FDynTb https://t.co/6purz2n6Fw How to get stuff done when you're depressed: https://t.co/hXdKmNMyK2. https://t.co/PnJix8vTCd Happy #NationalSunglassesDay! https://t.co/PGOvCp1v2g https://t.co/nPUhHo3pCV Side hustle is her main hustle. Watch @LizaKoshy and all of her odd jobs in the first episode of #LizaOnDemand, live now: https://t.co/Jd4XzbVneZ. https://t.co/U7FPGtaLj5 RT @TeamYouTube: This is fixed and comments are working again! Note: live chat, messages and other sharing features were also experiencing… We interrupt everything else that's going on in the world for this video of a playful red panda cub who knows only love. https://t.co/DKSSzC4vbZ https://t.co/8CMSnCbmka That time @rudymancuso got curry with @StephenCurry30: https://t.co/wt7E3yrQZF. #5MinutesFromHome https://t.co/8UZrqJy9ds 🌈 Tune in to #PrideLive this Friday, 6/29, as @harto brings together creators, musicians, actors, and more to raise money for LGBTQ youth. Subscribe to @glaad's channel now: https://t.co/xmcSzmV7qR. https://t.co/bftbiUvPpY ▶️ Maine is the closest state to Africa\n▶️ Austin, TX is on the same latitude as Cairo, Egypt\n▶️ Reno, Nevada is farther west than Los Angeles \n\n...and more weird facts about U.S. geography: https://t.co/dL9nSYxcey https://t.co/Tj5JOh479f @NinjaJXN YES. YOU: Hello, Monday.\nMONDAY: https://t.co/Dnb8J1Rzwm https://t.co/iEOf4oZOL6 If you're tired of explaining these LGBTQ terms to people, @much created a video that will help you reclaim your time:  https://t.co/2oNb2KhuxY. #Pride2018 https://t.co/TN2ylu4vcU Happy #Pride! These are some of @onlinekyne's favorite drag videos: https://t.co/iSERlCQrTX. #ProudToCreate https://t.co/BgVaZJWAbf RT @YTCreators: Happy Saturday! Today’s the last day of #VidConYouTube \n\nFor more behind-the-scenes pics, check out https://t.co/GY2MX5XD3W… RT @youtubemusic: John, Paul, George, and Ringo are all here. Live performances, videos and more come together with @thebeatles on YouTube… You need this. https://t.co/q3ny7VgDa4 https://t.co/NhCtqbwgkp RT @YTCreators: #LizaOnDemand cast at #VidConYouTube premiere! \n\nFor more behind-the-scenes 📸 check out our Instagram story at https://t.co… Hey #VidconUS: enter Lyft promo code LIZAONDEMAND for a free ride and a chance to meet @lizakoshy! Be sure to request Liza Mode before requesting your ride. #LizaOnDemand #VidCon2018 https://t.co/Gx8HK2jeZ0 RT @youtubemusic: Our prayers have been answered. Listen to #PrayForTheWicked from @PanicAtTheDisco → https://t.co/13TbCGubmk https://t.co/… Slimy, yet satisfying. @noahcyrus and @joncozart went on #GMM to see how many Disney foods they could identify by touch: https://t.co/EP7JZzQurZ. https://t.co/W2Lppg5ae8 For these good boys and girls, every day is #TakeYourDogToWorkDay.\n\nMeet the puppies training to be service dogs: https://t.co/vJii7Ewdii. https://t.co/j3GeghZR77 RT @YTCreators: 🚨HAPPENING NOW 🚨! @lizakoshy live at #YouTubeOnStage.\n\nWatch at https://t.co/71OBawzMcX! https://t.co/7O4WPvL8cF 📱Relieve your FOMO and watch #YouTubeOnStage from the comfort of your phone:  https://t.co/lGtOkPIOPS.   \n\n#VidConYouTube https://t.co/owhU3bzT2C RT @YTCreators: New on YouTube!\n\n✔️Channel Memberships help Creators build community &amp; earn more money\n✔️Merch makes it easier for Creators… 🚨LIVE NOW🚨: YouTube Exec @nealmohan talks with creators @KatiMorton and @KurtHSchneider about what's up next → https://t.co/5XsfRxqRZk https://t.co/KbNhmLWnmk RT @YTCreators: VidCon Day 1: Stopping by the Creator Diner at #VidConYouTube!\n\nFor more behind-the-scenes pics, check out our Instagram st… #ETN3 is live! @Joeygraceffa and some of his closest friends embark on another one-of-a-kind adventure—you'll never guess the twist. Watch the first episode now: https://t.co/6z7G2skPme https://t.co/jqy4GSYSmQ @nobody_digital It is yes Can’t make it to #VidCon? Catch the fun via livestream:\n\nYouTube Keynote→https://t.co/5XsfRxqRZk\n#YouTubeOnStage→https://t.co/lGtOkPIOPS\n\n#VidConYouTube https://t.co/ksxuc6ZMSC Remembering Koko the gorilla, 1971—2018. https://t.co/Er3Q4LtoVq https://t.co/QRGeiLO7p0 Happy #SummerSolstice! Celebrate with this midsummer song from @CamilleKennerly: https://t.co/4uCCHG6Evn. https://t.co/uCVDLQVJ61 Here is a tiny tenrec at @dallaszoo celebrating his birthday with a tiny cake. https://t.co/6Q0ZYsmoNH https://t.co/pXtBZ4yU6o @Bloxy_News *whispers* it's also called football RT @ByChrisMason: PSA: There's a YouTube account dedicated entirely to Mr. Feeny's fence chats. Would highly recommend going down this rabb… IT'S ALSO CALLED FOOTBALL https://t.co/zhajBsjdWg When someone asks if you're a soccer fan, but you're too busy solving your ⚽️-shaped Rubik's c̶u̶b̶e̶ to answer them. https://t.co/s8HQ9RSg5H https://t.co/A58d3YxVs3 This #WorldRefugeeDay, @refugees are using YouTube to share their lives with the world. Spend a day #WithRefugees: https://t.co/Exy2jdBMeT. https://t.co/wllT8PjZ44 @mateuszjarema_ YES 😍 🕷💤\n🕷💤\n🕷💤\n\nWhy is it so hard for an itsy-bitsy spider to find a quiet place to nap? https://t.co/jVLzupl56w https://t.co/KsMLIJLSVH RT @SnoopDogg: Bringing the story of G Funk wit @regulator to @YouTube July 11 ✨🙏🏿 #GFunkDoc https://t.co/vLWFb3g9Hj Today is #Juneteenth2018, the day that marks the end of slavery in the United States. Here's why: https://t.co/YosX9WL1ff. https://t.co/zcbJdKlffq \"It's not a crime to want to take over the world.\" @TheRealStanLee and @HamillHimself talk supervillains, voice acting, and more: https://t.co/Cgu44EsFDa. https://t.co/LLIJ2gWViE The new @youtubemusic is here. All of the ways that music moves you, together in one place: official audio and video, playlists, live performances, covers, remixes, and much more. Get the app and open the world of music. #itsallhere → https://t.co/XwcBsPtbjP https://t.co/m2Wdxl5dR3 RT @TeamYouTube: And we're back!\n\nWe've resolved the outage on both YouTube and YouTube TV. Sorry for the interruption and thanks everyone… RT @TeamYouTube: We're aware that YouTube isn't loading for many of you–we're on it! Monday mood. https://t.co/K5Efg5jkKt https://t.co/tZcPcM4wRd Happy #FathersDay! These are the 10 best dads in the animal kingdom. https://t.co/2PSMmWe6yz https://t.co/yR8NdDPiyN Happy #FathersDay to all the dads who share their stories on YouTube! Here's @LaGuardiaCross explaining what it takes to be a great parent: https://t.co/MVm90AGgxL. https://t.co/41NLALj7xt RT @youtubemusic: Thanks, @beyonce + @S_C_ . APESH**T by The Carters is available now → https://t.co/TstcxpO8rj https://t.co/ZCnFPf9yiZ @calmestpml 💡 Happy #NationalFlipFlopDay. Go outside!\n\nOK, watch this puppy video and *then* go outside:  https://t.co/5xe3FmlfPF. https://t.co/UhkmVUK3aZ The classic soccer ball design, the Telstar, was invented in 1970 to make the ball easier to see on black-and-white TV screens. https://t.co/wStzNm4WjF ⚽️ https://t.co/02IhgPqbag RT @youtubemusic: 🔴 [LIVE] An exclusive stream of @Nas' new album NASIR → https://t.co/FHp69eLFWC @ElectraSnow It's a terrific video. @officialjaden Congratulations! Pride isn't about rainbows. But rainbows are pretty great. 🌈\n\nGlitter lips, androgynous fashion, and more ways to show you're #ProudToCreate: https://t.co/3ZLPWZ7SeI. https://t.co/2zzBgKTbSk RT @youtubemusic: It’s Degrassi: The Next Next Generation in @drake’s #ImUpset video → https://t.co/qatU2m9fkt https://t.co/kGSmrBg5aP ⚽️ The @FA are broadcasting from inside the England camp! Today: @dele_official tries to identify players by their hairstyles. https://t.co/mL4UX1giVw https://t.co/wTOCpiCn8P *closes all tabs except the one with a 10-hour video of soothing oceanscapes* https://t.co/ddMbwaBffN https://t.co/1NwYGGcx4G Excited for the new feature-length cute animal video. #Dumbo https://t.co/5ID2p1MRCG https://t.co/oDd939TF3Y \"It's just nice to have questions like 'how does this arm work?' instead of saying 'what happened to you?'\"\n\nThese engineers are turning disabilities into superpowers → https://t.co/MGxeu0upVF https://t.co/j5qpu0JiRu .@Patrickstarrr HAS GOT THE GLAM.\n\nWatch here: https://t.co/N59edZfFFG https://t.co/ykFaV2JGts 🔴 LIVE NOW: Watch the historic meeting between Donald Trump and Kim Jong Un in Singapore. → https://t.co/fO7Tv0MRNV #TrumpKimSummit https://t.co/NA18JkfJ2F The world is a mess right now, but today's #CreatorOnTheRise is a raccoon and he just met a hedgehog. https://t.co/FsWcD1SRdc https://t.co/MBN89Js44N 40% of homeless youth in Los Angeles County are LGBTQ. @Tyleroakley met with LGBTQ people directly affected by homelessness to hear what they had to say. https://t.co/uF0l5H6OkB https://t.co/EPpSgRueeV RT @youtubemusic: If @ShawnMendes' chin dimple released a solo album, we'd be there for it → https://t.co/lvcnQ7OwhQ https://t.co/suDWBR1r4y RT @bigfreedia: I am #ProudToCreate!! Proud to be loud and express myself through my music and the way I live. I hope you feel inspired to… Check out the trailer for #BestShotSeries starring @RealJayWilliams and executive produced by @KingJames. Coming July 18th! https://t.co/2yjbqiO9nN https://t.co/5If1II2xD9 RT @EhBeeFamily: Here’s a Before and After shot of a pier in one of the areas first hit by the Hurricane in Puerto Rico. 🇵🇷❤️ Join us in ma… You can't control what you don't understand. Watch @ImpulseSeries, now streaming: https://t.co/GC7pkt4zwS. https://t.co/AbulMF0CoM RT @insidethetube: I learned about the world &amp; its cuisine through Anthony Bourdain &amp; his shows. His passion for food, people, storytelling… RT @BunkiePerkins: That time Anthony Bourdain went to  Mississippi and had some pig eaR sandwiches. RIP https://t.co/8Dz5fZ8cWn RT @LABlair1492: Anthony Bourdain’s Parts Unknown on Paraguay was typical: inquisitive, empathetic, willing to look beyond the stereotypes.… RT @marcusleshock: That time Anthony @Bourdain went to @HotDougs. This is so great. https://t.co/ZAAsb3smnC RT @ThatPersianGuy: RIP Anthony Bourdain. An inquisitive, knowledgeable, delightful dude. Very thankful that he shined a positive light on… Remembering Anthony Bourdain through the videos he left behind. https://t.co/IZMFSdIkNb. https://t.co/z2ywO2mIN9 RT @harto: I am very #ProudToCreate: Pride 2018 https://t.co/RGOFCJpePA via @YouTube RT @YTCreators: That's a wrap on the #CreatorsforChange Social Impact Camp! We are so inspired by the Ambassadors who will continue to make… You don't just imagine a better future. You create it. This #PrideMonth, we're celebrating the LGBTQ voices that have shaped our world and continue to build new ones. Introducing #ProudToCreate → https://t.co/3f3Q9wI4mV https://t.co/95CgPSqk3p RT @YTCreators: Hi from the #CreatorsforChange Social Impact Camp! We’re ready to learn from our Ambassadors who are fighting hate and extr… @elijahdaniel @YTCreators @YTAdvertisers Hi—you can keep these ads from appearing by setting an ad exclusion for a specific advertiser URL, general ad content categories, or sensitive content categories. Here's the link: https://t.co/eF5JdYjrNG. We are looking at ways to improve our policies going forward. @ChaseRoss Hi Chase. Re: ads, creators are not required to accept ads from groups they disagree with. You can set an ad exclusion for a specific advertiser URL, general ad content categories, or sensitive content categories. Here's the link: https://t.co/eF5JdYjrNG @ChaseRoss We're constantly working to improve our systems and meet with a group of LGBTQ creators quarterly to find better ways to serve and support LGBTQ creators. We'd like to talk to you too—we will follow up! 3/3 @ChaseRoss We understand how these mistakes can hurt and make it appear we don’t support trans creators. Please know that we do deeply care about and support the trans community that's grown up on YouTube. 2/3 @ChaseRoss Hi, Chase. We’ll discuss more with you live but want to follow up here as well: To be super clear, our algorithm doesn't use LGBTQ-related words to trigger demonetization by themselves, and we are regularly evaluating our systems to avoid mistakes like the one we made here. 1/3 Ye is finally here. Listen to the latest from @kanyewest now → https://t.co/sHPmcWrwl4 https://t.co/8CZeKjsfhc RT @dreamingduchess: @CarrieHFletcher's instructional video on the correct way to pee whilst wearing a onesie. Changed my life 😂 https://t.… RT @AGtheadmin: Anything with @MatPatGT in it. https://t.co/ejypYAUvwz RT @Serious_George: One of my favourite behind the scenes videos ever https://t.co/fXSPmiUlmH https://t.co/DJqUyuCCkU RT @plantboyepml: @danielhowell — the top dan memes of 2017\n@AmazingPhil — why i changed my emo hair\n@SUB2AMAZlNGPHIL — how i met dan and p… RT @Pseudonym_112: Janelle Monae- Make Me Feel\nhttps://t.co/EPZAgZuXx4 https://t.co/DEkv4DNhG5 RT @trifena_sh: Not only makes me smile, but this video makes me proud of my home #NationalSmileDay \n\nhttps://t.co/mbutj4ipOk https://t.co/… RT @SpiritHQ_NaCl: Literally any @Linklightt or @alpharadtv or @Ninkendo video\nOh yeah, @FWOB_  too https://t.co/eIDrhSX4M9 RT @thecharlotta: Ed Sheeran - DIVIDE mashup by @TheVampsCon from @TheVampsband https://t.co/T8kMphL1Qn ❤️ #ConnorAppreciationDay https://t… RT @Real_Thiza: https://t.co/t4J99AsI97\n🎥 Whitney Houston - Greatest Love Of All - YouTube https://t.co/MsPIYAlLQN RT @slymudbug: The first video I ever saw by this YouTuber ( @AmazingPhil ) when it first came out, and his videos have been making me smil… RT @francoauah: Dog slap! https://t.co/mhzqP1L2mV https://t.co/Y3BNZyOqBA RT @Goddness_Athena: Any of videos uploaded by YT faves @shanedawson, @jamescharles, @tanamongeau, @_morganadams_, @madelainepetsch @bretma… RT @bloodypsyc: Today, @mikasalamancaa 's video of the whisper challenge made me smile and laugh  HAHAHAHAHA https://t.co/au3klReLo6 @BangtanTillIDie YES Getting lots of these with links, but it's easiest for us to share tweets with descriptions + links! RT @jinundercut: ALL BTS VIDS ALL ALL ALL https://t.co/LzMWVhLLOf Quote this tweet with a video that makes you smile. #NationalSmileDay Happy #WorldOtterDay! Juno and Lincoln are sea otters at the @OregonZoo, where the two orphans share cuddles and sushi. https://t.co/zRV49W9Vau https://t.co/Em6aqomJoZ Someone asked if we could make a show in which @JohnCena and @OfficialKat play truckers in space, and we made that oddly specific request a reality. #DallasandRobo is here! 🚀 https://t.co/9THg1diy9C https://t.co/pa4NdXc84W This is what it looks like when lava flows into the ocean. https://t.co/Amd7w0b1xn https://t.co/sdITMHauHu RT @YTCreators: Tonight we’re celebrating Asian Pacific American Heritage Month with @blogilates, @thewesleychan of @wongfupro and more #As… Life is like a timpano: it's full of good things, but it's a lot of work\nLife is like a timpano: it's sausages, meatballs, stuffed shells, eggs, &amp; pasta baked inside a doughy shell\nLife is like a timpano: it makes no sense ultimately\nLife is https://t.co/i2RfyTZR2d https://t.co/mV5NdNGqZr RT @brucenussbaum: How a YouTube video brought an extinct bird back from the dead https://t.co/UmNyDnAjUC This is our #PoemToWelcomeSummer: https://t.co/ye4w0IqXpp. https://t.co/MPgHrqijCt RT @youtubemusic: Three of the heaviest hitters in reggaeton and hip-hop come together on the same track. @iamcardib + @JBalvin + @Badbunny… Me vs. any activity that requires \"sensible clothing.\" https://t.co/zbaY6MhhBr https://t.co/MvJVO6wESt #MemorialDayWeekend plans: \n\n1. Go off the grid\n2. Adopt a friendly 🐶\n3. Labor alone in the woods to build an outdoor kitchen from wood you've chopped yourself.\n\n✅ skip 1-3 and play this to simulate the experience: https://t.co/idk3CZQbA1. https://t.co/VCEpEyTy7G #FridayFeeling https://t.co/KCM89qXUWv RT @tyleroakley: being transformed into Short Change by @monetxchange was a dream come true!! &amp; tomorrow on https://t.co/U8kn0yOpsA we’ll s… https://t.co/P6U3mXOQ29 https://t.co/oQ2JuyXDG7 The true measure of success. https://t.co/7AfW2kBLOo @NYCCOIB Next time. Watch @KosherSoul and @Jas_Townsend explain the origins and history of barbecue. https://t.co/fm6h2CNGbY https://t.co/NDihbieHF1 RT @youtubemusic: For anyone who had High Hopes for Pray For The Wicked... @PanicAtTheDisco delivers → https://t.co/zspdlvoMuE https://t.co… 5 Tips for Cooking Alone. https://t.co/tr5omgggSZ https://t.co/S6yillVlvs 7,000 dominoes. One @katyperry. Witness this: https://t.co/ANm7bm96jl. https://t.co/GdLkXI3VzU @b_boogey_xl @JamesReimer This. Very much here for city agencies using YouTube to make videos like...whatever this is. https://t.co/BCrbRO3T9d https://t.co/jRoyaYj48q Some turtles swim more than 1,000 miles to lay their eggs in the same sand where they were born. https://t.co/pMuqgpEArg #WorldTurtleDay https://t.co/tAzM0RYLNc Goth is better than alive. It is undead. https://t.co/hh17o8YrB8 #WorldGothDay https://t.co/8aZ3vNFI8n I myself am strange and unusual. #WorldGothDay https://t.co/gVSLdiPmwV https://t.co/wY9qggv7Tp RT @scalzi: It's apparently #WorldGothDay, so here's Bauhaus covering David Bowie whilst in a catacomb, and honestly I'm not sure how much… Getting ready for #WorldGothDay like... https://t.co/BvPLFWertp https://t.co/3sAnHcZtIG RT @youtubemusic: It’s time for a new era of music streaming. Introducing the completely reimagined YouTube Music. #itsallhere → https://t.… RT @StepUpSeries: YYYYAAAAAAAAAAAAAASSSSSSSSSSSSSSS! \nRT if you're as excited as we are for Season 2. #StepUpSeries \nhttps://t.co/ZZuQO0SIR… @MorganGavin Hi! Have you checked out our Creator Academy? https://t.co/D6mpHmIF63 It's OK to ask for help. People want to help you. \n\nThanks to @millselle for sharing her story: https://t.co/CxexFwSTUP. https://t.co/kpQYks0N9f @terragrossi Yes 🕷 People think I'm scary, but I wouldn't hurt a fly—ohno, ohnonono, sorry! Sorry! Gah! https://t.co/fCrKNf2wic https://t.co/KgTibe8lDt Just a video of some once-lonely rescue pups enjoying their new lives. \n\nHappy #NationalRescueDogDay! https://t.co/E8akbu4r7x https://t.co/EAFaXS9h3H RT @WSJ: You watch cat videos on YouTube. Jayson Tatum watched Kobe Bryant’s\nfootwork https://t.co/1wcrbc5Mna 🔴 LIVE NOW: Watch as Meghan Markle marries Prince Harry. https://t.co/QDczy2Bn8k #HarryAndMeghan #RoyalWedding https://t.co/yivtoBQY7n You can watch the #RoyalWedding tomorrow on The Royal Family's YouTube channel: https://t.co/rUbWPBVT76. https://t.co/nbjmItOWn5 You're invited to watch the #RoyalWedding live on YouTube tomorrow! Subscribe to The Royal Family's YouTube channel and set your reminder now → https://t.co/rUbWPBVT76 #HarryandMeghan https://t.co/fxkpY8FS1U Today's #CreatorOnTheRise, Pasta Grannies, is an entire channel full of Italian grandmothers demonstrating how to make handmade pasta. https://t.co/kYxb7eoQ36 https://t.co/RMVo1X5XdX RT @youtubemusic: Introducing our #ArtistOnTheRise, @JessieReyez. Check out Body Count, out now → https://t.co/x2rUWMELbh https://t.co/HuuS… We're pinning this. https://t.co/DnKd1HUwQU We've reached peak internet.\n\nHaru the Shiba Inu takes on the Yanny vs. Laurel debate: https://t.co/AZAQ8KFjpT. https://t.co/oiiTJNEwWq @YouTubeTV @tastemade yessss RT @YouTubeTV: Delicious news: @tastemade has joined the YouTube TV family! Get the latest in food, travel, design and more:\nhttps://t.co/D… Aaaaaaa, we could watch @tastemade all day. \n\n@youtubetv? https://t.co/owrqa4fc4Q The @OregonZoo's baby penguins, Pescado and Patata, just learned to swim. https://t.co/SkizmsJcVM https://t.co/znwrpElS42 Make some noise for Jungkook! 👏👏👏\n\nCatch more backstage shenanigans and rewatch Burn The Stage. https://t.co/zCig4tngn6 #BTSxYouTubeRed https://t.co/9bvcn1Rneo RT @youtubemusic: Secret’s out. Ready for a new era of music streaming? #itsallhere → https://t.co/mEertqG7tM https://t.co/xlrbIRGcCf RT @youtubemusic: Everything you need to become a @charlieputh stan in one playlist → https://t.co/o2s7k0FE0N This year, England hopes to put 52 years of abject misery behind it when it competes in the World Cup. In the new episode of #TrainingDays, @jackwhitehall visits Raheem Sterling, Dele Alli, and Kyle Walker to get ready. https://t.co/ryMjkgFfNK https://t.co/C7MKySDsC2 .@CloeCouture, what did you do? https://t.co/lgq0PPxyKx https://t.co/ZGGVOXwDxs @kathe_nettles 🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸 No 🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸 RT @YTCreators: In his must-watch new series, @ShaneDawson talks to YouTube OGs about the pressures of being a creator. \n\nFirst up, he trav… RT @KendraHotz: Things you find when you fall down a YouTube hole. 😀\n\nAn amazing bluegrass cover of \"Rocket Man\". https://t.co/mo6g8ztsZw v… AQUA Geo Graphic is an entire channel full of soothing Japanese nature footage for times when everything is too stressful. https://t.co/r5AlFDlKEJ 🌸🌸🌸 #CreatorOnTheRise https://t.co/tZj961u0bL The #BohemianRhapsody trailer is finally here. https://t.co/zVVZ6yNwf7 https://t.co/vrsA0WsumX @PhrozenGaming You guys, we did it! https://t.co/BuT4BTe3Ca Researchers tested different sugars, flours, and fats to create the ultimate chocolate chip cookie recipe. https://t.co/PFeX5Vfjbj #NationalChocolateChipDay #YouTubeTaughtMe https://t.co/VWSKUYw8d8 Current mood: Ryan Reynolds singing \"Tomorrow\" while dressed as a unicorn. https://t.co/4SaWyeoocR https://t.co/Y201oBIamA Today is the 20th anniversary of the Seinfeld finale, and @BestCoast sang a song as Elaine. https://t.co/8GxmVyKx14 https://t.co/bCQXBFcQ0s @Seinfeld2000 @BestCoast OMG @cluelesswill Your brand is strong. .@SlaylerJ is in @NYTStyles today, so it's definitely a good time to (re)watch all of her videos. https://t.co/iTmleyqLFe what if we all went into monday with the fresh eyes and pure heart of a baby wallaby seeing the world for the very first time. https://t.co/elkJRHZI2N https://t.co/lztnIAyczt RT @YTCreators: Happy Mother's Day to all creator moms! What moms do you subscribe to on YouTube?\n\n#MothersDay This #MothersDay, we're grateful to those brave enough to break the silence around difficult issues. https://t.co/xMFfNyrnxo https://t.co/2KQ7xTBMKW That time when a cat who had recently given birth to kittens found some baby ducklings and decided to adopt them. https://t.co/wde6egn5EA \n\nHappy #MothersDay to all the moms and odd ducks out there. 🐱🐣 https://t.co/fAkxkX6JMI Motherhood is...really hard, actually. As we get ready for #MothersDay, we're grateful to all the moms who talk about the more difficult aspects of being a parent. https://t.co/flVNroEUlV https://t.co/DlYTH7oPh5 These are great: https://t.co/h2ryhmGqKG. https://t.co/UEG8WVV0F7 @TheBandFF The ▶️ in our logo is actually just a giant pizza slice. Happy #EatWhatYouWantDay! https://t.co/7UBOosNbXQ https://t.co/yiLpRBodzc We put together 10 easy-yet-impressive recipes for anyone cooking #MothersDay brunch this weekend: https://t.co/AX0K8vbKbE.\n\nOr for anyone who likes brunch. https://t.co/QEQ8u6LCEt RT @ImpulseSeries: Prepare yourselves. #ImpulseSeries is coming June 6th. Watch the full trailer -&gt; https://t.co/A1aDUDlhsB https://t.co/hG… @matmanmad Only one way to find out. What if, instead of hunting humans to death, the cute robots spent their time making viral videos? https://t.co/ei8xHTHpPM The last thing you'll see before you die is adorable. https://t.co/4VTFuGScIV https://t.co/FcrVSSWFQl And that's how Will Smith became the Fresh Prince of Bel Air. \n\nThe real story: https://t.co/ny0w87qUpx https://t.co/7Zd8SCntrZ RT @youtubemusic: The hottest artists and songs *right now* are on the brand new YouTube Charts → https://t.co/SBn8t1UV05 https://t.co/YWCI… Celebrating #NationalShrimpDay with the world's tiniest fried shrimp &amp; shrimp tempura.🍤 https://t.co/Zb1l29myt1 https://t.co/l01S0bbUZQ People love useless machines because \"they're an expression of joy and humility that often gets lost in engineering.\" \n\nWe love @SimoneGiertz because she wore this machine to her TED talk. https://t.co/GIibUvi1dM 🤖💞 https://t.co/E1qXZroZcZ It's official: @CobraKaiSeries will be back for a second season! #CKSeason2. https://t.co/dzipThKJVN We have news. #CKSeason2 https://t.co/IiaAjybmv6 RT @DioraBaird: Will There Be A 'Cobra Kai' Season 2? https://t.co/oRQPKEXDez via @decider RT @imjeremytho: Ready for cobra kai season 2 now. RT @AlexShepiro: OMG..please do a Cobra Kai season 2!!!\nThose last two scenes...fantastic. Specially who walked into the Cobra Kai Dojo...O… RT @youtubemusic: TUNE IN. @labrinth, @sia, and @diplo present #LSD, their epic psychedelic pop supergroup, back today with Audio  → https:… This spider is desperately seeking his son, Lucas. Have you seen him? https://t.co/piuf5qCTBY https://t.co/fGr0KkAcVJ @itsdiannef see also: 💜 https://t.co/ALVC3yTtl0 @mybtsgrethan Going to get \"Who needs a boyfriend when you have Bangtan\" embroidered onto a pillow and cry into every night. 💜 @FangirlWatty 💜 https://t.co/yErXJTDULK @hassanoualy @BTS_twt you RN... https://t.co/wq6GeajTJO @Cutiepie1Syd  https://t.co/7MXuEpouQf @HugefanofBTS @BTS_twt  https://t.co/5nP0wlRxDQ @evii_kvcs  https://t.co/eCIcprUuMg @kandyavalos @BTS_twt 💜💜💜💜💜 @bntvsqz11  https://t.co/kPU1LoEzDl @jeon970 @BTS_twt Same 🙏❤️ 🎵 @soulstaece @BTS_twt  https://t.co/T9tCu8x5hn 1. @jackwhitehall describes his new show as being \"like Carpool Karaoke, but with footballers.\" \n\n2. Jack Whitehall can't drive. \n\nWatch #TrainingDays now: https://t.co/7MeKDk5mR5 https://t.co/SGPNBwoSG6 @taetertot96 @BTS_twt  https://t.co/4Xld6drECX *Bucky Barnes voice* Let's hear it for Captain America. https://t.co/Pvt1wGFyaK https://t.co/lLOIQ21029 @soyoonmin  https://t.co/OYBKlwDVgs @BtsFamLove @BTS_twt  https://t.co/sJy5iQP7Zm The family that stans together, tweets together. #BTSArmy, join us NOW for the #BurnTheStageFinale! #BTSxYouTubeRed ➡️ https://t.co/kvbhRusRN4 https://t.co/4lLXQXyqFB 🚨 ONE HOUR, #BTSArrmy🚨 Show us how and where you’re watching the #BurnTheStageFinale! #BTSxYouTubeRed https://t.co/Z9XSrahlA4 T minus 6 hours⏰ until #BurnTheStageFinale! Actual footage of us right now 👀  #BTSxYouTubeRed https://t.co/YDbeSrHep6 @christortiz41 That's great! Bonus gif of a helpful math teacher to bless your timeline. #TeacherAppreciationDay https://t.co/kXGGTHAGUO https://t.co/Rw6Bx9mZlv Happy #TeacherAppreciationDay to all the teachers who use YouTube to share their knowledge with the world! \n\nProfessor Leonard's To The Point Math: https://t.co/hBu6mH1TPA. https://t.co/lezsVEv2Er RT @YTCreators: Today's #CreatorOnTheRise Matice Ahnjamine creates videos that encourage stutterers and educate non-stutterers (so you don'… @AvidDiva Love it—who are your favorite older creators? ⏰ Time to take a break?\n\nStarting today, we’re updating the YouTube mobile app with features that help everyone understand their tech usage, disconnect when needed, and create healthy habits. Read more here: https://t.co/2uREFV8rMm https://t.co/hXDwfGUhqe 🎉Thrilled to announce our 2018 #CreatorsforChange Ambassadors!\n\n🇺🇸 @jouelzy\n🇨🇦 @EhBeeFamily\n🇲🇽 @vico_volkov\n🇫🇷 @SwannPerisse\n🇵🇭 @janinavela\n🇮🇳 @iamMostlySane\n🇦🇪 @MahaAj\n🇦🇺 @lfreshthelion\n🇬🇧 @HumzaProduction \n\nAnd so many more: https://t.co/CPP8rfMSHs. https://t.co/kDQ2g07Q3O Hey, #BTSArmy! There’s just 24 hours until the #BurnTheStageFinale goes live. Are you ready to watch and tweet with us? #BTSxYouTubeRed https://t.co/BVjEANrBdJ These are some of the things people say to you if you're a YouTube creator like @IISuperwomanII. https://t.co/i6AgS0SV6x https://t.co/TmQeoEUdNA RT @error_void: well i've fallen into a new youtube hole https://t.co/6lnoGRWCQK @memorie_holiday We love The Slow Mo Guys. Lena Waithe wore it better. https://t.co/cLtBMOfu10 There are many videos of cats riding around on robot vacuums.\n\nThis is not one of those videos. https://t.co/8bGrPdB7no https://t.co/UamEkCLzJ4 Ain’t no party like a #BTSxYouTubeRed party because this party is WORLDWIDE! \n\nRSVP by replying with your best BTS gif + #BurnTheStageFinale.\n\nBe there at 11AM EST on May 9th or be ⬛️ https://t.co/L0B4CJ68Sg Our #MetGala outfit is just rainbow paint on a speaker in slow motion.\n\nWhat's yours? https://t.co/zVVCGasU1J https://t.co/XkoXjsej6a RT @youtubemusic: This Is America. \nThe latest from @donaldglover → https://t.co/W1pLxEyBo4 https://t.co/o1zPZqLsdj *suddenly develops a renewed appreciation for LEGOs* https://t.co/AfLNRMCGAm https://t.co/ctLlhrsZuH @_Epistol_  https://t.co/ylZBGhs1Ti @CreightonJK This is also extremely groovy. @chilosa2004 Your brother had good taste. There's a disco version of the Star Wars theme from 1977, and it's the grooviest thing you've ever heard. https://t.co/Vh5pb6YGta #MayThe4thBeWithYou #StarWarsDay https://t.co/K5ypSVFIdn When it's #MayTheFourth and everything is suddenly Star Wars-themed: https://t.co/80qv3VPlbW #MayThe4thBeWithYou https://t.co/VXnaYl8EdO Happy #StarWarsDay! Here's Ron Howard narrating Star Wars as if it were Arrested Development: https://t.co/HkCICur3tS. #MayThe4thBeWithYou #MayTheFourth https://t.co/rfybvpOWS0 @Okiedokie_Liv @ItsScottieTime @jackwhitehall It will be free to watch! @ItsScottieTime @jackwhitehall This will be available in the US! And for free, too. There’s only one man we would trust with the world’s best footballers. He was busy, so we got @jackwhitehall instead. #TrainingDays, only on YouTube. Watch the trailer here: https://t.co/NlVCaKslSo. https://t.co/pX9lsB1Hrb @memorie_holiday @KingJames @ddlovato @priyankachopra @KevinHart4real @jackwhitehall Thanks for this. It brings us joy too! \n\nWe're adding more original programming to YouTube—we're not taking anything away. We know that creators are what make YouTube special. @MrFluckOff @KingJames @ddlovato @priyankachopra @KevinHart4real @jackwhitehall Thanks for this feedback. We know that demonetization has been a source of pain, and we're working on a more accurate solution that includes more human review. We also know that creators have felt a lack of communication in the past, and we want to improve that too! 🎉🎊We're excited to announce our new slate of YouTube Originals!  \n\nComing soon: \n\n▶️ Will Smith\n▶️ @KingJames\n▶️ @ddlovato\n▶️ @priyankachopra\n▶️ @KevinHart4Real \n▶️ The Slow Mo Guys \n▶️ @jackwhitehall\n\nRead more: https://t.co/GiNv8zR8N0 RT @YTAdvertisers: Ready for a great night at #Brandcast! Follow along here for updates throughout the entire show. https://t.co/bMR0IcCU6K This is your regular reminder that jellyfish are terrifying: https://t.co/VSmhcQ7KmS. https://t.co/HXpKGccGmn RT @YTCreators: .@iamcardib +creators living their best lives. For more #CreatorSummit behind-the-scenes, make sure to check out our Instag… RT @YTCreators: Day 1 of #CreatorSummit complete!\n\nThe highlights for those following at home:\n\n✅Panels 🤓\n✅Friends reunited 👭\n✅Bowling! 🎳… RT @youtubemusic: .@Labrinth, @Sia &amp; @Diplo present #LSD → https://t.co/yUUUFvr4HM https://t.co/4SUByltYPG ICYMI, @ArianaGrande sang \"God's Plan\" as a 90's diva hit on @FallonTonight. https://t.co/JeUXv6jz64 https://t.co/GBbzCyf7og The #KarateKid legacy continues. All 10 episodes of @CobraKaiSeries are now streaming on YouTube Red! Watch the first episode: https://t.co/qNfDXMrHBy. #CobraKai https://t.co/FI3xrWsAvS RT @GloomyKassie: Shane Dawson is one of those people who consistently reminds me why I love Youtube. Don’t sleep on his new series. Neverland has been found, and it's in Belize: https://t.co/Dg4snuknmn. https://t.co/mVYC5A7dBu Over 300 days on tour and we've got footage of it all! The penultimate episode of Burn The Stage is here! #BTSxYouTubeRed https://t.co/mDs7QreUFD https://t.co/S754KHsf6c That moment when someone says Sebastian Stan looks like a potato. https://t.co/uFuy3WjoTP https://t.co/AyYTbfIlEl When internet friends meet for the first time. https://t.co/4dY0NcFgp4 https://t.co/EYsr8jC0Ff RT @youtubemusic: The interview is here. @kanyewest sits down with @cthagod → https://t.co/nRNAOY0Qgh https://t.co/m4W7716fMC Watch this if you wish you could leave everything behind and live in the wilderness. https://t.co/mXZBtacqDo https://t.co/TwtUuhbY88 This video shows the incredible difference one person can make in a shelter pet's life. https://t.co/E8akbu4r7x #NationalAdoptAShelterPetDay https://t.co/qLTMVtTsbC @SimoneGiertz ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ Buster is a Chihuahua mix who likes afternoon walks and movie nights on the couch. #NationalAdoptAShelterPetDay https://t.co/E6k0JxkayJ https://t.co/iCtyzQV1YP Cat videos as a force for good: this #NationalAdoptAShelterPetDay, we're celebrating the people who use YouTube to help animals find their forever homes.\n\nTinyKittensHQ runs a 24/7 livestream of their \"caternity ward\" where kittens play, nurse, and nap. https://t.co/FTOckwUTo0 https://t.co/poqnFEsyc7 RT @YTCreators: Happy #SmallBusinessWeek! YouTube creators are partnering with @Google to shine a light on their favorite small businesses.… How a secret message in a children's book led to a real-life treasure hunt: https://t.co/IRKymsAR4N. https://t.co/4z7sKlzFlB You could test every possible combination of flour/fat/sugar in your search for the perfect chocolate chip cookie. \n\nOr you could watch this video: https://t.co/PFeX5Vfjbj. https://t.co/MMo9V3H6GM TFW you really want to be part of that world. https://t.co/3lDbW531X5 https://t.co/OUtZ6Hb2t2 RT @youtubemusic: Get ready to be cleansed. Watch @JanelleMonae's emotion picture #DirtyComputer now → https://t.co/sBZJxfd8gb https://t.co… Happy #ArborDay! Trees use underground networks to share resources with each other. https://t.co/Ov5pg7Sn0u https://t.co/JusRhy1L2N Here we go again. https://t.co/57iGVzEq8g #FridayFeeling https://t.co/wtQyMlhLIW You have $15 to build the perfect man: \n\n$300 - well-dressed\n$200 - good at sports\n$400 - read your favorite book\n$10 - plays music\n$5 - is a spider\n$500 - opposable thumbs https://t.co/sLqHStqa5M You need this: https://t.co/2F5Gl7ishI. https://t.co/fS4D23VU9r @yoops3 You just did! 🕷💞 @yoops3 Adorable. The tarantula's name is Louise. https://t.co/9RMzBayuJu https://t.co/8mPuqf8hO5 If this picture of a tarantula watching Lucas the Spider gets 1,000 likes, we'll post...another picture of a tarantula watching Lucas the Spider. https://t.co/7uEXVeL4WT https://t.co/PH8Gx1pqeD No tapping out here! Watch @KevinHart4Real &amp; @JoelMcHale get in the boxing ring with heavyweight champ Evander @Holyfield on an all new episode of @WhatTheFit! https://t.co/oSgtrWtypS https://t.co/T9FiyHjGq8 @LuXDoe165 That's @sofiedossi. This is your #NationalPretzelDay reminder that humans are amazing. https://t.co/ML8vWjPg1W https://t.co/RVdmqV1rqQ They put on the most epic show EVER. Stay tuned for a new episode of Burn The Stage. #BTSxYouTubeRed https://t.co/k9UFCULGkd https://t.co/2IslEcrl2c 🕶 Sweet shades, Jin 🕶 Did you bask in the awesomeness of @bts_twt? Catch up on new episodes of Burn The Stage! #BTSxYouTubeRed https://t.co/HKxWrvXQKy https://t.co/eko4ofZufv The internet is just penguins now. https://t.co/NR8JPiyLpo #WorldPenguinDay https://t.co/r1wUfYPkG8 Happy #WorldPenguinDay, the day when we acknowledge that nothing makes sense, only penguins. https://t.co/9kcyMBagzx https://t.co/rLtpOJXYUs RT @youtubemusic: 🔴 [LIVE] But what does it all mean, @ShawnMendes?! We'll stay tuned → https://t.co/07OsGj8d9n It's as close to hanging out with Steph Curry as most of us will ever get. @StephenCurry30's new YouTube series, 5 Minutes From Home, premieres May 1st. Subscribe here so you don't miss it: https://t.co/qPAjruMHh2. https://t.co/KwodPir6Mp This is amazing. Please DM us an address where we can send you a care package. https://t.co/iUu6Hg9lLW @TheWittleDemon He's beautiful! @JohnsonJakob 👀 RT @YouTubeTV: .@BrockmireIFC fans, we have a treat for you - a Q&amp;A with #Brockmire himself, @HankAzaria! Send him your questions using #Yo… Simone Biles has returned to the gym after a long break. \n\nThis is Simone Biles WHEN SHE'S OUT OF SHAPE.🥇🥇🥇🥇 https://t.co/eHn0tQC6do. https://t.co/GIMWGSyrrL There he sat, with 37 different guitar pedals. And then it hit him. \"I should play them all at the same time.\" https://t.co/F1sswoZWWA https://t.co/ZgnwyiSIzQ RT @matosman: That last tweet has sent me down a rabbit hole. Here's a Playmobil version of Joy Division on Something Else.\n\nhttps://t.co/8… \"Some people choose to see the ugliness in this world, the disarray. I choose to see the beauty. To believe there is an order to our days. A purpose.\" https://t.co/RujmNItMku https://t.co/gwRhPk6XNB Bob Dorough, the composer and jazz musician responsible for much of Schoolhouse Rock, has died at 94. Here's a video of him singing Conjunction Junction, which he wrote: https://t.co/HT3BL6cJVt https://t.co/pdboeBQ8qT RT @youtubemusic: Because it's in our blood. \n@ShawnMendes is back with the #InMyBloodVideo → https://t.co/fUUeDaMrGE https://t.co/C0xVInzy… @_ddreadsbooks_ @ZikonissBooks @rhiannonthropp @dannareadsbooks @MorgyyWorgyy @Nenalogy @rocky_reads Thanks! @ChrisEgonSearle This. \"I'm not a hero,\" says the unarmed man who disarmed the Waffle House gunman. https://t.co/7778BpfKW6 https://t.co/yASgWFJnFa @ZikonissBooks It is really amazing. Which channels are your favorites? Happy #WorldBookDay to everyone who uses YouTube to find new books to read and new friends to talk about them with. https://t.co/eA9jd7tuev https://t.co/53OjL4IE10 RT @xlokeahx: Twitter.. I come bearing gifts. The Wendy’s 80s training video. It’s a cringe fest.. I can’t stop watching! 😂\n\nhttps://t.co/k… RT @kojiarsua: I CAN’T STOP WATCHING THE CRAZY RICH ASIANS TRAILER https://t.co/JygT7xgXL0 There they are! 👶🍼🎥 https://t.co/zvZfGPqYBn https://t.co/KMEPfui2bP @Schirombaseball Happy birthday! The first video on YouTube was posted 13 years ago today: https://t.co/rX361wUkBu. https://t.co/hrTy1niqSl @AshleyBeauty43 not all heroes wear capes https://t.co/w0ZGGNjVPR You won't see the #royalbaby, but this live feed of self-conscious police officers and passerby outside St. Mary's Hospital is surprisingly entertaining. https://t.co/zvZfGPqYBn https://t.co/BQG6cSajNw Plastic pollution is a deadly threat to our ocean. Watch @NatGeo explain how we can clean up our act: https://t.co/ywp79lCRFP. #EarthDay https://t.co/yjxCy8xZGI \"We're trashing our planet to grow food that no one eats.\" \n\n@UCLA teamed up with @voxdotcom to explain why food waste is the world's dumbest problem: https://t.co/RVdeOXRwkZ. #EarthDay https://t.co/7ASITSgBSz Happy #EarthDay! This is what the 🌎 looks like from space: https://t.co/XRi7oIkwOM.\n\nWatch our playlist to learn what you can do to protect it → https://t.co/JN5uLtpp8y. https://t.co/yJSIuJHQ8J It's the weekend, it's finally spring, and these rescue kittens think this golden retriever is their mother. https://t.co/JPsG3m8tEP https://t.co/VmuCCD9Ut7 @HikeTheGamer Who are your favorites? The 4 basic conflicts: \n\negg vs. man\negg vs. nature\negg vs. self\negg vs. the refrigerator → https://t.co/B5YDZyyqf9 https://t.co/zcBVDx0Qkx TIL that Reefer Madness is on YouTube. https://t.co/djikZvxlLz #420day https://t.co/GQkl31c71C RT @youtubemusic: RIP @Avicii, our thoughts go out to his family and friends. https://t.co/VcyaOfzLej @CasualFortnite @netflix Yes. extreme same https://t.co/uTO9PuqhQv Today is the #NationalSchoolWalkout, and students across the country have made videos to explain why they're walking out. Here's one of them → https://t.co/L65CkP4IZx. https://t.co/YFGKqOAGmk Prince's estate just released the original studio recording of \"Nothing Compares 2 U,\" and it's amazing → https://t.co/1cRBkhtlYs. https://t.co/go91n4aF7m When you've been watching tiny food videos for three hours → https://t.co/h7nwH5vQlN. https://t.co/j2bPMNwsM5 @MKBHD where's the robot-with-heart-eyes emoji when we need it @thisischandresh @MKBHD, apparently Meet the camera robots who film the shots that humans can't take → https://t.co/hKzv6Tyc57 https://t.co/9ePoGYKoiB @TheovdMeer Dog who is also an influencer on YouTube. Teach your dog to high-five → https://t.co/PjXpTFJCwz. #NationalHighFiveDay https://t.co/N3zhepb8Is \"Then the door burst open and Security put his hand on my face and shoved me out of the way like he never saw the Fresh Prince.\" \n\nWill Smith tells the story of the time he met Michael Jackson → https://t.co/ArFgJsZda9 https://t.co/CzuTw8ZAb5 RT @youtubemusic: ʎɹɔ oʇ ʇɟǝl sɹɐǝʇ ou 4.20. → https://t.co/khR9GvyUbq https://t.co/KBUbSUlwi7 GO TEAM https://t.co/Q8GQ4scJWU PSA: There's an entire category about YouTube on @Jeopardy RIGHT NOW. LIVE NOW: @SpaceX is launching @NASA_TESS into space to search for new planets. 🚀→ https://t.co/xLrHkiVPmX #TESS https://t.co/lkOHopYAhJ Historically accurate longsword move: if your opponent is too close, hit them with the hilt. https://t.co/eMmPp1HoyI https://t.co/kBAbok1Lls Sometimes, being a scientist means replacing a bunch of male toads with 3D printed replicas. For science. https://t.co/3wFGvU88DL https://t.co/9JUeAbwrj6 Baby goat siblings\nWhispering to each other\nOnly 2 days old → https://t.co/k5giNcYcCP\n\n#NationalHaikuDay https://t.co/8dxMgxue3z It's getting easier and easier to create fake videos of real people, like this deepfake featuring @BarackObama: https://t.co/J3HniykMFl.\n\nRead these tips on how to spot a deepfake: https://t.co/xo8xRorvDA. https://t.co/OgCFFUAgNu RT @SusanWojcicki: Earlier this year, I outlined our priorities for creators in 2018. Sharing some updates, and looking forward to sharing… @Mossie_Evander We're here for you! Shout-out to all of the people searching \"How to do my taxes\" on YouTube right now. #TaxDay #BatAppreciationDay https://t.co/Xt4uhJw8Cn RT @ChappellTracker: someone on YouTube keeps uploading episodes of tv shows with no dialogue, just reactions, and I can't stop watching th… \"@SimoneGiertz made a new video!\"\n\"Cool, I'll make some popcorn.\"\n\n🤖🍿🔄→https://t.co/eh5iFPKNfg https://t.co/gayKQe3EW7 RT @lauraseed_: Started on a YouTube hole after listening to Alice DeeJay, and now autoplay has helped me create my very own 90s trance dis… THIS IS TERRIFYING → https://t.co/LGpqqBb0Xj https://t.co/7tuTX1HFpb When the \"easy\" goal is way harder than going after what you actually want. https://t.co/rGkr6EDz2M #MondayMotivation https://t.co/GqAazXP9pZ @sonicmario_111 Hi! That's a temporary icon that was created by a Googler to show support for our YouTube family in the wake of the recent shooting. It's only up for a week (and will change back soon). Monday mood. https://t.co/IFNJryvUcE RT @YTCreators: We love this, @pleasantandy. And we will be checking out every creator who you all tag here so we can signal boost as well.… Piece of cake. https://t.co/RfFsP4OsVP https://t.co/7agzX4yCJB RT @youtubemusic: Hey @MattSteffanina, you're good to take over our IG stories for the second day of @Coachella, right? We'll be backstage… \"I went to the woods because I wanted to live deliberately. I wanted to live deep and suck out all the marrow of life. To put to rout all that was not life; and not, when I had come to die, discover that I had not lived.\" —A crocodile eating a watermelon https://t.co/rezhFHHQha https://t.co/RHSVb7xfie We’re with @DVF at the #DVFAwards celebrating women creating change in their communities around the world. #INCHARGE\n\nFollow along on our Instagram stories ➡️ https://t.co/2mICujQHf5 RT @youtubemusic: .@coachella is finally here! Instead of scrolling through everyone's posts, beat the FOMO with our livestream all weekend… RT @YouTubeTV: Big thanks to @TheWebbyAwards for nominating YouTube TV! We thank you from the bottom of our unlimited DVR. https://t.co/hk8… This is why some people fear the number 13 → https://t.co/j5K7nACsgl. #FridayThe13th #YouTubeTaughtMe https://t.co/ogAOvpwzqz A correspondent from @NatGeo traveled across Mexico to film this love letter to bats. https://t.co/SLAi6SICzf #FridayThe13th 🦇 https://t.co/KbpQEuBT5Q Happy #FridayThe13th to all the strange and unusual people out there. https://t.co/5W2KuONjQt https://t.co/jPuSD6Epry When you're only a tiny bit hungry. https://t.co/LVOxMSmJxg #CreatorOnTheRise https://t.co/K7wylXZxxc Your #Oceans8 name is the first name of your maternal grandmother + an unbelievable outfit. https://t.co/4ebwCpuqv3 https://t.co/F3Zsso6mbd Regular brain: \"I'm not going to play hopscotch; there's probably a hidden camera somewhere.\" \n\nGalaxy brain: https://t.co/PmFAGA928k https://t.co/CkRLqscqiL Happy #NationalGrilledCheeseDay! Don't overthink it. https://t.co/qHQ7bgsPFH https://t.co/heRq412ep8 @ShinzuMusic @Kurz_Gesagt Thanks for sharing! RT @YTCreators: WATCH: @noorstars26 and YouTube Chief Business Officer, @rkyncl discuss the questions on creators' minds ➡️ https://t.co/Jk… @ShinzuMusic We try to do both of these things—we just don't see it as an either/or situation! What are your favorite educational channels? @simonberman21 YouTube is a safe space for hydraulic presses. How to turn aluminum foil into something beautiful and unexpected, then crush it in a hydraulic press → https://t.co/w5dQuLPfBW https://t.co/K70EvC9Xwr #NationalPetDay https://t.co/laap9M0LRX @GrandHans_ @Lesdoggg @MiniatureDream Soon! It looks like the kitten and @Lesdoggg are about to race each other for @MiniatureDream's tiny samosas. https://t.co/3A37lnc82U https://t.co/DdXhuNY7Vg Incredible video of @virgingalactic's VSS Unity as it made its first rocket-powered, supersonic flight last week.\n \nSpace just got a little closer. 🚀https://t.co/8NL8SAvHWS https://t.co/wSeUB0YFyr Happy #NationalPetDay!\n\nRT if your pet is actually a video of kittens in slow motion. https://t.co/ILTQcMZZ6c https://t.co/9gCRcQrJBC @GrimbleLewis 😻😻😻 @hijetegg @OfficialMonstaX Hi there! Please don't worry—as we've explained before, this is actually a normal part of how YouTube validates views to make sure they're real. Temporarily slowing down or even freezing a video's view count is expected. More details here: https://t.co/znnXB8GhRj Your cat says \"I love you\" with a long, slow blink.\n\nIt's actually saying \"I trust you not to kill me,\" but hey—take what you can get. https://t.co/4OyCkiK7PM #NationalPetDay https://t.co/x63XHpZ6ZG We're already getting ready for the Friday feeling! A new episode of Burn The Stage is here! #BTSxYouTubeRed https://t.co/1PuEPkIkRX https://t.co/9fELpR8xo3 RT @YouTubeTV: The men of New Girl (@iamgreenberg, @MrJakeJohnson, and @LamorneMorris) are ready to take the Q&amp;A LIVE - head on over to @Yo… @HITMAN_FANBASE @TeamYouTube @youtubemusic @iamcardib @YTCreators @YouTubeGaming @YouTubeTV @BTS_twt ▶️YouTubeRed: is an ARMY Happy #NationalSiblingsDay to ours!\n\n▶️@TeamYouTube: the nice one\n▶️@youtubemusic: only talks about @iamcardib\n▶️@YTCreators: vlogs @ the dinner table\n▶️@YouTubeGaming: yells \"Dream Daddy, but with zombies!\"\n▶️@YouTubeTV: prefers unlimited DVR to actual friendships RT @YTCreators: ICYMI, @Madonna and @KimKardashian dropped by @YouTubeSpaceLA to tell their beauty stories  --&gt; https://t.co/zmYJ73BPSR Happy #NationalSiblingsDay, whatever your family might look like. https://t.co/5OxKooqvoz https://t.co/Nt4yDE0Tt3 Did you see the premiere of Burn The Stage? It got our ❤️s pumping. Get to know @bts_twt and keep an 👁 out for the next episode! #BTSxYouTubeRed https://t.co/f03XQ6pD3x https://t.co/WIxBz7mUIy This is the Moon's south pole.\n\nThe highlighted areas show possible water ice. \n\nThanks, @NASA. https://t.co/b0pA9DXrN1 https://t.co/j1VUra91nB RT @youtubemusic: 📺 He Was Never There 📺\nGo behind the scenes of @theweeknd’s My Dear Melancholy, → https://t.co/19grVgagPw https://t.co/DR… Lando: A Star Wars Story (2018) https://t.co/7rFRLPzZ5s https://t.co/hlR1gLfF2g @smhmelissa__ ❣️❣️❣️ RT @JeremyAbramson: There is no YouTube rabbit hole quite like soccer highlight YouTube rabbit hole.\n\n\"TOP 10 PENALTIES FROM BOTTOM-TABLE A… @LivingDadly Thank you! We're back, and we've been watching dog grooming videos for 4 hours. https://t.co/NHZx7KlEqR #CreatorOnTheRise https://t.co/DXPFeDLcoe RT @vidIQ: The attack at @YouTube HQ wasn't on a platform, a website, or a building. It wasn't an attack on something abstract. It was an a… @The_GG_Gina ❤️ Thank you. @iCrazyJa Thank you. @breanne_carissa ❤️🌉❤️ @RickyPDillon Thank you! @lukewaltham Thank you. @JamieAndNiks @KD Thank you! @gene_hf ❤️❤️❤️ From all of us at YouTube, we want to thank the San Bruno Police Department and first responders again for your swift and attentive response. https://t.co/hyBTc5Fq1b RT @Google_Comms: An update from YouTube. https://t.co/HG4LgCupRi Dear YouTube Community,\n\nAs you know, yesterday was an incredibly difficult day for our teams in San Bruno and around the world. Thank you so much for your concern and support.\n\nAll of us working here at YouTube are very grateful for this amazing community. RT @SusanWojcicki: There are no words to describe how horrible it was to have an active shooter @YouTube today. Our deepest gratitude to la… RT @Google_Comms: Here is the note that @sundarpichai just sent to Googlers worldwide. https://t.co/bdC6KeTl9c RT @Google_Comms: Re: YouTube situation, we are coordinating with authorities and will provide official information here from Google and Yo… @acbwodahs  https://t.co/LcAPnNWySP Machine learning is artificial intelligence, but not all artificial intelligence is machine learning. @neiltyson, @MKBHD, and @chucknicecomic explain: https://t.co/XalyD4anTF. #YouTubeTaughtMe https://t.co/RNd4lv757O RT @ThisIsEverythng: Best Trailer?! We think so too. GO VOTE: https://t.co/WXGWuPb0Hg  @trailerparkinc @YouTube @selectnext @TheWebbyAwards… We all love Lucas. 💖🕷💖 https://t.co/BhZNNrOZ4R 🎶You're probably wondering how I learned to sing\n🎶Well, it's not important\n🎶Watch me play this thing → https://t.co/ZXW3Nv1caw https://t.co/CvjD5spDfA @msjazzsquare please subscribe us to this list. Think fast, BTS fans. Tap to pause on your favorite @bts_twt member and don't forget to catch up on Burn The Stage before the next episode! #BTSxYouTubeRed #BTSArmy https://t.co/EaJtqG26nq RT @googlecloud: Live from San Antonio: Grab your snacks, it's going to be a three-fest in the 2nd half. 🍿 We predict 21 three-point attemp… When we use social media to amplify the voices of those directly affected by sexual violence, it can become a powerful force for justice. https://t.co/lSC48EsCcE #SexualAssaultAwarenessMonth https://t.co/x1I83pNlzp RT @TeamYouTube: Thanks for your patience, the 500 error is now fixed! https://t.co/9ooRVS9sh8 We're working on it right now—@TeamYouTube will send an update as soon as it's fixed! https://t.co/FzubkvBnGj Keep telling people. #SexualAssaultAwarenessMonth https://t.co/Xmc4ogsAq7 https://t.co/yg1roCpslO RT @TeamYouTube: Seeing this 500 error message on YouTube? We're on it! https://t.co/ArPDUDxUcp @AndrewP85530487 Yes, unfortunately. @TeamYouTube is working on it right now! April is #SexualAssaultAwarenessMonth, a time to lift up the voices of sexual assault survivors and work together to prevent sexual violence. Here's a playlist to learn more: https://t.co/dSyryhLD2A. https://t.co/ZK1Wrco08m Happy April? #snow https://t.co/Kf4U0c9C1n Happy Easter, #BTSARMY. #BTSxYouTubeRed https://t.co/GhHgk1zZxn Happy #Easter! We're celebrating with a rabbit hole of rabbit videos: https://t.co/QisYB9fUqE https://t.co/rlYPBSTx66 RT @YTCreators: “In this video, I wanted to shed some light on what it’s like transitioning in different countries.” \n\nThis #TransVisibilit… 🎶Yes, I'm watching YouTube 🎶\n🎶With nipple grafts 🎶\n🎶And trying to pass 🎶\n🎶And taking T 🎶\n\n\"A Song About Being Trans,\" by @jammi_dodger94 and @sherbetlemon007 → https://t.co/EUhh05UJ0a #TransDayOfVisibility https://t.co/fqIo0peDPg \"We have always existed, and we continue to fight.\" We love this trans history from @zackarydrucker, @Lavernecox, and the @ACLU. Happy #TransDayOfVisibility! https://t.co/0HUS9uNlw5 https://t.co/29Y3eQmVFq Creators: Let's do this! https://t.co/MgiINnKr1t #ILoveBeingTransBC https://t.co/YQvPWDKUAc #HappyPassover to everyone who has ever searched YouTube for \"animals eating matzo,\" and to everyone who's about to search right now. https://t.co/8ZbMFsUBWk https://t.co/wD9BI2YgPn RT @youtubemusic: 🔴 [LIVE] The first round of #FreeStyleFridayBET is here! You're up, New York → https://t.co/DUcvhbqkVN Welp, this video went downhill fast. https://t.co/Er8yhJSYVI https://t.co/nYukRg93PO RT @youtubemusic: Who's ready for #FinesseFridays? Tweet us your Finesse dance cover with the hashtag, and tomorrow we'll RT the one drippi… RT @YTCreators: It’s all happening!\n \nWe’re honoring your milestones with the new Silver and Gold Creator Awards.\n\nYou made it, so show us… Oscar Isaac: \"OK, great, I think we nailed it that time.\"\nCarrie Fisher: \"Mm. One more take.\" \n\nCarrie Fisher slaps Oscar Isaac over 40 times → https://t.co/bGvs0ta4m2 https://t.co/k8uztedKcE @msx__31 @ImpulseSeries Hi! This is actually a normal part of how YouTube validates views. Temporarily slowing down or even freezing a video's view count while we make sure all views are real is expected. Here's more info: https://t.co/znnXB8GhRj @Worthy3_ What if we just said hi? 👋 You can't control what you don't understand. @ImpulseSeries coming soon to YouTube Red. Watch the full teaser: https://t.co/GKbWOf3VCs #ImpulseSeries https://t.co/2lPOCIIDzW RT @YTCreators: Welcome to YouTube, @DwyaneWade!\n\nWe're excited for you to bring the 🔥HEAT🔥https://t.co/THNqmPG6Og https://t.co/qKj64aGpYT RT @kookieandlove: how to cry in 0.4 seconds #BurnTheStageIsComing https://t.co/ALqbOOwcN2 If I told you about her, what would I say? That they lived happily ever after? I believe they did. That they were in love? That they remained in love? I'm sure that's true. #ManateeAppreciationDay https://t.co/cJxZZGXFoh https://t.co/J7rkC7842U Their Blood, Sweat, and Tears went into this tour. Watch @bts_twt Burn The Stage now on YouTube Red! #BTSxYouTubeRed #BurnTheStageIsComing https://t.co/K0LjjBsOTF https://t.co/KXfdXbsQYr 🚨ATTENTION #BTSArmy🚨 Thank you for your amazing support of #BTSxYouTubeRed! Stay tuned for the premiere of Burn The Stage tomorrow. https://t.co/HZQb9AVW3A Ce que je sais\nJe reviendrai https://t.co/B4AL94Buu8 RT @YTCreators: This #MuslimWomensDay, we're spotlighting creators who use their platforms to speak up for women in their communities → htt… @smikey_nick yes Forever inspired by Ms. Yeah, office lunch hero of Chengdu. https://t.co/aMkvi0SIKL https://t.co/Um0LpP1l5W RT @YouTubeGaming: ¡Esto es increíble!\n\nCongrats to @Rubiu5 for organizing a stream with 100 other creators and setting a record for bigges… 🐰We ❤️ our golden maknae, even though he never stops joking around. It's #JungkookAppreciationDay, so share the best of Jungkook! #BTSxYouTubeRed #BTSArmy https://t.co/FbMjrJjHq4 Happy #MuslimWomensDay! Check out #CreatorsforChange fellow @xoamani's live Q&amp;A @muslimgirl. https://t.co/AZ0eVHKWtT Yes, selfies make your nose look bigger: https://t.co/KIfO4pdW6S. https://t.co/YVzxUC6MAy When you're growing a lot, but it's all below the surface.🌱 https://t.co/z87bhbpF0d https://t.co/7F5YQQFOzC If you missed @ddlovato's powerful #MarchForOurLives performance...don't miss it. https://t.co/KdkDOtz9dQ https://t.co/jILQoJwbTt @MemedTweeter definitely not. https://t.co/Ht5F0i6jwG https://t.co/m7TOG0i7Ak @FireBlaze1901 It's coming soon. @jayatflight Now they both do! 🤖 Calling all Androids 🤖\n\nNow the YouTube player will automatically adapt to the shape of the video you're viewing, so you can see more of your favorite videos! https://t.co/0Gk0hXav0I Current mood: watching the longest snake on earth eat a deer whole. https://t.co/eikYH5xxKU https://t.co/mmcbqdSkQm 🐯 It's #VAppreciationDay! Celebrate this songbird by sharing your favorite facts, photos, and V gifs! #BTSxYouTubeRed #BTSArmy https://t.co/ddy7cKwf4c 🍞🍳🥓🥞🍤🍗🍕🍜🍣🍱\n🍛🍍🥐🧀🍝🍛🍧🌭☕️🍅\n\nRT if you want to live in this 3-minute montage of animated food. https://t.co/LFX2zTi6VG https://t.co/XdrmNEy0BG If you ever feel like you're not sure what you're doing with your life, remember that Nintendo didn't get into the video game business until they'd tried...almost everything else. https://t.co/LQRF9K5crs https://t.co/q1qJsL8fGz 🐥 It's #JiminAppreciationDay🕺 Share your favorite Jimin moves and moments! #BTSxYouTubeRed #BTSArmy https://t.co/KhEzIGqN6s \"If you don't stand for something, you'll fall for anything. And I stand for peace!\"—Chicago High School student D'Angelo McDade #MarchforOurLives https://t.co/4lKBntKYYb \"'If there is a book you want to read but it hasn't been written yet, you must be the one to write it.' I urge everyone who hears my voice to join me in telling the stories that aren't told.\"—11 year old Naomi at #MarchforOurLives https://t.co/4lKBntKYYb \"This is more than just a march...It is a movement.\"—Parkland survivor @delaneytarr #MarchForOurLives streaming live now: https://t.co/4lKBntKYYb LIVE: Survivors of the Parkland shooting and their supporters march on Washington to protest gun violence. https://t.co/R3NnefDle7 https://t.co/a3rD8iD8Ro 🦄 He’s our hope, he’s our👼 #JHopeAppreciationDay is finally here! Share your favorite J-Hope moments! #BTSxYouTubeRed #BTSArmy https://t.co/cnF333JTYv 1. Take all of the elements that make a successful YouTube video.\n2. Do the exact opposite. \n\nThe trailer for @MrRogersMovie has been trending all week → https://t.co/Q9NX8HTYgz https://t.co/cNtLcOGcZn 🌸🌷🌱Happy spring!🌱🌷🌸 https://t.co/rRfzgrpxBT https://t.co/R0PMTmckfv It’s a match made in roller rink heaven when @KevinHart4Real and @TiffanyHaddish strap on their skates. Watch them on @WhatTheFit, streaming now → https://t.co/MNLJcNhxFK https://t.co/eHxO0UrKax RT @YouTubeIndia: “When our girls succeed, we all win.” @IISuperwomanII and YouTube Impact Lab are getting together to get the word out abo… 🐭 The time has come for #SugaAppreciationDay! Who's going to wake Suga up and tell him it's time for hugs? #BTSxYouTubeRed #BTSArmy https://t.co/gMOcIsKlQ7 🐹 We're all smiles for #JinAppreciationDay 😁! Dad jokes aside, tell us what you love about Jin! #BTSxYouTubeRed #BTSArmy https://t.co/WT8IldPlo7 The #KarateKid saga continues on 5.2.18. Get ready for @CobraKaiSeries, streaming on YouTube Red. Watch the full trailer → https://t.co/LNSqFUioOL. https://t.co/4Y5Gf8nPKi RT @ItGetsBetter: .@TheGigiGorgeous is our forever example of #LGBTExcellence 😍. Who is yours?! https://t.co/sDFgvKtWd8 🐨 Mic check ☝️✌️☝️✌️- it's #RMAppreciationDay! Share what you love about the leader of @bts_twt! #BTSxYouTubeRed #BTSArmy https://t.co/ihSrAfppza LIVE: A conversation with students from Marjory Stoneman Douglas High School. https://t.co/ENrRXxxQm1 #ParklandForum How to clone your dog: https://t.co/32CbP0n2kR https://t.co/kiGLoZMpbB 🤖DON'T THINK OF ME AS A ROBOT WHO'S BETTER AT BASKETBALL THAN YOU ARE\n🤖THINK OF ME AS A LOVABLE GOLDEN RETRIEVER\n🤖WHO'S BETTER AT BASKETBALL THAN YOU ARE \n🤖END TRANSMISSION https://t.co/jkDtiBaYYk https://t.co/zzcJLxiCXB RT @youtubemusic: “I’ve had to work to get my voice heard in music.” \n@G_Eazy x #TheseThingsHappened → https://t.co/MbeqtBqBct https://t.co… Josie, a two-toed sloth, was kidnapped from the wild for the exotic pet trade. Now she helps the @OregonZoo teach visitors about wildlife preservation. https://t.co/1EsR0oVD6V https://t.co/h5woJc2J3B *Oompa Loompa theme begins playing* https://t.co/ZJtuICMXGB https://t.co/RjXckWMAjE 1️⃣week left, #BTSArmy! We're counting down the days to Burn The Stage with a special trailer and a day devoted to each BTS member. #BTSxYouTubeRed https://t.co/LmHZ9TYuai https://t.co/hqIN3YZ1W2 Tokyo: 🌸🌸🌸🌸🌸🌸🌸🌸\nLisse: 🌷🌷🌷🌷🌷🌷🌷🌷\nGiverny: 🌿🌹🌱🏡🌿🌹🌱\n\nWhat spring looks like around the world → https://t.co/C8TBUamHZH https://t.co/k3Uj7pjvsx RT @youtubemusic: 🔴[LIVE] Catch up with @G_Eazy at @YouTubeSpaceNY before #TheseThingsHappened drops → https://t.co/2YyjvuZD2B Good news! #BTSxYouTubeRed will be available for purchase in these countries: https://t.co/WqdbC5NYZ9 https://t.co/pdz0VNrFEy When it's been a month and the #BlackPantherChallenge is still going strong. \n1. https://t.co/7ONJAwyV0r\n2. https://t.co/XScFnp1y0W\n3. https://t.co/67lXldIbuH https://t.co/dXgbcQFtBP RT @youtubemusic: .@G_Eazy has one thing to tell you: #TheseThingsHappened. Stay tuned for more coming soon. https://t.co/IVVZapUcXc Attention must be paid. Remembering Bento, 2009—2018. https://t.co/o2ZYWPHxkF https://t.co/geDPzpBee5 how is this real. https://t.co/y5ot7AEnIA https://t.co/t6yzxMeqoO \"It's a great reminder that we should look up more often.\" \n\nA telescope gives passersby a new view of the moon → https://t.co/PvELsBgjzR https://t.co/ylzAljUL4M we love her work. https://t.co/mNrTD2zoAR Sleeping walruses have air pockets that help them stay afloat.\nSleeping bats have tendons that let them sleep upside down.\nSleeping hippos float up for air and sink down again without waking up.\nSleeping puppies...are super adorable. https://t.co/U40qqMlTQm #WorldSleepDay https://t.co/5KJ13bagVB \"To share something is to risk losing it.\" The heartbreaking true story of the Broccoli Tree: https://t.co/JcV57UlFIn https://t.co/GxqfDVxrAW You don’t know fitness until you’ve seen @KevinHart4Real and @JKCorden make Leg Day a national holiday at Muscle Beach. Catch them on @WhatTheFit now. Full episode here → https://t.co/trCBpj8YZL #WhatTheFit https://t.co/VdpAMN3lV5 It’s Sumo time! Watch our new series @WhatTheFit to see @KevinHart4Real and @ConanOBrien go head-to-head in a must-see match for the ages. Full episode here → https://t.co/cY1pjHPje4 #WhatTheFit https://t.co/edN0i66iVE RT @YouTubeTV: Hey college hoops fans: if you're desperate to watch games at work and need an excuse to throw at your boss, let us know! Tw… .@NeilTyson knows what day it is. https://t.co/XZyFkhYvej #PiDay https://t.co/kyBmVFpKOr WATCH: Students at Marjory Stoneman Douglas High School walk out to protest gun violence → https://t.co/rmvDAtFGXe #NationalWalkoutDay https://t.co/HucpVAdRng Yes. https://t.co/GVdlgg6Csn Ayo ladies and gentlemen, get ready to Burn The Stage with @bts_twt. Coming March 28th, only on YouTube Red. Check out the trailer → https://t.co/SLnguPpPQe #BTSxYouTubeRed https://t.co/ilqUYflkrD Dignity. Grace. The art of the penguin selfie: https://t.co/KjKC9YGi4c https://t.co/1FwOwLcjhn Humans. Are. Amazing. \n\nbut not as amazing as ants, they're definitely better at this than we are. https://t.co/e5fEquu2XY https://t.co/6BgJ21igeL springtime goals. https://t.co/nOm6VN3qWu https://t.co/ymVe4QaH2z Meet the kid who built a prosthetic arm out of LEGO bricks. https://t.co/a1J2PnxcL0 https://t.co/XiBNYs2azg RT @youtubemusic: We can only put the blame on @luisfonsi and @ddlovato for reaching ONE BILLION views on Échame La Culpa 🎉 → https://t.co/… In one lifetime, the average person will... https://t.co/8ecSxCksmC\n💸✅Spend 16 solid years at work\n📱✅Spend 13 solid years on their phone\n😭✅Cry 1745 times https://t.co/ydddxT9qhm RT @TeamYouTube: It’s finally here! 🙌\n\nDark theme is rolling out on iOS over the next few days. Toggle it on/off in settings. https://t.co/… How to wait for summer in a hot tub made of ice → https://t.co/57LJQoHZXN https://t.co/Hdynru2Yl1 RT @andreasklinger: A company building rocket ships is number 7 youtube\n\nNo celebrity drama, no politics, no cutesy whatevers or dead bodie… When you're a fierce wolf cub but it's #NationalNappingDay. https://t.co/nMsVdFNvID https://t.co/lKpi0uswJ9 ✨ . *  ☄️ * .    ⭐️ .   *  🌚   .\n.    *       .      .     *     .      *  \n     .      *      🌍     🚀    *     . \n⭐️     .     *        .       .   *  ✨    .\n.     *    🚗   .    ✨     .   *   \n\nIt's the freakiest show.\nIs there life on Mars? https://t.co/AumXQy1dHt https://t.co/quhGSYfTSW How to speak Wakandan → https://t.co/b7qGTAOt3D https://t.co/5WnMNiHLm9 The Video Game History Foundation wants to save lost video games—even obscure ones like \"Where in North Dakota is Carmen Sandiego?\" https://t.co/Ctz3b0mcjs https://t.co/yMEWbVXVcx Happy Monday. Here's a baby goat who's not afraid of anything. https://t.co/rF7mALWJKo https://t.co/XesS9cw0bE RT @YTCreators: STEM girls run the world 🔬🖥️🚀\n\nThe @MerrellTwins’ new series “Project Upgrade” encourages young girls to get involved in sc… RT @YTCreators: Guess who reached 1M subs???\n\nThis guy did! ⬇️⬇️⬇️ \n\nCongrats on bringing a whole new meaning to content goals, Will! https… RT @whatthefit: It’s that work hard, laugh hard life. 😂 Don’t miss @KevinHart4Real’s new show #WhatTheFit! Find us at @LOLNetwork on @YouTu… RT @YTAdvertisers: YouTube’s at @sxsw! Stop by Story HQ to explore modern storytelling and and see how you can use video to build better cr… RT @YTAdvertisers: Feel the power of #InternationalWomensDay with this week's #DejaView👩‍🎓👩‍✈️👩‍🔧👩‍🎨 →  https://t.co/NCnIO8e6pT https://t.c… RT @awesomenesstv: WATCH NOW! @Awesomenesstv's #NeverAgain LIVE Concert supporting @AMarch4OurLives with all your fave musicians and c… htt… The @EhBeeFamily sit down for an important conversation about low self-esteem and body image → https://t.co/9h3RolQU7q #InternationalWomensDay https://t.co/v7WpeF9Akg In her latest music video, @jamiegraceh asked women what it means to discover worth.\n\nThis is what they said → https://t.co/IfGkGj3wGx #InternationalWomensDay https://t.co/IaNdorPeGA RT @ElizabethBanks: .@whohahadotcom collaborated with @YouTube comedy creators to bring you feminist news updates from around the world.\n\nC… \"Everyone's idea of liberation is different.\" \n\n@kat_blaque explains why feminism means different things to different people. https://t.co/rl9c8vkxKD #InternationalWomensDay https://t.co/LVSpyWsA1P A collection of videos from women who are no longer afraid to say #MeToo. https://t.co/g1YBIuWn3c #InternationalWomensDay https://t.co/g0jqNmr0G3 In \"Your Average Muslim,\" @dinatokio explains why \"breaking the stereotype\" is the wrong way to think about extraordinary Muslim women. https://t.co/MyFSAisXRO #InternationalWomensDay https://t.co/eq66Go6riv .@hannahwitton explains why she's a feminist → https://t.co/ZCKxiZPA5i #InternationalWomensDay https://t.co/V82vJZb59m This #InternationalWomensDay, we're celebrating women who use their voices to advocate for equality. https://t.co/2urww9FhGk #PressforProgress https://t.co/ZRAm6xuSEP RT @Google: For International Women’s Day, we celebrate those working toward a more equal future. Explore top searched trends around women… They have arrived. Youth &amp; Consequences, aka Mean Girls + Scandal, is now streaming on YouTube Red. https://t.co/OHMuXGQqWo https://t.co/r2ZYC6SBaG RT @youtubemusic: Us when J-Hope from @BTS_twt blesses us with a new video → https://t.co/ek4WkHFG5H https://t.co/iVe6ghec8r Will Smith accepted @YesTheory's heli bungee challenge.\n\nOn one condition. https://t.co/9GY3ECJaIR https://t.co/bkfTmIb4en RT @YTCreators: He's been training his whole life for this moment.\n\n@DudePerfect does the world's longest LEGO walk 😖 https://t.co/tvyoXLRa… The most beautiful arctic fox in the entire world meets a human: https://t.co/nrSqjjyelX. https://t.co/8suPMTIqUy why did no one tell me this was a career option https://t.co/D1DvjyEuz6 https://t.co/HOY5rFZ30u Escape the crushing horror of the world by transforming your nails into a garden where love can blossom. https://t.co/boM7TDCBTf https://t.co/d0ehIJXqpy \"I don't know what he is, but I think it's a polar bear.\" https://t.co/ckANkZOKUR https://t.co/NfyM11rcQ5 ICYMI, @jimmykimmel's Oscars monologue is online here: https://t.co/L44sb3KjeD https://t.co/965fY7Wvfx \"I thought it was impossible. I thought it wasn't gonna work. I thought no one would ever make this movie. But I kept coming back to it, because I knew if someone let me make this movie, then people would hear it.\" https://t.co/bvYtdoEuUQ https://t.co/DrVAp1Gedl The @NASA we know today owes a lot to America's first satellite. Here's why: https://t.co/AfeBfnUd2Z https://t.co/yDWB6KxWMx RT @YouTubeTV: We’d like to thank The Academy for what’s sure to be a great #Oscars tonight.\n\nPlay along with us LIVE starting at 8/7c whil… RT @YouTubeTV: Awards. Glamour. Meryl Streep and Mary J. Blige in the same building. \n\nCatch the #Oscars LIVE Sunday at 8e/5p on ABC with Y… Baby wallaby Neil lost his mum in a car accident. Now the tiny orphan will need lots of love if he's going to make it back to the wild. https://t.co/nDHJlc8qxE https://t.co/Pmp4jJvJml RT @youtubemusic: Us: Let's just chill this weekend and not go out.\nAlso us:\n@NickJamPR, @JBalvin → https://t.co/taZ7aNnMFZ https://t.co/Na… RT @afrobella: #YouTubeTaughtMe — Some of The Best Black Beauty Vloggers https://t.co/67vPTxQ1eF via @afrobella -- if I missed any of your… \"Her name was Jaime. I knew her since I was really little. She was, like, three grades higher than me. She would always give me free candy. She was a freshman in high school.\" https://t.co/0snSkQmEPE https://t.co/SxWHhPQBrG RT @ACLU: WATCH: ACLU experts breaking down students' protest rights. https://t.co/QXQx119o0h https://t.co/ETckdBjeRZ RT @YTCreators: Sweet Home YouTube ❤️ \n\nWelcome to the fam, @RWitherspoon! We're so glad to have you. https://t.co/nFmIX81R4o https://t.co/… RT @CobraKaiSeries: Same dojo, same badass mentality, new sensei. #CobraKai https://t.co/gs2MQyN94S https://t.co/KC9XcOUhLx It's #HopeWorld; we're just living in it.\n\nSo is this goldfish. https://t.co/YCpU2eshQk https://t.co/1Qip0Fectl They solve crime. https://t.co/XQApECRBRL https://t.co/JLe0jpfFHN RT @rhettandlink: Today @AnnaAkana joins us for a round of Twister Pictionary, Rhett's 9-year-old son gives us his Oscar predictions, and w… @CsGoAliNmore disagree same tbh https://t.co/vcW91vBfUG When it's #WomensHistoryMonth but the pay gap is still a thing. https://t.co/tTngpJpOjJ https://t.co/i8Hy9gYKiN @JpSSBM2 We actually didn't! It started trending about 10 hours before we first posted about it. Today we're featuring @IamRubasworld, a creator, TV personality, journalist, and musician. Subscribe here → https://t.co/kTuPVG1oSx #CreateBlackHistory https://t.co/Q0CMFOzirR *gets placed on hold*\n*starts dancing uncontrollably* https://t.co/wQW97OcTJ1 https://t.co/fnRigP2B0W Chimpanzees and bonobos share a language.\n\nAnd they're talking about you. https://t.co/ExfEy0Z4vb https://t.co/s5PPy8ayLH @MrBanankartong @SimoneGiertz Because she's amazing. In love with the #YouTubeTaughtMe hashtag. Thanks for watching, teaching, and learning. \n\nhttps://t.co/ppJDWAgeTM RT @youtubemusic: #YouTubeTaughtMe that the lyrics to @taylorswift13's Blank Space aren't \"Starbucks lovers.\" RT @YouTubeTV: #youtubetaughtme that if a computer believes in itself, it can be a TV too It happens. https://t.co/YxsnIFQgMG RT @YTCreators: .@EVEEEEEZY taught us that no matter the size of your voice ... It can and will be heard.\n\nhttps://t.co/P6Z6BSsWXL #YouTube… RT @Enjoneer01: No joke, #YouTubeTaughtMe how to cook. @jamieoliver, @gennarocontaldo, @foodwishes, @GordonRamsay, @Aaroncraze1 &amp; a host of… RT @__wxcvbn__: #YoutubeTaughtMe how to turn panties into sport bra.\n\nThis is really useful. RT @YTCreators: .@SimoneGiertz taught us that there's nothing cooler than a girl who can build a robot 🤖 https://t.co/tL0YnGXFwK #YouTubeTa… *whispers* We are a TV provider→ @YouTubeTV https://t.co/rP6erWJldU RT @cagrihoca: #YouTubeTaughtMe German. And I taught English to hundreds of thousands of people on @YouTube 🇬🇧🇹🇷🇩🇪 RT @jessburr32: #YouTubeTaughtMe how to #glowup #mua #MakeupAddict #makeupbyme https://t.co/WxK1664HDp RT @_SpreadThePeace: #YouTubeTaughtMe how to gain self confidence\ntry to dress differently\ndo my hair in different styles\nhow to roast prop… RT @Axlazu: #YouTubeTaughtMe how to brew beer. My first batch of stout is starting tonight RT @newman_thinx: #YouTubeTaughtMe how to feed myself in college... when my body started to reject top ramen RT @YnotBro: #YouTubeTaughtMe how to fix my fire alarm from double chirping at 2am. @AshleyLake Thank YOU for watching! Reading through the #YouTubeTaughtMe hashtag like... https://t.co/0iTdrxKcqJ RT @xKemistryo: #YouTubeTaughtMe How to edit and bring my ideas to life. 🙌🏾✨ RT @ThatSportsGamer: #YouTubeTaughtMe, and continues to teach me, how to tie a tie every time I need one. RT @Aishah_Divine: #Youtubetaughtme I could fall in love with people I never met and genuinely root for their happiness and fulfillment. RT @KrazyGal92: #YouTubeTaughtMe how to drape a saree! Thank you so much @YouTube 😊😊😊 RT @Blaberhead: #YouTubeTaughtMe there's a friend, passion, and interest for everyone. RT @FraserTheFish: #YouTubeTaughtMe how to analyse subtext and storytelling in films! From what different camera angles and shots mean, to… RT @DJHeff: #YouTubeTaughtMe how to play R&amp;B on a ukulele and make perfect pancakes at the same time. #djheff #WednesdayWisdom https://t.co… RT @AnimeEyedGirl: #YouTubeTaughtMe how to sew! Now I can make cool #cosplay! #Natsu #FairyTail 😜 https://t.co/PUvrn9Ruba RT @SarangHanne: #YouTubeTaughtMe how to build a computer, calculus, recipes i now know from heart, which product will give me the most per… RT @Prettywinnings: #YouTubeTaughtMe how to do my smokey eye and how to put on lashes by myself . RT @rachelzegler: #YouTubeTaughtMe that I can be unapologetically myself, and people will still like me. RT @TraumaAlex: How to make cake and study for my Paramedic exams. #YouTubeTaughtMe RT @veiled_reverie: #YouTubeTaughtMe how to fold a fitted sheet. RT @chellemybell22: #YouTubeTaughtMe you can make anything into a song https://t.co/6NeKRGXoED RT @deedles420: For every sad minute of life, there's a cute cat montage waiting to make you feel good. #YouTubeTaughtMe RT @ju_want_it: #YouTubeTaughtMe how to use my camera and I haven’t stopped practicing since. https://t.co/AEvCDUHGQs RT @MaybePileComedy: #YouTubeTaughtMe it's possible to start the night watching music videos to  end up learning how to cross stitch a thro… RT @joshxnero: #YouTubeTaughtMe an entire math lesson one night before the test RT @SH_221bBSt: #YouTubeTaughtMe \n\nOh you know... https://t.co/rV7AqhAK2B RT @virtadpt: #YouTubeTaughtMe how to fix a bathroom sink.\n\n(Boring, I know - but practical!) RT @mrjafri: #YouTubeTaughtMe never to believe my eyes https://t.co/71sY2SQJ4N RT @SumiAppleberry: #YouTubeTaughtMe the wonderful world that is kpop RT @TamashiiHiroka: #YouTubeTaughtMe how to do some really basic but important life stuff. How to do laundry, cooking, makeup and hair how… @YoussEl16  https://t.co/OI9FgyddnD @cartoonhangover  https://t.co/d819ihURTm @Kurlygirl13  https://t.co/FOMkHurQd2 Whatever, Disney has been cloning its pets for decades. https://t.co/6p9fJqp2e3 https://t.co/DHhWBAuOvM Today's featured creator is @AkilahObviously. Obviously. Subscribe here → https://t.co/zITdRbI7hO #CreateBlackHistory https://t.co/zYrrCXsMXr \"You wouldn't like me when I'm angry.\" https://t.co/JCe8mfLavF https://t.co/LZFmOTkMKH It's going to be all dog-cloning videos for the rest of the afternoon, isn't it? https://t.co/fFFsdyA5uw https://t.co/4yC4BgU3MR RT @jasonmcbride68: I could spend the rest of my life in the Martin Short YouTube rabbit hole that @david_marchese sent me to https://t.co/… Here's everything your teachers forgot to tell you about the civil rights movement. https://t.co/s0HYCaWrYo #CreateBlackHistory https://t.co/zUCbxb1gD8 A 21-second explanation of why you should never let anyone get close to you. https://t.co/mNEqvDlcDw https://t.co/qQZ3GoS4GZ @Macks_Stories accurate @tin_giun NOPE: https://t.co/cHxo9WRJrX Winsol the baby aardvark is learning to eat solid food. He's already really good at it. https://t.co/29GVJJ1st6 https://t.co/eGa2MKfTFk RT @youtubemusic: .@Camila_Cabello is ready to tell her story. Watch her journey in #MadeInMiami → https://t.co/dbilXoJKAb https://t.co/mIm… @Marcellow1 we aim to please WITCH HUNT! https://t.co/8hfrMtm7BF RT @YTCreators: These 25 global women are all united by their memories of joy, sadness, and hope. \n\n@TEATUMJONES opened their @LondonFashio… Today's featured creator, @Tpindell, contains multitudes. Subscribe here → https://t.co/r2LrHdsx1Z #CreateBlackHistory https://t.co/3hxyArflT9 1. Watch this: https://t.co/qKmDTjCq4A\n2. Figure out what you want to steal.\n3. Figure out what you can't stand.\n4. Figure out what's missing.\n5. Create something incredible. https://t.co/ShrNRA2qmZ RT @Panacamanana: the amount of patience this requires I couldn't imagine.\nBut I can't stop watching this.\n\nhttps://t.co/OWelAW1pRV I'm a delicate flower. That's why I apply all my makeup with gardening tools. https://t.co/gAQ31iI2ie https://t.co/mkyvQ8AIhJ RT @youtubemusic: Camilizers, we’ve got something special for you dropping tomorrow. Stay tuned for #MadeinMiami 🦋@Camila_Cabello https://t… Meehyun Lee was born in South Korea and adopted by a family in Pennsylvania when she was 1 year old. When she returned to compete for South Korea in the Olympics, she hoped her birth parents might be watching. https://t.co/vHpW6k88tn https://t.co/4ldEfwaJYq \"I hear you've decided to pursue a career in social media.\" https://t.co/7iUju9GOyE https://t.co/YzT6RJJjCe Attacking this week like... https://t.co/P6pqkcObHM https://t.co/hUGT1zjrKt Today's featured creator, @kingbach, has been creating sketch comedy on YouTube since 2012. Subscribe here → https://t.co/UUZG3xaCNj #CreateBlackHistory https://t.co/v7hGhY9svl In which Benedict Cumberbatch reveals that he is, in fact, a little teapot. https://t.co/a39ArrTICO https://t.co/8uOHyiDfLf RT @TTLYTEALA: Check out @YTCreators @YouTube Instagram story to find me 😍🙈👸🏽 Today's featured creator is actress and trendsetter @TTLYTEALA! Subscribe here → https://t.co/nQ4ulhFW5s #CreateBlackHistory https://t.co/fXkvvK6nZh \"What do you think is the one thing about your generation that can really spark change here?\"\n\"The fact that we're getting shot.\" https://t.co/WbxjIywwzk https://t.co/niET1NcY3M Today's featured creator, @laguardiacross, makes videos about his life as a father, his silly adventures with his daughters, and the things he's learned (or unlearned) as a parent. Subscribe here → https://t.co/PgmRjw4Uzf #CreateBlackHistory https://t.co/5jvFqgCSsT RT @jackwhitehall: I now want to come onto every show I do to Big Shaq @MichaelDapaah @BRITs #BRITs https://t.co/zdhH8vRmUg *tell people you're tired of the Olympics*\n*see a video of Pita the Shirtless Tongan Legend oiling his chest and eating Korean food* https://t.co/hFl67qvJKE https://t.co/iEucXJmrvj This is how designers play basketball. https://t.co/iHTWY4f7fT https://t.co/3a1GGhTjgJ Writers: watch more YouTube videos. https://t.co/OChJDvEVIJ RT @rhettandlink: Today @sWooZ1e joins us for a round of Cruel Pool and helps us dissect the best starter pack memes on the Internet, and w… This rescued goat is only a baby, but she's doing her best. https://t.co/NxP4LthJ7W https://t.co/jHmLebhuPu Today's featured creator, @mayasworld, began her channel with a question: \"What would happen if I shamelessly promoted myself for 365 days?\" Now she wants to inspire people to live their dreams shamelessly. Subscribe here → https://t.co/UYead3qlGn #CreateBlackHistory https://t.co/xwxaoR1CvT RT @gomichild: Was chatting with my neighbour last night about his potential makeover &amp; managed to get sucked into a YouTube hole featuring… synthesizers are better than people. https://t.co/J3jGYqslLZ https://t.co/IBxj6ovMqS these are amazing. https://t.co/2bjEyqR3yC RT @youtubemusic: She DID THAT. @prince would be so proud of Make Me Feel, the anthem @janellemonae just dropped → https://t.co/Uu34tjiZUs… When the unicorn frappuccino celebrates #NationalMargaritaDay. https://t.co/txBx6N9GT0 https://t.co/HwmL8uankR @slpng_giants Thanks—@TeamYouTube is looking into this now. \"The word 'bitch' was used—going back to the 1400s—of men, and that wasn't in our dictionary at all.\"\n\"Is that because men were writing the dictionaries?\" \n\n@KoryStamper on the history of swear words → https://t.co/h6jLdFhYlb https://t.co/HwcJQosJnm RT @YouTubeTV: This black history month, we’re celebrating the representation in television and film today that will inspire generations to… There they are! Welcome to YouTube, @ManUtd! 🔴⚪️⚫️ https://t.co/pssZGAnQMg When you’re counting down to Sunday's #MUFC game but you still can't find @ManUtd on YouTube. https://t.co/pKJBZCXGQe \"I'm gonna interrupt you real quick and remind you that the question is 'Do you think it should be harder to obtain these semi-automatic weapons?'\" \n\nThe full video of last night's @CNN #StudentsStandUp town hall is now online. https://t.co/lNuDMDsbzj https://t.co/2hBTlLr2Oz Today's featured creators, @4yallent, create hilarious sketches that center around relationships, awkward situations, and music. Subscribe here → https://t.co/i0aQhvGQUc  #CreateBlackHistory https://t.co/yxBIeRs9ng @BreeoniJones Any revenue earned prior to being removed will still be paid out through your AdSense account based on the standard payment thresholds &amp; timeline. If you're below $100, you can close your AdSense account. Here's how: https://t.co/CPS2w685Kf \"Together, we are going to change the world.\" \n\nSurvivors of the shooting at Marjory Stoneman Douglas High School speak out. https://t.co/DUNpv0ZzO9 #StudentsStandUp https://t.co/IjsnqYn2AP RT @youtubemusic: 🔴 [LIVE] The #BRITs are happening right now — if you’re not in the UK, watch it here → https://t.co/tTE8qVZ8fE The purest video on the internet is just a man giving a cow a face massage for 49 seconds. https://t.co/L86qvGr5cS https://t.co/7zzXqpvRSv \"What if we're doing an interview with the president of somewhere? We have to have a brooch for that.\" https://t.co/bed1KCN39D https://t.co/nSsCkgSCFq RT @YTCreators: Does not speaking Spanish make you any less Latino? Nope! \n\n@wearemitu wants people to stop judging Latinos’ experiences →… @Seymour_Buttts @BartBaker This. https://t.co/P9aRBaLCl0 \"We taught them to open doors for each other. Now what?\"\n\"Train them to fight off humans who get in their way.\" https://t.co/8OTlzQpc9B https://t.co/1Ul0A1ZlQc Today's featured creator, @jouelzy, is a vlogger and writer advocating for the #SmartBrownGirl. Subscribe here → https://t.co/dCykePMmgp #CreateBlackHistory https://t.co/5qumWwoVkZ Slow down, sisters! @maddieziegler and @kenzieziegler join us for #SuperSlowShow now on YouTube. https://t.co/pbLJoJuseB https://t.co/3Z5RlrosZd RT @youtubemusic: Not in the UK and need a place to watch the #BRITS? We got you. It all goes down at 2:30pm EST → https://t.co/ZeYGNJrxkD… #AndThatsHowIGotThisScar → https://t.co/J9Oz8VRKRt https://t.co/if9NdEZM9W @youtubemusic @Olympics @Jambobsled this is SO GOOD. When you treat your cats to a decadent spa weekend. #LoveYourPetDay https://t.co/W06rtZ4ET4 https://t.co/RXGFf8a6Sk Today's featured creator, @alphacat, once performed his impression of former president Barack Obama for...Obama. Subscribe here → https://t.co/7RPfRGPb0H #CreateBlackHistory https://t.co/lsheO0fZt5 There's more than meets the eye. Find out who's really in charge in #YouthAndConsequences, starring @AnnaAkana. Watch the full trailer now: https://t.co/aY0fABzVje. @YandCShow https://t.co/uke4AMB6eZ RT @KayandJeff: I love @shanboody ❤️ https://t.co/ElmvgNGl4O Today's featured creator, @shanboody, is a sexologist, author, and professional big sister who gives practical advice on love and sex in today's culture. Subscribe here → https://t.co/Dj4XwA1qQK #CreateBlackHistory https://t.co/93cD76YZrU @imcaoimhej yes, but thanks for asking; that really is so kind of you. Reminder to everyone selfie-ing their way through a miserable relationship that it's not too late to break up and spend the rest of the long weekend watching videos on the internet. https://t.co/fT7lPRZdAf https://t.co/gkLVAjxXve RT @iceblinkluck_: My son asked about bows and arrows so I found this video and now I can’t stop watching it. Send help. \n\nhttps://t.co/q0z… shh, don't tell them: https://t.co/mVPip4krgp https://t.co/Vtw3doHUjH RT @WilliamZabka: It's finally here - the teaser for our new @YouTube Red show @CobraKaiSeries @ralphmacchio #CobraKaiSeries Enjoy! https:/… Subscribe to black creators who 🏋🏾‍♀️🤸🏾‍♀️🏃🏾‍♀️💪🏾. \n\nToday's featured creator, @tiffanyrothe, designs short fitness routines to train your mind, work your body, and lift your spirit. Subscribe here → https://t.co/bpeQqPOXaY https://t.co/j0nsKgcwAg \"you vs the lion dancer she tells you not to worry about.\" https://t.co/8rbi4dYG4U https://t.co/0bPPHEYKwb #RandomActsOfKindnessDay https://t.co/0oGOrLOVYn 1932: Figure skating is set to music for the first time\n1933: \"They're skating to *that* again?\"\n\nAdam Rippon explains how figure skaters choose their music → https://t.co/V1NEmduvkl https://t.co/hw5jwuSsHO Today's featured creator, @ayshaharun, is a Canadian/Ethiopian beauty and lifestyle vlogger who says she's redefining what it means to be beautiful. Subscribe here → https://t.co/1Qp1xUjwcb #CreateBlackHistory https://t.co/hSJsNuw3sx Drake took the $996,631.90 budget for his \"God's Plan\" video and gave it to families, charities, and schools in the Miami community. https://t.co/BKBEgmxWJZ https://t.co/dUpQGofh29 \"Would you rather fight for the last slice of 🍕 against Shuri or X-Men mutant Storm?\"\n\"Storm, because then I'd just take the pizza and it's raining. I don't care.\" \n\nThe #BlackPanther cast answers the tough questions → https://t.co/qZfqk0A8Sm https://t.co/b6r4sJhInm We asked @andreaschoice to name 10 other creators she's watching #CreateBlackHistory. These are Andrea's choices → https://t.co/v8zxfu1Mm2 https://t.co/PV9oCPTz1f Happy Year of the Dog! How to celebrate #ChineseNewYear with dog-friendly dumplings (and some regular dumplings for yourself) → https://t.co/Vxt3CCdAHs https://t.co/lVgyz6Zq8o Happy #ChineseNewYear! Celebrate with these 4 rising creators from Hong Kong → https://t.co/dR2oNiZ5xQ https://t.co/swnXRO8ATe Today's featured creator, @TheKingOfWeird, is a singer-songwriter and comedian who posts skits, covers, choreography, and more. Subscribe here → https://t.co/618QxIa1aI #CreateBlackHistory https://t.co/ORsnk7rGrr @SIIcanada @CobraKaiSeries We hear they're always accepting recruits! #CobraKai @jerflash @CobraKaiSeries Right?!? #CobraKai never dies! @JayMacch @CobraKaiSeries Our feelings exactly. 👊 #CobraKai 🌝🏞 , wider than a mile\nI'm crossing you in 👠 someday\nA ✨💭✨ maker\nMy 💔 breaker\nWherever you're 🚶, I'm🚶 that 🛣\n2️⃣🎈🎈\n📴 to 👀 the 🌎\nThere's such a 🙃 🌎 to 👀\nWe're all 🏃 after all the same\n🏃after our 🌈🔚\n\ncan't stop listening. https://t.co/1qGMBAjSIs RT @pattonoswalt: Oh. My. God.\n\n@ralphmacchio and @WilliamZabka. THIS is my generation’s BATMAN V SUPERMAN. #nomercy #cranekick https://t.c… The Cobra Kai dojo is back and better than ever. 👊 Follow @CobraKaiSeries for epic content and get your first look at the new show here --&gt; https://t.co/uUkgzhPpJO. #CobraKai https://t.co/uey8Llvs0P Tired: \"I know it sounds crazy, but this photo of a 🕷is kinda cute!\"\n\nWired: \"HERE IS AN ANIMATED 🕷 VOICED BY MY 5-YEAR-OLD NEPHEW. THESE ARE HIS ADVENTURES → https://t.co/0RaE6QXK2n\" https://t.co/kWVEnb9Ahd RT @youtubemusic: Thanks to @Camila_Cabello for making a playlist of her favorite Valentine’s Day videos ❤️ Share it with that special some… Today's featured creator, @latoyaforever, is a storyteller and vlogger who says her goal is \"to make you laugh, cry, and be inspired.\" Subscribe here → https://t.co/YYtUp5nzD7 #CreateBlackHistory https://t.co/qSqQqpYXs6 @EggoCupsRgood no Roses are red\nViolets are blue \nSubscribe to black creators. @Jacob_Fletcher3 you seem nice"}