{"tweets": "It’s a very tasty little snack https://t.co/1VrM98A2zq RT @buteralattay: @IGGYAZALEA Omg resting sad face Omg no! \nIt’s pretty funny tho. 🤷‍♀️😂 https://t.co/LQ07exK7Ah Nope! Dead ass just my usual expression. Hahaha https://t.co/sEr2YOH1SS Iam - 😂 https://t.co/JKtds1kpxU RT @Joaoaksnes: @IGGYAZALEA I don't know how I can stand you keeping this secret for so long, obviously it's gonna be one of the best clips… RT @largaryen: @IGGYAZALEA I hope you remain mysterious going forward! It's so good to feel it, we don't know what's about to be released a… RT @jiovystv: @IGGYAZALEA Iggy Azalea keeping something for a long time? No snippet of the song or video? this is crazy RT @ibreatheddd: @IGGYAZALEA I really thought you have caved in and showed up sum kdjejj we can’t wait sis RT @iggysicebox: @IGGYAZALEA Never thought I’d see the day but I definitely prefer it this way. I know! Could you believe it ?! https://t.co/ynLGuZ6Rr0 Not until the day before! https://t.co/7qgKcV4RF6 I’m starting to get nervous! https://t.co/LvE3h9UOhF Anyway, sorry for ranting but it makes me SO mad; you have no idea. Let’s talk about Lola. \nThat’s what I care about &amp; where my focus needs to remain. \nThe video is beautiful. 💗🥰 RT @mikar96: @IGGYAZALEA I would deff live in hollaback girl 🥺❤️ RT @OneillBathusi: @IGGYAZALEA I Love Gangsta Loving featuring ALICIA KEYS I think I’d live inside \nGwen &amp; Eve “blow ya mind” \nIt’s the perfect video. RT @panja47: Well worth the wait! @IGGYAZALEA #InMyDefense The red and black marble vinyl is stunnn! ❤️🖤 https://t.co/oskqxwy75f RT @origanal_chie: @IGGYAZALEA Paula Abdul- opposites attract 😂🤣😂 RT @trilmonte: @IGGYAZALEA Smooth Criminal but only if I could be one of the wiseguys doing The Lean™. RT @NickoFerguson1: @IGGYAZALEA In Fergie’s Fergalicious https://t.co/2WK3EznYEz RT @feedthewolvez: @IGGYAZALEA Slave 4 U cause everyone looked musty but hot. That’s me in a nutshell You can explore the realm and all the characters etc exist https://t.co/agQiwwe2jd RT @ErixTheRed: @IGGYAZALEA I'd live inside \" Lets go all the way\" by ICP. hell yeah!!! RT @aod_jeff: @IGGYAZALEA that big house in katy perry's the one that got away RT @blakey_1994: @IGGYAZALEA BBHMM video DUH RT @THEGEMINIFILMZ: @IGGYAZALEA I for sure wanna live inside the “LOOSE MY BREATH” MV by destiny child ugh 2 of me in a dance battle ! Icon… Right?! New game. \nIf you could live inside any music video, which one would it be? \nI have to think about this too, \nThere’s too many good ones! https://t.co/O7tzS9WZIG I wanna live inside a music video all the time. 😩 I don’t wanna live in the real world. Hey Mambo, Mambo Italiano! \n🥴 https://t.co/OZEO6sTQVZ Finally my grade school language class can pay off: \nSelamat malam! 💤 https://t.co/dzwsDaGEf9 Tbh:\nMy brain is happy and excited as hell! \nMy body? tired today and burnt out. Too many days with minimal sleep are catching up to me! https://t.co/lwJOEkr1kW RT @MAFIAIGGYAZALEA: Make me cum, make me squirt\nSee my titties through my shirt\nGet me off, get me wet\nPush my pussy to the edge https://t… I know you all do - \nAnd you’re gonna get that. https://t.co/FQhYO5dknN 14 days! https://t.co/5voOEsMvyP Thankyou! https://t.co/gxQTY7hQiS I archived them, not delete. \nI’ll bring em back after I’m done all my wicked lips stuff if y’all miss em that much 🥰 https://t.co/wA3ZQ3yvyA RT @Stevenx222: @IGGYAZALEA Let the new era begin🙌 What? I’m about to start a new era in a week you fucking losers - nice try tho lmaooooooo https://t.co/DfcYrEqlPt Right! And that’s the part I LOVE. \nShe’s not afraid to take it all the way. https://t.co/MwfOAkIZ4p RT @DansManifesto: @IGGYAZALEA 💕✨ https://t.co/CCy8uj26df I love Brooke because she’s so passionate about her art. https://t.co/aVWonSPLWT I’m editing for the next 48hrs so I figured since I’ll be locked in a dark room it was a good time to do some skin care! Haha. \nLet’s see how crazy I look when I wake up. https://t.co/QfXkWl6TrO It didn’t hurt on most parts of my face. \nthe skin around my lips that is more delicate, it did. https://t.co/A04F2so1G4 I did micro needling on my face today. \nIt wasn’t as bad as I thought! \nI look kinda crazy tho from being poked so many times. \nSorta severe sunburn vibes. yes! Congratulations to my baby @brookecandy on the new album! \nWoo!!! 🥰 https://t.co/dRxxIFsosm I’m the only one that can get you all upset without even uttering a word. I love that for me. 😂 RT @iggydesgarcons: @IGGYAZALEA I HAVE BEEN WAITING FOR SO LONG, BUT IT WAS WORTH IT. https://t.co/uP6R1z78Ik 🧡 https://t.co/AFd73xtHnj So proud of you @stiniskittles \nCan’t wait to hear the whole mixtape: \n\nhttps://t.co/3nS29gmd6T Usually I hate spin offs, \nBut I actually can’t wait to watch this!!! https://t.co/QgOMkTFUj4 @ItsAunnyBitch @iggy_lovers I think the appropriate thing is to say it’s rumored to be dropped then or suspected to be dropped then, but what it’s NOT is confirmed to drop then, cause I’ve not given a specific date within that week RT @xIggyX1: Yaaassss I love it 😻😻 Thank you @IGGYAZALEA 💗💗💗 https://t.co/pRt7HRJcTr RT @stiniskittles: TONIGHT 12AM EST 9PM PST PROUD https://t.co/7fiLh8kKRu RT @KOLATRL: Thanks sis 😘 @IGGYAZALEA https://t.co/1nvBh0i4Qc GO GIRL! https://t.co/9fP8H0ddUv I will be in Europe late Nov. \nconfirmed. https://t.co/0o41ebBr2j Hey Lola! https://t.co/RhRkocv9rg OMG, I want to! \nI can’t sample Mambo Italiano and not visit! How epic would that be!? https://t.co/BKF42tOsSU RT @bishdafak: @IGGYAZALEA I AM HEEEEEEEREEEEEE 🇮🇹🇮🇹🇮🇹🇮🇹 https://t.co/pBoYlJ5qtK Yes and no. https://t.co/UFYsmdwXTf 😊💗 https://t.co/UUsKwEAiUz No the video is more fashion focused in its framing etc. \nand I’ve had picked EVERYONE on the team. Bijan Souri is making 7 sets from SCRATCH in an abandoned building totally built out just for the video so it’s perfectly how I imagined it. https://t.co/6XAmHExfCa Come on ITALY! https://t.co/OqDUbWRBgd I’m directing the video with my friend thom. \nI always co direct, but this is technically just a more complicated set to build etc. so the work load is more intense than normal and normally I’m already pulling out my hair stressed! Ha!\nI’ve been sleeping 3/4hrs all week. https://t.co/Dw0CMd9zPb I don’t know! It’s not made yet! \nBut I do know creatively it’s a much larger task than other videos and also I’m more involved than ever &amp; just can’t get sucked into the internet drama because I only kiki for comedy purposes 🤷‍♀️ https://t.co/tfthYTHB7P Good! and whilst you know I’m genuinely down to troll the internet-\nThis week is super important for me and the biggest work load I’ve had creatively on a video so I have to go M.I.A for the next few days and really focus on directing &amp; editing. https://t.co/YDChXFCdVU The word consecutive means: \nIn a row. \nThankyou for coming to my English class. https://t.co/oxRRjhukmP RT @spazedude: @IGGYAZALEA anyways... look what came in the mail 💜 https://t.co/Zmo6K9z1LB The day my sister was born  and I had jelly beans in the hospital https://t.co/QvIFnHjl4G @_drewclinton Whelp it was dropped at the address you typed if it says that cause they don’t mark it that way if it wasn’t 🤷‍♀️ RT @yashsayings: @IGGYAZALEA You're always creating chaos in twitter like joker in Gotham Mostly I look at the comments under my own tweets. https://t.co/1SwrXu3kpX This tea tastes like dirt. And that’s fine but I’m not speaking on those people. https://t.co/04gMWlSe8j Y’all don’t listen to people’s music who’s personality you don’t like (makes sense to me) let alone politics .... \nSo why is it so hard to apply this to all the food companies that fund homophobic policies. \nThe chicken is not that good. #DoinTooMuchChallenge \nTrust meeeeee https://t.co/94riTFg8RQ If the rewards not the same;\n the risk shouldn’t be either! Hey Lola.... She can get a little jealous! 😈 I hate seeds in everything except kiwi fruit. It’s like looking in the mirror https://t.co/phrk26w27P 🧡 https://t.co/NE9bliD539 Is it time for hot chocolate 😱 Don’t worry I absolutely will NOT https://t.co/U86OivHzBp God it’s so fucking hard not to share snippets. https://t.co/Bb9Lxw8hoV Iam getting my life &amp; afterlife ! https://t.co/0SymAEqhJi My baby @kashdoll dropped her album last night. 😛 Fuji ! https://t.co/KHjexoKIVB And the new one is too! \nAll apples and barbed wire \nI love it. It’s soft and hard mixed. https://t.co/QDEbGtJJea I will never not love this album art and I really hope it she’s like wine https://t.co/CwX5alPxTI Girl and vice versa. Fuck the trolls... We good! 😂🧡\nIt’s always love on my end! https://t.co/LyAbXKqFLI 😊 she’s so pretty https://t.co/FlUEdLtEH7 Yes with matching sweats https://t.co/dYvJyHbn0f They ran out, and I had been in nyc all week. \nGot back last night and signed the rest. Should be shipped Monday. https://t.co/OWsd9R106l I enjoyed it. A little too much https://t.co/JxbujcXJvZ Okay you deserve this. \nI got you! https://t.co/klL3ooJkqj I love you too! we spoke while you filmed big ole freak on FaceTime with jwhite so I sent Hoemita + freak of the week to your manger who said you wouldn’t have time to get in the studio. Which I was fine with!\nNo hate. I thought your manger would have PLAYED the records. https://t.co/PM9BoI1AuG RT @AnthonyLavs: @IGGYAZALEA Slim THICC \nBig butt\nTatted up\nPop it Face down! Ass up! \nBack it up! \nDrop it! 🎶 And it’s called \n“ I feel nothing “ https://t.co/tkK5Wi9Ryo I don’t want to make pussy scented lip balm sorry https://t.co/fHtJpmEzW3 What flavors y’all want help me ! https://t.co/QQfSMDeNme Imagine thinking I wouldn’t make scented lip balm for wicked lips. \nBitch I’m extra. Lollllllllaaaaaaaaaa!!!! @AliChater RT @KevinWelchhh: I’m the one that showed these bitches how to stunt. RT @LAtimelessAngel: Yup @IGGYAZALEA snapped with this free shirt 🥰🥰🥰 https://t.co/KPmDgFZvqK Oh wow! That’s amazing! 💗 https://t.co/wuwhPoTcmW That and you’re the one that I want. \nThe two superior numbers. https://t.co/rzorfwPmBv Same! When I was a kid I’d hate the song and as I got older it’s become my favorite moment. https://t.co/uQhhxi12rN When rizzo sings that’s the worst thing I could do. I really felt that. https://t.co/CxLtqY6z2s I’ve been hiding this for a long time cause I’m sorry what people are gonna think but I’m ready to admit it: grease is my favorite movie and it always has been. Would you rather have your... RT @swiftazalean: .@IGGYAZALEA the cassette  came in 🥳🥳🔥 https://t.co/vXihqoseDe He was on my font reference board fr hahaha https://t.co/ibVKl8WQsB It’s a custom font 🤪 https://t.co/4JOsxmGngN Something sweet! https://t.co/AC4EUJR4Ib For me IMD is like the meal. \nAnd \nWL is like a little dessert afterward. https://t.co/ax0hn2MFWU Yes! https://t.co/fYj4W47ZZs Yes; I support it 100% https://t.co/Kt93nKHeKf I can’t clear it in time for this weeks deadline. \nso week after... or maybe a few days before the official single ? \nIt’s so close now! https://t.co/U9SWqfHE8W 🧐 next week? https://t.co/BOlIBR1dJv 😂 this is why i go hard for @kashdoll https://t.co/jZrFTz1kKP today is a great day 🧡 RT @xxlilhoexx: @IGGYAZALEA you ghost tweeted that its just so satisfying! https://t.co/Vy0CTbZ8dK MOOD https://t.co/56goklFTca RT @wokepaulina: @IGGYAZALEA Girl same! I like to hear and read it. I felt weird  glad to know you’re weird too ❤️ lol RT @KodaDinah97: @IGGYAZALEA omg finally someone else who does it RT @PrettyG79727415: @IGGYAZALEA no, it's not just you I feel identified i get that sometimes i switch them to spanish subtitles and it makes me recognize so many more words in spanish in real life. https://t.co/ob9LJHVATQ it’s honestly my addiction! \ni hate watching anything without them i like to read them while i watch, is it just me? https://t.co/5E0oMQ3Bqc its uptempo as hell https://t.co/m5Iy7e43jA dont worry ive been shipping out lots of international orders too. \nits about 50/50. https://t.co/2PoOHnZUxk duh! https://t.co/If9NtEmc3a 👀 https://t.co/TqmrO5J4Bu RT @xoxoluv4iggy: @IGGYAZALEA Hi I would like 5% for defending sksks RT @iggysgemini: @IGGYAZALEA “you can say what you want about me as long as you pay me” thankyou! next months new shit is about to be that girl too! 🧡 https://t.co/BtbpTrH1Np i love how mad people liked this but the comments just all angry people who hate me. \nhahaha yall bigger fans than the fans. i love you too! https://t.co/S27wZbijPV i will make it work; but inside. https://t.co/nWHuN4nqp7 yes but it has a set; the set was meant to be built outside to have nice natural light &amp; obviously now thats turned to shit https://t.co/5MageC2wAG wow im meant to be shooting my EP cover today &amp; its fucking raining. \nfuuuuuuuckkkkkkk im so hungry but yet so full. \ni think its called boredom. RT @hoemitaa: @IGGYAZALEA thank youuuu!!! 💕 https://t.co/MEkoo6F3E9 Can we have a hit and then have a shark jet ski dolphin pizza yacht party please. https://t.co/zKs7WXKZun RT @giawdiaries: @IGGYAZALEA you’re so inspirational and i’m so grateful. thank you. I don’t know who needs to hear this but.... \nfuck you, you dirty old hooker. \nGo back to your apartment and wash your fucking bed sheets for once in your adult life. Id say a mean joke but you shaved off your own eyebrows so now I wont even know if you’re angry. \nCancelled! https://t.co/hYdb701Fgh Just because you cropped half your face doesn’t mean you’re half as ugly. Cancelled! https://t.co/Mbe0MsYBug RT @tokyosnow_trip: \\/\\/ | € K £ |)   |_ | P $ (This is not meant negatively at all)\nWhat the fuck is the deal with anime. Everyone’s always having weird demon style sex scenes and then there’s like aliens growing out of peoples chins with sword hands etc. \nI do have to say: I love the imagination. Nah I took a sick day at Walmart tomorrow so I can stay up as late as I want! https://t.co/2wRnyN5SPK Who’s going to Atlanta Pride tomorrow to get their life to Kesha? \n🙋‍♀️ RT @TheNinoDaniel: This. This is some good shit. Thank you @IGGYAZALEA. https://t.co/rUJkUhGWaP 🥰😘 https://t.co/NCb5PjtttA RT @JoMatx: @IGGYAZALEA Uhm hello i got mine today too! https://t.co/Ooip9u1R8u 😛🧡 https://t.co/496DGQq0C7 Yup! https://t.co/jtavpsKuw0 Ahhhhh! I hope you love them!!!! \n🧡💗🧡💗🧡 https://t.co/H2EI12X4mx The new iPhone update is fucked. \nArghhhhhhh!!!!! \nI can’t open audio attachments without gmail crashing. \nAnd my battery life is now only 6 hours.... \nplease fix it cause let’s be real I’m not gonna change to a different type of phone. 🤷‍♀️😂 I don’t even own a record player but I still have vinyls join the club babe! \nLmao https://t.co/Ukq63EyNMG 🥰 https://t.co/MtOz56gK7s Yay! I’m so happy seeing people starting to get their packages!!! https://t.co/gr5UYLhCyn New song next week? No, BUT me and Pabllo are gonna \nHang when I visit Brazil for my show in Dec and make some music in the studio there in person so I’m soo sooo excited for that! https://t.co/pJJw2jtsWe Yes and I can’t wait! \nI need baby A back in America! https://t.co/MIPi0gSu9Y You guys will get it in November. https://t.co/ejiQd2hr0Q I’m not sure there may be a juicy track on there but I haven’t finalized the track listing so I can’t say 100% everyone yet. https://t.co/lUez8lj8N4 Carl Falk! \nMost of the songs are produced by him on this EP, and some work by Jwhite too of course! https://t.co/gIxulg6BjD OR did I make a song about myself 🧐 https://t.co/Xye8H48xAU One track (not the lead single) \nis called: Stupid people https://t.co/Pp1S2Ow5IX RT @ithinkzakkknows: @IGGYAZALEA She’s onto us RT @WlLDCHERRY: @IGGYAZALEA maybe we’re trying to pull a sneaky on you Fuckkkkkk \nI don’t know!!! \nThis is a trick question to get me to confirm the names isn’t it? https://t.co/8vZWg6J3Tz I’m starting to get extremely excited for you to hear my EP. \nfuuuuuuuuucccckkkkkkkk...... RT @brandon_smotek: I love when Iggy is cancelling people 😂 You’re over beer piss. https://t.co/CI0wHNQ0J2 I’m cancelling you for putting your own face as your avi, waldo. https://t.co/tK2qkiSLOL You’re cancelled for saying your \nchlamydia is Fiji. \nSee a doctor. Gross. https://t.co/dzMRbH6qO7 Ew stop making my merch look so ugly! Take it off you’re cancelled \nFugly slut! https://t.co/3gJntxIz9i It is; who’s awake?\nWho wants to be cancelled? \nJoin me. https://t.co/Ror3U0QE5l RT @KingInThisHoe: @IGGYAZALEA 🥂🥂🥂 https://t.co/63YZVtkrA7 All you need to know is I’ve been laughing for 48hrs straight now. RT @KevinWelchhh: Thanks for the free signed notebook my love 😍☺️ @IGGYAZALEA https://t.co/5zXUijlQMT https://t.co/JnB0qPYPbL RT @Stevenx222: @IGGYAZALEA Omfg I'm extremely excited to get my package😊😭 RT @HausOf_Michael: @IGGYAZALEA I get my vinyl on Tuesday. I’m so excited @ripfairys Just tell the customer service ppl. I signed some free merch and added it in to some orders to say thanks for waiting with all the annoying delays. 🥰 https://t.co/kUUPhfhSf6 OMG! \nYay! Someone got their package! https://t.co/WiVSpgaceJ Go grandmas! https://t.co/gzMZUUemdD Wicked lips &amp; devilish women That is extremely cute. 💗 https://t.co/7iYOK3oEzc Mmmmmmmmm...... \ndoubt it. https://t.co/vuK5xnL2EC I will be doing some merch for: \nMy single. \nThe EP.\nMean Christmas. https://t.co/HovBfp60kI RT @summeramericana: @IGGYAZALEA my imagination is activated like homemade slime A BAD FUCKING BITCH \nGooooooo Pabllo! 💗 https://t.co/MlXViIQ7NN Yes I agree; they are still cute. \nAnyway we aren’t using them again.\nSo that’s that, it’s a learning process and sometimes you don’t know who’s able to actually do what they say they can until it either happens or doesn’t https://t.co/zpg9pcCpkY Cause the manufacturers are fucking shithouse. \nI opened the boxes and they were just magically blue. \nNo one sent them anything about blue. https://t.co/SsuSAwrLx7 I wish it didn’t make it longer but I really enjoy being able to make the garments special and not just a logo on a black or white shirt. \nI know I will custom dye the merch for wicked lips. For surrrreeee. \nI want cute colors. https://t.co/YVHzhvcuxk Realistically it won’t be Because it takes about 2 weeks for me to get back simple screen print shirts without custom dye etc. \nand 4 for custom washes. \n85% of my merch is custom dyed/washed etc. \nI know. I’m annoying. https://t.co/fAiQyCQVaN We shipped about half the vinyl out so far. \nyou would have been emailed a tracking #. \ndon’t stress. \nwe packed about 500 more  yesterday alone but USPS doesn’t come to collect them until Monday so that’s when it would be in the system. \nThanks for being so patient. https://t.co/eLjsFepoS5 Yes! Definitely! \nI’m thinking a Halloween sale!? \nThat’s a good excuse for one. https://t.co/W07M4t6jHM Yes I’m bringing so IMD merch over! https://t.co/Jm9B8sIAT5 Ugh the smaller sizes go so quick but no lie, I wear the XL or XXL super oversized and I kinda love it. https://t.co/c8g9Fklomu RT @kuwkiki_: @IGGYAZALEA it is ! and it’s comfortable https://t.co/zs4RLUKgQW It’s on my webstore ! https://t.co/0pgKpw6NoZ What would I do without YouTube?\nCause low key it’s really my main source of entertainment &amp; I look up soooo much troubleshooting etc on that site. I really am co-dependent. @Shade02327953 @IggySite I’m INFP! This is just me tweeting I promise lmao https://t.co/mgnNDZV9oY Wicked lips dropping soon \nCause I’m a devilish woman and you can blame me for the rain, ya pinky toe growing crooked &amp; your dog not loving you. \nIt’s me, I did it all. \nWho’s gonna stop me? RT @crunchyweave: @IGGYAZALEA I think some of these dummies assume ur gonna be an easy target or a good deflection but the public + ur fans… Agree 1000%. https://t.co/8PEtoXSgyU And I love me some you! 🧡😛 https://t.co/Zg7pDmtCIg RT @bitterluh: @IGGYAZALEA i’m so excited https://t.co/2Af9CH5Zdc I’m dropping an EP next month no hint needed. Lol. https://t.co/KJN3nI4d6R Firstly I just woke up. \nSo don’t judge me. \nSecondly my Halloween decorations are going up today woooooo! Man I want these now this looks so tasty https://t.co/fc7n752hhZ CANDY FOR STRANGERS 🍬 You call it ghosting. \nI call it: dark mode. This perfectly describes my mother. \nI don’t even pretend to listen half the time cause I’ve realized shes happy to keep on having a conversation with herself regardless. https://t.co/Lvu3en4qFM You have 3 whole followers and yet you can’t think of anything pathetic you might need cancelling for? \nI have to laugh. Cancelled! https://t.co/DU3k2K4gGS Ha! Babe. \nYou’re Cancelled for pretending like your life isn’t one giant mental breakdown. https://t.co/vZoWTJcPH6 You’re cancelled if you think any of us believe those are you’re real eyeballs sis. https://t.co/UX4fMbO2l8 You’re cancelled for not being able to pay for real drugs. https://t.co/1It27dqKRp I came to cancel! \nWho’s been bad? Yes I promise I’ll be back in a little bit tonight and I’ll cancel some of you so you better think about what you’ve done to deserve to be cancelled and exposed! 😉 https://t.co/a1QoqzGiE3 RT @Angel945_: @IGGYAZALEA You’re welcome https://t.co/emZUm2lusZ Ahhh, yes. https://t.co/h5iUdGw6CD @oscarevarts That’s wierd cause all the men I know spend 100000x more than me! Lmao Only the silly looking ones. https://t.co/b9D4cx6Xlx Anyway, it needed to be said. \nI said it. \nCan we go back to photoshopping Pokémon into our pictures now? \nI preferred that topic. A man earns his success &amp; a woman is given hers - iggy azalea. https://t.co/80FuNaMDJ4 Men will always be credited with all the reasons why a woman achieves. \n\nAnd women? \nWhat do we get to our credit? \n\nWell, women get credited with any and EVERY reason as to why a man doesn’t have to be accountable for his own short comings. \n\nThankyou for coming to my ted talk. Thankyou for your service kind friend. https://t.co/ovbwmj6P0W Okay but who’s gonna photoshop jynx into my picture for me? https://t.co/N4rX8YRqIe So my mom sent me my favorite cereal; weetbix... \nand my boyfriend says that actually what I’ve been eating all this time is just granola bars with milk. RT @miks_mouse: @IGGYAZALEA Can't wait for my mom to find this ornament on the tree and Google the meaning of whatever it says 🤣 I’m making mean ornaments \nthis Christmas so save some room on your tree for me to add my bitch spirit to it. RT @theriellestrada: @IGGYAZALEA You are indeed the greatest twitter account of our generation. Now go sleep before the mcdemons call for y… I want to get McDonalds so it’s time for bed. \nBye gonna wake up skinnnnyyyyy\nYou’re not about to get me mcdemons. RT @trilmonte: @IGGYAZALEA RIP Foley https://t.co/7Drhtzu8fb RT @Ted_SirLouis: @IGGYAZALEA https://t.co/pbTPoasYUI are you and your mom gonna watch it while your fucking? https://t.co/cUSBRdyYUY RT @jlaranda95: @IGGYAZALEA I just got the notification that my backpack shipped I can’t wait to rock that shit as my overnight hoe bag igg… I’m really excited for the rest of the year. \nUsually it’s turned to shit by now and I’m saying bring on 20”” \nBut actually, I’m really fucking with 2019, I’ll take two more scoops please. Recess ! Yes! https://t.co/BGaunpSEXq The Amanda show and kenan &amp; kel 4 sure. https://t.co/l1aNjtVVEz Sister sister for sure I’d watch but not saved by the bell that wasn’t on tv at all for me https://t.co/PE7lWQilpS Yes. 10000000% https://t.co/vXgHQm4Jag Yes!!! That’s it! https://t.co/LSTweaKXH2 Also I loved the show were the girl has a magic opal and there’s a genie in it. Forget the name. Proud family yes, the others no. https://t.co/WZENqgYBFB On occasion https://t.co/GWcEWNAdyu Definitely https://t.co/xaRgzaYBZ1 Also Sabrina the teenage witch \nThe human one not the animation Rockos modern life for sure!!!!! https://t.co/9yQZGK0Iob As far as cartoons go: \nHey Arnold, cat dog and Arthur were my main shows. https://t.co/lULsWCDYpF Oh yessss! \nI actually pitched to have it remade for ABC family a few years back. \nI LOVED this show. \nCan’t believe I forgot it. https://t.co/mtm93izJXp She could turn into slime. Don’t @ me. https://t.co/ru01SvRJww I watched Alex Mack. https://t.co/VG1EJOFM3e I didn’t watch it; I’m too old for that show. \nbut of course I know the basis of what it is \nIe. She is a star when she wears her wig and a normal girl at school. \nI just didn’t get the reference to the iPhone. https://t.co/d7SdOf4V9B I’m dead ass too old to understand why or how this is related to Hanna Montana and I genuinely need it explained Because I hate the not knowing. I need closure. https://t.co/0iFVLEQtTw RT @MissRozayCarter: @IGGYAZALEA The I-Droid right😂😂😂😂 RT @unpetras: @IGGYAZALEA did you try turning it on and off again Just logging on for the second time today to tell you how much I hate the iPhone update. \nThankyou for listening. Being back guitar hero legends of rock for PS4 Hell naw it means I’m gonna complain on social media, slowly get used to the changes and then eventually claim it’s superior and I’ve always loved it, like a normal person does. https://t.co/qFwQ1uBiMN I love my new i-droid My phone updated itself last night without asking me and now it’s a whole new phone and I hate it. \nIt looks like an Android in an iphones body. For real! Damn I gotta give y’all a pay rise! https://t.co/1N8Ko4vueS RT @jugzaf: @IGGYAZALEA showed my mom and she fell in love! just ordered can't wait for her to get it!!! RT @CameronTyler05: @IGGYAZALEA For me it took 6 years to get comfortable having my scar from my battle. Just this summer I finally accepte… RT @IGGYAZALEA: My “strength in scars” \nPink ribbon day shirts are now for sale on my web store! \nLimited run of 100 available, \nReally pro… Yup def! \nBut I can’t do it every night cause sometimes I’m doing other stuff! \nI’ll keep cancelling you guys if you like, maybe some later tonight? https://t.co/vGD5r1zZ8w Remove the word your and it’s true https://t.co/pWoWae7Zbi Wow it’s finally fall-ish today. * softly spoken tone.* \nAfter they complete their date together they spend some time nuzzling, in the McDonald’s parking lot. I’d like the be the new voiceover actor for TV show “cheaters” please. \nI’m applying for the job. @mxope No it’s just what I have left outstanding. That would be so fucking nice. \nLmao. \nBut no. https://t.co/YkvOqVvsnK We shipped 127 orders today and I felt so accomplished until I saw there’s still 1,600 left. Fucking hell. \nIt’s a bottomless pile. RT @richyrich909: @IGGYAZALEA Review to come in 2-5 business days. 😂 https://t.co/mMIlZhJ4tw You can order it on amazon and they send it to your house so solve the mystery! The time is now! \n😂 https://t.co/wXrsWlwkkH Maybe that’s why I didn’t think anything of it honestly cause I really do love both those spreads. https://t.co/DSAfljoh6d I’m actually laughing out loud at this! What is wrong with my taste buds. https://t.co/vLLPrYrLvQ Alright I’m done cancelling for the day. \nIf I cancelled you I love you and I followed you. \nIf not... maybe it’s over for you tomorrow. 🤷‍♀️💗 Just admit you wanna fuck your dad and go... 🤮 \nYou’re Cancelled! https://t.co/SskGTz13Re Ew! \nIf you drink bubbles they wind up on your face. \nYou’re popped, pimple face!  \ncancelled!!! https://t.co/VlK1mwMnNO Ummmm money is the only magic power you idiot! You’re cancelled! https://t.co/mqq6PtH8VE Why would you think that would work you dumb bitch. \nIf you want to look skinnier use Facetune. You’re cancelled! https://t.co/wnWbCmqXE9 The curry is kinda complicated.\nthe satay is crazy easy!\nso here’s what I wrote out: \nI don’t actually measure my shit I just add and taste 🤷‍♀️\nSo these are rough measurements. https://t.co/nVsbucQTTR https://t.co/nb4YrVAZwn For the satay sauce ? \nOr the curry ? https://t.co/KIGvkAYL5v Right?! I got them when I went to visit Morocco 🇲🇦 https://t.co/DKUoL4DJpO Ohhh bitch I made some peanut satay sauce &amp; some green Thai curry sauce today and it is really magical. 😛 https://t.co/C0VxvX1z3y I’m kinda jealous I never worked at Amazon or target. My two favorite places (even if one I only visit digitally) https://t.co/PEhEs8GsRq I’m really a bit too into using the damn tape machine lmao https://t.co/zx0QYUxr49 RT @ReeceHoops: Cancel me for spending more money... BUT This design is AMAZING and the message is so important!There is so much strength i… Backpacks are finally in stock! https://t.co/CpG32Ocyvd Goooo Becky ! 🧡 https://t.co/9fuNqH1jjh Alright y’all I’m out. \nIf I cancelled you I love you and I followed. \nNight. ❤️😘 The reason you think you’re uncle is hot is Becuase you know you’re dad thinks you’re fugly. You’re cancelled, freak! https://t.co/qoy4JJOsyQ Stop masturbating into the toilet and thinking about him! \nGet a job! You’re gross! \nYou’re cancelled! 🤮 https://t.co/RWfqQLU98t The reason youre dehydrated is cause you’re a salty hating ass bitchhhh. \nyou’re over. You’re cancelled whore face! https://t.co/CUjQLUhvxR If you wanted to spend money on something that’s never gonna benefit you, you could’ve just bought me a new wig. \nYou’re cancelled fat. https://t.co/Mkksxcg54E I’m sick and tired of hearing you try to play the bongo drums in your apartment bathroom. You’re cancelled! https://t.co/tVhCgbC8wF Welp; On a positive note: \nThere were lots of different responses in regards to what we all personally believe &amp; we only encountered one crazy person unable to have a normal conversation. \nWooo! I’m proud. \nNow who wants to be cancelled?! https://t.co/YEGp3dPYRY I always enjoy talking about it Becuase I have no real agenda to push. \nI haven’t died and I don’t fucking know. \nI just think it’s entertaining and interesting https://t.co/hFeouwKHjh I mean, I personally identify as acoustic. \nSpecifically in the key of A major cause I’m a massive asshole. https://t.co/ES5B9ODkgD Why is the concept non-belief in God/higher power/after life \nDoes NOT equate to a belief in\nSatan etc. so hard for a lot of people to grasp. \n\nNo god = No devil. \nThey are a hand in hand thing. \n\nWhat’s not clicking. My “strength in scars” \nPink ribbon day shirts are now for sale on my web store! \nLimited run of 100 available, \nReally proud to be partners with \nThe LiveStrong Fountain on this; all proceeds benefit their charity. \nhttps://t.co/a86ismZ5cn https://t.co/7cSLSdQQo7 ODDA magazine! https://t.co/tTUe9c87i3 We have all the ingredients to make a happy meal at HOME! https://t.co/kHQKwxjGdj Morpheus https://t.co/NYZkUPY0yE He’s sooo cute &amp; bright. 😍 https://t.co/aL3bcERIZB 😂 oh no! Hahaha https://t.co/Nq1nSt0ekt No I’m not on the song, \nShe just asked if I’d make up some ideas; so hopefully Kash likes them &amp; they end up implementing them in a video which would be 😁 \nEither way, I just love that song! https://t.co/PwNxGr4B01 Just sent my video idea for \n“Doing too much” to Kash and I hope she loves it! \nI love that song so much! \nI’m ready for #Stacked 💗🧡 RT @blakey_1994: So here is the link to the limited edition vinyl at @UrbanOutfitters  @IGGYAZALEA  #inmydefense &gt;&gt; https://t.co/19vVfyhsya… I think You should learn that history. \nIt’s a marginalized group of people that make up a huge portion of the world and people should learn about stonewall etc etc. it’s relevant. https://t.co/91zJ3RIJXY RT @timmehtime1: @IGGYAZALEA Michael Jackson-Bad, cassette tape, same day I got a Sony Walkman🤤 RT @THEGEMINIFILMZ: @IGGYAZALEA Beyoncé dangerously in love I brought the Cd in target and was sooo happy RT @RoyaltDiamond: @IGGYAZALEA Mine was Monica miss thang 😂 I had the cassette tape front and back @IGGYAZALEA RT @LoveJohnathon: @IGGYAZALEA Mine was The Best Damn Thing by Avril Lavigne and was a CD. I begged to get it for my birthday and Idk why m… What was the first album you bought and how did you get it. \nIe. iTunes, CD etc. \n\nMine was spice world, and it was on a cassette tape! Lmao. RT @peuliveira: don’t delete your tweets too fast, give me 3 minutes to say something @IGGYAZALEA https://t.co/dazkC7JdWm https://t.co/ip5QMgnXd3 Hey guys! \nI’m about to post the pink ribbon day shirts on my web store today! \nStay tuned. \nProceeds from the sales will be going to LiveStrong Foundation. Alright I’m sleepy I’m out! 😘 RT @Daughterofbiebs: @IGGYAZALEA We love you but want to be dragged https://t.co/sxXHHmi2N7 😂 but, I actually love you all so much I hope you know that. https://t.co/vWcrHjWbEx Hi legend! https://t.co/1cO5lRCyZF Hmmmm 3? https://t.co/kJzEqVkEIj RT @babylodge: @IGGYAZALEA I LIVE IN VICTORIA I DESERVE IT RT @peuliveira: @IGGYAZALEA i can’t wait to be canceled tomorrow omg i’m nervous I can’t cancel too many ppl in one day or it’s meaningless! \nMaybe tomorrow if you ask I’ll cancel you then. 😉 https://t.co/m0cTAF6Gj0 Same. Probably why everyone is confused about if I’m trying to murder them or be friends. https://t.co/uTlPyOFF0x It’s glitching for me but not anything serious https://t.co/lx2tcWIne1 Twitter needs me. https://t.co/DL1rQRIVwZ You’re cancelled you fugly whore! https://t.co/Ti0JACxDXB @streamkisses I don’t care sis. I don’t have it saved on my phone anymore so I went with this one. https://t.co/N8PsDbSNGb RT @IrishAzalean: @IGGYAZALEA after signing 1 out of 900 vinyls...😂😩😂 https://t.co/a486KuodKN Nah. I’m honestly gonna be really busy all October getting this EP ready for you + the music video. \nSo I think that’s most important. https://t.co/6uzPjBIXMw If I WAS gonna dress up for Halloween I’d go as a cock destroyer with a friend for SURE. https://t.co/jqhNuqTwqp RT @NaughtyBeysus: @IGGYAZALEA Current Mood https://t.co/Nauifwy3GD Two. https://t.co/lhESIGZx9E RT @thankunextyuhh: @IGGYAZALEA YESSSS https://t.co/kZkTih1nZ0 Go go gooooo!!!!! Yup. https://t.co/3TxjOhECmT RT @bishdafak: @IGGYAZALEA OH SHIT THIS IS MY MOMENT https://t.co/NRbSC1pWZe My new single samples something Italiano (kinda) can you guess the song ? https://t.co/JT38Hu16ac I will soon. https://t.co/b0z8saZlig Just my regular face without makeup. \n\nChildren find it quite scary. https://t.co/0Rt6IPmVx1 RT @YamITrending: I love @IGGYAZALEA  and IDGAF ... Choke on a 🍆 if u feel some type of way I know for a FACT my grandpa stalks my twitter feed and I really hope he’s enjoying it. \nHi I love you. Real me is asleep \nFake me is awake \nI’m a Gemini. https://t.co/XJOyxbmD8I Alright fuck y’all for ruining my nice page I had kept SO neat for so long and now its in flames and looks like a pile of vomit. Is this what the inside of my brain looks like? \nUgh I hate the real me! \nI’m going back to fake me tomorrow. Same but reverse. https://t.co/S4RQrtIwp6 Your over fugly. Can’t cancel what Never started! 😉❤️ https://t.co/cBW9HnmzpO Where does he even save these lives from sksjsjsksks. 🤗🤲🥰 https://t.co/xdzIeEzrJt You’re welcome sean! https://t.co/NvSck87kMd You’re cancelled! You’re over! \nFlop! https://t.co/iHrNpFpOTC RT @skinnykneedle: @IGGYAZALEA We'll protect you RT @kaypeaux: @IGGYAZALEA https://t.co/mYgMuYOBo6 Y’all better have my back! \nI be sentenced to death by a thousand cuts every other week by the GP just so I can throw out my joke stuff on here &amp; get a few laughs outta Stan world. 😂 RT @biggrandeenergy: @IGGYAZALEA Igggggy. It’s great that you have a sense of humor. You’re keeping us fed tonight. Love you bae Should we run? They do seem \nPretty mad... https://t.co/CPRo8a9rkx Y’all! Come on now. \n I’m joking, and having fun. \nAnd you should too. \nThis is actually mean and NOT fun. https://t.co/LqY0DRIhQG Stop judging me. https://t.co/Au03FUCQqx RT @angeIsring: @IGGYAZALEA you’re so brave thank u for sharing ur story Now that I have your attention I’d like to share with the group: \nI gained 6lbs in the studio last week and I’m SURE it was cheese related; Becuase I haven’t had any since and I lost it all by Monday afternoon. Crisis averted. RT @needysdream: @IGGYAZALEA double negative is a positive so you’re uncanceled now 💅🏻 https://t.co/8kIAQkG240 https://t.co/1hMifrIyTn What. Y’all never uncanceled me. \nThis is an empty threat. https://t.co/DoHIq5l5Wm RT @casboyag: @IGGYAZALEA Thanks iggy for cheering up my night RT @milasmendes: @IGGYAZALEA WHY AM I LAUGHING SO HARD SIKDJFURU RT @JoonnieMono: @IGGYAZALEA We Stan https://t.co/9DwknSNjb9 We are promoting señorita only. https://t.co/vSdO4aCTQe Right. \nTrixie mattel is my mother why don’t these idiots know. https://t.co/yn5gwG3Okn RT @MelxMileyxAri: @IGGYAZALEA You’re actually one of my faves because you don’t take yourself too seriously and you always make me laugh w… RT @AyeshaLovesIggy: @IGGYAZALEA 😩 You're my daily dose of anti-depressants. Locals thought I was mad at pepper pig too so there’s that. \nI don’t think I can stop trolling tho.\nThis is my main source of entertainment. https://t.co/lT8anPJZla Tweet and delete is my lifestyle. https://t.co/gl1mqyrlDe RT @WMais_: STREAM SEÑORITA &amp; GET YOUR TICKET: https://t.co/wnOeK0WwNW @IggyAzalea #Iggy https://t.co/RaleI1rGJk RT @peuliveira: 76 days till your show in Brazil, yep i’m counting @IGGYAZALEA RT @omggroonie: @IGGYAZALEA Te amoo https://t.co/OKvxGSyy9F Listen. \nThis app is clearly for crackheads so stop expecting better from me. RT @nickdeluxes: @IGGYAZALEA let's do this https://t.co/zD4fnS0ES3 Streaming party at 9pm https://t.co/jYLBaXoK6x Lmao nah.... \nlisten I’m down to be petty in the name of a laugh or two but in all seriousness I’m just trolling and laughing at all the funny replies. \nI promise it’s not serious; at least not for me. https://t.co/ijyyI5cBX8 RT @cakesonmiley: @IGGYAZALEA https://t.co/dlLEStGUWb Stream señorita for clear skin: \nhttps://t.co/vSbIwYaTCC RT @mattebabygirl: @IGGYAZALEA if you can't make your own nostalgia, store bought is fine Today I’m going to make Asian style spare ribs in plum sauce and I hope they turn out exactly the way my family used to cook them...\nbut Im thinking I’ll fall short because they weren’t selling nostalgia at the grocery store. Thankyou. \nI’d like to give my award speech now if you don’t mind... https://t.co/8cppDuttjj Last week cause no one seems to understand 96.% of my page is just trolling. https://t.co/WWMHyqjybg See you in SP! https://t.co/fxbGeBQ9mX 🥰 you know I gotta bring the girls with me!!! https://t.co/THmfAFUmAE @Somaya_Reece Where is this !? I must visit! RT @baddieissuess: @IGGYAZALEA its thanos, we are at endgame now @cmilotic01 America is too tho stay woke The jokes on them cause I put a vagina reference in every song so who really won. https://t.co/LqLiuGpS8F RT @gdubs_16: Me receiving my paycheck vs. when the bills hit https://t.co/vL89KXQS8O RT @_Melodramart_: Me when i think i have find the right guy: https://t.co/1kntTufb3C RT @babylonimo: @IGGYAZALEA me when i think someone’s waving at me but it’s the person behind RT @xxlilhoexx: me thinking i can finally be happy 💔 https://t.co/1uFJSYCrd7 Me on iTunes when I think I’m bout to chart https://t.co/uF29dG611K My sister is crazy as hell. https://t.co/taiBiOiY4i Yes, there’s a few thousand of them that were sent to different stores but honestly (sorry) I don’t have a stockist list. https://t.co/iWFPfAUYzJ @Notoriouslggy Please go away @_DevanteBailey_ True. It really is so bad for you I’m actually surprised how many people opt for it when there’s an oven/stove right in the kitchen! Ummmmm.... excuse me? \nMaruchan is my aesthetic not nissin! https://t.co/6olL4qG0ir Woke up today with my wig off looking like an egg rolled in glue. 🥴 So @AliChater you’re probably back in England already and I’m still in the studio 🤓🤲😩 They should, yes. \nI still haven’t slept yet and am in the studio. \nWhen I wake up later today I’ll be signing everything. https://t.co/fGIXVau6s9 Not to brag but I wrote two songs tonight and I’m really happy with both. You are not me. \nPockets ain’t greased, Sandra dee. @Imtovenn I’m annoying huh Finally, after 100 years of waiting, \nThe cassettes and vinyl have arrived! \nStarting to ship out tomorrow. https://t.co/fpem4OdRvF EP. FYI. I hate hyping shit up but this song we’ve been working on all week is the most excited I’ve been all year about anything, I just love how happy it makes me feel. 🧡🙌🥰 https://t.co/yWN4T59woi RT @JoMatx: @AliChater @IGGYAZALEA https://t.co/Fd6xKjKhhc Wow I just read the billboard article @KeshaRose im so excited to hear your new music! Sounds bad ass. \n🧡 🤓pizza bestie https://t.co/pWH6R0k8vM It’s probably the best psychic reading I’ve ever had. \nI’ve always had a passion for fitness, and she saw me owning my own yoga studio! @ruleabreak It’s a postal service you can scream all you want they don’t give a fuck. 😫 https://t.co/K6lYdEk4gW https://t.co/yZHNoNertI Thankyou! Probably up next week! \nWill let you guys know 24hrs in advance. https://t.co/oKjLx0Ke5v I do! I love it! Thankyou 🧡 https://t.co/TCx4eJvvzV Great news! \nFound a charity to team up with for the pink ribbon day shirt I made! \nShould have it sorted next week 🥰 RT @pinche_humberto: Some bitch gave me a weird as stare because I was jamming out to my music or whteva. I walked up to her and said “I’m… Actually I’m not using this as a petty list button I’m gonna use it as a \n“Haha... wait... what?” Button. @ironworthy @savagelovatox Sorry it really was an accident lol Auto correct keeps trying to challenge my laugh style https://t.co/qNhs4yhFzT I think it 100% fails if it’s trying to be a anti bullying tool Becuase I know all I’ve been doing on popular threads is going straight to the hidden tweets and clackling. \nBut it 100% works as a petty button, if you wanna shit list of sorts. https://t.co/dSXwqXhRvg Twitters testing the “hide reply” button &amp; they have it to me as an option: it’s over for some of you 😂 😂 I love you. https://t.co/PXkL4ywsIx I’ve dodged so many bullets in my lifetime you would think I have a fuckin super power. Omg yes! DM me address. \nI haven’t printed yet; but will send one for your lovely brave mommy in oct 💗🥰 https://t.co/DMMjPFboUp Alice in Atlanta tomorrow &amp; I’m very excited! What will we write?! 😱 To everyone asking about when I get vinyl in stock. \nHere’s the latest update 🙂 https://t.co/jlrlj4yqD0 Hopefully, that’s my goal. https://t.co/dUa8GOuc47 RT @INSIDEURMlND: @IGGYAZALEA i fuck w this. you really went off Working on finding someone I can team up with now &amp; donate profits to. Stay tuned! 🔥🧡 https://t.co/opg6EkGPia Yes! 🙌 https://t.co/ym9Kt7cZdB I designed this for breast cancer awareness. \nIt’s rock/wrestler vibes! \nI felt it would be good to offer an alternate to the typical ultra feminine designs which seem to all be so visually similar. \nI also wanted any women with scars to feel empowered &amp; SEEN\nDo you like it? https://t.co/rpq1uVf99o @cyrusisbomb I LOVE them in Australia but HATE the American version. @iknowkhari @OTG_Kapo @puusccfein A surrogate doesn’t share any DNA with the child, what’s not clicking. \nIt doesn’t say this woman donated her egg, just her womb. This in no way makes his son his brother. RT @mikaelahappas: @IGGYAZALEA finally, someone who understands me Anyway I can tell you my next single is definitely about how I love being a complete asshole. Omg well? Did they like it or ? https://t.co/adDJZDjQw8 I want to buy guitar hero on ps4 immediately.  Don’t judge me. See you there!!!! Can’t wait Brazil ! https://t.co/fviYmQABvK This is actually so cute!! 💗 https://t.co/EivD1EoCBB We’ve got some signed notebooks, keychains, sticker packs or shirts going into all the orders as a gift to you guys for waiting so patiently. https://t.co/7G62WTJU4P Guess what. We started filling orders today at the new place \n🥰💗 Who’s the crack head in the half way house with the gossip show thing? 😂🤷‍♀️ https://t.co/63sizBhR5L RT @tropicofleo: @IGGYAZALEA And that's on POP! I’m not collaborating with either of these girls but imagine calling either a dollar store pop girl. \nI have to laugh. \nKim is doing her own thing and Charli is a next level pop girl that the main pop girls really could never be. 😴 https://t.co/DwTPI6jvY5 @bloodlinethief Too many weirdos on it Yup, I’m on there! Woo!!! https://t.co/uXp5Z1LewC I’m so excited about my next single. 😫. @Austin56360686 @bishdafak @XCXBABES Nothing to be sorry about! Just wanted to make sure you received the email. I’m 100% sure you will get a response but not until the 24th when people come to work 🥰 @Austin56360686 @bishdafak @XCXBABES Did you get an email about us moving warehouses and not opening back until the 23rd ? RT @trixiemattel: Me drunk leaving drag con incognito https://t.co/Iu3BDpiCjJ RT @nachuanimri: @IGGYAZALEA yeah I kinda love answering people with sarcasm so they're like \"UGH I thought it would hurt you :(\" and mmm n… When people tell you shit they think is going to blow your mind/mood and your just like: \n\nUmmmm yeah, I already know don’t care. Not important. \n\nI live for that kind of disappointment in others. \n\nIt makes me so happy. I mean. How can I refuse your genius #sponsored https://t.co/GT3y2GD59u RT @drugismybabe: @IGGYAZALEA Yes! That's exactly how it works If I randomly start adding #ad to the end of my tweets do you think someone will pay me money? I love twitter because you can say the dumbest shit EVER and people dead ass aren’t sure if you mean it. I really thrive in this environment. https://t.co/WiyVxfasXW I know I’m a bitch because it says so on my birth certificate. RT @realLutherSloan: @IGGYAZALEA https://t.co/X5D0zxzQHW Hahaha I’m just trolling https://t.co/c6DMKMahtm If you’re sad you’re ugly just find another ugly person and then be happy together. \nIt’s easy. https://t.co/1O7Ft81Pth RT @BarbadosBarbie1: @IGGYAZALEA PERIODTTT https://t.co/iz5Hcllm09 I like zendaya enough to reconsider https://t.co/cORtjgg3s5 It’s between: \n\nNew Spider-Man \nNew Annabelle 4.30am and I’m STILL up trying to pick a movie to watch, this is exhausting! RT @lbrettin29678: @IGGYAZALEA https://t.co/ATqDIa7BvC It’s Sunday and three of my fave shows are on: \n\nOn becoming a God in Florida \nThe righteous gemstones \nSuccession \n\nGotta go make some diner and snacksssss byeeeeee!!!! ✌️ Yes! Your dog is sooooo cute https://t.co/PnqpafJWAX I use Anastasia brow pencils and brow gel. https://t.co/RnPVISBHAG I WAS you’re right https://t.co/IkoZRXHoso I genuinely don’t understand why you’ve tweeted me my own age. \nI know that I’m 29 already. https://t.co/szV6ZRMgZh Idea time 💡 Iam here free of charge at your service (for real) with ideas. https://t.co/r1xmgyGKZv @kashdoll good!! \n“are you a boy or a girl” 😂😫 \nWe (I) need more of this. Yes!!! We love you &amp; we want more looks like the pink poodle situation for these new videos, please. 💗🤲 https://t.co/KX7aVKxY2Z Omg you’re so kind but I don’t want you to go without yours and I know you worked so hard for it. https://t.co/vo8BAvUS2O Thanks! https://t.co/e6IRet2qER 🔥😝💗 https://t.co/465E2oBdZJ What’s actually going on with summer, when is it officially fall? Thankyou for doing the lords work. \n\n(Jk y’all we love Taylor and Lana too 👑👑) https://t.co/crW0q2CzkG 🤷‍♀️🛫 https://t.co/DEJTeCvk9M Absolutely! https://t.co/BE8jiX7m2O Those ship out on 23rd with all the other non-vinyl- maybe before. \nWe start working officially on Monday. https://t.co/8ptepaQaSi Haha, that’s on DOT?! \nI’m laughing. https://t.co/9t6jEe83Hz So, let’s talk about this since I finally have a real answer about it. \nThey will arrive To me in 10 days and I promise I will sign and ship out as soon as the get here. \nAlso I will NEVER order vinyls via that manufacturer ever again. \nI’m so sorry it’s been so slow. https://t.co/YYDWPlqrVn I get that. But - You can over use any word or phrase tho. \nI pray a something new pops up for funny meme phrases soon lord help me. Hahaha https://t.co/DxA5BqaUgw Queen of... shutthefuckup I think it’s just whenever but I will double check. https://t.co/377ThiUGO7 New but they aren’t the brand I like, that was the last cup of the ones I prefer. Ughhhhh https://t.co/k80TPe5oFR I can’t be tamed!!!! https://t.co/w7ULdst1NO I put the kettle over the noodle cup (I always do) so it’s heat can keep heating my noodles and the hot steam won’t leak out. \nWhen I picked up the kettle, it got stuck to the bottom. 🥴😫 https://t.co/clbbmGEoiI I swear I hate my life https://t.co/UUnSNHblqF Underrated bop! Can’t I say that? \nI just did 🤷‍♀️😂 https://t.co/kDRCyrN7qM I wanna eat McDonald’s so bye I’m going to sleep instead so I can wake up skinnnnnnnnyyyyyyy 😇😂 this is a time saving thing to teach a puppy, cause they LOVE to run away when you call them... \nbut If I say “touch” he comes every time cause it’s a game to him. 🤷‍♀️ https://t.co/R5bsjj8lMM I just spent the last few hours reorganizing some of my wardrobe before the seasons change and BOY let me tell y’all... \nso much shit I’ve been saying I need to buy for winter I already own but forgot about. \nWho else does this? I know your ass didn’t.... https://t.co/kJde4KVF61 I’m getting my hair done today. \nWooooooooooo! \nA new woman shall emerge. Yup! Sure is! Go get that if you’re on that side of the pond 🤷‍♀️😆 https://t.co/VOUtL7LCZO I’ve noticed they don’t make much for cool punk rock dogs so I had to get crafty. https://t.co/WQBkaIU8bE Haha, I made it. 🤫🤓 \nJust buy some necklace charms in bulk on amazon. \nThis outfit cost 18.00 to make. https://t.co/kLlmGF3nay Cool Boy Bam https://t.co/TmuBrztvuF Every time I meet someone and dislike them straight away, \nWithout fail they always end up being a CapriSun. Tweets like this really are the only reason I continue to log on. https://t.co/OFvMLb9fDI I other unrelated news. \n\nA hornet crawled up the inside of my pant leg today and stung me 4 times! \n\nUnlucky as fuck You may have One. https://t.co/L2lS7O3asw Bye! https://t.co/h8PKAW4DgP https://t.co/zf9S2IrA8B Who else owns and plays crash bandicoot as a 29 year old woman?\n👀... \nit’s me. I do. https://t.co/GH5VJvdo0w We going bright &amp; colorful for winter, why not? \nWe did a death march and funeral for summer. Seasons gonna change any minute now and I need to start planning who I’m gonna be for fall. \nAm I a pumpkin spice latte? 🤷‍♀️ Love you. https://t.co/aq1PvU5HlX I respect bitches who’ve genuinely hated me from day 1 so much more than ones who jumped on a band wagon and go their hardest trying to convince the world they don’t know any of my lyrics by heart. Ugh! Sally!!!!! https://t.co/FwaI176m9f I randomly feel like eating uncle Toby’s (?) crunchy apricot muesli bars.\nI haven’t even thought about those since grade 8. Imagine actually being organized. \nA dream. I just wish at least ONE person I know would watch ‘succession’ so I could talk about it every week. It’s hilarious. Sooo.... who else is up planning their Christmas decorations? This is what I’m leaning towards however a reissue still means new cover etc etc for it, no slacking! https://t.co/TzjSEkkc4H I’m on the cover of Cosmo sis, go cop that 😂😂😂😂 https://t.co/5UPJclxDB5 RT @__bryan013: @IGGYAZALEA The most anticipated package ( 3/6 ) has arrived 😁🇵🇷\n( Biggest Puertorrican Fan ) I’ll frame it. https://t.co/n… Ayyeeeeee rode that! https://t.co/Xfhk45wrOa 🐾 https://t.co/VhFylVoKRH I love watching other artists reveal there new eras/creative direction etc. as much as I love creating and sharing my own with you guys. \nIt’s such a privilege to be a musician. Literally a nightmare. \nI can FEEL the hot ass sun beating down on me while I’m trying to sleep in as I type. https://t.co/AeDQc4KJL3 Yes. \nEverything is shipped via my warehouse now. \nIf you’re order isn’t in transit yet, that means it will be packed in Atlanta. 🙂 https://t.co/iU4UNllHT9 Labor Day sale still happening allll weekend on my site 30% store wide 😝⚠️ 🔥⚠️ https://t.co/JRc0VqaphA Kittens copy catting. a little pop of color for the teen vogue party. https://t.co/wJZEDI8JMd Here for all this. https://t.co/QykxVCEWht I’m thinking of making an account for my friend, Bam. \nHe has no thumbs so it’s hard for him to work the phone. https://t.co/Wge3G1XPTA Hey Lola!!!! 😉 https://t.co/gOeg3OdirK There’s so much extra pressure for your mom not to look crazy when you look alike. Every time I do someone else’s makeup for them it ends up looking like I did it for them in jail and had to get creative with the products. \nIt’s really bad. This is really cute. \nI kinda live for lyric tattoos. https://t.co/aYZtFumsfR He sounds homophobic if you ask me. https://t.co/PUaXKrB0xb 😂⚠️ I’m laughing. https://t.co/vBVLJLIjpJ My boyfriend told me he was bringing us chicken sandwiches from Popeyes for dinner tonight and he dead ass showed up with two slim Jim’s. https://t.co/eftl1z9V6y Wow I really binge watched “Barry” in 3 days. \nNow I need a new show AGAIN. @slaylikeiggy Haha, nah I’ve had the same MacBook since 2015 and so I related. I can by a new one but I want THIS one and it’s stressful cause I know the end is near. @filapose_jake Neither of those things have arrived in stock yet for me to sign so don’t worry. \nAs soon as I get them, they will be signed the same day. RT @jusdaydreamin: @IGGYAZALEA clown shoes but make it fashion I wanna wear so many cute shoes but my shoe size keeps whispering \n“Try it, I dare you, you long toe, flat foot bitch” Because you know how to serve a LEG. https://t.co/YrjY2hwKfa Some times I really be so over shit. RT @IrishAzalean: 🚨 MY CD JUST ARRIVED!!! 🚨\n\nTHE #INMYDEFENSE ARTWORK HITS DIFFERENT IN PERSON!!🔥\n\n@IGGYAZALEA KILLED IT!!🔥 https://t.co/z0… RT @mariojrcabrera: What I came home to after a long day of college! @IGGYAZALEA ❤️ https://t.co/5StCuljhDo @Gagasalbums I’m definitely signingnthem in the middle now . Love that. https://t.co/PF7xbH6Jlw Does anyone else watch “Barry” \nI think it might be my new show. When mentioning how bad iam gets you more attention than you can get for yourself. That’s called irony. RT @goIdendj: @IGGYAZALEA Those go HARD RT @mxxxchxxx: @IGGYAZALEA I love how hard working you are and all the effort you put into details, thank you thank you thank you, I really… Maybe I shouldn’t be excited about poly shipping bags. But iam. \nI can’t wait to make this switch and have you guys being way happier with the orders and packing. \nMamma has got you covered!!!! https://t.co/x7EoPU974d RT @_alvarogonzz: It’s finally here 🇪🇸 🇪🇸 🔥😈🔥😈🔥😈🔥😈🔥😈🔥😈🔥😈🔥😈🔥😈🔥. i love you @IGGYAZALEA https://t.co/UdSrhnFrfw RT @brdprsctt: My postmates driver tried to have a full ass conversation about this team as if my gay ass knew anything. Streaming IMD is t… I really came online to tell you how much I love gummy bears RT @ryankenneth_: originally told me it’d be here Monday, but guess what came today @IGGYAZALEA 🥰 https://t.co/OSzvipUxAu @AZALLION @imiggyslove Re classified is the true deluxe and it shouldn’t take much to figure that out. Case closed. I’m still waiting on them to arrive for me to sign them. \nI was told they are due to arrive next week. \nI’ll keep you guys updated. https://t.co/MRLBxlhhIn Don’t forget! 🇧🇷\n\nCompre já o seu ingresso: https://t.co/5KbsqPmKOc Meet&amp;Greet's disponíveis aqui: https://t.co/BqRS2YXzc2 https://t.co/Ei6qKIIRRn I’m a little obsessed with @AliChater 🧡 If I find out your a drunk-crier the friendship is automatically voided. RT @bawbbysworld: @IGGYAZALEA we're geminis sis, we don't wanna relinquish control even in the afterlife ☠️ \n\nmy ghost is gonna be hovering… This is a really morbid thing to say but, I don’t mind the idea of dying as much as I mind the part where I have to leave my body behind; \nMostly because I won’t be there to micromanage the way it’s handled. \nCan’t I just take it with me? @KayKayBeCoolin Happy birthday 🎈 Yes!!!!! https://t.co/VwSJvme3uh I wish you could send public voice notes on twitter as replies cause there’s a lot of stuff you just wouldn’t understand in pure font. 😫💗🧡 https://t.co/tZNnofI0k8 I’m the yellow shirt kid and the other two guys are the music industry. https://t.co/mU2C9Dh4RV Reason 105 I 💜 y’all. 😂 https://t.co/whbGiB1Sbs RT @pinche_humberto: @IGGYAZALEA I loved how they look and fit so ima get every color and sweater 🥴🤷🏽‍♂️ https://t.co/FYPIRT00kZ You’re the first person I’ve seen get theirs, yayyy! https://t.co/6gEFYIye55 RT @abbeywindover: miss @IGGYAZALEA is doing WELL in san diego, we need a restock! 😍🔥 https://t.co/wdhw0QRqQM I linked with @TIDAL to give you guys access to my #InMyDefense album release show in LA last month, Check it out at https://t.co/qjlSWmUSBj \n⚠️ #TIDALXIggyAzalea https://t.co/z89AiJ5MAl 🥰 https://t.co/2ZPR52XHvP Do you remember the future? A little update from my sugar daddy pim from the started video! \n💎💗💜 https://t.co/ezCn6eNwdx We thank you for your service. https://t.co/ylWrMkrcUa RT @DelishDotCom: Iggy Azalea Doesn’t Give A F*ck About Being A Troll During This Sour Candy Challenge https://t.co/dv9i3zxfBA Lmaoooooooo what IS wrong with me tho?! https://t.co/JO5Iji5zxz My grandpa turned 78 today and when we spoke on the phone he told me his favorite song on IMD is \n“Fuck it up” and he listens to it on repeat. Taste! Guess what guys; I’ve decided to cut out the middle man &amp; open my own packing and shipping for merch orders. \nThis won’t be up and running until later in the year becuase I have to \nget a facility up and running but I’m onnit!!!! Wow missy is getting the vanguard award &amp; I could not be happier!!!\n\nNow. \n\nCan we please get a medley performance &amp; can it please include the hot boyz remix with all the feature artists. 🤞 If you ever read an article where I’m giving workout tips, ignore me. \n\nI’m lying like shit. \n\nI just repeat stuff I remember from on the old tae bo commercials. future predictions $5 https://t.co/JfSRvVwGMX Picking a lunch box was seriously so stressful in elementary school. Waiting on a trixie X vans collaboration wedge sneaker. https://t.co/lVLUHXhij5 No!!!!! What one?! 🥺 https://t.co/2biX8ZSKIe RT @StanIggs: @IGGYAZALEA Remember to be passive aggressive but with an ! At the end There’s really nothing better than sitting down at your laptop and writing a lengthy &amp; slightly bitchy business email about something you’re sure you are right about. \nI’m sick. I know I’m going to regret tweeting this but I think I’m ready for summer to be over. \n\nI just really want to wear warm clothes and layers again lately. YES. YES. And YES. https://t.co/0DwBbPiPhg Okay but why wasn’t I invited on vacation? 😞 https://t.co/Jt5lm4wU8M I’ve released music in: \n2011 \n2012 \n2013 \n2014 \n2015 \n2016\n2017\n2018\n2019 \nDon’t let the media confuse them pretending I died with an actual “break” lmao https://t.co/0GHXfehP1O RT @Drastically__: @IGGYAZALEA And that's on what? They also don’t write them either. Critics don’t stop checks. Yes! Definitely! \nThinking of adding some more places too... maybe Mexico ?! \nWhat do you guys think? https://t.co/5iGb3FygdD Just wait and be surprised. \nDef dropping more new stuff. https://t.co/iySn4hAwcg You’re a C _ N T 🙂 Woo hooo! Finally! https://t.co/Szq3KMmFiA This is so cute and unique 🧡 https://t.co/6YeInaz3Rb Me interacting with Stan twitter. https://t.co/h1HrEsmJTd I’m gonna post a little behind the scenes video in the AM. \nIt’s a bit of everything that happened the week leading up to my album release. 😊 Anyhow, I feel much better now that I’ve put that out there &amp; \nAgain, Thankyou so much I’m very grateful to everyone for the opportunity. 🧡💗 I noticed in the article some of our conversation was attributed to subjects I wasn’t asked about/ intending to commenting on. \n\nTo clarify: \nI was asked how I deal with hate. \nMy response? it’s easier to deal with when you consider art subjective/a matter of personal taste 🧡🤷‍♀️ Just wanted to say thanks so much to the @Cosmopolitan creative team for my beautiful cover.  \nthe pictures are some of my most favorite, ever! 🧡 \nI also I wanted to mention today was my first time seeing the shoot &amp; reading the article ⚠️ https://t.co/iuhAb8CYbY I need a new show to watch... \nsuggestions ?! I loveeeeee!!!! https://t.co/3l3W9GVY0u RT @Joamethyst_: @IGGYAZALEA https://t.co/O1LWonMuaC No Stan twitter is saying “deserved better” to a song you never bought on iTunes and streamed 1 time. https://t.co/1Wb2CYFsj7 @baendon_ Well I say that because it’s happened before on my channel. @baendon_ I dunno I’m seeing if maybe my page is hacked? Def wasn’t anyone on my end. @baendon_ Where ? I don’t get it I think everyone should do this when your part comes on honestly. https://t.co/4QtQmwVcLD San Francisco!!! https://t.co/Q36CRzwAMN I like to preserve to warm ppl up before the real serve. https://t.co/JrrifTBdNH Ps. \nShhhh I know. \nI’m annoying and I can’t spell online. \nBut I CAN spell in real life (lies) https://t.co/obtcrrB2Tu Thankyou to all my fans; every time I meet one of you &amp; you tell me your memories of listening to a song; or how something as simple as me preserving encouraged you in your own life it really brings me so much joy. RT @ivydeee: @IGGYAZALEA whole album is nothing but bopssssssssss RT @ohlilmario: @IGGYAZALEA that new album is too bomb boo 👏🏾👏🏾👏🏾 RT @fakeassxavier: My highlight of my summer is seeing @IGGYAZALEA RT @lukasamontes: I saw @MissShugaCain for the first time at @IGGYAZALEA’s show in SF and she was honestly sickening.\nNew fav. I love meeting you all!!  🧡 https://t.co/5jTpQCca0m Not yet they aren’t ready. \nI signed posters &amp; CD today. \nHoping cassettes &amp; vinyl are ready soon! https://t.co/NR1mitLHcM So basically spending all my money &amp; then becoming depressed about it over and over in a vicious cycle called adulthood. https://t.co/Q66KbkpYCV RT @austinjrandall: stream “in my defense” or end up like this 💥👩🏼💥 — @IGGYAZALEA #inmydefense https://t.co/CnIPqaJp52 I’m in San Fran who’s coming to the show tonight ?!?!? https://t.co/0ujKMQtnTv RT @calmandsuck: só vem SUA GOSTOSA @IGGYAZALEA 😍❤️🔥 https://t.co/BmEAEfPyhU RT @IrishAzalean: 🚨 18 MILLION VIEWS!!!! 🚨\n\n🍒 #FUCKITUP 🍒\n💋 @KASHDOLL 💋\n❤️ @IGGYAZALEA ❤️\n\n▶️ GO WATCH!!!: https://t.co/NcyANDFjv5 https://… 24hr drop tomorrow for this tee! \n🍒 \n\nI’ll make it available at 12noon EST https://t.co/DUCHE5zmY6 @NathanAzalean @feedthewolvez Everything is ready besides the actual CDs and vinyls etc. \nI know I’m signing CDs &amp; poster tomorrow so I assume they may ship next week. Not sure when cassette or vinyl are ready. @feedthewolvez Nope, it’s just like any other store credit card type deal. \nYou pay an amount on purchase, \nYou take the items home, you pay monthly until no balance is owed. RT @vitor_snm: @IGGYAZALEA VEM PAPAPUMMMMMM https://t.co/iHDZs0Ddyz RT @prismou: @IGGYAZALEA I CAN'T WAIT TO SEE YOU 💜✨💜✨💜✨✨💖✨💜💖💖💜✨💜✨💖💜💖💖✨💜✨✨💖✨✨✨💜💖💖💖 https://t.co/pJJQqu6TMN RT @stressedboy13: @IGGYAZALEA Mal posso esperar pra te ver, te amo https://t.co/Zo6fiYbR0c RT @shwnfIicker: I CANT WAIT I WILL SEE MY QUEEN OMG  #IggyNoBrasil @IGGYAZALEA https://t.co/Jcp7V9cMMp RT @largaryen: @IGGYAZALEA TE VEJO NO DIA 15!!!!! TE AMOOO 💛💚 https://t.co/NXQe93TQt2 RT @Nan_Albertiny0: @IGGYAZALEA I'll be there MOM ❤️❤️❤️❤️ https://t.co/upp8hPB8YF no dia 15 de dezembro eu vou me apresentar pela primeira vez em SÃO PAULO! Uma noite apenas! \n\nCompre já o seu ingresso: https://t.co/5KbsqPmKOc Meet&amp;Greet's disponíveis aqui: https://t.co/BqRS2YXzc2 https://t.co/IqIbnPd8JP Tickets are on sale 9.30am tomorrow. \nI will post the link in the morning; but wanted to give my die hard fans a warning now, because there are only 200 meet &amp; greet passes!!! https://t.co/EZumusGAl7 Save money you got time lmao https://t.co/Dea6VbjbQO RT @dearlittleliar: @IGGYAZALEA I hope there's a lot of tickets cause I need to buy one. IGGY AO VIVO EM SÃO PAULO 👀 RT @mcveyjake96: @IGGYAZALEA ya new album is such a mood. Ugh. 💘 RT @EaGrem: @IGGYAZALEA just fucked it all up with this new album. \ny’all haters can stay mad. RT @stephwoolen: Still got @IGGYAZALEA new album on repeat 🙏🏻🙏🏻 Sis, it’s a joke. Calm down. https://t.co/fgPPD5tJuQ I also think me: an unmarried 29 year old women living in Atlanta would make the perfect addition to a show about house wives in Beverly Hills. It’s the perfect casting! https://t.co/twLKhingXo RT @AshtonPearson14: Honestly @IGGYAZALEA s new album is a banger. RT @S0UNDPR00FMiND: I’m in a @IGGYAZALEA MOOOOOD👌🏾 I work hard, NO time off, WONT climb OFF my HIGH Horse 🐎 👌🏾🐸☕️😎 https://t.co/Ot42E7VsjA RT @ChartsOnIggy: Most viewed videos in the past 24 hours:\n\n50. #FuckItUp — @IGGYAZALEA ft. @kashdoll (+5)\n\n[1,310,757 views]\n\nThe MV has r… If anybody needs to make a call... \nI’ve got a phone! \n\nhttps://t.co/3WmOOGgWh8 https://t.co/R4Ym7TttRu RT @ChartsOnIggy: Most Viewed English Videos in the last 24 hours🌍\n\n18. \"Fuck It Up (ft. @kashdoll)\" by @IGGYAZALEA (-1) *New releases*\n[1,… Yup! Cause I censored the word fuck in its title. \nI didn’t know it was an issue for YouTube. Now that it’s been censored it’s not being hidden. https://t.co/rOPg5t8vyt RT @MeeklyMeka: 💜 myself some @IGGYAZALEA RT @lukasamontes: Who wants to come with 🥺 https://t.co/1WnPxsUDzZ RT @itsivanacosta: Who’s gonna let me crash at their house this Friday for the @IGGYAZALEA show in SF? Anyone in the bay? RT @_maakmaynee: Catch me out there alone 😭 @IGGYAZALEA https://t.co/eqpF5a5Ogl RT @wtfkeekz: Someone please fucking come with me https://t.co/WD3ltAsWnB RT @eaimariax: @IGGYAZALEA COME TO SÃO PAULO MANAAAAAA RT @Nan_Albertiny0: @IGGYAZALEA São Paulo te espera rainha 💖💖 It’s a nice place, love Rio. Lol https://t.co/cjz7I5WpmJ RT @selenastroye: finally seeing @IGGYAZALEA in 3 days It’s been literally 10 hours since I last tweeted but okay lmao https://t.co/hTVNXQaxI3 San Francisco who’s coming to the show on Friday ?! \n\nTickets are on my website \nhttps://t.co/XB5Dn8sJrW https://t.co/ATe3RPujjA I can’t find my charger and I still have 4 hours worth of tv to binge watch on my phone. Fuck. RT @deel_cody: @IGGYAZALEA Going from #144 (sts) to #50 is a huge jump! I’m so so so so proud of you! Plus the higher position was while be… I think sometimes I feel defeated because I look at the chart and see how much streaming impacts it, and think how can I win when I’m up against THAT? \nBut I also feel like: okay, and? \nThere are two options. \nQuit. Or  \nshut up And just keep fighting. \nSo I’ll keep on fighting! https://t.co/HgfbI5vjB8 Tomorrow! https://t.co/R1S5RIHmMq Two weeks till I’m back in the \nStudio! \nWoke up today feeling a little defeated, ending the day feeling motivated. 👀⚠️ https://t.co/lQZxZmEyC9 Brazil save ya coins I’m announcing something on Thursday! Baby steps were gonna keep on pushing forward!!!!! ⚠️ https://t.co/j6qFBzpkfK RT @billboardhiphop: Reclaiming Her Rhyme: @IGGYAZALEA on her new album, new label and new perspective https://t.co/bK4qcV1HEe https://t.co… @kremecIassic Who we leaving behind ? 😇😇😇 https://t.co/c6oAdXex7F I did! And I deleted it off my camera roll! 😂 https://t.co/uTfAcNwcJY Listen. \n\nWhy can’t I ever post this damn flyer without fucking it up it’s actually starting to drive me insane. https://t.co/47Soff6pAm RT @KayKayBeCoolin: If y'all don't understand by now, in the USA the shit will always be rigged against her. That's just what it is at this… As long as I do better each time I try to achieve something, \nI keep on going. \n\nA mile a head would be great! \n\nbut all I need is an inch forward for me to know I’m aiming in the right direction. See you sluts in San Fran! \n\nhttps://t.co/BTP8Apjnk8 https://t.co/mYvlcVFOAm @FKApadme Tbh I’ve never seen one! Haha I just know about 6-9 people 25-35 without kids that have season passes and love to go. 🤷‍♀️ RT @LAtimelessAngel: @IGGYAZALEA It’s me, I’m the Disney gay you’re looking for https://t.co/eHeg662wqj Tell me more https://t.co/dirHPkOKq9 No, but only because I like scary rides. https://t.co/fY3CuxBaA4 In a totally non shady way I can answer this writers question cause I know hella ppl in their 20s &amp; 30s who go regularly. They live in the city the park is in, go for an afternoon &amp; have season passes. \nIt’s not a comparable cost to a vacation. https://t.co/985DDk5Tij RT @lovebscott: 🎶🎶🎶🔊🔊🔊🔥🔥🔥 ⁦@IGGYAZALEA⁩ ⁦@kashdoll⁩  https://t.co/1LgqW1ZO1j I’m coming in December! https://t.co/hxsxqaqcEP Wow I love this story. https://t.co/FkYPbhd4C9 RT @MissShugaCain: Yaaaaaasss!!! Who’s ready?!? https://t.co/F8M6eIEnvC RT @MsIsisKing: I want to go to the club just to dance up on a guy to @IGGYAZALEA song #JustWanna, then walk away after the song is over be… RT @Ahmedxjean: I feel like my therapist is so jealous of me &amp; gives me the wrong advice because she wishes she could be me  https://t.co/d… Can’t steal what I have a receipt for! https://t.co/bziJHYOtBZ RT @riichardgaga: Spit in it &amp; you got a deal https://t.co/pbY2YbQAuV https://t.co/jCGU5QtMQu For Sale: \n\nMid century - modern vessel. \n\nA transitional piece with \nSleek lines &amp; mild wear. \n\n$104.00 https://t.co/DPmSum9hFq I’m wrapping the HDMI cords up as I type this https://t.co/D3wPGIfuUK So I got a free bucket. \nAnd I’m keeping it, I need to make back my money. Update there is no ice In the ice bucket. 😂🤷‍♀️ https://t.co/akVetoYdbs Anyway I got a complimentary bucket of ice; so at least I have something to drink. Plot twist: \n\nI’m reporting this card as stolen. https://t.co/qkuptvbWC3 Yes! 🥴😖 https://t.co/cn7sUeRWEX UPDATE: \n\nI’m not kidding I just got the bill and they charged me and extra 10.08 for knifes and forks which aren’t included free here.... \n\nSo grilled cheese (that I can eat with my hands) is now \n\n64.08! We love scammers. https://t.co/qImyurb9UR Watch for good luck! \n\nhttps://t.co/3WmOOGyx8G https://t.co/UQ6RoxvYGY RT @7RlNGS_: @IGGYAZALEA what restaurant is this ? I’m going ASAP!! I just paid 54.00 for a grilled cheese sandwich. \nLas Vegas. https://t.co/NCCJyLYlzM Who’s coming to my San Francisco show with @Silky_Ganache and @MissShugaCain ?! \n\nhttps://t.co/BTP8Apjnk8 https://t.co/5Yr06SJyUe Same. We are in the history books now. https://t.co/5yX1nAprWu Woah! Happy birthday 🎈 https://t.co/f7pFZWkZci RT @IggyMundial: \"F*ck It Up\" music video 🍒 by @IGGYAZALEA and @kashdoll has now reached 10 million views on YouTube!\n \nKeep watching: http… RT @IATodayBR: Iggy Azalea performance 'Started', segundo single do álbum #InMyDefense no All-Star Beach Party em Las Vegas hoje! https://t… Only baddies understand my music https://t.co/DGiF5w3DOA RT @MandalayBay: DJ @ecambage + @IGGYAZALEA rocking the orange carpet before the Beach Party. 🔥 #WNBAAllStar https://t.co/aVHq6USWgw RT @DJWhooKid: #NewMusicFriday Watch @IGGYAZALEA + @kashdoll “F*ck It Up” in their hot new video!! 😫#WhooArmy #FuckItUp #KashDoll \n\nhttps:/… RT @Danielalv93: @IGGYAZALEA @MissShugaCain @Silky_Ganache Since the LA show was so lit. Round 2 https://t.co/iaogUbr1ag RT @MandalayBay: @IGGYAZALEA Cannot wait for tonight @mandalaybay Beach! #WNBAAllStar #ConcertsOnTheBeach RT @lifeisterrible: I think I'm in love with @IGGYAZALEA RT @iliwayout: @IGGYAZALEA @MissShugaCain @Silky_Ganache got them 🤝 https://t.co/CDpKoPW6vC RT @pillowpwincess: @IGGYAZALEA @MissShugaCain @Silky_Ganache SECUREDDDDDD SEE YOU SOON BABY https://t.co/TIr23OTLeR San Francisco tickets for my Aug2 show + VIP passes are on sale now. \n\nSpecial guests: @MissShugaCain + @Silky_Ganache \n\nhttps://t.co/bsOUCOP1cy https://t.co/O08nNHbDxd RT @ATT: We're going LIVE with @SnoopDogg and @IggyAzalea this Friday! Tune in to the live stream at 10:15pm PST for their performance at t… RT @IggyWorldNews: Azaleans! ⚠️🚨\n\nIf you have purchased merch from Iggy’s website that includes a digital download of “#InMyDefense,” make… RT @sath2es: @IGGYAZALEA IN MY DEFENSE is my actual mood We look cute ! 🧡 https://t.co/KBmYV8Krj3 I just got to Las Vegas ! https://t.co/nXkPxlXgOa The biggest scam of all time \nIs when pilots tell everyone on the plane they’re going to land earlier than planned: \nCause we’re just gonna sit on the runway for an extra 30mins waiting for the scheduled gate time to de-board. 😖 Babe, relax. \nCritics have literally NEVER given any album I’ve made a good review &amp; im still here! 😂 \nWhat did you think was gonna happen... https://t.co/WUTTxnFl3L 👀 https://t.co/JiBYq26tCl I mean. https://t.co/zuQVFr7vin omg I have several shows left to binge watch and I need to be up at 7am. Help. This was my pose at the 6th grade disco. Thankyou for helping me recreate; I love you! https://t.co/K7ey6Wtqga RT @eliseinthelight: Joan Jett really was that bitch https://t.co/XYrXGEWoZW @4minute9muses Do you mean singing ? \nYou aren’t gonna get one ever again Yes, you too! I think the SF show tickets go up this Monday. https://t.co/qcNex8cz4R Brazil fans prepare your coins \nI have an announcement next week 👀 RT @villyart_: WE NOT THE SAME LIL’ MAMA, I DON’T WAIT IN LINE H’OKAY  @IGGYAZALEA RT @villanarei: me approx. 30 seconds after listening to @IGGYAZALEA’s new album https://t.co/V8KZJCDn04 RT @briascosmetics: @IGGYAZALEA really is THAT bitch. I fw her heavy, but this new album #inmydefense is 🔥 How could I vote when you didn’t even nominate @trixiemattel pfft https://t.co/QSE8gQkNSf I may or may not have eaten a  tarantula today.... \nI guess you’ll have to watch the video to see 🥴 It really is tho. Lmao https://t.co/cC8zcBbIQW I’m ready. Come pick me up. https://t.co/UyEFTkAxJs https://t.co/HMpz2SvIQB Duhh https://t.co/ikfXGT9J0K Remember savior, that song where I speak about struggling with depression or the stunning video Colin and I created for it? \nNope? \nYeah...\nIt’s probably because y’all don’t actually like when I’m vulnerable so quit cappin and get them cheeks clapping.... \nthis is IMD biiiiiitch How nice is it when something works out the way you envisioned it? \n\nJust looked at these designs for the fuck it up video and it really did look exactly the way I planned in so happy with it! \n\nhttps://t.co/VBRGDWDWLE https://t.co/O8bnX0RCwb RT @borgertxx: literally no one:\n\nmy mind out of nowhere: fuck it up sis, just fucking it up\n\n@iggyazalea #inmydefense RT @shuavomit: THAT’S MY ART ON IGGY’S NEW VIP TAGS! EVERYBODY GO SHOW LOVE! \nthank you for embracing my art like you did, ILY FOREVER @IGG… RT @TheAdvocateMag: .@IggyAzalea surprised #WeHo's #EVITA party by judging a twerking competition and performing her new single. https://t.… RT @owenmurrphy: @IGGYAZALEA Jojo thinking just smile and wave y’all https://t.co/0PC82JrAUN RT @accessonline: @IGGYAZALEA Legends supporting legends RT @thelightisover: @IGGYAZALEA jojo said : do i know you luv https://t.co/Vt5nJ4MphK RT @JVicoco: @IGGYAZALEA The way she doesn’t give a fuck is iconic 😭😂 RT @MusicChoice: @IGGYAZALEA this is... the best thing i've ever seen RT @xoxoluv4iggy: @IGGYAZALEA @itsjojosiwa was like who is this grown ass woman 💀💀💀 I saw a celebrity in nyc today! 😜 I’m such a tourist! https://t.co/XOktvGHE8x RT @MxhmoudG: Okay just framed everything I got yesterday. My poor credit card 🥴 @IGGYAZALEA https://t.co/QEXyMZssHa RT @MaJarrett15: @IGGYAZALEA new album fucking SLAPS y’all... every song 🔥🔥😭 Character development. \nWelcome. 😂🧡 https://t.co/azBaFgQ0Dz RT @majinnuub: @IGGYAZALEA THIS WAS 🔥 https://t.co/2tswvwWlA9 RT @softforavalance: @621_chris @theofficialigor @IGGYAZALEA “You can say what you want about me as long as you pay me” is iconic too Girl you look great - \nDon’t be so hard on yourself! 🧡 https://t.co/jDTKizTHTL Thnx!!! https://t.co/GrbvxoGAdZ Haha, exactly. \nBut shout out to everyone who’s made this week fucking ammmazing tho! 🧡⚠️ https://t.co/SJO23A5bm3 Group pic from outside the car, promised I’d post here’s what I have saved in my phone. https://t.co/LcKYTyDoPD RT @IggyMundial: iTunes USA 🇺🇸 Albums:\n\n42. Iggy Azalea - In My Defense (+2)\n\nKeep buying guys! #InMyDefense https://t.co/Cz0viHH2uc These are so cute! I told y’all to go to the pop up shop! I only give aesthetically pleasing vibes. 🤷‍♀️😂 https://t.co/5d9ZIir9My Okay ! https://t.co/HBSgjXffk1 Silky you’re amazing and I’m so happy and proud to have you be a part of my show. https://t.co/k5InYRJMm0 RT @gaga5foottwo: @IGGYAZALEA SNAPPED THE FUCK OFF 🥵🔥👌🏼! #InMyDefense https://t.co/XI2seciGfS Sis should I Facetune is all or... ? \n👀 https://t.co/AJ3ghqh6r5 Haha y’all are so much fun! \nI’ll bring back twerk pit in GA for \nSan Fran - \nIt was too small in nyc and I didn’t want ppl getting crushed etc. 🧡 https://t.co/8xZwXxyJMK RT @bloodymoves: Spend it 😍🔥💰 https://t.co/oYjpi7OFja I had such a fun crazy night with you guys NYC! \nNext time let’s do it even bigger! https://t.co/dordZeNyr6 RT @TravisBadal: 💖Fuck It Up Sis💖\nHave you seen @IGGYAZALEA #MusicVideo For #FuckItUp Featuring @kashdoll  and special guest appearance by… I’ll be here tomorrow, Come say hi! https://t.co/TbRrDpY1L7 RT @AndrewArianator: thank you @IGGYAZALEA for the pizza 🤪😂 #inmydefense https://t.co/HyeGYsXrvU RT @KevinWelchhh: And I could give a fuck who ain’t feeling us. @IGGYAZALEA #inmydefense https://t.co/gXQWLdvaUU We filmed it! It will be on tidal soon! https://t.co/1RxgAqzh8J Wow I really forgot to crop that last pic. Haha. Who’s at the pop up shop today? \nSend pics I’m still waiting to sound check 😫 https://t.co/H9rwkWpREe RT @PhiPhiOhara: Fuck it up! 🔥🔥🔥🔥 \n\nPay attention, Iggy is slaying! Ijs https://t.co/7GRxxfk8C7 Y’all really be thinking I’m genuinely upset when I’m actually  just trolling you over lunch with friends. Im a Gemini. Chill. RT @AshleyCrouch95: Since #InMyDefense came out I can't stop singing \"spend it,spend it,spend it,spend it.\",\"if I want it imma get it,get i… RT @TVObsesssed: Everyone going to see @IGGYAZALEA tonight have fun get ratchet but stay safe wish I could be there but life ya know if any… RT @1033ampradio: Have you heard @IGGYAZALEA newest album yet?!\n\nWe've got it on repeat 🔥\n\nhttps://t.co/OlnIyJHMSJ RT @Shea_L_H: @IGGYAZALEA I can’t come cuz I’m ugly but have a great show. Fuck it up, sis. NYC who is coming tonight!? \nI’m hereeee!!! 😬😄 https://t.co/aPygPuWbiU Free shipping!!! \nhttps://t.co/ahHwXx4WP6 https://t.co/Ld37W1j3FO RT @LeahSchmidtke: I've decided @IGGYAZALEA is an actual perfect specimen and if you dont believe me go watch her latest video #FuckItUp 🔥🔥… RT @audreylorene: @iggyazalea slaps. that’s the tweet. RT @t00__cute: Me and my dad listening to @IGGYAZALEA on this fine morning Well @kashdoll are you? 🤷‍♀️😂 https://t.co/DJ05Q1bw5m RT @IggyMundial: Today's most viewed music videos on Youtube:\n\n41. Iggy Azalea - F*ck It Up (+15) [+1,494,629]\n\nWatch it now 🍒:\nhttps://t.c… RT @pabllovittar: 🔥🔥🔥fuck it up sis🔥🔥🔥 https://t.co/XeltD5LUED RT @DLillustrations: F*CK IT UP SIS 🍒 @IGGYAZALEA &amp; @NikitaDragun by DavidLeeIllustrations on Instagram ✨#FuckItUp #InMyDenfense https://t.… If I have any left after San Francisco I will put any stock online https://t.co/LD38EHfTvp RT @kaylanechole: like literally I've bought pretty much everything @IGGYAZALEA lol \nJust waiting for my #InMyDefense merch to arrive 🤗😍\n\n#… RT @PlanetGarcia: Make sure to check your emails and download the merch links! https://t.co/0FsSl81o3j I’m finally going over all the pictures we took at the show and the pop up in LA I will post them in the next day or two - bare with me! \n💜 https://t.co/v0EWqh5Msk The cream defender hats are at the pop up with all that collection of merch. The ouch hats are at the show Merch stand with their respective collection of ouch related IMD stuff. 😊\nJust walk past ☺️🤷‍♀️ https://t.co/3UkMwMnnzS So re merch tomorrow... \nbasically if you wanna see any started Merch or any of the defender sweatpants and sweater sets etc. you gotta walk past the pop up! They will ONLY be at the pop up! https://t.co/U73qMwf7l5 Finally a chart I like! https://t.co/J915203V6e @liftedshadow Lol well I’m not IN the city until 11am tomorrow so I have a crazy day. I couldn’t get the permit for other days and figured you guys would rather have it than not at all. I’m gonna try and swing past on my way to sound check! https://t.co/K06bUtlge3 the pop up shop is super close to the show tomorrow! \n\nIt’s extremely cute, with lots of little moments for pics etc. \nit also has merch that won’t be at the show since I can’t fit it all in the Bowery. \n\nHighly recommending you go in on the way to the show! 😇⚠️ https://t.co/c692LIxNSs RT @yikesroxi: @PopCrave @IGGYAZALEA @peppapig @pabllovittar watch the Fuck it Up video 🍒 https://t.co/NwBuYALQo9 Cause you’re amazing 🍒⚠️ https://t.co/6WwsXfuWLj Keep watching! https://t.co/cPdQY4aYIn San Francisco in coming to see you Aug 2! \nI will post more details when tickets + VIP become available later this week. https://t.co/mLPwjvDoTc No but I’m gonna start recording it in August so... \nI better get thinking! https://t.co/VBaM8YMUzg RT @venicetinch: @IGGYAZALEA if anything it was a cult classic RT @27Nikol02: @IGGYAZALEA IMD made me wanna listen to ignorant art and trap gold again, so I'd say its fucking perfect lol RT @fancyoutpeaked: @IGGYAZALEA I love this direction i mean you can shuffle the album and it is not a mess. Perfect i LOVE it https://t.co… Haha! No one but you know I don’t do many interviews. I figured maybe I should clarify my motivation again. 🧡⚠️ https://t.co/wAPMlCdlBe If you’re thinking \n“She should have done something more pop so she could have gotten the gp into it” \nYou missed the point of the whole thing to begin with. RT @marizartz: @IGGYAZALEA ❤️❤️❤️ made chu this https://t.co/kiaRmeGZhb I’ve  made songs over the most EDM beats, trap shit, indie rock samples, pop etc. I’ve shown versatility. \nIMD is about shifting back to creating for myself rather than trying to accommodate “something for everyone” \nIf it’s not for you that’s okay, it’s for me! 👀🤷‍♀️💜 To answer your question yes, CDG is in my list of top songs from IMD. You either hate it or love it. It’s ones of those ones... Everyone’s order of favorites off this album is drastically different &amp; I love that. RT @Sam_My_Jam: Iggy's Comme des Garçons has been in my head for a while now😭 RT @KamilAzalea: @IGGYAZALEA I'VE GOT 7 MORE COPIES OF #INMYDEFENSE !!! GUYS YOU NEED TO CHECK THAT! https://t.co/d8BURXcx2V RT @KevinWelchhh: 🚨🚨🚨 WHEWWWW HEY EVERYONE CHECK YOUR DOWNLOAD LINK FROM THE MERCH BUNDLES THEY REFRESHED IT WITH OUR MISSING DOWNLOADS. SP… @bishdafak @IGGYSDICK I released kream 6 weeks before. The reason why is because single streams don’t count toward debut for the album, and I didn’t want to split my stream count in week 1 RT @panja47: .@IGGYAZALEA getting that promo on William Street, Darlinghurst! I need one of these posters. 👌🏼😍 #InMyDefense #FckItUp https:… @bishdafak @IGGYSDICK It isn’t listed on iTunes as a single yet and won’t be until next week. RT @IggySite: „Fuck It Up“ musicvideo by @IGGYAZALEA ft. @kashdoll is at #2 on iTunes USA! 🇺🇸 https://t.co/OUb9su2HfS RT @iHeartRadio: What's your favorite song off of @IGGYAZALEA's new album? #InMyDefense https://t.co/WwzxYzPRDx RT @EMPIRE: New York, @IGGYAZALEA has an exclusive #InMyDefense Pop Up Shop available tomorrow and Thursday in SoHo.  ✨⚰️ https://t.co/kAfK… RT @EMPIRE: Sneak peak of the LA pop up from this weekend 🍒 https://t.co/1iTGFWXHvL RT @mateusforte: Fuck It up sis 🍒 @IGGYAZALEA @kashdoll #inmydefense #fuckitup https://t.co/5kXCfioP5D RT @ohHaiMiggs: @IGGYAZALEA FUCK IT UP SIS! \n#InMyDefense #FuckItUp #IggyAzalea @kashdoll \nIG: #MCHDigitalArt 🍒🍒🍒 https://t.co/ZX3LAcjlXS RT @marathonrod_: IGGY BACK WITH THE FIRE 😍👀🔥 https://t.co/H4KqMRgKuM RT @jayelavar: Headed to work repping @IGGYAZALEA https://t.co/aYqaFChEjm Ateeeeeeee! ⚠️ https://t.co/xlE7n9GoG5 Fuck it up video is out! Have a Romy &amp; Michele day! \n\nhttps://t.co/VBRGDWDWLE https://t.co/oyyKHnD7zg @azaleatys_ @Imtovenn It’s snap backs \nIe. A cap Fuck it up 🍒\n\nhttps://t.co/3WmOOGyx8G Yes! That’s what I meant, sorry I dunno the terms. 😂🤷‍♀️ https://t.co/SRdmdDkgGy RT @IggySite: Everyone, please watch the „Fuck It Up“ video by @IGGYAZALEA &amp; @kashdoll now!\nHERE: https://t.co/6UKP8ArZnm https://t.co/40y2… RT @ohgodlygrande: DON’T FORGET TO STREAM AND WATCH THE MV FOR FUCK IT UP!!!! DO IT HOES #InMyDefense @IGGYAZALEA https://t.co/1nmCyz3pJX RT @Nan_Albertiny0: Iggy Azalea - F*ck It Up (Official Music Video) ft. Kash Doll https://t.co/VpBLvo7Yh6 via @YouTube #FuckItUpStreamingPa… RT @AZALLION: @IGGYAZALEA i wish we knew it sooner 😩 but let’s trend it now it’s your best video and deserves so much more RT @pinche_humberto: STOP WHAT YOU’RE DOING AND GO WATCH IGGY’S NEW MUSIC VIDEO #FUCKITUP https://t.co/IksHsim2Tj. @IGGYAZALEA Can we please trend the fuck it up video today?! I didn’t know having fuck in the title made YouTube essentially hide your video &amp; not allow it to be part of trending lists etc. I fixed it now tho 😫🙁 Haha they not sleeping! it sold out a week ago silky 😂😂👀👀🧡🧡 https://t.co/yx7x3XTYag RT @Power106LA: ICYMI: #IggyAzalea drops #InMyDefense featuring Lil Yachty, Kash Doll, Juicy J &amp; more‼️🔥➡️ [LISTEN]:(link: https://t.co/Bqu… RT @pandoramusic: .@IGGYAZALEA’s long-awaited second album has arrived. ‘In My Defense’ features collaborations with @therealjuicyj, @kashd… RT @TaneshaDior: I don’t even have to say shit right here and I shitted on 'em @IGGYAZALEA RT @sweettt_peaa12: I literally have Started on replay since yesterday 😅👏🏼👏🏼 summer anthem forsure ! \n@IGGYAZALEA RT @hiip0w3r: @IGGYAZALEA had no right to snap with in my defence like that I am SHOOK https://t.co/0rjpkif4j4 Actual footage of me last night at the club https://t.co/uf6WTdPfTG Most likely in the next 48hrs 😊 https://t.co/5o2rbLdBk9 RT @badIydrawnbible: iggy azalea is biblegirl have you ever seen them together I don’t think so RT @RavishingBrown: Yoooo @IGGYAZALEA , your new album 🔥🔥🔥 I’m proud of you . I’m so obsessed with the lighting &amp; video I’m my new show. 🤤 https://t.co/27DGlrLKsj RT @RubenAMyers: I got time today, I’m finna clap back👏🏼.  @IGGYAZALEA https://t.co/7aWQjzu6qL You’re the best!!!!! Love you guys https://t.co/BOXfPfKXTL https://t.co/pAm6GdrTRr Hello, It’s me @biblegirl666 RT @monicaweirdo: @IGGYAZALEA thank you so much for letting me to finally meet you! you’re so sweet! hope I get to see you again! ❤️ https:… RT @thelilyisabella: Just two girls being twins 💁🏼‍♀️💁🏼‍♀️ @IGGYAZALEA https://t.co/7fghwUXAcn Yes! LA pop up was so much fun don’t forget it’s open tomorrow to shop &amp; take cute pictures in too! https://t.co/Q9tXzogLu6 RT @kashdoll: Fuck it up sis!!!! RT @sweetmusicwoman: I can't get enough of this song and video by @IGGYAZALEA ft @kashdoll \nhttps://t.co/bp96iihAPB RT @LovatoMJ: This is the kind of coffin I want to be buried in @IGGYAZALEA loved the pop up! https://t.co/IHKqheEgPn Probably the day or two before cause we don’t know our sound check time schedule yet ! https://t.co/MbECtd7xnl So cute! 🧡💜 https://t.co/6MPhvWRuz1 RT @idolator: .@IGGYAZALEA's \"Fuck It Up\" is another example of how visually spectacular her 'In My Defense' era has been: https://t.co/580… RT @thelilyisabella: Little sally walker walking down the street.... @IGGYAZALEA #InMyDefense https://t.co/5MfPS7VnDM Come shop, and take a cute pic! \nLA today &amp; tomorrow 12/8pm\nNYC shop is 23 &amp; 24th https://t.co/5QOg40zJ5x RT @uhlissuh: @IGGYAZALEA alright i’m officially an Iggy stan you fuckin snapped #InMyDefense 🤪🤷🏽‍♀️ RT @JoniqueSpence: Keep on winning. Still one of the best🌻 @IGGYAZALEA Yes!!!!!! https://t.co/Cuzu41dD8J RT @garyfurtadojr: @IGGYAZALEA snatched me with this new album. fuck it up sis I loved watching this because it breaks down all our refrain the video perfectly ! https://t.co/fXshKpwNj5 RT @Deirdre_Devlin: I don't care what people say about @IGGYAZALEA her new album so far is fucking fire. I've been loving Started and Sally… RT @amazonmusic: .@IGGYAZALEA highly-anticipated sophomore album #InMyDefense has arrived, the first album from her independent record labe… RT @taylorsantiagoo: @IGGYAZALEA Also need me a friendship like this the cutest pictures I got last night https://t.co/sFKksPHkqT Who’s coming to the NYC show ?! https://t.co/RfnqfEJMyU RT @KellenMcGee: Had such a blast at the @IGGYAZALEA Fonda Theater Album release concert last night. She truly knows how to put on a great… LA was so much fun last night! https://t.co/7XXp51NKVI RT @Matt_Tsolo: This Album just made me realize How much I still love @IGGYAZALEA!! 😭😭😭 #InMyDefense RT @VISUALS_AF: New @IGGYAZALEA sound good af!!!!! RT @TheCruzShow: Celebrating @IGGYAZALEA’s album release at her show in Los Angeles! #InMyDefense https://t.co/7PXFNDrIeF RT @idolator: .@iggyazalea, @kashdoll &amp; @NikitaDragun turn a high school reunion into a twerk-athon in the \"Fuck It Up\" video: https://t.co… See you soon ! https://t.co/FN5ft12eIL RT @hustlemarsalis_: HELLO! I don’t know if y’all heard me yesterday but bitch this is it! #InMyDefense ⁦@IGGYAZALEA⁩  https://t.co/fMoGEBS… RT @StaceyAFregoso: @IGGYAZALEA snapped and popped the fuck off In my defense is still #6 on iTunes and I could not be happier Exactly https://t.co/B0UUj6Cyv3 Y’all figured what Candy cane lane is yet 👀 😂 https://t.co/W594JfFcoU Nah I’ve just always been worried karma will give me a bad ass kid as repayment for the whole 16-in-the-middle-of-Miami thing I made my mother suffer through. https://t.co/PdrMt7oWhh RT @BRUJERlABABY: girl better be careful with the second one bc genies are tricky mfs and would literally make your kids so light a breeze… RT @itswilIiam: @IGGYAZALEA never run out of good ideas speaks levels to me, having a creative mind is one of my favourite things that i'd… 1. Never let negativity consume me. \n2. My future kids are a breeze to raise. \n3. Never run out of good ideas. https://t.co/WrtInNH4wH Lmao it was a wisdom tooth I’m good 😂👌 https://t.co/RoDDYOX6sv Is it okay to leave the dentist and feel happy you only needed one thing fixed; if the fix in question involves you having to give up a tooth? \nCause. \nHi! RT @neiduhhhh: this new iggy album makes me feel like a bad bitch who’s gonna rob rich men Lmao. \nI need more cash &amp; a larger circle. \nDon’t worry guys I’m working out the kinks! https://t.co/zmaaKKSALH I realize that is the most bizarre food combo ever. It was NOT by choice but for survival. Just realized all I ate today was a  Croissant, hummus &amp; some Doritos. I’m starved. RT @MikeThrone_: *lets go to the reunion &amp; FUCK SHIT UP* 💕💕🔥🔥 https://t.co/rOo94GlXRP Brazil I’m going to visit you again this year! \nCan’t tell you details yet but, \nI’m very excited knowing I’ll be back soon 😄 One business women special coming right up! @kashdoll \n\nWho watched our video already ? \n\nhttps://t.co/3WmOOGyx8G RT @kaypeaux: Me leaving @IGGYAZALEA show tonight https://t.co/tRpxNmqdPW RT @IggyThislil: @FKApadme @IrishAzalean @IGGYAZALEA #InMyDefense  Is Out Now: \n\n🚨YouTube: https://t.co/JJ45EpTbzw\n\n🚨Apple Music: https://t… OMG be safe! \nI’m making that pit WAY bigger in NYC by the way! https://t.co/t2WEV9Yk2m RT @GarryCohen: I really happy seeing all the love towards @IGGYAZALEA’s new album! She deserves all the recognition! She’s worked SOOOOO D… RT @Lopeakanmu: “Getting money feel way better than bustin a nut. “ - @IGGYAZALEA #fuckitupsis Lmao 😂😂😂 \nBUT did you die? https://t.co/dpwJA4uFji RT @vanjiehoe: LITTLE SALLY WALKER https://t.co/kLErTveRza RT @brendiz: Yooo @IGGYAZALEA that twerk pit almost crushed me to death 💀💀💀 the show was so lit tho, worth it!!! 🔥 https://t.co/e8QadCMXfu RT @queenkimeow: I really thought I was going to die at Iggy’s show tonight. I was like “wow ok this is how it ends. Death by suffocation f… RT @feedthewolvez: SHE KNOWS https://t.co/0NSGbsNCvA RT @AdanPartida: UNREAL. #InMyDefense https://t.co/PuxB8MfzZW Yes! I love you @zachdcampbell iam cackling 😂 https://t.co/JivumQKIQp RT @pabllovittar: @IGGYAZALEA to aqui dando stream no teu álbum mulier ✨ IN MY DEFENSE 👏🏼👏🏼👏🏼👏🏼 RT @pabllovittar: IN MY DEFENSE 🖤 https://t.co/fawYhy160r RT @IrishAzalean: 🚨 #FUCKITUP - OUT NOW!! 🚨\n\n#INMYDEFENSE @IGGYAZALEA https://t.co/heTDEiRyhL ⚠️⚠️⚠️ https://t.co/8TlPfLhpGj RT @ETCanada: Watch @IGGYAZALEA's new music video for \"F**k It Up\" https://t.co/l3fyBy05A0 Wow! 🥰 https://t.co/UNYqM23HW1 So cute!!! https://t.co/UirPIQm4QB My @youtubemusic billboard in Times Square today 😱 \nThankyou! Making boss indie moves 😱👀 https://t.co/cpdZWtFaZA Excuse me, but who gave you the right?!?! Iam dying! 😫😫😫 https://t.co/r64bM3OTys RT @kordeiskream: i never said anything bad about spotify spotify is my friend https://t.co/VktpfJIUHF Did you see my billboard?! 😬 \nThankyou @Spotify - \nMake sure you stream my new album - \nhttps://t.co/OZZpfA7qEn https://t.co/CJO2QipOPc RT @TokyoJihen2: @IGGYAZALEA 💗🧚🏼‍♀️ https://t.co/gLRt0n6ehr RT @mthskp: me whenever @IGGYAZALEA comme des garcons start playing https://t.co/l6K0hwszhu RT @cala_marda: spotted at Mexico City! @IGGYAZALEA https://t.co/jbFsgaKUPr RT @Spotify: The defense rests its case 👩‍⚖️\n@IGGYAZALEA sets the record straight with #InMyDefense https://t.co/uXUcOIFESD https://t.co/L2… Ain’t no accident babe. Would you vote for another man if you were running for president? \n🤷‍♀️🤨 https://t.co/HDcElHwimE Go listen! https://t.co/dspV1QZhEu RT @geeVONshee: @IGGYAZALEA &amp; @kashdoll really did what they had to on Fvck It Up RT @youtubemusic: .@IGGYAZALEA is finally back with her first album in five years. #InMyDefense is here → https://t.co/nnJ9oi2qA3 https://t… RT @SkrtOnKen: omg the video is out! \nhttps://t.co/OeXWTCh9Eg RT @Shazam: Everyone needs to listen to @IGGYAZALEA's new album right now!!! Stream #InMyDefense on @AppleMusic ---&gt; https://t.co/G2bZQyvMG… My video is out! RT @huntyrleonard: @IGGYAZALEA i woke up 2 hours early so i could stream in my defense before work 🤷🏼‍♂️ i have no regrets Yayyyyyy https://t.co/iUByKfaBGw RT @theguyswiftie13: Maybe @IGGYAZALEA fucking snapped 🔥🔥  #InMyDefense out now!!  GO STREAM!! #iggyisback RT @itsyaboyjdubz: @IGGYAZALEA Album is hard! IGGY is back!!! PSA: tweeting you don’t care. \n\nLet’s us all know... \n\nyou can’t control your emotions on the subject and therefore, \nCARE. \n\n🤷‍♀️😬 RT @Baybii_T: Holy fuck @IGGYAZALEA - you went off with this album!! ❤️❤️\n\nBe proud of what you have created cause this is fire!\n\n#NowTourNZ RT @xmoxxo: My spanish ass trying to understand the lyrics of #InMyDefense @IGGYAZALEA https://t.co/vBHSs0iTGa RT @samantharioscx: @IGGYAZALEA WENT OFF 🥵🥵 RT @suzisigne: @IGGYAZALEA new album is so dope and beautiful🤤Totally worth the wait!\nShoes they got hearts on,That’s Commes Des Garçons 🖤💛 RT @realtezzyjayy: When I Say @IGGYAZALEA Talked Her Shit On This Album She Did Just That #InMyDefense RT @cockdestroyuh: @IGGYAZALEA comme des garçons a la oui oui bitch you killed that shit https://t.co/sr3NB2wHFZ RT @HeartsAshlynn: Iggy’s new album a full ass bop. Like what the fuck. I’ve been looking forward to this album for a while now. @IGGYAZALE… If you are supporting me: \nThankyou!\nI’m so beyond extremely happy with this! Totally worth it! https://t.co/VwOnKnGwmJ RT @dopadrenaline: Name stay in bitches mouths like they got a toothache\" 🔥🔥 #InMyDefense @IGGYAZALEA https://t.co/nX05zGm9YQ For sure, I’m just getting warmed up. https://t.co/aTLIsxn0zZ RT @tigerqueenlove: @IGGYAZALEA loving the album❤️❤️ #InMyDefense You’ve come a long way n it’s really inspiring to watch, work hard for ur… RT @truthcloak1: Whewww the growth !!! see this is what happens when you let an artist have complete creative control over their own career… If you were thinking of dressing up and heading out to my show: \nDo it! \nThis is a safe space. you can come as your spirit animal 🤪 RT @illYovani: @IGGYAZALEA like I said before 💯 I’m proud of IGGY ✊🏼 she went through every obstacle &amp; came on top 🙌🏼  if that ain’t motiva… RT @_jackleighton: Thanks I Get is my new anthem \n@IGGYAZALEA #InMyDefense Would now be a good time to show you how cute the VIP merch bags are!!! https://t.co/l2mxQUTNUa https://t.co/slCgu9bW66 RT @Chrissx_x: Not gonna lie @IGGYAZALEA’s new album #InMyDefense was the first album I bought this year. #noregrets every song is a banger. RT @truthcloak1: @IGGYAZALEA I hope you &amp; @kashdoll did some viral shit that everyone will be talking about I already know y’all did what y… Yes, so please don’t forget to! https://t.co/OCcbtOYs6W RT @BobbyDenimSweet: Listening to @IGGYAZALEA album and I’m lit as fuck! RT @its_sammy_o: Honestly cant believe @IGGYAZALEA Didn't win Wimbledon.\nBecause #InMyDefense IS A SERVE RT @brandonvirtue: @IGGYAZALEA the album was worth the wait! #InMyDefense is a flawless album that demonstrates hardwork, commitment, and a… RT @Trapdollazmanny: @IGGYAZALEA i love you. I’m so proud you didn’t stop. The production is crazy. Lyrics are crazy... i’m obsessed 😭 #InM… RT @cavadajx: @IGGYAZALEA really just blessed my summer 2019 with this new album #InMyDefense 🥵 I love it; I love how our verses are totally dif flows etc. \nWait till y’all see the music video. \nKash is so underrated. \nYou’ll see. https://t.co/70Ag6pw6LI RT @Switchlikefags: @IGGYAZALEA just wanna say you snapped on that project. RT @wityagirlfriend: @IGGYAZALEA baby this shit slap so hard it’s 8am and u got me feelin like i’m goin out somewhere😭 https://t.co/EMWwvQs… RT @JFCSx: @IGGYAZALEA QUEEN!!!! You did it better than ever!! This album stands for believing in yourself and that hard work pays off!!! I… RT @xoxoantek: @callieazalean @peppapig @IGGYAZALEA stream bing bong zoo too!!! A big big vibe ! https://t.co/8j9khSEDG8 Ayeeee I’m crowd surfing into the twerkpit. Jesus give me safe passage. https://t.co/QGRUD5QOlY Why is this my favorite bar too tho. 😂👌 https://t.co/AyZOQGxLLe RT @MariBMe: For a bunch of people who don’t give a shit about Iggy’s new album #InMyDefense y’all sure firing off a lot of tweets... https… RT @kbosss__: ‘Spend It’ @IGGYAZALEA you 🏂 all over that beat!!! 🥵🙌🏾 #InMyDenfense RT @LegendAmari: I’m on track 9 and haven’t skipped yet. @IGGYAZALEA had a point to prove. She lettin the hoes know! RT @lilyachty: Everybody come together and listen to my verse on this. https://t.co/3ZMNekvM0l 😫 I kept the show super high energy - no slow songs but! \nPlease come to the pit in the middle of the GA! We gotta dance! https://t.co/jTdeF5PGve 🤪 https://t.co/6LeLHI6fYf RT @xoxoluv4iggy: I buy shit in bulk like its Costco #InMyDefense https://t.co/FTutUDbIWM So I know FOTW tomorrow for sure but if you have to pick: \n\nSpend it \nHoemita \n\nFor YOU to dance to? 🤷‍♀️ RT @NickiNation2: @IGGYAZALEA Leaked footage of me watching it later 😌 https://t.co/rka01EWNzQ I don’t think it will be uploaded until 3/4am PST \nI’m gonna try and sleep in a little bit and it will probably go live then (🤷‍♀️😫) I’m tired y’all https://t.co/mrx7uNGlyT RT @TheBossUKNOWIis: Me listening to #InMyDefense @IGGYAZALEA https://t.co/36JGRcf6pZ New wallpaper! https://t.co/3ws9zyhdTi Yay! Please make sure you redeem your downloads guys! https://t.co/C8FjGGXfzq RT @shuavomit: CLASS OF ‘69 💒\n@IGGYAZALEA #INMYDEFENSE https://t.co/AjD9VNnZIM RT @iamderikas: Idc idc idc.  @IGGYAZALEA album slaps 🤷🏽‍♂️ RT @shan_IGGY_xo: @IGGYAZALEA #inmydefense \nHe hit me up, he said he having flashbacks\nYou're my ex for a reason, I don't backtrack\nGimme 5… RT @iCrazyJa: @IGGYAZALEA album FULL of bops and independent. you did not come to PLAY RT @Gmentality_: @IGGYAZALEA bitch i am SO PROUD OF YEW RT @laurenlovesyou3: Okay but @IGGYAZALEA  went straight 🔥🔥🔥 on her album #InMyDefence always been a fan of her always 😩❤️ RT @KamilAzalea: I’m gettin’ money, fuck the fame RT @TIDAL: Dropped: @IGGYAZALEA. 'In My Defense.' https://t.co/N61qrYdB5q. https://t.co/Ain34jykxC RT @liftedshadow: i could make the dealer bust, and i could give a fuck who aint feeling us RT @EveringAmber: @IGGYAZALEA I’m literally so proud of you iggy 💓 #InMyDefense SLAPS and it’s all you sis. This was all you!!! RT @T_Alexander41: @IGGYAZALEA IGG!! Your flow. These beats. Your lyricism. You did this your way and it shows. We are stanning a QUEEN #In… RT @witnesssmatt: @IGGYAZALEA literally so emotional today lmao we’re so proud of you honestly, #InMyDefense SERVES i love you My album is out 😫👀 \n\nI fought really fucking hard to make this! \nand I did it exactly how I wanted to *sings* \nI did it myyyyyy waaaaayyyyyy\n\nI’m so happy I never gave up, thanks for supporting me.\nI love you!  😭 \n\nhttps://t.co/BNZmZXbgMW RT @natureboyty: @IGGYAZALEA Bitch you did what had to be done!!!! #InMyDenfense https://t.co/ZEjbeo2keh RT @DeMiXamor: @IGGYAZALEA did not play at allllllllll , I’ve yet to skip a song....I’m currently on Big Bag 🤑 RT @chrissgrandee: @IGGYAZALEA I love in my defense arttttt RT @duetoronomy: \"I started to say sorry but fuck that shit\" -Iggy \nI like Thanks I Get, Comme Des Garcons, and Sally Walker alot.\nAlready… RT @rebellehomme: @IGGYAZALEA Hi, queen! 👋🏽 Congrats on the album release! Listening to it now 💕 RT @__nathen: I’m not even a minute into this album yet and it already KNOCKS......her SERVE #InMyDefense @IGGYAZALEA https://t.co/bg0XeZfE… RT @tearsbrie: arguing with myself which is my favorite but your album is so wonderful that i cant choose just one! YOU KILLED! @IGGYAZALEA… RT @savageewilly: Idc but @IGGYAZALEA got more flow and bars than most females out rn RT @IGGYLIFE: 🇧🇷 Brazil iTunes: \n\n1. #InMyDefense —  @IGGYAZALEA (+7) [New Peak] \n\ncongrats queen, Brazil loves u IGGY. https://t.co/nAkzm1… RT @ChihuahuaLopez: @IGGYAZALEA now i know what to have on replay ALL DAY tomorrow 🤩👌🏼💓 #InMyDenfense #Iggy https://t.co/8xukao2aj2 RT @HuxLu: I’m so proud of @IGGYAZALEA. She got so much hate for no reason, but she never gave up. Make sure to buy and stream #InMyDefense RT @IggyThislil: #InMyDefense Is Out Now: \n\n🚨YouTube: https://t.co/JJ45EpTbzw\n\n🚨Apple Music: https://t.co/gKnK5z9kSj\n\n🚨TIDAL: https://t.co/… hello I’m online! Hi I’m here I was at rehearsals ! \n(I still am) but my album is out! \nWoooo! RT @darellxanthony: ⁦@IGGYAZALEA⁩ I’m dead ass about to hit the road for 12.5 hours to see you tomorrow 🔥 if I don’t have every verse down… RT @LUXMUSICX: Someone come w me to see @IGGYAZALEA tomorrow bitch I’m going alone 4 hours to go! https://t.co/ZlxoaLez6i RT @huntergrandee: can’t believe i’m seeing @IGGYAZALEA ALONE ... someone come pls RT @AZALLION: when iggy azalea said she doesn’t have friends so she’s on twitter all day i felt that https://t.co/5dW1h6PXCJ RT @cvalfrido: #InMyDefense #EmMinhaDefesa IGGYYYYY PODE VIM CARALHO QUE EU TÔ SEDENTOOOOO #InMyDefense Fuck it up video drops in 11hours! \n👀 https://t.co/5GFlx3if9a RT @AlexFidgeon: @IGGYAZALEA I loveeeee it https://t.co/yi7bzdNsNU RT @emilyursulaking: @IGGYAZALEA We love a bloody forehead https://t.co/xQC5r5BKL3 RT @AndrewArianator: @IGGYAZALEA ooo wig https://t.co/ZGeCnRc5qU Snapchat filter can be unlocked here: \n\nhttps://t.co/pv9iZDXO5x Looks like some people are seeing my billboard magazine ad 🙂 https://t.co/0TqsLJjsb1 They still sleep but it’s cool tho 😂😫🤷‍♀️ https://t.co/yN5wRsf1N7 🌎🥺 https://t.co/1DHcUepPZ3 RT @fusetv: We hope @IGGYAZALEA &amp; @kashdoll are having a wonderful night! https://t.co/wDKwpdF9Pi RT @allyfrazxo: @IGGYAZALEA imma start squatting to prepare myself 12 hours left 😭 https://t.co/W9eXhxoWP6 RT @TimothyTristan: @IGGYAZALEA always brings it but I’m hyped to support her indie journey. The work &amp; time she’s invested is REAL 👑 @KayKayBeCoolin Thailand is amazing RT @TheNinoDaniel: I’m really about to clock of work Friday...and drive around my whole city listening to IMD. I did the same with TNC. @IG… Yes! No one can ever take away my determination 🤷‍♀️ https://t.co/436jxyyQdp Yes &amp; I just want to say now, \nI don’t give a fuck if only 42 ppl buy it. All 42 of y’all getting another album next year. I’m not stoppingggg https://t.co/T3bQQQmFDr RT @wtfkeekz: Started x @IGGYAZALEA on the radio , we lit lit 🤪 https://t.co/1DqYh3FYyE ⚠️🤪🍒 https://t.co/0cMdgco6Kx You can, it’s on iTunes, Apple Music, Spotify etc etc on Friday. https://t.co/VI68GLbnD7 RT @kissmebadkarma: @IGGYAZALEA really out here doing the most with her promo and serving looks as an INDEPENDENT ARTIST. I feel like we sh… Put on a happy face 🙂 https://t.co/G5GfH6Sqhk RT @heartedkaty: well, it’s pre ordered @IGGYAZALEA https://t.co/tjBN3MeYZX RT @alesshar: @IGGYAZALEA I ORDERED THIS HAT AND I’M SO HAPPY omg 😍😍😍😍😭😭😭😭🥺🥺🥺🥺 #InMyDefense https://t.co/AELNuq91AD RT @FODASEOTARIA: My babies are ordered #InMyDefense ,💞😍🍒🙆🏽‍♀️ @IGGYAZALEA https://t.co/kdvbJ3HTNg RT @BogdanIonut130: @IGGYAZALEA Omg just in time https://t.co/pxnjf7HSFM RT @lilibabicz: @IGGYAZALEA Just in time! Aaah https://t.co/5RowbjuPnh RT @bautistaaraya_: @IGGYAZALEA we're getting In My Defense to N°1 or what? https://t.co/XHjGoTT61M RT @ElerinTeemant: @IGGYAZALEA  Just ordered CD,can't wait for it. So proud of you!❤ https://t.co/mecPuphiyr I’m sure you can, just email customer service 💕🧡 https://t.co/qhDjyzaJjM @cakesonmiley Nope RT @KodaDinah97: @IGGYAZALEA just ordered the vinyl 🥰 I can’t fucking wait holy shit https://t.co/U6dMOJRvvK 25mins left of \nFREE \nWORLDWIDE \nSHIPPING \n\non my webstore! \n\nhttps://t.co/ahHwXxmxGE https://t.co/fApe0He4WM Give me a sec I’m trying to re stock it https://t.co/PHc6u7GVWW 💗🧡 https://t.co/2JC6dFhmGC RT @darellxanthony: yoooooooo s/o to @TIDAL for tickets to #TIDALXIGGYAZALEA @IGGYAZALEA! Looks like I’m going to LA this weekend. Road tri… RT @ValHackett5H: Hey Iggy, I just utilized that down payment plan and got me a poster, a journal and a tote bag!! And I pre-ordered on iTu… RT @lovelykeara: I remember seeing @IGGYAZALEA live in philly for #thenewclassictour &amp; honestly I am so excited to hear this new album &amp; wi… Ugh! First thing I’m gonna do Friday is get myself a started hoodie! I’ve been waiting too! https://t.co/hEBfFs7puG The day of release https://t.co/I0NqH0fzMV This count down is giving me anxiety https://t.co/gRZaYFiHeQ RT @adaptatixon: @IGGYAZALEA can you please adopt me. I’m tired of living with these people. It was me, raccoon is my spirit animal &amp; I will reincarnate as one. https://t.co/TgWZwU6ofr RT @jeroen_houpe: @IGGYAZALEA So I can say that we are friends 😗 Lmao NO! not my fans! \nWe are legit friends. 🤷‍♀️ \nI’m talking about the random locals who enter the chat when you never sent out an invite. 😂 https://t.co/TGq2w7u535 RT @idolator: We'll be counting the days, hours, minutes and seconds until we can listen to @IGGYAZALEA's 'In My Defense' and watch the vid… 🤷‍♀️ Okay what the hell 🤪 https://t.co/3LKkS4CG6a Imagine thinking random people you’ve never met are tweeting you subliminal messages online in an attempt to befriend you. https://t.co/1LkbBuo1PN RT @ChoyRex: @IGGYAZALEA So zen RT @loisgriffinstan: @IGGYAZALEA you realizing it was the shitter and not nature https://t.co/1fV46iBYwd Chilled on the sofa in my hotel room last night, eyes closed, soaking in all the crickets and peaceful summer-night sounds... \nonly to realize later it was the toilet malfunctioning and continuously filling itself with water. RT @IGGYAZALEA: Here’s the info for the fan events we are doing! \nCome out, meet other people who have the same great taste in music as you… RT @NikitaDragun: until i get a lung, rib, or internal organs removed i need my waist to look like urs 😭 ur literally what i facetune mysel… I think you will get updated on times etc. for that tomorrow via. email. 💕 https://t.co/knMsnBrSYi Doors are 7.30pm \nI believe Vanjie is on at 8.15 https://t.co/TunH81jRXs VIP is sold out! \n\nBut come early to the pop up store on the 20th to make sure you’re one of the first ones there! \n\nI’m taking pics/signing things for the first 50 in (+ as many of you after that as I can, but I have a flight to catch!) https://t.co/HYARhuZfTy Hey! \n\nSo new sale on my web store for all my overseas fans... \n\nFREE INTERNATIONAL SHIPPING \nTOMORROW FOR 1HOUR ONLY! \n\n3pmEST - 4pmEST https://t.co/1c6gnqWP2G I hate to be negative but there are some women in this word I just want to violently shake and they mostly all wear red baseball caps. RT @ledwinwtfl: @IGGYAZALEA THATS WHAT I DO TOO https://t.co/u0XsxK4PI3 Well, Thankyou. 💜\nyou doing this actually makes up the majority of how people hear my music. \nit does count and help. https://t.co/YjxeXOSzxH so 73% of my streams come from Listeners own playlist or directly played from my page! \n\nOnly 10% come from curated  playlists. That’s crazzyyyy 🤯\n\nWhat does that mean? \nbasically; I owe my fans everything. \n\nThankyou for going so hard for me &amp; supporting me. 🧡🧡💗 Here’s the info for the fan events we are doing! \nCome out, meet other people who have the same great taste in music as you 😉\nAnd maybe even win some free Merch while you’re there! https://t.co/Erv6PS0fDZ https://t.co/imHtjoP3ZU https://t.co/mthJVT3dKi Exactly so if you’re going to the show in LA Friday you have 24hrs to learn \nFreak of the week \nHoemita \nClapback \nThanks I get \nFuck it up \nBig bag https://t.co/m1Nao5d0u2 Midnight EST 😱 https://t.co/Ifi35I1hid Don’t forget it’s july 19 EST ⚠️ \nSo July 20 for NZ and AUS 🧡 https://t.co/GNyu7JkUIg Only 48hrs until my album is out. \nI feel sick I’m scared. https://t.co/oZ0Y7hT5Q5 I don’t like you either what’s not clicking https://t.co/sjihFgpa6L Collab with me now or you’ll end up a breakfast special peppa. https://t.co/WGTKhMknHb I don’t know if I’ll be there in NYC yet, if iam able to be there I’ll def tweet about that etc. https://t.co/DWdH3ePGYd NYC merch pop up! https://t.co/KTqGdQ9mXC Ma’am you’re literally flawless. \nPlease send back Facetune version I dead ass need to know what you’d even change 🤣 https://t.co/JMmMbPwtC4 RT @TrevorCrystai: @IGGYAZALEA girl, you have no idea how hyped I am for In My Defense. This shit is gonna slap and I ain't even heard it y… RT @pinche_humberto: @IGGYAZALEA can’t wait for the new merch to ship https://t.co/DoiYb0PdgW It’s over for me now. https://t.co/pWfsAgUbUz @JrTheBarberr It’s already sold out but go off RT @tanamongeau: this is so iconic https://t.co/uIm3OgQ9E8 RT @woahItsjesss: @IGGYAZALEA is everything and MORE! Her songs  can literally get you outta that stupid depression shit your in! Sure as h… RT @Ms_Ratio: @IGGYAZALEA Ppl really don't know ur fanbase 😂😂😂 Not the kind you’re thinking of... https://t.co/z8uE2UvMLf I wish my pets could tell me what they have dreams about. RT @leonlavq: we streaming 🤣🤣🤣 https://t.co/h3ZBztzN3y Thankyou I really do appreciate it. https://t.co/Pwsjm2fR0D RT @_alexwest: We irritating 🤣🤣🤣 https://t.co/b5G9UjdrN3 RT @TopherJGen: 100% can tell IMD is going to slap so hard I’ll get a bruise @IGGYAZALEA I love how you think giving me $50.00 per person is bucking the system. https://t.co/cAAOPPcqhI https://t.co/rXSHhJ6snN 🥺 soon I hope!!!! \nSan Francisco on Aug 2 tho https://t.co/aMasJUC4o0 I have 1 left! https://t.co/RFyiheZvwn Don’t curse me! https://t.co/6WbjUnD8wk Well. Not everyone has one of those. https://t.co/rvqJzmcood RT @PrynceAukeem: I’m anxiously waiting for @IGGYAZALEA and @kashdoll video to drop 🤞🏾💯 Hmmmm I’m doing okay! \nI thought I’d get a filling - \nI wasn’t prepared 😫 https://t.co/fsYWlmfFfd Yes I feel weird https://t.co/Uc5GYoRX5Q You guys are outta control! 😂\n\nWe’ll see if you use the space for real or not come Friday night. \nUntil then 🤫 \n\nNext subject! RT @witnesssmatt: @IGGYAZALEA go with it https://t.co/m4HMkPdW9R Lmao 🤷‍♀️ \nIt’s just a dance floor 😂 https://t.co/VVpVWyBjFW RT @jorgexocaba: When @IGGYAZALEA said her favorite color is “Money” I really felt that https://t.co/5PaNytlGwB Haha you really can do whatever you want! It’s just supposed to be a lil space to dance in for people instead of just getting pushed &amp; crushed for the whole show. https://t.co/KwY3ZDqJP1 RT @VitorGoto: @IGGYAZALEA all I actualy needed, a little bit of hapiness and fun *takes a bow* \nWhat can I say only a great business woman could sell you on rebranding the floor. https://t.co/cCSa9596VN RT @pandrade29: I’m about to take this shirt in it’s been in my closet for months now and I haven’t worn it I might wear it for @IGGYAZALEA… RT @zaddyvibez: @IGGYAZALEA Catch me in that mf like: https://t.co/IWlqwCNOHo Really you can dance in it however you want! It’s about having fun, going nuts, not worrying about how you look &amp; getting in the moment. https://t.co/tMJx8M2M4M RT @CamelCrushGals: Bout to go throw ass with the homies just like God intended https://t.co/9qYEhKFLEe Do The worm. https://t.co/RBxmpFA0iY RT @loveysweetykins: @IGGYAZALEA Holy shit I can’t wait to go on Friday! That part. 🤷‍♀️😂 https://t.co/vyZRCduw2K RT @babyphantastick: The fact that i told my friend I’d b flying into LA for @IGGYAZALEA concert this Friday, and my friend told me he woul… RT @bubblehyuck: You know I'm gonna shake the hell outta my ass for this 🥰 https://t.co/3hhChraxZI We don’t care how you feel, \nThe shows already sold out - \nYou can’t come anyway. \nNext! https://t.co/CUXBZxd1U2 Haha, nah it’s just for you guys to go wild in so the whole GA floor is fun no matter where you are: \nnot just the first few rows. https://t.co/7DOCcsJn32 RT @brunomcdores: @IGGYAZALEA Lets use 🍒 to support the new single RT @juju_faragher: where i belong 😭😭😭🍑🍑🍑 https://t.co/TlkIdviBul RT @haydencellis: fuck a moshpit, iggy might be on to something https://t.co/fRer4XtpYl RT @Rigo_Corona: #IDGAF what no one say but @IggyAzalea is #Dope give this girl her props. Yup ! https://t.co/4wnCRxb78X LA! I’m doing a two day pop up store July 20//21 and ALL the new merch will be in stock! \n\nGet there early on the 20th cause I’ll be popping up and signing the first 50 customers purchases plus taking pics ⚠️ https://t.co/vphhA3Xa1L RT @jennitransition: @IGGYAZALEA you coming back with that 🔥 fy fy #justwanna Well, iam. so... https://t.co/2zBJGN0b3D https://t.co/owFT8OALxH RT @Amineazal: BAD BITCH ANTHEM, GET YOUR MOTHERFUCKING HANDS UP!!! https://t.co/fYNQYj7KN3 Watch my video this Friday if you wanna see @NikitaDragun break dancing So you agree? \nYou think that you’re really pretty.... @NikitaDragun https://t.co/eZ0NXZrLW9 RT @Julioaayala94M: Someone go with me to see @IGGYAZALEA and @VanessaVanjie 🥺😭💕 RT @suprnaturalurie: @IGGYAZALEA sis if you bring this to a chicago show i’ll be there with a whole routine set👏🏻 It’s up to LA to abandon all their fears about looking foolish and just dance and enjoy it so we can do it at other shows. https://t.co/jdzlbAhBIa RT @readyplayeralex: We need to get Iggy another Top 10 album on the Billboard 200!\n\n@IGGYAZALEA #IggyAzalea #InMyDefense https://t.co/XCyG… RT @feedthewolvez: I got five days to learn this routine before the show. Wish me luck https://t.co/bvmNC0VOqi It’s for any and all dancing https://t.co/8YplM9R8Po RT @BogdanIonut130: @IGGYAZALEA I don't know what cult this is but I'm in RT @Erika_Price_: Why is @IGGYAZALEA literally everything 😍 RT @JaiyhanaB: @IGGYAZALEA Okay Gem gang iniss bitch.! https://t.co/Ttz1FZi6sM RT @bloodlinethief: @IGGYAZALEA People in the circle ⭕️ https://t.co/17RTcXawf1 RT @AndrewatFox: @IGGYAZALEA Bought tickets to Friday's Show at Henry Fonda! SO EXCITED!!!! RT @eddie_szn: @IGGYAZALEA This bout to be me up in there. https://t.co/Vr3SgAN48U So if you come to my show; \nYou’re gonna notice a giant yellow circle on the floor in the middle of GA that says “twerkpit”  \nWhen it’s about that time at the show y’all gotta clear off the circle ⭕️ unless you bout to show us something crazy. My tooth is out! Didn’t need all that just an injection. https://t.co/8DXUgOSdo3 RT @kashdoll: Anyway me and Iggy video dropping Friday @IGGYAZALEA https://t.co/R8jhzy2LHH Watch me &amp; Vogue @VogueParis \nhave a little fun! \nhttps://t.co/TgkMwes5OC I’m getting a wisdom tooth pulled out today! 🥴 Fuck it up video this Friday with @kashdoll 🍒😱 https://t.co/O9BgwP1iKJ Me; a Gemini. https://t.co/oQ822mgkqI Right, i just go way younger than I think. \nIf I think you’re 70 I’m saying 55. https://t.co/rQoEaaqaPn I get so stressed whenever anyone I’ve just met asks me: \n“How old do you think Iam?”\nCause I never know if you’re 40 or life’s just been unkind. This is so cuttttte https://t.co/1vYwtlAp2f RT @JTVARG1: @IGGYAZALEA fuck it up💥#InMyDefense #IggyAzalea #FuckItUp https://t.co/VfI9x1Mmrh RT @joeteabags: @IGGYAZALEA So #InMyDefense I missed my chance in the Started video and would love to meet you x https://t.co/DD3xCXOCrl The swifties are at it again. \nazaleans need to step up their troll level. https://t.co/UwhrDyaKB0 Good job, this is super cute!!! https://t.co/oc6eHg80oB RT @kaanthesavior: @IGGYAZALEA #BENIMSAVUNMAMDA   🇹🇷 RT @bloodlinethief: @IGGYAZALEA #InMyDefense OKURRR, LETS GET SICKENING, MISS, VAAANJIE 🏳️‍🌈 RT @IGGYIGGZ: @IGGYAZALEA #PourMaDéfense 🇧🇪 RT @juanjosevzla1: @IGGYAZALEA #EnMiDefensa 🇲🇽 #emminhadefesa RT @AvilaLeonett_: Waiting... https://t.co/QqyQlwhPNb @rafasbad_stan @IMDNewEra @iTunes I have asked about this so many times I may actually go insane I’m so hungry but I don’t have a taste for anything. Ughhhh This shirt is one of my favorite Merch shirts I made from \n“the new classic” era https://t.co/7US0zIl2mT Yes! https://t.co/poeAFSgeV7 Extra is great, get a jersey and a football, grab a friend and be in the chess team - give me year book realness. https://t.co/nS51WAkViW I’m gonna pick pictures tomorrow afternoon - you have 24hrs! I’m giving you guys a chance to be in my new music video!\n\nAll you have to do is tweet the hashtag: #InMyDefense \nAlong with the picture of yourself you wanna submit for my year book ⚠️ \n\nMake sure you like &amp; retweet any entries you think deserve to make it into the book 🧡 https://t.co/h1WwU5tSTO This is actually cute. 🧡 https://t.co/vdKAO7OfBI RT @Amineazal: Me listening to Just Wanna by @IGGYAZALEA https://t.co/5OSi9ThL93 RT @SirJauregui: @IGGYAZALEA Keep moisturizing 😂 I can’t with y’all. 😭 https://t.co/VPD12I6bEB Who are we kidding, I’m white. \nWe age like milk, this is me at 50. \n😂😭 https://t.co/ABpvrMKWyX Ayyyyyeeee have fun at the show \nALBUM DAY BABY \nWe in this bitch! https://t.co/lRhKgWk6T2 RT @feedthewolvez: If y’all see me with pillow cushion in my pants at the show, mind ya business. I need something to shake Well, it’s dropping the day of IMD which has the custom emoji for the hashtag, but if you’re looking to Accessorize then 🍒 https://t.co/xfr2LYyrnn Still on this video editing!  \n\nGetting it done! https://t.co/Bh3o7T7WaL RT @TheCruzShow: @IGGYAZALEA We gotta celebrate #InMyDefense release ❤️💯 https://t.co/pJJp0yvF9Z RT @KenFatale: I’m way too excited for Album Release show 👑👑👑😻😻😻😻 @IGGYAZALEA I’m listening to this shit all year https://t.co/Xqsp0wmae8 💚💛 https://t.co/H10N6FZR3b RT @murray_smitth: @IGGYAZALEA come back to australia bitch we NEED you at a festival !!!! RT @xxlilhoexx: @IGGYAZALEA i need to meet you one day in aus. i mean you used to live here (close ish to where i am) &amp; i seriously need to… RT @MonsterCharlie_: @IGGYAZALEA don’t listen to them, we miss you, come do a show in Sydney 🥺 RT @eduardoglage: @IGGYAZALEA https://t.co/Rc5ohGtMPX Maybe because I’ve lived in America for the last 13 years... \n🥴 https://t.co/z6G2zLmPXN RT @SaluteChevy: @IGGYAZALEA you’re a fucking genius RT @HausOfClairee: can @IGGYAZALEA come to the UK for some shows because I N E E D that! 😍 RT @cristianftriana: @IGGYAZALEA https://t.co/Kj7PWfmSqw RT @AlexisCortesi: @IGGYAZALEA Earth has spoken I am 29 years old\n\nMy 2nd album is out in 5 days \n\nIn my defense has 11 letters \n\n29+2+5+11= 47\n\n47 is the number for appreciation. \n\nAppreciate this pussy. \n\nCause I rapped about it 47 times on my albummmmm bittttttcchhhhhhhhhhhh\n\nhttps://t.co/POIoQmahie https://t.co/hr7Y2wlufK I’ll tell you more about all the cities and venues etc. tomorrow when my brain works. 😴 I hope you’ll come out and meet other fans etc. there, listen to some of the new music their and have fun making new friends! \nI’ve sent special merch etc to these places, I’m trying to make this release fun &amp; a memory for you guys even if i can’t physically be there with you. If you’re not able to come to my shows week of album release don’t worry, cause I’ve set up 18 ‘in my defense’ themed fan events in 18 cities across America! 🍒🧡 This is the content I signed up for https://t.co/qUdw0GOd7t Same! I’m still on the clock editing it now! https://t.co/E9CI4d8Tz2 RT @WilliamKogoi: @IGGYAZALEA Girl I need you to see my artwork 😄. https://t.co/qFZPDOQdY6 https://t.co/YMdISPpHHC Wow I really be feeling myself cause fuck it up is my best video Imao happy you all say you love and notice the quality 💪 https://t.co/NHc7vEAYGp RT @RyanBlackNow: @IGGYAZALEA I ain’t even gon front been stanning iggy since work!  Justice for team that was a smash! Gp slept on it RT @fuckinsmile32: @IGGYAZALEA LEZZGO (that payment plan is a LIFESAVER) https://t.co/2oYEPfjhV9 Pre order my album; it’s out in 6 days... \nso only 6 more panic attack’s for me until it’s out! 😭⚠️😱 \n\nhttps://t.co/POIoQmahie https://t.co/KE8JpMgoa2 Cute’ 💜🍒 https://t.co/NHc7vEAYGp So today me &amp; Kash doll made a video and literally every time we would drive around the block this man would run out with a shovel and tell us to stop making pornography. Skakaskska https://t.co/k3QNX8CPtM NYC show is SOLD OUT.\nAye aye ayyyyeeee RT @vxniiaa: @IGGYAZALEA she broke the cup😂😂😂 https://t.co/SC4LRU9eVe If anybody needs to make a call: \nI’vvvvve GOT A PHONE! https://t.co/almp77aTId After 2am I go full crack head mode. https://t.co/rFbtYk50lz I - https://t.co/zjmIQwZMEY https://t.co/7PA3lDYYjP RT @AlexBreiholz_: Haven’t cut myself shaving in years but I did tonight. Omg https://t.co/n7AjDQSCpz You will tonight unless you pre order 😈🤷‍♀️ https://t.co/TBK6BkeSda YOURE FREE. I break the curse ✨ https://t.co/G7ROaTRLbq DID YOU JUST THINK TO YOURSELF \n\n“Thank God I don’t shave!” \n\nI CURSE YOU WITH \nA CUTICLE TEAR!!! \n\nUnless.... \n\nhttps://t.co/oemdVu1RUx https://t.co/OJKIlSDZYY I CURSE YOU WITH AN ANKLE RAZOR CUT. \n\nPre order ‘in my defense’ to break the spell \n\nhttps://t.co/oemdVu1RUx https://t.co/GL081mqgeX RT @katiedanville: Sat with @IGGYAZALEA on repeat because that's the kind of good shit energy i need rn ❤️ RT @bloodstone__17: @IGGYAZALEA me n my flat ass in the twerk pit https://t.co/Vdj6ENp9EB RT @LAtimelessAngel: @IGGYAZALEA Me at the barricade https://t.co/MqmbBnIFea The stakes are high https://t.co/NqzyqE6V61 RT @thatpeasant: @IGGYAZALEA Me moving to the center of the twerkpit https://t.co/5veAPrb9Td RT @AlexFidgeon: @IGGYAZALEA @ all of us in the twerkpit https://t.co/z3q4GTWvCd This is why we need to invent: \nTwerkPit \nIt’s like a mosh pit but with ass. \nAnd friendly. https://t.co/C07Lqmj5HG No! But I will drop one for\n‘Fuck it up’ verrryyyy extremely memely seemly soon https://t.co/k3VojlaHpv Lmao fake blood?! https://t.co/eTR5RO1fPw That’s a good sis! 💗🍒 https://t.co/6gsKsexF3C RT @awesomeryangao: @IGGYAZALEA I can't tell how excited im about iggy and her coming album. Everyday?! 😂🤷‍♀️ \nI’m an obsession! https://t.co/CEZZiNsnyn Guess who’s coming to San Fran? ⚠️ Normal unisex size. https://t.co/d4jDtZDFXb RT @Slender_Vee: \"You better ask your GPS, I ain't the one to address\" @IGGYAZALEA https://t.co/MInxFMC9gx At first; I didn’t like this trend.\nI’m not gonna lie.  \nBut.\nthe more and more these videos start to seem like someone laced your blunt \nthe more the rat in me rises to the surface and LOVES them. Hahahahaha \nWhat’s my problem? 🥺 https://t.co/9pyItL2jKz Hey so there’s only 45 tickets left in NYC if you are thinking of going, bitch GO! \nIt’s gonna be wild! https://t.co/fl4pzf3MQL Ugh! For sure I would! https://t.co/5HGmoOyonu RT @wokepaulina: @IGGYAZALEA OMG 😭😭😭😭I was able to order the signed CD. I can die happy now ♥️♥️♥️ https://t.co/0biUDtlJRB RT @shan_IGGY_xo: Finally managed to get a signed vinyl @IGGYAZALEA and I'm so so happy, I love you and I cant wait to hear the rest of the… RT @LukeygagaX: @IGGYAZALEA Uwu https://t.co/VPrx30McRt RT @SuperDave26_2: Just ordered my #InMyDefense Hologram Shirt! @IGGYAZALEA Thank you 🙏 it looks awesome 👏 can’t wait to sport it! https://… I love you too, not just cause you pay my light bills. You guys really give me something to fight for, you’re the greatest 🧡💗 https://t.co/8cEsPDVbxs 100 signed vinyl + CD \nAnd 24hr drop for the holographic shirt are live now!!! \nhttps://t.co/ahHwXx4WP6 https://t.co/zEXOo9N0ZK Tomorrow as in when it’s light outside in about 7hrs https://t.co/C0ub27FqMB @LuisUnleashed It’s in like 7hrs Holographic tee drops tomorrow @ 10.30am PST. \nAvailable for 24hrs only!\nAlso restocking 100 signed CDs and signed vinyls for the last time before we debut! ⚠️👽 https://t.co/rhSIxEkaMh 🤷‍♀️😂 https://t.co/adagHpYA66 I say this with love: \ntiktok is for crack heads. https://t.co/1e1iaHUpFd So anyway; wear sneakers to the show -  don’t wear ya good shoes and definitely don’t wear heels! RT @Kingneptune__: @IGGYAZALEA Nothing honestly What’s better than when someone gives you something and it perfectly captures you in every way. RT @drigoszn: bitchhh i can’t waittt lmaoo https://t.co/kSw2diixxj https://t.co/gBJz895vw6 @feedthewolvez Lol it’s only in the show version RT @mxxryxn: Hi I love @IGGYAZALEA with all my heart. That’s it. Dropping 10.30am PST (pacific standard time) if you’re needing to do a time zone calculation for the last signed drop tomorrow on my webstore 🧡💗💜 https://t.co/Qb45a1f8Dd RT @tippysparkle: @IGGYAZALEA I just watched this lmao 🤣🤣🤣 🤪🤪🤪 https://t.co/8ffz5QFzC5 I’m the Mary!!!!!! RT @ReeceHoops: @IGGYAZALEA This is why I love EVERYTHING!!! 💕 RT @extrapettychris: @IGGYAZALEA I can’t wait for my long sleeve, love all the new merch! I design all my merch 😱 https://t.co/YWKvSoSRMp Nope online for 24hrs only and never again! 😱⚠️ https://t.co/5r28vhYJTM You will see the special drop shirt tmorrow! 😇 https://t.co/cBphvFq0Ax So. \n\nSpecial 24hr drop for a holographic print shirt tmrw \n+ \nReal life last run restock of \n100more signed vinyl + CD. \n\nI’m really not doing anymore cause my arm would fall off from signing them. \n\n10.30am PST on my site. RT @richsdiary: @IGGYAZALEA An altar 😂 https://t.co/ULPHtEv4FA I’m just sorting out the pop up shops details etc etc. \nI’ll post flyers with info later this week 🧡💗 https://t.co/k7ZI85JH7q Yes! And at the pop up the next day if you would like to potentially have it signed by me. https://t.co/oPJOJFkUAE See you there bb! https://t.co/7kkn5hZdnk RT @TIDAL: @IGGYAZALEA ♥️ Yay!!!!!! Thankyou!!!! I really try to give you guys quality items! 😈😇 https://t.co/NPCAQ8Vhay RT @Tonillion: This is totally my energy. 😭 https://t.co/TjwWkKpTVF Let’s invent one. Thoughts ? https://t.co/HQ1ZjrVcA9 RT @thirsttrapbae: Which of my mutuals is going to this show??? I ain't trying to go alone 😩🥺 https://t.co/RlMn5bMHg4 RT @BrandenLapp: My wife loves @IGGYAZALEA I really hope she comes to AZ soon so I can take her!!! We went to the state fair a few years ag… RT @MartelStar: This bitch gon have FIRE!!!!!!!!!!!! https://t.co/E2rbQojVaf @JimFTFD Exactly the point!!!! 😈😈😈 They are filming the day of the show and then posting it later on their platform for you to be able to watch in HQ https://t.co/a0oqsGZd1s Tidal is filming the show. https://t.co/r2lJIiJQbD Oh I have money guns and they are loaded! https://t.co/XJlnKjNxzu IF YOU ARE NOT TRYNA MELT THE FOUNDATION OF YOUR FACE. \n\nIF YOU ARE NOT TRYNA SCREAM THE WORDS TILL YOU HAVE NO VOICE. \n\nIF YOU ARE NOT TRYNA LEAVE LOOKING LIKE YOU GOT JUMPED. \n\nDO NOT. And I repeat. DO NOT \nStand in the first 10rows at the shows cause it ain’t for you!!! https://t.co/3I5rxC8MzO *Whispers* \ndon’t stop... \npussy pop. pussy pop. https://t.co/mty39IhMek @TIDAL will be giving away some free tickets so follow them for updates !!!! https://t.co/m3aMnuzbtq Are you guys coming to the La show 🥺 twerk competition ? \n🤲 https://t.co/Fs7IZ3IPpa If you haven’t already; \nPlease PRE ORDER my album \n‘In my defense’ it’s out next week! \nI’m getting nervous. \nI will be spamming. \nSorry 🥺 \n\nhttps://t.co/POIoQmrSGO https://t.co/Jx6gq0XxGX I feel so attacked!!! https://t.co/xZ6JvnbdSU Yes! Plus I’m having a pop up shop the following day in LA! https://t.co/8dUYHKyEpB RT @privmelle: @IGGYAZALEA ITS GONNA BE LIT Same I’m starting to get really nervous about it and I still have over a week. https://t.co/wd3smOGqtf RT @xNellv: I’m so ready for @IGGYAZALEA album. I can’t remember the last time I was this ready for a new project. RT @M3ly_5: Honestly,  @IGGYAZALEA “started” is  literally my wake up and slay song.... I’m get sooooooo ready to shake the world after lis… 9 days until my album ! \nAnd if I can make you walk away after hearing it &amp; say \n“Damn iggs believed in herself &amp; didn’t give up. She’s still doing it so why can’t i ?!” \nThen I’ve done a good job. \nBelieve in yourself damn it. ⚠️💗 @arianagrandes I think that’s fucked up. \nBut it’s a good invention tho, just not for an artist to use the whole point is that the artist touched the cd and signed it and out their energy on it Last time I just did a message every 20 or so; I’ll do it the same way this time so who knows! It’s luck 🤞 https://t.co/2GRyaSlCm0 😖🥺 I don’t know! \nI’m torn. \nI don’t want to do too many but I also know a lot of people missed out. Should I do more? https://t.co/uFsyruRAM6 Yes, they do! https://t.co/nlg0IPTeLT Mmmmm I cannntttttt 😭 \nBut I CAN tell you guys what songs are on the set list from the new album the night before. https://t.co/jtxk1WWQ0d Fuck it up cause I just watched the auditions and there were girls doing backflips and landing in the splits n I’m extremely excited to film a video now. https://t.co/YOJm6aitoE Haha I have an assistant but I’m one of those ‘personal space’ people who doesn’t want other ppls assistance with a lot of stuff. Who relates ? https://t.co/mYxuv6KREG how are they supposed to know what I want to take when I don’t even know what I wanna take! https://t.co/T89R6hKVNY I absolutely HATE to pack my bags. \nIt involves entirely too many decisions in a short space of time. RT @nsloane05: Getting my tickets to see @IGGYAZALEA in nyc and I’m so excited!!! 😍😍 See you soon! https://t.co/hfBFG7EGZH They’re available now on my website https://t.co/Gw6X4nnXN3 https://t.co/6a9Q0mNxqJ We WILL sing the national anthem in full. https://t.co/8ZclKSt7mv RT @liftedshadow: 6 days is MORE than enough to learn the words for the album https://t.co/rstwOLYxtP Hahaha omg please make me one! https://t.co/cZCTWX65SH @pinche_humberto Don’t stress, I can technically do as many m&amp;g as I want. \nI had a 70limit so they marked as sold out. But 71 is fine 😊 @pinche_humberto That’s so wierd. Def not gonna turn you away! I’ll enail them now about it @pinche_humberto Same ?! https://t.co/b6Q7NElmtp LA is sold out but NYC meet and greet are on my website under\n ‘ shows ‘ https://t.co/agL13EhPFX RT @Panquee4466: And 5 years later we’re finally seeing her together 🥰💕 @_laurennmiller_ can’t wait to see ya in nyc @IGGYAZALEA !! https:/… LA show got like 60tickets left btw Yeah! Happiest I’ve ever been! \nPlease don’t feel a major label is the only option! I’ve gotten back something priceless going indie and that’s my happiness and freedom. 💗 https://t.co/3hvLAxL91t NYC tickets + VIP passes to my JULY 24th show are now available: \nTicket link \nhttps://t.co/XB5Dn8sJrW \nVIP pass link https://t.co/n1kxuyapHc https://t.co/QSJfh0JB1W Oh and by the way we are 100% pulling you on stage and throwing money on you in twerk comps like the old days so get practicing and get to the front if you’re tryna scoop some cash of the stage RT @yesxoseniaa: Gotta start planning my outfit to meet @IGGYAZALEA 😭💞 my brother @xchrisfigueroa and I are so excited to see you!! https:/… RT @starcourtnasa: @IGGYAZALEA is it rly the wrong song? https://t.co/hmlr8MlyRe RT @RICANPAPl: It’s official! Meeting ⁦@IGGYAZALEA⁩ in NYC 😍 Excited to see you slay the stage queen!! https://t.co/wROcDQgQGo RT @Mikemccarthaaay: @IGGYAZALEA GOT MY VIP TICKET CAN’T WAIT ❤️ https://t.co/p6r4JcF9pS RT @intermsofhomo: Oh y’all don’t know how long I waited for this. Cunt wait for this show miss @IGGYAZALEA https://t.co/V7Pio8lIkR You sluts will have had 6 days to learn the new lyrics so I better hear them screamed back or we gonna have a fight https://t.co/6HbAu1An9F RT @daisyrosesebert: @IGGYAZALEA YAS I GOT MY TICKET FOR NY!!!!! RT @AndrewArianator: yooo I’m actually off this day from work too. It’s a sign 😇 can’t wait to meet u @IGGYAZALEA https://t.co/CTEbgaHhUu RT @EveringAmber: Ma’am @IGGYAZALEA 😭 it’s finally happening!!! 💓 https://t.co/D3345aXdK4 RT @KevinWelchhh: Can’t believe this is actually happening @IGGYAZALEA 😩😭🤗 https://t.co/eStz0mj2Bc RT @AndrewArianator: @IGGYAZALEA got my VIP tix sis 😘💜 https://t.co/3IazylgdVE RT @MxhmoudG: @IGGYAZALEA Got my ticket AND VIP ❤️ see you in NYC! https://t.co/jUiyne8vyd Sorrrrry I slept in today they’re going up in a sec https://t.co/pWrLTWjdfd RT @james_st_jamess: @IGGYAZALEA you’re now obligated to start your shows with “please rise for our national anthem” 💗 u too https://t.co/GFolZxNWxK Iam cackling https://t.co/VUZYys2vDd Iam not lying when I say I legitimately remember watching this and being extremely hype about it. 😅 https://t.co/KD4FFmuUzW 😂 thanks! https://t.co/CLHRfT0jEb @LaganjaEstranja QUEEN! I love you!!! 😭💜 NYC! me &amp; @Silky_Ganache in your areaaa July 24th! \n\nTickets + VIP on sale tmrw at 10am. \n\ncall friends, make plans - \ncause its tiny &amp; will sell out fast. This is your warning ⚠️ https://t.co/7l6zVQTasu 🤷‍♀️ I guess so... lmao https://t.co/hwYtdVX1dL RT @3nemiez: @IGGYAZALEA this is top tier ENTERTAINMENT The fact I’m trolling android users via a web app &gt;&gt;&gt; https://t.co/8yMLoF80HC I dunno sir, are you? I never mentioned anything about androids = poor. These are your words. Not mine. Are we... self projecting perhaps? https://t.co/C6pP0k48th @BibleGirl666 I love them, I read they are hard to take care of, but honestly they aren’t. Like at all. July 24th https://t.co/rjYC477Cwj They are going on sale 10am Monday! https://t.co/RUFngIA3pw You better bring crazy energy cause I’m taking it back, back! 😝 https://t.co/fYXVYZm1DQ RT @gabrielv_art: #NewFanart\n.\n@IGGYAZALEA \n.\n#iggyazalea #fanart #InMyDefense #digitalart https://t.co/XIOCdLqZ4f RT @HotGirlIggy: iggy at home tweeting from her samsung smart fridge while cheating on her meal plan 👸🏼💅🏻 Imagine thinking anything that comes out of my mouth is serious. They are next level committed to the early 00s aesthetic and must be respected. https://t.co/m2kfaQOrdy Bible girl aka my hero. \nThankyou for your contribution to fashion. We love you. https://t.co/kIvvVhgJsY Lmao relax I don’t care what you have; make up a joke about iPhone users and roll with it, there’s more androids sold anyway the net just bullied y’all into being ashamed. https://t.co/8km2c4tN10 RT @marcosgdelrey: @IGGYAZALEA Writing the tweet through the web app, that's a real statement I would like a shirt that says \n“Twitter for Android getting brave”\nPlease. I will if you will. https://t.co/YY0h1RdtUi RT @misspsand: @IGGYAZALEA can’t wait for your album queen. Need more of your bad bitch energy I’ve recently decided that for the most part, to hell with dance routines at small shows and yes x100 to going insane as the alternative I mean, I love me some target. \nBut I’m an internet person. \nYou are too actually since you’re inquiring about a very obscure Delicacy of internet treasures. Ie. My album. https://t.co/U30huFWL0C Target ppl aren’t into me. \nOnly internet people. https://t.co/L6UydRz0ii Please do cause everyone said they would and then I never saw it happen! I need inspo pics https://t.co/FWP2tJBCIa Just on my webstore for physical copies. If anything changes I’ll let you guys know ! https://t.co/FyZtIJO8OC 😝 ahhhh! I love you too!!!! https://t.co/S6hC1yn760 Meet and greet tickets for LA \nAre sold out! Hmmmm true; I didn’t really think about the fact we changed the rates. Let me think about it.... !!! https://t.co/Bn0UBPdOLz Wow I’m really already organizing sessions to start on my next album and this album isn’t even out yet. 😅 \nThe best thing about being independent is never having to take long ass forced breaks again. Freaky princess @brookecandy 💗💜🧡 Cause It’s not a single; it’s just an instant download track for my pre-order. 😊 https://t.co/j0lHYIgIn7 RT @TaeDaTea: BITCH! @IGGYAZALEA new song “Just Wanna” is EVERYMUTHAPHUCKINTHING! https://t.co/gS2vZOpuKx Fuck it up is the next single! https://t.co/Ob57Tisz3E It’s juicy j I’m taking back to the trapgold days! https://t.co/IEd4QZLv0t Not for a while after, because it takes time to press physical albums. The estimated shipping date is in your email receipt 💗😊 https://t.co/tnNCuGN49L That’s why I have the count down on my website... we all on the same page now with count downs lmao https://t.co/DX1LlFnfQa 14days until my album is out. 😱 Yes! https://t.co/5rBlwpfcSW Without; you have to buy a GA ticket separately 💗 https://t.co/K7TI9arsdO RT @TheCruzShow: I just wanna... 👀\nwatch this @IGGYAZALEA interview https://t.co/buee20kiuh Hey guys: International Shipping rates on my webstore have been updated with a cheaper option. Check it out while the July 4th sale is still happening.\nALL ‘started’ merch has been marked 25% off. \nhttps://t.co/ahHwXx4WP6 @theselouboutins @VinTheDon_ @3mshaw Having a BBQ @VinTheDon_ @3mshaw Lmao bring me back a hot dog and we are good Today has been so boring. RT @MandalayBay: JUST ANNOUNCED! @SnoopDogg, @IGGYAZALEA, and DJ @ecambage are taking the stage @MandalayBay Beach as a tip-off to the All-… RT @EveringAmber: @IGGYAZALEA SCREAMING. I’m so excited for the nyc show sis ahhhhh! Exactly, you get it. \nI love it so I don’t have any real worry about expectations. https://t.co/QpjQ7uNcvA RT @Igguaryy: @IGGYAZALEA Lol 😂😂😂😂😂 ZERO! https://t.co/c9DAc1Bvc8 Unfortunately I can’t share details with you guys until I’m able to post the link next week; but it’s in Manhattan on the 24th! https://t.co/S22nkaCsXI If I decide to do anymore pop up shows ATL is definitely high on my list of potential places. https://t.co/v8bszsv46v Been waiting to get something special I had to get fixed back and it’s coming in the mail tomorrow. *squeals* I love my fans but a few of y’all need to take a sip of sumn and relax... \nme &amp; Kash are doing our best to find a day to film the most amazing video for YOU GUYS to enjoy &amp; ya asses are harassing and making it so wack and negative from the jump. \nI really hate to see it. Today I found this butterfly (already dead) and It’s a good omen I don’t care what you say. https://t.co/PyMwKJJo2A RT @liftedshadow: I just wanna fuck fuck fuck fuck fuck fuck fuck. I just wanna nut nut nut nut nut nut nut. https://t.co/bWfeUJ9CYn RT @joashszn: @IGGYAZALEA https://t.co/pHf63wywuU 🤷‍♀️ Imagine not knowing that \nComme Des Garçons is a clothing brand. RT @idolator: Confession time: We've had the chorus of @IGGYAZALEA's \"Just Wanna\" stuck in our head all weekend long: https://t.co/pJIuWzaP… I love the internet.\nit’s the only place you can see someone try at anything and get told it’s not enough by someone doing LITERALLY nothing. \nYour minds! https://t.co/eCMY5xRdV6 @iggysposition @ClaudiAzalean @kremesus Hahahahaha @ClaudiAzalean @kremesus I still stand by this CYL is really not that great. I’m sorry. RT @timon_luca: @IGGYAZALEA We're going to be there Dear NYC fans. \nI can’t put tickets on sale for my July24th show up tmrw because I have to let billboard know 7 days in advance of onsale or they will not count my ticket bundles. \nI know, it’s annoying, but it’s the rule 🤷‍♀️ \nSo I’ll put up the tickets next Monday (July 8th) @justwhoiamm Scheduling issues FOTW might actually be the next single after all..... 🥴😝 RT @isharolprado: I fucks with @IGGYAZALEA HARDCORE And this is why I’m so happy to own my master for this new album, they really do ppl crazy dirty on ownership of their intellectual property in the biz. https://t.co/RtyN37yEvQ Telling someone about a deal days before it’s public means the deal was already done &amp; she never had the opportunity to even make a bid to own her own work. These deals take months to negotiate in long form. https://t.co/Ra7NdxzcOM @Bitsman1440 @akaMARTIAN @AUBREYKATEXXX You’d be pissed that you came to a pride concert meant to raise awareness about the LGBTQ+ community and someone there spent 2mins out to raise awareness for the whole reason everyone’s THERE. Lmao. Okay. The hot dogs and tater tots be hitting when you’re hangry https://t.co/atTj2l6dgo Getting car pooled to multiple different religions bible studies for the free food.  My reservation in hell awaits 🥴🙃 https://t.co/NAz6iqErAu RT @OthySassy: @IGGYAZALEA https://t.co/f2ZwImGxx9 No, but I’ll try to keep doing some more headline spot dates. https://t.co/31On0To68J Heads up! \n\nJuly 24th NYC show goes on sale Tuesday at 10am EST \n\nDon’t miss out; this is a small show and will sell out fast. \n\nGuest performer announced on the flyer! Hint: \nshe loves a good ganache 😉 @arvinpanado I think from what I can see; it’s more about the fact they didn’t even give her the opportunity to at least bid on her own masters; when she’s made it known she wanted to purchase. I can totally understand where she’s coming from. Meet &amp; Greet passes are sold separately from the ticket itself so they’re via another company website: \n\nYou can check out the VIP packages here! \nhttps://t.co/zj7YiTjssU https://t.co/ou0tqlGXvC LA!  \n\nTickets are close to sell out; come see me, my new album set list and @VanessaVanjie July 19th: \n\nhttps://t.co/1oEMqESJMJ https://t.co/dLCOmb5Tzi @IsItChillTaylo @nickwaka24 We know you don’t, that’s why they have such a low life expectancy &amp; need more ppl talking about how we can help create awareness &amp; safe spaces dumb dumb. RT @ChunPaul_: @IGGYAZALEA Just Wanna SLAPS @DDLECOURS @IrishAzalean I love you all tooooo 💗 Do we need more crazed insane energy in LA on the 19th or more dance situations? \nIt really depends how fast you guys think you can learn album lyrics. Ya moms set better than mine low key. https://t.co/pMXzp5Tzfl RT @kaypeaux: @ronnierayallday @IGGYAZALEA got my ticket 💆🏽‍♂️ https://t.co/SugpmZdQP3 RT @KingInThisHoe: I bought a ticket to @IGGYAZALEA show in LA. Omg! This is my first time seeing iggy. I might cry. I know for certain my… RT @DarianMaurice: Listened to @IGGYAZALEA new song “just wanna” and that shit bump different in the car!!! I was on a whole other level of… RT @StephenNYMonsr: @IGGYAZALEA You're living your best independent life. We love it on you, sis. https://t.co/oG7y2kPS8E @timmyknudsen Hahaha all good love you, actually had i; it would have been kinda a great stand up comedy moment since we are literally AT pride. 😝 Love that! https://t.co/RqlA9sD91H RT @BrandonMcKay6: @IGGYAZALEA Accurate 😂 RT @xxlilhoexx: @IGGYAZALEA yes we do cuss a lot lmao 🤧 I’m Aussie. We cuss. In a loving way. ALOT. Haha https://t.co/OQalGv8eB0 RT @designer_lover: I was trying to save money but then @IGGYAZALEA said one day only LA and then I blacked out and going to see Iggy!! #Ca… No I’m just a rat sometimes https://t.co/qLxSDHJCfw RT @IamSantiago_i: @IGGYAZALEA I would runaway if my family finds my Twitter account lmao RT @brookexperry: @IGGYAZALEA YES lmaoo I’ll tweet about a song and they’ll randomly message me and be like ‘it’s a BOP’ like ??? mam Does anyone else’s family lurk their page. \n\nMy mom totally does but would never admit it. I bet you if I tweet that tigers blood is the best snow cone flavor next week she’ll ‘randomly’ happen to be eating one. \n\nBitch you’re a lurker! Hahaha RT @KevinWelchhh: @IGGYAZALEA You meant that you were using your platform, your voice, and your privilege to call attention and awareness t… Way more fun this way !!! https://t.co/gQhcfI2LNl And just so everyone understood I don’t mean I want to be anyone’s voice just meant that in that moment since I couldn’t find Michelle in the crowd; I wanted to be her voice and speak up for her while I have people’s attention. RT @xxlilhoexx: @lggoAzalea @IGGYAZALEA in every video/ photo i’ve seen of you iggy you look so fucking happy &amp; that’s what i live for! I love you guys it was such an amazing energy even with NOlights half the time, in ears fucking up, show cut, I didn’t care cause you all made it so fun. \nInfinitely honored to be invited. https://t.co/Yx2nyAHSzl RT @akaMARTIAN: BITCH @IGGYAZALEA stopped her set to read statistics about TRANS WOMEN! \n\nAbsolutely amazing! https://t.co/FbHepcsRjh I’m not crying in my hotel room or anything. ❤️ you Chicago. \nIt’s an honor. Not good at speeches but I hope you get what I was saying: \nYou’re valid. Your gender identity isn’t imagined. Your voice should be heard not overlooked. You’re not invisible to me, I see you. https://t.co/Jap8ZzghRV I love you Thankyou for loving me and my hot mess show today 😝 ❤️🧡🧡💚💙💜 https://t.co/LlyeP5rVwT I love you guys!!!! https://t.co/rIeC9FdXbh Best part of tonight was meeting @ItsMsMorganite 🎉 \nI love you &amp; I’m not good at speeches but I tried to do you justice. 💗 RT @KevinWelchhh: I’m about to cry, seriously. This night. This moment. Her words. @IGGYAZALEA thank you for saying what you said. I know i… RT @austinjrandall: @IGGYAZALEA popped off tonight — even though the set was short, the songs we heard tonight were so fun ❤️🧡💛💚💙💜 thanks f… RT @blanktspace: @IGGYAZALEA that was incredible!!! you did that!!!!! thank you for everything, for the love, for te support,  I love you s… RT @TheChrisRand: @IGGYAZALEA Loved the show tonight. I wish you could of gotten through all of them! But amen you played Pussy. RT @Davedream_: Miss @IGGYAZALEA looked GOOD and performed well your faves could never https://t.co/oLSNjsl2j5 I’m so sorry the show was cut so short tonight. I came ready to do a full set list but the festival has a permit curfew and was running overtime with their production during the day. \nI still had an amazing hot mess ass time with you and that’s what matters!!! 💗 you Chicago. Cute!!! https://t.co/1TpjNEafGs RT @SerenaCasanova2: I GET TO MEET @IGGYAZALEA https://t.co/lWqNghejHz RT @GOREjess0: Got mine! 👌 @IGGYAZALEA https://t.co/CBdJxELC77 https://t.co/qzx5AYwWz4 RT @ronnierayallday: DAY 1 @IGGYAZALEA Stan. #InMyDefense #chicago #PrideinthePark https://t.co/xtdbKWGjVb Hey guys https://t.co/TMQ0dYRrX2 have free HIV testing at @PrideintheParkC today. \nTake advantage of their booth, you’re already there! so it’s not outta the way. 👌 I really need to start proofreading cause typing with long ass nails has a high error rate and I look crazy illiterate sometimes 🥴 It’s hot today at #prideInThePark Chicago so my team is giving away these cute fans to keep you cool! Tweet me a picture of you snag one so I can repost 🙏 https://t.co/3yAt104kBI RT @venditki: I woke up with the “i just wanna fuck” in @IGGYAZALEA’s voice playing repeatedly in my head. A beautiful way to start a day. You know that book the secret? \nMy albums an investment I WILL share with you the tolls on how to become a bad bitch. You picked wisely 😉 hahaha but for real tho Thankyou, I love you and need everyones support now this is a milestone moment in my life. https://t.co/51flnsbNkN Yay!! I’m not at the Venue I’ve left to eat &amp; get ready. Don’t get too day drunk guys it’s hot ass hell and it creeps up on you!! \nI lost 5 pounds at sound check https://t.co/Uyqg9w9gpK Where is the body? @todrick is the body! So mad I’m going to miss this today 😩 #PrideinthePark RT @ChihuahuaLopez: Ready for Pride in the Park!! 🤩💓🌈 @IGGYAZALEA ready to twerk the night out!! 👏🏼 #ChicagoPride #Pride2019 #Pride #PrideI… RT @__bryan013: IGGY’S FACE ON MY SKIN 🥵\n\n@IGGYAZALEA \n#IggyAzalea \n#sallywalker https://t.co/Bs4DVLFafU RT @JavierIsRude: “I grab his hard drive and\nthen I hacked the muhf**ka, baby” @IGGYAZALEA  🔥🔥🔥 cannot wait for this album ! RT @xoxoluv4iggy: @IGGYAZALEA we out here repping #daddysabitch https://t.co/1oljwVAcXV I’m sorry! But there are about autographed 40 CDs left which I promise you are cute &amp; also made of thick nice cardstock like the vinyl covers, not plastic jewel cases. 💗 https://t.co/myHLUWwBOS RT @so_p0sh: I just wanna x @IGGYAZALEA is a certified bop... been playing it since 7am yesterday... RT @Flameeee_: Idc if i go alone , you know damn well imma go see @IGGYAZALEA live bitch 🤪 https://t.co/riLw1YTEeP Come on confidence!!! https://t.co/EkLZLnTyAn RT @TheRealCEK: I made my preorder purchase. I’m saying it loud and Proud @IGGYAZALEA is that girl! She has the bops and the songs that mak… https://t.co/ahHwXx4WP6 \nAnd press on the Pride tab! \nEverything in that tabs profits go 100% to the NCTE 💗💙 https://t.co/x8SOZHhjAx YES! And all proceeds go to the National Center for Transgender Equality 💗💙 \n they will also be on sale at the Merch stand tomorrow in Chicago! https://t.co/NKHO5gKaCH If you’re in Chicago tomorrow I’m closing out Pride in the park at 9pm &amp; there are still tickets available here! \nhttps://t.co/pcZLl704IA Ha! Yeah there’s a lady that I see at the airport when I travel and every time she’s singing along to the radio not worried about shit and I kinda love that for her. https://t.co/RutFvNHBCQ There’s something low key really admirable about people who are down to sing along to songs passionately in front of strangers. No I picked it cause I know y’all nasty https://t.co/tWl7kuWu0R CF4L https://t.co/gnnfcBwnSG 😝 https://t.co/KIXjNMuz2A @LachlanBaker17 Everyone with a computer 😊 @thenewclassic_d @arvinpanado @NICKI_IGGY_ Cause he’s from a different time zone than America Music is the food to the soul 😉 https://t.co/So3MrQcyFU RT @ParkingChicago: #PrideInThePark is Saturday at Butler Field in Grant Park!\n\nHeld the day before Pride Parade, it will celebrate #Pride… Yes! #QueerArtistsAreRealArtists https://t.co/ig2DdrWGFk RT @swiftazalean: Just Got the signed Tape. Do I have a cassette player? Hell naw https://t.co/LSc5nU1jUY This economy is nuts. \nMost of these kids are in school still trying to get an education, feed themselves and still afford a little fun https://t.co/9TIlN1a7jm @feedthewolvez Did you get signed stuff if not just cancel the order and re order I’m on a meal plan and I tried to show my boyfriend he was like \n“I don’t wanna see that Astronaut food!” Lmao I’m cackling Tickets to the LA show with @VanessaVanjie are selling fast guys, if you’re considering it’s $35  &amp; it’s projected to be sold out by end of day. Don’t miss this I want all you crazy, loud, extra asses in the crowd we need a lit hype energy!!! \nhttps://t.co/Gw6X4nnXN3 @iggyoutsold @jeroen_houpe I have no idea but you should email customer service it’s worth asking them RT @SerenaCasanova2: Holy crap y’all 😭❤️ \n@IGGYAZALEA https://t.co/jfr6TNxfpV Yes anything you buy via my webstore has payment plan options at checkout https://t.co/luJHuscVhH RT @BoiiFenxty: @IGGYAZALEA WHAT I TOLD YOU QUEEN I HAD TO SNATCH BOTH LA SHOW &amp; A SIGNED CD PERIODTTTT 😂🥰💛 LOVE YOU IGGY https://t.co/BU9A… RT @bloodygalore: @IGGYAZALEA the payment plan was so helpful! I know I only got  vinyl but the shipping was even more than the vinyl so th… Yes!!!! You’re very welcome!!! \nThanks for supporting me 💗 https://t.co/nOuBNhrZYb LA if you’re a broke bitch.... \nwin a ticket here!!! (Hahaha I love you 💕) https://t.co/9PidYP7shF @baileyevason Just contact customer service My merch pre order is live on my site and so are limited edition physical copies of my album - \nHere’s the link to signed ones! \nhttps://t.co/VoLtYcStaN Tickets to my LA show with special guest @VanessaVanjie can be purchased on my website now! \nhttps://t.co/Gw6X4nnXN3 \nVIP meet and greet passes are available too here: \nhttps://t.co/eaFPGntYEb @XCXBABES Just order signed and cancel the other one it’s a pre order so it should be fine RT @breatheheavycom: Yassss @IggyAzalea has sex on the brain on her new pussy poppin' song #JustWanna https://t.co/fXTlp03dUp RT @carlasnw: As I pre-saved @IGGYAZALEA’s new album I realized how much she had to overcome during the last few years. It shows that being… RT @nateyweb: 🔥💦 IGGY AZALEA’S NEW SONG #JUSTWANNA IS OUT! #InMyDefense is coming! Check out my REACTION of her new song here ➡️ https://t.… RT @shuavomit: A NIGHT TO DISMEMBER \n@IGGYAZALEA 🚨 https://t.co/CL24AnMGBY LA!!!! \nTickets &amp; VIP passes drop in 30mins! https://t.co/XTLNgFMKn9 If you’re coming to \nPride In The Park \ntomorrow you better be learning the words to ‘just wanna’ \nTODAY! @jarednotjarrod It’s just your dumb ass, why would I leak a topless picture a month before something, delete my socials, have to pay a wwbsheif service thousands monthly now to keep removing them and then have an on going lawsuit in regards to it, your dumb ASS. Stop trying to victim blame RT @angelfuckoff: Just Wanna is what the girls wanted @IGGYAZALEA. Thank you!! #InMyDefense https://t.co/ytg24qCX8l RT @theedenzell: ima stream tf out this song , EVERYBODY GO STREAM @IGGYAZALEA  NEW SINGLE  “ JUST WANNA “ 🤤😝 RT @kings__room: I need for the lot of you to give @IGGYAZALEA her respeck and coin  as she has put out yet another bop from her upcoming a… RT @TheCruzShow: .@IGGYAZALEA just released a new song titled “Just Wanna” off of her upcoming album #InMyDefense \n\nhttps://t.co/u9ykAwXT9a RT @_SheAVirgo: Ohhh 👀 @IGGYAZALEA u nasty NASTY huh?! 🤭😍🤤😩👅🤸🏾‍♀️ #JustWanna https://t.co/BaV9H7qDaQ RT @idolator: She just wanna fuck. @IGGYAZALEA's \"Just Wanna\" is another ridiculously catchy taste of her sophomore album. Listen to it and… RT @TIDAL: Dropped: @IGGYAZALEA. \"Just Wanna.\" https://t.co/fBvXlYrMZR https://t.co/50PsIeeSqo RT @princesscaiIyn: @IGGYAZALEA in the absolute nicest way possible.... punch me in the face https://t.co/xUFZfv45TB RT @driskll: This song is my pride mood @IGGYAZALEA https://t.co/UBnEfLwWbI RT @natureboyty: @IGGYAZALEA “I Just Wanna” is really big dick energy and I cannot! https://t.co/s5yjqBl0Gv So Like I was saying yesterday... \nI’ve been feeling like my old old self this album; can ya tell ?! Ha! RT @kremecIassic: .@IGGYAZALEA https://t.co/TbQpfJPlIP RT @JAYYTHEGAWD: this lowkey gave me mixtape @IGGYAZALEA vibes !!!! 😛 #PreOrderInMyDefense https://t.co/3BelIcFXfq @kaylanecholer Lol for July 19 #PreOrderInMyDefense now!!!! Ahhh 300 limited edition signed vinyl \nGoing on my webstore at 1pm EST set your alarm don’t miss out! ( $20.00 ) https://t.co/x7MSBHrp1R I’m VERY excited for it! 🙏🙏🙏 https://t.co/9PjtwT9PzS @BIGNOAH256 @MattHasTheMusic @TheInfinityJims All are sad as fuck!!!! \nBootleg ass budget bloggers  \nStay outta white hoodies Noah those yellow ass pit stains aren’t cute 🥴🥴🥴 @hoIyenigma Nah back then you had to follow back to dm I just proba didn’t follow Omg am I.... 7 years late with your prize?! My bad. Let me send you something babe DM haaaaaa!!!! https://t.co/Ua9ErK5ygL any time u feel alone there \nremember: it’s unlikely ur the only gay person at school. \nThere’s probably a lot of gay ppl there. \nBut ur the only one who’s confident enough to be open about it right now! so remember those people are watching u and probably admire ur confidence https://t.co/Zdp6d4acD3 I’ve always loved those videos where people dance to people’s rants or crying, speeches etc. \nIt’s def on my bucket list! Please don’t let me forget:\n in future if anyone talks shit about me on camera I need a link so I can do an improv dance routine to it. \nThankyou in advance. RT @TlNDERFELLA: Not to be dramatic but I’m going to smash my computer if I don’t get a signed @IGGYAZALEA vinyl RT @_gigidavis: Merch with self defense examples on it!!! Iggy is my queen 😍 https://t.co/ooqv2J6wkd RT @RashionTheKen: Somebody PLEASE turn off @IGGYAZALEA WIFI!!! I have never got so many notifications in my liiiife! 😅 RT @AlysciaMartinez: Y’all iggy is selling merchandise that teaches you self defense on the front of it https://t.co/CXXO9MZlGN Haha, well it can be like the rats, we will add it to our list of insider only fandom jokes. https://t.co/k8pNd5ZX62 You’re amazing Thankyou for this laugh today! Haha https://t.co/4pa6uYJMpC RT @JuBreeSy: https://t.co/H6mYoupIbq https://t.co/EnNEpmpzHR RT @thomaskeamon: https://t.co/8iHjqLykak https://t.co/dGrddfpEMo RT @SouljaxJah: https://t.co/f4f4KnkVWo https://t.co/7CEX8pzJ2F RT @walt_therealest: Delete this rn https://t.co/lOYu3FaJTB RT @MermaidPapi: Call them what you want they still won't buy your shit https://t.co/VJpev2jskn RT @MarcusLikesTea: @IGGYAZALEA Once a condom l, always a condom, no going back https://t.co/QSdkxreokn RT @HamousKehlifi: @IGGYAZALEA no sis ,it's official, i already told my mom that i'm a condom !! 😂😂 RT @JuanfraLozano: @IGGYAZALEA I love being a condom RT @Ohnoitstommyboy: @IGGYAZALEA I AM A CONDOM AND PROUD!! #Condoms RT @Ale_DelRey17: @IGGYAZALEA Condoms True https://t.co/7mcEfxVNyY The vaginers I love it. https://t.co/OLP3yVlrUq RT @KodaDinah97: @IGGYAZALEA we’re sugar babies We need to rename the fan base. \nPeople change. \nFan bases change. \nWe were azaleans \nWe were rats \nAnd now.... 👀 @Kash_Pleen But for real though... what part is meant to be the funny part I missed? So anyway my album pre order drops tonight. \nSo that means a new song drops too that you’ve never even heard a single second of and I really hope you like it..... https://t.co/JoxOEGJs0C If you’re feeling depressed I just want to tell you: \n\nOne day while doing the most mundane thing ever you’ll suddenly realize \n“Shit! I’m back! I’m ME again” \n\nit’s gonna be the best feeling ever cause I know there’s days you thought you’d never be “you” again... You will be. Lit.rally me luv https://t.co/AaJveA3s4n Ugh I missed my flight and I could cry I’m so frustrated. \nall I wanted to do was make it home by morning *screams into pillow* “I’m that bleach blonde gay everyone’s always talking about” https://t.co/iDPvqBTeiS RT @KevinWelchhh: @IGGYAZALEA this is a little bit iconic jskdjsjdksks https://t.co/6LxKN3ewYg Why do you guys keep writing the same lie every 4months hoping it will magically make it true... \nwhat’s the obsession with my relationship exactly? https://t.co/a8CIvkIkWI RT @sluttyyjenn: @IGGYAZALEA the locality smh kajdjskj Lmaaaaooooooo the daily mail doesn’t know that sickening is a compliment. iam deceased. 😉 https://t.co/q27lnwATze More ‘In My Defense’ merch for your viewing pleasure... \nAvailable on my website this Friday with the album pre order. https://t.co/pewtz3jp0V Literally nothing, besides I like my own edits https://t.co/sVOC5SUTei https://t.co/tC0V8foQNl I really want to do a full 1hour show in Brazil, can’t believe I’ve been doing this since 2011 and still have never had a proper show in Brazil. RT @TheCruzShow: Get ready LA! @IGGYAZALEA is launching a special album release concert on July 19th! #InMyDefense \n\n full interview: https… RT @tropicsass: @IGGYAZALEA You never said which Monday tho' https://t.co/RGJUNTrOuW Last week I said I’d start a meal plan on Monday buttttt it’s tuesday and so far I’ve had a grilled cheese with fries and a pizza. Fuuuuuck I love this!!! https://t.co/Gplmg98QAn Hey guys I made this to help everyone cause I know the ticket site layout is confusing: \nThe Chicago pride show still has tickets, only some sections are sold out. \nHere’s a picture, green is where you’ll see you can still purchase a ticket! 💗 https://t.co/H7OK2wWXOg RT @IggySite: Lineup for the Chicago Pride this weekend. @IGGYAZALEA will be performing at 9PM. https://t.co/w6Fms7WoYG Add to this thread if you are thinking of coming to the show in LA on album release day (July 19) so anyone who is going without a friend can meet up! 😇 RT @nickwaka24: @IGGYAZALEA I JUST BOUGHT MY TICKET YESTERDAT!!! Come out and say hey! I’ve got cute fans I’m giving away 😇 https://t.co/dnOUe8ryFO Nah but jokes aside: I’m hype! \n💗🌼😝 I love pretending to be “back” to the general public in interviews as if it’s been my choice to be ignored for the last 3 years. https://t.co/KnemdGjlvy Well I’ve been doing it for years now &amp; according to the general public I’m pretty convincing https://t.co/xlg0J7guiZ Almost forgot this one! https://t.co/IVN4WLftKI @FergusonNicko I literally am the label so errrr no lmao @nicocarciochi No there are only new songs on the album no scrapped old songs @hopelessgalore No any design with back detail etc I always display front and back of in the same graphic 🙂 Let me add to this thread during the week so you can see all merch as i update. \n\nI love this hoodie. https://t.co/90HDJTJVZc Merch going live for pre orders on Friday too - help a bitch bundle! \n\nWe are going acid washed &amp; taking back to 80s fabric trends to match that BMW! https://t.co/tlBE6r4kYg Well everything was basically leaked online so I don’t consider this a sophomore body of work. \nThe fact the digital distortion album was never on iTunes doesn’t make it not exist or complete. https://t.co/rI79h48C8a Iam ! https://t.co/bAcBt2TDea I wore a “going out” dress and clutch because I wanted it to feel like I had been out somewhere and was clearly unprepared for a fight https://t.co/v7BeZsSZO2 RT @RuPaulShow: Tomorrow @IGGYAZALEA and @tyhenrymedium stop by! https://t.co/JPaln7yFIg The best part of my album cover shoot was I didn’t have to try and make cute faces I just stared into space and pretended to be a sack of potatoes the entire time. I’m in the mood for spaghetti 🍝 I’m doing a show in LA when my album drops but it’s gonna be superrrrr small so only my day 1s can fit. I’ll drop link on Friday! \nYou have been warned! Front &amp; back https://t.co/zW0MH0fzJe RT @idolator: Mark your calendars! @IGGYAZALEA's much-anticipated sophomore album 'In My Defense' arrives July 19: https://t.co/tBRdkCBDbN… RT @bawbbysworld: @IGGYAZALEA SEE WHAT HAPPENS WHEN IGGY GOES INDEPENDENT? SERVE AFTER SERVE AFTER SERVE RT @brookexperry: @IGGYAZALEA the STANCE, THE BLOOD, THE DRAMA, THE FACT THAT YOU’RE DOING THIS ON YOUR OWN...legends only...we have decide… July 19th! https://t.co/QJ302FB5KJ Suddenly I need a cassette player. https://t.co/5u27hassQN Anywayyyy..... I’m so happy you love the cover as much as I do! \n\nI can’t wait till you see how pretty it looks in real life. 😍 RT @filapose_jake: @IGGYAZALEA you have the best merch... PERIODT 😇 https://t.co/bmWwRxX4Dy I love! Thankyou for supporting 💗😇 https://t.co/RAARYpJTbS RT @idolator: We're not worthy! @IGGYAZALEA unveils the incredible cover art and release date of her sophomore album 'In My Defense': https… RT @MootePoints: @IGGYAZALEA is going to have a monster year... #InMyDefense https://t.co/uPMpACjovs RT @971AMPRadio: 🗣PREACH!! @IGGYAZALEA giving the big F👏U👏 to all the doubt &amp; negative voices preventing you from being great! \n\n#PressPlay… RT @azalean_alllan: @IGGYAZALEA #sallywalker #pride https://t.co/NH7ktRFWYV I will share more Merch &amp; packaging throughout the week. https://t.co/CYftj9l764 It’s a statement about women not having the ability to defend themselves under public gaze, not rebirth. https://t.co/ZgdX5vw4LF In My Defense: July 19th \nPre Order: June 28th https://t.co/LFdDdqTaVK Toooooooo fucking cute!!!! https://t.co/d1LYTeOhzD I just saw my album packaging all finished in all physical formats and I feel tingly. Ahhhhh... \nsatisfaction. \nNothing better than an idea coming to life perfectly how you dreamt it up. I really don’t know if I’m hungry or just bored. 🌼 https://t.co/EP3Rhcpaw0 I love them!!!! 😇💗👌 https://t.co/OhS7tolkGb Kim is serving! https://t.co/V7wf10dj7Q @stiffwhere1 @holylohan @bratelijaivan Just an instant grat track cause my album goes on pre order Friday. but it’ll still be on streaming etc too. It’s a mood. @stiffwhere1 @holylohan @bratelijaivan Friday!!! 😝😝😝😝😝 @holylohan @bratelijaivan @stiffwhere1 Lmao right! Haha this is from yesterday at a radio broadcast room bet hosts award weekend, i was there doing radio promo. 2 unreleased songs in Chicago and 1 that will have been out 24hrs.... you whores better lip sync &amp; act like you know! RT @LaBonneSalope: @IGGYAZALEA I’m also going by myself, so if anyone is going to Chicago Pride, holla!! Who’s going to pride in the park Chicago next weekend?! \nReply here, we need a thread so I can get all of you to push to the front barrier &amp; hype me up! \nI’m nervous! RT @people: Iggy Azalea Stands Out in L.A., Plus Ed Sheeran, Madonna &amp; More https://t.co/1i6CzwEBMn @BibleGirl666 What size shoe in women’s is that and do you know of any places that sell extended sizes for heels? I have male dancers who are wearing heels and we are having trouble finding anything besides pleaser brand stuff RT @971AMPRadio: 🚨New Music Alert 🚨 Now playing @IGGYAZALEA #Started on AMP Radio! - @McCabeOnAir #HearThis https://t.co/7rl3shxnSc https:/… RT @bradlyazalea: @IGGYAZALEA can we get the business women special? we're... business women. Don’t stomp your little last season Prada shoes at me, honey. https://t.co/p4O7Dgc3l3 RT @TheCruzShow: As Iggy said in her new single #STARTED \n\n“You started out hatin’... now you love my drip” - @IGGYAZALEA 🔥 https://t.co/vX… OMG! Yes! They turned out super cuteeeeeee 💗💗💗💗 https://t.co/pRGSISbaFk OUCH! RT @Garybhs1: @IGGYAZALEA Literally I'm gonna die 👀 https://t.co/Nf8hgzyoW1 I genuinely don’t know how anyone could live life purposely choosing to opt out on deodorant. RT @971AMPRadio: Thanks for stopping by @IGGYAZALEA! Servin’ business Barbie looks 💅🏽✨ https://t.co/9eRW3eBrFj Yes. https://t.co/K8q4xR5gzG My album cover is the most aesthetically pleasing thing I’ve ever made times 2 RT @KayKayBeCoolin: Bitch all I need is two hours with the album and you can bring me on stage. https://t.co/NdkDSBIhtL Show the day the album drops? You whores better learn these words QUICKLY! My album cover is the most aesthetically pleasing thing I’ve ever made. RT @WasabisDuckling: @IGGYAZALEA Pop up stores omfggg https://t.co/BLSIvKGlOd RT @RashionTheKen: @IGGYAZALEA @IGGYAZALEA my closet is gonna be PACKED, rent will be paid and I can still EAT!!! THAANK You Iggss 🤝😌 Okay you guys seem really into this idea so I’m gonna do it! \nNext merch that drops I promise this will be an option at checkout!!! RT @myneedyass: @IGGYAZALEA Giving us extra time to find our sugar daddies. Love that for us. Thank you charitable queen RT @jimmyxcxx: @IGGYAZALEA yes omg this is a college students dream If you could buy say a T-shirt &amp; instead of paying in full at checkout, you paid a small amount and the rest monthly for say 5months (but you get your item right away) would that be helpful to you in not missing out because you maybe don’t have that much money at one time. 🧐 Would you like a payment plan? https://t.co/L3uVzoO1dJ We coming to re-shoot ! 👀 https://t.co/l01QKRmoVX RT @bratelijaivan: @IGGYAZALEA In 10 days, we are getting the tracklist + album release day + preorder + track that comes with the preorder… And more importantly a pre order! https://t.co/Fxqfrne8c4 Y’all better go up for this old shit https://t.co/vicOiyasEG A SET!!!! https://t.co/QZs2i72rJm HEY IGGY INTRO \nSALLY WALKER \nBLACK WIDOW \nKAWASAKI INTURLUDE \nCLAPBACK \nTHANKS I GET \nSTARTED \nKREAM \nJUST WANNA \nPUSSY INTERLUDE \nFREAK OF THE WEEK / HOEMITA MEDLEY \n1800BONE/BUNX/OMG \nTEAM REMIX \nMO BOUNCE/IGGY SZN MEDLEY \nFANCY \nWORK \nCOMMES DES GARCONS \nFUCK IT UP RT @filapose_jake: Outgoing call: 1-833-DADDYS-DEAD 📞😇🎂 #Started @IGGYAZALEA https://t.co/9GGOg6sQ8L Nah I’m bout to drop 20 pounds right quick. I’m tryna be moving on stage. https://t.co/2L8rwOTOVm thinking about going back on a meal plan. It has to be done. RT @AltaLoma99: My STARTED merch came today!!!  I finally feel rich!!! 💎🎂🐩 https://t.co/FejZHvjpsH Omg whyyyyyy didn’t I see your tweet earlier ughhhhhhh 😩😩 https://t.co/JyvVUs2jiO New posters on the web store! https://t.co/jHQXxHCfSn What’s the difference between yours and mine? \nCredit cards that don’t decline... https://t.co/xDaoUdlnZj NEW Keychains just got added to my shop as well as posters! \nhttps://t.co/Gw6X4nnXN3  💗💗💗 https://t.co/oNqMDPdTGu They are finally done!!!! \nUgh bedazzling is a pain to do but I hope it’s worth it - I love em!! https://t.co/VhXyKfKRpW @KayKayBeCoolin Lmao I will consider it just for you. \nShit is hella annoying it’s like we forget the idea is to expand the fan base and not just maintain a small one. if I gotta loose a handful of fans now in order to have a roll out that is attractive to a bigger audience I’m good with that. Like this tweet if you want to go to hell. Making good video concepts is so much pressure ughhhhh \n\nIt gives me anxiety but I’m kind of addicted to it?!\n\nWhat is wrong with me. Lol There will be lots of new dates where you can see me at soon! Check back next week 😝💗 https://t.co/amOSKueqi3 RT @queenkimeow: @IGGYAZALEA Ma’am I was there. It was awesome! https://t.co/QN3axMzpn9 RT @callieazalean: @IGGYAZALEA only the OGs remember this!!!!! Not many will remember but when I dropped TNC I did a small one off show at the Fonda in LA &amp; it was the biggest hot mess amazingly fun time ever. \n\nI’m definitely doing another 1 night only show for this new project. I haven’t announced a release date yet! 😂🤷‍♀️😝💗 https://t.co/vG3rEYVSGx I miss @VanessaVanjie Love you - Thankyou!!! https://t.co/W0eNYQt2kb The store is up! \ncheck all the shirts under the “pride” tab. \nthey are the ones you can purchase to support the National Center for Transgender Equality. \nAll my profits are being donated to the NCTE So let’s sell out! \nHappy pride month. 💗🏳️‍🌈 \nhttps://t.co/Bs6Cp7DOH8 https://t.co/Fub5SQ56vU The shirts come in baby doll shape (sized in women’s) &amp; then a standard t-shirt shape (sized in men’s) Hey guys I’m back because today I’m launching my special “started” merch for Pride month! \nI’m really excited to be donating 100% of my profit to the National center for transgender equality. \nHere’s a lil preview of my favorite shirt 😊 https://t.co/r7Nd5PhHKb RT @AZALLION: @IGGYAZALEA same. thats why my last post on insta was last year Haha nah! I only really post when I’m doing stuff, when I’m at home chilling I don’t have pictures 🤷‍♀️ That’s when I go on twitter! 😝 https://t.co/OF8uMk3mVG RT @IrishAzalean: 🚨 35 MILLION VIEWS!!! 🚨\n\n🎂 #STARTED 🎂\n\n❤️ @IGGYAZALEA ❤️\n\n▶️ GO WATCH!!!: https://t.co/ac7ZFBF3fq https://t.co/0GhdZlCRuF Oh no! Mike you’re now part of an exclusive group of locals who don’t know when shit I say is a joke. 😂🤷‍♀️😝 still love you! https://t.co/TeAHH8fUU4 I’m hype too! Who’s coming to see me for Pride in Chicago?! https://t.co/qrTT3S9XtB @largaryen @VVAVESOFFICIAL It’s hemi not semi 💅💗 https://t.co/7WzbBlqVWu Today’s look: fashion witch RT @IrishAzalean: 🚨 34 MILLION VIEWS!!!! 🚨\n\n💜 @IGGYAZALEA 💜\n🎂 #STARTED 🎂\n\n🔊 GO WATCH!!: https://t.co/ac7ZFBF3fq https://t.co/xYj0x9ZSmO @trixiemattel @AzaleanIndo Wow, youre really tryna take all the food off my plate huh? RT @feedthewolvez: Comme Des Garcon already my fave on the album. We- https://t.co/71WAccI9MK Thankyou. You’re hired https://t.co/8QgzfAUFC2 😂😂😂😂👌👌👌👌 https://t.co/Up4i1Kcoat Just realized I low key look like biblegirls sister in my album art, please don’t sue @BibleGirl666 😂🥵 Suddenly my next video is going to have 22looks I’m about to start double booking myself! Hahaha https://t.co/9DEhI9F4g9 Yes lovers!!!! https://t.co/ESeJ0NZESe This bitch about to murder me and take my job! 😝💗💋 https://t.co/zSWRIyXnKu She did that!!! https://t.co/F9vD9NG0Wc Wooo hooo! You got em ! https://t.co/89StjwDIQb @HEYRAFl Lol right why a picture of me mid blink ? Hahaha Farewell Paris 💋 https://t.co/3elBuTW1Ks RT @bawbbysworld: me listening to all the other signs crying because it's gemini season ♊\n https://t.co/hFYdMhIVeD RT @idolator: Get ready! @VVAVESOFFICIAL &amp; @IGGYAZALEA's \"Boys Like You\" is shaping up to a fiery fuck-you anthem: https://t.co/6eNHqSYSfO… This is so cool! Please check it out ! https://t.co/gISpF2Iju9 não mexe com a gente !!! I like to pretend I’m traveling with a child so I don’t feel stupid about ordering off the children’s room service menus in hotels. RT @IggyWorldNews: #STARTED by Iggy Azalea has been added to 2 more Spotify playlists: \n\n• Shisha Lounge (+396k followers): https://t.co/I5… Im in Atlanta, had to switch out the wraith for the hemi\nsitting pretty \nInstead of stupid &amp; silly \nFuck boys like you! 😝💅\n\n@VVAVESOFFICIAL I’m ready! Who could It beeeee scheming with meeeeeee 👀😱 https://t.co/R4tWXhJn3u Wooo hoo! Friday here we come \n😝 https://t.co/7sCo5bLuay 💗it looks bomb! https://t.co/ThkjtsWCwP Hi Paris ! RT @IrishAzalean: 🚨 31 MILLION VIEWS!!! 🚨\n\n💜 @IGGYAZALEA 💜\n🎂 #STARTED 🎂\n\n🔴 WATCH NOW!!: https://t.co/ac7ZFBF3fq https://t.co/eQarHZN271 Yes you got it right! https://t.co/C0rZzs3tFQ Yes! https://t.co/RPvertrseK I’m scared too. https://t.co/tYEXVyFjfL Unfortunately. https://t.co/Xqa316xuQ1 I don’t think they get a say in it cause it’s all gossip from the tech crews themselves. https://t.co/eAP9DyXHmL I was going to go offline until I watched game of thrones but then I remember I already read the leaks a week ago so it’s fine. \nyou can’t spoil shit, I self sabotage. If you’re a bitch to me and you trip and fall on your face I reserve the right to laugh at you. So happy that started has been added to a big YouTube playlist! Yay! Please watch from the playlist today if you haven’t already 💗😝 https://t.co/DKj2jTpdPe When people enjoy my cooking it makes me so genuinely happy. We can after it’s over. \nI’m going offline until then, see you at 10.30pm when I come back to announce my clinical depression due to the ending. https://t.co/n4LqcdyqqZ I’m definitely doing them for you guys! I’ll try to pre order them on my site so you can get them quickly. https://t.co/MZRaawyVgH 😇💗🥵  bring on June my favorite and best month of the year. https://t.co/XbCxfrI7p2 I have some magazine shoots coming up but you guys won’t see them for a little while cause things are always done far in advance. https://t.co/IQRAMtUoxH RT @babyphantastick: Ok @IGGYAZALEA  we still in there! #Started #StreamStarted https://t.co/NFMjaU8Gfv RT @shaneszn: me when someone explains that poor diet and sleep schedule are the reason I’m tired all the time https://t.co/MERzpuuN9c Yes, we have to release in peak fuckery. https://t.co/C3why1D98D Fun Fact: I don’t give a single fuck Keep streaming on whatever app you like most (Spotify, tidal, Apple Music, Pandora etc) 🥳👌 https://t.co/1WAwiZoyZ0 💗 https://t.co/RtjC3ok09a Imagine! The plot twist the right wing never saw coming. 😂 https://t.co/1Nu5U9Qiaz Is this me as a man because I look GOOD https://t.co/n7FEnM75O1 RT @trixiemattel: The power that that has... 💛 https://t.co/sDz67GwJXG 🥳 https://t.co/2vsMgCO91N Wait... what?! https://t.co/6Rp1lMXyV2 😈 https://t.co/3KcLfhvHH3 I whole heartedly believe my Merch this era has been extremely cute. I’m going to be in a @brookecandy video and I’m so excited. RT @IggyWorldNews: “Started” by Iggy Azalea has been added to one of Spotify’s major playlists, “Beast Mode,” a playlist with more than 5.8… Yes of course! I signed them ALL this week. I think literally all the sally posters left are signed now. \nHahaha https://t.co/BCLck7Dn7l 🥵🔥 https://t.co/GkDqYwAVZG The daddy rhinestone in the standard unisex shirt shape. \nPosters, keychains, and another shirt with glitter lettering! https://t.co/tNpH4kH1zR Love you Thankyou for supporting! Make sure you send me a pictureee 😇 https://t.co/4tA1hCGcVJ Love it and love the uniforms !!! 💗 https://t.co/DSGG4z1SAZ Yes! I changed the sizing from the last run of Merch so what was small (your hoodie) is now sized up to a medium. That makes the sizing now more “true to size” https://t.co/ctFnhkquoq True to size! https://t.co/bYvEXg7iLc STARTED MERCH drop is here!!! \nhttps://t.co/S7FNfX5uJs RT @VVAVESOFFICIAL: BOYS LIKE YOU ft. @IGGYAZALEA out May 24th I DON’T THINK YOU’RE READY #iggyazalea #vvaves https://t.co/8GPIxd22nV I miss youuuu https://t.co/5lIQfDDQXL Who’s ready.... 🥵 https://t.co/53JY6nP4vj RT @Manneee_: Ayyyyy #Started is at the top of the list on beast mode @IGGYAZALEA ❤️❤️❤️❤️❤️🥵🥵🥵 let’s keep streaming!! https://t.co/V6RFWEN… Noooo https://t.co/hCMwxhMbPk Hehehe I’m a bitch Please join my\n\n“Oh god no, please, anyone but bran, no, I’m begging you” support group for all game of thrones fans concerned he may be the plot twist ending. If bran is king I’m going to RIOT! No one: .......\n\n........ .......\n\n....... \n\nMe: \nOkay who wants to talk about game of thrones some more? Yes Vanjie we love you Queen. https://t.co/tdImLjtsAx RT @fernandocoelhox: @IGGYAZALEA Looking forward to seeing you in chicago, love you 💙 That’s what DADDYS A BITCH is really about ie. \nDaddy has a pussy.  😂🤷‍♀️💗 https://t.co/8bxbjEj1i1 See you in Chicago ! https://t.co/V64yT9JXgA No, next week which was why I wanted to show you them now Incase you prefer it to the normal colorways im launching tomorrow on the store. https://t.co/UcCyZ1cuyn Yup! 100% anything less would be all bad! Happy pride month I can’t wait to wear one in Chicago 💕 https://t.co/SLKkaSaQZo I want to show everyone the Charity/pride colorways for the started Merch; Incase you want to wait until they're available on my site.\nThe rainbow colorways have 100% of profits donated to an lgbtq charity &amp; in depth details will be posted when I launch them on my site. 😇💗 🏳️‍🌈 https://t.co/j2GZ4sMpv9 I’m a Gemini we are the petty champions. 1 hour is up but that was fun! \nAnyway - launching Merch store tomorrow am 😇💗💋 Wooo! This is awesome guys! \nPlease let’s have a streaming party and listen on this playlist! https://t.co/GMBBbyo8nt Also pps. \n\nIf youre a woman (particularly disgusting if you are) against the right to abortion because “god” didn’t intend to put that in his plan blah blah - \n\nLet’s also make sure you personally NEVER \nhave access to ANY fertility treatment that you may need to reproduce. I’m not here for a lot of shit that’s happening in the government but the main thing I’m exxxxxxxxtra not here for is pushing Christianity onto everyone’s life choices via the law. \nEveryone doesn’t share your belief system, stop forcing it. \nGo away. If religious people want to site \n“Beliefs” as their reason for not doing shit like vaccinations etc. \nwhy can’t I site my non-religious \n“Beliefs” as the reason I wanna personally opt outta shit - like banning abortion. Its looking like the Merch store is going to be updated tomorrow, yay! Keep watching every day! https://t.co/XXtvbpN60m 4 more days until game of thrones ending - just put me out of my misery already. Ughhhhh RT @xoxoluv4iggy: Chicago, are you ready for Ms @IGGYAZALEA !!! June 29, Grant park.🏳️‍🌈🔥💕 https://t.co/R0opxGjcsa RT @shaneszn: She’s up. Room complete. https://t.co/5oTicIbPW5 RT @iggyazaleabraz: Billboard Digital Song Sales 🇺🇸\n\n24. Iggy Azalea - Started (NEW) https://t.co/9lLtFt2lDM I would be totally fine with this option! https://t.co/KcFqXX6CYb Anyway I already doubt it will be Jon so it’s fine. Ugh 1. He’s boring but he’s also not a serial killer \n2. He refuses to fuck his family literally AND figuratively \n3. Starks for life! (I don’t care who his real daddy is, his daddy is NED!) https://t.co/JYUIv2ppl2 I need Jon or Sansa on the iron throne only! https://t.co/q23bYVbjnV RT @SerLadyBrienne: @IGGYAZALEA I read them last week. https://t.co/AlBTMjfxkM @Phoenix_Five How come the crew only report 1 ending then? They flew a couple of body doubles around trying to throw ppl off. I don’t want it to be bran but watch it be bran I really just read the reddit game of thrones spoilers. 🥴 I want a lemonade flavored popsicle BAD. That’s it. I’m wearing jeans and giving you 1 look in my next video. https://t.co/egfUFa3U1i RT @Manneee_: I still have much more to add to fill my wall, this is just a start! ❤️❤️❤️ @IGGYAZALEA @IGGYAZALEA #Started #INMYDEFENSE #Sa… You did this to me 😡😤 https://t.co/qNsDvkl4L1 😱 https://t.co/jkT0rtANZi Now I’m reading online hair can pierce your skin and it can get stuck in your foot if you walk barefoot in your house. \n\nThis is so strange! I thought I had glass in my foot but there was only a red bump.\nI cut my foot open with a cuticle trimmer and thought I saw a black splinter but I kept pulling with tweezers and it was an inch long black hair. What in the fuck. \n\nSo you mean to tell me I was abducted by aliens? I know. That’s why I’m ugly 80% of the time - \nI’m too lazy to be hot. https://t.co/oB5jq4dkW2 Having hair really is the most annoying shit ever. @joydinii Are you really that stupid? \nI have a thousand times. \nIf people are this dumb and ignore that, don’t expect anyone to not troll them and at least have a sense of humor about what’s actually just someone spreading a story to try and hurt my feelings. RT @PopCrush: .@YouTube United States Trending chart:\n1. \"Me!\" - @taylorswift13 + @brendonurie\n2. \"Started\" - @IGGYAZALEA\n3. \"Go Loko\" - @Y… The clean and dirty and both available on iTunes 💕 https://t.co/XTsjsE6JdE RT @IrishAzalean: 🚨 17 MILLION VIEWS!! 🚨\n\n🔥   LET'S GET TO 20!!!  🔥\n\n🎂 #STARTED 🎂\n💜 @IGGYAZALEA 💜\n\n▶️ CHECK IT OUT!! ▶️: https://t.co/ac7ZF… RT @Tghx__: @IGGYAZALEA really be giving visuals !!! 😍 💗 https://t.co/YmQGZEONnW RT @brinnnyvibes: We can legally pull the plug on people who are brain dead even when they have heartbeats because they are legally dead. W… RT @MakeItRayn_: If you want to reduce abortion rates:\n\n-Make birth control accessible and inexpensive\n-Fund Sex Education programs in prim… RT @TheNormaJeane: @zachdcampbell I have found my new show. \n\nI love the behind the scenes and interview with @IGGYAZALEA RT @wavvybarbie: I feel like @IGGYAZALEA really has grown and is in her full happiness rn. She is in her prime and will RESPECT HER RT @_TrueGemini: Thankyou @zachdcampbell and @IGGYAZALEA for this entertaining behind the scenes video.  I really enjoyed it!! ❤️🙌🏾 RT @stewphoebe: me looking at @IGGYAZALEA's wig 🥴 https://t.co/3FzBlLvFNQ RT @123meatloaf: Been singing \"I started from the bottom and now im rich\" all day, just to come home to my power being shut off 😂😂 @IGGYAZA… RT @largaryen: OMG this is me trying to learn the choreography of Started and trying to be sexy like @IGGYAZALEA lmaooo https://t.co/9vWTiW… Make sure to watch me spill a little album tea and let @zachdcampbell check out the set to my started music video here! https://t.co/vgvuMk1K8Q RT @Justinn_Parker: @kashdoll @IGGYAZALEA https://t.co/qrd9e0DROE RT @theyloveloco: Bitch @IGGYAZALEA wig is fucking 🔥🔥🔥‼️‼️‼️ she so sickening https://t.co/WqGJW434jl RT @HozayyyE: @kashdoll @IGGYAZALEA 🔥🔥🔥🔥 https://t.co/BDLdE5nUsj RT @Jacquell86: @kashdoll @IGGYAZALEA Yasssss https://t.co/D5w0xS21XF RT @kashdoll: Yes bratz I’m on @IGGYAZALEA upcoming album 😁 🥵🥶 https://t.co/N2CfvhSd7j RT @grandemarlz: I feel the same😂👏🏽 this had me screaminggg @zachdcampbell @IGGYAZALEA https://t.co/7Q9je82IQd Things are on the up &amp; up \n(As my mom would say) lately. \n\nThanks for all the support. \n\nI love you! 💕 I’m going to Paris this month, \nThinking about doing a merch pop up 🧐 Make sure you check out the behind the scenes video for started on Zach’s YouTube today! https://t.co/3bI6uViN4D RT @kaylanecholer: Just finished the #STARTED poster for @IGGYAZALEA 😊\n\nInspired by @luisunleashed 🐇\nSince Iggy loves Space Jam https://t.c… Yay! Moving on up each time! \nWe won’t stop 💋\nUK I see you 👀 https://t.co/Gt0NE3u66Q Yes! Thankyou - only the best for me and mine! https://t.co/zS0Ee4KMPf Who can the people take this issue to that will see sense?  \nWhat can we all collectively do to push back on bills like this that would make a difference? \nI’m so concerned, lately every other day I see a bill passed like this. https://t.co/QUdxEWL3o4 RT @inpythonissam: @IGGYAZALEA Call me back after 9pm 🤧 I remember being charged 50! https://t.co/yED57oAWTZ I know a lot of you are too young to remember but \n\nCan you fucking believe we used to send text messages and they were never added to one thread per conversation in your inbox?! \n\nIt’s was just a hot pile of shit for you to sift through for years. \n\nDark times. RT @IggyOnCharts: iTunes US — Songs:\n\n#43 Started\n\nMusic Videos: #1\n\nApple Music US — Songs:\n\n#293 Started\n\nMusic Videos: #95 https://t.co/… Good news today 😄 RT @officialcharts: The UK's Official Trending Chart: @IggyAzalea's Started is one of 10 new releases that impact this week https://t.co/yA… RT @thenewclassic_d: Billboard Rhythmic Songs: \n\n#27. Sally Walker - @IGGYAZALEA (+3) *new peak*\n\n(Peak: 27 | Weeks: 5)\n\nKeep buying, strea… RT @IggyOnCharts: iTunes USA - Music Videos:\n\n1. (+1) Started — @IGGYAZALEA *new peak* https://t.co/CxJLtxhGvE RT @IrishAzalean: 🚨 13 MILLION VIEWS!! 🚨\n\n💯 IGGY INDEPENDENT 💯\n\n🎂 #STARTED 🎂\n💜 @IGGYAZALEA 💜\n\n🚨 WATCH HERE!! 🚨: https://t.co/ac7ZFBF3fq htt… Yes it’s very weird but also \nKinda. \nstrangely hilarious? https://t.co/DMEG1DWDGt Girl, I’ll give you a pass! \nDon’t sweat it 💗 see ya there! https://t.co/GIS0D7Culu It’s true. I don’t take that lightly. https://t.co/xxW3zscdNw I liked Gaga’s overall cause the whole thing was great but I actually really loved Naomi and Gigi https://t.co/7owfm06NGZ Right! Why isn’t anyone writing about this? https://t.co/pgcUZvQQ3w Welcome to the dark side. 🔥 https://t.co/RfbuaB5sOz That’s clownery luv https://t.co/VMlxenss6Y @ricktrbl Acrually your ears look great now. He did a great job Why can’t this be real I want it! https://t.co/rbROVqaVLf What do we collectively need to do to get Walmart to restock the Patti LaBelle vanilla pound cakes.\nI can’t believe they aren’t in store anymore, and now I’m baking one from her recipe book (which we all know I’m gonna fuck up) cause I’m that desperate. RT @sometimesrem: you asked for it and we delivered 🎂\n\nthis friday (3.10.19)\nyou don’t wanna miss out \n\n#STREAMSTARTED #STARTEDSTREAMINGPAR… RT @Ya_Fav_Flava: Started by @IGGYAZALEA is my 💩🤷🏽‍♀️ RT @m00kiee: started by @IGGYAZALEA is a motherfUCKING BOPPPP 🗣 Thanks! https://t.co/vXv2NzuhW6 Keep streaming guys! Let’s have a great first week 🤞💗 https://t.co/IuLkU2XKuj RT @mario_xcx: me judging all the met gala outfits even though I wear vans jeans and alternate between 3 different shirts all the time http… RT @DerekLuh: That new @IGGYAZALEA song n video  hard af RT @bloodlinethief: @IGGYAZALEA I wanted to see RUPAUL in Drag there There can only be one winner. \nGAGA. \nShe gave a performance! \nBut Katy was next for the throne. https://t.co/cM513GwXKO She also was top 5 https://t.co/Zt1h6lMGDf Anyway charli, dress like that every day bitch I’m here for it. \nAnd Gaga. You win. Bye! Listen I know I’ve had some fucking horrendous carpet looks in my time so who the hell am I to say shit blah blah blah BUT. \n\nThe theme is CAMP. Not prom. \n\nBetter to go nuts and look crazy than to look like you scurred at the Met! Yeah I’m driving there now luv https://t.co/H0TLc5YYjf RT @badbisexualbit1: y'all can't even lie @IGGYAZALEA is, and always has been, that bitch. her songs hit hard af. periodt. RT @forreignfeen: @IGGYAZALEA’s music as alwayssssss been a bop!! lets argueee 🤩🤣 RT @grandeshorny: - yes? met gala? can the next person come? i’m starting to run out of dresses #MetGala https://t.co/pcbllLKyDG Yum this meal she served is so tasty. Mmm mmmm mmmmm \nGood! https://t.co/tWDcto3hSH RT @PardonMyTake: Iggy is so back https://t.co/dQV83QKkCt RT @bawbbysworld: ONLY THE BEST 90'S KIDS REMEMBER https://t.co/NDTp8Y2qY8 RT @JWhiteDidIT: Time stream “Started” i love this song a lot like Fr Fr RT @IggyOnCharts: iTunes USA:\n\n26. (=) Started — @IGGYAZALEA *green update*\nhttps://t.co/WjCKJ3ZEAb RT @IggySapoi: Just signed up for @TIDAL and they have #STARTED at #6 for their suggested new tracks (the first playlist that shows up). Th… @peuliveira Me having (hard earned) money of my own or a video with a lot of views doesn’t make me some how not an independent artist signed to a label I own, and distributed via another indie label (ie. Not upstreamed via a major) sally &amp; started have no product placement. Lol @wade6000_ @Nikola_TM Where’s all my sponsors? Tell them to call me please I haven’t received their checks in the mail https://t.co/dcjRCKhyct RT @suicidalromeo: @IGGYAZALEA im really excited to see her at the met gala she always serves looks Lady Gaga. \n\nThat’s it. That’s the tweet. If you say you hate cheese but I see you gobbling down some pizza or slice of cheesecake I’m gonna feel like you’re full of shit. \n\nThat’s the same way I feel about ppl online when I see them happily consume different versions of something they just said they flat out can’t stand I better see some drag queens on the Met carpet today. RT @FallenAngel1256: @IGGYAZALEA I want that started hoodie. NOW. RT @7RlNGS_: @IGGYAZALEA Is the “started” written in diamonds?😍 I have done a mix of baby doll &amp; standard tee fits this time because I wanted to make sure we included that 00s tee cut! \nThe pride merch (as you know is for charity) has both base t-shirts too (baby doll &amp; standard tee) https://t.co/D2sYGZRxUx Anyway since I know it’s way too costly and time consuming for anyone to rip me off - \nHere’s a little sneak of a few of the stoned items 💗  \nI’m pretty obsessed. \nAll the stones are iridescent too 💅 https://t.co/d1thSzolNV So. because I’m extra as fuck &amp; want to bedazzle shit I was told it’d take 97 years to make merch. \n\nI’m sourcing locally instead so I can get you your order in time for June 🤞+ looking at whos replacing that 🗑shipping company. \n\nHoping to update my store mid of the week 😆 YES! But let’s do it tomorrow cause tonight is GoT https://t.co/I0nSX6Ey8i I think it’s great to listen etc on any platform that counts! \nEspecially since I don’t have any playlist support from the major streaming platforms. https://t.co/b6TepIYc9x RT @LalisaMatthew: Iggy protect me I’m scare\n@IGGYAZALEA https://t.co/81oTmYURX7 Make sure y’all support on amazon if you have an account. 💗 https://t.co/g6wR6YQ3uY @yikesroxi Verse 2: \nDo you hate ham but love meat or like eating salami ? RT @yikesroxi: @IGGYAZALEA AHAHAHAH OMG YES. IM OMW Have you watched #STARTED yet? https://t.co/BqHQ6L2xYo @tropicsass I’m sipping the tea is hot! 😂🤘 If you don’t say it with ya chest you ain’t doing it right!!!! https://t.co/sFtx45JUA3 RT @IggyAFanbase: iTunes UK 🇬🇧: \n\n35. @IGGYAZALEA — #Started (+1) *New Peak* \n\nYoutube Trending UK 🇬🇧\n\n1. #Started (=) https://t.co/kJuYiz7… @JeremiahTaylorr @BeatByBenally @tartecosmetics Right and it really isn’t! Makeup has never been used by women only throughout history. @JeremiahTaylorr @BeatByBenally @tartecosmetics These women are so basic, it’s not a vaginal product they sell - its makeup - it’s for people with a FACE. That’s all you need to wear it. Literally. RT @Kawdeeuh: @IGGYAZALEA I’M MFN STARTED 😍😍😍 RT @itsjackjordan: Is it me or is @IGGYAZALEA back with a fucking vengeance #Started 🙏🏼❤️ 🥰 https://t.co/FLKg21wz3h RT @velvetwink: Can you believe we only had about 10-15 minutes in between each scene to change the makeup? She wore the same base makeup f… RT @sentimentalhoe_: My life since I was 12: https://t.co/t01PbUTo1Q RT @Theprepguy: This is legit the most iconic rap music video of all time 😭😂 @IGGYAZALEA\nhttps://t.co/LjDZshpgKz\n#STARTEDMusicVideo #IggyAz… RT @bitneedy: @IGGYAZALEA https://t.co/b4a8RXFufB I don’t actually give a fuck about other people’s opinions; \nI just can’t turn down the chance to tell someone they’re a dumb bitch. \nIt’s in my blood &amp; there is no cure! I’m drawing my eyebrows on today so people can see my true feelings. RT @Princess_laj: Iggy really made a music video about killing a sugar daddy 😂 I’m inspired RT @IGGYAZALEA: im a bitch and i love being a bitch. RT @hernameisfefa: My brother just came back home and he told me that was listening #STARTED on the way.. and he felt like a bad bitch😳.. a… I think it is kinda funny how locals think they are better than y’all because you have a Stan account. the big joke is they’re on an app almost entirely full of Stan’s who would rather die than become a local tweeting about inspirational quotes and double bananas. https://t.co/k4wsDxQh5W RT @trxshyboy: @IGGYAZALEA Started is highly addictive like I’ve already streamed it 105 times Love that for you 😂 https://t.co/IWMT9KztLT RT @kingsleyyy: Iggy’s new video is simply... great. She continues to have one of the greatest and strongest videographies of any female ra… RT @Hot983: How much are you loving STARTED FROM the queen @IGGYAZALEA ?? Let us know what you think... #StreamStarted #IggyAzalea #Started hahahaha. the little one is my bfs the big one (courtney) is mine. the person told my bf it was a girl - but its a boy. hahaha https://t.co/aVLNFStT1C I never posted a track list. I posted a video in the studio &amp; y’all saw my “working on” white board and ran with it.... 🤷‍♀️ https://t.co/35D1FvF7oB That sounds lovely. https://t.co/rHWMGUivMS RT @JokaGP13: @IGGYAZALEA Your mood: https://t.co/Rnu0t3BV2v I already fired them a week ago. I just wanted to know why no one was getting their signed posters from the competitions. Anyway I will sign more don’t worry. And have the NEW COMPANY ship them. https://t.co/vyPvc0RWEY Literally https://t.co/5A2eDRNlE4 Wow imagine how shit the shipping company is who was packing my Merch. \nSo you mean to tell me I signed 100 posters and you lost 100 posters.\nI have to laugh. https://t.co/gsp9Va4rUS RT @unsebastian_: Bitch still #1 trending in YouTube she just #started @IGGYAZALEA https://t.co/FQvd9zyvm7 RT @dioguloso: Iggy Azalea - Started https://t.co/7RDKsyBFjW Yeah the 4th episode is the 3rs to last episode what’s not clicking, it’s mathematics luv https://t.co/lWqh5ldOpX Wait. Hahahahaha I just realized today is Saturday. Wow I’m really about to cook a tasty delicious dinner and watch game of thrones tonight for the 3rd to last FUCCCKKinggggggh gjkindsvthndhbssdfk Hahahahaha witty https://t.co/KXyTEMTjfY RT @cakesonmiley: Me when my mom asks me why I look so different in real life vs my photos https://t.co/Vnl8ajhmk7 Yes! https://t.co/0gLUuXaoKG What can I say? I’m for the people. https://t.co/0stxQM6haB If the selfies you delete are the real you then the selfies you face tune are you in the future when you’re rich. I rebuke this. https://t.co/RRjRVjEzSs Yup mudbrick house in a town of 3,000 with nothing all the way to being a self made millionaire half way across the world - hi good morning! https://t.co/F5KELLErOC RT @mowaywayway: I love @IGGYAZALEA ’s new music video “Started” 💅I feel rich already💅 https://t.co/ryGUjXqvCM Omg who drew this? Did you? And yes if you’re supporting started we are cousins https://t.co/ifjDfeMyHV Hello! Really can’t get over it. https://t.co/Y72E2R0PMm RT @IGGYLIFE: #1 trendis brazil, congrats mama. @IGGYAZALEA #started https://t.co/PPBfgRrUWt RT @rachelpage_: so obsessed with the visuals in @IGGYAZALEA’s latest video. a dream. literally a dream. https://t.co/9jjJZ7QQqo RT @JHartMusic: Miss @IGGYAZALEA is really coming for every hair follicle this era quite fucking frankly. That money print outfit, I- https… Wow! It’s would be amazing if iTunes added it to best of the week! @AppleMusic https://t.co/sXPHW4ySc1 RT @ohhoeney: @trixiemattel @JamesHarness @VanessaVanjie oh https://t.co/XLwEf0ks3I RT @trixiemattel: @JamesHarness @VanessaVanjie You can basically see me in half drag staring out a window while they are doing choreography RT @itsiggyiggzz: #1 trending in UK 💅🏼 https://t.co/C8ZvVvoWeg RT @TIDAL: Dropped: @IGGYAZALEA. \"Started.\" https://t.co/928iTuN2Xj https://t.co/9j7FijuCdx RT @jaclyndanielle: I really REALLY fuck with @IGGYAZALEA new song, it’s just such an anthem RT @billboard: Iggy Azalea released the wild video for her new single “Started” #BillboardNews https://t.co/38xri7y5zD 💗 you Queen https://t.co/MUoIBc7sZP RT @WorldOfWonder: 🎂 You started out hatin’, now you love my drip 🎂 @iggyazalea just dropped a WILD video for her new single, Started, and… RT @NickyParisBitch: The new @IGGYAZALEA video is incredible RT @Youngrayray_: @IGGYAZALEA “BUDGET? We don’t know her “ 😂😂😂 https://t.co/3542Mkbw0u Send me any reaction links you guys know I love watching ! Thanks ! https://t.co/KPAnoKr8bh RT @leslietingz: @IGGYAZALEA #FanArtFriday https://t.co/3LbGfe2vnH RT @nickisinches: @IGGYAZALEA stay positive love RT @ChrisMMinaj: @IGGYAZALEA Look my drawing for you 😊💗💗 i love u 💗💗 @IGGYAZALEA https://t.co/jnRxGd8jm0 RT @srrygrande: @IGGYAZALEA #STARTED to get these in my dms https://t.co/tL9Ejbmiwz RT @murilolinoz: @IGGYAZALEA hey sis, i did another draw for u https://t.co/Va6VCrutBc I’ve been following ppl all day &amp; I’ll keep following ppl showing love all week. 💗💋 https://t.co/3cecktEbyI RT @JamesHarness: I am absolutely here for this especially the @VanessaVanjie and @trixiemattel cameos. 🧨 https://t.co/WVTEyMXXwv 💗 #Started to feel like they missed me a lil 🤷‍♀️😂 https://t.co/ET0fyYcX2K 😬😫💗 https://t.co/Wu0UWXFdnh Andddd I’m awake!!!!! https://t.co/WHkvbfDZhJ I’m @ing you to say \nI know ! https://t.co/CfteMrADOO Cause I do all the post production stuff myself, Colin says I’m better at editing than him 😂😬🤷‍♀️ https://t.co/Rt8olMNHrO YAY! TOP 20 WE DID IT GUYS! https://t.co/fBtestQ4PP RT @idolator: The hits just keep coming. @IGGYAZALEA gets everything right on \"Started\": https://t.co/kglzhxHcp7 https://t.co/mLMT0VjjHL FOREVER MOOD https://t.co/ta74lWjzUi sassy. https://t.co/KDZHZmGA34 😔 i know! it sucks. i hate it. https://t.co/J3KJMB9doJ just an afternoon but i really enjoyed doing that style of dance actually. \nIt was a different was of moving for me compared to twerking type vibes.\ni really loved it. https://t.co/Fksl8JzUeV 😈😝🖤 https://t.co/NlMruW94Xv RT @Doseofvee: @IGGYAZALEA went off today with the new drop. I’m obsessed #STARTED RT @_Ray408: Iggy &amp; these videos are KILLING me! Omg Im SO fuckin glad she’s back. I missed her 😫. @IGGYAZALEA #Everything. theyre super cute huh!?!?! love these stickers!!! https://t.co/yV0Qy7U5WM awesome the instagram stickers are finally working!!!! \nby the way if you want me to see something on IG tag #started cause thats the only way i know how to work it thanks! https://t.co/DnWzvxCwUj awesome! love this! https://t.co/OFjG8nSBgu RT @dazalean: @IGGYAZALEA me when i hear the doorbell ring and i'm on my undies haha right! we did as many changes as we could within 10min time slots. https://t.co/15KsUl0soD THIS IS SO REAL. https://t.co/wg07CNa25T yes top 20 here we come i dont give a fuck if we in there for an hour bitch we were at the PARTY https://t.co/I9qnGRpgkE OMG i LOVE this!!!!!!! yes!!! https://t.co/TjkT62o5dG RT @IGGYIGGZ: 1833-𝓓𝓐𝓓𝓓𝓨𝓢-𝓓𝓔𝓐𝓓 ☎️\n\n#Started is out now!\nfan art by me! (ig: 𝐡𝐚𝐮𝐬𝐨𝐟𝐝𝐫𝐚𝐰)\n\nwatch here: https://t.co/F4zGqNeIiX \n\n@IGGYAZALEA… RT @Ronaldgabrieel: When @IGGYAZALEA say: “I started to say sorry but fuck that shit”. I feel that shit #started thanks boo https://t.co/ZAkDSgp3OA RT @GOLDENVET0S: You better ask your gps I ain’t the one to address \nThis bar hit different @IGGYAZALEA https://t.co/ywqiuUsvDH RT @IssMarz: “if you wake up in the morning and he makes you dread, and you love to go shopping but you don’t like to beg. if your names in… RT @_alvarogonzz: You are number 3 on itunes spain🤑🤑💛💛✨ @IGGYAZALEA #STARTED 🌈🎂✨ https://t.co/s56IZG6aaz RT @IggyWorldNews: 11 looks.\n\n1 music video. \n\nThe video for #STARTED is definitely one of the best &amp; most amazing ones you’ve ever release… RT @prismou: .@IGGYAZALEA at STARTED music video\n\neveryone loves her drip 💅👠💸\n\nlet's stream and buy! #STARTED #StartedOutNow \n\nartwork by m… RT @trixiemattel: Iggy Azalea - Started (Official Music Video) https://t.co/aj7UGmWubP via @YouTube You guys know the dog house thing was just a joke and that this is really an actual house for a person... 🤷‍♀️😂😬 https://t.co/s2Va1r9gh0 Funny you should ask! It’s actually custom Laquan Smith and is a print of women’s mug shots. I wear the same print of fabric on my album cover. https://t.co/oPkjUNA3ha I feel like someone else would have this answer  better than I’d type it - can I get a knowledgeable comment under here please!  😬😊💗 https://t.co/ZWAIiZMBCR 🤷‍♀️ There’s honestly nothing I can do that’s on them https://t.co/43nZxtbLIu That would be great! Maybe we can do that and see if it works 💗 https://t.co/l0bJ8VaPd0 I guess they don’t think it’s the best of the week https://t.co/Rw5pnVndq8"}