{"tweets": "It worked!!! Congrats!!! 🤘 Okay @TexasFootball, I left some energy floating around in Austin. Find it and use it if you need to today. To get it just say Texas (fight) and throw in a Fallon (tonight). I’ll be watching. Hook ‘em. 🤘#ThisIsTexas #HookEm #FallonAtUT All I need is an invite. London? https://t.co/WAIc1VYeXJ Let’s keep making moments like this. Thank you all again. #FallonAtUT https://t.co/SST5tU0vtb RT @TODAYshow: .@jimmyfallon is going back to college! He packed up @FallonTonight and brought the show to the University of Texas where he… Austin stay Austin. Thanks for the trend! #FallonAtUT Here’s mine: 😴☕️🍻 #FallonAtUT We are taking on college tonight! Describe your college experience in 3 emojis and tag #FallonAtUT! Where’s all the Longhorns at? You guys ready??!?!?!?!?? #FallonAtUT 🤘#HookEm RT @FallonTonight: When at UT Austin, do as the Longhorns do #FallonAtUT https://t.co/XnqZMdyw2q This was my bathtub last night. https://t.co/VQjYX7CSv1 I think I just got suspended. Watch the show tonight! #FallonAtUT https://t.co/Kn5M1569Oh RT @AMarch4OurLives: HEY! Are you ready for the election? No, not 2020 - the one tomorrow! Remember, states are where we can make huge gain… @peteleetweets @FallonTonight You were great!!! Please come back. #kittenpaw Thank you @Andy and @deadandcompany for the best 1st Dead show anyone could ever ask for. #ReadyForDead https://t.co/d0Ikp9E3IR RT @questlove: I must say: @FKAtwigs EASILY gave a instant top 10 performance on @FallonTonight —-that jawn was MAJESTIC x infinity. PLEASE… RT @FKAtwigs: so excited to be revealing a very special performance tonight on jimmy fallon. thank you for having me again! it’s always a p… Hit the woah. See you at the movies. This next parts my favorite part. Hit or miss? https://t.co/XFmOFsSKgK RT @FallonTonight: Tonight Show Music Break: @liamgallagher performs “Once” https://t.co/VTkACzboyV https://t.co/meH3OSRyK6 @GameXplain @Nintendo Not bad. Playing Ring Fit Adventure on @Nintendo switch. Can you beat my score? 124. #FallonTonight https://t.co/31ix8lPoTL Speaking of (his movie) #PlayingWithFire! @JohnCena look what you did to me. Wow. How did you get cut again? #FishSlap #FallonTonight https://t.co/lzUIWLomGB RT @barstoolsports: Coach Richard is Coach of the Year https://t.co/pfTKDWWXMb We’ve got a brand new #FallonTonight show TONIGHT with @JohnCena and @LukeBryanOnline plus @NFL superlatives - after the game! Love and light to all of my friends. Happy Diwali!!! https://t.co/CmDQnYmjY5 Fun pumpkin carving fact: you can get sharpie or permanent marker off of a pumpkin with rubbing alcohol or nail polish remover. https://t.co/Xg42xaYAiM RT @TheSecondCity: Musical improv with @KeeganMKey &amp; @jimmyfallon: https://t.co/4vGZX4zxwo #HappyHalloween https://t.co/HKxD6xFXHQ I love this show and you. You are brilliant! And your crew - I love all. If @FoodNetwork is done then we move on and take this to something I can help with. I need more knowledge. https://t.co/8wYN3yXgBv RT @ETCanada: Watch @KeeganMKey and @jimmyfallon  face off in a game of Musical Impressions https://t.co/n0qvfObT7q Thank you @ScaryMommy . https://t.co/2k2J3TnLv1 Did I post this? https://t.co/m73WoheDeD Let’s try it again. 💜💜💜 #MAMAVOTE #BTS @BTS_twt thanks for the correction, army. https://t.co/r0bIaKDqar Everything is MAMA. @BTS_twt #MAMAvote https://t.co/J2nhn0Elaq Happy #NationalTVTalkShowHostDay @TheEllenShow. (hem... ahem.) Thank you @Momtrends!  https://t.co/5i9s8Ammus RT @FallonTonight: 1 hour until True Confessions with Scarlett Johansson &amp; Mayor @PeteButtigieg on #FallonTonight! https://t.co/p4cM2qm4pL Last year my friend went to a party as Slimer from Ghostbusters. All night everyone kept asking, “Are you the Mucinex Man?” #MyWorstCostume It’s Hashtags time! Describe your biggest Halloween costume fail and tag it with #MyWorstCostume. Could be on the show! Stay tuned tonight - all new @FallonTonight after the game. RT @NJDevil00: It’s going down #FallonTonight https://t.co/wDI2b6jRlD RT @MacKidsBooks: Do you love THIS IS BABY by @JimmyFallon? Enter to win a signed copy by posting a photo of your kiddo reading Jimmy's lat… I can’t believe I took this bet. It’s #1!!!! This is Baby is #1!!! We did it!!!! I can’t even tell you how fun this has been to do. I hope everyone enjoys the book over and over. And thank you again. https://t.co/XdPb2hcLUO @NJDevil00 see you Sunday. A deals a deal. 😔 @Whateverwhatiam @NYRangers Trouble? You’re a dope - but if you really want me to do that? See you Sunday NIGHT!!! Go @NYRangers !!!! https://t.co/0we1uv4NKp I guess it airs at 1:15. See ya then!! On my way to @StrahanSaraKeke. I’m on around 10:15. Yo,\n@michaelstrahan @sarahaines\n@KekePalmer - are we gonna play a game? #ThisIsBaby There’s nothing better than vacation reading. https://t.co/eZYL6QrJ6s #ThisIsBaby #PuertoRico https://t.co/wUwyMQcMnA Thank you again everyone who came out to @BNUnionSquareNY last night to say hi to me. I really love meeting my fans. Thank you thank you thank you. I LOVED it. https://t.co/mcOjfVC3oW. #ThisisBABY I’m destroyed! @seanseaevans is a very bad man. Don’t touch your eyes. https://t.co/YijN68mowl RT @THR: Priyanka Chopra Jonas, Jimmy Fallon take on viral \"hot ones\" challenge https://t.co/Ha9i2HzdVI https://t.co/vxi9NwWDKv I always have fun on Watch What Happens Live. Thank you @Andy! https://t.co/TvB8C6F9Gf RT @jeremyhobson: Thank you, @jimmyfallon for coming on @NPR @hereandnow to talk about your new book, \"THIS IS BABY.\" I am sending you a ra… RT @seanseaevans: HOT ONES VS. @FallonTonight 1135ET/1035C set ur damn DVR 🥵 https://t.co/1Fvc9OqAQC RT @mommyshorts: Congrats to @jimmyfallon on “This is Baby!” It’s a book, not a baby. It’s going on my list for best new parent gifts. http… Save me a seat!! https://t.co/UwKaxF9ayj See you at Barnes and Noble Union Square @BNUnionSquareNY 7pm tonight for a quick chat and some This Is Baby signing!! @RyanBartholomee I love that guy. Rutles forever. Love you bud! https://t.co/w6KoSIyfI1 How do I make this happen? https://t.co/wJBoobZ8hl Really?!?! Well - let’s change that. Who’s next? Thank you, Priyanka. https://t.co/R9NXy4ZgYm This Is Baby is out today!!!! Pick it up at your local bookstore or wherever you buy fun books. Thanks! https://t.co/xJosoRO2II #ThisIsBaby https://t.co/bYz9q4GK2k RT @FalpalsChoice: What a great interview on @TODAYshow stick around to see @jimmyfallon on @LiveKellyRyan from 9am! #ThisIsBaby Okay - to be clear - I’m on at 8:20 on @TODAYshow. I am not on @TheTodayShow in Australia. But I’d love to be one day! #ThisIsBaby Swimmy. https://t.co/0I4KjpFfJM This Thursday night I will be signing books at @BNUnionSquareNY Barnes and Nobel Union Square. 7PM. Be there and be square. #ThisIsBaby https://t.co/Os6kIbKKox I love Noodle!!! https://t.co/PuWgEtfuMN RT @USATODAYBooks: .@JimmyFallon 's 'This Is Baby' faced scrutiny of his toughest book critics: His daughters https://t.co/b41EINeAe6 RT @TigerWoods: .@JimmyFallon and I tee off at 11:35/10:35c on @FallonTonight. #SundayNightFallon https://t.co/jclMIWp6Dn RT @FalpalsChoice: .@jimmyfallon is going to be on #WWHL soon! Send in your questions for him on @andy’s FB page RT @FallonTonight: .@taylorswift13 reacts to a never-before-seen post-surgery clip. More with @taylorswift13 on #FallonTonight! https://t.c… @garyvee Rescheduling as we speak. See you soon buds!! Break a leg tonight!!! #OpeningNight https://t.co/isVviPtKbc RT @billboard: Freestyle Love Supreme Rap completely improvised a rap song on @FallonTonight https://t.co/tcXyICXvjP RT @BroadwayWorld: .@Lin_Manuel and @freestylelove give the @FallonTonight audience a taste of hip hop improv before their big Broadway ope… You have to watch @freestylelove supreme on our show tonight. You will never see anything on tv like this. #FallonTonight #FreestyleLoveSupreme Trending #1 right now. Thanks guys!! https://t.co/w69cZ8e8bB Went to class. That one time. #CollegeInSixWords It's Hashtags time! Use six words to describe college and tag it with #CollegeInSixWords. Could be on the show! @makeuplove2016 I’m sending you more books to chew on. 😁 @raflocruz99 Might be the cutest. Happy Booktober!! (That’s not a thing but I feel like people do that with October.) This Is Baby finally comes out next Tuesday the 8th! Check out https://t.co/t0LkYS5QiE to preorder or ask your favorite bookstore. https://t.co/IR2rlO9KC1 If you buy @ElvisDuranShow ‘s book you get a discount on This is Baby. #WhereDoIBegin #NotTrue (thanks for coming on the show buddy.) Thank you thank you thank you. Fun week. #FallonLIVE RT @BNKids: There are some stunning picture books coming out in October, including books by @JohnCena, @Lupita_Nyongo, &amp; @jimmyfallon! Plus… We are. Thank you for liking it. That makes us have more fun. More fun? More sketches. #CircleOfLife #FallonLIVE https://t.co/oXoMsdkq4H I really hope I inspired you with my moves. (Sorry Dave - I tried.) https://t.co/oJKQwLNU2m RT @stereogum: Watch @Charli_XCX &amp; @JimmyFallon charmingly mash up @DepecheMode's \"Just Can't Get Enough\" with @IconaPop's \"I Love It\" http… Thank you guys for watching tonight. See you tomorrow. 2 more live shows to go! He’s the best!!! Thanks. https://t.co/nBAXSHtooN @InfamousAce_410 @TheIrishmanFilm November 1. And New York Film Festival. @TheNYFF @UK_Falpal @TheIrishmanFilm He is amazing in this. @Neuro2343 @TheIrishmanFilm Thanks. We’ve got another fun thing tonight. Just saw @TheIrishmanFilm. Lovvvved. De Niro is a tour de force. Chemistry with Pesci and Pacino is magical. Everything you want in a Scorsese film and more. Debuting trailer tonight LIVE with Bobby D. #FallonLive RT @TheWrap: Ringo Starr, a Friggin' Beatle, Plays 'Yellow Submarine' on Classroom Instruments With @JimmyFallon (Video) https://t.co/kdG1B… Nailed it bud. See you soon!! https://t.co/PXOz3aWzyL .@ringostarrmusic, @theroots &amp; I sing \"Yellow Submarine\" with Classroom Instruments https://t.co/zKaMwSSwpe #FallonLIVE Thanks for watching #FallonLive. See you guys tomorrow. Goodnight. Night 2 of LIVE week! Taking questions from our studio audience during the break. Tweet along using #FallonLIVE  https://t.co/4eEgqyjZSv I’m the only one who dabbed!!!! #FallonLIVE We've got another LIVE show tonight with @justdemi, @justinhartley talking #ThisIsUs and a performance from @MarkRonson ft. @yebbasmith. Plus, @ringostarrmusic, @theroots and I sing \"Yellow Submarine\" with Classroom Instruments! #FallonLIVE RT @TMZ: Hot Girl Summer may be over – but bring on the pumpkin spice for Hot Girl Fall! (via @toofab) \nhttps://t.co/gAGNHCSYKi RT @RollingStone: From Bob Dylan to Jimmy Fallon, check out 18 great Bruce Springsteen collaborations https://t.co/KrQiSwFehp https://t.co/… Hot Girl Fall with @theestallion https://t.co/LokJrtE9Eu #FallonLIVE First Break - taking audience questions live from Studio 6B! Tweet along with the show using #FallonLIVE! https://t.co/0Y7877rEmg LIVE show tonight with @gwenstefani, @BenSPLATT and a performance from @zacbrownband! Plus, Hot Girl Fall with @theestallion! #FallonLIVE RT @zacbrownband: Tonight’s gonna be a fun one. Who’s staying up late with us? @FallonTonight @jimmyfallon #TheOwl\n\nPhoto by @diegopernia h… Hot Girl Summer may be over... but me and @theestallion are kicking off Hot Girl Fall. Tonight! #FallonLIVE https://t.co/4rT3QKWl2q @CollegeofStRose @FallonTonight Made my day. Thank you guys! Preparing to see my first @deadandcompany show on October 31st at @TheGarden. My friend @Andy is helping me prep by sending three songs a week to listen to and learn. What is on the must listen list? @ParentOutpost @blainecapatch I’d screw it up. It was something about getting the bad side effects to being bit by a spider. I think he said he had the ability to crouch in small corners. I never knew I shared a birthday with @blainecapatch. I love that guy. I was lucky open for him once back in the day. He had a great Spider Man joke that I always loved. Happy birthday! He got me with the double bird. https://t.co/lgiRFaOz9c RT @edible: Man do we have a sweet deal for you! Courtesy of Brad Pitt &amp; @jimmyfallon, get 50% off all dipped fruit boxes $24.99+ using cod… Fun show tonight with Paul Giamatti, @ChrissyMetz and a performance from @SherylCrow ft. @ChrisStapleton! Plus, @theroots &amp; I sing your #FallSongs tweets! #FallonTonight Courtesy of the Gentleman at the Bar w/ Brad Pitt https://t.co/PGgW8QEPVv #FallonTonight Okay as long as it’s not on a Saturnday. https://t.co/az291vihfG Maybe you have a “Crush”? https://t.co/A1eTtcXIFu RT @lamo: Happy Birthday @jimmyfallon!\nWe hope you enjoyed your gift from @Ninja yesterday. Thanks for giving gamers a spotlight. https://t… This is awesome. Thank you so much!! https://t.co/0gQsr5ryHV Tonight: @TheSlyStallone, @CedEntertainer and stand-up from @marknorm! Plus, something fun with Brad Pitt! #FallonTonight Wheel of Impressions with @nickkroll https://t.co/v98rtVhBrL #FallonTonight RT @Oreo: @FallonTonight @JimmyFallon No, good sir, How Dare YOU! Your untoward cry in the late hour of OREO Thins is blaspheme in the high… Alright alright - you guys are gonna make me emotional. #SMILE is trending. So happy. Thanks. What a nice birthday present?!?! https://t.co/8wh7L18EmK It’s my birthday tomorrow and you know what I’d LOVE? Post a picture of you smiling or a video or pic of you making someone else smile. Everyone can do it, it doesn’t cost you anything and it would make me so happy. Thank you. #SMILE (to tune of \"Sucker\")\n\"I carved a pumpkin for you. Removed his guts and now he is smiling.” #FallSongs It's Hashtags time! Tweet out a funny song lyric parody about the fall and tag it with #FallSongs. Could be on the show! I love this. Let’s make something with this!! https://t.co/zhBiWBw9XQ RT @FallonTonight: Burger cheers with Jimmy &amp; @GiGiHadid for #CheeseburgerDay! https://t.co/fY9SDdqYOr https://t.co/goLBpIMozr Tonight on the show: @nickkroll, @DennisDMZ, and @ninja! Plus, a performance from @Residente ft. Bad Bunny (@sanbenito)! #FallonTonight An all-new #Fallonventions with some amazing kid inventors https://t.co/lKJaCaSjlL #FallonTonight Tonight: @MsSarahPaulson, Michelle Dockery, and music from @thelumineers! Plus, new #Fallonventions! #FallonTonight RT @IanSams: Powerful moment from @KamalaHarris with @jimmyfallon last night: Kamala asks the audience of all college students how many of… RT @thedailybeast: Kamala Harris just became the latest politician to \"slow jam the news\" with @jimmyfallon https://t.co/quDfznEYAt Tonight: Senator @KamalaHarris is here, @Lilly talks her new show @latewithlilly and @charli_xcx! Plus a performance from @charli_xcx ft. @QueensChristine! #FallonTonight @SharonZurcher That goes without saying. It should be on everyone’s list. Fantastic game. Changed everything. Naming some others who deserve some love... RT @Residente: El miércoles 18 se juntan Trujillo Alto y Vega Baja para tocar “Bellacoso” por primera vez en vivo en @FallonTonight @jimmyf… RT @theestallion: Hotties I’ll be on The tonight show with @jimmyfallon tonight so tune in ! https://t.co/xXsMXWwHIC What lingers for me is the pinched nerve in my back and whatever is making me limp on my left side. But this tweet makes it all worth it. 😁#IcyHotAllDay https://t.co/QtSzCfdbjY Tonight: Jennifer Garner, @jimjefferies and music from @theestallion! Plus, we all play the food-tasting game Secret Ingredient! #FallonTonight .@KimKardashian shows me what's on her phone https://t.co/zJozhkokOh #FallonTonight Thank you @PaulaAbdul and hi to everyone on @thetalkcbs! https://t.co/ADX6HzJRyA Tonight: @KimKardashian shows me what's on her phone! Plus, @winnieharlow and a performance from @IggyPop! #FallonTonight Right after this I was strapped to an oxygen tank and an IV for the rest of the night. @jlo is a PRO. #HustlersMovie https://t.co/UotGJ7eMa8 RT @russwest44: Make sure y’all tune in tonight to @FallonTonight !!! @jimmyfallon https://t.co/SavUJf9Mqx Tonight: History of Music Video Dancing with @JLo! Plus, @russwest44 is here and stand-up from @RyanHamilton! #FallonTonight RT @FallonTonight: Ashton Kutcher (@aplusk) is rocking a spite 'stache after Mila Kunis mixed up the details for a theme party. More with @… Love you too buds. Congrats on #1!! https://t.co/RjNVX31ZHo RT @stereogum: Watch @PostMalone &amp; @JimmyFallon visit Medieval Times together https://t.co/wv1iPo0Egi https://t.co/sdKbLgjAK2 Tonight: Ashton Kutcher (@aplusk), Billie Lourd and #USOpen Champ @Bandreescu_! Plus, a performance from @SherylCrow ft. @JasonIsbell! #FallonTonight .@postmalone and I go to Medieval Times https://t.co/uzW7rqwh35 #SundayNightFallon RT @BruceBeck4NY: Great to have @RichCimini in house on @SportsFinal4NY to talk #Jets! What happened to the lead today and where do they go… Brand new Tonight Show after the #NFL Steelers vs Patriots game! We have @michaelb4jordan &amp; @iamjamiefoxx, a Beat Battle with @KellyClarkson and music from @kanebrown! Plus, @PostMalone and I go to Medieval Times! #SundayNightFallon They crushed it. It’s such a fun show to get to see new kids and legends playing together. Thank you. https://t.co/cD8a9TJe42 If you have kids and are in NYC - check this out. We LOVED it. So creative and fun. Great job all around. Thank you. https://t.co/d824xlttjY @merlynwood Ha. Busted. That’s nice. I got some new jams to send you. https://t.co/QVfY56QHcP Happy #ThankYouNoteFriday! Tonight: @RyanSeacrest, @robinthede and magic from @DerrenBrown! #FallonTonight Thank you. https://t.co/Iporq1M7Qt @ElvisDuranShow thank you guys as always for being so welcoming. Elvis - remember - no smoke machines at the wedding. Hope to see you soon. Pour It Out w/ @KendallJenner https://t.co/gPLMqDw7mO  #FallonTonight Just get up now!!! Hi Sweden! https://t.co/cmmjZmm0MF All new #FallonTonight starts in 5 mins.... @KendallJenner spills some secrets and @SHODesusAndMero talk @PopeyesChicken then @tanya_tucker closes it out with @brandicarlile. #NBC NOW!! Go. Thanks. https://t.co/hVXDXRY5Uy Sooooooo many questions..... https://t.co/0qIcqFwifx 8am. I’m in. Not going to sleep tonight. https://t.co/2xZQk9p0I5 Fun show tonight after the #NFLKickoff game with @KendallJenner, @desusnice &amp; @THEKIDMERO and music from @tanya_tucker ft. @brandicarlile! #FallonTonight RT @FallonTonight: Jimmy tries to teach Orlando Bloom how to properly craft a #MeAlsoMe tweet. More with Orlando Bloom on #FallonTonight ht… She also played Tribute by @tenaciousd in rehearsals. She is a beast!! https://t.co/26s0dE9ACZ Tonight: Orlando Bloom, @ConstanceWu, Jack White &amp; @brendanbensongs. Plus, a performance from The Raconteurs! #FallonTonight Real Scary Stories w/ Bill Hader &amp; @Caradelevingne https://t.co/zSvScQikRI #FallonTonight Welcome back, @hodakotb!  UberPooling to NBC wasn’t the same without you. #TodayShow @PRINCEA41820066 @Caradelevingne @PrimeVideo @NBCNightlyNews @LesterHoltNBC @AlecBenjamin I KNOW!! I’m so happy. See you tonight. Happy first day of school if today is your day. We have a fun Tonight Show tonight from IT Chapter 2 Bill Hader is here, @Caradelevingne has a new show on @PrimeVideo Carnival Row, host of @NBCNightlyNews @LesterHoltNBC and @AlecBenjamin! This is my #JFJAM of the week along with @PostMalone. Listen to title song. Can’t wait to be back with new shows starting Tuesday. Miss you guys. https://t.co/U3j9DDztVP https://t.co/oFW4KLzcxS It’s great Posty. Congratulations. #Circles https://t.co/Z4agazLg6S Gavin forbid us to ever speak again. So I’m gonna leave this with you guys. Unless... you have the new credit carrrrdddd?!!???? https://t.co/UwkvWhGLC4 RT @MacKidsBooks: This time BABY is the star of the show! Preorder your copy of @JimmyFallon's newest picture book THIS IS BABY today: http… RT @etalkCTV: John's still got it! 👏⚡️ “John Travolta brought back Danny Zuko from 'Grease' with @jimmyfallon”\n\nhttps://t.co/uI1ADuVvGB happy happy birthday to my favorite dance partner @madonna. Love ya pal. Travolt-Off w/ John Travolta https://t.co/IGuUlhFwro #FallonTonight RT @ETCanada: John Travolta goes head-to-head with @jimmyfallon in a \"John Travolt-Off\" https://t.co/7KvhN0R49V Tonight: John Travolta, @MarlonWayans and #TonightShowSummerReads “Ask Again, Yes” author @Mary_Beth_Keane! Plus, music from @carolinejones! #FallonTonight Wheel of Musical Impressions w/ @alessiacara https://t.co/buq65KfYe3 #FallonTonight @KateUpton @FallonTonight I’m sore. You know I am. YOU were the one making ME laugh! Thanks again for doing that. I was honored. https://t.co/4GCFSFlGTQ Tonight on the show: @icecube, Kieran Culkin and Wheel of Musical Impressions with @alessiacara! Plus, music from @juanes &amp; @alessiacara! #FallonTonight Jonathan Groff sings a voice memo as @DisneyFrozen’s Kristoff https://t.co/BC35Y3HbLd #FallonTonight Tonight: @henrygolding, Jonathan Groff and music from @RickRoss ft. @THEREALSWIZZZ! #FallonTonight ‘80s Aerobics Dance Challenge w/ @KateUpton https://t.co/j6LBrXx0tu #FallonTonight Fun show tonight with @common, @KateUpton, and music from @common ft. @THEREALSWIZZZ! #FallonTonight Fun show tonight with a very special guest! Plus, @LilRel4 and a performance from @NatalieMerchant! #FallonTonight @MichaelGRubin Not a nerd - a visionary! A genius! This is cool to see. Tonight: Greg Kinnear, Phoebe Waller-Bridge and music from @BigSean! #FallonTonight My friend had a giant hole rusted through the bottom of his car. He would pretend to stop the car with his feet, Flintstones style. #CarFails It’s Hashtags time! Tag a tweet with #CarFails and then tell us about a funny or weird thing that happened to you or a friend involving cars. Could be on the show! RT @RollingStone: Watch Post Malone and Jimmy Fallon sing a rousing cover of \"Seven Drunken Nights\" https://t.co/8FPvDk2Xho https://t.co/Dw… RT @PostMalone: Love you @jimmyfallon ♥️ https://t.co/X7U79wMuvq Tonight on the show: Dakota Johnson, @PostMalone, @realjonlovitz and a performance from @TTChilders! #FallonTonight Tonight: @_juliannemoore, @JacobTremblay and talk + stand-up from @juliothesquare #FallonTonight Thank you!!! https://t.co/EM8Vmnannc Storytime: @hasanminhaj and I trade embarrassing stories about our parents https://t.co/wtWZ9nvMj1 #FallonTonight Tonight: @hasanminhaj, @VanessaKirby and a performance from @samfendermusic #FallonTonight .@QueerEye's Fab Five and I ride \"The BEAST\" https://t.co/fTAVdAv1D6 #FallonTonight @bobbyberk @FallonTonight Beast buddies? Boat buddies forever. Haaaaaa. You guys killed it. Thank you. https://t.co/NoqEHxF858 High-speed boat tour on the Hudson River with @QueerEye's Fab 5 #FallonTonight! https://t.co/Jm4MV2sc8O Tonight: @TheRock, @IssaRae and @Eddy_Grant performs “Electric Avenue!” #FallonTonight We test how well @QueerEye's Fab Five know each other https://t.co/T2dUbAxT2s #FallonTonight Tonight on the show: @kevinbacon, @QueerEye’s Fab Five and music from @TheHighwomen! #FallonTonight RT @FallonTonight: 16-yr-old #FortniteWorldCup Solo Champion @bugha walks us through his gaming routine. More with @bugha on #FallonTonight… Tonight: @RachelBros, @carlagugino and music from @tydollasign! Plus, #FortniteWorldCup Solo Champion @bugha! #FallonTonight RT @EW: Jimmy Fallon reveals Mary Beth Keane’s Ask Again, Yes as Tonight Show summer read https://t.co/7leczEDu3P Our #TonightShowSummerReads jumped to #2 on the Amazon Best Seller list overnight! If you want to read with me, order here https://t.co/2WwarupzPH or pick up a copy at your local bookstore! https://t.co/Zx7FIT13HB RT @FallonTonight: Thank you to everyone who voted! You've selected Ask Again, Yes by @Mary_Beth_Keane as the official 2019 #TonightShowSum… Congratulations Marina!! Clash Royale later? https://t.co/WUplJcfZtW Fun show tonight with @ZacharyQuinto, Betty Gilpin, and stand up from @ComicMikeV! Plus, a science demo from Kevin Delaney! #FallonTonight Tonight Show Testimony https://t.co/EnAMH0O7TH #FallonTonight RT @FallonTonight: If you were wondering what happened to the Timothée Chalamet puppet, he’s Jimmy’s latest guest! https://t.co/QM1OvN948k… Tonight: @octaviaspencer, Fred Armisen and music from @YbnCordae ft. @AndersonPaak! #FallonTonight RT @FallonTonight: .@DavidSpade gives his take on various topics in Wheel of Opinions https://t.co/VIhxMkw73c #FallonTonight https://t.co/V… Tonight: @DavidSpade, @foxoutdoors &amp; music from @redhearsemusic! #FallonTonight So excited for #TonightShowSummerReads! 5 amazing books this year: Ask Again, Yes by @Mary_Beth_Keane, The Chain by @adrianmckinty, The Silent Patient by @AlexMichaelides, Fleishman Is in Trouble by @taffyakner, and The Gone Dead by @chanellebenz. Vote now https://t.co/Hx8Qr4ktDI RT @FallonTonight: We’re so excited that our summer book club #TonightShowSummerReads is returning this year! Jimmy will be reading one of… Mad Lib Theater with @kenanthompson and @JoeManganiello! https://t.co/PKYk4Yv8nc #FallonTonight Tonight: @kenanthompson, @JoeManganiello and a performance from @robynkonichiwa! #FallonTonight Tried to impress my wife by walking out of the ocean like Daniel Craig/James Bond. Got knocked over by a wave: riptide, pants down, bloody knee, hair looked like a bad toupee, and a little kid on the beach saw me and started crying. #BeachFail It’s Hashtags time! Tag a tweet with #BeachFail and then tell us about a funny or weird thing that happened to you at the beach. Could be on the show! Winnie: \"Can I play that game where the emoji is being chased by a ghost?\"\nMe, realizing she means PAC-MAN:\n#WorldEmojiDay https://t.co/mghvD15Kdn Tonight on the show: @joelmchale, @marcmaron, @blakegriffin23, and stand up from @dustyslay! #FallonTonight RT @TwitterMoments: The wait is (almost) over! @chancetherapper’s long-awaited debut album #TheBigDay is set to drop on July 26. https://t.… All the details on @chancetherapper's debut record! #TheBigDay https://t.co/PxZRSLkpQg #FallonTonight @chancetherapper .@chancetherapper, see you later alligator! #ChancetheSnapper #FallonTonight RT @TooFab: .@JimmyFallon and @StephenAtHome really are two #StrangerThings in late-night ... here's hoping theirs is a 'NeverEnding Story'… RT @MLByahoosports: \"Even a hungry turtle can do a jumping jack\"\n\n\"Scribble with the nibble\"\n\nIf you scratched your head when you heard the… RT @TVGuide: 🎤 @jimmyfallon and @StephenAtHome's Neverending challenge from @Stanger_Things is so bad it's good https://t.co/vM2eXIJfLy htt… TONIGHT: @chancetherapper is here, talk with @thedavidcrosby &amp; @CameronCrowe, and @thedavidcrosby performs with @theroots! Plus, @JLo shows a sneak peek of #HustlersMovie! #FallonTonight NeverEnding Story Duet with @StephenAtHome https://t.co/DPcyGo1Lt5 #FallonTonight #StrangerThings In case you didn’t recognize one of the backup dancers from @JLo’s #ItsMyPartyTour tonight https://t.co/iP0dytX6Wp I am at #ItsMyPartyTour at #MSG!! @JLo https://t.co/joEpmUOIYx Back with all-new shows this week! Tonight: Jesse Eisenberg, Fran Lebowitz, and a performance from @denzelcurry! #FallonTonight There are so many good songs this summer!! Check out the #JFJams playlist! I add to it every Friday! https://t.co/VeVPBiwV9h Haaaaaa. https://t.co/Rdpas69uKQ https://t.co/4O47BDfu6u https://t.co/A7TqOkIcgK Taking blurry tennis photos since 2005. #Wimbledon 🎾 https://t.co/N6uGVa9A4v RT @FallonTonight: .@NICKIMINAJ and Jimmy are on the same page about their Red Lobster meal https://t.co/VqXqnV7mtk #FallonLIVE https://t.c… RT @FallonTonight: .@NICKIMINAJ incorporates 3 random words into a rap on the spot in Wheel of Freestyle #FallonLIVE https://t.co/g6kGDIVUXj LIVE. You get one chance and you nailed it! Thank you my pal. ❤️☘️❤️ https://t.co/JIqgUnSbAo Love you guys!! Thanks. #FallonLIVE .@NICKIMINAJ and @dopequeenpheebs!! Another song made up on the spot with @theroots from your tweets! #FallonLIVE https://t.co/bbKxdzujCB First Break - Making up a song on the spot with @theroots from your tweets!! More with @NICKIMINAJ on @nbc NEXT!! Are you watching?! #FallonLIVE  https://t.co/jgOi5ssSGO We've got another LIVE show tonight! @NICKIMINAJ is here and we have dinner together at Red Lobster! Plus, @dopequeenpheebs and a performance from @juliamichaels! Don’t miss it! #FallonLIVE TONIGHT! Red Lobster Redemption with @NICKIMINAJ! #FallonLIVE https://t.co/3wXDLuCftt RT @TwitterMoments: Some unsuspecting Stranger Things fans got quite the surprise thanks to @FallonTonight. https://t.co/YqFhyvpYt4 Nice T!! I got a new cool one coming out in a few weeks that you’ll dig. Think... Eddie. https://t.co/vqKTdcv2pI I’ve been doing this! And I love it! #HelpUsStrangerREPEAT https://t.co/77CHkZRABt RT @nytimes: Here's a rundown of the bits worth watching from late-night TV https://t.co/0eBcn5kVNy RT @FallonTonight: The @Stranger_Things cast surprises fans at #MadameTussauds Wax Museum https://t.co/mjnSAdLi2v https://t.co/CK9rhy1lXS We’re gearing up for a LIVE show tonight with Daisy Ridley, @iamcolinquinn, and a performance from @littlebigtown! Plus, the cast of @Stranger_Things and I surprise unsuspecting fans at #MadameTussauds in Times Square. Don’t miss it! #FallonLIVE https://t.co/Sky6moiV9y RT @FallonTonight: .@NICKIMINAJ had a scheduling mixup #FallonTonight https://t.co/S4wWiVtz7R Tonight: @TrevorNoah, @SebastianComedy and magic from @pennjillette &amp; @mrteller! #FallonTonight They have the insanely hard job of making my face look good every night - so YOU are a walk in the park! But I will pass along the props. Thanks. https://t.co/LgDtYrQbQ0 And we’re LIVE!!! https://t.co/jt5wFhtY2a Haaaaaaaaaa!!! Good sport. Always great to see you my friend. https://t.co/6sVn0EnkGF Can You Feel It? with @chrissyteigen! https://t.co/yv1pNt0iBV Started Late Night with a small group of writers. So happy tonight to have Bashir Salahuddin and @Diallo Riddle on the couch as guests. Build a rocket, boys!  #SouthSideChi https://t.co/DPrt6somYm .@ChrissyTeigen ask @KimKardashian how much fun it is to play our game “Can You Feel it?” Right, Kim? Kim? Kim? RT @Madonna: Madame ❌ is grateful................thanks to everyone who made this possible. 🙏 #madamex #gratitude https://t.co/f5zc4YcbIS This is all great. And hilarious. Let’s make more people happy! @guyraz - look what you did!????!?? https://t.co/8sEk0p7D0o RT @FallonTonight: .@Madonna and Jimmy face off in a Neon Dance Battle! https://t.co/YfH1raYleS https://t.co/tpyaQR3bBs vEYEtamins.  Vitamins added to eye drops. For people that can’t or don’t like swallowing pills. https://t.co/NCIoFHJlCS RT @billboard: .@Madonna proposes to @jimmyfallon &amp; rocks neon dance battle on @FallonTonight https://t.co/yS3wYOQpRx https://t.co/SaOQFMDP… Hey, @JNJInnovation and @KelloggsUS - let’s set up a meeting. https://t.co/OUuw1wFuWn @cathbruening @WillieNelson You really want me to? I’m sorry - but if you missed @WillieNelson on our show the other night - he talked and sang a song for us. I can’t thank him enough for coming on. I love him and this song made me cry. If you need one, here it is... https://t.co/p5YGOAqXsc #RideMeBackHome #Willie Neon Dance Battle w/ @Madonna #FallonTonight https://t.co/yCu3PpimEU This is hilarious. I liked hearing the story behind it. Tell her to watch the show tonight, then raffle it off. https://t.co/g9LQbyUfOL RT @mashable: Banksy's never been invited to the Venice Biennale, so he showed up with his own installation https://t.co/tWqVJzeiz5 RT @gavinpurcell: This is great. https://t.co/wG211wmjKd .@Madonna will you dance with me tonight? Guy I have ideas... https://t.co/3fznzYXb8T Tonight on the show: @Madonna is here! Plus, @guyraz and a performance from @AriLennox! #FallonTonight Charades with @michaelstrahan &amp; @BellaTwins! https://t.co/AUrWwefmzl #FallonTonight Tonight on the show: @michaelstrahan and the @BellaTwins are here! Plus, a performance from @Sleater_Kinney! #FallonTonight @leahbale21 Get well. Sleep sleep sleep! xo Jimmy RT @Lin_Manuel: Freestyle Love Supreme. On Broadway. This fall.\n#FLS https://t.co/EMXwAcry0L Wheel of Freestyle with @Lin_Manuel! https://t.co/qH45CD0V3q #FallonTonight Me too. I’m rooting for him. All the way!!! https://t.co/jwALbbYypR .@Lin_Manuel has a big announcement tonight - also maybe a litttttle Wheel of Freestyle?!?!? It’s about to go down. #FallonTonight https://t.co/eLzH0dujhV RT @Variety: The Head and the Heart brought Jimmy Fallon back into the Tonight Show music room to join in singing a valedictory signature s… My friend got married on the beach and wanted to zip line to the altar. He didn’t test before and it turned out he was too heavy for the line. He was dragged through rocks and sand for the last 10 seconds. Ripped the pants off of his tux. #WeddingFail It’s Hashtags time! Tag a tweet with #WeddingFail and then tell us a funny or weird story from a wedding you were at. Could be on the show! TONIGHT: @WillieNelson and @ADAMDEVINE are here! Plus, a performance from @WillieNelson! #FallonTonight I loved Taxi. That is my favorite sitcom of all time. https://t.co/AEZ7FkOzxu This day changed my sneaker game for life. @hasanminhaj knows his stuff. Thanks @Variety. https://t.co/LuOnkEjdQq Tonight on the show: @KeeganMKey and @MrHoratioSanz! Plus talk + music from @perryfarrell! #FallonTonight @JustStolp She’ll start reading it back to you. Watch!!! @borisTaglia Therapy? Your Baby’s First Word Will Be DADA. Run to your local bookstore or toy shop or Amazon - you’ve got 1 day until Father’s Day!! #HappyFatherDay https://t.co/OnTNoQcjAE Fun show tonight: The cast of @Stranger_Things is here! Plus, @ramy and a ramen demo from @ivanramen! Happy #ThankYouNoteFriday! #FallonTonight https://t.co/WwLo2fHVfr @marqieIa @Neuro2343 I’m glad you came. Thank you. Good morning Italy!!! Here we go!!! https://t.co/JPV8Rx4MlT Good morning Sweden!!!! Have a great day!! https://t.co/QJPBlyjjvp @JohnLegere Not sure if I’ll ever be ready for it again. That was REAL DEAL. Sean and I aren’t on speaking terms currently. There’s a warrant for your arrest in Singapore. https://t.co/tsCbDOthoi @Ninja Dude, you’re rocking the Bomb Pop! #IJusthadThisLastWeek #HappySummer https://t.co/dDd7d75JD1 Tonight on the show: Sienna Miller, @MrJoshCharles, and @RyanTedder! Plus, a performance from @onerepublic! #FallonTonight Know Your Bro with @jonasbrothers! https://t.co/sFLddurhWh #FallonTonight @Miss_Leona_ merci beaucoup I love you guys. Thank you again for coming on. Crushed it as always. https://t.co/Z4wKuKFYB0 My friend’s dad used to make us put shoes on when there was a thunderstorm cuz he heard that \"if we're barefoot the whole family could get electrocuted.\" #DadQuotes It’s Hashtags time! Tag a tweet with #DadQuotes and then tell us about a funny or weird thing your dad has said. Could be on the show! Tonight: @chrishemsworth is here and we get to the truth in True Confessions with @kumailn! Plus, talk + music from @jonasbrothers! #FallonTonight I’m really thinking of @seanseaevans this morning https://t.co/9NjO4xwdqq It’s about to get hot in here. #HotOnes #FallonTonight https://t.co/RUBD2EhL20 Fun show tonight: @selenagomez is here and we are going to be put to the test by #HotOnes host @seanseaevans! Plus, @ElaineWelteroth and a performance from @GoldLink ft.@MaleekBerry! #FallonTonight Classroom Instruments with @jonasbrothers!! https://t.co/TKqu2AEGS8 #FallonTonight @EvelynRobinson @DEADLINE So much in one year. And more to come. Yeah that PR Special really meant a lot to us too. Go vacation in Puerto Rico!! It’s beautiful! 🇵🇷 Had a fun talk with Matt Grobar at @deadline. Thank you for the time! Hopefully I’ll talk to you before another year. (I like the picture too!) https://t.co/cn72JQjBlA Back with all-new shows this week! Tonight: @shailenewoodley talks #BLL2, Brian Tyree Henry stops by, and music from @TheNational! Plus, Classroom Instruments with @jonasbrothers! #FallonTonight https://t.co/WMVzzTw7BU @MarkRonson Ghostbusters Ray Parker Jr. It works. Call your DJ! I used to call Mark Bolger at K104 every day requesting a song. Then I’d press play/record on my boombox and wait. Until I caught my song! https://t.co/vTyNlPi5b5 There is so much new music this weekend! I highlighted some of my favorites on my IG stories. Happy Friday!! #JFJam #NewMusicFriday https://t.co/U1tFJ5MvCS https://t.co/xLlWxJwTD4 https://t.co/0eVAsMyGEP I’m down, buds. Count me in. https://t.co/aiBBkjdd2y Gulp. Yes!!! It’s what I wanted!! Happy summer!! https://t.co/brvr4W8fhr Thank you!! And all of my profits go to @SeriousFunCamps and it’s #FairTrade. Ask your store to get it in the freezer aisle this summer!! #TonightDough https://t.co/8GJcz47FKX It was so well done and creepy and funny and home run acting and directing and a great soundtrack. It’s gonna be tough to beat season 1 - oh wait... enter Meryl Streep. I’ll be watching. Thanks. #BLL2 But the secret sauce for me has to be - set decorator Amy Wells, production designer John Paino and art director James F. Truesdale. Every home LOOKED like the characters who lived there. Down to the silverware. @shailenewoodley, @ZoeKravitz, @LauraDern, @ReeseW and Nicole Kidman were all - off the chain -fantastic to watch. Amazing performances. Not to mention Alexander Skarsgard and @mradamscott who played every scene perfectly. I know I’m late to the party - but just finished season 1 of Big Little Lies. HO-LY - I loved it! Wow. Season 2 coming June 9th so you got time to watch if you haven’t seen. But I have to give props to David E. Kelley and that cast!?!?! I meant to say... happy birthday buds!!! Always miss you. When do we play again? https://t.co/dOwvsevhgJ Might have to do both!!! https://t.co/h8irPcBjxZ @MikeyPiff @halsey @SiriusXMHits1 You’re not too bad yourself, pal. Who knew I’d love @halsey ‘s speaking voice as much as love her singing voice. Really funny and charming too. Well done on @SiriusXMHits1! Fun show tonight! @danacarvey is here (and we have something fun planned with special guest Robert Smigel)! Plus, @emrata stops by and stand up from @chloe_hilliard! #FallonTonight https://t.co/Z52xOdGhoh RT @FallonTonight: .@_richardmadden quizzes Jimmy on Scottish phrases #FallonTonight https://t.co/c8i9LBoCE5 #NosesOn in honor of #RedNoseDay! Go to https://t.co/Wdf16ZDvcW to learn more about @RedNoseDayUSA!! https://t.co/J2HemYmuMo Great Show Tonight: Harrison Ford is here, @_richardmadden stops by, and @bazzi performs! Plus, our entire audience is made up of servicemen and women from @USArmy, @USNavy, @usairforce, @USMC, and @uscoastguard in celebration of #FleetWeek! #FallonTonight https://t.co/HQAThPxFU6 Beat Battle with Millie Bobby Brown!! https://t.co/u3U8gBLQ47 #FallonTonight Richard Curtis, founder of @RedNoseDayUSA, explains the impact of a $2 Red Nose purchase today at @Walgreens #RedNoseDay #NosesOn https://t.co/VovUeARUbq https://t.co/Jk0v0sUS0n RT @EW: Millie Bobby Brown covers everything from Lizzo to Lorde in epic 'Beat Battle' with Jimmy Fallon https://t.co/pw9JteRrOO She’s got it. https://t.co/kpLwkSwKe3 TONIGHT: Millie Bobby Brown (@Milliestopshate), @realjeffreyross, and Richard Curtis! Plus, a performance from @lang_lang! #FallonTonight Hop Quiz with @KevinHart4Real https://t.co/W0o0eYABUs #FallonTonight TONIGHT: @KevinHart4Real, @beaniefeldstein, and music from @Mabel! #FallonTonight .@JBalvin talks about ending up on stage with Beyoncé at Coachella https://t.co/awp2RQ154b #FallonTonight Me: Chrissy, can we take a backstage photo?\n@chrissyteigen: Sure!\nLuna: https://t.co/nblWqNQ40T TONIGHT: @JohnLithgow is here and @JBALVIN stops by! Plus, a performance from @duttypaul &amp; @JBALVIN! #FallonTonight Happy #ThankYouNoteFriday! Tonight on the show: @itsgabrielleu is here and @djkhaled stops by! Plus, a performance from @vampireweekend! #FallonTonight RT @FallonTonight: .@headandtheheart stop by to perform “Missed Connection” 🎶 https://t.co/7Aj8mpHIfW https://t.co/WMGrUK01lc Tonight on the show: @jessicaalba, @YaraShahidi, and music from @headandtheheart! Plus, your funniest #PromFail tweets! #FallonTonight RT @FallonTonight: Digital exclusive @HowardStern extended interview on his legacy, how his cancer scare inspired him to write his new book… Conversations with a friend #HowardSternComesAgain https://t.co/SYkvDjgjeZ .@HowardStern is here tonight and we are talking about #HowardSternComesAgain! It's funny and irreverent and also moving and inspiring. Pick up his book!! https://t.co/Rsfb9J8L8Q https://t.co/J0pBWfIwsY RT @sternshow: The wait is finally over, @HowardStern's first book in more than 20 years is AVAILABLE NOW! Get your copy: https://t.co/1qbe… It was!! https://t.co/B0DP0WXX5n A great book!! https://t.co/Rsfb9J8L8Q Fun show tonight: @HowardStern is here to talk about his new book #HowardSternComesAgain! Plus, a performance from @monstersandmen! #FallonTonight RT @billboard: Maluma talks Madonna collaboration, performs \"HP\" on @FallonTonight https://t.co/pVswZ2daPS https://t.co/qo3M5O6kFI What started as laughter is now applause. These moments. Love you buds! https://t.co/B73Mudq9h3 I was social director so I added “Star Spangled Banner” in the mix for prom song. It won. So that was the prom song for Saugerties High, Class of ‘92. #PromFail It’s Hashtags time! Tag a tweet with #PromFail and then tell us a funny or weird story about your prom. Could be on the show! Tonight on the show: @Jeff_Daniels is here and @iamjamiefoxx &amp; @corinnefoxx stop by! Plus, talk and performance from @Maluma! #FallonTonight Slow Jam The News with @PeteButtigieg https://t.co/F2QifXiGH0 #FallonTonight Tonight on the show: @MiloVentimiglia, Mayor @PeteButtigieg, and music from Morrissey (@officialmoz)! #FallonTonight RT @officialmoz: Morrissey on @FallonTonight! Tune in at 11:35pm ET. https://t.co/GucZhnE1t1 @KimKardashian Congratulations!! Are you naming him Jimmy? It was fun. Thanks for taking the time to talk with me. ❤️☘️ https://t.co/FaNrCrg1ov RT @MacKidsBooks: Mother's Day is right around the corner and we have the perfect book for MAMAs everywhere! Pick up a copy of EVERYTHING I… Great Show Tonight: Emma Thompson is here and we get to the bottom of the #GameofThrones Starbucks cup with @SophieT!  Plus, Paula Pell (@perlapell) and Amirah Kassem (@flourshop)! #FallonTonight RT @Clayunplugged: .@lukecombs  absolutely crushed it on @jimmyfallon #toc2019 @1065WYRK  https://t.co/BdpTPxoDO7 #TBT in honor of #winecountrymovie https://t.co/Zw6znOjiB0 Tonight: @halleberry is here, @ChrisKattan stops by, and @lukecombs performs! Plus, your funniest #MomQuotes tweets! #FallonTonight RT @RollingStone: See Rita Ora and Kygo perform \"Carry On\" on #FallonTonight https://t.co/z4SUbUMAQX https://t.co/mocw8s3RBo You miss me. https://t.co/R4GUw3xLKz Tonight on the show: @MayaRudolph is here and @RitaOra stops by! Plus, a performance from @KygoMusic &amp; @RitaOra! #FallonTonight RT @billboard: Watch @vampireweekend and @HAIMtheband team up for @FallonTonight performance https://t.co/PAdc9pWsrV https://t.co/eYrKMppC3F My mom once said, \"I like that guy Zack Jack-a-fanakis.\" #MomQuotes It’s Hashtags time! Tag a tweet with #MomQuotes and then tell us about a funny or weird thing your mom has said. Could be on the show! RT @FallonTonight: Will Smith, with a beat from @questlove, performs his new spin on “Friend Like Me” 🧞 #FallonTonight https://t.co/gLRhREJ… Awwww I’m liking all of your likes!!! Ha!! Thank you!! Tux by The Row brooch by @CHANEL. Night! Thanks. https://t.co/7f06eRh05Q TONIGHT: Will Smith is here, Laurie Metcalf stops by, and stand-up from @PhilMhanley! #FallonTonight Can't believe we missed this in our sketch https://t.co/BdG814SaFx Hibbie-dee-hoo!! #SNL https://t.co/sKPD06R4Nx .@AdamSandler is CRUSHING it right now on SNL. Happy #StarWarsDay! #MayThe4thBeWithYou https://t.co/IJfgUlJLbR @mills__elise @WGAWest @guyraz Thanks a lot. LA... can you feel me? I’m here!! Yahoo!! Interviews all day and ending at the @WGAWest theater to be interviewed by my favorite @guyraz! See you tonight! (BTW - flew in after the show and got here around 1:30. It’s 8. I KNOW LA has great coffee - where do I go?) Spit Take Roulette with @VancityReynolds https://t.co/Dy03Oz4AXh #FallonTonight Wow. Thank you!! Love you guys!! See you soon!! (p.s. did I get any of the words right? tricky lyrics!) https://t.co/2soo2miFYE Tonight! @VancityReynolds, @RosieHW, &amp; @Protoje performs!! #FallonTonight RT @FallonTonight: Sebastian Stan talks #AvengersEndgame https://t.co/7GElFfwtRn #FallonTonight https://t.co/2s3kDHUwcJ Tonight on the show: Alexander Skarsgård is here, Sebastian Stan talks #AvengersEndgame, and a performance from @fontainesdublin! #FallonTonight RT @FallonTonight: .@RobertIrwin introduces Jimmy to Li’l Sebastian, a miniature horse https://t.co/bhgQosQSB6🐴 https://t.co/1HoBYFrWOO High School Dance Battle with @noahcent! https://t.co/iqhkZ5IkYm #FallonTonight Tonight on the show: Kate McKinnon is here, @noahcent stops by, and Mac DeMarco performs #FallonTonight It was always burning. https://t.co/zJZ4QszLZ4 Thank you so much for doing that. I’m available to go on tour whenever you want. Don’t answer immediately. https://t.co/gIm3Zt9UhY RT @RyanSeacrest: #2StingsOnTheMoon? Pretty out of this world @OfficialSting @jimmyfallon @FallonTonight https://t.co/1pKEyD05q2 RT @people: Jimmy Fallon and Sting Join Forces For a Hilarious Parody of the Singer's 'Walking on the Moon' https://t.co/gXNZto9Smx RT @billyjoel: #AvengersEndgame #Avengers https://t.co/Wr7OivWU7U RT @cherrytreerec: Two Stings on the moon 🌔 https://t.co/YigxQRmFwx @OfficialSting @FallonTonight Tonight on the show: @OfficialSting is here and @kj_apa stops by! Plus, a performance from @OfficialSting! Happy #ThankYouNoteFriday #FallonTonight Great job by Paul and our crew and wardrobe and hair and make up. And director and editor. Obv. And Dead or Alive. Thanks!! https://t.co/1UfayN5E1n Let’s talk. https://t.co/Mn1KcAzGPk @EvelynRobinson Not anymore. :) enjoy. I LOVE the music community so much. Thank you for the support. https://t.co/5939LldKtJ #2StingsOnTheMoon 🐝🐝🌝 https://t.co/SDNbpv4HpK https://t.co/qZDCOcHgXE @JustinMcElroy @FallonTonight ??? @MarthaQuinn @iHeart80sRadio I’m a fan, Martha! RT @Chum1045: Nailed it! 🙌@jimmyfallon &amp; Paul Rudd recreate the 'You Spin Me Round' music video ~@TheAshleyGreco https://t.co/fTsyQ2Fo34 Agreed. That’s John MacDonald if anyone wants to start a kickstarter. 😁 He’s been working all night since February. https://t.co/aIl5jC7j6s RT @mashable: Paul Rudd spins us right round in this glorious music video parody https://t.co/k2Qs8vqZpv https://t.co/bN7TvmBPGV @jkjohal64 Please watch tonight and play it LOUD in honor of Pete. This was so much fun to do but obviously we could never have done it without the original. You gotta give it up for Paul Rudd’s commitment to the original https://t.co/2YgWqSANeZ Love that dude Me and Paul Rudd do a shot-for-shot remake of Dead or Alive’s “You Spin Me Round” #LikeARecord #NoSpoilers https://t.co/CTnGLfmsV4 A present-day #TBT https://t.co/3JykILOiN4 New Headshots! https://t.co/4TY61TpbUK That’s tomorrow!! I’m so in!! https://t.co/1hfR37vti8 :) https://t.co/xDID7iBsYG Nice promo!! Thank you.  Want to move to America? https://t.co/2XJIly0Osw Have you SEEN THIS VIDEO? Wow. Dead or Alive - You Spin Me Round https://t.co/rP6IxipsAI Beat Saber with @brielarson! https://t.co/cUbZVykdz9 #FallonTonight This is happening tonight and part of what is happening tomorrow night. Enjoy. #FallonTonight https://t.co/qeEHRL2zYH TONIGHT! @brielarson is here to talk #AvengersEndgame and play a fun VR game, @wyattcenac stops by, and @WuTangClan performs! Plus, @Phillies' @bryceharper3 and I go head-to-head in a #MLBTheShow Home Run Derby championship! #FallonTonight https://t.co/jwemS52mQ9 .@arod and I take a hip-hop dance class together https://t.co/fszjmlVCg8 #FallonTonight Fun show tonight: @DrPhil, @sophiabush, @ninja and a performance from @maggierogers! Plus, @arod and I take a hip-hop dance class together! #FallonTonight https://t.co/xLGYHHElid We won 2 #Webbys!! Thank you to @TheWebbyAwards and everyone who voted for us! https://t.co/00yUZw1BSU Thanks for the original. Congrats on everything. https://t.co/b6APmkF69m New @Avengers mash-up to @Billyjoel's \"We Didn't Start The Fire\" https://t.co/5y9kTXld9d #FallonTonight RT @THR: 'Avengers: Endgame' cast sing \"We Didn't Start the Fire\" in comic strip mash-up https://t.co/pWvpNcx0u3 https://t.co/3nGfmD6ru7 .@NBC in 10 minutes. @BernieSanders and @Avengers and @billyraycyrus and @LilNasX !!! Watch the first 5 minutes. Turn it up. #FallonTonight #CNNTownHall #OldTownRoad  watch tonight!!! Record it!! Stop reading for a second to laugh https://t.co/TLQN7v1cvn Send it to everyone!!! RT it. It’s out now. And watch tonight for \n@Avengers END Game mash up - same show. #TonightShowStarringJimmyFallon #NBC https://t.co/4BHJVCyER4 Good writers, @theRoots and great production. “Old Town Hall” the @BernieSanders remix.  https://t.co/KJMvl6OSLO #FallonTonight New show tonight! New show tonight!! New show tonight!!! #FallonTonight #NBC RT @DEADLINE: Jimmy Fallon’s Bernie Sanders Pursues The Musical Vote With “Old Town Hall” https://t.co/8qyBBvJLI8 https://t.co/0NLKxUCRA5 I love that impression. And I love @thelonelyisland. https://t.co/XSr0X8cSuB Had to share ONE more @Avengers Mash-Up sneak peek! Can't wait for you to see it tonight!! #AvengersEndgame #FallonTonight https://t.co/1PFJO8YHed TONIGHT!! The @Avengers return for a new mash-up! #AvengersEndgame #FallonTonight https://t.co/zKCKTn0Mog We've got something big happening on the show every night this week!! So, at 3:00pm ET for the next 5 days, be on the lookout - I'm going share a hint of what's to come that night! It's gonna be a fun week! #FallonTonight TONIGHT: Nathan Lane, @pitbull, Philippe Cousteau (@pcousteau), and stand up from @LennyMarcusNYC! #FallonTonight I need help. 🤣 https://t.co/nNYrgjM1Sc First of many more moments!! Come back and play whenever. JF https://t.co/UQH22FJDVI TONIGHT! Michael Shannon, @janegoodallinst, @winnieharlow, and stand up from @jess_salomon!  Happy #ThankYouNoteFriday! #FallonTonight RT @FallonTonight: Jimmy is going to need a new shirt after @ChefJoseAndres tries to teach him how to drink out of a porrón #FallonTonight… In the porrón zone! @chefjoseandres https://t.co/DKZPrBHnQv The world needs more Hasan Minhajs. Congratulations! https://t.co/FCsMiL1Upg Can’t wait to see you buds!! You bringing any beverages? https://t.co/LxI1DsNLIJ That’s the best. Keep laughing. JF https://t.co/rf8N0LAuaW I actually hate this game. @KateBeckinsale 1st time on. She was a great sport and super funny!! ❤️ https://t.co/gl9Lt197m4 We have to talk. https://t.co/EOmzbTQ7lr RT @nbc: Don’t forget to cast your #Webbys votes for @FallonTonight! https://t.co/O98T6rmiDZ https://t.co/zo7a664Frg @wjrradio @PaulWJR @Jeff_Daniels Pleasure to meet you. I grew up on AM radio - keep doing what your doing. I’ll say hi next time I’m in Detroit. Thank you again for the kind words. Tonight: @Andy Cohen is here, Pete Davidson stops by, and @MarioAndretti, @MichaelAndretti &amp; @MarcoAndretti join! Plus, @ChefJoseAndres!! #FallonTonight Can You Feel it? with @KateBeckinsale https://t.co/6okiW8miRd #FallonTonight Great show tonight! @KateBeckinsale, @ralphmacchio, and spoken word poetry from @RudyFrancisco! #FallonTonight Tonight on the show: @AROD is here, @AshBenzo stops by, and @JadeBirdMusic performs!! #FallonTonight The merch stand was all out of my size but I really wanted a shirt, so I bought a 3XL Bon Jovi tee that I would occasionally wear to bed. #ConcertFail It’s Hashtags time - Tag a tweet with #ConcertFail and then tell us a funny or weird story from a concert or music festival. Could be on the show! Thank you for a fun show last night, @Cher! https://t.co/GVPwSfGXQu #FallonTonight @Nidhinaagar @nytimes Yeah. Not just for me but all the shows. These are all good jokes. I like that they do a best of late night. .@nytimes late night round up. I’m thankful that they do these. https://t.co/pzkRANzXZl RT @chefjoseandres: Hello people of New York! Join me tonight 6:30pm at @nyuskirball with @CapehartJ...FREE and open to the public! @Lin_Ma… @moonbeano Mine was Mary Tyler Moore. “A little song, a little dance, a little seltzer down your pants.” - Chuckles the Clown “For it to end, it must f%*king BEGIN!” - James R.R. Fallon #GameOfThrones https://t.co/i0kyi5hPje Just did it. #TheMasters Can’t stop eating and loving this MASTERS!!! #TheMasters #TacoTuesdaySunday https://t.co/Nhy9MCfnbq Kim Namjoon! Kim Seokjin! Min Yoongi! Jung Hoseok! Park Jimin! Kim Taehyung! Jeon Jungkook! BTS! @BTS_twt https://t.co/vPQ0feKg3E Nirvana Live at the Paramount, Beirut, The Specials, South Park and Little Walter on vinyl.  Basia, Easy E, Terence Trent D’Arby and Merle Haggard on cassette. Just because it’s Record Store Day doesn’t mean I can’t take a couple cassettes home with me. ❤️😁#RecordStoreDay2019 #InnersleeveRecords https://t.co/4kNSi78tjx Me again? https://t.co/i9IQQyiadb @MarkRonson Ha So, this is just torture? Ok, cool. https://t.co/uGxbAYsItt I met a new friend. https://t.co/oo0NbK9Jto RT @FallonTonight: .@DrewBarrymore and Jimmy take \"The Loco-Motion\" to Rockefeller Plaza in a lip sync surprise! 🎶https://t.co/lQMGjbe9VE h… Tonight on the show: #EmmaStone, @PollanFamily and @RealMikeFox! Plus, music from @TankandDaBangas! #FallonTonight #TBT https://t.co/8zH3A2Hv4r Today.. we honor #Gary! Happy #NationalPetDay to my dog, Gary, and to all of the pets out there that bring you love and happiness!! https://t.co/Yk7Ipm8Ku4 Might as well jump! Go ahead an' jump! @DrewBarrymore @FallonTonight #family #LipSyncSurprise https://t.co/NyEIdrm1Hc .@FallonTonight x @GameOfThrones \nWatch the full video:\nhttps://t.co/abOc37nwVr Nothing like @gloriafallon123 and I in sailor outfits to celebrate #NationalSiblingsday #StillSmiling https://t.co/oluFpL5Wah Tonight. @GameOfThrones x @FallonTonight https://t.co/ueVh0CogLY . @GameOfThrones x @FallonTonight (via @TMZ) https://t.co/EDfgnfbMt5 #IfIHadTheThrone I’d make it so instead of “Bless you” after someone sneezes, everybody has to say “Allergy Season is Coming.” #gameofthrones It’s Hashtags time! Tag a tweet with #IfIHadTheThrone and then tell us a funny or weird thing you'd do if you were in charge. Could be on the show! #gameofthrones You guys are the best to work with. Free Cone Day!!! #TonightDough https://t.co/NqlHf4ykMF RT @FallonTonight: .@RealHughJackman brings a whole new meaning to the phrase “flip a coin” https://t.co/z8Ki4N2330  #FallonTonight https:/… Amazing and productive day at the office! @MarchMadness #NationalChampionship https://t.co/vcb6DkGeAV Tonight on the show: @RealHughJackman, @ChrissyMetz, and Augusta National Women's Amateur Champion @JenniferKupcho and Runner-Up @MariaFassi0! Plus, music from @juiceworlddd! #FallonTonight RT @OnDIRECTV: ¡Esta semana regresan los episodios estreno de #FallonTonight! 😱\n\nMás entrevistas a celebridades. Más shows musicales y de c… Thank you so much. I still can’t believe. #RaceThroughNewYork https://t.co/vl1EJOImTC This is awesome!! https://t.co/4dGJiZxP27 Haaaa. I love Steve Winwood too! https://t.co/t9j32yxA3b Tiny hands, back again! Honored to present the @Variety Power of Women Award to honoree @GiGiHadid today! #PowerOfWomen #NYC https://t.co/IxxstS37Xn RT @FallonTonight: 👋 A tiny wave from Kit Harington is the only GIF you’ll ever need https://t.co/wHfv0sq8bs RT @FallonTonight: Watch @thegreatkhalid perform \"Talk\" from his new album #FreeSpirit https://t.co/FrWiVSk5q6 https://t.co/TAn8x5xuSx RT @joseramonmarmtz: Standing ovation for @thegreatkhalid! #FallonTonight https://t.co/nzosY7iyFD RT @FallonTonight: .@thegreatkhalid performs “Talk” from his new album “Free Spirit”🎤 https://t.co/FrWiVSk5q6 #FallonTonight https://t.co/c… Fun show tonight: Kit Harington, Elle Fanning &amp; music from @thegreatkhalid! #tbt #FallonTonight https://t.co/Ueg3UvvFwo I was scared for a sec. I’ll be watching them this Sunday. https://t.co/sHyHDG7o4q RT @STXEnt: Don't miss @kelly_clarkson talking about all things @UglyDolls on @FallonTonight TONIGHT! Check your local listings for showtim… Happy Birthday, Alec! https://t.co/0zYaAEiAvb Tonight on the show: Alec Baldwin (@ABFalecbaldwin) is here and @Kelly_Clarkson stops by to talk &amp; perform! #FallonTonight Ran into the Italian version of me - @alecattelan, and we had a good chat. Funny guy. #EPCC April 11! @SkyUno https://t.co/YDiioCMxmD Congratulations @Lin_Manuel.  We got a @TheWebbyAwards nomination for Two Goats In A Boat!! Do our wives get co-director credits? 🐐 🐐 #TwoGoatsInABoat https://t.co/4UcCW1310b So excited!! This Is Baby, the 3rd book in the Mama/Dada series, will be available on October 8th! Pre-order now or request it at your local bookstore! #ThisIsBaby https://t.co/V9zTk9IM0l https://t.co/srKkZUjl8Z Tonight on the show: Sam Rockwell, @KathieLGifford, and a performance from @OklahomaBway! #FallonTonight RT @FallonTonight: .@Maisie_Williams reveals a major spoiler about the last season of @GameOfThrones 👀#FallonTonight https://t.co/lKlqW4utYP Back this week with new shows! Tonight: @RealTracyMorgan is here and @Maisie_Williams stops by to talk #GoT! Plus, #Chiefs @PatrickMahomes and performance from @TheZombiesMusic! #FallonTonight Shelley Lazar was like no other. Really gonna miss her. She followed me to every cool show. Inside joke. Legend. Love. Oh my gosh love. Toldja. https://t.co/je5FK7PS5h RT @kobebryant: Wow! Just got the incredible news that The Wizenard Series has made it to #1 on the @NYTimes Bestseller List! I’m truly mov… Jump in! https://t.co/LB4nsaKjEv RT @FDNY: Thank you @JimmyFallon #FallonTonight for visiting #FDNY #Engine54 and #Ladder4 https://t.co/z3RJRQZYWV Box of Lies with @OfficialJLD! https://t.co/8EMB8aBQhP #FallonTonight Tonight! Julia Louis-Dreyfus (@OfficialJLD), @joelkinnaman, and a performance from the Broadway cast of @AintTooProud! Plus, some of your funniest #SpringBreakHaiku tweets! #FallonTonight What a team you’ve got? Loved them. Crush it on Saturday. CRUSH!! https://t.co/YVBl8IBsqW RT @RyanBartholomee: So @jimmyfallon and  @TheNotoriousMMA going together to a bar is something that I must see! March 25th can’t get here… RT @marchmadness: Saint Louis to the Sweet 16?\nOregon to the Elite 8?\n\n@jimmyfallon's bracket is locked in! What do you think? #MarchMadnes… Great performance last night from @findingfletcher. It was her TV debut AND her birthday! She crushed it!! \nhttps://t.co/TQ02Gs5K2B #FallonTonight Tonight on the show: @armiehammer is here, @AJemaineClement stops by, and a performance from @ScHoolboyQ! #FallonTonight Tonight!! @kobebryant, Aidy Bryant, @nataliemorales and a performance from @findingfletcher! #FallonTonight RT @discover_PR: Our Toro Verde Adventure Park and its \"El Monstruo\" zipline is no joke. Adrenaline junkies, if you need tips on how to gli… I tried to throw the\nPing pong ball in the cup, but\nI missed. Now I drink.\n\n#SpringBreakHaiku It’s Hashtags time! Tag a tweet with #SpringBreakHaiku and then write a funny or weird haiku poem about spring break. Could be on the show! RT @FallonTonight: Jimmy competes against @Atlantic10 Conference college basketball mascots in our first ever NCAA slam dunk &amp; 3-point-shoo… Great show tonight: @JordanPeele, Malcolm @Gladwell, @MarlonDuToit, and music from @sharonvanetten! Plus, highlights from the first-ever Tonight Show @NCAA Mascot 3-Point &amp; Slam Dunk Contests! #MarchMadness #FallonTonight Doing something fun with @TMobile! Share a screenshot of your most awkward text exchanges like your travel or vacation fails, funny group chats, or awkward break-up texts and tag it with #MyAwkwardTexts! Could be featured!! Tonight on the show! Oscar Isaac, Lilly Singh (@IISuperwomanII), and stand up from @jimmycarr! #FallonTonight I try to get #AvengersEndgame spoilers out of @MarkRuffalo with a lie detector https://t.co/RPHW3VwMna #FallonTonight Tonight!! Keira Knightley is here, Jon Glaser stops by, and music from @TheChainsmokers &amp; @5SOS! #FallonTonight I got stung by a bee on my eyelid minutes before going to Woodstock '94. I couldn’t see out of my right eye all weekend. #MyBadLuck It’s Hashtags time! Share a funny or weird story about a time you had bad luck and tag it with #MyBadLuck. Could be on the show! Back with all new shows this week! Tonight: @rickygervais, @karliekloss, and a performance from @marenmorris! #FallonTonight Love this guy. https://t.co/heBSRXkVLi Ha!! I like this! #ChimmyClock https://t.co/s7RwUXPbBV Got it!! Thanks! https://t.co/J8j2Mwk270 Already have one. I’m talking end table. https://t.co/dBevPnc5cH Hmmm. https://t.co/FUDJnqMNs4 Does it listen to me sleep? https://t.co/5HRMXs0sHZ People seem to believe that I should have this wooden digital clock. Hmm.  The wood of yore mixed with the tech of the 80’s. That says something about me, huh. https://t.co/2xjbDocg6T @ktnicks Yes Twitter help. I want a clock for my end table. It doesn’t need to have an alarm - I just would like to know what time it is. And none of that glowing light things. My kids wake me up before I can see that magic happen. Small is fine. I have books next to it that I haven’t read. If we must... https://t.co/vYIeJtyZCQ Jack - what’s next? Let’s think of something!! https://t.co/JDQtE3awdL Off, when you have kids, is more work than work. It started out as kindof a joke. But it builds their confidence and they get hungry for more books!! Good for you for reading. The MAMA one has a few more words. 🙂 https://t.co/t6iQoXUY9P Tonight: @RyanSeacrest, @jackwhitehall, and magic from @ShinLimMagic! Happy #ThankYouNoteFriday! #FallonTonight I can’t believe no one has mentioned the @KISSOnline posters on the wall! Ah well... https://t.co/0zUqRQFegh Um... I’m size 12. Just sayin’. https://t.co/e3umtCBqyu RT @JamBase: Kudos To The Wardrobe Director! Watch @Weezer, @JimmyFallon and @TheRoots cover A-Ha's \"Take On Me\" using classroom instrument… Haaaaaaaa. https://t.co/1o0rhcaZNk It was EPIC. I can’t even get into it. Ha! Miss ya brother. Come back and see us. So fun. https://t.co/z6ccGk2U0x RT @EW: Weezer, Jimmy Fallon, and the Roots take on 'Take On Me' with classroom instruments https://t.co/nnXxwC1tgT Tonight: John @mulaney is here for “True Confessions” with special guest Pete Davidson! @kevin_nealon stops by and a performance from @2chainz ft. @MarshaAmbrosius! #FallonTonight Tonight: @jes_chastain, @pattonoswalt, @KatyTurNBC and music from @GaryClarkJr! #FallonTonight RT @FallonTonight: Jimmy and @Weezer perform a barbershop quartet version of \"Buddy Holly\" \nhttps://t.co/WKA88S78qD https://t.co/HweE8OaKwH Baby Got Back Surgery #RuinASongWithOneWord It’s Hashtags time! Tell us a funny way to ruin a song with one word and tag it with #RuinASongWithOneWord. Could be on the show! Tonight on the show: @tylerperry, @Sarah_Hyland, and music from @Weezer! #FallonTonight Check out all the behind-the-scenes moments from last night's 5-Year Anniversary episode of #FallonTonight https://t.co/07oaY4C2y0  #NoFlipping Stay awake for 10 minutes!! All new show!! #Fallon5 #FallonTonight https://t.co/1WQ8Z3oWMa Watch our 5th Anniversary Show tonight!! Tina Fey, Ben Stiller, Robert Irwin, Robert DeNiro and Florida Georgia Line! #FallonTonight #Fallon5 https://t.co/UqYVWGcKIn RT @gavinpurcell: This will be fun. Happy 5th Anniversary @jimmyfallon @FallonTonight and all my old friends!! https://t.co/JMYwWRA0Sq RT @kayquinn: At 10:35, right after 5 On Your Side at 10, it’s a special behind-the-scenes @FallonTonight in honor of the show’s fifth anni… RT @FallonTonight: Jimmy is surprised to see @RedHourBen backstage &amp; checks in on #TinaFey ahead of the show. Tune in tonight for a special… Tonight! A special Behind-The-Scenes episode of #FallonTonight with Tina Fey, @RedHourBen, @RobertIrwin, Robert De Niro, and @FLAGALine! #NoFlipping https://t.co/zgKS2yieFA I cannot wait!!! https://t.co/2aRwQaFLKm Let me know what you think! https://t.co/xF3gUwrkZ9 Happy #ThankYouNoteFriday! @johnlegend is here to talk &amp; perform and @hasanminhaj stops by! #FallonTonight RT @Splitsider: Jimmy Fallon will mark the fifth anniversary of his Tonight Show with a special episode that doubles as a tribute to Garry… Monday, 2/25 - A special Behind-The-Scenes episode of #FallonTonight! #NoFlipping https://t.co/Z6YszqBdxb RT @DEADLINE: EXCLUSIVE: @FallonTonight will take viewers behind the scenes Monday night, in a special episode inspired by the 'The Larry S… I’ve always loved dominoes as a kid. Not so much the game but the knocking them down part of it. At max I probably had 30 dominoes. Here are thousands... Lily - you are brilliant. Thank you. (Give my best to your dad.) https://t.co/wR5ILhV4Sp RT @YouTube: Congrats on the milestone, @JimmyFallon. \n\nCelebrate with @FallonTonight and watch their insane domino trick. → \nhttps://t.co/… That was so fun last night!! I wasn’t quite sure if it would happen during the taping or not. I’m so happy it did. Those are the moments you don’t forget. Thanks. https://t.co/M88S1RnhKz Tonight on the show! @kenjeong is here, @KateUpton stops by, and talk and music from @AndersonPaak! #FallonTonight I love you!! Thank you!! 20 million!! Hey @YouTube, are you seeing what I’m seeing? 19.9 million subscribers!? Let’s push it over the edge and make history TONIGHT as the first late night TV show with over 20 million subscribers! #FallonTonight #20million RT @FallonTonight: Jake Gyllenhaal discusses joining the #Marvel family as Mysterio and his obsession with Tom Holland as #SpiderMan https:… Happy Birthday. https://t.co/NCGgA5FDM4 RT @HuffPostComedy: .@fallontonight has some 😂 campaign slogan suggestions for @sensanders https://t.co/Go8Wwe2qqx https://t.co/ES8kqJ9DLo Batman Begins Knitting. #ImproveAMovieWithOneWord Charlie Sheen and the Chocolate Factory. #ImproveAMovieWithOneWord A Starfish Is Born. #ImproveAMovieWithOneWord It’s Hashtags time - Tag a tweet with #ImproveAMovieWithOneWord and then add or replace one word to a movie title to make it funny or weird. Could be on the show! Tonight: Jake Gyllenhaal is here, Jennifer Carpenter (@J2thecarpenter) stops by, and music from @WALKTHEMOONband #FallonTonight RT @FallonTonight: We had @StephenCurry30 sneak 3 weird phrases into his @NBAAllStar interviews https://t.co/1vIIvNPnxd Haaaaaaa. https://t.co/nH958kzOOC @paulporowski @paulshaffer @FallonTonight @nbc Thank you. Keyboard - coming in HOT!! Nice job tonight guys. https://t.co/zcFZAw1cEi .@StephenCurry30 is the best. That’s all I can say. Check out the Tonight Show (@FallonTonight) and see his genius. Thank you again, Steph. #FallonTonight Yes it’s defective. I’ll get you another one ASAP! https://t.co/lj6bj3BuEf Congrats, Paul!! See ya tonight! https://t.co/mdDHrkbSz7 Tonight on the show: @Jeff_Daniels, @paulshaffer, and a performance from @wallowsmusic! #FallonTonight I gotta get you some new Tonight Show gear. https://t.co/fQZtkzgsKN We love you guys. Thank you for all that you do. https://t.co/FjqyccSvub RT @HuluTheaterMSG: .@jimmyfallon and his kids visit with @elmo, Grover and The Count today @SesameStLive! Make Your Magic! at @HuluTheater… Food or Not Food with @KendallJenner https://t.co/WQie6Oslhy #FallonTonight Tonight! @SteveMartinToGo &amp; Martin Short, @TimTebow, and a performance from @AvrilLavigne! #FallonTonight RT @TooFab: Watch @jimmyfallon nearly belly bump @priyankachopra through a wall during this HILARIOUS installment of \"Ew!\" https://t.co/JW8… RT @FallonTonight: Sara and her homeroom BFF Mia (@PriyankaChopra Jonas) share #ValentinesDay cards &amp; practice their @tiktok_us dance moves… .@GiGiHadid I have a new best burger in NYC for you tonight!! You’re gonna flip! 🍔 #FallonTonight RT @RealPaigeWWE: https://t.co/Ll6bksqcXc love this bad ass interview @StephenMerchant gave on @jimmyfallon last night! So surreal @Fightin… Tonight! Will Forte (@OrvilleIV), @GiGiHadid, @BlakeMycoskie and a musical performance by @gashi ft. @G_Eazy! Plus, Ew! with @PriyankaChopra! #FallonTonight .@AdamSandler surprised me with a song he wrote just for me. Dreams do come true. https://t.co/gsLTc3Rmqb #FallonTonight Tonight on the show: @AdamSandler is here, @StephenMerchant stops by, and music from @MetroBoomin ft. @1GunnaGunna! Plus, @BigBird joins and we’ll talk about the amazing work @sesameworkshop is doing! #FallonTonight Beat BATTLE w/ @RebelWilson! https://t.co/CWcZfKTLly #FallonTonight #IsntItRomantic #BeatBattle Beat Battle with @RebelWilson!! https://t.co/CWcZfKTLly Great show tonight! Watch on NBC now! #FallonTonight https://t.co/yVpq97yvMW RT @JustJared: .@RebelWilson is going head-to-head with @jimmyfallon in an intense game of Beat Battle! Watch now: https://t.co/uR2ced2EHm Tonight on the show: @RebelWilson is here, @WillieGeist stops by, and stand-up from @Nathanmacintosh! Happy #ThankYouNoteFriday! #FallonTonight Can You Feel It? with @KimKardashian! https://t.co/MuyhV2dKRb #FallonTonight Can you FEEL it? with @KimKardashian on #FallonTonight https://t.co/Y7B9XuvKLV You????!?!! Me!!!!!!! Bonded for life. Thank you again for playing. #FallonTonight https://t.co/m87hB68D5J RT @mashable: Liam Hemsworth knows he's easily mistaken for his brothers https://t.co/DDxjQ58pY2 https://t.co/sDubddmr2n TONIGHT! @KimKardashian, @JimCameron, and @ChristinaTosi! Plus, your funniest #MisheardLyrics tweets! #FallonTonight Catchphrase with @LiamHemsworth, Jessica Williams, and @RobGronkowski! https://t.co/eLvZmG9D3y #FallonTonight Oh it’s on. Whatever he thinks needs to happen will. https://t.co/roSUJMxojA No words back. Disco ball? I mean... come on!! Thanks. https://t.co/QQGB4lFgEu Tonight on the show: @LiamHemsworth, Jessica Williams, @RobGronkowski and music from @ronniemilsap ft. @littlebigtown! #FallonTonight Post #SOTU monologue and Savannah Guthrie take on the speech right now. #FallonTonight I used to think it was “Rocket Man, burnin’ down his fort of traffic cones.” #MisheardLyrics It's Hashtags time! Tell us about a song lyric you or a friend misheard and tag it with #MisheardLyrics. Could be on the show! Tonight! We have an all-new monologue after the State of the Union, with reaction from @savannahguthrie. Plus @priyankachopra, @hwinkler4real, and a performance from @lizzo! #FallonTonight Tonight! Christoph Waltz is here, @McIlroyRory stops by, and a performance from @TheBandsVisit! #FallonTonight Thank you, @sesamestreet! https://t.co/q9rMDxUB53 If you want to try the Instant Pot Chili recipe for yourself check it out here: https://t.co/qH7YbLQJZV Slow Cooker vs. Instant Pot! Thanks to @JohnLegere and @TMobile for having me for a special #SlowCookerSunday!! Watch it here https://t.co/9PZcUbfn9a #SuperBowl #PAMshuffle #IN!!!! Happy Super Bowl Sunday!! #SuperBowl .@JohnLegere Happy #SlowCookerSunday #SuperBowl edition! Are you ready for this? Wanna tell us what you’re making? It starts in like... 10 mins on Facebook. Starting soon... fish sauce and cocoa powder in a chili?? If you are playing the umami drinking game get ready. https://t.co/IV9wbz1qfJ Haaaa. Okay, I’m in!! My pups predicted a close game. Enjoy. https://t.co/WMOrnxZOm2 That was a blast!! Thanks for the fun. #PAMshuffle #SlowCookerSunday https://t.co/DzRA1tcaKX RT @HuffPostComedy: Jimmy Fallon jumped into character as former Starbucks CEO Howard Schultz for a spoof presidential campaign ad. https:/… Tonight!! @AnthonyMackie is here, @TimGunn stops by, and stand up from Matthew Broussard (@mondaypunday)! Happy #ThankYouNoteFriday! #FallonTonight RT @FallonTonight: .@Danwhitemagic plays musical chairs with Jimmy and @theroots: https://t.co/Atz9UqiBmm https://t.co/75biicUTzz Done! I'm at 30 Rock. I'll leave the door open for you! https://t.co/QDHA36N2wF #SuperBowl is coming up and I'm making the best Instant Pot Chili! Who else is making something on Sunday?? Tonight: @sethmeyers, @DanaiGurira, and magic from @Danwhitemagic! Plus, your funniest #WorstSuperBowlPartyEver tweets! #FallonTonight Follow this man on Twitter and Instagram!! @kenanthompson He’s jumping in!! Welcome him!! https://t.co/DHGIfOD2Su RT @etnow: .@LuisFonsi and @jimmyfallon rewrote #Despacito as an ode to Flamin' Hot Cheetos, and it's truly 🔥🔥🔥! https://t.co/PxY8Phb8wy RT @FallonTonight: .@LuisFonsi and Jimmy try out new lyrics to his hit song #Despacito! #FallonTonight https://t.co/Jy7GP4JVJn Love ya Wally. https://t.co/IZlGcvnU98 RT @Jeopardy: Only 3 weeks until our first-ever team tournament! The Jeopardy! All-Star Games presented by @Consumer_Cell start February 20… We love this!! Thank you for telling me. Vacation in Puerto Rico!! https://t.co/uHKCKEEVE6 One year I mixed canned clams with ketchup to make \"clam dip.\" My mom promised everyone at the Super Bowl party would love it. She was wrong. #WorstSuperBowlPartyEver It’s Hashtags time! Tag a tweet with #WorstSuperBowlPartyEver and share a funny or weird story about your worst Super Bowl party experience. Could be on the show! Fun show tonight! @kenanthompson is here and @LuisFonsi stops by to talk and perform! #FallonTonight 13-year-old Alysa Liu reacts to becoming the youngest ever U.S. Figure Skating Champion https://t.co/p1gLSnaE2i #FallonTonight Tonight on the show: Matthew Broderick, Spike Lee, @maddieziegler, and 13-year-old US Figure Skating Champion, Alysa Liu! Plus, music from @YoGotti ft. @lilbaby4PF! #FallonTonight What's Behind Me with @SHAQ  https://t.co/lLxilAExfH #FallonTonight Tonight: @SHAQ is here, @iamcolinquinn stops by, and @21savage performs #FallonTonight Yes. Yes. Yes. Agree. https://t.co/vXnO35vVvz RT @VirginRadioKW: #backstreetboys in chicken suits with @jimmyfallon\nthis is why I love the internet &lt;3 \n\nhttps://t.co/zD3i0fbgfq RT @WWE: Don't miss The @BellaTwins TONIGHT at 11:35pm ET on @FallonTonight with @jimmyfallon! #TotalBellas @nbc https://t.co/SpbolbqMqS I see what you did there... thanks!! https://t.co/wM8Apbks3E The @backstreetboys are in our #DNA. So are 🐓 ‘s. Congrats on the new record. (And the Grammy nom!) https://t.co/CeOLHdhwlL The Teal album by @Weezer just won the weekend with surprise album of 80’s cover jams.  Love it! https://t.co/a0HgjAS4eA Tonight on the show: @matt_leblanc, @BellaTwins, and stand-up from Jo Firestone (@kingfirestorm)! Plus, it's #ThankYouNoteFriday! #FallonTonight Tonight: @jadapsmith is here and music from @backstreetboys! Plus, your funniest #ItShouldBeIllegalTo tweets! #FallonTonight RT @FallonTonight: .@RobertIrwin returns to Studio 6B with some amazing animals! https://t.co/AndbJlQx0q https://t.co/kJOmWWiWF5 Tonight on the show! Molly Shannon, @ZacharyQuinto &amp; animal expert @RobertIrwin! #FallonTonight Thank you again for what you are doing and have done. This guy is unbelievable. Please RT. https://t.co/UaB5vO2e7v I will see you again soon, hopefully. Next time, dinner is on me! https://t.co/LhGb6FU8lz RT @HuffPost: The view from the White House, as channeled by Jimmy Fallon. https://t.co/VzqUOAiCwJ #ItShouldBeIllegalTo text someone \"Happy Birthday\" without an exclamation point. It’s Hashtags time! Tag a tweet with #ItShouldBeIllegalTo and then say a funny, weird or annoying thing that you think should be made illegal. Could be on the show! Tonight! Gina Rodriguez (@HereIsGina), Lil Rel Howery (@LilRel4), and music from @brothersosborne! #FallonTonight RT @FallonTonight: .@KerryWashington announces that @AmericanSonPlay is being adapted for @Netflix! https://t.co/lLPFGKrzX1 Tonight on the show: @KerryWashington is here, @itsjojosiwa stops by, and @joejacksonmusic performs! #FallonTonight RT @biglew8: @Lin_Manuel @jimmyfallon Please help share. Thank you. https://t.co/skXD3sVAxY Tonight! @ElizabethBanks, Sebastian Maniscalco (@SebastianComedy), and a fun demo with @MarthaStewart! Happy #ThankYouNoteFriday! #FallonTonight RT @FallonTonight: .@RachelBros is a level 37 Pokémon GO master #FallonTonight https://t.co/fqYs8MT6Bg I’m in!!! See ya next week! https://t.co/QfNTmRqbq0 Tonight on the show: @RachelBros, @howiemandel and stand-up from @roywoodjr! Plus, your funniest #7WordSuperpower tweets! #FallonTonight RT @FallonTonight: .@TheRock puts Jimmy, Higgins, &amp; @blackthought to the test by inviting them to take The @nbctitangames Challenge! #Fallo… The best things are built with love. We had no idea what our show would be or how it would be received. The feedback has been massive. I hear you. Thank you. And thank you to the people who have watched THIS show multiple times. #TonightShowPuertoRico RT @accessonline: .@jimmyfallon talks that intense zip line ride and joining forces with #Hamilton in Puerto Rico! https://t.co/HQvMqFG6pr… Happy birthday to one of the GOATS, @Lin_Manuel!!!  🐐 🐐 Tonight! @DonCheadle is here and talk and performance from @RitaOra! #FallonTonight RT @latimesent: Yep, @JimmyFallon shot an entire episode of @FallonTonight in Puerto Rico, timed with @HamiltonMusical's run in the wake of… RT @rubenjcarbajal: Favorite video ever https://t.co/6xAYcfomfP RT @FallonTonight: Here's more info on how you can support Puerto Rico: https://t.co/L6iTaiWxQq #TonightShowPuertoRico RT @FallonTonight: ⚡️ \"#TonightShowPuertoRico\"\n\nhttps://t.co/nC9I4COV9N RT @FallonTonight: Jimmy, Bad Bunny, @Questlove, &amp; @BlackThought perform \"MIA\" on the streets of Old San Juan! #TonightShowPuertoRico https… Are you watching? #HamiltonPr #TonightShowPuertoRico RT RT @jimmyfallon: I love you Bad Bunny!! That was one of my favorite things I’ve ever done. Ever. #TonightShowPuertoRico #BadBunny #MIA RT @FallonTonight: .@JimmyFallon and @BlackThought ride the world's second-longest zip line while in #PuertoRico!! https://t.co/tRm5KSn0NB… Olé. #TonightShowPuertoRIco #HamiltonPR I love you Bad Bunny!! That was one of my favorite things I’ve ever done. Ever. #TonightShowPuertoRico #BadBunny #MIA Trending number 3 - might as well trend number 1. #TonightShowPuertoRIco Watch our show now... we hope you like it. #TonightShowPuertoRico #HamiltonPR RT please. I can’t even with you right now.  Thank you thank you thank you. https://t.co/YNLcCpNK2w #ZipLineFail  https://t.co/Rkdc53Vg8t #TonightShowPuertoRico Inspirado por #TonightShowPuertoRico https://t.co/MPNpBEBLad RT @chefjoseandres: Thanks to my amigo @jimmyfallon for joining me @Lin_Manuel @HamiltonMusical @Ozuna_Pr and many others on @FallonTonight… Always fun hang with @gabegutierrez. Watch @NBCNightlyNews right now for the full story!! #TonightShowPuertoRico https://t.co/6hLz5mbZmt Inspirado por  #HamiltonPR #TonightShowPuertoRico https://t.co/SVAYFXivzo RT @FallonTonight: An exclusive first look at #TonightShowPuertoRico! https://t.co/USldqlIBjR https://t.co/mAPwLVWpeW I got it on the first coat flip, so, I am not gonna retake this... shot! No I’m NOT gonna retake this... shot! #HamiltonPR #TonightShowPuertoRico https://t.co/BOLbr0EpSi Tonight we’re in #PuertoRico with @Lin_Manuel, @ChefJoseAndres, music from Bad Bunny, José Feliciano + @Ozuna_Pr, a performance from @HamiltonMusical, a crazy zip line ride, and much more! #TonightShowPuertoRico🇵🇷 RT @Lin_Manuel: 🐐🐐...🐽🐽 https://t.co/Ww9vwLDXhX RT @APEntertainment: .@jimmyfallon says today's #TonightShow special episode filmed in Puerto Rico will feature lots of music and urge peop… Two Hams on the 'gram https://t.co/Q1QUtkMSmU #TonightShowPuertoRico #HamiltonPR Ability to immediately skip every Internet ad. #7WordSuperpower It’s Hashtags time! Use the hashtag #7WordSuperPower and send in a funny or weird seven-word-long superpower. Could be on the show! RT @HamiltonMusical: It's an all Puerto Rican episode of @FallonTonight! @JimmyFallon joins @Lin_Manuel and the cast of #HamiltonPR in San… RT @chefjoseandres: Big news! We will open a kitchen on Pennsylvania Ave this week to join private sector effort to feed federal employees… I’ll be right there. Don’t move. https://t.co/1Qx91ThJdg Tonight: @SamuelLJackson is here, @JuddApatow stops by, and @MOMOMOYOUTH performs! #FallonTonight Thank You #PuertoRico!! Can’t wait to share all the amazing experiences on Tuesday’s show! #HamiltonPR #TonightShowPuertoRico https://t.co/x0LKmYFm2I RT @jimmyfallon: @ricardorossello @FallonTonight Thank you so much for hosting me and introducing me to your beautiful family. Tell the Fir… @ricardorossello @FallonTonight Thank you so much for hosting me and introducing me to your beautiful family. Tell the First Lady I love the sombrillas! https://t.co/CgX88H5OUX Happy Birthday Alexander Hamilton. #HamiltonPR #TonightShowPuertoRico https://t.co/kyrAzNsmCj Tonight: @michaelb4jordan is here, @CobieSmulders stops by, and stand-up from @SeanyFinnerty. Happy #ThankYouNoteFriday! #FallonTonight RT @FallonTonight: .@lanacondor and @noahcent made a real-life \"To All the Boys I've Loved Before\" pact #FallonTonight https://t.co/upk2GJ9… Oooh @lovejonesband has 200 followers. 200!!!\nI bet we can beat that. Follow @LoveJonesBand and they will write an original song every Wednesday. For a little bit. Big show tomorrow. But I LOVE them. Watch em tonigjt!!!  #FallonTonight RT @Lin_Manuel: Wait a minute that’s MY outfit @jimmyfallon we TALKED about this https://t.co/Jv4awqOuIi Tonight: @BryanCranston, @lanacondor &amp; @lovejonesband performs! Plus, your funniest #5WordResolution tweets! #FallonTonight Ha. Thanks. That first zap came in a little hot. Sorry, @GwynethPaltrow. It looked like a leaf blower was aimed at her mouth. She’s a good sport. https://t.co/Wx2hNvh9Iq Slay It, Don't Spray It with @GwynethPaltrow!! https://t.co/Wha6OCXusS #FallonTonight I’ll take the hit on losing in the duet round. My “Hey Ya!” moves are rusty. https://t.co/6EqwyZglXL Hey, @GwynethPaltrow!! You’re on my show right now!! #FallonTonight https://t.co/8JUvhSDFNo RT @MacKidsBooks: Don't miss EVERYTHING IS MAMA by @JimmyFallon, now in board book! https://t.co/kMVycAspnB #MAMABook https://t.co/y4U5fyQ2… Tonight: @GwynethPaltrow, @MrTonyHale, and music from @trippieredd!  #FallonTonight https://t.co/ltLa79NF9n #FallonTonight #IfYouLikePiñaColadas https://t.co/DadaVFo8tp RT @TooFab: Andy Samberg injects new life into @JimmyFallon's \"Escape (The Pina Colada Song)\" with HILARIOUS callbacks after EVERY. SINGLE.… RT @Google: Calling all lovers, dreamers and doodlers: #DoodleForGoogle is officially open for 2019! Kick things off with contest judges @F… RT @billboard: Watch @Meghan_Trainor, @iamjohnoliver, @RachelBros &amp; @MumfordAndSons sing \"Since U Been Gone\" on @FallonTonight https://t.co… RT @Complex: Jimmy Fallon, Lindsay Lohan, and The Roots take #BirdBox parodies to a new level: https://t.co/mJgEhCDNQR https://t.co/P9Vwz21… Great show tonight! Andy Samberg (@thelonelyisland) is here, @alfonsocuaron stops by and @DanAndShay perform! #FallonTonight RT @FallonTonight: Turn It Up with @kelly_clarkson, @SHAQ, @RachelBros, @iamjohnoliver, @Meghan_Trainor, @MumfordAndSons, @anthonyanderson… RT @FallonTonight: Jimmy &amp; @KermitTheFrog are teaming up to judge this year's Doodle for @Google contest. Head to https://t.co/CwA4UXnqPE t… Playing nothing but the hits tonight with my favorite frog, @KermitTheFrog. #FallonTonight https://t.co/FxOmbXIdwb Replace bacon with healthy bacon. #5WordResolution It’s Hashtags time! Use the hashtag #5WordResolution, and then send in a funny New Year’s Resolution that's just five words long. Could be on the show! Excited to be back this week with new shows!! Tonight: James Spader, @lindsaylohan, and music from @noname ft. @smino and @sabapivot! #FallonTonight Cannot wait to watch Andy @thelonelyisland  and @IamSandraOh on the @goldenglobes tonight!!! I hope I win!! #GoldenGlobes RT @MusicNewsRumor: Dan + Shay will perform #Speechless on “The Tonight Show Starring Jimmy Fallon” on Tuesday, January 8! @FallonTonight @… RT @NFL: Happy 38th Birthday to @Giants QB Eli Manning! 🎉🎂 https://t.co/seSX7dXQhk Always finish strong. https://t.co/jFOhzJV2SY They are the best quality playing cards that money can buy my friend. I wish you luck with whatever you will do with them. (Gamble, Magic, House?) https://t.co/cizyKIuX9h To the kids that honked and waved at me just now - thank you. You also gave me my 2019 New Year’s resolution: to honk and wave at more people. #mademyday Well this was nice. Thank you! https://t.co/LWV3pF5ISG Happy 2019!!! Happy New Year!! I know your plans don’t include me - but - we’ve got TONIGHT.  Love you. https://t.co/N1HM5wqHUi Oooohhhhhhhh my man #JIMIN (@BTS_twt) with a solo jam!! I love it. Congrats!! 💜Your brother, Chimmy https://t.co/PW9swb0cJN Tonight Show Retro Game Challenge vs @Ninja. Some of the best (and worst) games and consoles of all time. We go from Pong to @SEGA Genesis Olympics, @NintendoAmerica Goldeneye and @PlayStation @RocketLeague. Who wears the headband? https://t.co/IeikazE7Yd Watching the best of 2018 #FallonTonight now. Haaaa!!! Thank you my brother. It’s delicious right? #TonightDough https://t.co/CdVKvuVhEw Tonight! We're looking back at our favorite moments from #FallonTonight in 2018 featuring @ArianaGrande, @chadwickboseman, and @priyankachopra! Thank you for a great year!! RT @THR: Watch @MileyCyrus meet up with @jimmyfallon to point out some of the lyrics to \"Santa Baby\" she had questions about before perform… RT @jtimberlake: That time again. Bring it down to Wrappingville. #TBT @nbcsnl @jimmyfallon https://t.co/iK8rJMXMcS Tonight! Felicity Jones, @jimmycarr, and music from @BebeRexha! Plus, a new take on a Christmas classic with @MileyCyrus and @MarkRonson! #FallonTonight RT @FallonTonight: Jimmy and @HaileeSteinfeld go head-to-head in a Beat Battle! #FallonTonight https://t.co/f6gKcAcVrt https://t.co/I3uVyRl… RT @THR: .@MichelleObama and @jimmyfallon surprise fans riding the elevator during NBC tour https://t.co/uEqOUdP4M3 https://t.co/uAxAMZKIaJ Horatio wrote this based on a gift I received from my agents at CAA. One of the funniest people I’ve ever met in my life. And the other guys are just icing. So lucky to get to play with this caliber of comedy. Thanks for liking and spreading joy. https://t.co/4mqclYBfsZ RT @EW: Watch Ariana Grande join @JimmyFallon and #SNL alums to recreate classic holiday sketch https://t.co/MDGRnGz5C9 RT @klgandhoda: This totally brightened our #WinesdayWednesday! @jimmyfallon and @MichelleObama surprised visitors at 30 Rock and it was th… RT @JustJared: .@jimmyfallon and @MichelleObama got some 30 Rock tourists excited with unexpected surprises on @FallonTonight - Watch here:… Tonight!! Willem Dafoe stops by and @HaileeSteinfeld is here to talk and perform! #FallonTonight Elevator Surprise with @MichelleObama! https://t.co/KxmjFCrNu3 #FallonTonight RT @FallonTonight: .@arianagrande joins Jimmy, @MrHoratioSanz, @RealTracyMorgan, and @ChrisKattan in recreating \"I Wish It Was Christmas To… It was 20 years ago today. I love these dudes sooooo much. Get that holiday spirit!!!! Thank you @MrHoratioSanz, @ChrisKattan, @RealTracyMorgan and newbie @ArianaGrande. #IWishItWasChristmasToday https://t.co/hcowLugGzf .@MichelleObama is here! @arianagrande stops by! If only it were Christmas today... @MrHoratioSanz, @RealTracyMorgan, @ChrisKattan, what can we do about this?? #FallonTonight https://t.co/HhbRcfvoWb .@arianagrande stopping by #FallonTonight!? imagine a world like that https://t.co/soRlFjQwYl #AllIWantForChristmasIs a CVS receipt that isn’t longer than a Harry Potter book. It’s Hashtags time! Use the hashtag #AllIWantForChristmasIs, and then fill in the blank with a funny or weird thing you want for Christmas. Could be on the show! RT @Dexerto: Twitch sensation @Ninja teaches @jimmyfallon the Pon Pon dance during appearance on The Tonight Show! 🕺🕺 https://t.co/0z2YA57D… Tonight!! @MichelleObama is here and we’ve got a lot of fun surprises planned along with a few special guests! Do not miss! #FallonTonight RT @Lin_Manuel: 🇵🇷🇵🇷🇵🇷🇵🇷🇵🇷🇵🇷🇵🇷🇵🇷🇵🇷🇵🇷🇵🇷🇵🇷 https://t.co/josA6G6LlH RT @FallonTonight: Jimmy &amp; @Lin_Manuel sing holiday parodies of @Migos, @ArianaGrande &amp; @iamcardib: https://t.co/73PoDwx93s #FallonTonight… RT @BroadwayWorld: Watch @Lin_Manuel and @JimmyFallon sing some of the year's top hit songs with a holiday twist!\nhttps://t.co/Su4h9lZZEc RT @TooFab: We can't get enough of @Lin_Manuel and @JimmyFallon singing holiday remixes of Cardi, Ariana, Shawn and so many more!\nhttps://t… It has been for years - also if you buy my @benandjerrys Tonight Dough ice cream all of my proceeds go to @SeriousFunCamps as well. I can buy a couple and send your way! Hope you like it! https://t.co/7oDOA6Im7k RT @Neuro2343: I cant stop smiling...i love this so much😄😄😄😄 #FallonTonight RT @DoReMiJackie: I CANT BELIEVE THE SHOW IS GOING TO PUERTO RICO THATS SO INCREDIBLE #FallonTonight RT @itsafallonthing: THE TONIGHT SHOW IS GOING ON THE ROAD AGAAIIIINNN!!!! RT @billboard: .@FallonTonight is heading to Puerto Rico for a special \"Hamilton\" &amp; hurricane relief episode https://t.co/0kAFbSfqBj https:… RT @westlifebunny: Pretty sure @Lin_Manuel and @jimmyfallon are my favorite pairing! That holiday medley was SO GOOD. #FallonTonight 🐐 🐐’s on a 🚣‍♀️ #FallonTonight #FallonTonight right now. @Ninja Fun times. #NBC Stephen Miller’s spray-hair gets out of control on Face the Nation. #FallonTonight https://t.co/AKk4BYmXG5 Tonight, @Ninja and I talk @FortniteGame, @blackthought crushes and @Lin_Manuel and I talk @MaryPoppins and sing the most popular songs of 2018 with holiday lyrics. I hope you enjoy. #FallonTonight #NBC We ❤️ you Puerto Rico!! See you very soon. #TonightShowPuertoRico https://t.co/uGaYwNSTVo I think we did a thing. Always fun seeing you pal. https://t.co/9DAspyj6mI I lived inside your head for a bit. You know it. I got in there. https://t.co/TK7e9cVwup Just saw @MaryPoppins - @Lin_Manuel is magical. Check him out tonight for a fun holiday mash-up. Also - a really big announcement from @FallonTonight. #MaryPoppinsReturns #FallonTonight Dude... PONG. https://t.co/GE4iKNn37t Big shows tonight and tomorrow!! Tonight Me &amp; @Lin_Manuel have a big announcement, @Ninja and I talk #Fortnite. And, Tomorrow we have @MichelleObama plus a super surprise guest &amp; more #IDontCareWhatYourMamaSays 🎹🎅 ??? #FallonTonight Tonight! @Lin_Manuel Miranda, @Ninja, and music from @blackthought ft. @salaamremi! #FallonTonight We have a big announcement with @Lin_Manuel and a fun holiday song round up on the Tonight Show tonight. Set your DVR’s. #FallonTonight RT @JBALVIN: REGGAETON #reggaeton https://t.co/e2Z42hRTta Name That Song Challenge with @MileyCyrus https://t.co/0Xy7bSHORl #FallonTonight RT @nbcsnl: RT if you wish it was Christmas today. https://t.co/IiKIcZ0orV Great show tonight! @MileyCyrus is here, @ReginaKing stops by, and a performance from @chloexhalle! #FallonTonight Wooooowww. Well done. Never saw that one coming. #Jimberflake haaa. https://t.co/7NBbf5zX3q RT @rockcenternyc: In case you missed it: @jimmyfallon teamed up with Lingua Franca to donate $100 from every \"Tonight Show\" sweater sold t… I was actually frightened. I do not like that game. 😟 https://t.co/TTFb8PRfn9 Can You Feel It? with @JLo and @MiloVentimiglia https://t.co/pBNRxTs5eX #FallonTonight Great show tonight! @JLo is here, Robert Klein stops by, and @JBALVIN performs!! #FallonTonight Thanks again @kelly_clarkson, @adamlevine, @IAMJHUD, @blakeshelton, @CarsonDaly, @NBCTheVoice and @theroots. I can’t believe we pulled off that a cappella MASH UP!?!!!? You guys can sing! https://t.co/G20a3tofVO #FallonTonight #FallonMashUp #TheVoice Feeling that @HootieTweets bump. I get it. https://t.co/4wpFEsjBoj My SUPER thanks to @kelly_clarkson, @blakeshelton, @adamlevine, @IAMJHUD, @CarsonDaly, @theroots and everyone at @NBCTheVoice!! It turned out fantastic!! Stay tuned to see!! #FallonTonight #TheVoice #FallonMashUp RT @FallonTonight: Jimmy &amp; The Roots prove #TheVoice Coaches not only work great together, but sound great together with an epic #acappella… Tonight! John @mulaney, @VanessaHudgens, and a performance from @Grimezsz!#FallonTonight You’ve seen my moves. I need help. But I’ll take your lead. https://t.co/1r4WKqdjyJ RT @POPSUGAR: Amber Heard proves that she's a spicy queen on @FallonTonight. https://t.co/d2YsJfGYbX TONIGHT! @icecube, @realamberheard, and @ElvisDuran! Plus, @icecube performs! Happy #ThankYouNoteFriday! #FallonTonight Trident Throwing with Jason Momoa! https://t.co/v5MKQmalYk #FallonTonight Fun show tonight: Jason Momoa, J.K. Simmons, and stand-up from @joemachi! Plus, your funniest #DecorationDisaster tweets! #FallonTonight Tonight! @Andy Cohen is here and @johnlegend stops by to talk + perform! #FallonTonight RT @jimmyfallon: Getting in the holiday spirit. https://t.co/6PIJZ7ReVF Getting in the holiday spirit. https://t.co/6PIJZ7ReVF I once spent three hours carefully putting lights on the tree. When I finally plugged them in I found out that none of the lights worked anymore. #DecorationDisaster It’s Hashtags time! Tweet out a funny or weird time you had a holiday decoration disaster, and tag it with #DecorationDisaster. Could be on the show! TONIGHT! Saoirse Ronan, @russwest44, and a performance from @alessiacara! #FallonTonight Loaded Questions with @MargotRobbie! https://t.co/fSllJkJOA4 #FallonTonight RT @APEntertainment: Rock band #Hootie&amp;theBlowfish (@HootieTweets) return with new album and tour.\nhttps://t.co/IUuMsGLRBr RT @GIPHY: Wonder what GIFs took 2018 by storm?! We've recapped the Top 25 of the year just for you! \n\nSee where your faves stacked up: htt… Fun show tonight: @MargotRobbie is here, @ElsieKFisher stops by, and music from @HootieTweets! #FallonTonight Let’s talk... https://t.co/AZ1RdcwHbq @RobertIrwin Happy birthday pals! Fun show tonight: @DollyParton is here to talk &amp; perform and @nickkroll stops by! Plus, it's #ThankYouNoteFriday! #FallonTonight Claire Foy knows all the lyrics to Rapper's Delight! https://t.co/AHjOUiS7Ig #FallonTonight Tonight on the show: Claire Foy, @birbigs and stand-up from @jfishercomedy! Plus, your funniest #AirportFail tweets! #FallonTonight Ice T reacts to everyone freaking out about him never eating a bagel https://t.co/ojQccv7tzc #FallonTonight RT @QuiveringSteele: Hey all, my boss @IncredibleCulk is legally changing his middle name, and you can tell him what to change it to. \n\nThe… TONIGHT! Ice T (@FINALLEVEL) and @Mariska Hargitay, Macaulay Culkin (@IncredibleCulk), and a performance from @JIDsv ft. @BJTHECHICAGOKID &amp; @Thundercat! #FallonTonight RT @FallonTonight: Donald Trump pays tribute to his \"doppelgänger\" Elvis Presley with a special version of \"Jailhouse Rock\" #FallonTonight… You go pal. I always miss you. https://t.co/Fs3EuAU28P A friend I was traveling with was told his carry-on was over the weight limit. So he took out some of the clothes in his bag and wore 4 jackets and 3 pairs of pants on the plane. #AirportFail It’s Hashtags time! Tweet out a funny or weird thing that’s happened to you at the airport, and tag it with #AirportFail. Could be on the show! Great show tonight! @iamjohnoliver is here, @RachelBros stops by, and music from @MikeWiLLMadeIt, @goSwaeLee &amp; @youngthug! #FallonTonight Tonight on the show: @TheGlennClose, @dopequeenpheebs, and music from Blood Orange #FallonTonight RT @FallonTonight: Jimmy takes Bob Dylan to the circus https://t.co/AUcShNkvua Happy Thanksgiving! https://t.co/qJRFzXJbWE The Elephant float is my favorite so far this year. #MacysDayParade Happy Thanksgiving!! Wait until you see our show tonight. @JerrySeinfeld, @BrianReganComic, @RobertIrwin and his animals and someone I can’t even tweet about right now - I’m not ready. One of my favorites ever. #HeavensDoor #FallonTonight .@RealSophiaRobot and I sing the first late night human/robot duet https://t.co/HDolZnAnAu #FallonTonight Tonight! @ofctimallen is here and @MeekMill performs! Plus, the return of @RealSophiaRobot and a special Thanksgiving Hashtags! #FallonTonight RT @kerrywashington: Hey Tweeple Let’s join @Toms &amp; @JimmyFallon and #EndGunViolenceTogether. \nHead on over to https://t.co/6Q3nss11G6 to s… Get pumped for the show tonight!! All new with @michaelstrahan and music by Takeoff!! #FallonTonight https://t.co/VEKzyADDhZ (Sir Mix-A-Lot, “Baby Got Back”)\nI like turkey and pumpkin pie\nKeep the gravy pouring the whole time\nAnd when my mom walks in with whipped cream to taste\nThere’s a big grin on my face \nI get HUNG-Gry to eat it up \nUntil I get completely stuffed. \n#TurkeyRaps It's Hashtags time - Tweet out funny parody rap lyrics about Thanksgiving and tag with #TurkeyRaps. Could be on the show Tonight: @michaelstrahan is here, @MichaelAngarano stops by, and a performance from @1YoungTakeoff #FallonTonight RT @BlakeMycoskie: Thank you @jimmyfallon for taking action to #endgunviolencetogether and sending the first postcard through https://t.co/… Go to https://t.co/IMgAZSzXXh and send a postcard. It takes 5 seconds. You can make a change. https://t.co/AoflDH0izi Tonight: Mahershala Ali, @chriscolfer, @BlakeMycoskie, and a performance from @michaelbuble! #FallonTonight TONIGHT! Benicio Del Toro stops by and @MariahCarey is here to talk and perform ft. @tydollasign! Happy #ThankYouNoteFriday! #FallonTonight RT @FallonTonight: Jimmy announces the #SharpieChallenge in honor of Movember! Put your creative spin on the challenge and tag it with #Sha… All new show tonight!!! (Thanks @FAOSchwarz) #FallonTonight https://t.co/AKzb4MaHGs Bwaaaaaahaaa. Ridiculous. https://t.co/rCp1YYH8T7 Check out @theverge. @tiktok_us the top app in the Apple store. Yes!!!! We did it!! How fun? We have a new challenge for you all tonight! TikTok surges past 6M downloads in the US as celebrities join the app https://t.co/6EvguQu56f #FallonTonight #SharpieChallenge? You were fantastic. I loved it! Thank you. https://t.co/pOWL7exCvu Props to Mickey and Jenna and Kelly Powers (who bought the glue sticks) Who knew it would take off and help save animals? Gotta always try. It was so much fun to do. https://t.co/ZxLmcr6oq9 Fun show tonight! @SteveCarell, @EricBana67, and music from @troyesivan! Plus your funniest #TurkeyDayTradition tweets!! #FallonTonight Tonight: Michael Shannon is here, @ashleygraham stops by, and a performance from @TheStruts &amp; @KeshaRose!! #FallonTonight RT @FallonTonight: Tonight we have: Michael Shannon, @ashleygraham, and music from @TheStruts &amp; @KeshaRose! #FallonTonight https://t.co/2BK… .@muse performs \"Pressure\" in Studio 6B! https://t.co/CfMF0q1aR7 #FallonTonight Probably 💯? https://t.co/l5wYCe2RiI Say, ”Alexa, tell me a joke.” And let me be the voice for the joke of the day for a month on your @amazonecho! It’s live now!!! #FallonTonight We love @dailydot! #FallonTonight https://t.co/eZpi7V1vLP RT @NASCARonNBC: The #Championship4 stopped by @FallonTonight and let's just say things got competitive 😂\n\nDon't miss @joeylogano, @KyleBus… Tradition. https://t.co/WgpGIV2lRr New @BelowDeck tonight?!?!?! I am PSYCHED!!!! Let’s go @Kate_Chastain. Show em how to do it! I’m picking it up this week!! Congrats!! Good to see you!! https://t.co/7NQEHA0hDV Fall colored turtlenecks. https://t.co/Sleyz2vTR0 Congrats @henrygolding!!! Well deserved. https://t.co/Y6YuLJxFeJ .@iamscottevans - you in NYC yet? A promise is a promise. I’m in the building if you need anything. See ya! Canned cranberry sauce or fresh? https://t.co/OIv7ny4AHJ Every year my friend's family would go around the table and say what they’re grateful for and end by randomly thanking, “Stanley Tucci.” #TurkeyDayTradition It's Hashtags time! Tweet out a funny or weird thing your family does on Thanksgiving and tag it with #TurkeyDayTradition. Could be on the show! .@violadavis see you tonight with @muse! #FallonTonight Had a great time talking with @iamjamiefoxx last night! Not everything could make it to air so here's an extended cut of the interview! https://t.co/HTNbPVuIgg #FallonTonight Haaa. Obviously I was too. Didn’t see that happening. https://t.co/figjJH9tn1 Great hang with @troyesivan. Come back soon! #FallonTonight https://t.co/n6H6gTOqgN RT @catheb: RIP Stan Lee \nHere’s a sketch he did with Jimmy Fallon on #LNJF 💛 https://t.co/oEa7b76c6I Congrats Benedict on @grinchmovie! See how long you can last in the Try Not to Laugh Challenge https://t.co/0Fp1S7cmDI #TheGrinch #FallonTonight RT @FallonTonight: We have a great week of music lined up feat. @charli_xcx &amp; @troyesivan, @muse, @TheStruts &amp; @KeshaRose, and @MariahCarey… I’m only halfway through. No spoilers! https://t.co/a9mLqORQUF Yahooooooo!!!!! We won!!!!!! I love my fans. Thank you so much. Flying back to NYC for a brand new show tomorrow. So happy. Love you guys. #PCAs #PeoplesChoiceAwards #FallonTonight https://t.co/LPZoVyNvJi The show is about to begin!! @peopleschoice #PCAs https://t.co/LuPIGWyR8B Help me support the @CAFirefighters who are risking their lives on the front lines of 3 horrific wildfires: #CampFire #HillFire and #WoolseyFire. Donate today to @CAFireFound at https://t.co/20KIcoI4Ky This reunion couldn’t have went better. So fun!! https://t.co/4LuoqWuTJj It works!! It works!! Now it’s time for MAMA. https://t.co/x0VHU57xjm #DADA https://t.co/l4LSSqKV3o RT @tiktok_us: @jimmyfallon took on the #tumbleweedchallenge on TikTok! Check it out ➡️ https://t.co/imkG0gy6Vh https://t.co/SVsaH4fVUV Oh it’s on!!! Download TikToK and #Tumbleweedchallenge me. Winners will be on the show next week!! https://t.co/bc7s7x3UuM The show tonight is dedicated to Veterans. Thank you for all you do. Some really special moments and our whole audience is filled with Veterans and their families. #VeteransDay2018 #FallonTonight Great show tonight: @markwahlberg, @chipgaines &amp; @joannagaines, and music from @zacbrownband! Plus, our entire studio audience will be made up of Veterans and their family members in honor of #VeteransDay this weekend! #FallonTonight RT @FallonTonight: .@spicegirls superfan Emma Stone takes @BuzzFeed's \"Which Spice Girl Are You?\" quiz: https://t.co/zteA5Wimqd #FallonToni… RT @Lauren_Daigle: In case you missed it, here's Lauren's performance on last night's @FallonTonight.  Thanks @jimmyfallon for having us! -… Got it!!!!! Goodnight. https://t.co/YwtgMkzB0l Go to @TikTok_US and try the #TumbleweedChallenge https://t.co/vTdccWnEyB  #FallonTonight Watch @nbc right now!! @FallonTonight. He was LOOPY tonight. (Up all night?) But as always - super smart. It was such a fun interview. https://t.co/Vk5Ex1eD6s Happy Diwali!!! I wish light and love and happiness and positivity to you all. #HappyDiwali Tonight: Eddie Redmayne, @jackwhitehall, @chucktodd, and music from @Lauren_Daigle! #FallonTonight RT @pawpatrol: @jimmyfallon Voting is PAWsome! 💙 @jimmyfallon Vote with a friend!  #GoVote #IVoted #WeVoted #MidtermElection2018 https://t.co/jlj2pZsJbP Not true - also it wasn’t a planned dance. A non-planned fun dance? I totally support that. Next time - dance off? Just sayin’... https://t.co/813qoFXJkf #DrEvil returns to #FallonTonight! https://t.co/zoBjDYluQi A bookstore employee was rude to me, so for the next 45 minutes I kept asking to see books that were so high up he had to keep getting the ladder. #WhyImAGrinch It's Hashtags time - Tweet out a funny, weird, or crazy time you were being a bit of a Grinch and tag it with #WhyImAGrinch. Could be on the show! Thanks again for doing our first ever Classroom Instruments with us. We’ve done it many times since and it’s still one of our favorites. See ya soon! https://t.co/91LhXvGQ5G Tonight on the show: @maddow, @SamHeughan, and a performance from @carlyraejepsen! #FallonTonight Tonight! Benedict Cumberbatch is here, @minkakelly stops by, and stand-up from @heylando! Plus, it's #ThankYouNoteFriday! #FallonTonight Who knows @jtimberlake best? https://t.co/KsC1NUuZIH #FallonTonight Don’t mess with the Jess #FallonTonight #Pineapple #Hindsight https://t.co/Px7iXUSJon Magic!! #FalllonTonight #Hindsight https://t.co/yAYGJsPLul RT @FallonTonight: Tonight! #Jimberlake https://t.co/eU14DCQK0s RT @FallonTonight: .@jtimberlake crashes Jimmy's rehearsal ahead of tonight's show #FallonTonight https://t.co/b0pa7O3k9O RT @CarvelIceCream: We forgive you for the prank calls @beastieboys 😉. @jimmyfallon @FallonTonight https://t.co/sjJTPtS9MX So What Cha Want? Check out the new #BeastieBoysBook or I will release more high school lip sync videos!! https://t.co/0g2RYJTWoD Great show tonight!! @jtimberlake, @Sunnysuljic4, and a performance from @PistolAnnies! #FallonTonight Was having so much fun with Mike D &amp; @adrock that our interview went crazy long last night. Here's one of the extended cuts with stuff that didn't make it to air! And, check out their #BeastieBoysBook! https://t.co/6ifEo8urGU #FallonTonight Tonight! Mike D &amp; @Adrock are here, @desusnice &amp; @thekidmero stop by, and @sheckwes performs! Plus, your funniest #WeirdestHalloweenEver tweets! #FallonTonight Can’t believe I was the ONLY kid dressed as Gene Shalit that year. Happy Halloween! 🎃🎃🎃🎃🎃🎃 https://t.co/huCjUNfVNm I could not stop reading the Beastie Boys Book. LOVED it. Love them. So many details so many jokes so well written. Talking to those guys on the show tonight. #BeastiesonFallon  #FalllonTonight https://t.co/IdWL5Om0zL https://t.co/2pWSw8dC4f .@KISSOnline performs in Studio 6B for The Tonight Show audience! https://t.co/3TJ2sg5sA7 #FallonTonight In 1994 I went to a party where three people dressed up like David Hasselhoff from Baywatch. At one point, someone accidentally fell into the pool and all the Hasselhoffs jumped in to save him. #WeirdestHalloweenEver It’s Hashtags time! Tweet out a funny or weird thing that’s happened to you on Halloween, and tag it with #WeirdestHalloweenEver. Could be on the show! RT @stereogum: Watch John Prine (@JohnPrineMusic) perform with @JimmyFallon &amp; @TheRoots on 'The Tonight Show' https://t.co/QM9kwPUaz6 https… Tonight: @tylerperry is here, @abbijacobson stops by, and music from @kissonline! #FallonTonight .@ItsRamiMalek discusses his Freddie Mercury transformation for #BohemianRhapsody https://t.co/FOKnGMJuza #FallonTonight Gonna be on @breakfastclubam with my new friends tomorrow at 7am. Wake up and listen!! @iHeartRadio @Power1051 #FallonOnBC #FirstTimer https://t.co/QlOycDpF0M I can LIVE tweet! https://t.co/bkMGG7HaKh We cannot wait!!! We wanna play with you. https://t.co/AoRtJACZKs I need spoilers... #ThisIsUs #FallonTonight https://t.co/DAcJs1cqIU Tonight on the show: @ItsRamiMalek, @ChrissyMetz, and @JohnPrineMusic performs! #FallonTonight Tonight: @WhoopiGoldberg, @BellaTwins, and magic from @Joshuajaymagic! Plus, it’s #ThankYouNoteFriday! #FallonTonight Lip Sync Battle with @TiffanyHaddish! https://t.co/FPmzUwjNQz #FallonTonight You are gooooooood. See you soon, pal. Congrats. #LipSyncBattle #FalllonTonight https://t.co/MQsZDg6Ut6 Tonight: Lip Sync Battle with @tiffanyhaddish, @SteveKornacki stops by, and music from @buddy. Plus, your funniest #IfIWonTheLottery tweets #FallonTonight .@brckhmptn performs DISTRICT in Studio 6B https://t.co/6BDyvh6Yzt #FallonTonight RT @JohnPrineMusic: Looking forward to seeing my doppelgänger, @jimmyfallon this Monday, Oct. 29th...Be sure to tune in! https://t.co/Fxw0o… I would pay Cardi B to cancel my plans for me whenever I didn’t feel like doing something. “Jimmy’s not coming to dinner, okurrr?” #IfIWonTheLottery It’s Hashtags time! Tweet out a funny or weird thing that you would do if you won the lottery, and tag it with #IfIWonTheLottery. Could be on the show! Tonight! @trevornoah, Lucas Hedges, @GigiHadid, and a performance from @brckhmptn! #FallonTonight Wheel of Musical Impressions with @melissavcomedy!! https://t.co/614d81rsnX #FallonTonight Being a @Topps collector for years - I will say I would be honored. I have ideas as well. Thanks. https://t.co/hytQJ1hpTM Back with new shows tonight! @SavannahGuthrie + @HodaKotb are here, @JulietteLewis stops by, music from @JoeyPurps ft. @RZA , and more! #FallonTonight At first I thought it was photoshopped. Haaa. This is great. 😂 😂 😂 https://t.co/OiJ91cIEOg Huh? https://t.co/5sf0K977Kt What are you thinking... I may be up for it. But my powers are exhausting. So it’s rare that I even do this anymore. https://t.co/kR77U7lhJV You can also check out https://t.co/5WX9KBKFi7. Every team, every size. @NFLFanStyle @SNFonNBC #KCvsNE Who you you have your #HandsHigh for tonight? @Chiefs or @Patriots? RT and get loud to win a free hoodie care of https://t.co/sFNpQACoDS #KCvsNE https://t.co/DaH2OjZgxF Thanks again @olivegarden. https://t.co/57ju8Q8TWM Ahhh smart. https://t.co/UMpjTIwwVS It also the debut of my secret talent - do you like ketchup or mustard? I am exhausted. https://t.co/vuIXF51EJP Tonight on the show: Alec Baldwin is here, @Meghan_Trainor stops by, and stand-up from @iamLeClerc! #FallonTonight It just didn’t work. But I had to try all options. It was my first time! https://t.co/xzpetS7Ive I agree. He’s amazing. https://t.co/UlkdIDTvVh It almost magenta - @JohnLegere get on this!!! TMobile should sponsor that side of the train or something right? Beautiful. https://t.co/tLOCe9qFJG @TomThorogood @nilerodgers @Harry_Styles No that’s the right pic. There was no WAY we could’ve done it without you. Love ya pal. See you soon. https://t.co/mfLjr2b6DT RT @FallonTonight: .@PostMalone brings Jimmy to his favorite restaurant, Olive Garden https://t.co/cNGtHQzLtL #FallonTonight https://t.co/p… .@PostMalone takes me to Olive Garden https://t.co/VnohKdQV4m #FallonTonight Posty @PostMalone takes me to Olive Garden. I have never been and I will never be the same.\nhttps://t.co/AzcyFO8fFQ #PostAndJimothy #PostyOliveGarden TONIGHT! @PostMalone &amp; I get dinner at Olive Garden #FallonTonight https://t.co/M34O5YfZHQ Tonight: @JonahHill, Charles Barkley and music from @bazzi! Plus, @PostMalone takes me to Olive Garden #FallonTonight .@RealChalamet reacts to his face being photoshopped into famous paintings https://t.co/JEjf6Y8Vbh #FallonTonight So excited to have the host of my favorite podcast @HowIBuiltThis @guyraz on our show tonight. If you haven’t listened to this - subscribe now. It is FANTASTIC. Saw #BohemianRhapsody last night. Go @ItsRamiMalek, go!!! Some scenes were eerie. Well done. Also @DrBrianMay and @OfficialRMT - the 20th Century Fox - opening????!?! That was cool. Fans will love. #LiveAID #GAGA Tonight: @RealChalamet, @AmandlaStenberg, @GuyRaz, and @EllaMai performs #FallonTonight .@JohnCena demonstrates his 6th Move Of Doom https://t.co/z7nAnxI9Hr #FallonTonight Thank you. I really “explored the space” on that woodblock. https://t.co/m3g2TgOVIU My friend went to pick up his date, and she was already there with another date. He ended up driving them around all night anyway. #HomecomingFail It’s Hashtags time - Tweet out a funny, weird, or embarrassing thing that’s happened to you at Homecoming, and tag it with #HomecomingFail. Could be on the show Tonight: @JohnCena is here, @mgyllenhaal stops by, and @HERMusicx performs #FallonTonight Classroom Instruments with @ShawnMendes! https://t.co/dhWqC5wkt7 #FallonTonight I love you guys. Thank you! https://t.co/MNEPferY1t Tonight: @anthonyanderson, @SHAQ, and music from @dinahjane97 ft. @tydollasign and @MARCEBASSY! Plus, a new classroom instruments with @shawnmendes!! #FallonTonight Okay @HoustonTexans fans, get your hands HIGH and show me your best @NFLFanStyle spirit! I’ll send one of you a free #HandsHigh sweatshirt. RT https://t.co/8OohHy4mfy #DALvsHOU #SNF https://t.co/hN1UOj9c4r Okay @DallasCowboys fans, get your hands HIGH and show me your best @NFLFanStyle spirit! I’ll send one of you a free #HandsHigh sweatshirt. RT https://t.co/8OohHxMKQY  #DALvsHOU #SNF https://t.co/cFSHgoAMt6 Honored to spend an hour with one of the best out there. Thank you @avlskies!! I’ll stop talking now. :) Hope to see you soon. #TNYfest https://t.co/gm0wLggFGL .@BTS_twt at #CitiField tonight!! New York loves you! Break a leg!! 💜💜 Chimmy  #BTSxCITIFIELD https://t.co/AmhRrTM8Jc :) ✌️ https://t.co/rfvMNPyLEx Dude, it’s too late - already sent the final show to Burbank for air. Are you sure you’re gonna be in trouble? We could maybe bleep it out. What is “DM”? https://t.co/GMds1hGO8X Tonight: @MarkRuffalo and Student Organizers from @AMarch4OurLives, @trvisXX, and stand-up from @jaboukie #FallonTonight Catchphrase with @BillyCrystal, @giseleofficial &amp; @QuavoStuntin https://t.co/URZw3rplMJ #FallonTonight All new Tonight Show TONIGHT!! #FallonTonight https://t.co/cpKGZIXoCI Ooooooh yeah I got my Hands High for the @NYRangers tonight! https://t.co/QzBZiLVip7 or check them out at @TheGarden!! #NYR https://t.co/loFjaAXz38 Jim James wows us again with another beautiful song. Props to our lighting and camera departments. It looked as good as it sounded. #FallonTonight https://t.co/ToOsp4Sgg0 Oh you will. We did it. https://t.co/HbQstS0bKg Tonight on the show: @BillyCrystal, @giseleofficial, and a performance from @QuavoStuntin! Plus, your funniest #MyTeacherIsWeird tweets! #FallonTonight Great show tonight: Bradley Cooper, Kathryn Hahn, and music from @jimjames!! #FallonTonight RT @FallonTonight: .@LilTunechi performs \"Dedicate\" off of #ThaCarterV:  https://t.co/rmpHclBqSd #FallonTonight https://t.co/sAwwHrHcO8 Tonight on the show: Claire Foy is here, @ChelseaClinton stops by, and talk &amp; performance from @LilTunechi! #FallonTonight Thank you @BTS_twt ARMY. We like making new friends. 💜💜💜💜💜💜💜 #FallonTonight https://t.co/X4qOmzdyH6 I had a teacher who hated apples, so she asked students to bring her tomatoes as a gift instead. She would then eat a full tomato in front of the class. #MyTeacherIsWeird It's Hashtags time! Tweet out a funny, weird, or embarrassing thing a teacher has done or said, and tag it with #MyTeacherIsWeird. Could be on the show! RT @FallonTonight: .@PostMalone stops by Studio 6B to talk everything from getting tattoos with @justinbieber to debuting his song from the… Tonight: @Nick_Offerman &amp; @MeganMullally are here, @PostMalone stops by, and @TheNational performs! #FallonTonight Get it to me ASAP. Forget it. I’m coming over!!! #Delta https://t.co/Ff1L7E3noT Thank YOU!! Crush it this weekend!! https://t.co/5Ebj2E7ISH #GlobalCitizenFestival https://t.co/DEAWqCPkI3 I got reeeeealy close to slaying Hips Don’t Lie. I was a wet mess by the end. Thanks @ShawnMendes! Check out https://t.co/aZ7OVGrpNq or download the app!! https://t.co/MvznfKwWvq .@ShawnMendes and I face off in a new music challenge, talk about #ShawnMendesTheAlbum, and he gives an awesome performance - it's a great show #ShawnOnFallon #FallonTonight https://t.co/lLnbWWeL9k Tonight on the show: @rickygervais is here and @shawnmendes stops by to talk +  perform!! #ShawnOnFallon #FallonTonight Bad Bunny's TV debut of \"Estamos Bien\" https://t.co/M0Jnrlx752 #FallonTonight RT @crystalbell: I wrote about what made #BTS's appearance on @FallonTonight so special, from the fanchants to the finger hearts. Thanks to… Thank you! https://t.co/x3tdAZNTU6 Tonight! Alexander Skarsgård, @justinhartley, and music from Bad Bunny!! #FallonTonight .@BTS_twt was so good!! We had a lot of fun with this #Fortnite Dance Challenge! Come back anytime! Loved having you! https://t.co/CoFcsXHe2H #BTSonFallon RT @RobertIrwin: Just found out that our @FallonTonight segment with @jimmyfallon and @KevinHart4real was the #1 trending video worldwide o… Number one trend?!?!?!?! I LOVE YOU GUYS!!!! thank you!!! https://t.co/H6UGotcWhb RT @BET: Her fight against mental illness is personal.\nhttps://t.co/nrXVHbaTI5 RT @_DesMartinez: I JUST realized..@TherealTaraji characters name on Empire is Cookie..@BTS_twt has Kookie &amp; BT21 Cooky..Jimmy wore a Chimm… I love you Elvis. Reunion? Soon? https://t.co/GC5vpxjFgx RT @justjaredjr: #BTSonFallon was basically everything that we dreamed it would be -- watch the videos now!! @BTS_twt @jimmyfallon https://… It’s starting west coast!!! Watch the first 20 min at least. You’ll dig it. #BTSonFALLON thanks, Chimmy Oh it’s all trending. Ha haaaaa!! Love!! I see you @TherealTaraji !!! #BTSonFALLON https://t.co/x41zWQzYOj RT @JustJared: You've gotta watch the videos from @BTS_twt's appearance on @JimmyFallon's show!!! #BTSonFallon https://t.co/cwiySU1xsE West coast. You ready? Check out the show in like 10 minutes. @NBC we have @TherealTaraji and @BTS_twt and @FortniteGame.  Trust me. It’s a great show tonight.  #BTSonFallon #FallonTonight RT @FallonTonight: Want more?! @bts_twt gives an incredible bonus performance of “I’m Fine” https://t.co/P6qPrcR22c #BTSonFallon https://t.… RT @billboard: BTS were big hits on @FallonTonight https://t.co/Z4O6sHTUua https://t.co/7SsJCeHpjZ RT @JJRyanOnAir: Hands down the best #BTS interview in the US so far.  Well done @jimmyfallon. #BTSonFallon West coast - you watching? #BTSonFallon Even better: WORLDWIDE trending. Love you guys. Thank you!!#BTSonFallon https://t.co/hEwUKeONFG Look for finger Easter egg for real @BTS_twt fans right now. You guys are unbelievable fans. Combined with FalPals? Best. Ever. #BTSonFallon .@questlove have you seen anything like this? #BTSonFALLON Let’s trend it more!!! We can do it!! #BTSonFALLON https://t.co/N33n3izOjh Watch @nbc now!!!! @BTS_twt has a knockout performance!! #BTSonFALLON #FallonTonight Everyone has a different fav. It’s almost obvious who’s mine. Love, Jimin Fallon #BTSonFALLON https://t.co/Ev9kOY5N4v RT @BTSBANGTANTP: Fallon is the best show ever #BTSonFallon Uh oh @BTS_twt coming up next... #BTSonFallon ??? https://t.co/YaFkWWuX06 I love you. xoxo Chimmy 💜 Ready for the interview? Who do you think is my favorite? @BTS_twt knows. Let me know. But you’ll see soon. #BTSonFallon RT @hauntedsunshine: Ya just know that there are people sitting in the audience at @jimmyfallon\nwho have no idea what they're about to expe… Oh, trending? Whaaaaaaaa???!?!?! Let’s get to number one!!! #BTSonFallon #FallonTonight https://t.co/rNAFftDVMo RT @Noelle_CD: When the ARMYs screamed for #BTSonFallon, @jimmyfallon was like: https://t.co/thUJO4cCvT Are you watching NBC right now??!?! If you are, thank you. Love, Chimmy #BTSonFALLON #FallonTonight Don’t miss the show tonight!!! @TherealTaraji and @BTS_twt and @FortniteGame. Come on!!! https://t.co/aS3SXOrUvE Tonight was electric. If you don’t know - you’re about to. BTS. Also - if you’re a @FortniteGame fan - watch the first 20 mins of the Tonight show. #BTSonFallon #FortniteChallenge https://t.co/ioskpSAaXw Hey @NBCThisisUs fans - look for a @TheMandyMoore cameo in the opening of @FallonTonight, TONIGHT!! Soon!!! 35 mins?#FallonTonight .@BTS_twt's performance is phenomenal!! Watch on @nbc and share the full performance when it is released on https://t.co/342jGb5Yga during the show TONIGHT! #BTSonFallon 💜 https://t.co/fayjoIPdhb RT @BTS_twt: 🤟🌟@jimmyfallon 🎶👍 https://t.co/8Sh1drEHoE RT @FallonTonight: Here's a sneak peek of @BTS_twt &amp; Jimmy doing the #fortnitedancechallenge! To be the first to see the full video, subscr… .@BTS_twt is here TONIGHT! We have an awesome dance challenge planned that I can't wait for you to see! They are so talented! Tune in tonight and subscribe to https://t.co/342jGb5Yga for first access to the videos online!! #BTSonFallon https://t.co/K8IFfkX9L7 Today is #NationalVoterRegistrationDay! Head on down to Voting Avenue &amp; make your voice heard by signing up @HeadCountOrg! #RegisterToVote https://t.co/OSjiRIGeMc My dad thought our garage would fall down if he put a basketball hoop on it. So he put it on a pole in the middle of our backyard. It’s hard to dribble on grass. #MyFamilyIsWeird It's Hashtags time! Tweet out a funny, weird, or embarrassing thing a family member has done or said, and tag it with #MyFamilyIsWeird. Could be on the show! Fun show tonight!! @TherealTaraji stops by and @BTS_twt is here to talk and perform! Plus, a dance challenge with @BTS_twt! #BTSonFallon RT @FallonTonight: Play along with @TheMandyMoore as she takes the \"@NBCThisisUs\" or \"A Walk to Remember\" quiz! https://t.co/CZFbuLkZDU Singing Whisper Challenge with @TheMandyMoore! https://t.co/7WmMbYvVnn #FallonTonight RT @FallonTonight: .@TheMandyMoore and Jimmy are on a roll during tonight's Singing Whisper Challenge! More on #FallonTonight! #IWantItThat… RT @FallonTonight: We've got an awesome week of music lined up feat. @MumfordAndSons, @BTS_twt, Bad Bunny, and @ShawnMendes! #MusicMonday\nh… Big week on #FallonTonight!! @TheMandyMoore, @MumfordAndSons , @BTS_twt, Bad Bunny, and @ShawnMendes!! Tonight! @TheMandyMoore, John David Washington, Marcus Mumford, and music from @MumfordandSons! #FallonTonight RT if you have your #HandsHigh for @Lions tonight!! #OnePride #NFLfanstyle https://t.co/1Stkj3xIFN https://t.co/54slD4YrUp RT if you have your #HandsHigh for @Patriots tonight!! #GoPats #NFLfanstyle https://t.co/1Stkj3xIFN https://t.co/ajqPZgsfiW #SNFonNBC tonight! Who are you rooting for?!! @Patriots or @Lions #NEvsDET Get YOUR Stanford (@StanfordFball) HANDS HIGH now!! https://t.co/1Stkj3xIFN or https://t.co/vfyhxqRPkM. #HandsHigh #Stanford https://t.co/OnI2AIDraV Thank you, @PaulSimonMusic. Thank you, thank you, thank you. #FlushingMeadows https://t.co/rPXDXkIEKz .@GloriaFallon123 - you were always the favorite. Haaaa. ❤️ Happy Birthday to the best sister ever!! Love you! #youwerethefavoritechild RT @FallonTonight: Jimmy and @BlackThought debate the pronunciation of @chrissyteigen's last name prior to the show #FallonTonight https://… Tonight! @chrissyteigen, @Ryan_Eggold &amp; magic from @Danwhitemagic! Plus, it's #ThankYouNoteFriday! #FallonTonight Kid Theater with @jackblack! https://t.co/MFmF4fVJDm #FallonTonight .@JackBlack is here tonight and he always knows how to make an entrance!! #FallonTonight https://t.co/BAdY0OGMf1 RT @FallonTonight: .@JackBlack breaks out the SAX-A-BOOM for an epic #FallonTonight performance https://t.co/bvulXcEqKJ Tonight on the show: @jackblack, @ImAngelaBassett &amp; music from @joshgroban! Plus, your funniest #MyWeirdRoommate tweets! #FallonTonight .@KevinHart4real and I didn’t handle things well when we met some of @RobertIrwin’s animals https://t.co/58IPI5WeZx #KevinHartOnFallon RT @FallonTonight: .@KevinHart4real and Jimmy FaceTime @TheRock while Kevin co-hosts The Tonight Show #KevinHartOnFallon https://t.co/KANoW… RT @FallonTonight: Head over to @YouTube &amp; watch all the funny moments from last night’s episode with Co-Host @KevinHart4real https://t.co/… Watch the show tonight!! @KevinHart4real and @RobertIrwin has ANIMALS. Kevin is afraid. #FallonTonight #KevinHartOnFallon RT @FallonTonight: LESS THAN 1 HOUR until #KevinHartOnFallon!! Who's watching with us tonight?! https://t.co/T7PcF3kEvA @KevinHart4real I was so scared, too. #KevinHartOnFallon https://t.co/Oa4E4SbeCb Okay - you two giants are gonna make me cry. #LOVE #ComeTogether #ThisIsCool #HappyBirthday https://t.co/mPHWgIQIVr I (and my wife and kids) am a GIANT fan of Target. I go in for a toy and come out with a cart full of stuff that I never knew I needed. (Or maybe don’t?) But respect to a great store and thanks for the hours and hours that I’ve spent at your establishment. https://t.co/5Q6bt230ap .@KevinHart4real Co-Hosts TONIGHT!!! #KevinHartOnFallon https://t.co/la435kzkWv Kevin Hart is co hosting the Tonight Show this evening!!! #KevinHartOnFallon https://t.co/tILjzbiBgR RT @RobertIrwin: Tonight!!! So happy to be back on @FallonTonight with @jimmyfallon and @KevinHart4real plus some wild animal friends! It’l… I love you Paw Patrol!!! https://t.co/RgAU5w3QHu Tonight! @KevinHart4Real Co-Hosts! Lots of fun things planned with him! Plus, kid animal expert @RobertIrwin is here with a few of his friends! #FallonTonight Oh no!! I’m on my way and just saw this. I’ll act surprised when I see you. https://t.co/YJEQVPMyKj If you want to give me a present I would LOVE this: do a random act of kindness and tweet me after you do it. You can be detailed or just say “Happy Birthday Jimmy” and I’ll know you did it. Thank you!! Thank you for all of the nice birthday wishes. I hope everyone has a great day today! I think I hugged you too hard. https://t.co/LdYM29SRPE RT @FallonTonight: It's official: @BTS_twt will be stopping by next Tuesday, 9/25! Don't miss it! #BTSonFallon https://t.co/vlLg8YBdzA Thank you, India!!! I am 44 today. https://t.co/yJS58nWCV5 Every morning, my roommate would wake up to Neil Diamond’s cover of “O Holy Night.” #MyWeirdRoommate It's Hashtags time! Tweet out a funny, weird, or embarrassing story about a roommate you’ve had and tag it with #MyWeirdRoommate. Could be on the show! Tonight: @IAMQUEENLATIFAH, @kelly_clarkson, and music from @itstonybennett + @DianaKrall! #FallonTonight RT @YaraShahidi: So. Much. Fun. 🗳 #vote https://t.co/6unuxeh37d Congrats, @PaulMcCartney!! #1 Album!! We love you! #EgyptStation https://t.co/apLet9GAaV It’s easy! If you’re 18 go to https://t.co/fB4MJoml50. Once you are registered find out when and where you can vote by clicking “voting and election resources”. #VOTE https://t.co/keB4q7VEzc Tonight on the show: @RWitherspoon stops by and @LennyKravitz is here to talk and perform! #FallonTonight Thanks to @YaraShahidi for creating this video with me! Go to https://t.co/fB4MJoml50 to register to vote! https://t.co/IboquekW6E Which team do you have your Hands High for tonight? @nflfanstyle \nhttps://t.co/jLHp661JgA\n@SNFonNBC\n@Giants\n@dallascowboys\n#NYGvsDAL https://t.co/44cf2Xo2Ra Which team do you have your Hands High for tonight? @nflfanstyle \nhttps://t.co/jLHp661JgA\n@SNFonNBC\n@Giants\n@dallascowboys\n#NYGvsDAL https://t.co/3bXOeVSmiM We make a great team. https://t.co/8liIXf1eNy Yes, any team!!! Get your NFL gear now and College Football!! That was a blast! https://t.co/en6iNLaOI6 Hands High! Any team! Men’s women’s kids. @NFLFanStyle.  Check them out at https://t.co/JcQQkOHQKO or @Fanatics https://t.co/vfyhxqRPkM or https://t.co/gLXTKddoJZ #HandsHigh https://t.co/ulTvaDIjWC @NYPDCentralPark thank you for keeping us safe. That was a fun one. #FallonCentralPark We ALWAYS have fun. Always will. #Pie #Mustard haaaaaaa. https://t.co/zbO8yfP9Nx RT @carrieunderwood: Tune in alert! Carrie will be on @FallonTonight starting at 11:35/10:35c  -TeamCU https://t.co/3pZPHwhrip It was. I love you guys. Thank you. https://t.co/yhTCdiwqcZ New Tonight Show MAGENTA stickers on Instagram now! #FallonCentralPark #TMobile https://t.co/9pnXjvaUvD Thank you Jess, and @PeopleTV. That was so much fun. Big show tonight, the engagement story is sadly exactly true and I love saying Jess Cagle’s name. Jess Cagle, JessCagle, JessCagle, JessCagle, JessCagle! #FallonCentralPark https://t.co/FWk1QyYNA2 The Tonight Show is in Central Park TONIGHT!! @blakelively stops by and @carrieunderwood talks and performs! Plus, a fun surprise with @justinbieber!!  #FallonCentralPark Daniel Radcliffe reacts to @HarryPotterFilm memes https://t.co/WJDjZX4DkF #FallonTonight https://t.co/mEOZaFO8u6 #AerosmithOnFallon https://t.co/a7EaLIVMwK RT @IamStevenT: TUNING IN IS A MUST!!!!!! https://t.co/CYpXsagkmb Tonight! Daniel Radcliffe, Matt Czuchry, and a performance from @TEYANATAYLOR. Plus,  your funniest #WhyIGotFired tweets! #FallonTonight Thank you again to @elvisduran and everyone at the @ElvisDuranShow. See you tomorrow morning, right? #ElvisandJimmy RT @vulture: Fred Armisen, Maya Rudolph, and Jimmy Fallon launched into an impression game that is \"more about the effort\" than accuracy ht… Tune in tomorrow!! @Z100NewYork @iHeartRadio #ElvisandJimmy https://t.co/JgyluWGPCD I love you New York City. Streaming live on Facebook and Instagram at 7:30. #ImUp #GoodMorning Haaaaa. See you on the show soon. Say hi to Jesus for me! https://t.co/OrgXuKuuMG It’s gonna be fun. It’s gonna be EARLY, but it’s gonna be fun. Looking forward to it. https://t.co/EgAEarLreB Oh snap it’s Legend. Legend!!!! Sorry my bad. https://t.co/xkMzSJp4FE @JohnLegere congrats on the #EGOT by the way. See you Thursday when we are playing in Central Park! #FallonTonight RT @FallonTonight: Starting off Monday night right with @MayaRudolph &amp; Fred Armisen! Plus, the talented Brian Tyree Henry is here, talk wit… Oh there is!!! Thank you guys for being so much fun. https://t.co/aaQMpNdHOP RT @carrieunderwood: #LoveWins music video is out tomorrow! Watch it first on @AppleMusic. https://t.co/e2mOGoMmF0 https://t.co/GhbvVHKY9X I am so excited for this!! What should I bring?!?!  We are spending some time together. https://t.co/TAvdrkBrXX Tonight! @MayaRudolph &amp; Fred Armisen, Brian Tyree Henry, Senator @CoryBooker, and stand up from @SamMorril! #FallonTonight Happy Monday!!! New shows all week - set your DVRs and TiVo’s. The @TMobile Central Park Show is this Thursday!! #FallonTonight RT @jimmyfallon: We’ve got new shows all week. I’ll be live on Facebook and Instagram tomorrow at 7:30am to discuss any and all. :) #Fallon… We’ve got a jam happening with @Aerosmith that you guys are gonna dig. We’ve got new shows all week. I’ll be live on Facebook and Instagram tomorrow at 7:30am to discuss any and all. :) #FallonTonight https://t.co/TIY7kPyJaZ Thank you again to @PaulMcCartney for being a CRUSHER guest on our show and making some priceless moments. Listen to his new album here: https://t.co/cDUTA0oUEI #EgyptStation No no no no... YOU! You, my friend are the legend... https://t.co/qqyiCIk6aJ Tonight!! @nickjonas is here to talk and Elizabeth Olsen stops by! Plus, a performance from @nickjonas and @robin_schulz. And it’s #ThankYouNoteFriday!! #FallonTonight RT @PaulMcCartney: Surprise! 😎 #EgyptStation https://t.co/9pIiiRXU3J .@PaulMcCartney and I surprise fans at 30 Rock in a very fun #ElevatorSurprise! https://t.co/Mk5bU2Gro5 #FallonTonight RT @FallonTonight: .@PaulMcCartney and Jimmy surprise fans in the 30 Rock elevators! More fun with Paul tonight!! #McCartneyOnFallon #Eleva… The albums that are not there I have on CD or downloaded. Signed, A Fan. Very soon... (yes, this is my collection. https://t.co/cDUTA0oUEI #EgyptStation #McCartneyonFallon https://t.co/8fLVktyGV1 Tonight after @NFL stay up for live interview with @PaulMcCartney!!! New album EGYPT STATION out TOMORROW. https://t.co/cDUTA0oUEI #EgyptStation #FallonTonight https://t.co/i4NBVA5z43 Great show Tonight!! @paulmccartney is here to talk + perform a song from his new album #EgyptStation and @kendalljenner stops by!! Check it out tonight! #FallonTonight Kidding again. I can’t wait to see you guys!!! Fun and done. Next Wednesday!!! Yaaaaaaaayyyyy!! https://t.co/IyNKEzm67F I was KIDDING!!! https://t.co/IyNKEzm67F Correct!! https://t.co/xwekKUKarY .@ArianaGrande's ponytail has a mind of its own!!! https://t.co/0vigPcLhih #FallonTonight @ElvisDuranShow we have Paul McCartney and Kendall Jenner on the show tonight. I want to call in and I also want to ask you a question? Talk soon? #Z100 #IHeartRadio #ElvisDuran #EgyptStation Gonna go live on insta and Facebook at 7:30. If you thought I looked tired yesterday - look out!!! @FallonTonight  on Facebook and @JimmyFallon on Instagram. Paul McCartney is tonight! #EgyptStation Ain’t no phony - Ariana with the PONYYYYY. #FallonTonight https://t.co/uP9ny2oItc Plus a fun surprise with @ArianaGrande!! #FallonTonight https://t.co/qWFjfJPiQG RT @FallonTonight: .@MeekMill is working to free a million people from the criminal justice system alongside @sixers co-owner @MichaelGRubi… New show tonight!!! Jennifer Garner, Jeff Foxworthy and Sheryl Crow!!! #FallonTonight I am!!!! https://t.co/yZy2bJDET3 Thanks to @MeekMill and @MichaelGRubin. You are always welcome. #FallonTonight https://t.co/8Dtj6N1MD9 What you guys are doing is extraordinary. Thank you guys for what you are starting. https://t.co/ZhpJ0imDiN I’ll see you Thursday night!!!! I’m so excited for this. #EgyptStation https://t.co/Ej0tnvn9ex I hope to see you guys!! https://t.co/E0kajhatxj We are back with a brannnnd new show tonight!!! So happy to be back. Ethan Hawke, @LilRel4 and we welcome @MeekMill back to our show for a performance and an interview. All new #FallonTonight I’m out. https://t.co/JkIOGqCxaM Welcome to parenthood. https://t.co/rlaCNmjqng Thank you @vmas for bringing it back to New York. There really is no other night like it. #jlo Video Vanguard - you got this forever. Ok @PostMalone burned it down. #VMAS #ToysInTheAttic I’ll see you soon! https://t.co/1Us2zlVwgE You are always welcome. Thank you for one of the best performances EVER on our show and also for walking up the aisle and high fiving the WHOLE audience!!! https://t.co/a1byFtgxYU Love you pal!! When are you coming back on? https://t.co/QQJR6oaQ3r People are freaking!!!! Thank you guys so much. What a performance?!?!???!! https://t.co/wKUEugGmYS At the end - I motioned for Janet and you to go to the exit doors. Janet thought I said come with me. I always go into the crowd. You guys ended up high fiving 200 people. I was like “what are you doing?!?!” Ha. Just the best. Thank you. https://t.co/wKUEugGmYS I can’t wait for people to see it!! #FallonTonight #MadeForNow https://t.co/g5ltR3VEkj Great show tonight! @JLo is here and a performance from @JanetJackson with @daddy_yankee of their new song #MadeForNow! Do not miss!! #FallonTonight RT @FallonTonight: .@ArianaGrande gives Jimmy a taste of her favorite songs on #Sweetener with a mini-listening party: https://t.co/wwbl24l… So much fun hanging with @ArianaGrande last night and listening to #Sweetener with her!! What an incredible album!! https://t.co/MwBtKJsRS2 #FallonTonight RT @leahbale21: This is such a great show!! @jimmyfallon RT @Spotify: 🍭Friday just got sweeter 🍭\n\n Listen to @arianagrande’s new album  #Sweetener now. https://t.co/cooGYBOZKI 🍬🍬🍬 https://t.co/d9l… RT @FallonTonight: .@ArianaGrande tells the story of when her Nonna first talked with Pete Davidson https://t.co/Bt0ir1SNXX Let’s do it!!! Come hang with us and see us live!! https://t.co/luxnAjMiMm I knew that was gonna stick. #ArianaOnFallon https://t.co/oUd69lEDpl Definitely not soon. But thanks! https://t.co/t8SiFyP2yG Get ready @ArianaGrande fans to hear her new record #Sweetener turn on to NBC right now!! #ArianaOnFallon We do too. No L. https://t.co/QvreCSxjdL RT @catheb: Memories of #LNJF @jimmyfallon  #ArethaQueenForever #FallonTonight https://t.co/tP7sZ352r2 THE TONIGHT SHOW IS COMING TO CENTRAL PARK ON SEPT 13!!! Thank you, @JohnLegere and @TMobile. This is gonna be fuuuuunnnn!!!!! I agree. https://t.co/6PnBp0Kp6V RT @jojomamcg: @jimmyfallon @ArianaGrande @theroots Awesome!! I am speechless. 💕 RT @TraciMc: @jimmyfallon @TheTonightShow_ job well done @ArianaGrande awesome, you did her song justice!!’ We love @JohnLegere and our pals at @TMobile. It’s gonna be a big night. https://t.co/nDGjbdEssa RT @AllTimeJordyn: Omg this tribute to @ArethaFranklin on @jimmyfallon is giving me goosebumps @ArianaGrande you’re one of those most talen… We loved her too. https://t.co/3sNfNhWtRi Turn on NBC right now. @ArianaGrande and @TheRoots tribute to Aretha Franklin. #ArethaQueenForever #ArianaOnFallon RT @FallonTonight: @jimmyfallon @ArianaGrande #Sweetener #ListeningParty #ArianaOnFallon https://t.co/LnqEX2F3du Perfect performance tonight by @Aerosmith. I’m flying to Vegas to see their residency. Have to. They were AWESOME! Tune into @FallonTonight in 10 minutes!! Tonight at MIDNIGHT - @ArianaGrande #Sweetener is released. Sneak peek at 3 songs before it’s avail? Check. Tune into #FallonTonight at 11:30 and hear for yourself - she might sing a sneak peek LIVE!!! #ArianaOnFallon Thank you @ArianaGrande and @theRoots for putting together a beautiful opening of our show honoring our friend, the legendary Aretha Franklin. I know it’s a big night for Ariana - but this is what great people do when they know we need them to be there for us. #ArianaOnFallon RT @FallonTonight: We sent our writer, Arthur, down to Rockefeller Plaza to ask people about deep issues while they get a deep tissue massa… How’s your 8 iron? You DO know it’s magic now. Congrats again. Thank you @FedEx and @StJude. https://t.co/EmTYDG6E6t Great show tonight!! @ArianaGrande is here to talk about #Sweetener, @nickkroll stops by, and @Aerosmith performs!! Plus, your funniest #WhyIGotFired tweets! #FallonTonight Tonight: Michael Che &amp; @ColinJost, @henrygolding, @JustinThomas34, and stand-up from @dustyslay! #FallonTonight Secret recordings of Trump and Putin? Enjoy the latest Trump News Network. #TNN https://t.co/j2wKKKQvV6 Donald Trump starts his own news network. #TNN #FallonTonight https://t.co/uZMnNoHErv .@rhettandlink and I ask \"Will It Hummus?\" with Hamburger Helper, 3 Musketeers, and Bugs https://t.co/JsgmRyUpyx #FallonTonight Condo, cuisinart, wall to wall carpeting, STAR on the Hollywood Walk of Fame... what else does a man need? Congrats Al. https://t.co/DU8BeOsN4Q I think they “will” tune in. Get it? Tune? https://t.co/XIbgBYAXm3 Also tonight @TheEmmys nominated @MiloVentimiglia and we play “Will It” with @rhettandlink! https://t.co/dyFOISVBjS Tonight - @YG, @BigSean and @2Chainz performing #BigBank live! https://t.co/I53gSVogeO\n\nhttps://t.co/gPwih02Npd #FallonTonight #Hot100 Even blended bacon egg and cheese? (I couldn’t even watch.) You’re a legend. Thanks pal. https://t.co/3cI6sUUq1T My friend got hired to paint the sign for a family-owned hardware store.  He spent four hours working on it, and didn’t notice he'd spelled their name wrong. #WhyIGotFired It's Hashtags time! Tweet out a funny, weird, or embarrassing reason you or someone you know got fired and tag it with #WhyIGotFired. Could be on the show! Tonight on the show! @MiloVentimiglia is here, @rhettandlink stop by, and @YG ft. @BigSean &amp; @2chainz perform! #FallonTonight .@VancityReynolds joins me for a special #AviationGin-edition of Drinko https://t.co/1Fk4sQPPdO #FallonTonight Tonight: Ryan Reynolds (@VancityReynolds), Chris O’Dowd (@BigBoyler), and music from @Augustgreenebnd! #FallonTonight Can’t wait!! We’ve got some fun ideas. https://t.co/vWBFYsj4h8 All-new Monologue and it's #ThankYouNoteFriday! Plus, Mila Kunis, @ZacharyQuinto, and music from @_TaylorBennett! #FallonTonight Eye-to-Eye Challenge with Rose Byrne! https://t.co/8sfbXofXQj #FallonTonight Tonight: Rose Byrne stops by and @BradPaisley is here to talk &amp; perform! Plus, #Fallonventions returns! #FallonTonight RT @FallonTonight: .@leonbridges performs \"Helpless\" by Neil Young in a new Tonight Show #CoverRoom https://t.co/aVoprbuzsF RT @FallonTonight: .@RubyRose talks about being cast as Batwoman https://t.co/DNclEKYhRK https://t.co/qmvgrW25fi Tonight: @RyanSeacrest, @RubyRose, and performance from @RaeSremmurd! Plus, your funniest #WhyImSingle tweets! #FallonTonight .@SethRogen &amp; I read Dramatic Dad Texts! https://t.co/ok4lb8LqGr #FallonTonight A cute girl once said hi to me at a friend's BBQ. I got so nervous I just nodded my head and said, \"Cap'n,\" back at her. #WhyImSingle It's Hashtags time! In honor of \"The Bachelorette\" finale, tweet out a funny, weird, or embarrassing reason you're single and tag it with #WhyImSingle. Could be on the show! @stevegarfield miss you pal. Hope you are well. Pup Quiz with @TheGlennClose and @FinnSkata! https://t.co/kstV41g6GS #FallonTonight Tonight we have the very funny @SethRogen, director Spike Lee and brand new music from @BigBoi. Set your DVRs and your TiVos - all new Tonight Show tonight. #FallonTonight Good morning. I love you right back. https://t.co/mdmckkVIuk Tonight on the show: @TheGlennClose is here, @FinnSkata stops by, and @lauvsongs performs! #FallonTonight Tonight: All-new monologue and Thank You Notes! Plus, Alec Baldwin, Nikki &amp; Brie Bella (@BellaTwins), @Hannahgadsby &amp; music from @tootsmaytals! #FallonTonight Ray Romano reacts to Jon Hamm's impression of him https://t.co/kogxcsv8Kc #FallonTonight Tonight on the show: Ray Romano, @IamLaurenMiller, and music from @leonbridges! Plus, your funniest #MyWeirdBunkmate tweets! #FallonTonight Fun performance from @JBalvin &amp; @NickyJamPR on the show last night!! https://t.co/8EMzCj7bTT #FallonTonight Great show tonight! Kate McKinnon, @MoRocca, and a performance from @NickyJamPR &amp; @JBALVIN! #FallonTonight RT @FallonTonight: Donald Trump returns with a special report from the Trump News Network, the bigliest and newsliest network in the world:… New Show Tonight !!! Let’s go!  Great guests plus a Trump News Network sketch up top. Fun stuff. New Kenny Chesney live tonight!!! #FallonTonight I once shared a cabin with a kid who walked in circles around the room at night and watched us sleep. He called it “night rounds.” #MyWeirdBunkmate It's Hashtags time! Tweet out a funny or weird story about your camp bunkmate and tag it with #MyWeirdBunkmate. Could be on the show! Tonight: @mrbobodenkirk is here, @AliciaSilv stops by, and talk + performance from @kennychesney! #FallonTonight Mila Kunis and I face off against @ZacharyQuinto and @BlackThought in Say That To My Face https://t.co/eETrBZWfho  #FallonTonight Tonight on the show: Mila Kunis, @ZacharyQuinto, and music from @_TaylorBennett #FallonTonight .@GretaVanFleet rocked Studio 6B last night!! https://t.co/Y2yJV6GkG3 #FallonTonight \"Ew!\" with @BritneySpears! https://t.co/0gl22aXcHQ #FallonTonight You guys CRUSHED it. https://t.co/9t5CRAOcEp I wish I thought of that. Thank you. #BritneyOnFallon https://t.co/Uius5c7ByA Tonight: Britney does Ew! #FallonTonight #BritneyOnFallon RT @JBALVIN: Más movimientos para la cultura urbana !! Junto a mi hermano @nickyjampr en @jimmyfallon 🙏🦖🙏 https://t.co/9AFd5jvXd3 RT @NickyJamPR: Latinos arriba! Nos vemos el 1 de agosto junto a mi hermanito @JBALVIN en el show de @jimmyfallon 🔥🔥 https://t.co/UlP9y8bA1F RT @FallonTonight: Excited to announce that @NickyJamPR &amp; @JBALVIN will be performing on our show Wednesday, August 1st!! https://t.co/sNB8… Fun show tonight! Leslie Jones (@Lesdoggg) is here, Emily Ratajkowski (@emrata) stops by, and @GretaVanFleet performs! Plus, Ew! returns with @britneyspears!! #FallonTonight RT @FallonTonight: .@HannahGadsby's stand-up special was supposed to be her last, but it backfired big time https://t.co/fVbtliZw9H RT @FallonTonight: Fun show tonight with @AlecBaldwin, Nikki &amp; Brie Bella (@BellaTwins), @Hannahgadsby, and music from @tootsmaytals! #Fall… Always fun. Tell CB I said ehhhhhhggggggggguh. ❤️ https://t.co/urKGTDPxMb Tonight! Alec Baldwin, Nikki &amp; Brie Bella (@BellaTwins), @Hannahgadsby &amp; music from @tootsmaytals! #FallonTonight Thank you again, @tomi_adeyemi. I had so much fun hanging with you. Check out our #TonightShowSummerReads winner #ChildrenofBloodandBone  before summer is over. https://t.co/QOaCltkJgc .@Tomi_Adeyemi joins to discuss her book \"Children of Blood and Bone\" https://t.co/V0iCUUQCm4 #TonightShowSummerReads #FallonTonight My buddy always punches the shower curtain before he gets in because \"you never who's back there.\"  #MyWeirdFear It's Hashtags time! In honor of Shark Week, tweet out a funny, weird, or embarrassing fear that you have and tag it with #MyWeirdFear. Could be on the show! Can’t wait to meet you!! It’s gonna be fun!! https://t.co/qQU9BJRZWE Tonight: Amy Poehler, @HarlandWilliams, and @tomi_adeyemi! Plus, a performance from @AshleyMcBryde! #FallonTonight .@TomCruise and I perform a #MissionImpossible themed edition of Mad Lib Theater! https://t.co/KkQuxJVS08 #FallonTonight Fun show tonight! @TomCruise is here to talk about #MissionImpossible Fallout, Parker Posey stops by, and @JorjaSmith performs! #FallonTonight RT @FallonTonight: Jimmy will be sitting down with @tomi_adeyemi for a LIVE Q&amp;A!! Submit your questions using #TonightShowSummerReads and j… My sister is the only person I know who will double-park in front of a double-parked car. She calls it triple-parking. #MyWeirdSibling It’s Hashtags time! Tweet out a funny, weird, or embarrassing story about one of your siblings and tag it with #MyWeirdSibling. Could be on the show! Tonight: All-new monologue and Thank You Notes! Plus, @iamjamiefoxx &amp; @TaronEgerton, @zoeydeutch, and @marknorm! #FallonTonight A guided meditation led by @DeepakChopra https://t.co/5sIxvt8Dy6 #FallonTonight Tonight: @PierceBrosnan, @DeepakChopra, and a performance from @PUSHA_T ft. @070shake! #FallonTonight Google Translate Songs: #MammaMia Edition with @AmandaSeyfried! https://t.co/mhFozVQ63Y #FallonTonight Tonight: @AmandaSeyfried is here, @DaveedDiggs stops by, and a performance from @wizkhalifa ft. @goSwaeLee! #FallonTonight .@charlieputh puts his spin on 90s punk songs https://t.co/okCHP1jwNg #FallonTonight One summer I hung up signs saying I’d mow lawns. I tried to quit when my allergies got bad, but my dad wouldn’t let me because “you made a commitment to the community.” #WorstSummerJob It's Hashtags time! Tweet out a funny, weird, or embarrassing story about a bad summer job and tag it with #WorstSummerJob. Could be on the show! Great show tonight: @DavidSpade, Lily James, and music from @charlieputh! #FallonTonight Charades with @iamjamiefoxx, @TaronEgerton, and @zoeydeutch! https://t.co/ItQ0bA0i5N #FallonTonight RT @FallonTonight: Great way to start a week of new shows with @iamjamiefoxx and @TaronEgerton!! Plus, Charades with @zoeydeutch! #FallonTo… Back with new shows!! Tonight: @iamjamiefoxx &amp; @TaronEgerton are here, @zoeydeutch stops by, and stand-up from @marknorm! #FallonTonight And share photos of where you are reading and use #TonightShowSummerReads!! Chapters 3-5 recap of \"Children of Blood and Bone\" https://t.co/HBIGe1A2iz #TonightShowSummerReads Gonna put out a sound cloud soon to check in. Glad you’re reading!! https://t.co/eLhONnVuRG Oh I’m in deep now. But I’ll be checking in tomorrow to see where everyone is at. It’s goooood. https://t.co/E9Jc0VPY6X Well if that’s not a great review. It’s a fun story!! Totally imaginative and just the detail of this new world. Great job @tomi_adeyemi! https://t.co/Rf9LG5MUm4 Happy to partner with you guys!! #TonightShowSummerReads https://t.co/2RniT1ExsX That cover looks awesome!!! https://t.co/9jUQuJBXbF I know. I’m actually using both for some pronunciations. You guys are great. Thanks. #childrenofbloodandbone #TonightShowSummerReads https://t.co/VCBQSTDgnK RT @FirstBook: Congrats, @tomi_adeyemi! https://t.co/33wjC5G1N4 Happy 4th of July!! Thank you Wolfeboro, NH for the best parade as always. https://t.co/cNkQX20Om0 Chapter 2!! https://t.co/tNPRq0jwVu Will read a few chapters and do another update later in the week #TonightShowSummerReads Spoilers ahead! Don't listen unless you've read the 1st chapter of \"Children of Blood and Bone\" #TonightShowSummerReads Recap of Chapter 1 for our #TonightShowSummerReads! https://t.co/nO84Xc1e6j And, share your questions and reactions online using #TonightShowSummerReads as you read along! Kicking off #TonightShowSummerReads with an intro to \"Children of Blood and Bone\" - I’ll be checking in every few chapters during the month of July! https://t.co/b1Q0KVBG9v And the number one book on Amazon is... Children of Blood and Bone - our selection for our very first #TonightShowSummerReads!!! Yahoo!! https://t.co/jZO0Do0r9S RT @FallonTonight: Who's excited to read along with Jimmy?! Share photos of where you're reading the book this summer - along with your rea… RT @FallonTonight: Your votes are in! \"Children of Blood and Bone\" by @tomi_adeyemi is the official book selection for #TonightShowSummerRe… Tonight: @heidiklum, @lakeithlakeith, and stand-up from @taylortomlinson #FallonTonight .@BackstreetBoys, @TheRoots and I perform \"I Want It That Way\" with classroom instruments https://t.co/lRp9IhvH6T Great show tonight: Amy Adams is here, @robreiner stops by, and music from @backstreetboys! #FallonTonight .@DaleJr talks about his amazing dinner with Beyoncé &amp; Jay-Z \nhttps://t.co/zOdVRf5amH #FallonTonight .@DaleJr finally accepts my challenge to a cooler scooter race. It happens TONIGHT!! #FallonTonight https://t.co/2JN1Qgf9w5 Tonight! @icecube, @DaleJr, and music from @intanetz! Plus, new Audience Suggestion Box! #FallonTonight .@SHAQ talks about his apparent history in @NSYNC https://t.co/KZbzHjApWZ #FallonTonight Tonight on the show: @SHAQ is here and @jennadewan stops by!  Plus, a performance from @KeithUrban! #FallonTonight RT @jimmyfallon: We are starting a Tonight Show Summer Book Club!! Vote on which one you would like to read together. https://t.co/Hx8Qr4kt… In honor of the President’s tweet I’ll be making a donation to RAICES in his name. @ashleymason527 @FallonTonight Yes you can. Just pick one and try it! @geo8seven The Good Son There are summaries (my best description without actually reading the book) of each book in a video on the website. We are starting a Tonight Show Summer Book Club!! Vote on which one you would like to read together. https://t.co/Hx8Qr4ktDI Voting ends this Thursday and I will announce the winner on Friday. https://t.co/AFC3ZpNi3Y RT @PenguinBooks: .@jimmyfallon is starting a book club, and wants YOU to help choose the first #TonightShowSummerReads! 🤩 Hop on and vote… RT @CarolineKepnes: Author flips out in backseat of car and nearly falls out the window😍 https://t.co/R5PYQmR6WN RT @JoeIdeTweets: Thrilled to see IQ on @jimmyfallon's #TonightShowSummerReads list...please go and vote for IQ! Thank you! https://t.co/T5… RT @chloekbenjamin: This just happened and I’m not sure when I’ll stop hyperventilating. #TheImmortalists is one of 5 (fantastic!) books in… RT @tomi_adeyemi: in case you prefer this clip with live commentary/shrieking \n\nhttps://t.co/OpIHtqYXVK https://t.co/Neuo7Z6WAi RT @jimmyfallon: 5 awesome books for our #TonightShowSummerReads: Children of Blood and Bone by @tomi_adeyemi, The Immortalists by @chloekb… RT @people: Jimmy Fallon Starts His Very Own Summer Book Club – and We're All Invited to Join https://t.co/KApspk3dT8 5 awesome books for our #TonightShowSummerReads: Children of Blood and Bone by @tomi_adeyemi, The Immortalists by @chloekbenjamin, IQ by @JoeIdeTweets , The Good Son by You-Jeong Jeong, and Providence by @CarolineKepnes! Which one will you choose? Vote at https://t.co/LrFVobW7i3 RT @THR: .@JimmyFallon launches first-ever 'Tonight Show' book club https://t.co/valuWSV4hK https://t.co/vewnueF2FR RT @FallonTonight: Who else is excited for #TonightShowSummerReads? Check out https://t.co/FbBHzAQO9i, read the descriptions of our 5 picks… Just making sure https://t.co/S3MhuLUgqW Here it comes... hope you like?!?!? Wanna play with you guys!!!!! #FALLONTONIGHT Some of my best Rom Com acting since Fever Pitch. I miss it. #FallonTonight I like my tie... you? #FallonTonight no? It’s on now!! NBC the Tonight Show!! Check it out!! I'm excited for a special announcement tonight!! We're launching something fun for the summer and I'm definitely going to want as many people as possible to take part. It's going to be great! Tune In! #FallonTonight #Announcement #Surprise #IJustWantToTellYouNow! #WatchTheShow!! Let’s talk. Looks pretty. https://t.co/OSOyxQnYuT We have a special announcement on our show tonight that I think you guys are gonna like. 📚 #FallonTonight Just wanna give some extra love to my man Dave Diomedi our awesome director for all of the craziness that is our show. Every week. We love you and thank you!! https://t.co/BNOHkUEIFz He always comes to play. I love him. #DaveMatthewsSingsTrap https://t.co/DSWMzu6kTB Dave Matthews sings @Migos. https://t.co/ayfBrp39nd I love that RCA Records is playing along. https://t.co/VuET64wzo3 We had fun with this one. They are all actually talented comedic actors. Seriously. Not much direction for these guys. #NBADraft https://t.co/CyouzI9sJj You were soooo close!! Good luck and make the world better please. https://t.co/XPX4mHJrMK They called the COPS?!?! Hahahahhaha. Thanks for playing with us. https://t.co/opWSIJG1a1 We actually REHEARSED this. That’s how much of a pro this guy is. So fun to play. But also - the album - is a MUST HAVE. They crushed it. #ComeTomorrow is great. I have to say - might be their best yet? https://t.co/gGTAWxkWw9 Tonight: @sethmeyers is here, @dominiccoop stops by, and a magic trick from Penn &amp; Teller (@pennjillette &amp; @MrTeller). Plus, it's #ThankYouNoteFriday! #FallonTonight Dave Matthews sings Cardi B, Lil Pump, Migos https://t.co/tDvWaoaniz #FallonTonight Tonight Dave Matthews gives us a taste of a new album he's been working on #DaveMatthewsSingsTrapMusic #FallonTonight https://t.co/GrSHk3RxhT RT @FallonTonight: Jimmy &amp; 2018 #NBADraft stars join forces for a TGIF-style opening credits. https://t.co/zMgJ4NgpSz Tonight on the show: @michaelstrahan, Dave Matthews, and a performance from @davematthewsbnd! Plus, your funniest #SummerVacationFail tweets! #FallonTonight Pete Davidson talks about his engagement to Ariana Grande https://t.co/RglheJKwlK #FallonTonight He’s the master. https://t.co/TkzoSALIyi He knows I’m good luck. (Okay - it was Spielberg) Congrats, Giancarlo! https://t.co/4R1nm3pzlb I’m gonna miss my boys - before they were famous. Congrats, guys. #NBADraft #FallonTonight #NBC https://t.co/bXccZgl7uy We reminisce with #NBADraft players before they are household names. Here’s the opening to the TGIF show I was in: Play By Play. #FallonTonight #NBC https://t.co/XV21Kia9Rw On #FallonTonight - it is fun as always with Robert Pattinson, Pete Davidson, and @brckhmptn doing a cool performance that you won’t see anywhere else. https://t.co/4rv1rMUTwK RT @FallonTonight: Tonight Pete Davidson confirms his engagement to Ariana Grande. Here's a sneak peek. Tune in to #FallonTonight for the f… Tonight: Robert Pattinson is here, Pete Davidson stops by, and @brckhmptn performs! #FallonTonight Honored to have @davidhogg111 and @lauren_hoggs on the show last night. To get involved with #RoadToChange text CHANGE to 977-79 https://t.co/O6aDh2NPRV RT @davematthewsbnd: We are excited to announce that @davematthewsbnd will perform on @FallonTonight on Thursday, June 21st, on NBC​ at 11:… I told ya!!! I haven’t seen yet. No spoilers.  But watch Tonight Show after - Do Not Play, Whoopi Goldberg, David and Laurie Hogg and Mike Shinoda. (1st solo TV) #NBC #TiVo #TonightShowStarringJimmyFallon #LongestHashtag #BelowDeckMed https://t.co/AV472BYcKF LOVE back. I’ll always be here to make you laugh and you are always welcome. Anytime. 💛 https://t.co/0s2AecQ5Ow It's Hashtags time! Tweet out a funny, weird, or embarrassing story about a time you went on vacation and tag it with #SummerVacationFail. Could be on the show! Tonight: @WhoopiGoldberg, @davidhogg111 and @lauren_hoggs, and a performance from @mikeshinoda #FallonTonight .@alessiacara performs the TV debut of her new single \"Growing Pains\"  https://t.co/dcuFJ5eEpB #FallonTonight It’s always fun to see a comedian crush on the Tonight Show. Here’s a funny set with perfect timing. @NikkiGlaser. https://t.co/ugB8Sp0msh Thank you again, Nikki. #FallonTonight Hot dudes reading!!!! Yes!! https://t.co/hw8eFAm6ap Great show tonight: @JaredLeto is here and @alessiacara stops by to talk and perform! #FallonTonight Happy Fathers Day!!! https://t.co/cVS51TdyKU Oh this is gooooood. 180 gram vinyl remastered and cut at half speed Rolling Stones studio albums from 1971 - on. Tubes are warming up. https://t.co/iRvVTg5sYQ Tonight: @jadapsmith, @BryceDHoward, and stand-up from @NikkiGlaser Plus, it's #ThankYouNoteFriday! #FallonTonight .@Xtina and I put on disguises and busk in a NYC subway station https://t.co/o73bThJtRn #FallonTonight Great show tonight: @prattprattpratt is here, @xtina talks &amp; performs, and some really fun surprises - Tune in tonight! #XtinaOnFallon #FallenKingdom #FallonTonight Supposedly there's a rumor going around that @xtina was spotted busking in #NYC? Maybe tune in tonight to find out? #FallonTonight #XtinaOnFallon https://t.co/Esoh0cxP0l Ha!! This made me laugh. Never stop trying!! https://t.co/y794fc9iEc #DADA #FathersDay Thank you so much @TeenChoiceFOX for the nomination! I feel like I have an advantage because I’m actually the lost Dolan twin. Either way - here are some @YouTube playlists with some of our best from this year. https://t.co/y27lKI17U3 #ChoiceComedian John Travolta teaches me his iconic dance from #Grease https://t.co/xTUfPUWard #FallonTonight Yo yo yo yoooo - 15 year old me?!?!! Just know that one day - this happens! https://t.co/bkgnRkXbwq Danny Zuko is on the show tonight!! Tell me more! Tell me more!!! #FallonTonight #Travolta #Grease #GottiMovie https://t.co/elBfuhBslx Oh yeah. It’s PAPER straws or NO straws. ❤️ https://t.co/5VRoX4j7gv I loved Mr. Rogers and now I love Mrs. Rogers too! Thank you for coming on our show and showing us the meaning of 143 https://t.co/pRbSJWmJgO #143 #243 Tonight: John Travolta is here, @SophiaBush stops by, and @DierksBentley performs! Plus, your funniest #DinoSongs tweets! #FallonTonight .@Renner4Real talks about how he and his @Avengers co-stars got matching tattoos https://t.co/B8uneLAhnY #FallonTonight Miss ya dude!! https://t.co/xTQRltGt6k Tonight on the show: @Renner4Real, @DerekHough, Mrs. Joanne Rogers, and music from @QueensChristine ft. @DaMFunK #FallonTonight .@ovi8, @Holts170, Mike Smith, and I drink from the #StanleyCup\nhttps://t.co/GFSS1jgzdN #FallonTonight RT @Capitals: Needless to say - things got interesting on @FallonTonight...\n\nTune in at 11:35pm on @NBC.\n\n#ALLCAPS #StanleyCup \n\n(📸 Andrew… Tonight I drank out of the #StanleyCup with @ovi8, @Holts170 and Mike Smith and then... I DRANK out of the Stanley Cup #FallonTonight https://t.co/yog2XQDUY0 The raptors, ooh na-na\nThey're chasing us but they're much faster, ooh-na-na\nThis has become quite a disaster, na-na-na\nAnd now I'm running from the raptors\nI thought that they were captured\nThe raptors, ooh na-na\n#DinoSongs It's Hashtags time! Tweet out funny parody song lyrics about dinosaurs or Jurassic World and tag with #DinoSongs. Could be on the show! Excited to be back with new shows! Tonight: Jim Parsons is here, @MarlonWayans stops by, and Washington @Capitals' @ovi8 &amp; @Holts170 talk about their #StanleyCup win! Plus, a performance from @SmashingPumpkin! #FallonTonight It’s my best acting.... https://t.co/gHWm8uXbkk Congratulations Marjory Stoneman Douglas Class of 2018! You are not just the future - you are the present. Keep changing the world. Keep making us proud. #MSDStrong #YouAreThePresent https://t.co/czvZwezKSt @PiyaSRoy @Lin_Manuel Happy Birthday!! The 🐐 🐐 like @halloates. @Lin_Manuel I’m already thinking about a sequel. Goatee Summer w/ @Lin_Manuel. https://t.co/vUD4Pu7D5c #FridayFeeling #TwoGoatees #TwoGoatsInABoat #WePutOurCoatsInOurTotes 🐐 🐐 in a 🚣‍♀️ I love ya! Thanks. https://t.co/opKyaOd8je I’ve played your record so many times that the grooves wore out. Thank you for listening and thanks for the original. https://t.co/BpixKFJ110 Check out our over #CoverRoom s. These have never aired on TV. https://t.co/EFIquEDLqT https://t.co/wCHmnkjR2U Thanks to the whole #CoverRoom team. Check out the others we’ve made like @Billy covering @MileyCyrus or @KeshaRose covering “House of the Rising Sun”. #CoverRoom We had the cameras and the instruments set up. “Wanna try one?” “Why not?” @theroots are just amazing. Thanks guys. It turned out nice. Props to @billybeater. Secret props to @MichaelJFoxOrg and Tracy. https://t.co/xyqz4CJHVZ   #FamilyTies #AtThisMoment It was even more fun getting to perform this in front of an all military audience. https://t.co/A7D0pHkOgd “Only Wanna Thank The Troops” w/@DariusRucker https://t.co/LxlbG42Uc6 #MemorialDay #ThankYou Sometimes the best things aren’t planned. Carla was fantastic and @theroots are just always on the ready and too talented. https://t.co/0Lajne6bT4 RT @YouTubeEspanol: Conoce el niño que hay dentro de @jimmyfallon con la lista de reproducción que creó con sus videos favoritos de #YouTub… Tonight! Julianna Margulies is here, @Giancarlo818 stops by, and magic from @Danwhitemagic! Plus, it's #ThankYouNoteFriday! #FallonTonight \"Only Wanna Thank The Troops\" with @DariusRucker https://t.co/LxlbG42Uc6 #FallonTonight #FleetWeekNYC Tonight: Cate Blanchett, @GuyFieri, and a performance from @dariusrucker! Plus, our entire audience will be made up of servicemen and women from the @USArmy, @USNavy, @USAirforce, @USMC, and @USCoastGuard to celebrate #FleetWeek! #FallonTonight .@Andy Cohen and I team up against @MindyKaling and @BlackThought in a game of Jinx https://t.co/xsMxHf6cVl #FallonTonight Tonight on the show: @MindyKaling is here, @Andy Cohen stops by, and @lilpump performs! #FallonTonight .@MsSarahPaulson talks about meeting @rihanna for the first time https://t.co/RBf3j1u5TT #FallonTonight This is a fun one!! Check it out!! https://t.co/1B0HRbuvWA The entire show is fantastic! Go see it!! Tickets here: https://t.co/kC0lvFHJhK Great performance from the cast of @DonnaSummerBway last night! https://t.co/DFHoEQ66Z3 #FallonTonight @KyleBMercier @FallonTonight Yers, er ser ert. That was a fun talk!! We must do it again. Thank you!!! https://t.co/yZgSNJKrCI Bower is usually my guy. But I had to play around and see what new things this had to offer. #MarioTennis https://t.co/6qs0TSBsDS .EmiliaClarke tell me you didn’t do this at the premiere last night. #SoloAStarWarsStory (For the record I can’t do it either. Or Yoda.) https://t.co/ioZIIYd8yR Before a multiple-choice final, a friend told me, “When in doubt, always go with D.” I got an F. #WorstAdviceEver It's Hashtags time! Tweet out the worst advice you or someone you know has been given and tag it with #WorstAdviceEver. Could be on the show! Tonight: @MsSarahPaulson, @hardwick, @DanicaPatrick, and a performance from @fosterthepeople #FallonTonight It was AWESOME!! https://t.co/6qs0TSBsDS Tune in tonight to see a performance from the Tony-Nominated Musical @DonnaSummerBway #FallonTonight https://t.co/sgfzBgxtvi What's Behind Me? with Tina Fey https://t.co/SiG23x4cyg #FallonTonight Tonight: Tina Fey, @paul_Bettany, and a performance from @courtneymelba! Plus, your funniest #WeddingFail tweets! #FallonTonight .@cordhosenbeck &amp; @tishcattigan talk about their upcoming trip to London to cover the #RoyalWedding https://t.co/33uAS0HXr1 #FallonTonight An amazing performance from Florence + the Machine tonight - Do not miss! #FallonTonight https://t.co/42gNuibrh5 #RoyalWedding talk with @CordHosenbeck and @TishCattigan tonight!! #FallonTonight https://t.co/7JnOfwVgrl Tish really got into the song about the #RoyalWedding tonight. You guys are very musical. Have fun in London!! https://t.co/DZUavQntMI RT @CordHosenbeck: As per my contract, they remodeled my dressing room @FallonTonight to look like my living room. https://t.co/lYaZAeVHrZ Fun show tonight: Will Ferrell and Molly Shannon (Cord and Tish) are here, @ChrissyMetz stops by, and music from Florence + the Machine (@flo_tweet)! #FallonTonight .@Avengers' Josh Brolin tries out different voices for #Thanos https://t.co/wrZKt66qql #FallonTonight @FallonTonight Also - John MacDonald for being a musical genius. Justin - you are amazing. Also our director Chris Tartaro. Amazing work all around. https://t.co/jToxvQoCIK We love having you guys!! Thank you for always being down to try something new. https://t.co/A29lFyPM3i I once went to a wedding where the bride's uncle was asked to leave for trying to start the wave during the vows. #WeddingFail It's Hashtags time! Tweet out something funny, weird, or embarrassing that happened at a wedding and tag it with #WeddingFail. Could be on our show! @RichOnOWN @mashable Biggest challenge was the programming (Toy Con Garage) to every specific note and then tailoring it to every musicians preferences. Oh most definitely. You can tweak the sounds in so many ways - the possibilities are endless. It’s gonna be exciting to see what this inspires. https://t.co/YYcI0C1i4O Thank you @CNET! Long time reader, first time retweeter. https://t.co/4Ss3tyxulJ Yayyyyyy @mashable!!! I knew you would like this!! https://t.co/KH7uWSBG8T Didn’t know how we were gonna pull this one off - but having @theroots and @ArianaGrande definitely helped. (Also with LABO it was almost impossible for me to reallly hit any wrong notes. Almost. 😜) Thanks for liking and linking! https://t.co/lhYPVJwF65 Tonight: Josh Brolin, @CedEntertainer, @ditzkoff, and a performance from @CHVRCHES! #FallonTonight .@ArianaGrande, @TheRoots, and I perform “No Tears Left To Cry” using #NintendoLabo instruments https://t.co/NzROrBC0UB #FallonTonight We made a FULL ON band with Nintendo LABO and @ArianaGrande. Tune in tonight. #FallonTonight #NoTearsLeftToCry #ArianaOnFallon https://t.co/oN2EnRR9Jc Great show tonight: Nathan Lane stops by, @yarashahidi is here, and @kygomusic &amp; @miguel perform! Plus, a special surprise with @ArianaGrande!! #FallonTonight I'm so excited to share this custom playlist I created for #YouTubeKids! It includes my read-along of \"Everything Is Mama\", some fun things we've done on The Tonight Show, and a few of my own favorite videos from when I was a kid. I hope you enjoy! https://t.co/rKHEYAQpNK Tonight! @itsJulieBowen is here, @JustinHartley stops by, and stand-up from @dovdavidoff! Plus, it's #ThankYouNoteFriday! #FallonTonight A phenomenal performance from @ArcticMonkeys last night https://t.co/qzVVYaX6bN #FallonTonight Heads up!! Facebreakers with @AROD tonight! #FallonTonight https://t.co/pqjEDNQE9n Tonight: @Arod, Jamie Parker (@DickLeFenwick), and @ArcticMonkeys! Plus, your funniest #MomQuotes tweets! #FallonTonight Fast Dance-Off with @JLo! https://t.co/EWoex98HXT #FallonTonight Tonight: @JLo is here, Phoebe Waller-Bridge stops by, and @carseatheadrest performs! #FallonTonight Freestylin' With The Roots: Teachers Edition https://t.co/fO0S1nssCU #FallonTonight It was an honor to celebrate #TeacherAppreciationDay with 200 NYC Public School Teachers! Thank you for all the important work you do! https://t.co/wLMjfB4Hda Still to this day, my friend’s mom calls Starbucks “Blockbuster’s.” #MomQuotes It's Hashtags time! Tweet out a funny, weird, or embarrassing thing your mom has said and tag it with #MomQuotes. Could be on the show! Reminder: this Sunday is Mother’s Day. If you know any new or expecting moms, I know the perfect gift! https://t.co/Pebk8WuzdI #MAMAbook https://t.co/FAU6aJg7gr My teachers always told me to shoot for the stars! 🌠 https://t.co/2GmCPBUB5P Great show tonight: @trevornoah, @itsgabrielleu, and @chromeo ft. @BIGBABYDRAM. Plus, it's #TeacherAppreciationDay and I'm so excited to celebrate with our studio audience of awesome NYC Public School teachers!! #FallonTonight Don’t be surprised if you see two professional models on the red carpet of the #MetGala. https://t.co/pYzpONmNDv The latest edition of Tonight Show Screengrabs! https://t.co/Ndwf0XpE6H #FallonTonight RT @GQMagazine: Head to our Instagram Story to hang out with @JimmyFallon as he gets ready for tonight's #MetGala https://t.co/oUZ9ScQY37 h… This is going to be soooo fun. I can’t wait. #ThankATeacher #TeacherAppreciationWeek https://t.co/4RKwDDWriF Hey. Cool! https://t.co/5ZMlrKp6lh Tonight on the show: Michael Shannon is here, @AndrewRannells stops by, and Father John Misty performs! #FallonTonight It’s good to be home. #SNL https://t.co/dyMDKO26nI Tonight! These puppies predict who will win the 2018 #KyDerby! #FallonTonight https://t.co/NPiokt1DTY Tonight: John Goodman, @ZoeListerJones, and stand-up from @JoshBlueComedy! Plus, it's #ThankYouNoteFriday! #FallonTonight Best Friends Challenge with @SteveMartinToGo &amp; Martin Short https://t.co/hT2SFTIp1Q #FallonTonight Vandals and hooligans. https://t.co/sB5oQMpk0W Please enjoy our lead guest @SteveMartinToGo, Martin Short, @SteveMartinToGo, Martin Short, Martin Short and @SteveMartinToGo! #FallonTonight https://t.co/jIPuvUrtIk RT @Lin_Manuel: Gmorning.\nUntie just ONE of the knots in your stomach. \nCross ONE thing off your list. \nCall ONE loved one and surprise the… Tonight: @SteveMartinToGo &amp; Martin Short are here, @poppydelevingne stops by, and music from @SteepCanyon Rangers! Plus, your funniest #ILostABet tweets! #FallonTonight .@RobertIrwin returned last night with baby goats, a kookaburra, and an alligator https://t.co/S1vHyLWRW3 #FallonTonight @ArianaTodayNet @enews @ArianaGrande Make it 3,000,001. #ThanksAriana #ArianaOnFallon #NoTearsLeftToCry RT @ArianaTodayNet: .@enews reports that the #ArianaOnFallon episode broke the record for most social late-night episode of the year, earni… Do Not Play: \"Here Kitty, Kitty!\", \"Wawa Hoagies\" https://t.co/Hmj8brFEuP via #FallonTonight #FunnySongs My friend once bet that Rachel and Joey would never get together on “Friends.” When he lost, I got to call him Gunther for the rest of the year. #ILostABet It's Hashtags time! Tweet out a funny or embarrassing story about a time you or someone you know lost a bet and tag it with #ILostABet. Could be on the show! Tonight on the show: @SavannahGuthrie &amp; @hodakotb are here, Animal Expert @RobertIrwin returns, and @officialjaden stops by to talk &amp; perform! #FallonTonight .@ArianaGrande does an awesome impression of Jennifer Coolidge's character in Legally Blonde https://t.co/pM76HxFenZ  #ArianaOnFallon She crushed it!! Musical Genre Challenge with @ArianaGrande https://t.co/gnzWFRFvq8 #ArianaOnFallon Album title REVEAL!!! (It’s not I ❤️ Jimmy) https://t.co/gJSGFhrBrh We love when you visit. More fun coming soon... https://t.co/CHu3Pq4IpH It is jam packed show with sooo many spoilers. #ArianaOnFallon https://t.co/F6Ixvoc60l Cassandra (@ArianaGrande) and Casey (@JimmyFallon) welcome you to an all new Tonight Show tonight!!! (NBD). Also musical genre challenge (OMG), fan cover surprise (OMG) and the debut of #NoTearsLeftToCry (OMG). The world is watching. (NBD). #ArianaOnFallon https://t.co/MyMmQVXkoD BD for me. ❤️ #ArianaOnFallon https://t.co/nC97YmjXD3 RT @FallonTonight: #ArianaOnFallon TONIGHT! You don't want to miss it. https://t.co/GVoK2GrgRu Our favorite moments will go live on YouTube during the show tonight! Make sure to subscribe to The Tonight Show for first access to #ArianaOnFallon! https://t.co/MxAFyfMjSI TONIGHT: @ArianaGrande is here for the ENTIRE show! Talk, sketches, surprises &amp; the broadcast debut of \"No Tears Left To Cry\" - Do not miss it! #ArianaOnFallon .@Miguel crushed it as always. Watch tonight!! #FallonTonight https://t.co/AVINqvC34Q And I’m sorry, the TV is not part of the gift bag. Please return it. Thx. https://t.co/CuxJKnTR0V You are a funny funny man. Thank you for coming on. https://t.co/CuxJKnTR0V RT @FallonTonight: Don't try @haileybaldwin's life hack for opening beer bottles at home: https://t.co/bPpsy9BNSk https://t.co/AXkGoZx4eI Tonight: @therealroseanne, @MrTonyHale, and music from @Miguel #FallonTonight I love that! Congratulations!! https://t.co/2aoeypHHRy I promise you - some of those dance moves were taken from the original. The hair and wardrobe were for sure. We pay attention to detail at the Tonight Show! https://t.co/HQtLdgHdMF Happy #ThankYouNoteFriday! Tonight on the show: @DrPhil and @haileybaldwin! Plus, stand-up from @juliothesquare! #FallonTonight Thanks again pal! https://t.co/yY5A2nB4UI It was an honor playing you. https://t.co/AANHdxkF3B RT @jimmyfallon: Me and the Bacon Brothers teamed up for a First Draft Of Rock. Tonight’s selection “American Woman” by the Guess Who! Hope… Me and the Bacon Brothers teamed up for a First Draft Of Rock. Tonight’s selection “American Woman” by the Guess Who! Hope you enjoy. #FallonTonight https://t.co/fDeRljY3ss OMG. I love you! https://t.co/oYmK9dCGmf Ha. Perfectly put. https://t.co/PiCMPdVcQT .@MarleeMatlin You are my Rosetta Stone. https://t.co/46YNuQLrBP Tonight: @kevinbacon, @alexisbledel, and a performance from @baconbros! Plus, your funniest #MySuperpower tweets! #FallonTonight David Blaine is fun. https://t.co/dSdWnVtH4s .@DavidBlaine sewed his mouth shut and freaked out me, @PriyankaChopra, and everyone in the audience. It was awesome. https://t.co/qBiROun4We #FallonTonight Thank you again @LateNightSeth and all of the cast and writers and crew. You guys are doing it up. So happy to be around you. Wanna stop by more often - see ya next week!! #LateNightSeth True stories... #LateNightSeth love you boomer!! My hair was not that badddd. #LateNightSeth I am almost on @LateNightSeth ... seconds away - @NBC enjoy some old fun stories. It’s great to see him. #Tablegate #Jagger #Caveman haircut. #LateNightSeth RT @darthdbader: Not only did he spit up a frog, he then SWALLOWED IT AGAIN?! hell naw @jimmyfallon RT @teanicole_: Did he just?? A whole frog?? I rebuke it @jimmyfallon @MakaylaaaaShaye https://t.co/gye3VG20VV Yep. https://t.co/wyvCteZf5i RT @MummaZette: @jimmyfallon I literally threw up 🤢 I agree. He is a magic alien. ???!? https://t.co/ZBq3OdHYBW It’s gonna be okay. https://t.co/K6RcqQMptV I hope you enjoyed that night of variety television. You get the news and everything pop culture as well as celebrities doing things you’ve never seen. Proud to make the #FallonTonight show. Stay tuned and watch me walk up to @LateNightSeth!!! RT @jimmyfallon: Yoooooo FROG!!!! #DavidBlaineMagic #FallonTonight Yoooooo FROG!!!! #DavidBlaineMagic #FallonTonight Quest is gone. Oh no.... #DavidBlaine Nono no no no no no!!!!! No no no no no no no it’s in his mouth!! Noooo!! Gross!!! #FallonTonight #DavidBlaineMagic Jack of hearts 💕 ❤️❤️ It is all real. People were fainting. #FallonTonight #DavidBlaine magic. Oh my god... #DavidBlaine #FallonTonight Get ready. He is amazing on tour starting May 6th on San Diego...\n@davidblaine . #DavidBlaineMagic #FallonTonight #NeedleTrick #BonusYouHaveNoIdeaTrick .@Avengers meet the Brady Bunch for an even bigger crossover:\nhttps://t.co/o89OG5xZo5 #FallonTonight #AvengersInfinityWars #Marvel You know what you saw!!!!! You know what you saw!!! ☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️ It is actually hard to chew 10 skittles and swallow as fast as you can. Props to @priyankachopra and I’m gonna give her the win even though I win. #FallonTonight Here is @priyankachopra - talk about the ROYAL WEDDING!!!! ☘️☘️☘️ Commercials old many dancers ☘️dove men body wash I missed it, playing Higher Love winwood new car? ☘️Ellen talking about anything ☘️fidelis? Not sure what it is but they look nice ☘️local Acura eh💔Remour and Flanagan I would lose the heavy metal 💔 ended okay and happy. Oh you KNOW WHAT YOU SAW!!!!!!! You KNOW!!!!! ☘️☘️☘️☘️❤️☘️❤️☘️❤️☘️#FallonTonight You just bitch slapped someone with an ax. ☘️ It is ax throwing time vs @serenawilliams !!!!! ☘️☘️☘️☘️☘️☘️☘️☘️☘️❤️❤️ Commercials - optimum 💔 jos a bank again? 💔💔 Love that baby and she will love that documentary but also - baby will like me throwing axes with her mom late night in NYC. If I play the character of Super Who Cares Man” it might just make me throw an ax like a Kigsman. #FallonTonight #NBC #NOW . @serenawilliams works so hard. Deserves everything she gets. ☘️☘️☘️ I will tweet as long as I can stay up. ☘️☘️☘️☘️❤️❤️❤️❤️ #FallonTonight Do you guys like the commercials? #Tully☘️ #car one 💔#BookofMormon ☘️ What’s next? @serenawilliams and talk about how she didn’t vibe with her hubby when they first met. #FallonTonight ☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️ It’s @Avengers time!!! RT @jimmyfallon: The Marvel Bunch on #FallonTonight. https://t.co/LMsqWwEAfA RT @jimmyfallon: Tonight on the show: @serenawilliams is here, @priyankachopra stops by, and a brand new magic trick from @davidblaine! #Fa… Take a knee ☘️#FallonTonight ☘️ ☘️ old school comedy ☘️ Welcome to the Tonight Show!!!\nI’m going to cover any news I heard today and put a positive spin. Feedback is welcome. ☘️ for the favorites. 💔if you don’t like it. #FallonTonight The Marvel Bunch on #FallonTonight. https://t.co/LMsqWwEAfA The Brady Bunch meet the Avengers. Oh and also @MarvelStudios’ @Avengers cast did some crossover fun!! #FallonTonight #AvengersInfinityWar watch!! watch!! watch!!! https://t.co/iBBR4tY6OS Kevin was funny wasn’t he?? Tonight is good too. https://t.co/hSisz8r6eP It’s just’s a thing with us. But I do have a few burger spots in NYC that I enjoy. That she might not know about. https://t.co/u8KcziMRMu @GiGiHadid I do. Yahooooo!! https://t.co/AE1FodApUC RT @LateNightSeth: TONIGHT! Seth welcomes @jimmyfallon, @pattonoswalt and musical guest @kylieminogue! https://t.co/fBUmPQXv9k RT @jimmyfallon: Okay - @davidblaine has done it again. I don’t know how he did it - but he did it. That’s @priyankachopra with the iPhone… Yes, that’s a needle and thread through his lips. https://t.co/Y05efjGYsm Thank you for having me on!! So fun!! You look the same as when we first met 15 years ago. Keep up the great work. And yes, I’m still freaked out by Blaine. Wow. https://t.co/RPo6f2ZFue If @serenawilliams throwing an ax isn’t enough to make you stay up tonight.... wait until you see @davidblaine‘s magic trick. @priyankachopra and I are bonded for life. #FallonTonight https://t.co/oZtiiCjtB5 Okay - @davidblaine has done it again. I don’t know how he did it - but he did it. That’s @priyankachopra with the iPhone camera work. You have to watch tonight. It was insane. #FallonTonight https://t.co/pK1ZOmMRU7 Tonight on the show: @serenawilliams is here, @priyankachopra stops by, and a brand new magic trick from @davidblaine! #FallonTonight @ChrissyCostanza ❤️ Thank you for saying that. Also my proceeds from Tonight Dough all go to @SeriousFunCamps so it’s even more perfect!! #BenAndJerry #TonightDough https://t.co/iNMPohQiYe He is a human Shazam. https://t.co/abBu87jGHq So many people to thank for this. Thank goodness for the 5 word webby speech rule. https://t.co/bPtcZfosJm It’s gonna be fun!! https://t.co/kayUTMmsCa @FallonTonight @ArianaGrande Took me two days to get all of that gloss off but it was worth it!!! I can’t wait to have @ArianaGrande back on @FallonTonight!!!! Yahoooooo!!! RT @billboard: Ariana Grande preps her #FallonTonight takeover with skits, chat &amp; TV debut of \"No Tears Left to Cry\" https://t.co/4PKRNn07T… Hi! https://t.co/3O07iTYoWH RT @FallonTonight: May 1st, @arianagrande is here for the entire show! #ArianaOnFallon https://t.co/Yja1YmEZTK Tuesday May 1st @arianagrande is here for the entire show!! https://t.co/Feo0bTUxvA #ArianaOnFallon Big announcement at 8:00am! Keep your eyes on Instagram for more details! https://t.co/5h6n71QEPD Props to Chevy Chase for the inspiration. #FallonTonight I should mention that it’s me tripping over a Cheeto. That was the challenge. Very difficult. #FallonTonight #KevinJamesNetflix I have a feeling this will outlive me. So fun. #FallonTonight turn on @NBC now!!! a GIF from me to you. Watch tonight and see one of my favorite pratfalls with @KevinJames. He is so funny - I had to up my game. Look for bonus face plank. (Nearly impossible to have a board balance on your face and yet here we are.) #FallonTonight https://t.co/s0UKNn0YLc RT @jimmyfallon: .@KevinJames BRINGS it tonight (as always - above and beyond) in the Pratfall Challenge!! #FallonTonight #KevinJamesNetfli… .@KevinJames BRINGS it tonight (as always - above and beyond) in the Pratfall Challenge!! #FallonTonight #KevinJamesNetflix #NeverDontGiveUp #Netflix https://t.co/EYl1TbTWkb My superpower would be to inflate or deflate every Cheeto I grab from the bag, depending on whether I want it puffy or crunchy.  #MySuperpower It's Hashtags time! Tweet out a funny or weird superpower you wish you had and tag it with #MySuperpower. Could be on the show! RT @JILLFRITZO: Watch an Avenger Battle The Karate Kid @ralphmacchio in @jimmyfallon Pinata War on @FallonTonight https://t.co/ownm4TA5In v… Tonight on the show: @KevinJames, @questlove, and music from @thisissigrid! #FallonTonight .@AdamSandler facetimes @JustinBieber while on vacation https://t.co/IBwlLVj4Tb #FallonTonight Great show tonight! @AdamSandler &amp; @chrisrock are here and @OfficialSting &amp; @DiRealShaggy stop by to talk &amp; perform! #FallonTonight Tomorrow night: Adam Sandler and Chris Rock with Sting and Shaggy.#FallonTonight big show!!!!! RT @FallonTonight: .@ralphmacchio brings his #CraneKick to a Karate Piñata showdown with  @AnthonyMackie https://t.co/kvb33LUj4n  #FallonTo… Yes, that is the real headband from the original Karate Kid. @ralphmacchio brought it from his collection!! Cannot wait for @CobraKaiSeries. #FallonTonight #CobraKai https://t.co/NdwE2VCjxm RT @CobraKaiSeries: Hey @jimmyfallon, get ready to wax on, wax off with @ralphmacchio. Check out @FallonTonight, it's about to go down. #Co… Tonight - the great @ralphmacchio! #CobraKai #CraneKick #FallonTonight https://t.co/PoWu9VdsAn Happy #ThankYouNoteFriday! Tonight on the show: @AnthonyMackie is here, @ralphmacchio stops by with a special throwback from The Karate Kid. Plus, stand-up from @KiryShabazz! #FallonTonight #CraneKick RT @billboard: Tina Fey introduces \"Mean Girls\" musical performance and surprises superfans on #FallonTonight https://t.co/hKfKaMxdSy https… First song off of cast recording out now! https://t.co/KqecPxwoPV #FridayFeeling https://t.co/KqecPxwoPV https://t.co/aR51Z2pzKh Go! Go! Go! https://t.co/1kFeN12WOk I love you guys too. https://t.co/zjTyfa2OVM Watch it.... https://t.co/nTi2Sa4Qh3 Not bad. https://t.co/IYnKiHxtfI Do it nowwwwww!!! Who do you love? #FridayFeeling https://t.co/aR51Z2pzKh Yes!!! I’ll take this. And thank you! https://t.co/Jbd5UF8WFk If I had asked her, she would NEVER!! #FridayFeeling #MeanGirls #Fallon https://t.co/aR51Z2pzKh It’s never too soon to tell someone that you love them. https://t.co/LCzsodWixJ I’ll always be here for you, pal. Keep killing it. https://t.co/d88mGZp5IW Fun show tonight: Tina Fey, @evanrachelwood, and a performance from @MeanGirlsBway! #FallonTonight Wheel of Freestyle with @letitiawright! https://t.co/LMIa3ARd6v #FallonTonight I’m psyched about this. #MothersDay just saying... https://t.co/8G3IwuTMYI Haaaa! I could never ever do what you do. Although - you’re working with a pretty perfect canvas. See ya soon! https://t.co/R74pKmKZhe Tonight: Claire Danes is here, @letitiawright stops by, and a science demo from Kevin Delaney! Plus, your funniest #StonerStories tweets! #FallonTonight .@offsetYRN &amp; @metroboomin perform \"Ric Flair Drip\" with @RicFlairNatrBoy\nhttps://t.co/yXWTzyxuxU #FallonTonight Thank you again to the generous and talented Moore Family from North East Philadelphia. That was a great time and those CHEESESTEAKS??!?!  Yum! See you in New York at the show. #SurpriseDinnerParty #FallonTonight We. Are. Here. #SurpriseDinnerParty https://t.co/RHnQG0DPqg #FallonTonight Great picture of Tariq. (@BlackThought) Philly - we are on our way!!!! https://t.co/RHnQG0DPqg #SurpriseDinnerParty https://t.co/Eemu6IXpQX .@BlackThought &amp; I are headed to Philadelphia tonight and we're going to surprise a family for dinner at their home! We'll be live streaming the entire surprise on Facebook so everyone can join in!  It may be you! #SurpriseDinnerParty RT @FallonTonight: Robert De Niro pulled a little prank on Jimmy as his first guest ever https://t.co/49UNjW7rs3 https://t.co/chRHZII9e3 Tonight on the show: @joelmchale, Michael Che, &amp; music from @offsetYRN &amp; @metroboomin! #FallonTonight Robert De Niro has never seen a dog before https://t.co/KnmFVXBSem #FallonTonight #Tribeca2018 He is conversing with my person. Tonight. #Fallon https://t.co/WESaZNlPuY I once walked in on my roommate eating a box of dry spaghetti. I came back 10 minutes later and he was using them to spell out the word \"PASTA\" on the table. #StonerStories It's Hashtags time! Tweet out something funny, weird, or embarrassing that happened while you or someone you know was stoned and tag it with #StonerStories. Just don't write the stories while you're stoned, we gotta keep 'em short! Could be on the show! Mercury is NOT in retrograde. https://t.co/0LOQWpegZ0 Rex Orange County! Rex Orange County! @RexOrangeCounty! https://t.co/ZGGaQPiPZk The song has sort of a 70’s feel while the video has a sort of a Davey and Goliath/claymation kind of thing. Check it! Today is #MonologueMonday where you see our rehearsal opening monologue around 3:30 streaming on Insta and FB but it’s also #MusicMonday and tonight we have one of my favs - Rex Orange County - Loving is Easy https://t.co/rolUEBs5WA #Fallon Really fun show tonight: Robert De Niro is here, @bridgeteverett stops by, and @rexorangecounty performs! #FallonTonight Tonight: @jeff_daniels is here, @JoeManganiello stops by, and stand-up from @ComicMikeV! Plus, it's #ThankYouNoteFriday! #FallonTonight .@Tinashe and @OffsetYRN KILLED it last night on the show. The look, the lights, the dancing. It was fantastic. Well done. https://t.co/MJ7xeD24A1 #ShowMeMoves #FallonTonight Some of your funniest #IGotBusted tweets! https://t.co/8oISjRKXiZ #FallonTonight I cannot wait for this!! https://t.co/xd9WtEaCZK Not today, Satan! https://t.co/OfW61ovDPW Tonight: Jack White (@thirdmanrecords), @Miss_GraceJones, and music from @Tinashe ft. @OffsetYRN! Plus, your funniest #IGotBusted tweets! #FallonTonight Mad Lib Theater with @kerrywashington https://t.co/RxlwA4Tbjo #FallonTonight RT @ChrisEvans: This is the moment we met. He was trying so hard to stay seated even though he desperately wanted to get out. I knew right… Great show tonight: @kerrywashington is here, @gadelmaleh stops by, and @5SOS performs! #FallonTonight Jon Hamm and @BlackThought team up against @emrata and me in Charades https://t.co/ezq8HnBl9L #FallonTonight Tonight on the show: Jon Hamm, @emrata, and @PReedGolf! Plus, @thegreatkhalid &amp; @NormaniKordei perform! #FallonTonight One time my friend and I tried to break into a vending machine to steal candy. The machine tipped over on my friend and broke his leg.  #IGotBusted It's Hashtags time! Tweet out something funny, weird, or embarrassing you got caught doing and tag it with #IGotBusted. Could be on the show! No that was the one thing I always remembered about you. You loved the character Oliver the most. https://t.co/3ixRtUOgfi It’s either Disney or Lake George. Or the set of the Brady Bunch? (You know the episode.) To the best sister in the world... @GloriaFallon123 I love you. Happy #NationalSiblingsDay!!! P.S. Our family rarely went on vacation - Gloria where the hell were we? https://t.co/6Mhg4lv3jB Congratulations to my late night brother @sethmeyers on baby Axel and congrats to his brother Ashe for celebrating his first #NationalSiblingsDay!!! So many fun moments with @iamcardib last night including a SCARY Box of Lies that Cardi said almost made her go into labor! (Not really.) 😂https://t.co/XQ8clk2w3o Again, you were so fun and thank you. xoxo Uncle Jimmy #CardiBonFallon .@IamCardiB is a natural out there. Please don’t take my job. 😁 😬😯https://t.co/nuiGsuKQ7k love ya!! thank ya!! #Shmoney #CardiBonFallon .@iamcardib is my co-host TONIGHT and lots of surprises planned! Going to be a great show! Don’t miss it! #CardiBonFallon Congrats on the movie. See ya on 4/20. https://t.co/P2EIClHFxR Kenny’s got moves. https://t.co/MOjsBWLZN7 RT @FallonTonight: .@TiffanyHaddish shares the story of the time she was in an elevator with Brad Pitt https://t.co/paCZ6UqTK7 I’ve never met Tiffany before tonight’s show. I’m not sure I’ve ever met anyone like her in my life. Fun and funny. Different. Original. Impossible not to love. (My wife agrees.) https://t.co/GqyAb1eEOK You are going to want to watch @TiffanyHaddish on the Tonight Show tonight! #Fallon #TiffanyHaddish https://t.co/Aix9vFAqNl You are welcome anytime. Please come back soon. Tell Caroline I said hi. https://t.co/rlE3kyZkIL Great Show Tonight: @TiffanyHaddish is here, @jaychandrasekha &amp; @HeffernanRules stop by, and @richthekid performs! Plus, it's #ThankYouNoteFriday! #FallonTonight They were goodies. I had some fun roommates throughout the years. https://t.co/ZJuMIDd8kd I know it’s too early to say but... I wanna be the first to congratulate @IAmCardiB on the number one album! #InvasionOfPrivacy See ya on the show Monday!!!! Co-host!! Some of your funniest #MyWeirdRoommate tweets! https://t.co/Put9NYNSDT Good monologue tonight with a cameo and  good #MyWeirdRoommate hashtags from you guys!! Thank you!! Watch a brand new Tonight Show tonight on @NBC with Norman Reedus @wwwBigBaldHead, @WendyWilliams, @NateBargatze + cameo by @DesusNice and @TheKidMero! #Fallon #Yo #Woww #WalkingDead #MyWeirdRoommate https://t.co/QVfLwSBQwz .@WendyWilliams sorry for the spittle tonight. Thanks for calling me out. Talking about hot sauce will do that to a person. See you soon! 😂 ☔️💦 RT @Sethrogen: I’m back! Here’s a trailer for my Netflix comedy special that comes out tonight at midnight! Please watch it! I think you wi… It’s #NationalBurritoDay AND an all new Tonight Show?!?!?! Yes please! #Fallon https://t.co/3kKpfoxBY8 I love a feature!! I can see it now... Jimmy Fallon feat. Justin Timberlake and Quincy Jones. #SeeYaAtTheGrammys https://t.co/WnLBrbCk9F Tonight on the show: Norman Reedus (@wwwbigbaldhead), @WendyWilliams, and stand-up from @natebargatze! Plus, your funniest #MyWeirdRoommate tweets! #Fallon Mike Myers brings back Dr. Evil to talk about getting fired from the Trump Administration https://t.co/mWojY8IfDU #Fallon #DrEVIL RT @FallonTonight: Jimmy interviews the latest person to be fired from the White House, Dr. Evil (Mike Myers) #FallonTonight #DrEvilOnFallo… Find out why Dr. Evil has become the newest member of the Trump Administration to be fired. #Fallon #NBC #DrEVIL #FallonMono https://t.co/TMnck1My0P RT @jimmyfallon: Oh - just so you know Dr.Evil will be in the monologue tonight. NBD. Watch the first 10 minutes of the Tonight Show on NBC… It was so bizarre to see Dr. Evil walking around the hallways tonight before the show. I’m one of the biggest #AustinPowers fans. #Fallon #DrEVIL #DrEvilOnFallon Check it out!!!! Let me know your favorite line from tonight’s monologue. Watch the first 10 minutes of @FallonTonight. #DrEVIL #Fallon https://t.co/HEATJMkWct Oh - just so you know Dr.Evil will be in the monologue tonight. NBD. Watch the first 10 minutes of the Tonight Show on NBC. #DrEVIL #Fallon https://t.co/JJqzxO17rF I once had a roommate who got so mad at everyone’s dirty dishes that he bought his own set of silverware and wrote his name on every fork, spoon, and knife. #MyWeirdRoommate It's Hashtags time! Tweet out a funny, weird, or embarrassing story about a roommate you've had and tag it with #MyWeirdRoommate. Could be on the show! Tonight on the show: Mike Myers, @abbijacobson, and music from @asvpxrocky! #FallonTonight .@JohnKrasinski talks about his new horror film #AQuietPlace https://t.co/jJFwcEmqhF #FallonTonight Yeessssss!! I’m in. I’m in. I’m in. Let’s make a record. #LegallyBindingTwitterContract https://t.co/5SeeIBoh1o Dream come true. See you Monday @iamcardib!! #Reunited #InvasionofPrivacy #NewRecordAlert RT @amazonmusic: Look out now. NEW @iamcardib (!!!) \n🎧 \"Be Careful\" https://t.co/CpoCLoQuwZ https://t.co/DNu9vnP5TR Tonight on the show: @johnkrasinski is here, @abigailspencer stops by, and @JadeBirdMusic performs! Peter and His Heckler - \"The River of Dreams\" (with @RealTracyMorgan) https://t.co/cSeAVIAjUL #FallonTonight Vanderpump Rules? Just watched #AQuietPlace. Congrats @johnkrasinski, I can’t sleep and I’m all out of Gilmore Girls to watch to clear my head. What psycho wrote this? Oh you did. What crazy person directed this. You again. Cast your real wife as your wife? Come on!?! We have to talk. https://t.co/CE2hYbAGUs RT @iamchrislane: TONIGHT!! Y'all catch me and @torikelly on @FallonTonight  at 11:30pm ET 😊 https://t.co/2UlfPRQAwi Excited to be back this week with new shows! Tonight: @RealTracyMorgan, @katemara, and music from @iamchrislane ft. @torikelly! #FallonTonight Happy Easter!!! Lookin’ gooooood. https://t.co/QQNw79QK1d I love youz too!! https://t.co/Jq0W4W7Uvk @agoggans @awlasky @FallonTonight Ahhhhhhhhhhhhhh. https://t.co/RUJGxx6oug I loved meeting up with you guys!! What a day?!?! What. A. Day. https://t.co/NXd1Xyy1Dn Oh - this is maj! @benandjerrys #TonightDough - all of my proceeds go to @SeriousFunCamps. Eat with pride. https://t.co/SEa20i7tix RT @NBCNews: WATCH: Emma Gonzalez names the murdered Parkland victims and observes several minutes of silence in a 6-minute, 20-second spee… Today is @AMarch4OurLives. I’m partnering with @MTV and @NAACP to sponsor a bus full of smart young young people traveling from NYC to #MarchForOurLives Washington, D.C. today. Thank you for standing up and saying you’ve had #ENOUGH. See you there. This cameras were real. Not just a funny bit. Will goes for it. Should be a cool experience. Subscribe. 🙂 What is it like to make an entrance through the curtain on the Tonight Show? What is it like to be Will Smith? (for a few minutes) https://t.co/0iqF54Qto9 #WillSmithChannel #NewChannel #YouTube #Fallon When your kids idols become yours. Thank you #PawPatrolLive #NationalPuppyDay https://t.co/ES3ujqn2HV Happy #ThankYouNoteFriday! Tonight: @tylerperry is here, @jimjefferies stops by &amp; stand-up from @JoeListComedy! #FallonTonight History of TV Theme Songs with Will Smith https://t.co/ETXeo2wuCo #FallonTonight Will Smith always brings it. Golden Girls? Check. Good Times? Check. Cheers? Check. Fresh Prince? ... https://t.co/1J54TEb0QM @zoeydeutch 3. You must do that in a movie. Congrats on Flower! Oh no!!! I meant to say that your mom starred in HTD!!! Ugh. Sorry. Ah well - you have very talented parents. You can see why you are a star. That was fun. See you soon!! https://t.co/4U9t46wxWj He didn’t even need cue cards!#Ducktales fan. Come back anytime. Thank you!! https://t.co/99N1pXRLkG Tonight: Will Smith is here and we've got a big surprise planned, Fran Lebowitz stops by, and @billieeilish performs! Plus, your funniest #MyDumbBet tweets! #FallonTonight .@PanicAtTheDisco's @BrendonUrie sings the DuckTales theme song! https://t.co/i5g7i4qEor #FallonTonight . @ShawnMendes it’s a goodie. https://t.co/BlFBRoyaQU Thank you. https://t.co/7nwUTNIIVi Great stuff on tonight - suggestion box and @brendonurie - @jayleno surprises and #Ducktails.#FallonOnNBC #snowday Check out the show tonight. #Fallon #Leno surprise #Panicatthedisco #NewSong #Ducktales Check out the show tonight! #Fallon https://t.co/bHZ9Gb5iJk It puts it all in perspective. She is a funny cute and charming kid. That was a fun time. Thank you Maggie. See you soon with the squeaky cheese. https://t.co/qNxkbpYx0q Love you too! https://t.co/zZaGtuB4SU I’m so glad you had fun. It was a good one. https://t.co/Xy9JHcChkk .@PanicAtTheDisco is going to destroy tonight. Also - maybe a fun side song... 🤷‍♂️ #Fallon #SayAmen #PanicOnFallon @blakeshelton Do you want to have this framed or should I? Text me later dude! #TextiestManAlive https://t.co/DhEG6VsBfb I once bet my buddy that he couldn't eat 100 Peeps. He won, but I had to take him to the hospital. #MyDumbBet It's Hashtags time! Tweet out a funny or embarrassing story about a bad bet you made and tag it with #MyDumbBet. Could be on the show! Tonight: James McAvoy, @zoeydeutch, music from @PanicAtTheDisco, and new Audience Suggestion Box! #FallonTonight @BlakeShelton is the best. I love it when someone can dish it out but also take it. Download #TexomaShore it’s a good record. https://t.co/trI0h9XKmx .@blakeshelton and I visit a psychic in the East Village. Are we soulmates? Our adventures continue... https://t.co/IFapjkECBm #Fallon #TeamBlake #TexomaShore #NYC #Psychic #TheVoice .@blakeshelton and I get our palms read by a psychic and we see the future of our relationship. #Fallon #Psychic #TeamBlake #TexomaShore #SnowDay https://t.co/KY7UfjFXsz I am a #Neighbor4Life. This movie looks fantastic. #MrRogersMovie https://t.co/3AbTqqr0qF I loved Mr. Rogers. Currently a #DanielTiger supporter. Always a #Neighbor. https://t.co/TeMysTZwaF Tonight on the show: @JohnBoyega is here, @bobsaget stops by, and music from PRhyme (@REALDJPREMIER + @Royceda59) ft. @2chainz! #FallonTonight Name That Song Challenge with @blakeshelton https://t.co/sSWG2RJ0Bi #FallonTonight Tonight: @blakeshelton is here to talk &amp; perform, @ScottEastwood stops by, and more!! #FallonTonight Respect to @TXSOTigers and congrats to @XavierMBB. Thank you Pete, Joanne, and Ceara! 🍀 I’ve been going to Molly’s pub for almost 20 years.  It's especially good luck on St. Patrick’s Day!  #PreGame #HappyStPatricksDay #LastNightAt #Mollys #Fallon #NYC https://t.co/xM8k2QwUOb Any fan of Bruce Springsteen or The Band should watch this - Nathaniel Rateliff &amp; The Night Sweats covering “Atlantic City” https://t.co/EE4Kp1AE4P  #CoverRoom #FallonTonight .@TXSOTigers - this is your pep talk. #FallonTonight #MarchMadness #TigerNation #BeLegendary https://t.co/rePwcQyC5N Great Show Tonight: Bill Hader, @jimmybuffett, and music from @troyesivan! Plus, your funniest #MyDrunkStory tweets! #FallonTonight Alicia Vikander introduces me to a new Swedish game called “Irish Christmas Eve.” I’m still dizzy. https://t.co/DJsniigkph #FallonTonight Trump re-edited to sing \"Let's Talk About Rex\" https://t.co/kPxRUT5tq4 I support the students and teachers on #NationalWalkoutDay. This is what change looks like. Tonight: Alicia Vikander, @mrjimsturgess, and music from @KALIUCHIS ft. @tylerthecreator! #FallonTonight Chris Sullivan (@SullivanTweet) keeps trying to sneak the phrase \"This Is Us\" into the show https://t.co/ocCnKNFHeA #FallonTonight One night I got drunk with a foreign diplomat. He thought I worked for “the embassy.” Turns out I work for “NBC.” #MyDrunkStory It's Hashtags time! Tweet out a funny or embarrassing drinking story and tag it with #MyDrunkStory. Could be on the show! Tonight: @rickygervais is here, @SullivanTweet stops by to chat, and  @AmySharkMusic performs! #FallonTonight Alec Baldwin addresses Trump's recent tweets about his impersonation on SNL https://t.co/HXb0f79O4i #FallonTonight Tonight on the show: Alec Baldwin, Billy Crudup, and music from @NRateliff &amp; The Night Sweats! #FallonTonight I do. https://t.co/eMig9dxhHn Happy #ThankYouNoteFriday! Tonight on the show: @DrewBarrymore, @JoshRadnor &amp; stand-up from @KelseyCook!  #FallonTonight Think Fast! with @SterlingKBrown https://t.co/OcU8cfX1az #FallonTonight Jack, you were fantastic tonight and honest and funny and THEN you play a great song with your DAD playing guitar in the band. That’s a win. See you whenever. Thanks. #FallonTonight https://t.co/OCd82UaTWL These are just some of the awesome women I work with at the Tonight Show - without them there would be no Tonight Show. Thank you! #InternationalWomensDay #FallonTonight https://t.co/hQLOrfLGCh Tonight: @SterlingKBrown, @jackantonoff, and music from @bleachersmusic. Plus, your funniest #IfIHadASuperpower tweets! #FallonTonight He’s got it!! Perfection. https://t.co/JtApQiwX4B \"Ew!\" with @JohnCena https://t.co/h3BLxJ6qBB #FallonTonight RT @catheb: Ew! My new best friends..😂🌸💗 @jimmyfallon @JohnCena #Ew #FallonTonight https://t.co/jobqaFM9IM My superpower would be “knowing which pack of Starbursts has the most pink ones in it.” #IfIHadASuperpower It's Hashtags time! Tweet out a funny or weird superpower you wish you had and tag it with #IfIHadASuperpower. Could be on the show! Tonight: @JohnCena is here and we have a special surprise planned! Plus, Katherine Langford stops by and @JDSSband performs! #FallonTonight .@iamjohnoliver talks about the time he got a hug from @Oprah https://t.co/aMsQwLlQ23 #FallonTonight Tonight on the show: @iamjohnoliver is here, @lucyhale stops by, and @marshmellomusic &amp; @AnneMarieIAm perform! #FallonTonight RT @FallonTonight: U.S. Women's Olympic Hockey goalie @maddie_rooney35 challenges Justin Bieber to score a goal on her. Thoughts, @justinbi… Tonight: @KatieHolmes212, Brian Tyree Henry, and the U.S. Women's Olympic Ice Hockey Champions!! Plus, music from @Meghan_Trainor! #FallonTonight .@jimmykimmel is gonna crush it tonight! And I’m riding on it since most people think I’m @jimmykimmel. #Oscars TONIGHT - @Lin_Manuel &amp; @AlYankovic talk about the highly anticipated #Hamildrop \"The Hamilton Polka\", Macaulay Culkin stops by to chat, and U.S. Men's Curling Team @TeamShuster join to discuss their Gold Medal win! Plus, music from Francis @AndTheLights! #FallonTonight Singing Whisper Challenge with @aliciakeys! https://t.co/uFgCGNB9oK #FallonTonight It’s a Weird @AlYankovic masterpiece. He added everything in his arsenal to that polka. Harmonies, rapping, duck quacks, slide whistle, Spike Jones spittoon sounds, jazz snaps all with the brilliant words and music from @Lin_Manuel. It is phenomenal. Should we lip sync it tonight on our show? Yes. The answer is yes. #FallonTonight https://t.co/WiaSAeUecu Thank you @chadwickboseman. https://t.co/UHfFIcomL5 Right now!!! Turn on NBC!! One of the best shows we’ve ever done. People will be talking about it. #FallonTonight In high school I asked the girl I thought I was dating, \"What do you want to do for Valentine's Day?\" and she said, \"I already have plans.\" #HowIGotDumped It's Hashtags time! Tweet out a funny or embarrassing way that you or a friend got dumped and tag it with #HowIGotDumped. Could be on the show! RT @jimmyfallon: #BlackPanther is here tonight! We've got something special planned with @chadwickboseman! Plus @MarlonWayans stops by and… Seeing Chadwick in a few!!! Tonight’s gonna be fun!! #BlackPanther is here tonight! We've got something special planned with @chadwickboseman! Plus @MarlonWayans stops by and music from @zdevin! It’s an all-new #FallonTonight RT @chrischann: SEASON 2 https://t.co/qPzujo77jM via @YouTube .@chrischann is back. Thank god.  https://t.co/opzVLT03La #ChanninNYC #ChrisChann #iJustSubscribed #ToTheYouTubeChannel Freestylin' with The Roots with surprise audience member, Bruce Willis https://t.co/yhZCaWXPmc #FallonTonight Tonight: Bruce Willis, @unfoRETTAble, and music from @towkio #FallonTonight We're back with new episodes!! Tonight: @JohnLithgow, @Kelly_Clarkson &amp; music from @KaceyMusgraves! #FallonTonight RT @alyankovic: .@geoffedgers from the @washingtonpost has a new podcast called \"Edge of Fame\" - and this week it's all about yours truly (… RT @JustJared: .@calebmclaughlin's latest interview with @jimmyfallon is too funny! Watch: https://t.co/CCGaMxGuSV Maj preesh! https://t.co/4VIsRWnKSm \"Homemade\" edition of #FallonFive with @calebmclaughlin! https://t.co/IRdA5HOoNF Tonight: @calebmclaughlin stops by for a special #FallonFive! Tonight Show Celebrity Photobomb with @chloekimsnow! #Olympics #FallonFive https://t.co/o7Rm8u9s9m New #FallonFive tonight! Gold medalist snowboarder @chloekimsnow is here to talk about her win at the #Olympics, and we've got some other fun stuff planned. You don't want to miss it! RT @FallonTonight: .@DesusandMero rename sports from the Winter #Olympics! #FallonFive https://t.co/G7VivY4C6K Around 11-ish I’m on with @RealSway on @Shade45. Tonight on #FallonFive: @desusandmero stop by to give their take on the Winter #Olympics! I will be on @MorningMashUp around 10:45 this morning. Stay in your cars or wherever you listen to SiriusXM. Fun. RT @FallonTonight: The first-ever Tonight Show one-minute interview with Paul Rudd! #FallonFive https://t.co/PhSF24oavv Ohhhhh #FallonFive happening tonight!! 12:05. @nbc let’s us have 5 minutes- Olympics jokes topical jokes. Check it out tonight. Thanks. #FallonFive #FallonTonight I’m staying over. See you tomorrow. https://t.co/y9C4R5hjSv RT @965tic: @jimmyfallon &amp; @paulruddcom are the Kings of Music Video Recreation https://t.co/htisiposxm Thank you man!! https://t.co/VHXDiOYOl0 Haaa!!! I will! I will! https://t.co/QmBh5R0DrW Happy Valentine’s Day! RT @FallonTonight: \"King of Wishful Thinking\" - Original &amp; Remake\nhttps://t.co/UFcE7jrJ3B I’m fine. How are you? Love back. https://t.co/zNsI3CLOnc Totally. Go USA!!! https://t.co/Brzz6x4Sr9 Thanks again to #PaulRudd and #GoWest https://t.co/N24Yr4AviG I tried my best. Do you know how hard it is to get Boy London biker shorts? Props to Tonight Show wardrobe and costumes! https://t.co/xR3R4rBclr Made with love. Thanks for the original! Also, I have so many questions... https://t.co/PdnkAuvPzy RT @FallonTonight: The cutting room floor is full of Paul Rudd's incredible dance moves from the remake of the \"King of Wishful Thinking\" m… \"King of Wishful Thinking\" with Paul Rudd https://t.co/crYpQOip4n #FallonTonight Beat the best. #USA https://t.co/M66PUZpW5j RT @FallonTonight: Jimmy gives a pep talk to Team USA before the Winter #Olympics. h/t Shia LaBeouf https://t.co/BpbHHnb2ju Tonight: Paul Rudd is here with a special music video remake, Laurie Metcalf stops by, and @AliceMerton performs! Plus, it's #ThankYouNoteFriday! #FallonTonight Some of your funniest #WhyImSingle tweets https://t.co/G7Hbcfsd4o Tonight: Andrew Garfield, @RachelBros, and stand-up from @bonniemcfarlane! Plus, your funniest #WhyImSingle tweets! #FallonTonight .@TimTebow and I look at Tebow fan tattoos https://t.co/TjgEuTfbP7 #FallonTonight I eat the top layer of my popcorn using only my tongue. #WhyImSingle It's Hashtags time! Tweet out a funny or embarrassing reason why you're single and tag it with #WhyImSingle. Could be on the show! Tonight on the show: Sienna Miller, @TimTebow, and music from @NoelGallagher's High Flying Birds! #FallonTonight RT @FallonTonight: Jimmy talks to the @Eagles' @ZERTZ_86 about his #SuperBowl-winning touchdown. https://t.co/bhCuYnvbjZ Back in New York with a great show tonight! @SJP is here, @jessetyler stops by, and music from @diplo ft. @MOMOMOYOUTH &amp;  @GoldLink! Plus, players from Super Bowl Champion Philadelphia @Eagles!! #FlyEaglesFly #FallonTonight What an awesome trip! Thank you for hosting us, Minneapolis! When can I come back?? https://t.co/IrdYQp3eJb RT @FallonTonight: Bob Dylan updates \"The Times They Are A-Changin'\" for 2018 #FallonLIVE https://t.co/qfCd4DGv3o Thank you Minneapolis! Good night. #FallonLIVE LIVE in 10 minutes!!!! @jtimberlake, the cast of @NBCThisisUs, @TheRock and @ChrisStapleton. #FallonLIVE from Minneapolis! Getting ready - we are on LIVE in MN after @NBCThisisUs TONIGHT!!! #FallonLIVE YESSSSS!!!! THAT IS HOW YOU DO IT!! Magic. Loved THAT! See you in a few. #PepsiHalftime #JustinTimberlake Go get ‘em Justin. #PepsiHalftime #SBLII #JustinTimberlake Have the parties started yet? Cheers!! @MNSuperBowl2018 @PEPSI #PepsiHalftime #FallonLIVE https://t.co/T3EWgoOhgh You guys have been phenomenal. Keep it up - you’re almost at the homestretch. https://t.co/5kWxf9XraE RT @StubHub: #StubhubPlaybook Rule 67: Invite @jimmyfallon to your pregame ✅ https://t.co/Iz7zvt434d Here!!! Town Ball!! https://t.co/Vx1wV1KkkN On my way to Town Ball Tavern at Target Field. @FallonTonight is having a tailgating party!!!! Food, games, music, @handshigh55 sweatshirts, KOOZIES and @benandjerrys Tonight Dough Pint Slices! #FallonLIVE Off to Town Ball Tavern at Target Field. The Tonight Show is having a party. See you there! Happy #SuperBowlSunday https://t.co/4yHFHWwVUE https://t.co/Wpx8XqtZys @pepsi Oh I was scared. And cold. We did so many takes that my right had was frozen into a GI Joe Kung Fu grip around the @Pepsi can. I was probably 5-6 stories up!#PepsiHalftime Here is proof that I was really sitting ON the @Pepsi sign (harnessed to it actually) with a drone camera keeping me company just so you don’t think it was CGI. I was there - the breeze coming off of the East River - preparing me for MN - freezing my “S” off. #PepsiHalftime https://t.co/QMDxar5Xbs Watch in the mirror for full effect. See you tomorrow! #FallonLIVE https://t.co/lzA0Gzl0jS @KevinHart4real I got the bug!!! Thanks for having me. That’s a crowd!!! #IrresponsibleTour #SuperBowlWeekend Thank you to the Salzer family in Champlin, MN for the best tater tot hot dish in town. You made me feel so welcome. You guys are the best!!! So fun!! Thanks!! https://t.co/mHWZwUphLq @Z100NewYork @samsmithworld Sad but true. I will bring it back. I promise. RT @jtimberlake: Man of the Woods... out now! https://t.co/L9yGfZpcbg https://t.co/jcSuUxHiX0 Right now @elvisduranshow and @z100newyork with @elvisduran!! We will talk all things Super Bowl. Tell Alexa to play Z100. RT @LiamPayne: If you missed our full performance from @FallonTonight, here it is https://t.co/WSbOINBHN4 @RitaOra https://t.co/jPz4q8RVyz Tonight: @samsmithworld, Cecily Strong, and magic from @Danwhitemagic! Plus, your funniest #MyWeirdSuperstition tweets! #FallonTonight Celebrate #WorldReadAloudDay today with a MAMA you love!  @LitWorldSays https://t.co/NXm8gjy6Ys https://t.co/ePtNMyyzK5 These puppies predict whether the @Eagles or @Patriots will win Super Bowl LII!! https://t.co/SGjEDpdxUp #FallonTonight I'm coming to Minnesota and I really want a home-cooked meal!! Who wants to host me? Send your recipe and why I should come to your home to JimmyVisitsMinnesota@tonightshow.com!! https://t.co/6S8nbSGNvw Happy Birthday @jtimberlake!!! Here’s to many more years of bro biking and Drip Drops! Love ya bro! #ManOfTheWoods #SuperBowlHalftime #Birthday #WhatAWeek See you tomorrow morning @ElvisDuranShow!!! Bright and early. I can’t wait!!! (How early is early?) #iHeartElvis Tonight on the show: @katiecouric stops by and @RitaOra is here to chat! Plus, music from @LiamPayne &amp; @RitaOra! #FallonTonight .@chrissyteigen and I take the Best Friends Challenge! https://t.co/3DWsGhIByC #FallonTonight Think Fast with Dakota Johnson! https://t.co/lCR7RvIvn8 #FallonTonight Once I made my kids waffles before they went skiing, and they didn’t fall down the entire day. Now they think waffles are what keep them from falling down while skiing. #MyWeirdSuperstition My buddy has a Giants jersey that he refuses to wash for the entire season. He keeps it on a hanger in the garage so his regular clothes don’t “steal its power.” #MyWeirdSuperstition It's Hashtags time! Tweet out your funny or embarrassing superstition and tag it with #MyWeirdSuperstition. Could be on the show! Tonight: Dakota Johnson is here, @LesterHoltNBC stops by, and @Jason_Aldean performs! #FallonTonight Will Ferrell is a genius. Watch #SNL this weekend with @ChrisStapleton. https://t.co/DYXEy1dKqT Tonight: @chelseahandler, @desusandmero &amp; stand-up from Rob Haze (@robertistheMan)! Plus, it's #ThankYouNoteFriday!  #FallonTonight Peter &amp; His Heckler https://t.co/xN9D5OPtD9 #StreetlightsWithGabriel #FallonTonight #Migos crushed it last night!!! #Culture2 #FallonTonight https://t.co/96QU2exRsm C U L T U R E I I #MigosOnFallon #WillFerrellonFallon https://t.co/0KkKr5jdQX C U L T U R E I I #MigosOnFallon WillFerrellonFallon https://t.co/d1kVz4YWob Check out https://t.co/UpG8BSIwnJ. #FallonTonight #DontStopBelievin #Journey #WillFerrell Turn it up!! It’s on!! #DontStopBelievin #FallonTonight #WillFerrell #NBC Watch Will tonight. Things get weird. It was so fun- and congrats @Migos the new album is out in 15 minutes!!!! https://t.co/s2jGJ4sokn RT @Migos: C U L T U R E I I \n\nT O N I G H T \n\n@jimmyfallon https://t.co/dxaZrx9ZJB Tonight on the show: Will Ferrell, Kid Animal Expert Robert Irwin, and music from @Migos! Plus, your funniest #MisheardLyrics tweets! #FallonTonight Ice T shares some of his lesser-known voiceover work https://t.co/EDyNucRJho #FallonTonight Until last year, my dad thought that Van Halen was saying “Had enough!” in their song “Panama.” #MisheardLyrics It's Hashtags time! Tweet out a song lyric that you or a friend got wrong and tag it with #MisheardLyrics. Could be on our show! Fun show tonight! Ice T (@FINALLEVEL) is here, @Meghan_Trainor stops by, and @theavettbros perform! #FallonTonight .@AROD has Hitting Contest with 22-Month-Old Baseball Prodigy! https://t.co/xAkmnC0oBE #FallonTonight Tonight: @AROD, Taylor Kitsch, @clivedavis &amp; music from @BebeRexha ft. @FLAGALine! #FallonTonight Water War with Jason Momoa https://t.co/cfGceF0ds9 #FallonTonight Tonight Show is on right nowwwwwwww!!!! Turn on NBC! That’s a good idea. Any idea @handshigh55?? https://t.co/njwLRXLdSQ RT @jimmyfallon: Tonight: Greg Kinnear, Water War with Jason Momoa, and music from @TheWarOnDrugs! #FallonTonight RT @itsafallonthing: yeah i'm already obsessed with tonight's water war https://t.co/kItYpwH2l1 .@IAmEliasWWE should try WALKING WITH a guitar tuner. #littleflat #lottascarves #RAW25 No Sleep Till Brooklyn. On my way. https://t.co/KiI5CObVn1 Tonight: Greg Kinnear, Water War with Jason Momoa, and music from @TheWarOnDrugs! #FallonTonight Happy #ThankYouNoteFriday! Tonight on the show @Trevornoah is here, Dakota Fanning stops by, and stand-up from @JeffDye! #FallonTonight The first-ever tag-team Lip Sync Battle with @WWE's @TripleH, @StephMcMahon and The New Day (@XavierWoodsPhD, @TrueKofi &amp; @WWEBigE)! https://t.co/JIWc4tHqXh #FallonTonight RT @VirginRadio_KW: This version of #Havana is everything!! - @LRodRadio \n\n@Camila_Cabello @jimmyfallon @theroots https://t.co/JoR87PhyMO Ooh Na Na Na Na Na! https://t.co/4vjDc116QI Great show tonight: @jes_chastain, @ricky_martin, and music from @Franz_Ferdinand! Plus, your funniest #FitnessFail tweets! #FallonTonight .@Camila_Cabello, @theroots and I perform \"Havana\" with Classroom Instruments! https://t.co/mgwZyrOWBo #FallonTonight My dad bought a treadmill to get in shape. We came home once and there was a beer in the cup holder. #FitnessFail It's Hashtags time! Tweet out your funny or embarrassing story about working out or dieting and tag it with #FitnessFail. Could be on the show! Tonight on the show: @chrishemsworth is here, @Carrie_Rachel stops by, and @caitlynsmith performs! #FallonTonight #FireandFury #JamesTaylor https://t.co/3GqcDltubR RT @colesprouse: I’ll have the shroom room or I’ll have nothing. Tonight! with @jimmyfallon https://t.co/tFKU1VWhZZ He looks like he’s got this down! https://t.co/sQwgdivXZO Tonight: Password with @LilyTomlin, @Janefonda, and @colesprouse. Plus, music from @WALKTHEMOONband! #FallonTonight RT @Camila_Cabello: when u haven’t slept in a year but u remember ur album is out https://t.co/fQ0sHnrYSh Fun show tonight! James Spader is here, @Camila_Cabello stops by, and stand-up from @peteleetweets! Happy #ThankYouNoteFriday!  #FallonTonight RT @Camila_Cabello: dreams coming to life on @FallonTonight performing my new single Never Be The Same. somethin musta gone wrong in my bra… .@GalGadot &amp; @PattyJenks stop by Studio 6B for a round of Charades! https://t.co/lmlxhLKJaL #FallonTonight You always bring it. Thank you so much for putting 110% into every performance. And also for saying no to me as a backup dancer. Can’t wait for Friday! #CAMILA https://t.co/xJTGmpth3v Tonight: Sam Rockwell, @TigNotaro, and music from @IAmAlanWalker ft. @noahcyrus! Plus, your funniest #WorstFirstDate tweets! #FallonTonight The talented @Camila_Cabello performs her new single \"Never Be The Same\" https://t.co/Tg59PmKQ5v #CAMILA #FallonTonight RT @GerryCarlin: @jimmyfallon In college got invited to a girls house for a \"home cooked' meal . Recipe called for 2 cloves of garlic, she… RT @jordancohen2u: I was really into this guy but i was so nervous, well this is our first conversation:\nGuy: you smell good \nMe: thanks I… RT @lindachilders1: In college, a friend set me up on a blind date. I wasn’t in a great mood because I had received a traffic ticket a few… We’ve got something special in store for @Camila_Cabello’s TV debut\nof “Never Be The Same” tonight! You don't want to miss it!!\n#CamilaOnFallon I once tried to surprise my date by not telling her what restaurant we were going to. I accidentally picked the one she worked at. #WorstFirstDate It's Hashtags time! Tweet out your funny or embarrassing first date story and tag it with #WorstFirstDate. Could be on the show! Great show tonight: Saoirse Ronan and @RealChalamet are here! Plus, music from @Camila_Cabello! #FallonTonight Reminder: all of these songs are 100% real. https://t.co/3Bv1Uretko #DoNotPlay #FallonTonight Tonight on the show: Hugh Grant, Greta Gerwig, and performance by @ASAPferg! #FallonTonight I challenge @TherealTaraji, Michael Che, and @BlackThought to a round of Quiplash! https://t.co/d4U2BOMWDx #FallonTonight Excited to be back with new episodes of @FallonTonight! @TheRealTaraji is here, Michael Che stops by &amp; @SofiTukker performs! #FallonTonight Can’t wait for tonight @goldenglobes. @sethmeyers is going to crush! #GoldenGlobes RT @AlbertBrooks: “I’m going to miss 2017” said no sane person anywhere. Happy New Year!!! Here’s to the best year yet. #HAPPYNEWYEAR Ugh. My HQ not working. Uhhh.. Playing HQ. #happynewyear RT @FallonTonight: A look back at some of our favorite moments from 2017! https://t.co/imUvspvR2u #Fallon2017 Happy New Year!!! #FallonTonight #Fallon2017 #HappyNewYear https://t.co/jnEQacfvmd RT @SIRIUSXM: What's @JimmyFallon's favorite @TheBealtes moment?\nHear him guest DJ on #TheBeatlesChannel starting Fri at 5 pm ET! https://t… This is awesome. #Toys4PuertoRico https://t.co/IrHtQL98Gn RT @jpappone: You’re right @jimmyfallon, Giselle is amazing. #Bravo to you,@FallonTonight &amp; @jcpenney for recognizing her wonderful work. @… Nothing but love man. https://t.co/UZ1PD31rYg @FallonTonight @jcpenney This was a real moment. I will never forget. As long as I live. This human is amazing. Happy holidays you girls and guys! RT @FallonTonight: Jimmy surprises Giselle Burgess, the founder of Girl Scout Troop 6000 for homeless kids, with a $50,000 donation from @J… Honey, remember when the wedding photographer made us pose for a romantic sunset kiss? That was 10 years ago! Happy Anniversary! https://t.co/j1tmJpiru8 Huge congrats to @sesamestreet, @srwestin and @DavidWestin for the @macfound grant. Your team is amazing and this has to feel good! https://t.co/ZHw1Zxwi7A Tonight on the show: Jason Sudeikis, Amy Sedaris, and @robertkelly performs stand-up! #FallonTonight .@iamcardib won everything last night. You are welcome on our show whenever you’d like. One of my favorite interviews. Thank you. Rrrttt! https://t.co/9TrGsanDc0 So much fun interviewing the talented Cardi B. Thank you for stopping by, @iamcardib! Can't wait for your new single tomorrow! https://t.co/Fyiy97hMZd RT @THR: Watch: @RebelWilson &amp; @JimmyFallon sing holiday tunes with Google Translate https://t.co/2UxqLnELNX https://t.co/SsmNuECBHk Tonight on the show: Christoph Waltz, Beanie Feldstein, Cardi B, &amp; music from Erykah Badu! Plus, your funniest #MyDumbTradition tweets! #FallonTonight .@RebelWilson &amp; I sing holiday songs after the lyrics have been run through Google Translate https://t.co/i9tcPTmHnX #FallonTonight One year my friend’s daughter got the words wrong, so now their whole family sings “Deck The Halls” as “Deck The House.” #MyDumbTradition It's Hashtags time! Tweet out your weirdest or silliest holiday tradition and tag it with #MyDumbTradition. Could be on the show! Great show tonight! @RebelWilson is here, @PaulReiser stops by &amp; @gwenstefani performs! #FallonTonight Anna Kendrick, Darlene Love, The Roots &amp; I sing \"Christmas (Baby Please Come Home)\" with Classroom Instruments! https://t.co/0zjFVBMoJF #FallonTonight RT @RandyNewman: TONIGHT: Tune in to see Randy perform from his new album, #DarkMatter, on @FallonTonight w/@JimmyFallon &amp; @TheRoots at 11:… RT @PaulReiser: Talking #TheresJohnny- show about 1972 Tonight show on @jimmyfallon @FallonTonight tomorrow. But I’m tweeting today. About… Tonight: @AnnaKendrick47, @rhettandlink &amp; @RandyNewman is here to talk and perform! #FallonTonight Tonight: Benicio Del Toro, @RubyRose &amp; music from Michael McDonald! Plus, @BlackThought sits down to talk about his amazing 10-minute freestyle! #FallonTonight .@KevinHart4real makes a spectacular entrance with the Radio City @Rockettes! https://t.co/drcehb2CbD #FallonTonight https://t.co/QFt7MpyLtS Crowdsourcing: Discovered this antique Zippo Lighter that may have belonged to someone in the Vietnam War who served in Tay Ninh in 1967-68. Would like to return to its rightful owner! Please share to help get this back to Ben Middleton. https://t.co/vRcJs9197m Tonight on the show: @KevinHart4real is here, @HaileeSteinfeld stops by to talk and perform with @Alesso ft. @thisiswatt. Plus, your funniest #WorstGiftEver tweets! #FallonTonight Congrats to @jaboukie on his hilarious Tonight Show stand-up debut! https://t.co/tJrFA4Z6Jt #FallonTonight I don’t need to tell you but - you got it. Well done tonight. Thank you. https://t.co/TTC1ygfBcV One year my Secret Santa gave me a coupon for an Invisalign consultation. #WorstGiftEver Once I got a DVD of “Christmas Vacation” on December 26th. I couldn’t wait to watch it 364 days later. #WorstGiftEver It's Hashtags time! Tweet out the worst gift you or someone you know ever gave or received and tag it with #WorstGiftEver. Could be on the show! Thanks again to @CamilaMendes, @kj_apa @madelainepetsch, @lilireinhart, @colesprouse and everyone at @CW_Riverdale. Everyone is saying how young I look! (No one is saying that.)\nLove you guys! New episode tonight!https://t.co/hJ31K7zux2 #Riverdale Less than one hour until #MamaBookLive for the West Coast! Tune in to Instagram (https://t.co/c9JrSNDeIG) at 12:15pm ET//9:15am PT as I read \"Everything Is Mama\" live! Less than one hour until #MamaBookLive!! Join me on Instagram for a live reading of \"Everything Is Mama\" at 9:15am ET!! https://t.co/udPVUywN1s Follow me at https://t.co/MTDd5Y1eel to watch live! Tomorrow, I'll be reading \"Everything Is Mama\" LIVE on my Instagram at 9:15 am ET and again at 12:15 pm ET for the west coast kids! #MamaBookLive https://t.co/0pOfQLXsew RT @hansonmusic: This is our favorite cover of #Mmmbop ever!!! Who knew our song was a hit in a galaxy far far away. -ITZ  #nerfherder #sta… Thank you @WhoopiGoldberg, @JoyVBehar, @sarahaines and everyone at @TheView. So much fun!! Here at @TheView and they let use Barbara’s make up chair!!! Cool! https://t.co/wZuTGtfTzR On my way to @TheView!! Can’t wait!!! See you in 45 mins!! #TheView Tonight: Annette Bening, @JuddApatow &amp; music from @sza! Plus, from the makers of \"Riverdale,\" the premiere of the all-new teen drama \"Peanuts,\" featuring Charlie Brown &amp; the gang. #FallonTonight Star Wars characters re-edited to sing \"MMMBop\" https://t.co/0tsmwUpYIQ #FallonTonight RT @jimmyfallon: Tomorrow night is gonna be ‘nuts. #FallonTonight #Riverdale #CharlieBrown https://t.co/40AkDgvQKL Tomorrow night is gonna be ‘nuts. #FallonTonight #Riverdale #CharlieBrown https://t.co/40AkDgvQKL Tonight: @Zendaya, Billy Crudup, and music from @BigSean and @MetroBoomin #FallonTonight RT @MacKidsBooks: Enter for your chance to win a signed copy of #EverythingisMama by @JimmyFallon by RSVPing to his Facebook Live storytime… From the makers of \"Riverdale\" ... Coming this Tuesday, December 12th. Only on #FallonTonight https://t.co/IAv1mvcAWl If you’re in East Hampton tomorrow - come see me at @BookHamptons for Mama book signings and holiday funtimes! 12:30. https://t.co/tHOlD7Yd9Q https://t.co/XTgQsdAk6A This is how I got burned!! Well played Franco. Break a leg on SNL. https://t.co/72D2cuGfYq Come back whenever buds. We love you here at the Tonight Show. https://t.co/diCc70E0Po Happy #ThankYouNoteFriday! Tonight on the show @RealHughJackman is here and @LukeBryanOnline stops by for a talk and performance!  #FallonTonight James Franco does his impression of The Room's Tommy Wiseau https://t.co/oJVgssprJL #FallonTonight RT @MacKidsBooks: .@JimmyFallon just announced that he'll be hosting a live reading of #EverythingIsMama on both Facebook &amp; Instagram with… TV Guide!!! Love you guys. How’ve ya been? https://t.co/oJdeTRWGC7 Play it loud!!! Thank you. https://t.co/TGTEA5KSVF Great show tonight: James Franco is here and @NiallOfficial stops by to talk &amp; perform! #FallonTonight .@JohnCena and I perform a holiday themed edition of Mad Lib Theater https://t.co/vCc1uRULkM #FallonTonight RT @FallonTonight: .@BridgetEverett performs a karaoke version of @MileyCyrus ' \"The Climb\" https://t.co/xmh1unIzmg Tonight on the show: @JohnCena is here, @bridgeteverett stops by to talk, and @beck performs!! #FallonTonight Kate McKinnon showed us her hilarious Gal Gadot impression! https://t.co/BVEDBeS5tL #FallonTonight Tonight: Kate McKinnon, @pattonoswalt, &amp; music from @wizkhalifa ft. @tydollasign! #FallonTonight Congratulations to @JJWatt for being named Sport Illustrated's Sportsperson of the Year!! https://t.co/R1wxwUeb2k #FallonTonight If you are in the Hamptons this weekend... I will be at BookHampton (one of my favorite book stores) in East Hampton (next to Starbucks) at 12:30 (around lunch time) on Saturday for some signings of MAMA (or DADA). Bring the kids and say hi. https://t.co/Ca2IsfDEa8 Great show tonight! @KeeganMKey is here, Claire Foy stops by, and @st_vincent performs! Plus, Sports Illustrated's Sportsperson of the Year will be revealed on our show!  #FallonTonight RT @MusicChoice: The holidays rule when you're spending them with these artists! Don't miss @jimmyfallon @calumscott @PaulMcCartney and mor… RT @Miguel: @jimmyfallon @FallonTonight &amp; #SKYWALKER #WarxLeisure https://t.co/1NasNWLeHI Tonight on the show: @IAMQUEENLATIFAH, Freddie Highmore, music from @samsmithworld and it's #ThankYouNoteFriday! #FallonTonight RT @SeriousFunCamps: As if we needed another reason to eat ice cream today... #TBT to the launch of @jimmyfallon's new @benandjerrys flavor… Your funniest #DecorationDisaster tweets! https://t.co/0s88ssjFYQ #FallonTonight .#SongsOfExperience - the new album by @U2 is out NOW!! Get it before they’re on SNL. https://t.co/X6WWpk4mHo #U2onSNL Tonight on the show: @kumailn, @kporzee, &amp; music from @Miguel. Plus, your funniest #DecorationDisaster tweets! #FallonTonight Daisy Ridley asks @JohnBoyega to show off his \"breakout dance move\" from the @starwars wrap party! https://t.co/Sa9Oc7RK2a #FallonTonight RT @jimmyfallon: Tonight: @JohnBoyega is here and @kevin_nealon stops by! Plus, @generalelectric's #Fallonventions returns! #FallonTonight RT @MaybachMusic: .@TalibKweli took his talents to the stages of @JimmyFallon with @RickRoss &amp; #YummyBingham! https://t.co/GDU8nEQUyn… #Now… RT @hellogiggles: Watch @jimmyfallon and Daisy Ridley hilariously guess “Star Wars” phrases while wearing noise-canceling headphones https:… Have you seen the new RokShok ad? https://t.co/DpOc3Xf6dV #FallonTonight One year we used butter-flavored popcorn to make a garland for our tree. By Christmas morning our house smelled like a stale movie theater. #DecorationDisaster Let's play the hashtag game! Tweet out a funny, weird, or embarrassing story about decorating for the holidays and tag it with #DecorationDisaster. Could be on the show! Let’s do it! https://t.co/lhjHzoKiN4 RT @DIRECTVar: ¡El partido de sus vidas! 🗑️ @jimmyfallon &amp; @StephenCurry30 vs. Denzel Washington lanzando objetos extraños. ¿Quién vencerá?… Tonight: @JohnBoyega is here and @kevin_nealon stops by! Plus, @generalelectric's #Fallonventions returns! #FallonTonight Daisy Ridley &amp; I face off in a Whisper Challenge: Star Wars edition!! https://t.co/Ki0qNccz6G  #FallonTonight RT @ShowboxPresents: .@spoontheband performed last night on The Tonight Show Starring @jimmyfallon. Catch the performance here. Tickets sti… RT @THR: Watch: @JimmyFallon, Martin Short mock Trump in a \"Little Drummer Boy\" parody https://t.co/Rw23KIarxD https://t.co/0S9WP9utMt Great show tonight with Daisy Ridley, @JimBelushi &amp; music from @liamgallagher! #FallonTonight Gina Rodriguez shows off her boxing skills! https://t.co/Q9I4Rhlvet #FallonTonight Back with all-new shows this week! Tonight Martin Short is here, @HereIsGina stops by, and music from @spoontheband! #FallonTonight RT @ETCanada: WATCH: @FallonTonight hosts a comedian stand-up battle between @jimmyfallon and @JerrySeinfeld https://t.co/EHMZ0g9lqn https:… RT @accesshollywood: .@JimmyFallon &amp; @JerrySeinfeld face-off in a #StandUpBattle! #FallonTonight  https://t.co/a1Q52tJrGv https://t.co/W0WS… .@JerrySeinfeld and I go head-to-head in a Stand-Up Battle! https://t.co/FlswaD9JbR #FallonTonight That was so much fun!!! Thank you @theroots and @blackthought and of course Prince. We love you all and hope you have the best Thanksgiving. #MacysParade https://t.co/jvw1N5NTMJ https://t.co/zyhaqFbsey A great #Thanksgiving show tonight! @JerrySeinfeld stops by &amp; 13-year-old animal expert Robert Irwin is here with a few of his friends. Plus, a special Thanksgiving edition of Thank You Notes!! #FallonTonight Some of your funniest #ThanksgivingFails tweets to start the holiday! https://t.co/COD7lUZzI7 #FallonTonight On our way!!! Macy’s Thanksgiving Day Parade on @NBC! #MacysParade I love you @MarloThomas! Support @StJude and #GiveThanks #HappyThanksgiving https://t.co/QeoMX2XhUi Check out the show tonight and we’ll see you tomorrow at the #MacysParade. We’re gonna have fun.  See you arounnnnnd 10:30! #HappyThanksgiving https://t.co/iH92EXle9Z .@Maroon5 Sugar in the Subway. 🚇 Thank you @NYCTSubway! https://t.co/QjboMdvoGj #Maroon5 Tonight on the show: Denzel Washington, Allison Williams, and music from @TalibKweli featuring @RickRoss and Yummy Bingham! Plus, your funniest #ThanksgivingFails tweets!! #FallonTonight .@Maroon5 and I put on disguises and busk in a NYC subway station! https://t.co/QjboMdvoGj #FallonTonight RT @SonyPictures: Set your alarm clocks! Denzel Washington will be stopping by @FallonTonight tomorrow night! #RomanIsraelMovie ⏰ https://t… Thank you @adamlevine and @jamesbvalentine for the secret NYC subway jam! #FallonTonight Right now!!! #Maroon5 @CaillouPettis Sure."}