{"tweets": "Dolittle: doctor, adventurer, referee? @NFLonFox @RamsNFL @AtlantaFalcons #DolittleMovie https://t.co/fskt4cN69r I've been talking to animals for years now...And they finally started talking back. Does this mean I was getting the silent treatment?\nWatch the trailer for #DolittleMovie in theaters January 2020 and ❤ this Tweet to get updates from @DolittleMovie every month until opening day. https://t.co/yJN3tEhYHJ Here's to another one 'round the sun. Hope your birthday is as fire as you are @GwynethPaltrow https://t.co/ztyGZryNG0 And we're back on IG! #fbf #ageofultron https://t.co/ng1TB9m8Mw I'm sorry to say my Instagram has been compromised... Please steer clear for the time being until it's sorted. Thank you all. I love you 3000. RT @NASAJPL: The most ambitious crossover announcement in space?\n\n@NASAInSight just named \"@RollingStones Rock\" on Mars in honor of the ban… Sometimes the world does seriously cool stuff. https://t.co/DjPfBIZkuZ Tonight...🎸🚀🔭💥@RollingStones @NASA @NASAJPL https://t.co/O3RACFglnP RT @MarvelStudios: The wait is over to bring home the biggest movie of all-time! Get Marvel Studios' #AvengersEndgame on Digital &amp; Blu-ray… Dunk it for my country. #happy4th #happybirthdayamerica https://t.co/JJgodfkQRT suit up, show up, records gonna blow up !!! #EndGameRerelease today... https://t.co/2VrulGAfgr Wanna make history? The #GAME has yet to #END! Avengers rerelease... #AvengersEndgame #TeamStark special thanx @ogpepper on IG https://t.co/GmSsVgN9Us Get a new re-release on life and make #ENDGAME #1....\nc’mon, there’s “new stuff” and everything... https://t.co/92Vx74OnVh Happy birthday to America's ass. The world's a better place, and I owe you a kiss on the cheek! @ChrisEvans https://t.co/iCFRSu0DIH @TomHolland1996 from “Underoos” to overlord, it’s been a thrill to watch you rise, and we’re all pretty darned glad u were born https://t.co/VGDIMfP8uL Welcome aboard @JohnLithgow, we couldn’t be happier #PerryMason https://t.co/JlrFDmssLC Keepin' it classic. https://t.co/AHQzKpJYf1 Finally, the poster we've all needed. Oh and, #DontSpoilTheEndGame https://t.co/JrJBlh0XWK Is this a shot of @TomHolland1996 trying to keep himself from spilling the Endgame beans? https://t.co/6JahPDXHNw Today's the day we've been waiting for... It's been the ride of a lifetime. #EndGame https://t.co/mJBt7e0BRp Cap knows best... Keep those spoilers to yourself... https://t.co/VoRhQ3K5iN Did someone say... Tomorrow? #Endgame https://t.co/RQrNKj5Hyv Couldn't have said it better myself. https://t.co/iymXBSQ4WI Hello “Honey Bunnies...” Wishing you all the best, on this beautiful Sunday... https://t.co/ww3wI4dQZ2 And also maybe not tomorrow... @ChrisEvans https://t.co/WWrnCePLu1 This is what happens when they aren't designed by Stark, @ChrisEvans https://t.co/G69KepXDfH The votes are in... \"none of them\" wore it best, apparently. @ChrisEvans @MarkRuffalo https://t.co/019WgaH81I Here's a bit of a birthday gift from me to you all... https://t.co/MHukldh6Mi “It’s not about how much we lost, it’s about how much we have left.” Tickets are now available for Marvel Studios’ #AvengersEndgame, in theaters April 26: https://t.co/bmjcKw1pal https://t.co/WUBulzRQDC Who knew @TomHolland1996 would be my ride around town? https://t.co/ZZ2sAysuWg 1 Month. #AvengersEndgame https://t.co/nbJVvwaTi4 Ok this time it's real—Who wore it best, @ChrisEvans @MarkRuffalo? https://t.co/EyrKGKVfem Whatever it takes. Watch the brand-new trailer for #AvengersEndgame, in theaters April 26. https://t.co/Irsq173RP2 BFFs let you share their umbrellas, right @ChrisEvans ? https://t.co/1nJoJrFkZr RT @MarvelStudios: Some are built. Some are made. Some are born. On March 8, witness the rise of a hero. \n\nGet tickets to Marvel Studios’ #… Happy Valentine's Day to the one who puts up with all my antics... https://t.co/l1BzJb7zir Proud to be an #Avenger. Congrats all! https://t.co/1nqFgQR13j Important News! #ChefsForFeds is expanding across the nation 🇺🇸 to serve those impacted by the shutdown. Join us and together we will feed Americans in need for as long as this crisis continues! https://t.co/OjIbZ5h5eh https://t.co/YUfcEtZ1eW A natural addition @ChrisEvans https://t.co/zKAgyd9NNu \"Now it seems to me the place to start is at the beginning.\"\n Perry Mason\n“And it seems to me the beginning of any great project is casting my new best friend Matthew Rhys.”\nRobert Downey Jr.\nExecutive Producer https://t.co/jZl6Mm0GGx @ChrisEvans hey @MarkRuffalo looks like Cap needs a little tutoring from the science bros. I'm up for the challenge. Happy New Year, everyone! https://t.co/iZQpiDilRH To my favorite dance partner... Happy birthday. https://t.co/OqvzMA16dp Merry Christmas from the man in the big red suit! https://t.co/fWQCs4p4jR ✨ https://t.co/5q3LK9YK3I Thanks for the holiday cheer @MarkRuffalo ! Let's keep this rolling. Go grab a coffee on me, and if you feel like you wanna #PayItForward, add to my card or start your own! https://t.co/hcDwJmIEtI Always good to know @NASA has your back. https://t.co/0Vuj4oErrE Happy Thanksgiving all! Hoping your turkeys are slobber-free. https://t.co/g1JS9eAaHG And so the Christmas list grows... https://t.co/m9O3pxJmns special bday wishes to my fearless leader, and superbuddy https://t.co/W81LhF4bqR @ChrisEvans your breakfast is ready. https://t.co/yL77FSyfv3 Yes. I can confirm this is Tony's reaction anytime he hears his name. https://t.co/4VHWnm5Zdv At this rate, I can't wait to see what the holiday decorations look like. https://t.co/2Hk0fUHpvL Are they still infinity stones if they get thrown out the day after Halloween? https://t.co/T6xo9nR9Ii Turns out you can still make Renaissance masterpieces. https://t.co/QQw6wpi77C Another one for that Christmas list... https://t.co/jVlzYDmTkp The real suits don't hold a candle to these. https://t.co/3iVwWBD1vh Showin’ me the ropes since 2007, so glad u were born, brother J.. @Jon_Favreau https://t.co/SLlM4GyJeG Pro tip: Get a partner who jumps on board with all the weird stuff you do. https://t.co/AGW3CWlpWQ We all know who the real sheriff in town is @ChrisEvans https://t.co/MiIjOv8kfy Let's go! @Americares is still helping those affected by #HurricaneFlorence and we can too. For every $10 donated, they provide $100 in aid. Happy birthday to the one who deserves far more than 12% of the credit @GwynethPaltrow https://t.co/ihIrYbXzm0 All the way down to the eye color. https://t.co/bUdp70z7bq Practicing my Sherlock face. https://t.co/Vs7kGF70Re One word: accurate. https://t.co/j0p22Mp0rX Pro tip: Marry a marvel fan. https://t.co/l2jtvwt0c1 Brace yourselves, @Avengers #InfinityWar hits the interwebs today https://t.co/qvBQ3W8jvc Hail, Hail, Rock &amp; Roll, (and Ralph and Indio). New @The_Dose_Band ‘Thrill of It’ video is premiering on @AltPress -  https://t.co/t4s7gFyDNa.\nSee them at @theHiHatLA tonight!! 9p doors open at 8p / 21 and over https://t.co/w0geG2yNRp Thanx @NoKidHungry for keeping my El Monte Cali superheroes #poweredbybreakfast! https://t.co/wlM0oZkg5j RT @DanielPCarter: Are you obsessed with nineties grunge too?! Cool, we can all appreciate this together then: \nhttps://t.co/NAskpu7X1q\n@th… RT @TeenTitansMovie: Stayin’ cool in the Hamptons with @arnettwill aka SLAAAADE and the one and only @RobertDowneyJr! #TeenTitansGOMovie ht… Happy Birthday America! Wishing you all safe shenanigans and quality time with family and friends... #Happy4th #USA #TeamStark https://t.co/3Utr6Eoy03 RT @loneblockbuster: RT if you are Hollywood superstar Robert Downey Jr. I think these fellas are going places...‘Vervain’ music video from @the_dose_band. Premiering now on Guitar World:\nhttps://t.co/QMctbR6Sn7 https://t.co/aZ1eq7OgSH More Than A Suit. 10 years @MarvelStudios :) https://t.co/A8gaUE2Es5 My new favorite band. Latest release: https://t.co/Y9Mekq8BOj RT @Loudwire: Check out this cut from the up-and-coming duo https://t.co/D08RsGm2Mr Ya wanna be Groot? Bid to own Vin Diesel's jacket signed by me @VinDiesel @PrattPrattPratt @twhiddleston @DaveBautista @PomKlementieff @ChadwickBoseman @AnthonyMackie and #laurencefishburne. Proceeds go directly to @ROHHAD_global. Bid now @charitybuzz - https://t.co/0qrfKjeHbW https://t.co/Ki076H9eUg @ChrisEvans,,,now we are one... All our love...@Renner4Real @eastsideinktattoo @chrishemsworth @joshualord\n🎥 credit #jimmyrich https://t.co/AvJhTA8xos Last intro at my UK hideaway... @avengers at #LaylowGolborne https://t.co/uQ0ovV0J9n Many thanx for all your support! You can still donate directly to @rohhad_global and #brianortegafoundation. I look fwd to meeting winners in #Hollywood at @marvelstudios @avengers #INFINITYWAR #WORLDPREMIERE 🎥 @jimmy_rich @mo_freek #worldtour2018 continues #TeamStark #THANKYOU! https://t.co/1whC0iIUxR Run, don’t walk! Donate $10 for a chance to witness a once in a lifetime theatrical event. @marvelstudios @avengers is happening and you can’t stop it! Click, give and win! Go to https://t.co/ywpvrsvUm3. 🎥#jimmyrich @kevinfordmedia @ROHHAD_global  #brianortegafoundation https://t.co/0DcmXFbGXR Here I am again as Antonio w/ 2 more tickets to paradise. I'm offering you guys a chance to join me @Avengers #InfinityWar Premiere! Enter at https://t.co/ywpvrsvUm3. Funds benefit @Rohhad_Global &amp; #brianortegafoundation #gomadjumpforrohhad #jaquesbrel🎥 #jimmyrich@kevinfordmedia https://t.co/sOjj9MfKvK Today’s birthday treat is a triple threat. My wishes are as follows: 1st to support @ROHHAD_GLOBAL (go to https://t.co/ywpvrsvUm3 to donate). 2ndly watch me eat my car cake and 3rdly lay your eyes on the new #InfinityWar character posters! https://t.co/01pSxX09LT I trust you all can keep a secret...no spoilers please :) #ThanosDemandsYourSilence https://t.co/hWmoZMyioW When Easter and April Fool's Day fall on the same day... https://t.co/AHoabvooRV I may play Iron Man, but Aaron is the true hero. Go to https://t.co/ywpvrsejuv to see the full story. Donate to @ROHHAD_Global and help Aaron and his friends fight on. Every $10 is a chance to join me at #AvengersInfinityWar premiere.#randomactfunding #findacure 🎥@kevinfordmedia https://t.co/H7rqVIRX72 The “Muddy Puddle” challenge is live! Film yourself jumping in the biggest, muddiest puddle possible (fun &amp; safe) for 33 secs. Challenge 3 people to do the same. Post and tag #GOMADJUMPFORROHHAD. No puddle no problem! Same rules minus the puddle. Donate at https://t.co/ywpvrsvUm3 https://t.co/dioXyBVEpw I am most pleased to announce the stellar voice cast joining me on #TheVoyageofDoctorDolittle. #EmmaThompson @ItsRamiMalek @octaviaspencer #RalphFiennes @kumailn @selenagomez @MrCraigRobinson @carmenejogo @TomHolland1996 #MarionCotillard @RealFDLT @JohnCena https://t.co/GmfjOCqv7w Selfie game on point! Aaron and I are devising ways we can #gomadforrohhad...Donate just $10 bux (https://t.co/ywpvrsvUm3) to win a trip to #hollywood for the #avengersinfinitywar world premiere. Proceeds benefit @Rohhad_Global and #brianortegafoundation. See you there! https://t.co/wouSDCwWHG Winners required...Be a helper, a donor, and a joiner...Go to https://t.co/ywpvrsejuv\n@ROHHAD_Global #avengersinfinitywar #🌎premieretix \n(Photo Cred: Jimmy Rich) https://t.co/MmUWPh81yJ Embracing green this St. Paddy’s Day. #happystpaddysday https://t.co/wSxdunqnlD Howz about you and I meet up at the 🌎 premiere of @Avengers #InfinityWar? Donate $10 towards @ROHHAD_Global and I'll see you there. Go to https://t.co/ywpvrsvUm3 https://t.co/V3Ni2v88It And there you have it...@Avengers #InfinityWar https://t.co/HBFPXLOdcW It’s about to drop…so close! #InfinityWar https://t.co/VjRSw2pHYV RT @IMAX: 10 years in the making. #Avengers: #InfinityWar marks the first Hollywood film to be shot entirely with IMAX cameras. Assemble in… You red carpet ready? I am...Join me in Hollywood, CA on April 23rd for the World Premiere of @MarvelStudios #Avengers #InfinityWar. Donate $10 to support the fabulous @ROHHAD_GLOBAL and win (2) VIP tix. Go to https://t.co/AHxJsUW3t7 https://t.co/5xX6kKNAKq @MarvelStudios @ChrisEvans @chadwickboseman @DanaiGurira @MarkRuffalo @DonCheadle @AnthonyMackie You guys wanted it. You got it. See you there April 27th. https://t.co/DsllNH2ko6 @MarvelStudios @ChrisEvans @chadwickboseman @DanaiGurira @MarkRuffalo @DonCheadle @AnthonyMackie The entire world? @MarvelStudios Great. With friends? @MarvelStudios Any chance I could see it earlier? How about these cool #InfinityWar toys? Next stop: children's hospitals for Marvel's #HeroActs Initiative!\n\n(📸: Jimmy Rich) https://t.co/RYwiVKJuKk Happy Valentine’s Day to all the shippers out there! ❤️😉 https://t.co/VAVwRLDumo ❤️ my #Marvel fam. Here's to another 10 years... https://t.co/WaUoz0psgm 3rd quarter, 3rd installment—epic symmetry! #InfinityWar https://t.co/hhtmuGnjTc #IronMan suited and booted! #InfinityWar https://t.co/WMUEu5i16H RT @THR: Stan Lee \"doing well\" after checking into hospital https://t.co/TaYQgZWgfw https://t.co/agDIyf6ItW For a dose of do-goodery, check out this vid of a playground RAF built with a great non-profit called Kaboom! #PLAYceforKids @kaboom https://t.co/9wYX4ZkvHa A lot has happened over two decades! I respect how Mr. Grant has matured as an artist &amp; voice against violations of privacy. Let’s break bread together soon @HackedOffHugh! #burythehatchet2018 Happy New Year, everyone! Just a little reminder of what we have to look forward to... https://t.co/0Q77Rk6gXB Merry Christmas, everyone! (Who put that mistletoe there??)\n\n(Cred: coppersand of Tumblr) https://t.co/3FMcDC1cRx LAST CHANCE to snag this shirt &amp; support CRI-help through RAF! 🕒🕒🕒! Celebrate the season of giving &amp; get yours: https://t.co/69HBts3q5B https://t.co/PX1EdAdpAS RT @DylanCon: Now on #iTunes my New Single #ManOfPeace, official song from @samkproduction film LITTLE GANDHI @LGandhiFilm (Syria‘s 1st Off… RT @Avengers: Thank you to the best fans in the universe for making Marvel Studios' \"Avengers: #InfinityWar\" the most viewed trailer of all… Not a drill! #InfinityWar https://t.co/jahF5UTspU I’m celebrating Giving Tuesday. Are you? Get your RAF tee today and support the great work of CRI-Help! GO: https://t.co/tawvDZ1LMU https://t.co/3XUZB5jzdl RT @Avengers: Check out these brand new #InfinityWar covers from @VanityFair! More info: https://t.co/yxHjj4Zah7 https://t.co/DOfKCwpumQ Happy Thanksgiving, all! May your day be filled with family, friends, food, and googly eyes. https://t.co/QQkxnS6yeR Our #VeteransDay celebration (with Funk Cake). Thank you for your service. (📸credit @jamesrichll) https://t.co/WDekXyRQSu Really makes my eyes pop. #HappyHalloween https://t.co/PuZMBafpsU Like my shirt? Then pursue your wardrobe dreams while supporting CRI-Help through Random Act Funding! Get it here: https://t.co/0ftxqnpXha https://t.co/rHdQkdkPuN Who wore it best? Impossible to tell. You can twin (triplet?) w/ me &amp; drop some love when you get my new RAF shirt! https://t.co/cCvan1DxoU https://t.co/ubBPS1raJC Happy Labor Day, everyone! Hoping all you laborers out there get to take 5 (or a baker's dozen) today. https://t.co/HC2ZxiGk0M It’s Just Because Day, so I'm launching my new Random Act Funding shirt for you!! New logo, same heart. Get yours: https://t.co/oM0y51oIgs https://t.co/iHMQPU6N5t RT @Jon_Favreau: Infinity Trinity #infinitywar https://t.co/UgacQzUlKp https://t.co/ifVWUwJxfZ RT @MarkRuffalo: #ScienceBrosBeforeSeaLions @RobertDowneyJr https://t.co/8vKQrhEiD1 RT @MarkRuffalo: @planetcameron  https://t.co/u4ItYurr5I THANK YOU to all who donated to our Omaze campaign this year! We raised $1,127,115 for RAF and we couldn't have done it without YOU! https://t.co/o5w45961dH Guess what I'll be watching in theaters this weekend...\n\nGet your tix here! https://t.co/UlxPJjRgr3 https://t.co/oXQnfF5tyg Happy birthday, America! Wishing you all fair weather, safe shenanigans, and quality time with friends and family. #Happy4th #USA https://t.co/y9vHo2LoCl Always answer your phone when I call, @TomHolland1996 ... #SpiderManHomecoming https://t.co/AOOSeSbh8z LAST CHANCE to be set buddies! Use code TONYLOVESYOU for 100 free entries to entertain me on the Avengers set! https://t.co/TUocekBzuX https://t.co/DomXBqu07r We’re close to raising $1 million for charity! Let’s make the final push TOGETHER. DO-GOODERS ASSEMBLE! https://t.co/VmdGkmYbRS https://t.co/Xc3PBaLzZK Forks, tongs, cans + bottles + a Wong... Help us #healthenet #afeastoffriends #AvengersInfinityWar #beardbros #sciencebros #benedictsquared https://t.co/kjvCmC5Mk8 Do YOU want an authentic Iron Man helmet &amp; signed placard from me? 24 hours to ENTER: https://t.co/xgyhXBqj4J https://t.co/L0M80ZdKzB LAST CHANCE to double down! One winner joins me at the #SpiderManHomecoming premiere, one at the Avengers set! GO: https://t.co/mM56PNyfhu https://t.co/y1kdgaw2nf As mentors go, Peter could have done worse---by picking anyone but ME! #SpiderManHomecoming https://t.co/j7fPWsym2l https://t.co/2tGUIzic9V Dry clean your friendly neighborhood red carpet look, cuz I'm taking YOU to the #SpiderManHomecoming premiere! GO: https://t.co/bpzJejItoO https://t.co/MDtFqgh5jV I'm known for throwing the party to beat. Take a look… https://t.co/kpZrJRIY4v #SpiderManHomecoming #NBAFinals https://t.co/Py0rlxOjan Taking it all in courtside… #NBAFinals 🕷 #SpiderManHomecoming\nhttps://t.co/XHwnrE9whu https://t.co/Inp5t1JSDZ How would YOU celebrate winning a set visit to the next Avengers? (Dancing highly encouraged.) GET YOUR CHANCE HERE: https://t.co/gbxuJHiSxF https://t.co/xV6SmIERSo RT @ESPNNBA: Before next month's #SpiderManHomecoming, Peter Parker has some important business to attend to ...\n \nTony Stark's NBA Finals… Wanna spar? Let's go hand to hand on the set of the latest Avengers! (Combat optional.) GO: https://t.co/nPqjJZ59rh https://t.co/waxGyvTsHe From your friendly neighborhood Iron Man… @SpiderManMovie #SpiderManHomecoming https://t.co/1Nb7JrFu5I Fair warning: hanging with me on the set of the latest Avengers could get strangely intimate… Sound appealing? GO: https://t.co/X2GViqbAWB https://t.co/ufncCev5o4 My alter-ego (I’m sure you’ve heard of him) requests your presence on the set of the latest Avengers film. ENTER: https://t.co/D90ucMQp4h https://t.co/Mx8XlkRhCS Do YOU want to hang with ME on the set of the latest Avengers? ENTER AND YOU SHALL (maybe) RECEIVE: https://t.co/cJ9vsghtk0 https://t.co/DOsc8RlFCB Raise your hand if you're ready for the bunny... #HappyEaster https://t.co/k6gVNQtnKM @chrishemsworth Thanx for the well wishes, favorite Chris... @ChrisEvans Many thanks for the kind returns. You're my favorite Chris... Thanx for the bday wishes everyone! https://t.co/2fBuCl7XJZ Step into my trailer... #SpiderManHomecoming https://t.co/BQ05FGrq0h The three of us will be looking for you at the parade. Happy St Paddy's Day! https://t.co/L3FtMr3KbC LMV❤AO (Laughing My Valentine’s A** Off). Happy Valentine’s day, everyone! Spend it with someone you can’t get enough of! https://t.co/NoB3qWxS6E UPDATE: FB live looking closer to 8! Time may vary, will keep you updated! https://t.co/0iYZP3W1uq Later, 2016. Everyone be safe and I'll see you on the other side! #HappyNewYear https://t.co/XGzURb8Orx Happy holidays, everyone! Hoping Hulk Santa brought you everything you wished for!\n\n(Credit: collab btwn @MarMai1 and @jamesrichll) https://t.co/P1X5b9JCIU Hanging with my Home(coming)ies. #SpiderManHomecoming https://t.co/RcaAwczc9p Stay tuned for the full trailer tomorrow! https://t.co/7CYPzoC0cG Be thankful for love, even when it includes disagreement. Happy Thanksgiving, everyone.\n\n(Credit: legal.fangirl of insta) https://t.co/iNobJWrsBt Gotta admire these next-level pumpkin carving skills. Happy Halloween everyone! https://t.co/oFYg8Asnkb Time to get STRANGE! https://t.co/3AQOk4KTKt IMPORTANT: REGISTER TO VOTE and you could see @MarkRuffalo NAKED! #CivicDutyCanBeFun @joss @SaveTheDayVote #SaveTheDay #SaveTheDayVote https://t.co/HxmimyK1em Special thx to MVP @URWERK_Geneve for this incredible watch. Keep an eye out for for these amazing timepieces! https://t.co/xFpGUX9eRn New project @Jon_Favreau and @RidingShotgunLA are working on!\n\n(Photo cred: @jimmy_rich, Glam cred: @DavyNewkirk) https://t.co/yUh0L2A34U Happy Labor Day! May everything you do be a labor of love. https://t.co/IleVySb0qS Had a blast kickin' it w/ Omaze winners Amelia &amp; Becca! Next time it could be you with me! https://t.co/NiAGpztj92 https://t.co/gY8YzhNceA Hope #AaronSorkin covers the #1 rule of walk-n-talks in his @MasterClass: watch your step! https://t.co/yfWK62HMvE https://t.co/DXexdJ9DFY RT @DrStrange: This fall, question reality. Watch the new trailer for #DoctorStrange, just released at #SDCC!\nhttps://t.co/wQuEqwDD05 LA people, spread the word! @the_dose_band is rocking out at Hotel Café tonight at 10pm! https://t.co/kqZCpQqAxo Get ready for a new generation of Marvel BAMF... https://t.co/nMChfQkh0n Happy Birthday to the good ol' U S of A!\n\n(Credit: BigDave29871 on DeviantArt) https://t.co/gylIO3CUNx Happy Birthday, RD Sr!! Tonight we're gonna party like it's 1969! https://t.co/FObvKosq4r 1 good deed = a lifetime of style. It’s your LAST CHANCE to snag this tee &amp; support RAF!! https://t.co/FcLq20uy3e https://t.co/gKrkcrjJ6e Be weird. Do good. Rep RAF. https://t.co/7v7u13wAXe https://t.co/uWgPH10RcF RT @common: Chicago! Join me south of Buckingham Fountain today at 5pm and let's #rethinkhighschool with @XQAmerica CHICAGO! Don’t miss what @Common &amp; @XQAmerica are up to south of Buckingham Fountain @ 5 today… #PlayingItForward #RethinkHighSchool RT @twhiddleston: My school photo! Proud to support @unicef &amp; @eu_echo work on education in crises. Share your photo #EmergencyLessons\nhttp… Sharing my best haircut to highlight the importance of education 4 kids in emergency situations! #EmergencyLessons https://t.co/rwa6r1VPQc I wanna turn you on to @the_dose_band’s new single #TruthLiesInside… Have a listen! https://t.co/bwk56AGd11 Even Cap got on board with RAF!! Kinda... Join in on the twinning. Get yours here: https://t.co/vlCu8evgLe https://t.co/XocW1XxsJi Happy Memorial Day! Eat, laugh, &amp; remember those who sacrificed their lives for you to be able to do those things. https://t.co/cj8rCciafD #FBF to getting weird w/the Omaze winner!! Keep the party going w/the OFFICIAL RAF TEE: https://t.co/PTAhDQ2ubl https://t.co/9woBauimQl Kicking off the 1st issue of @GQStyle! (To view inaugural cover, go to https://t.co/9KebesYRIm) https://t.co/4P0r6fAIa2 Sharing a pie with Omaze contest winner Amelia B. today! Thx again to everyone who donated—could be you next time! https://t.co/Iv4BO1Es1F WOWSA! Over $1.5M raised for RAF, thanx to YOU... I'm wildly grateful. Now to NYC to keep up my end of the bargain!! https://t.co/9cctOoEH2q Just over 4 hours left to donate. Don't let me and NYC pass you by! --&gt; https://t.co/khdybieFbL LAST DAY to come hang w/ me in NYC! Best night ever awaits, just 1 good deed away. ENTER: https://t.co/WdU69SYhgZ https://t.co/Z28Gn2PmBS 48hrs left! You + Me in NYC. I’ll bring the bunny suit if u do some good right now! ENTER: https://t.co/zNiwJcDHAr\nhttps://t.co/OsGpKdTLwa We’ve hit $1MM! Let’s keep pushing for good &amp; for your chance to meet me in NYC!  https://t.co/x9fOyi7BEF https://t.co/E9M80oa92B Got my 1st Facebook Live thing figured out. Going on now. Join me? https://t.co/wyP8jxbaoc Going live on my Facebook today, 9:45am PT! Be there. While you wait…join me in NYC? https://t.co/MCWiUplf9M https://t.co/92mvd8pQbM Thanks @EdwardSharpe for surprising the Mariachi Jaguares of Mendez High! #RethinkHighSchool #PlayingItForward\nhttps://t.co/aqWDzQ91GE RT @MarvelDE: Berlin Tasting Zemo-Style!\nDaniel Brühl serviert @RobertDowneyJr Gerichte der ganz besonderen Art.\nhttps://t.co/KOnHhCSkNI Be my new pizza party wingman in NYC! ENTER:  https://t.co/K151fVny1n https://t.co/vd5qaELuqW #BTS #civilwar #Paris #teamironman @marvel #teamtoast I mean #teamtoy I mean #teamcap #inyourface (cred @jimmy_rich)\nhttps://t.co/pviytgK1kN A playful little design, now in shirt form. Shall we wear them together in NYC? #Adorbs  https://t.co/K151fVny1n https://t.co/9xNPv6Rp3r #TeamIronMan https://t.co/QV3YgHKeCq Let’s you and me party like it’s 2016. Meet me in NYC? https://t.co/Z16jJXDlyQ\nhttps://t.co/d8Jej0x5tS Pack your party suit because U + ME = NYC! Care to join me? ENTER: https://t.co/3rXHX1PPhk https://t.co/daQWfsJ3np Date night on the BLVD... #CaptainAmericaPremiere https://t.co/0lPHucvw9a I’m ablaze with fundraising fury! You, me, the NYC. C’mon!! ENTER: https://t.co/5FT1iPhjS3\nhttps://t.co/lprWk6cZOr And we're back... Marvel's Angels at your service... 📷credit @jimmy_rich #vision #stark #rhodes #teamironman https://t.co/qiiyMs0Vba Get a DOUBLE DOSE of @the_dose_band w their single on @MTV &amp; new EP #TheDose on @AppleMusic! https://t.co/myaNCrVW6B https://t.co/hPPErFylNO Rocky Mountain High 5.1 (Birthday Jam)\nhttps://t.co/qoGKM3D2Ql Wink wink... #aprilfoolsday https://t.co/T8XiR1BWqz The Easter art you didn't know you needed. #HappyEaster (Find it here: https://t.co/jHlb24q4Oa) https://t.co/LM54vMHsOr .@twitter It is I who am indebted--all communication henceforth should be 140 characters (or less). HBD! RT @the_dose_band: Tune in to @MTVHits today at 5PM EST to see our video #ColdHands! Single now available at @AppleMusic: https://t.co/kxqh… Ralph &amp; Indio are my favorite new band. Check out @the_dose_band's new single #ColdHands: https://t.co/ztVbdQrz5O\nhttps://t.co/nEwAMHEigm RT @the_dose_band: Our new single “Cold Hands” is available TODAY! Listen to it on @AppleMusic: https://t.co/nzSWOvdIhs #TheDose https://t.… YOU SEE WHAT I DO FOR YOU? #Tumblr #BuzzFeed #TeamIronMan https://t.co/lTB8dsksxd RT @BuzzFeed: .@RobertDowneyJr at the end of #CaptainAmericaCivilWar https://t.co/8IMIIGBzTK Hyperchatting live w #ChadwickBoseman and #JoeRusso re: #CivilWar at https://t.co/XS79iI7sAB! #TeamIronMan assemble! https://t.co/rv13KQ2DQ9 .@VancityReynolds Et tu, D-pool? Gimme a shout when Rogers boots you out for \"cussing\"! Divided we fall... #TeamIronMan https://t.co/D7xFPSXr4Z Get your #CivilWar face on, @ChrisEvans! #TBT https://t.co/GdGQPkgIUy Happy Valentine's Day! \n\n(Credit: Sekra on Tumblr) https://t.co/UiqU8B90MP Sent a very special boy on a top secret mission today. Go get ‘em, Domenic! #IronBoyAU @MakeAWishAust @Jon_Favreau You mmamamamamamake me happy, Happy. RT @Iron_Man: You chose the wrong side, @CaptainAmerica. See the official #CaptainAmericaCivilWar Big Game spot.\nhttps://t.co/HgWcdfe6MV Join #TeamIronMan! We have snacks! You've got a friend in.....oh, wait. #CivilWar https://t.co/9Z5SJ9BOvM When @ChrisEvans abuses the group text... https://t.co/tOy6Vq07EK The moment I discovered it was styrofoam... https://t.co/GfHgM6dZ6I Who wore it best? https://t.co/IAxNR28alr Just one more day 'til the year of #CivilWar. Stay safe and see you on the other side! https://t.co/1hfu5hi4Dv The battle begins! Merry Christmas, all! https://t.co/7SgKLfPHdB You're only on the naughty list if you get caught... #HappyAlmostChristmas https://t.co/xIpztJOvOg RT @the_dose_band: Introducing...The Dose! Video--&gt; https://t.co/qTw4AK0pxN Soundcloud EP--&gt;https://t.co/UdpHlmygnf the_dose_band #bts #thedose #takethedose #indiodowney #ralphalexander @ Mulholland Scenic Overlook https://t.co/C8Abon7Sa8 I call this: Last Supper Before Civil War. Happy Thanksgiving to you and yours!\n(Photo credit: @MgfCustoms) https://t.co/QOZ9p3Powh There's at least two sides to every war story...here's mine. #CivilWar @Marvel https://t.co/W3R5tydXIM Look who I found... And yes, we are expecting... @ChrisEvans @jimmykimmel https://t.co/im7JGysk4u When you accidentally scroll back on a fan's camera... https://t.co/loJLDq6Pol It takes a confident woman to partner up with a big headed fella...Susan Downey, I'm grateful you were born. #HBDSD https://t.co/0Jn3ygH1gE Happy Halloween, everyone! Don't forget to strut your stuff.\n(Credit: Spazzcase) #HappyHalloween https://t.co/SIxU7mrrAF Had the honor of being one of a number inducted into the CA Hall of Fame yesterday by Gov Brown. #CAProud https://t.co/YHMlSwSRMh Don't tease me, @ChrisEvans. http://t.co/ewYz6vb0aH I'd watch the feature length version of this. https://t.co/vIVNsH3xlw Not sure how it came to this. http://t.co/jScboxqPkn Hope you're all having a restful weekend...I'll stay online in the workshop (as machining is my passion). #LaborDay http://t.co/UiDUigYUFZ A perfect 10. Happy Anniversary, Mrs. Downey. http://t.co/8LpFa61rP7 How I feel when I get out of the shower. (Click to see more) http://t.co/dBGr9aCqtN Hopefully Pepper won't get jealous of salt... http://t.co/OIZQso7CwB I dub this day #FerrariFriday. http://t.co/Zj9EDufiUm California dreamin' on such a (summers) day! Big thanx to my friends @Ferrari for the drop-top loaner...\nhttps://t.co/SQ9ctw5dmw Why, Internet? I thought we were friends! http://t.co/112OW5aTsd Thanx for the grub. Those scrapes were actually from me fighting to get to the front of the line! https://t.co/yMzOksp71q Different strokes... @MarkRuffalo http://t.co/4JU9hTCUrZ This might get out of hand, @prattprattpratt... http://t.co/ZsFCGOdFC7 Atlanta----knows how to party....\nHappy 4th,,,freedom from tyranny, etc. @ Atl, Ga https://t.co/uQGBxqQwYL Happy birthday, America! Now let’s blow the roof off this joint. (Disclaimer: please practice safe fireworking.) http://t.co/FBiCMLP51A I love the smell of nylon in the morning. #tbt #weirdestphotoshootever #namethatreference http://t.co/9k3pd0Z7OZ Remember to hug your dad today, everyone—they’re probably the reason you’re so wonderfully weird. Happy Father’s Day. http://t.co/l6bqeiZ8Ab They warned @galifianakisz that the dog might bite... #tbt http://t.co/iUnteFYdib Inimitable. http://t.co/uHCn81a2nu Cutting a sexy, sexy rug. http://t.co/knRVC8UjYj We work weekends ..for your viewing pleasure... #marvel #civilwar #pickyourside @ Cliftondale, Georgia https://t.co/ZKFNkeFidV I give the people what they want. http://t.co/wdceDdnLvg and @mxtchgrxssi_ for winning a @bowandarrow78 shirt! Check your msgs for further instructions! Congrats @jazzywalton99 @exs0dia @SyndieCollin @BuntingGregg @simps_s @_yandyL @nathaly_1999 @ayyitsjena @LorcaGonzalez (cont'd) Got @bowandarrow78 ladies shirts to give away! Tweet at me w #BnAGiveaway to enter! (Duplicate entries not accepted.) http://t.co/5GJ5bOMiLO I'm mastering the remote controlled selfie/video ! All the best to the 2015 graduating class of Pace… https://t.co/S9nMJIwwBS Missing from Dustin Hoffman’s @MasterClass: Who Wore It Better? (Enroll here —&gt; http://t.co/gnnjdHxJwi) http://t.co/Qf6973CEYo Evil adds 10 years... http://t.co/APnhrUwnet We’re great at smashing things—just ask the Hulk. Show of hands: who’s seen it? http://t.co/RAEcU9QXui Can’t get enough of these charities. Click here to bid on a trip to meet me on the set of Cap 3--&gt; https://t.co/bHABTFBSu3 and @Mr06AntG @killdeshaan @idreesofficial @CooterTV @mattnico &amp; @ayeharmony for winning a Bruce Lee shirt! Check ur msgs for instructions. Congrats to @mullingarwifi @Eraziel007 @DowneyloverJr @bewyn @hehehiddles @philitup12 @edfgherf @Jamesfan2 @gloomandbloom (continued...) Note: duplicate tweets/entries from multiple accts not accepted Opening Weekend Giveaway! Bruce Lee shirt from A2 courtesy of Bow &amp; Arrow 78. Reply 2 enter, winners chosen @ random. http://t.co/hRGmUxdQ8b Too smoking for this room. Better leave. http://t.co/pYiDkKpNIN Happy trails to you, until we meet again ... Thanx for a great tour ... #avengers #ageofultron… https://t.co/KledqydJCV I've always looked up to you Howard,,,,, thanx sternshow ... #avengers #ageofultron #presstour… https://t.co/K5aygttkqC And so it begins ... sternshow #avengers #ageofultron #presstour #marvel #earlybird @ 1221 Avenue of… https://t.co/fTIE8KD4rg Continuing my epic staredown with @jimmyfallon. Watch tonight for me, Jimmy, and @zacbrownband... http://t.co/RZOzF3rpQd Additional contouring required ! @davynewkirk #mensgrooming #avengers #ageofultron @jimmyfallon… https://t.co/gG5mWA3xrF Hanging around backstage @jimmyfallon @fallontonight nbc #fallontonight #avengers #ageofultron… https://t.co/p0UILRvjxp Throw back to this morning ,,, How could I have forgot to post this ??? Brother renner4real and… https://t.co/WwIM10Sbfz Just incase you were wondering what you're watching tonight 1135pm on @jimmyfallon @fallontonight… https://t.co/UYoHPwB6Jc Just like we promised ... #NYC #NYSE #avengers #ageofultron #presstour #marvel #earlybirds… https://t.co/5RRlEoEz1I From  the belly of the White House of money ... Brother renner4real and myself are coming to ring… https://t.co/TGlzSQcUCS @marvel dipping the pen in company ink so to speak... Happy Friday everyone ! #avengers #ageofultron… https://t.co/xEWLt2YxWu #earlybirds #kellyandmichael @kellyandmichael #avengers #ageofultron #presstour #marvel @ Live With… https://t.co/geR15m8teY A corrective experience with legitimate journalism @kellyandmichael #dianesawyer #kellyandmichael… https://t.co/9CViIKdJdE #GMA #earlybirds markruffalo renner4real #captainamerica #avengers #ageofultron #presstour #marvel… https://t.co/h3rWttCGAV Good morning America ! #avengers #ageofultron #presstour #marvel #GMA @ Times Square Studios https://t.co/LxcSg7mZwW The future of film is now ... High school aged filmmakers ... #avengers #ageofultron #presstour… https://t.co/YMyYZ1eCpV The man behind the curtain ... @lateshow #avengers #ageofultron #presstour #marvel @ Ed Sulivan Theatre https://t.co/nsZLdy2IcT @trips034me I'd say that's gonna leave a mark but it already did! Ice is our friend @ this point. Nice to meet u, in a soc media sorta way.. @trips034me Aidan, what's up? Tell me everything. Asgardian micro-journalism at its finest. #AgeOfUltron #PressTour @chrishemsworth\nhttps://t.co/f5nZK1u2Nt RT @Marvel: IT'S A TAKEOVER! We interrupt our programming for an announcement from @robertdowneyjr: https://t.co/9eWFRGhLLs\nhttps://t.co/WM… RT @MarvelUK: \"Oh, hey look, it's me signing autographs at the London #AvengersAgeOfUltron premiere. Love ya fans.\" @RobertDowneyJr http://… RT @MarvelUK: \"What is this, Dreamboat TV?\" @robertdowneyjr http://t.co/Kkp45qXmcl #AvengersAgeOfUltron http://t.co/gULoFDOjoU RT @MarvelUK: \"...and still getting weird...\" @robertdowneyjr #AvengersAgeOfUltron http://t.co/Kkp45qXmcl http://t.co/lW5fuhgteX RT @MarvelUK: \"It's getting real weird over here, people.\" @robertdowneyjr #AvengersAgeOfUltron https://t.co/gMOSOc5bcS http://t.co/dJ81vbF… .@MarkRuffalo @Ashleyeverett21 What a handle...loved those fans in Beijing giving us nicknames Chubby (you)..Carrot (me) and what was Joss? Our heroes journey through China, finding glory (&amp; Luke Kang's adorable kids) along the way. #AgeOfUltron #PressTour http://t.co/VdjWO3PfnK Beijing dream team, pressin' the flesh... #PressTour #AgeOfUltron http://t.co/DuT2vgy8lM Checking out China. I miss my little chair. #Callback #AgeOfUltron #PressTour http://t.co/Kh39evytkr If you ever have the chance to be an Avenger in Seoul, I highly recommend it. #SoLongSeoul #AgeOfUltron #PressTour http://t.co/JAEeOKJtAU MOJO-tastic on stage chemistry! I'll keep u posted. #AgeOfUltron #PressTour #HeartAndSeoul http://t.co/3VIVxE9E0j Come get me, Instagram... https://t.co/Ph0FQZBUOs Stay tuned... Many Avengers assembled here at @MTV to bestow the Generation Award upon me. Many thanx for the good clean fun! http://t.co/tBjUNd3VK1 Actorius Badassicus, in his natural habitat... #AgeOfUltron #PressTour #Avengerpalooza\nhttps://t.co/NoWMUAhUSG We want YOU for Team Avengers. #AgeOfUltron #PressTour #Avengerpalooza http://t.co/HFg19j5rvl First Ultron sighting yesterday. #AgeOfUltron #PressTour #Avengerpalooza http://t.co/OuQwxWIFQ9 Aaaaaassssssssseeeeemmmmmbbbbllllleeeeeeeee! #AgeOfUltron #PressTour\nhttps://t.co/tCFVwSd3BD Aw, come on! https://t.co/ceobREetqJ Last one for today. Keep an eye out tmw for more from Avengerpalooza. #AgeOfUltron #PressTour http://t.co/lE651jv6HC Bang. #AgeOfUltron #PressTour http://t.co/XJTvY8K8dY I mastered the kick worm years ago... #electricboogaloo @Renner4Real @chrishemsworth @ChrisEvans Dammit. @ChrisEvans @chrishemsworth @Renner4Real #AgeOfUltron #PressTour http://t.co/VmKI0zQERj Throwing it away...more later! @chrishemsworth @ChrisEvans @MarkRuffalo http://t.co/zFnpd6L7mU @chrishemsworth @ChrisEvans Let's ask the Twitterverse! Hope they don't seat me next to @ChrisEvans at the A2 press conference, as CAP and I aren't getting along... @chrishemsworth @Renner4Real I am the OPPORTUNIST! #AgeOfUltron #PressTour @Renner4Real @CobieSmulders http://t.co/z8WIq2TFcc Civil War? #AgeofUltron #PressTour @chrishemsworth @ChrisEvans http://t.co/n6SwkHELor A whole lotta sexy... @chrishemsworth @ChrisEvans #AgeofUltron #PressTour http://t.co/PH1K2XYt9f Upping my selfie game today. Get ready. #AgeOfUltron #PressTour http://t.co/2yazTgQpw9 #Enlightened and a little less gassy, I must say! @Renner4Real @Paul_Bettany @ChrisEvans @chrishemsworth @MarkRuffalo Aren’t you glad the fate of the universe is in our hands? #AgeOfUltron #PressTour @MarkRuffalo http://t.co/BeGW9bqVbH Always love the bad boys. #ScienceBros #AgeOfUltron #PressTour @MarkRuffalo http://t.co/qa65AWTS5F Anybody got a toothpick? #ScienceBros #AgeOfUltron #PressTour @MarkRuffalo http://t.co/383z77n8aG Here we go... #AgeOfUltron #PressTour http://t.co/1OZOVdOD4j Smoldering in slo mo... #PressTour #AgeOfUltron\nhttps://t.co/Zeg9lsstKi U ready for this, Japan? #AgeOfUltron http://t.co/atEsJJWMr9 And so it begins... Coming to a country near you... #AgeOfUltron #PressTour http://t.co/tCPt0mMg16 .@Omaze rocked it! $2,048,070 raised for Julia's House...thank you one and all. #Ducklingsdeliver $2m reached! U blow me away. Keep it goin &amp; show @Julias_House what we're made of. #goodcause http://t.co/LPiPYsDRwo http://t.co/mw8lIGZw4f Spam spam spam... #omaze #2mgoal --&gt; http://t.co/bUimIfGTPJ &lt;-- Gonna spam you guys so hard to get us to $2M. #letsdoit #omaze #2mgoal --&gt; http://t.co/0CLyz81jFg &lt;-- SO CLOSE TO $2M. Keep it going to get that #Avengers clip! #Omaze #2mgoal --&gt; http://t.co/hESpMQsIuR &lt;-- Big #Avengers announcement tmw on @GMA -- here's a clue for the\npuzzle-inclined. #unscramblintime http://t.co/jeaXFGBNfo LAST DAY. Meet me. Go to premiere. Win Mark 42. New @Avengers clip if we hit $2m. #LETSDOTHIS →http://t.co/QO1JKQwHQr http://t.co/jezvYzkNND Dear Mother Nature,\n\nThank you for 50 years of loving tolerance...\n\n#bloodmoon http://t.co/kIUUEto5Xl BIG NEWS. If we reach $2m by midnight Mon, donors get an EXCLUSIVE CLIP of @Avengers #AgeofUltron on Tues. GIVE HERE: http://t.co/RaIOLB1l3z GAME CHANGER. $10 or more in the next 3 days could win u my Mark 42. #nerdgasm Enter→ http://t.co/t9fdPwFwQI\nhttps://t.co/6c6LxnJgyk Introducing: “No Comment.\" For when ur chased by paparazzi. (Enter to face shutterbugs w me—&gt; http://t.co/3rRRyWwbo9) http://t.co/cpftrownXi #ThugLife #TBT http://t.co/1CLew91N5J Anyone can be a super hero. Please donate here to help the kids of Julia's House—&gt; http://t.co/5Fa5A7HF6o\nhttps://t.co/4EilklsDKO Donations this wk could also win tix to LONDON PREMIERE of @Avengers #AgeofUltron! ENTER HERE: http://t.co/nxJgLFC4bY http://t.co/rPoVnyiBYU You guys are incredible. $1.3M down, just $700K left to reach our $2M goal. ASSEMBLE HERE--&gt; http://t.co/4OgqXbwPPL http://t.co/N9PzGtIdQu 4 million and counting #MeLuvU 🎉 GREAT #MemeMonday pics. Hard call but this won me over. Congrats Cait Child! (DONATE HERE--&gt; http://t.co/obNmbPNpNV) http://t.co/ACdBF029fG Me meeting u. Reply w #Avengers meme of ur reaction meeting me. Best wins a prize! #MemeMonday http://t.co/i2wsdcCmY0 http://t.co/9OgP2sKd4p Nailed this shirt. Donations this weekend could win you a signed concept art poster! Click --&gt; http://t.co/EQ7ZSdVlg2 http://t.co/e0ohdVgli1 Blooper reels are where I really shine… http://t.co/YxInRO69vh\nhttps://t.co/XNDO1u1EYa @MarkRuffalo You're my brother, love you. \"Be seeing you...\" Check out more at http://t.co/3Ar5KWvvn2\nhttps://t.co/u7BRAZPIzT 48hrs left to nab a week two shirt featuring my beloved Montgomery. #divacat http://t.co/G5KtqMKYOK http://t.co/0jaOsBSlUf @prattprattpratt @Marvel Much appreciated, Mr. Pratt. Couldn't have done it w/out Albert &amp; the good peeps from MSFT. God bless Alex &amp; fam... Can’t resist more pics from the #CollectiveProject. Special thx to Albert Manero, @MSOneNote, &amp; @Marvel. #Limbitless http://t.co/SvSDwMNz20 Honored to present a bionic #IronMan arm to Alex through @MSOneNote’s #CollectiveProject. Check the bowtie. #dapper\nhttps://t.co/lhLG5g1RP8 If ya haven’t seen it, here’s the full vid, in all its 107 sec donation pleading glory. http://t.co/G5KtqMKYOK\nhttps://t.co/aLSYDpqnJD This one's for my honey bunnies. (Don't forget to check out the NEW SHIRT this week at http://t.co/VUOpiapY7v) http://t.co/p5hkvmZt0M LAST CHANCE for this shirt I designed! Got more each week, so tune in for more #DowneyDesigns! http://t.co/8n7Gh0yGni http://t.co/vdAFueuKM2 Last one in is a rotten egg... What's that smell? Ladies and gentlemen: @chrishemsworth. I hope I’m not being too forward, but the subtle approach is passé. (Click here to win maybe: http://t.co/zJAAbkoNF8) http://t.co/ciZtVKSrc9 From the great hair gel shortage of '93... #TBT http://t.co/Jml9054OfJ I got a fever...and the only prescription...is more Ultron. (Tix available now!) @Marvel @Avengers #AgeOfUltron https://t.co/Iwa1GOBf8k My son's band plays the Virgil tonight in LA. Check out @deadfingerband, they truly rock! #downeypowertrio\nhttps://t.co/FADKzUifxL Your generosity nearly took down the @Omaze site! Working to get things up and running for everyone. Thanks so much for your donations! Like life, you can't win if you don't PLAY. Click here to carpe that diem: http://t.co/bRwfiaQonb\nhttps://t.co/83RhDUdUBO RT @TheRealNimoy: A life is like a garden. Perfect moments can be had, but not preserved, except in memory.  LLAP You've been good so here's a new #IronMan poster from @Avengers. &amp; on the DL, big announcement in 8 days… #getexcited http://t.co/AdB1tTib7K Got some goodies for ya. @Avengers #AgeOfUltron http://t.co/dS09aikrOY Spread the love... #HappyValentinesDay http://t.co/dMxA8wwhn7 #superheroproblems http://t.co/gu5bXoayX9 Eat your heart out, Mr. Geller. #porsche #Friendsreference http://t.co/QVR7r7wxPZ The hits just keep on coming! https://t.co/LMhPuqW4xR Got some new faces in the gang. You guys excited yet? http://t.co/sgukbn8XVL The new look. #nocufflinksnoproblem http://t.co/gFUHqG59ry RT @8InchPianist: You're so vain, you probably think this tweet is about you, don't you @RobertDowneyJr Congrats to Bobby Duvall on his Oscar nom! Much love from all of us. http://t.co/PduKP6IFyj Ulton update! https://t.co/JSpdIQ0769 Grateful and appreciative. http://t.co/n90HHftdki Oh people, my people. Thank you. #PeoplesChoiceAwards\nhttps://t.co/XPECTivFZt People's Choice Awards. Let's do this. http://t.co/05sWKOURlS RT @joejonas: STOP! https://t.co/2UooQ6pEbn It’s not easy being married to a Downey. It’s like dog years. #GodBlessSusanDowney @LarryPaulx Thx for the cross-cultural shout out—nice to see fans working together. Sending holiday cheer your way. FACT: I’ve got the best Tumblr fans. Let’s take #1 next year!  #dethroneCumberbatch http://t.co/9UjgF5htVy Be patient, work on your hustle, and exact your revenge. #MondayAdvice I’ve had a good year on Twitter, thanks in no small part to ALL OF YOU.  #ThankYouThankYou http://t.co/BFdDW9EWFz BIG NEWS. Today’s National Believe Day! Drop a letter into a @Macys Santa letterbox and they’ll double their donation to @MakeAWish! #hohoho Had a blast at the @cinefamily tribute to dad last night. Here's a peek. #truthandsoul http://t.co/ejP0355p9L You. Me. Dad. Louis CK. Sunday. Ace Hotel. LAST SEATS HERE: http://t.co/AoZB1xqlj5 http://t.co/IqlP8Bif53 Wanna feel morally superior today? Watch the latest charity street performance by #PIF to support music education: http://t.co/4qQQ4bsyRZ Putney Swope and Louis CK. Do you need another reason?​ http://t.co/KT6wvjplLL\nhttps://t.co/OK19oICz33 Trailer by Pablo Ferro for @Cinefamily event honoring filmmaker (&amp; dad) Robert Downey Sr! Tix 4 sale now!\nhttps://t.co/uc2ysAcAgb Is there a sweeter sound than the music of charity? #PIF  http://t.co/9mDeUyLEvl Back on the boards! #TeamDowney #Yucatan http://t.co/FClPyOqRhY http://t.co/yb8FW8dIFn Hit a few milestones: 3M followers AND @vincentdonofrio joined Twitter. 3M smooches to my fans! Now let's welcome Vince to the party! RT @vincentdonofrio: I’m officially on Twitter!  Ask me questions @vincentdonofrio, include #askvincentd &amp; I’ll answer in 24 hrs.  V.\nhttps… Girl Joy!! Avri Roel Downey, 7lbs, 20 in., 3:22 a.m. 11-4-14... Pretty like mama, and dimples like my uncle Jim! CONGRATS to @MakeAWish for granting #250Kwishes for kids who have life-threatening medical conditions. Here’s to making dreams come true. Happy Halloween, everyone! Don’t do anything I wouldn’t do... http://t.co/wGsWYDv6vn Reddit ran with my DMV visit. Here are some of my favs—check the thread here: http://t.co/vVZE9DdD2u http://t.co/s44Lih6sCT A couple more to whet your appetite… #Marvel #PhaseThree http://t.co/cTcsZZjDI6 Gettin' my renewal on at the Santa Monica DMV. http://t.co/WqlmG4iQuR The @Marvel universe is now even larger. Ladies and gentlemen, welcome Black Panther... http://t.co/X0G7whoVbL AHEM... Here you go. RT @Marvel: Here it is! Watch the @Avengers: #AgeofUltron Teaser Trailer right NOW: http://t.co/JE9S9BDl8a  #Avengers RT @Paguban: @RobertDowneyJr this friday #TheJudge will premier in Mexico! So many great comments about it that I can't wait to see it!!! RT @Lucie_yousee: Such a beautiful movie. It remembered me my relationship with my father. Thank you @RobertDowneyJr #TheJudge #loveit http… RT @CubbinsDaughter: Can't wait! #derRichter #TheJudgeMovie #TheJudge @RobertDowneyJr &lt;3 http://t.co/1QWPb7xhuE RT @LateNightSeth: Proof that @RobertDowneyJr occasionally does his own stunts. #LNSM http://t.co/ec9VW8x6TC Shooting the breeze with @RixtonOfficial on @BBCR1. #TheJudge #PressTour http://t.co/rdz4Tkbte7 Being properly improper at Cambridge. #TheJudge #PressTour http://t.co/NwSSyur1ZN Coming at you over the airwaves... #TheJudge #PressTour @BBCR1 @BBCRadio2 http://t.co/ZkUQ0AYyX6 Duvall's legend continues to grow on tonight's @TheGNShow. #TheJudge #PressTour http://t.co/t2CIYMayda Ciao Londinium, the tour presses on, one great city to the next. #TheJudge #PressTour http://t.co/SfsmR1lUUv RT @swalsh1996: @RobertDowneyJr you should be incredibly proud of the work you put into this film. I laughed, cried, and went home a better… RT @SuperheroPact: @RobertDowneyJr Can't tell you how much #TheJudge impacted my life,which films don't often do. I highly recommend this f… RT @MagykTrix: @RobertDowneyJr saw #TheJudge last night with my mother and she was like \"See? Our family isn't the only one like a Picasso … RT @AisaGelal: @RobertDowneyJr I watched #TheJudge with my dad. I've never seen him so touched, he goes more for action. But #TheJudge real… RT @downeyisperfect: @RobertDowneyJr I will always be thankful for being able to watch #TheJudge twice in one day with my dad. Trust me, th… RT @zengrrl: Going to see #TheJudge for 3rd time this weekend. Solid movie about the give and take of family. Plus @RobertDowneyJr's abs. H… RT @rose1971: @RobertDowneyJr 140 characters is not enough to tell you and your wife, how beautiful #TheJudge was. Great job! Keep making g… RT @AlfamyAmy: @RobertDowneyJr Saw #TheJudge today in Austin, TX. Can't stop thinking about it. Great work. RT @sbellmont1: @RobertDowneyJr saw #TheJudge on the weekend with my sister. We both laughed and cried. What a great movie!! RT @acidbathory: @RobertDowneyJr #TheJudge Speechless. Thank you (and cast/crew) for a movie I'll never forget and the tears I'm still cryi… Round and round the world we go, where we stop... #TheJudge #PressTour #WhereInTheWorldIsRobertDowneyJr\nhttps://t.co/FATS5VV350 RT @JakeBiasotto: @RobertDowneyJr saw #TheJudge last night with my mom. It was a fantastic movie with phenomenal acting! big fan keep up th… Roma screening of #TheJudge. Tweet me your thoughts after! #PressTour\n#RomaItalia http://t.co/ZInBD66fJK Grazie, Roma, for the great turnout at #TheJudge premiere! http://t.co/LHBkYvG9qV And we're back! #TheJudge #PressTour #RomaItalia http://t.co/BjglwHZTqU How do you say “Press Tour” in Italian? #TheJudge #PressTour http://t.co/syauSyq3Mt Quick, what song would really accentuate my swagger? (\"Stayin' Alive\" is the correct answer.) #TheJudge #PressTour http://t.co/XKNmx3p0lq Strolling through the Eternal City. #TheJudge #PressTour http://t.co/iXygwiIHQP Ciao, Roma! #TheJudge #PressTour http://t.co/g8pZdAaNuT RT @downeyisperfect: @RobertDowneyJr I would like to thank you for making #TheJudge movie. Me and my dad went twice. I've never felt so lov… RT @IrishCondon79: #MovieReview #TheJudge #RDJ is brilliance personified,  #Duvall is heartbreaking.Pure cinematic mastery. Loved every hea… RT @suziemanser: @RobertDowneyJr #TheJudge Best movie of the year! Crazy that 2 people have such different takes on life events &amp; how that … RT @FloppyHouse: @RobertDowney  god, I went to see #TheJudge 4 times ! I love it ! robert duvall and you are excellent! .@reba Thanks Reba! RDJ RT @reba: I highly recommend The Judge!!! Great movie!!!\n#goseeit http://t.co/olExci1CeZ RT @Loriiana19: @RobertDowneyJr My mom is excited for #TheJudge..my mom is excited for a movie....believe me that's a miracle!! 👏 RT @Bouyah37: @RobertDowneyJr #TheJudge was so excellent that I don't finish my pop corn ! I was so concentrate in the movie ! #TheJudge RT @Wattyz: @robertdowneyjr My husband and I both loved it. We both had to pee, but didn't want to miss anything! I'm going again next week… RT @JValerio21: @RobertDowneyJr #TheJudge was amazing! Makes me want to go back and visit my dad ASAP. RT @kScicc: Haven't seen a movie like #TheJudge in a long time. @RobertDowneyJr + company made something special. RT @BrinaHobday: #TheJudge was the BEST movie I've seen in a LONG time... and I see a lot of movies! Of course RDJ was a huge plus! 😍❤️😘 @R… RT @HisDuckling: @RobertDowneyJr #TheJudge is one of those movies you can watch again and again and never get tired of it. Amazing. You and… RT @HiddlesSmiles: @RobertDowneyJr #TheJudge is a beautiful movie. Love,hate,fear, redemption &amp; learning to forgive &amp; accept. Beautiful! ht… RT @BurnsLori2: @RobertDowneyJr Saw it Thursday night with my Daughter, excellent movie will c it again! Havnt talked to my Mom in years, s… RT @PapaJohnCagle: @RobertDowneyJr LOVED The Judge!  Saw it w/ my son; a great shared experience.  Really made me re-evaluate my roles as a… RT @WatercolorsRain: @RobertDowneyJr #TheJudge was excellent! It reminded me of the relationship I had with my own father. Very much a love… RT @Desmomonster69: @RobertDowneyJr my family and I loved the movie. My mother is a huge fan of your so it was an extra special day for her… RT @jenconnic: @RobertDowneyJr hit home for me with my own relationship with my dad. He's had a rough year+ and I've had to be the parent t… RT @rdj_gc: @RobertDowneyJr saw it last Sunday in Chicago. Had to call my mom after. Loved it so much I'm seeing it again tomorrow! #TheJud… RT @alsowillgraham: @RobertDowneyJr My parents and I LOVED the film! It really hit home for my mom because her brother is like Hank #TheJud… RT @rosefizzle_: @RobertDowneyJr I've went to a screening and not only was I an emotional wreck, it made me think and made me appreciate li… RT @iBleedAngelRed: @RobertDowneyJr I loved it so much! Not only is the story fantastic, but I can absolutely relate to your character. I t… Love hearing all your experiences watching #TheJudge and how it resonated in your own lives. If you've seen it, tweet me your stories! Palmer vs Palmer. #TheJudge http://t.co/EYf2e9LcF7 Thanks! That was a blast. Enjoy your weekend and please put our movie at the top of your list. You won't regret it. #TheJudge #AskRDJ .@JonasFansNation Pepperoni pizza stuffed with pasta carbonara! #TheJudge #AskRDJ .@Brynndowney That's funny. Try having a camera pointed at you for 30 years! I guess a little yoga helps too. #TheJudge #AskRDJ .@whosdoctah Hank visits his mom at the cemetery. I had parallels in my own life that made it tough. #AskRDJ #TheJudge .@kerrz123 Whatever Susan Downey says. Thanks for asking! #TheJudge #AskRDJ .@ina_IK Easy, be fully yourself. #TheJudge #AskRDJ .@Reign_Fans You assume I'm not in possession of them ALL? #AskRDJ #TheJudge .@rdjfandom I hope not. Hank wins the day by sticking it out and developing faith. He sacrifices for the higher good. #TheJudge #AskRDJ .@2thedreamers I don't know that I experienced embarrassment during production. It was a fruitful, harmonious group hug of a job. #AskRDJ .@rosefizzle_ Seek to understand rather than to be understood. Not easy, but well worth it. #AskRDJ #TheJudge .@worldmarooner I've a deep respect for the process and more of an understanding of production. #TheJudge #AskRDJ .@MadelynSilva I've seen worse and I'm still here. Bring it! #TheJudge #AskRDJ .@dickc Funny. I believe everybody winds up in the roles they're meant to do. Half of mine were turned down by others! #AskRDJ #TheJudge .@Alexx_xxelA Hank is a guy who's seeking salvation and doesn't know it, then finds it where he least expects. I relate. #TheJudge #AskRDJ .@MechuReedusRDJ The same. Funny how my objectivity flew out the window. I let the movie take me on a ride. #AskRDJ #TheJudge .@Janika__P I admire any man or woman who's up to the task. Lately, Susan is my hero. #TheJudge #AskRDJ .@storyhookx @daxshepard1 and Billy Bob Thornton provided those. Lots of laughs. #TheJudge #AskRDJ .@ainxsx Lately, I'm thinking Rome 4th century BCE. #TheJudge #AskRDJ .@AMellenWrites People are saying it transcends the typical courtroom drama in that it's got pathos, humor and subplots. #AskRDJ #TheJudge .@upanddowney_ \"Here comes the Pulitzer\"! (lol) #TheJudge #AskRDJ .@downeyobsessed @VeraFarmiga is delicious as Sam. I'd love to find something for us in the future. She's at the top of my list. #AskRDJ .@AishG_98 Usually I don't know it until I meet her or him. You never know how personalities will meld or clash. #AskRDJ #TheJudge .@TwistinMixin They're both tough in their own ways. I found #TheJudge to be very uplifting, personally. Very proud that audiences love it. .@sharannxx At the beginning of the movie, yes. By the end, doubtful. Hank's #1 client would be someone wrongly accused. Tony rarely is! .@janet_phoenix Duly noted. Every mother-to-be is a Navy Seal and a saint. #AskRDJ #TheJudge .@kenzleclaire Gifted, damaged, unrequited. #AskRDJ #TheJudge .@tvd924grl \"Top of the World\" because your love puts me there. #AskRDJ #TheJudge .@iamolliewilson There is great power in simplicity of approach. Process, not results. #AskRDJ #TheJudge .@Ju_Ferrareto About the same. Pro is more creative control. Con is culpability for those decisions. #AskRDJ #TheJudge .@OUAT_fan96 One of them is the kitchen scene during the storm. Two lawyers go at it about the past. #TheJudge #AskRDJ .@Homegwarts In the last 24 hrs, a Nestle's crunch \"bite,\" and a Milky Way \"bite.\" #TheJudge #AskRDJ .@dxwney You might want to bring a kleenex or two, but most folks just go with it. #TheJudge #AskRDJ RDJ, open for the business of pleasure. #TheJudge #AskRDJ http://t.co/j4gVvmigHi In 1 hour please whisper “tweet nothings” to me using #AskRDJ. #TheJudge http://t.co/4bAFzJkacj Another true honor here at Club 21 w/ Dobkin, Duvall, @OfficialSting, Trudie, Floyd Abrams, and @DanAbrams. #TheJudge http://t.co/0KbRpbdBbx This weekend, you get to be the judge and jury. Give our film a shot and tell me what you thought. XRDJ #TheJudge http://t.co/xEwe6YO7zX Late Night SNL alum reunion. @LateNightSeth #TheJudge #PressTour http://t.co/DsuevQZJOL The original gangSTAR @charlierose. #TheJudge #PressTour @CharlieRoseShow http://t.co/mHkjPxtnia Duvall, Dobkin, Downey. #TheJudge #PressTour @CharlieRoseShow http://t.co/8d0yZVZHTU Q’s for me about #TheJudge need not remain burning! Join my Twitter Q&amp;A @ 4pm ET Friday. #AskRDJ http://t.co/Ig1Maw54bK I’m on @TheEllenShow. @TheEllenShow is wonderful. #TheJudge #PressTour http://t.co/6WT7uXDxj5 .@Jon_Favreau You had me at #TheJudge. Thx brother. #YouMMMMakeMeHappy http://t.co/v6ongMlnyv Jim and Bob's black belt mountain top stare down. @JimmyFallon @FallonTonight #TheJudge #PressTour http://t.co/QQifvmJFUZ Let the countdown begin… 11:30ET. @fallontonight  #TheJudge http://t.co/8x0ibTPgF2 100th tweet! Dedicated to my AMAZING FANS. Esp @AmazingRDJ @rdjsfans @downeysduckling @downeyobsessed @RDJBrazil @pj4mexpress1995 @downeysus RT @reddit_AMA: Join director David Dobkin for his AMA live now: http://t.co/FelXVN9kTS You ready for me @jimmyfallon? #TheJudge #PressTour\n#IComeInLikeAWreckingBall @fallontonight\nhttps://t.co/bxEQPQRGGG Had a great morning with @GMA and @KellyandMichael. You guys are better than coffee! #TheJudge #PressTour http://t.co/yctbm9rRYX Tune in tonight at 11:30pm ET to catch me in the act with @letterman. #TheJudge #PressTour http://t.co/hGtzY9lgD2 Want to express gratitude for the amazing audience response from IN, OH, &amp; IL. You won my heart, heartland. #TheJudge http://t.co/LrPsoHark4 @daxshepard1 Dear Dax quiet as it's kept and, not to make it public, you trigger my...emetophobia. Hi it's Robert and I'm currently live on Reddit. AMA! http://t.co/rGQGPVjQDf #TheJudge #PressTour http://t.co/k1ImDm9Ewb Gibson turns down IM4. Robert issues new ultimatum. @sternshow #TheJudge http://t.co/N6Tg1RRXqX Homecoming NYC. @sternshow #TheJudge http://t.co/f4glEwUIab Reunited with Vince at @lstfi and it feels so good... #TheJudge #PressTour http://t.co/xEx7jVMpD9 Wanna watch me get schooled by @NorthwesternLaw? Check out the video here: http://t.co/rflYUH7sbk http://t.co/jjNswjVoEB Had a blast, Chicago, but I’ve got a date with another city. If you guys can’t guess this one… #TheJudge #PressTour http://t.co/qwEXCjkq3W Had a great time at Hank Palmer's alma mater, @NorthwesternLaw! #TheJudge #PressTour http://t.co/tw8Yfw3Gqb Throwback to last night's epic dinner at #TheAviary with @nickkokonas, @abrochu, and @ChrisGerbs. #TheJudge #GoodEats http://t.co/WdHbgQFhKg Dessert tea, Chicago-style. #TheJudge #PressTour #TheAviary #GoodEats\nhttps://t.co/TiGpQXQFon Morning Chicago. You ready for this? #TheJudge #PressTour http://t.co/J825FXvNXr #GangsterStyle #TheJudge #ChicagoInternationalFilmFestival\nhttps://t.co/bmEx9Vcd9n #MonumentandMan #TheJudge #HancockCenter #ChiTown #ChicagoInternationalFilmFestival http://t.co/2RMQB8T3gy Hello Chicago! Go Schaumburg Saxons! #TheJudge\nhttps://t.co/fIWnoIFjR8 Had a blast w soldiers at Wright Patterson Air Force Base. Love this coin! #TheJudge #airforcefly #heroes http://t.co/LCuBsSJGNb Ya guess? Hung w soldiers at Wright-Patterson AFB. So many heroes, so little time... #TheJudge #airforceflyfightwin\nhttps://t.co/hMKpQAhmU4 Ready to play again? #TheJudge #PressTour\nhttps://t.co/UJ9zRtKKrg Had a blast at the @heartlandfilm screening of #TheJudge last night. Good people. Good movie. Thank you thank you. http://t.co/llWMJpzWHL Ran into two hometown heroes while on the road for #TheJudge. You jealous? @hasselbeck http://t.co/9X2JK3R6Se Behold... #TheJudge #PressTour #SurpriseAppearance\nhttps://t.co/LdSVHrU1HI I love this game. Any last minute guesses as to my secret location? #TheJudge #SurpriseAppearance\nhttps://t.co/ZMQNnHNIAA You asked for it…come watch me spill my guts in a @reddit AMA this Tuesday at 12:30PM ET at https://t.co/7EQGSUBav1! http://t.co/kzFe4EXuVh Wanna play: \"Where in the world is Robert Downey Jr\"? #TheJudge #mysterious\nhttps://t.co/CsYqdZ2IHi Listen... That's the sound of me being awesome. #TheJudge #PressTour\nhttps://t.co/1xZ9ip2xP5 Get ready, world... #TheJudge #PressTour\nhttps://t.co/7704PA9t9p A story of fathers and sons. #TheJudge http://t.co/a6PJdLH41Y I wasn't the only ridiculously attractive person to attend the LA premiere of #TheJudge last night… http://t.co/v45fgzkSyh Never turn down the opportunity for a photo shoot. http://t.co/zQIiKfGYgp Hittin' the carpet at the LA premiere of #TheJudge. http://t.co/Y7cmVRsMwQ #TheJudge tix are a click (or bike ride) away! Pls help prove films about ppl can do business…http://t.co/IrWjVOxcEz http://t.co/OVnQegqmVh Days of Thunder meets Blue Steel. #TheJudge http://t.co/JlD6wUgnh9 #TheJudge http://t.co/8r5scerOn0 Take 23... http://t.co/YN7U1dvmLF http://t.co/wUazO23Fi2 Here's to a hale + hearty Wednesday &amp; V2 of our trailer for #TheJudge.\nEnjoy, and again, thx for your patronage...\nhttps://t.co/qsr5s1wFQY Seeing how Tues is the most productive week day I'll not lower efficiency. TMW tho, I'll throw a surprise your way... http://t.co/fli5WWqT0z People keep saying I'm \"metrosexual.\" Does that mean I make love on subways? @daxshepard1 My sentiments exactly. Talked w @VanityFair about #TheJudge &amp; my sacred Marvel brotherhood. We may have a secret handshake. I'll never tell. http://t.co/iMyeXNU271 Doing my best to stay bananas. Here's another EXCLUSIVE OPPORTUNITY. Check it out at http://t.co/EXyrmAcAaa.\nhttps://t.co/5GgtYY3KfY Bon voyage, #TIFF. One big, happy family. #TheJudge http://t.co/zQuhDvQBwH D'Onofrio's chrome dome is such a turn on... #TheJudge #TIFF http://t.co/3xqoxwf5nE Day Two. #TheJudge #TIFF #HTC\nhttps://t.co/FIA7CZ4X54 We conclude this live tweet session with a hard won refreshment. Thanks for tuning in. #TIFF #TheJudge http://t.co/MEOVYz6dl4 In the green room #TIFF #TheJudge http://t.co/R3Wvrw9smr #TIFF #TheJudge http://t.co/5Dq5anyFhn Emma looking great #TIFF #TheJudge http://t.co/H7A6Iz8KbW Pressing it up. #TIFF #TheJudge http://t.co/norDioZgBy Pre carpet. Approve? You should see the missus... http://t.co/rHAvjzTq8F Two more for ya. You guys ready for LIVE TWEETS from the red carpet tonight? #TIFF #TheJudge http://t.co/wEkBxrfZ3M Good Morning Toronto - Day One.\nhttps://t.co/HBoHEb9iz3 Sometimes I wonder if people really like me. And then I go to South Korea… http://t.co/63xnWUc4K8 RT @AnthonyEStark_: And I follow her lead. RT @PepperTheRescue: http://t.co/NQhdDtcGNw Who says I'm always just business? @/AnthonyEStark_ @GwynethPaltrow and I strutting our stuff. Make sure to crank up the volume for this one! --&gt; http://t.co/2mhiheys6c http://t.co/GpbNINZqlH First look, as promised. #TheJudge http://t.co/6wkbms9xQ2 My ham looks more like a seal... http://t.co/oNNovJjCxU Impulse control has never been my strong suit...\nhttps://t.co/0ACQAtbAFW You're not real \"brothers\" until you take weird selfies together. #TheJudge http://t.co/7jC5MgtF50 It's always polite to ask. #doyoulikemyhamster http://t.co/ylLDA4oLVG Hemsworth! D'Onofrios! U have 24hrs to comply!! #ALSicebucketchallenge\nhttps://t.co/mGbcnFGP3O So long, SD. #SDCC http://t.co/PaodrN4ukA Gearing up for the big day... #SDCC http://t.co/mc2BnTCDP8 RT @EW: .@Avengers: #AgeOfUltron: On the set of @Marvel's biggest movie ever for our #SDCC preview: http://t.co/a9WRHDxauA http://t.co/y3JA… Yo. Susan. Me. Baby. Girl. November. Scorpio? Thx all who voted for me &amp; IM3 at the Saturn Awards! Couldn't go, but I'm sure my speech was a highlight of the show. http://t.co/GxFLbP9SgZ Got one more for ya, Twitter. #TheJudge http://t.co/PSYpIAa5nF Here’s a first look at #TheJudge. This is the kind of movie I grew up wanting to make. Only took 49 years. Enjoy.\nhttps://t.co/gc4JwNLe72 I've been unemployed for 2 days and require excitement. Time to tweet! Check in tomorrow--my followers get 1st dibs. http://t.co/PJjke0IY7K Chef: the only way to fly. http://t.co/G9hgPf6skq Get a first look at my next film, The Judge, in theaters 10/10! http://t.co/9O0RJkipzq Safety first this Memorial Day weekend--strap in with Mark and Bob! http://t.co/NLvTkXolZE Thor and Iron Man got your back, Strat. #CapForStrat http://t.co/hNp033KOSe Just spreading light. RT @TwitterData This map shows what happened to @RobertDowneyJr followers after his first Tweet http://t.co/EhmewFyAdf To all the mothers in the world, thank you. Happy Mother's Day! @CharleneAshleyG Don't worry Keira, I believe in them too! Speaking of awesome movies that open today... http://t.co/L2sEHMFC06 #Chef @RealRonHoward Much appreciated, thanks for making room for me If you're still stressing over my Facebook post today, here's a song from the #Chef soundtrack to calm your world. http://t.co/V1HTiXvprO RT @Jon_Favreau: First look at #Chef soundtrack CD cover featuring SXSW poster art by @RobertDowneyJr http://t.co/kcJwyBX01V @RobertDowneyJr For the record, @MarkRuffalo is between @SamuelLJackson and @josswhedon. Mr. Jimmy Rich apologizes for the framing. Sunday afternoon in Richmond. http://t.co/f4RhyZmtYQ @BaconBaconSF Hey cousin, how about \"this little piggy\" or \"the hulk buster\"? Lights, camera, assemble! @MarkRuffalo @ChrisEvans #AvengersAgeOfUltron http://t.co/X972pscJCz RT @MarkRuffalo: Photo: @robertdowneyJr Bros. http://t.co/8AuFCF6a3x You asked for it! My first tweet from the set of Avengers: Age of Ultron with exec producer @jlatcham. http://t.co/ThwoLueMyT @jimmykimmel I just play the guy! Still one of my greatest joys. Get ready for Avengers 2: my boy @josswhedon is pulling out all the stops! @MarkRuffalo Thx brother Banner, see you soon! Hello Earth people. Whilst I self obsess (become Tony Stark) life's in session--check out @DylanCon's Songs for Syria http://t.co/s6FO2OMJul Please be gentle...it's my first time. Testament to my trust in that guy who directed @ChefTheFilm. Hey tweeters, make room for Downey! Loving all the love, folks. It's been a blast. Though can somebody please explain how anyone can keep their thoughts to 140 characters or le @DylanCon love ya, cuz @Jon_Favreau thx for the intro Talk to me, Twitter. http://t.co/7skFm6Ffhn"}