{"tweets": "@sea_bassssss Even better! 💚 @outro0097 Have you found the one? @jooneeper Finally, your season can begin! 🎃🍂 @lizlovesjon16 Yes, you can add extra syrup to your beverage. Your barista would be happy to help you modify your drink. @sea_bassssss Did a kind friend bring your warm cup? @__lipstickjunky Hope you spent the day with your favorite drink! 💚 @ComedyHeather You should see your birthday reward in your account tomorrow, Heather! We can't wait to celebrate with you. 🎉 @em_2011 An ideal situation! 💚 @M3rcurysEff3ct It's always good to have coworkers who can lead your cup in the right direction! 😉 @KimLHolder A wonderful way to warm up this season! 🙂 @nikkinotz Sn❄w ready for a cozy cup! @whit_wanders 🧡 @rebelliousmary Cheers to autumn living!  🍎🍂 @sarrahhanne Like a warm hug in a cup! 💚 @Broadz You can stay Fall ready all year long! 🍎🍂 @__Cyrondisss Did you pick up your cozy cup? @whit_wanders Now, you're Fall ready! 🍂 @JustinNoelDev So much magic on the other side! ✨ @Aubrea_Taylor A fun way to celebrate yourself whether it's your big day or not! 🎈🎉 @leifzen Salty meets sweet to make your taste buds smile! 😋 @paige__elder We hope you get a chance to stop by for your delicious snack! @C_Pj_K We hope you get to decorate your cup soon! 🧡 @mama_allicakes You earned it! @SamForever__ Join Starbucks Rewards via our Mobile App! @LauraSteurer Cheers! @_xahraa Awesome! @mickatz Is it now your new favorite? @ajhoff28 And everything you deserve! 😉 @_xahraa We hope it became a part of your day! 💚 @Bellaaaac_ It's the little things!😉💚 @leslieee702 Especially when it's warmed and paired with a Pumpkin Cream Cold Brew! 😋 @morganxmua Glad you enjoyed it! @Atusa1 They're little celebrations! Which one is your favorite? @CoachJMort There's nothing wrong with loving Pumpkin Cream Cold Brew! @w_cozi We look forward to seeing you soon! @sammy_jr4 We'll let you in on our little secret, our Peppermint Mocha never left! The Chocolate Shavings are only available during the holidays. @andreawaite88 More for you! 😉 @ItsmexCandy Try our Salted Caramel Mocha! @__Keevo It's a delicious way to start your day! @ty_brookie Gotta fuel up! @ChellezSoFly We're thrilled to hear you love it! @al3x_leeAnn Stop by your local Starbucks and check out the available merchandise! @kaymacc_ @loserbex You're right about that! @yo_chelseaT *Insert hair flip* @_kryssss Surprise, it's yummy! 😉 @blackkitty817 We're excited, too! 😍 @RagerianCronin That was sweet! @1Mom2threeboys Hey Jenny, the Frappula Frappuccino® is not around this year but we recommend trying a White Chocolate Creme Frappuccino with Mocha sauce at the bottom of the cup and Strawberry puree drizzled on top! @CalebTaylor2468 Stay cozy! @si_errraa Give our Salted Caramel Mocha a try! @vincentvanh03 Our Halloween-inspired cups were sold at licensed locations in the US. We recommend visiting your nearest licensed location for availability. Please note that if they are sold out, they will not receive any more shipments. @blackkitty817 Stop by and see us soon! @missvhilton A perfect choice! @BaileyyCasas You definitely deserve the Pumpkin Cream Cold Brew! @chloeealyce Yum! 😋 @sasssynsweet Our Fall beverages will be around while supplies last. We hope you get to enjoy your fave before the season changes! 🙂 @HighwayofLife First coffee = Salted Caramel Mocha. Second coffee = Pumpkin Cream Cold Brew. @rebeccawatson Pair with our Pumpkin Cream Cold Brew for an extra dose of delicious pumpkin flavor! @kristenraves You've got us thinking! Submit your idea here, https://t.co/EFFd3FUwu4. @ChelseaMorganO He's a keeper! 😉 @MomGang26 Double foam of our Pumpkin Cream Cold Foam is double yum! @morganfalconWX You win the pumpkin carving contest! @OVOChynn Delicious down to the last bite! @faaannyy_27 Definitely take her word for it on this one! @Yanthecancer Whew. 😘 See you soon! @Laaaccckkk Our Pumpkin Spice Latte is back! Check with your local Starbucks on availability. @MandaWink You mean baa-a-a-a-arista? :) Thanks for sharing! @sarrahx It's not fall without the PSL! @LuisHGaray Hi, Luis. It will still be here after Nov. 1st. It might not be available on the menu at some point, however, it will be available to order by recipe for the season while supplies last. @DOTE6 There's no shame in the PSL game! @Yanthecancer We'll be waiting for you to return! @Lynettec__ It's so delicious, it's almost too gourd to be true! 🎃 @SifiyeFreecss We're one big coffee family! Stop by your local Starbucks and your local barista will be happy to help you fall in love with the PSL! @elizabeth_greg1 That makes us very happy! 💚 @FindingBeauty94 Sisters that sip together, stay together! @greenbean3526 We can't get enough of that gourd-ness either! @nowiseedaylight \"One way or another, I'm gonna find ya/I'm gonna get ya, get ya, get ya, get ya/One way or another, I'm gonna win ya...\" -Blondie (and Pumpkin Spice) @LailaNickol Yes! This. 👆 @MichaelJStern1 That's a perfect way to reuse your Starbucks cup! Thanks for sharing with us! 💚 @elizabeth_greg1 YAY! It's great that you tried it and found out you love it. @JulieGoBoom A sip worth returning for! 😉 @m_georgeee Happy you found an exception! @2democ4manifest You are welcome here! @bcpoetv Welcome to the PSL side! @los_arx That line will definitely work. @Eh_Writer Pumpkin Cream Cold Brew is sorry not sorry. 😉 @ChristyChatman3 Enjoy! 💚 @AuntieMarlena YAY! You're off to a great -and tasty- week! @s_h_a_kyra It's a match made in heaven! @Airaamariaa Good point! 😎🍂☕ @dottie089_ @g4merslu7 Glad we made the cut! 😉 @sierrasprehe Our vote is best decision! @MichaelJStern1 We love a good Pup-kin Spice Latte! @herreraantonia9 Hey, Antonia. If that's something you'd like to see on our menu all year round, please let us know at https://t.co/SPH9PuUUvR. Thanks! @Horns_Of_Valmar Hey! When is your special day? @xoali77 It's a must-try! @itselisaaaaaaa You've got some serious pumpkin carving talent, there! @Alyssa_from_AK Let the Pumpkin Spice magic do its thing! 🙌🎃✨ @KristinSkaar Have no fear, Mobile Order through the Starbucks App is here! @tbhvictoriaaa That's one way to spice up your life! @EvaTortora What a frighteningly fun idea, Eva! @ShootNStarr It's giving us chills! @__helias Pumpkin Spice Latte with a almondmilk is pretty good! @InspiredxHope Sorry, the Phantom Frappuccino® drink is not available in the US, but you can request that we make it available there on https://t.co/SPH9PuUUvR @BolyosRiley Sorry, Riley. We don’t have a Halloween-themed Frappuccino® drink in the US this year. Some customers have been enjoying a White Chocolate Creme Frappuccino with Mocha sauce at the bottom of the cup and Strawberry puree drizzled on top! @TtvPowerofthree YAY! Smooth Nitro Cold Brew and Pumpkin Spice flavored Cold Foam were a perfect match. @BellaaBrielaa Hopefully that Pumpkin Spice Latte will come to you soon! @jasminarenteria It's our Iced Caramel Macchiato. Espresso with vanilla-flavored syrup, milk and ice, then top it off with caramel drizzle! @ambstrudeau Things are always better with an Iced Coffee. @msgabbb We will try to keep your ma-scare-a from running, Gab. 😊 @IsabellaTannaz S🎃🎃N! @GerberMatthew Not this year. The Witch’s Brew Frappuccino® cauldron has run dry! @Nspad11 A few boos and then we're off to fa-la-la-la-la season! 🎄 @Backpackjohn1 Hands off our Frappuccino®! 🤣 @InMyHeadArianaG Booing you up a cup! @carlegdell2 No need to skele-run it's just a little skele-fun! In a dark and foggy graveyard,\nwhere spirits and ghouls loom,\none’s come back for something—\nan Iced Caramel Macchiatomb! https://t.co/3nwMcc6SoQ @Tixxnaa Sounds like a perfect Halloween weekend! @kaitlindainis Think of all those yummy holiday beverages coming soon! @theprincessride Don't worry, we'll have other drinks for you to fall in love all over again! @TotesJake It's fall bliss in a cup! @kimberlyp_98 We've got you, Kim! 💚 @ScarlettEHarris Best Starbucks drink this Halloween! 😍 @palwasha_s YUM! Thank for sharing the love. We'll have other delicious seasonal drinks to cheer you up once it's gone. @EffortlessBty Good thinking. We love it! @littlefemmfatal We hope you enjoyed you Pumpkin Spice Latte! @JustineE2216 Noted! ✅💚 @ClassyPugThug Toffee Nut syrup is available in our stores year-round! You can always ask for a few pumps in your favorite beverage. 🙂 @RASEC29 Indeed! 🎃🧡 @jillian_fipps We 💚 you too! @_taracook Sounds like you got a latte done today! 😉 @tamia_lopez We hope you met your matcha! 💚 @AsiaaAbdii Was your Sunday filled with spiced sips? @DanielleDavisWX Definitely a Fall fun alternative! 🍂 @aluissg Did someone order a PSL with a shot of Fall beauty? 🍂🧡 @shewillrise81 When you gotta sip, you gotta sip! 😉 @staycee11 🙌🎃 @adriannaklar You've gourd the right idea! 😉🎃 @bbyp1mp We hope you get in the spirit with your great pumpkin! 🎃 @GamerDad29 We appreciate your love for Iced Coffee! We put it in the 150 tier because it is a handcrafted beverage that takes a bit more time than our hot coffee. However, we’re open to reconsidering as the program evolves. Please request it at https://t.co/SPH9PuUUvR! @OfficialTMoods We're glad you stopped by! You can always order using your mobile app also. Just tap the Reward you want to use when placing your order and you're good to go. 🙂 @jillian_fipps Cheers to that! 🎃 @_Isabel301 Things that make you go yum? @stepfwolff You're welcome! @dale_schaeffer We repeat. These 2 things are most definitely unrelated. 🎃🧸 @stepfwolff Just ask your barista to add peppermint syrup to your cold foam! @badass_capo There's still time! 🎃 @LavaaGorl We love this impromptu mentorship session with awesome nurses in the making! 💚 @chynazanes We released our Halloween-inspired cups in our US licensed stores in September. At this point, stores that have sold through their inventory will not be restocking. Stay tuned for new drinkware offerings this holiday! https://t.co/tj7OWolLZW @ericacarosella Sorry, we will not be offering a Halloween-themed Frappuccino® drink in the US this year. @c227m Sorry, we will not be offering a Halloween-themed Frappuccino® drink in the US this year. @moeeeeeeeeeee_ Sounds like heaven in a cup! @LecLesley Welcome to the PSL life! https://t.co/P1Lx9ydK1E @brandydoesart Let's get you in touch with @StarbucksHelp @LoveChavaughn Nice! 💚 @adubiousmuse Your season has arrived, Jaycee! 🎃🧡 @glazeeyeyes Five Starbucks Reserve locations in the U.S. have introduced oatmilk as their newest non-dairy milk.  Standalone Princi bakeries in Seattle, Chicago and New York will also offer oatmilk as a non-dairy milk at its coffee bars in the bakery. @brandydoesart In order to receive your Birthday Reward, you need to have earned at least one Star this year. If that’s the case, we’re happy to look into it for you. @Ayeeyogee_ You can't go wrong with the classics! @danivierra_ Sounds like a perfect fall day! 🍂 @Ma_Onthatiyana Enjoy every last drop! @howardXdearing Not one single regret! Enjoy every last drop! @alexxandrag7 Thanks, that sounds delish! @Ljcrane90 What an exciting way to end the weekend! @baileyaleece Hi, Bailey. While it might not be on our menu for much longer, it will still be available for the season while pumpkin spice sauce supplies last. @erionmathew Cheers to finding that perfect drink! @ColeH We're very excited about it, too! @Ma_Onthatiyana See you soon! @juwenji Thanks for that perfect sip score! @aggiechirodc Look for it starting October 29th! @OhItsRyansWorld It will be available as long as supplies last. Enjoy every drop while you can! @moonbaseari https://t.co/EmIp0od4tZ @juwenji Enjoy every last drop! @jstilly_ You're welcome. We hope you'll give that a try while you wait for your holiday favorites to return. @itspeyleonard We can't espresso how much you bean to us. 💚 @EffortlessBty YAY! @lavidacomolamia @starbucksprtnrs 💚💚💚 @Aleianicolee We love it with a Pumpkin Spice Latte or a cup of freshly brewed coffee! @haneenfayedd Don't worry! We'll have delicious seasonal drinks to cheer you up. 💚 @erionmathew How was that customization? Did you like it? @CiaraDi96774306 We totally understand. Pumpkin patches are the best! 🙌 @epolazami @Dockers Right on! @NickiMToya Hey Toya, thanks for your feedback. We'd love for you to share your idea at https://t.co/FHAea75lZx. @yasabomber Fall in a cup definitely counts! 🎃 @wuzzyangel Waiting never looked so fun! 😋 @loving_freedom_ Yay! 💚 @BrittanyScheler Awesome! Are you now bragging too? @Daniellerose50 Hey Danielle, we won't have a Halloween Frappuccino® in the US this year but we hope you enjoy our delicious Fall beverage, Salted Caramel Mocha Frappuccino®! @dumbflowerr What a delicious customization! 🧡 @maadilyne Absolutely! @cafylee29 Now, that's teamwork! 💚 @chdiamond We love a good Pumpkin Day! 🎃🧡 @1ONLYBA If you love your taste buds, listen up! 😉🎃 @loving_freedom_ Sounds good! 😋 @LoveChavaughn Hope your weekend was filled with Strawberry and Coconut sips! 🙂 @Crete_Goddess Did you enjoy your Dragon Drink? @_quedee12 Enjoy Summer any time of the year! 🌴🙂 @BrittanyScheler We hope you two can stop by for Pink Drink date!  🙂 @knowlove23 So cozy! 🎃 @xx_domooo Found your new favorite? @gretchen_news A delicious rainy day activity! 😋🧡 @knowlove23 Do you love your pumpkin hot or iced? @cklubs It won't be back this year but we hope you try a Flat White with Toffee Nut for a similar flavor! @speechiepeach Have a gourd life! 🎃🧡 @idiotsammich That's no fun! We hope you get your gourd sip soon. 🧡 @idiotsammich Did a kind friend bring you a cold cup? @_themadderss It's all about the Pumpkin Cream! @ColeH Soon! We currently offer Starbucks Delivers in 11 cities across the US and will be rolling it out nationwide in early 2020! @jonathan_shen7 This could be the beginning of a great Halloween story! @carlajonas Aww! We'll have delicious winter beverages to cheer you up once Pumpkin Cream Cold Brew is gone. @LexieDiBell Woohoo! Thanks for the amazing rating. @neotsn 😍 @FGentilucciTGT Way to go! Looks like your off to a boo-tiful weekend. @carlajonas It's the drink to celebrate fall! @JessicaWest__ Hi, Jess. Pumpkin Cream Cold Brew is only here for the season but we'll have other delicious seasonal drinks for you to enjoy! @BackstageBarbie @ATLouisville What an exciting day! @ORileys_ Yes, yes! We're Pumpkin Cream Cold Brewing you right into the fall season! @ChefBunni Enjoy! We also invite you to join us on Twitter to celebrate Halloween. @Funntastic We knew it would be the apple of your eye. 🍏💚 @parahsaige It's a very a-peel-ing sip! 🍏 @Nikki_geraci That's because we toast them with love! 💚 @E3Pyro Hi, Travis. Your Birthday Reward will be automatically added to your account on your birthday as long as you’ve earned at least one Star in the year prior. Happy birthday! 🎉🎉 @JunkOfMyHeart https://t.co/AR3jvRwtP1 @blondienxtdor Hi, Angie. If you like those brown sugar notes, try a Flat White with toffee nut syrup. @nancecakes We're ready to make your dreams come true whenever you are! @leanndra77 Hi, LeAnn! It will be available on our menu and later by recipe for the fall season while supplies last. @ChefBunni While we don’t have a Halloween-themed Frappuccino® drink in the US, some customers have been enjoying a White Chocolate Creme Frappuccino with Mocha sauce at the bottom of the cup and Strawberry puree drizzled on top! @theillestb___ That's a power couple right here! We'll see you soon. 😋 @CornnroC It's a sip that mochas us fall in love with it!  😉 @foinesince99 Thanks for sharing the Pumpkin Cream Cold Brew love! @miclynn It's everything you love about fall in every bite! @SunnyBunny_54 We're happy to make whatever your heart desires! @SamSnopkowski With the perfect drink of fall, you don't need to say anything else. 😋 @riissssssa Apple. Drop. 😉🍏 @covrtmx We completely agree! @GM21__ The Pumpkin Cream Cold Brew is about to make you the best fan ever! @KayPankey__ See you soon?! @tae_dopex2 The perfect treat on a chilly day! @MusicHasControl We're just thankful to have you on our PSL side! 💚 @jonathan_shen7 Very innovative! We love hearing about your delish creations. 😋 RT @starbucksmusic: We’re just creepin’ it real. Our Halloween playlist is finally here! 🎃https://t.co/B7TiEH9mvw @kid_carlosbravo Hooray! 🎉 @MsDeSocio @MichaelsStores @StarbucksCanada @TheCatnipTimes You put a spell on us and now that PSL is yours. 😉 @RonjaWodtke Hey, Ronja! The Zombie Frappuccino® drink has shambled back into the mist. We’d love to see how you customize your own frightfully delicious drink! Or, for a great taste of Fall flavors, we recommend a Salted Caramel Mocha Frappuccino or a Pumpkin Spice Frappuccino. @rebekahtirado If you'd like to see a store open in your community, please let us know at https://t.co/SPH9PuUUvR. Thank you! @ftrhfh Yay! Finally. @EmilyCaterham 🙌 @Queen_Elori Sounds like a par-tea to us. 😋 @altonjonesjr Just your taste buds waking up to the spice of life. 😉 @diamonddezjuan We're glad you found the perfect pumpkin drink for you! 🎃 @maddieee159 Of course, Madison! @CarrollJB9 You're welcome! @kid_carlosbravo So, we'll see you soon for this extra delicious drink?! 😋 @dummyblind Hooray! 🎉🎉 @DerryDestiny 💚 @CarrollJB9 Such a delicious pairing! 😋 @_GirlsAdoreMe We can't wait to share this treat with you! @dummyblind Enjoy every sip, Belinda! @DerryDestiny It's like it's their Destiny to get a Pumpkin Cream Cold Brew. 😉 @ahoycapnmegan Peppermint is available all year, Meg! @WadeMeyers That's a great question! We think everyone is golden, so there's not a certain amount of stars you need to start enjoying all the Rewards benefits we have to offer anymore. You can read up about it here: https://t.co/BgsoNsCSt5. @chesley_chels We agree! It's delish! 😋 @mkwithvalerie Putting in work for those rewards! ⭐ @alondraitxel It's the perfect snack honestly! @Suburbzkid We completely agree! @oddnichols We're sure you'd love it! @soberkravitz All smiles? @jvant_m Kind idea! We hope you share this at https://t.co/FHAea75lZx for future consideration.  🙂 @ErinTischlerr We love this customization! 🧡 @pcelovemarebear Hope your beautiful soul enjoyed your gourd sip! 💚 @notedtheorist We are! A new strawless lid and alternative-material straw options will replace single-use plastic straws in 28,000+ stores around the world. You can view more info here:  https://t.co/TT9xha8eGo @TDSCouch Hey there, we don’t have a Halloween-themed Frappuccino® drink in the US, some customers have been enjoying a White Chocolate Creme Frappuccino with Mocha sauce at the bottom of the cup and Strawberry puree drizzled on top! @MRussellRN Cheers to kind cups! 🎃 @vianca_photog We're sorry to hear that! If you download the app, you will be notified of the next Happy Hour so you won't have to miss out. 🙂 @itsjenniferbell You know we got you! 💚🎉 @blueinsideout Hope your cozy cup helped bring joy to your day! 🧡 @karencorona_ We 💚 this! @kaylan_griffin A coffee date counts! 😉💚 @b_rettcain We hope you yours for Happy Hour! 😊 @itspeyleonard Spooky season besties! 👻👻 @Brendeazzy If you just can't wait any longer, ask your barista for a Caramel Macchiato made with blonde espresso and extra caramel sauce! @_Dilciana Delish! @itspeyleonard That's the spooky thing! 👻 @nataliezone This is not a valid Starbucks offer. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp, or ask your Starbucks barista. @2months4 @Starbuck This is not a valid Starbucks offer. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp, or ask your Starbucks barista. @Julianna_perez3 Have you found the one? 🧡 @misspattystarr Perfect pre-weekend drink! 😋 @AkaDomo Did you Fall in love? @flowrrgirlg Is it your fall gourd-to? @tcsjarmelle It's around while supplies last! We hope you get a chance to stop by again soon. 🧡 @deeestineeb Cheers to love at first sip! @Hazirahasrin We look forward to sharing one with you soon! @itspeyleonard It's spooky season. Nothing out of the ordinary. You fit right in. 🦇 @jstilly_ If you just can't wait for the holidays, you can recapture the festive flavor of the Chestnut Praline Latte with a Caramel Latte made with blonde espresso and almondmilk. You can also add a pump of toffee nut syrup! @misspattystarr Did you stop by? @pammgr We chai'd to make sure we included the Fall fun drinks but missed the awesome one!  😉🍂 @Mondlc13 Cheers to deliciously perfect Fridays! @Gely1729 Happy Friday! 💚 @witdaslime Is it your gourd-to? @Mbeauty_channel Cheers to all the gourd drinks! 🎃✨ @daphneycarriel Gourd you found the right brew for you! 😉🎃 @victoriaisaura You're squashing the snack game, Victoria! 😉🎃 @adro1125 That's a definite Friday vibe! Bring on the weekend! 😎 @loveelynicoleee We hope that means we'll be sharing some with you soon! @MarrissaAnnyse Cheers to delicious discoveries! @whoiscamm Looking forward to hanging out with you! @oddnichols How about the best of both with a Salted Caramel Hot Chocolate? @alexislaurentia Awe, thanks! The are a delish little treat. 😋 @mvlissav You have a wonderful manager! We hope you feel better soon! @FeedYvonne We do love Cold Brew, but in a pinch you can get the Pumpkin Cold Foam on top of Iced Coffee with some pumps of vanilla! @4minimoni You're welcome! @liivvv____ Sip, sip, hooray! 🎉 @holleeschulz The perfect choice really! 😋 @liivvv____ Seeing you soon would make us happy too! @Mally_Elizabeth That's how you celebrate Fri-yay at work! @4minimoni Peppermint is available all year! @holleeschulz Which panini is helping you out today? @kaitmightbelate All the suitors out there feta take Kait seriously. 😉 @SpyderFenix Sorry, we will not be offering a Halloween-themed Frappuccino® drink in the US this year. @KeplerMegan 💚 @justissssb We knew you'd love this a latte. @smcave Tea-rific way to start the weekend! @EmBake718 It's apple-solutely the sip for apple pie lovers! @emmaablacks Apologies for the inconvenience! Due to the brewing process, we’re only able to make a limited amount each day. @KeplerMegan Thanks for the perfect sip score! 🙂 @_jaslynnnn Sounds delish! Ask your barista to add some peppermint syrup to your cold foam and some white mocha to your cold brew! @susannicoson Don't just think about it! What are you waiting for? 😎 @yao_sui https://t.co/tK009ffiy8 @ParadiseAllisha Planning ahead. We approve! @seniorluciofan It's fall in a cup and we're glad you're enjoying it! @SaltyBeach_ We toast them with love so they'll be your dream come true! @lovekboo 2 hands, 2 Happy Hour cups. It's no coincidence! @vixtorrriiaa It checks all the boxes for your taste buds! Buttery. ✅ Crispy. ✅ Cheesy. ✅ @jenimafia Sounds more like a tale with a happy ending! @QueenTerrible Perhaps some sriracha can help you out! @igluu94 No one said you had to share! @xojennagrace We don't expect anything less from the drink that has everything we love about fall in it! @Nerdy_Marie Sounds like you started the weekend right! @joann_larsen It's a brew-tiful sip to fall in love with. 😉 @gilliannnn__ How could anyone chorizo anything different, honestly? 😋 @asiaajai See you soon! 🥐😋 @RachBduh No fighting needed, they gouda love it as much as you do. 😉 @Emz502 We knew you'd love it a latte. 💚 @juliej911 💚 @pinkfireworkss Reigning champ of any meal! 🏆 @LizaElizabethh Extra whip and extra caramel could make this drink the apple of anyone's eye. 🍏 @juliej911 A truly delicious paring. 😋 @_bribeaute Slaps your taste buds with all the fall flavors. 🎃 @kdan_ielle So, we'll see you soon to put your name on that PSL? @Mrs_Dyke_ We're not sure, but it's definitely something they should chai if they do. 😉 @SAlexanderia We completely agree! @AmyEMaier Making it rain stars before the weekend starts! ⭐ @__amira_ It's really the best way to kick off Fri-YAY. @Kenozoic Awe, thanks! We love when you come see us too! @drburke4 We wouldn't give you anything less! @k_huntington You could do both! If you use a drip machine, we recommend 2 tbs to 6 ounces. @g1itchh Honestly, we do it all for you. 💚 @CBearWasTaken Perhaps he's talking about a Chai Tea Latte then. 😉 @Hailyaa_ The are delicious down to the last bite. 😋 @jherrera836 That's all those fall flavors waking your taste buds up! @myakaveli Nothing spooky about that! Enjoy! @Mocking_jag Now that would be a trick and a treat. @stinachuu It's a very a-peel-ing sip! 🍏 @Girlsurgeon It's brew-tiful timing really. @CBearWasTaken You never know who needs this translation now that the raid is over! @43Manha ☕👽 @mendesmyhomie Sorry, no. We would love to see any spooky creations you come up with, though! @43Manha Seems like a win-win to us. @GerberMatthew Not a new flavor, but honestly all our drinks are out of this world. 😉 @EvaTortora What a yummy suggestion. Make it official on our ideas page for us? https://t.co/EFFd3FUwu4. If you’re lucky enough to meet an alien,\nthere’s only one thing they’ll say.\nIt translates roughly to: \n“Take me to your latte!”\n👽 https://t.co/MRcUm8iqlJ @AshleyRxse Sorry, we will not be offering a Halloween-themed Frappuccino® drink in the US this year but the Pumpkin Cream Cold Brew is a delicious way to celebrate the season! 🎃 @stephgxo Everything your season deserves! 🎃🍂 @tcsjarmelle Why the tears, Jade? @_xxmwlxx_ Light the way to gourd festivities! 🎃✨ @ekdd_207 It is and we hope you stop by for one! 🎃😊 @jbanez_ Definitely a gourd way to enjoy Fall! 🍂 @bloomingbbh4 We say after because champs deserve rewards! 😉 @wrongblonde Sorry for the delay! The Starbucks Happy Hour discount can only be applied to one item. @heyjulesjay Friends don't lie so we'll get back to you after we contemplate this with our morning coffee. @JessicaLasker Easy! Just submit at https://t.co/FHAea75lZx 😉 @Gio_blue97 Sounds like you have gourd things on your mind! 😉🎃 @victoriaisaura Which Fall drink do you enjoy with it? @capecodjenn We appreciate your feedback! @michmartyyyyy Thanks for the gourd review! 🎃🌟 @joonieluvr420 We knew you'd love it! 😉 @reedusologist_x Sorry, we will not be offering a Halloween beverage this year but some of our customers have been enjoying a White Chocolate Creme Frappuccino with Mocha sauce at the bottom of the cup and Strawberry puree drizzled on top! @TravelAddicted8 Words to live by! 🎃 @Daniella_x3x3 Sounds good! It's a fun Fall way to switch it up. 😋🎃 @Daniella_x3x3 Is it your new fave? @LadyYazzie It was written in the stars! 🎃🌟 @okval_ There's nothing better than rewarding yourself with your favorite snack! 😋 @chriskoon 'Tis the season for gourd picks and kind cups! 🎃🧡 @mariah8391 Glad you stopped by to hang with us! 🎃 @kaii32123 And bring one for a friend because it's Happy Hour! 😊 @audreyrose5 Live agourdingly! 🎃😉 @Thoughtiana91 Like a spooky star! 🎃🌟 @delidelzz We agree! 🎃😋 @toyin18_ Pumpkin Spice makes everything nice! 🎃✨ @Valerieee77 It's Fall magic! 🎃✨ @_ChrisBURR Fall's always better with a little spice! 🎃🍂 @k_jtbq We love the way you dress up your pumpkin! 🎃 @CTTSTAR Let's get you in touch with @StarbucksHelp @205evon We wanted to give our pumpkin more costume options this season! 😉🎃 @Supahsim You are technically correct. The best kind of correct! @_mimixgarcia Yay! @KaitlyndmBaker What Fall joy is made of! 🎃 @Sammybammy1989 Happy Hour is from 2pm until 7pm at participating stores. @CDSingleton At Happy Hour, we never drink alone! We only drink with friends or total strangers. Thanks for keeping kindness flowing. @mariahvalene That says it all! 🎃 @xmeelisssax It's BOGO so we're guessing who's getting 2. 😉 @fragilecals Live your best life! 🎃 @Zachfromdisney All the more deliciousness for you! @_mimixgarcia It sure is! We hope to see you there! @moreye98 You could be your own bestie and that way you don't have to share. 😉 @SarahJoKnits That's the most delicious realization of the day! @parrafa_ Can't wait to see you! @Supahsim Both for you or are you sharing? @capecodjenn Hey Jenn, we don't have sugar-free Peppermint but if this is something you'd like to see, please share this at https://t.co/FHAea75lZx for future consideration. @CTTSTAR Your Birthday Reward will arrive on your birthday, but we’ll send you an email reminding you 2 days beforehand. We can’t wait to celebrate you on your big day! @mistermeester If you just can't wait for the holidays, you can recapture the festive flavor of the Chestnut Praline Latte with a Caramel Latte made with blonde espresso and almondmilk. You can also add a pump of toffee nut syrup! @EveLoveMusic You've still got time! 🎃 @TainaMaisonet Wait. Who said you had to share? Treat yo self! @_TheRealBrittB Can't wait to see you! @Kevin_Johnson @starbucksprtnrs @GallaudetU Congratulations, partners! We're so proud of you. 💚 https://t.co/PeCFYJUoRX @ayeayerontron Well, it's Pumpkin Spice Latte season! https://t.co/uXTS3WDolb @susanaruckle Check Uber Eats to see if Starbucks Delivers has rolled into your neighborhood yet! @x__alondra Sounds like you're having a grande afternoon! @genaketurah_ You must have the happiest team! 🙂 @matchaaababy Enjoy every last drop! @mabelarus No one said you had to share! 😉 @matchaaababy You're a friend. Have your latte and drink it too! 😉 @ladygaygay Let's get you in touch with @StarbucksHelp @ladygaygay In order to receive your Birthday Reward, you need to have earned at least one Star this year. If that’s the case, we’re happy to look into it for you. @markusaantoine Let's get you in touch with @StarbucksHelp @__MyaTee Thanks for helping us get the word out. 😉 @xivnoe We hope you had tons of pumpkin fun! 🎃 @bettylmitchell8 We're late but we wanted you to know that this warms our heart! 🧡 @AmaaziiingGrace Five Starbucks Reserve locations in the U.S. have introduced oatmilk as their newest non-dairy milk.  Standalone Princi bakeries in Seattle, Chicago and New York will also offer oatmilk as a non-dairy milk at its coffee bars in the bakery. @ladygaygay Your Birthday Reward will arrive on your birthday, but we’ll send you an email reminding you 2 days beforehand. We can’t wait to celebrate you on your big day! @markusaantoine In order to receive your Birthday Reward, you need to have earned at least one Star this year. If that’s the case, we’re happy to look into it for you. @2ndNatureQween So glad you got your favorite! Looks delish. 😋 @luckystars00 What a scary name! @1Rebecca_Smith Watch out October moon! @RickyRave You're glowing! @genbug212 Hello! @itsmemarkr What a dazzling name! @herzz04 Some things are worth the wait. The countdown is on! @beantrail We're excited to celebrate with you! @eMiLy_BaRtElL Really, that could be a monster name or a magic spell. 🔮 @KeanuMybabe You're welcome! @sazzysays Honestly, that sounds like a GREAT scary movie. @sandre217 No spooky sip this year. You might enjoy coming up with your own boo-tiful creation! @eMiLy_BaRtElL No need to choose! Starlighter Spider Spell is the perfect ending to a monster name. @sazzysays But, which Monster Moniker would we put on the cup for you? @CosmiqueChick So close to being an alternate movie title! Your Halloween alter ego? It’s… alive! 👻 https://t.co/BQPCgi46ku @rachaelchope1 The best way to be sure a store is participating in Happy Hour is to give them a call and ask, Rachael! @litto_monse The whoa got you! @daina_smith A little sriracha can take almost anything to the next level, honestly. 😋 @KeanuMybabe It's local time! So no matter what time zone you are in, if it's between 2pm - 7pm, it's Happy Hour time! @MyFriendDeAnna1 We're happy to help and put your name on a PSL. 💚 @angela_cassiani When the weather matches your sip. ☝️ @missademos We don’t have that Frappuccino® drink on the menu by that name, but you can ask for a white chocolate creme Frappuccino with Mocha sauce and a dollop of whipped cream on the bottom, strawberry puree around the rim, and topped with whipped cream. @lizziebooboos The power of spice compels you! @jamariaaa_ You're welcome! 🍏 @MeaganMoments__ It's so delish. 😋 @jamariaaa_ The Caramel Apple Spice! It's available year-round too! @sammmi_145 The perfect fall pairing. 😋 @ElinChristina We toast it with love so you have safe travels! @hayhayhansonnn Does that mean we'll be hanging out with you soon? @RWUDEest93 That's the power of the whoa! https://t.co/tuYMba8J4G @sophiekrach So. Yummy. 😋 @nizzyhippy_ All of fall in one glorious cup. 💚 @PhattyPatty08 See you there! @allysaanderson So perfect you don't need a different drink! @heybradwhatsup Feelin' this! @fuckyeahshana Oh, Brother. Nevermind him. 😉 @Chris_Verd Cirrus-ly! ☁️ @TheLeGacy_87 Sooooo. How'd it go?!? @wajih93 It's a PSL, a Pumpkin Cream Cold Brew, and a bit of spooky magic. 😉 @aylinn_ Birthday girl in the house! We hope today is EVERYTHING!!! 🎈 @rachhsalep The Pumpkin Cream Cold Brew is all our fall dreams come true! @observatoryyy Ahhh! Thanks for making us a part of your love story! @oliveyouiah Treat yo'self and spend those stars! ⭐ @ljl1102 It's easy to love this one a latte. 😉 @bruh_dd A mobile order might be your safest bet to avoid a scare. All the treats with out the tricks. @gabrieloviana Same! @courtney_erin18 Pumpkin Cream Cold Brew, please! 😋 @RobCastaneda97 Thursday has nothing on us! 💪 @A1_Torrez Sorry, no. But, you can enjoy a White Chocolate Mocha Frappuccino® with Mocha sauce at the bottom of the cup and Strawberry puree drizzled on top for an un-boo-lievable experience! @courtney_erin18 Just a bit of Halloween magic. 🔮 @KatieBaillie10 Just creeping it real - we can't wait for the holidays! @A1_Torrez The Witch’s Brew Frappuccino® cauldron has run dry! For a great taste of Fall flavors, we recommend a Salted Caramel Mocha Frappuccino or a Pumpkin Spice Frappuccino. @StFXCampusFood We're just creep-ing it real. 👻 @43Manha Awe, thanks! We boo it all for you. 😉 @52j154i5 You can already enjoy the Pumpkin Cream Cold Boo (Brew)! Honestly, it's delish. 😋 @Mile_grncarov Definitely good, but that doesn't mean it can't be a little spooky. 😉 @43Manha Agreed! 😋 @ohmygeooo It's the science of eerie-ness putting in work. ⚗️🎃 @43Manha Perhaps you mean spooky? 🎃 @StephL59 We'll put your name on it next time we see you! @MICHAEL_PETRO 💚 @Backpackjohn1 That's the spirit. 👻 @Decuro482 Oh my gourd! @MICHAEL_PETRO Any time, Michael! @shayna_kandii See you soon! @PricheSmith Yes they are! Enjoy! @xxhaley95lynnxx Care instructions are on the bottom of the cup, Haley! Some of them are and some of them are not. @muksalgado A mouth-watering fall treat! 🤤 @HighKingCam It's no trick! We put everything we love about fall in one cup and it came out delish! @_jaylakay Agreed! They are berry good! 😋 @CurlyNiqueNique It is a very apple-ing fall drink! 🍏🍁 @alyssapansy We promise it will be the apple of your eye. 🍏 @shayna_kandii Honestly, how could anyone judge you for enjoying the perfect cup of fall? @MairenaSallie See you soon to share this bite? 🤞 @tunmichaelred Who said your sip had to match the weather anyways? 😉 @_lexxxyyy We completely understand the need to let everyone know about this melty, cheesy bite! @myblondelifee Happy Birthday! 🥳 @MICHAEL_PETRO That's great way to spice up your day! Late at the lab,\nthe scientist created something new,\neerily transforming hot to cold—\nbehold the Pumpkin Cream Cold Boo! https://t.co/J63SQS8ov0 @xtinaellis1 That looks absolutely delish! @allysaanderson Which two sips are you going to get at the celebration? @Anne2Leigh A seasonal whoa is the best kind! @JosephFontez Gouda choice! 😉 @Jackiem0001 Nitro Cold Brew is our Cold Brew Coffee infused with nitrogen to create the velvety-smooth finish. @alexis_papaya Why? Don't fight it! @AlexHimonetos Imagination is a wonderful thing. Tasting a cake pop is even better. Imagine that! @PrettyT_____ We look forward to sharing one with you soon! @honeyallison_ Good call. 😎 @isabellatomassi Any day now! Check Uber Eats to see if Starbucks Delivers has rolled into your neighborhood yet. @dustybrown92 We don't see a problem here. All we see are your delicious Rewards! ⭐ @honeyallison_ Is it, though? 😉 @squealweasel Right? Don't lie. We all do it. Lick that lid! No shame. @AnaYummyDiaries Yummy! @Voltairecoppola Welcome to the Pumpkin Spice life! https://t.co/hFXUkpjBtc @yourfavbranz Delish! @lildebbyyx It would hit your taste buds in all the right places! We hope to share some with you soon. @samstvcks Glad you're enjoying a taste of fall! @Kli20021 When you log-in using our free in-store WiFi you’ll see a prompt along the bottom of the home page to click into one of seven available newspapers. @lauren_lee_608 The important thing is that you know now! Glad you're enjoying it. @autumnsays_ We hope you'll give it a try! @Vi_Violeta_G There's not kitten around about PSL love! @PenaDeena While we will not be offering a Halloween-themed Frappuccino® drink this year, you might enjoy one of our fall flavors like Salted Caramel Mocha and Pumpkin Spice! @thmoffitt Happy birthday! Thanks for including us as part of your special day. 🥳 @Audiosecrecy_ Sorry, it is not returning. We recommend adding peppermint syrup to your next Mocha Cookie Crumble. @Amanda_Badgett Now, we want one, too. 😍😋 @chlo_honeydew Let's get you in touch with @StarbucksHelp @camilabruno6 🙌 @TiTiKenn You can use our Nitro Cold Brew store locator to find it in Canada, too. We hope you'll get to try this amazing drink soon! @chlo_honeydew In order to receive your Birthday Reward, you need to have earned at least one Star this year. If that’s the case, we’re happy to look into it for you. @autumnsays_ Maybe a Caramel Macchiato made with blonde espresso and extra caramel sauce can help keep you happy while you wait for the holidays! @_nsvx_ Great suggestion! Nitro Cold Brew is even smoother and so velvety. @sashafitpeach Oh no!  We hope you feel better soon. Honey Citrus Mint Tea to the rescue! https://t.co/bXpJz2ewIG @_nanax0x0 Aww! Thanks for sharing the love. 💚 @ElyceJuyl_ We hope you enjoyed every last drop! @chlo_honeydew Your Birthday Reward will arrive on your birthday, but we’ll send you an email reminding you 2 days beforehand. We can’t wait to celebrate you on your big day! @thechloinator It's fall vibes in a cup! @RachelSlur While we will not be offering a Halloween-themed Frappuccino® drink this year, you might enjoy one of our fall flavors like Salted Caramel Mocha and Pumpkin Spice! @CSkantze2 Look for it at the end of this month! @juneebuuug Apologies for the inconvenience! Due to the brewing process, we’re only able to make a limited amount each day. @Miss_VonnaJ We hope your smile is unbreakable today! Thanks for sharing your birthday celebration with us. @lizzyblahh 🙌🙌 @Amanda_Badgett Fall just got tastier this year! @lbrinx1 It's Cold Brew at its best! @ashsphyx We'd love to have your feedback on it once you've tried it, Eliana! @salmamolinar We might! Check Uber Eats to see if Starbucks Delivers has rolled into your neighborhood yet. @_nanax0x0 Pumpkin Cream Cold Brew for the win! @ElyceJuyl_ Answer the call!  https://t.co/bXpJz2ewIG @cUwUtie_ Life is wonder-fall! 🍂🧡🍂 @_xoBellaB As long as you're going to class, you deserve a reward after! @___ReaganNicole If you just can't wait, try a Caramel Macchiato made with blonde espresso and extra caramel sauce! @seekharbourloz We hope that means we'll be sharing one with you soon! @alright4amumof2 https://t.co/0ips1n1uHl @Love2H8Meeee Yesss! 😎 @NsbSo Go for it. It's fabulous! @kay__camp Three cheers for the best bite of fall! @buzzmason17 We wanted you to find out for yourself! 💚 @JUL2523 Best breakfast go-to! 💯 @camilabruno6 Cheers to the Nitro Cold Brew magic! @_iiamtorii_ We'll thank you now. That sounds delish! @TiTiKenn Nitro Cold Brew is currently available in 80% of company-owned stores in the United States. Visit https://t.co/J1uHF7D3AU to find a store near you. @LegalxLanee Woot! That's exciting. @Automate2Win You can't go wrong with this extra smooth drink! @j_mxrdck It was so good you just had to save some for later! @IAmNatalieWood Fall is sweet with a little Caramel Apple Spice! @Milupitaaa_ Woohoo! Enjoy. @2catsandalaptop This is a great way to enjoy everything about fall, Lauren! @BeatinHeartBaby Now, that sounds like heaven! @celebsmacaque Sounds like you're long overdue. We look forward to seeing you soon! @s_kenziiiie For the best experience of the beverage, we only offer tall and grande Nitro Cold Brew. With larger sizes, the Nitro cascade leaves the beverage before it can be consumed. @kltierney We've got you, Kristen! Happy birthday. 🎉🎉 @Principal_MWES Let's get you in touch with @StarbucksHelp @JPryuke It's like pumpkin pie in a cup! @xanderjayn Ayy, panini, don't you... sorry, we were going to finish, but we got distracted by how good our panini was. 😋 @_tony_montanaa We appreciate the feedback. Thanks! @sir_alpha1 We'd love to hear your new store location suggestion at https://t.co/SPH9PuUUvR. Thank you! @Brawlee13 Fall in the air + in your sip + in your soul = perfection 🍁🎃 @SenoritaRojas When everything you love about fall is in a cup, how could you not love it? 😋 @natureheadass When will we get to share this bite with you?! @CiaraCiarawr Love you back! @aly_coyne It's a tea-rific sip that makes your taste buds say thank you! @thiccerayy Our Nitro Cold Brew is ready to drink poured out off the tap. You don't need to mix it. @_tony_montanaa It's only here during the fall, but anything is possible if you submit it at https://t.co/SPH9PuUUvR. Thanks! @ItsLakeiah We love you too! 💚 @_tony_montanaa Cheers to a new drink to enjoy this fall, Montana! @ItsLakeiah May that next Pumpkin Spice Frappuccino® drink come to you soon! @itsAtalybabyyy While Pumpkin Cream Cold Brew is only here for a limited time, we'll always have other amazing seasonal drinks for you to enjoy. @JosephFontez Which bite made your breakfast perfect this morning? @CiaraCiarawr We do it all for you! @miagangle8 Does that mean we'll be apple picking with you soon? @Katherine_Rae27 Brew-tiful choice as fall favorite! @seshmostdope Nothing better than an oogey, gooey, cheesy bite! @corrienicholeee You tell them Corrie! @KamariaSaysHi 👋 @DanDiGiacomo The feeling is mutual. 💚 @tre_oliver94 We hope your dreams come true! @Andwejigglelike It tastes like fall in a cup! @SofieAlsindy If you'd like to see oatmilk in more stores, please let us know at https://t.co/SPH9PuUUvR. Thank you! @ComicsZombie https://t.co/8cJOu0wVVJ @ComicsZombie Pumpkin Spice season is definitely here! @DanDiGiacomo We agree! Everyone should know about the Pumpkin Cream Cold Brew! @mamaass_ Love you back! 💚 @amariegonzalez_ What sip are we putting your name on for those stars? ⭐ @JasmineABanks We thought we knew you well enough. 💚 @tre_oliver94 We do it all for you! 💚 @mamaass_ We believe in you! ⭐ @Bellekey_ 😋💚 @JasmineABanks Two extra because it's double smoked? @geeelol It's a bite that you should rec-almond to everyone, honestly. 😉 @tre_oliver94 It's the breakfast of champions! @francantcook We hope you had a whoa-derful birthday celebration!  🎉🥳 @SincerelyScarOH Your dearest dream\nOf Pumpkin Cream\nAnd smooth Cold Brew\nWill sure come true. 🎃 @EmilyCaterham We've got your back, Emily. @dayanaajonel It's one of the greatest things since sliced bread. 😉 @stldebbie2011 This is the kind of co-worker we all want. 🙌 @Kbabayyxo We've got the whoa. See you soon? @josilean_ So. much. yum. 😋 @alyssaamparker Double smoked bacon = double the drool. 😋 @uhmandasuzanne We knew it would be the apple of your eye. 😉 @_Jayvasquez We can't wait! @Bellekey_ Drinks are just better when they are pink. 😉 @Kingcharish Hooray! 🎉 @LittleBogie Everyone deserves an education and we're honored and excited to help. 💚 @Michellesalas8 We can't quite share a specific date yet (it's the biggest secret of the year!), but so soon! @zukie2music Keep calm, pumpkin on! For Laura, and many others, the high cost of tuition was a major barrier to getting a degree.\n\nThe Starbucks College Achievement Plan removes that barrier by providing 100% tuition coverage through @asuonline. \n\nLearn more: https://t.co/sdWU3nyf33 https://t.co/GqCC5XnJym @wow_imnotcrazy We love when you find something new! 💚 @LillyLtm We'll toast to that! https://t.co/TecUsl0XUt @KamariaSaysHi All those fall flavors are just waking up your taste buds! 🎃🍁 @_Jayvasquez It's the perfect bite of fall really. See you soon? @Kingcharish So, we'll get to see you soon? @hellogonegirl We knew you'd love it a latte. 😉 @larixauriass Fingers crossed we see you soon! 🤞 @krohrss 😋💚 @Trekkie_47_1701 Thanks for reaching out to us. We are working to find potential solutions that reduce waste, meet our quality standards and can be scalable across our stores. In most areas our cold cups and cold lids can be recycled. You can learn more here: https://t.co/d3jrjoSxFG @Iron_J3nny So delicious! @DrLingen That's next level star status! 😉🌟 @rekhalalaart Happy Tuesday! 😊🧡 @bettylmitchell8 We can't wait! 😊 @_meghanjc We love you too! @666satanicbaby We agree! 🎃😋 @chelseaohanuka Honesty is always the way to go! 😉🎃 @SamanthaSamfont It's that gourd love! 🎃 @_mxe88 Everyone listen to Miguel, he knows what's good! 😉 @_meghanjc You deserve all of the joy that comes with it! 🧡 @bettylmitchell8 A Pumpkin Spice Frappuccino® is a ghoul way to celebrate! 🎃 @xivnoe A warmed slice with a Pumpkin Cream Cold Brew is gourd joy! 🎃😊 @laurlandry We know the feeling! 🎃 @genneessis Pumpkin Spice Frappuccino® + Tuesdays = Perfection 😋🧡 @juansw0rld You're welcome! Amy's right, you'll get a $.10 discount when you use your reusable cup with us. 🙂 @juansw0rld You can bring in any cup, Tania! We want you to enjoy your favorite beverage in your favorite cup.  🙂 @jesslyn73167040 Sorry for any confusion. This is a fake offer and not valid at Starbucks. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp @beyond_elon Thanks for sharing this delicious drink! 😋 @GilliansReeves Absodragonlutely! ✨ @Swirvarelli We hope your day was filled with strawberry fun! 🙂 @estefanyxo_ We hope you got your glowing cup today! 😇 @KissesViaOJ_ We won't argue with that! 😉 @basantyagi We try so hard to make a meaningful connection in the social media age. And you just think we're a bot. But you also called us a babe, so... @basantyagi Now you're just hurting our feelings. 😞 @basantyagi Error 404 - having an existential crisis. Send more PSL. @___penelopem___ Inspired customization! 😋 @basantyagi Cheers to delicious firsts! We can't wait to hear how much you love it. @KarriJasmineTho It's a well-deserved cup! 🎃 @katie_rhatigan For the best experience of the beverage, we only offer tall and grande Nitro Cold Brew. With larger sizes, the Nitro cascade leaves the beverage before it can be consumed. @featherstonbill Happy birthday! Thanks for including us in the celebration! @anna__cairns Is it your new favorite? @reignofmaya Close. It's the beginning of the fall-iday drinks! 🍂 @KayleeNicolep We're happy to bring joy to your cup! 🧡 @80SHARBOUR But it you did, that would probably be one of them. 😉 @alexriley16 💚 @hennybuxaplenty Cheers to enjoying your fav cup of joy all year long! @2ndNatureQween We hope your Tuesday was filled with Pumpkin fun! 🎃🧡 @danisantos_xo We love it when you find a new fav! @juanluvsjew Here's to summer in a cup all year long! 🌞 @repoleanna Yeah, that just seems like a lot of effort. Check with Uber Eats to see if Starbucks Delivers has rolled into your neighborhood yet! @abenderr35 It will make you a beleafer! 🍂🎃 @WyrdOfWard If you just can't wait for the holidays, you can recapture the festive flavor of the Chestnut Praline Latte with a Caramel Latte made with blonde espresso and almondmilk. You can also add a pump of toffee nut syrup! @mel_plush We can't wait for you to try it! @yesenialagunas_ Hope to see you soon! 🎃 @NoorNahas1 Timing is everything. 🎃 @doodleswithmino We highkey agree! 😉🎃 @AddieTagg Sorry, we will not be offering a Halloween-themed Frappuccino® drink this year. @random_coder_1 Thanks for your suggestion, Michael! We hope you share this at https://t.co/FHAea75lZx for future consideration. @PhantomPearl22 Here's your gift: Caramel Ribbon Crunch is on our menu all year round! Happy Birthday 🎈🎉 @LaurenJo8 🎃 Yes, decorate your season! 🎃 @tommoftlawley 💚 @hermosaninaa https://t.co/MtvmYEaeLY @gundhamgarnet You've got to make up for lost time! Enjoy your PSL! @tommoftlawley https://t.co/zRip4vYgKB @cassiehertzel Peppermint syrup is always available! You can enjoy it all year long! @jacki1991 While we will not be offering a Halloween-themed Frappuccino® drink this year, you might enjoy one of our fall flavors like Salted Caramel Mocha and Pumpkin Spice! @tommoftlawley It will be available through fall as long as supplies last. @JannelChristy It's a delight in every bite! @lifewkenzie Thanks for sharing the Pumpkin Cream Cheese Muffin love, Kenzie! @tommoftlawley The last? Say it ain't so! @itsbrendaboo_ Pumpkin Spice Cold Foam + Cold Brew = A dream come true! @vegdumpling666 If only every problem were so delicious. @jesssfrance If this is something you would like to see, we encourage you to submit your suggestion at https://t.co/SPH9PuUUvR @qtpie_danik https://t.co/4TL08IKLUo @jadorebarbie Thanks for sharing your morning with us! @qtpie_danik We can't wait for you to give it a try! @MaMiizBoSS See you soon! @C_Slonaker Definitely! She's adorable. 😍 @mm_dot It will happen soon enough! If you just can't wait any longer, try a Caramel Ribbon Crunch with extra caramel! @ninarivera514 Five Starbucks Reserve locations in the U.S. have introduced oatmilk as their newest non-dairy milk.  Standalone Princi bakeries in Seattle, Chicago and New York will also offer oatmilk as a non-dairy milk at its coffee bars in the bakery. @kyleegranit It hits your taste buds in all the right places! @Principal_MWES In order to receive your Birthday Reward, you need to have earned at least one Star this year. If that’s the case, we’re happy to look into it for you. @hermosaninaa We hope that means we'll be seeing you soon! @tarynvan_ Roses are red,Violets are blue,Pumpkin Cream is sweet,And so is Cold Brew. 💚 @AndyyMedinaa Pumpkin spice season is pure bliss! 😊🧡🍂 @SofieAlsindy Hi, Sofia. Five Starbucks Reserve® locations in the U.S. introduced oatmilk as their newest non-dairy milk, this year. Standalone Princi™ bakeries in Seattle, Chicago and New York will also offer oatmilk as a non-dairy milk at its coffee bars in the bakery. @chandni_x You do you! 🙌 @RleenAlvarez Pumpkin Cream Muffin hooray! 🙌 @srslyjonea Soon! The holiday menu will be back before you know it. @sharjohn183 Days that start with Pumpkin Cream Cheese Muffins are always good ones! @literallymeg How about enjoying a new seasonal drink? We'll always have something interesting and delicious on our menu. @erynn_chloe Oh, that sounds great! Can we come too? 😂 @_jordann17 @Belluominidevin That's so sweet! 💐🎃 @AshleyGarlough Hang on, Ashley! Holiday beverages are just around the corner. @taraluisaaa That what we call real Pumpkin Spice motivation! @_loisalarcon Hi, Lois. Please use our store locator to find that nearest Pumpkin Spice Latte. 🧡🎃 https://t.co/acDQgAO8I5 @Milupitaaa_ Pumpkin Cream Cold Brew on our mind, too! @MeerNash The combination is like autumn magic! ✨🍂 @sarra_jpg Thanks for sharing this delicious twist! @_chitaaa That's what's gourd! 😉🎃 @TylorTylorr As a Rewards Member, you can have your birthday drink on us! Just join at least 7 days before your big day and make a purchase. You'll get an email a few days before reminding you of your birthday reward. https://t.co/Mmw8xdBOls @abbyelleen2 Happy Halloween! ✨ @ferdiberts This is a fake offer and not valid at Starbucks. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp or ask your Starbucks barista. @crystallinemean @shintsukitty @boyinIIuv This is not a valid Starbucks offer. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp or ask your Starbucks barista. @Taliyyaahh_ Hey T! We're sorry to hear that you're not feeling so great. We've heard that the Honey Citrus Mint Tea is helpful on days like these. Hope you feel better soon! 💚 @TylorTylorr Here's hoping that you got your perfect Monday Frappuccino®! 🧡 @saaratonin Sounds delish! @csmith0607 Hope to see you soon for your gourd sip! 🎃 @JoiTaniaSigers Cheers to you and your brewmate! 🎃 @roselynwaffles Pumpkin Spice has this way of putting things into brew-spective! 🎃 @abbyelleen2 All you needed was the right brew for you! 🎃 @ereesa1 Next time, we hope you'll make it a mother/daughter date! 💚 @IoIIipop Hope you're celebrating your recovery with your Frappuccino® soon! 🧡 @torilynncrain Everything happens for a reason, Tori! @Imsorudee We 💚 kind cups! @jerdinthegreat It's the Fall magic! ✨ @Dope4Pie When you know, you know! @kiaraarosarioo It was written in the stars that you would have an awesome day! Hope you enjoyed it. 💚 @inglewoodbeybee We've got a pumpkin with your name on it, Fatima! 🎃 @BenCowart21 Thanking you now! 😋🎃 @caseyr0b We already love you and truly enjoy being a part of your routine! 💚💚 @Cody_Barnes8b So, see you soon? 🤞 @elisanathalyy_ The feeling is mutual! @VaJadie_ It's a berry delicious sip! @DontTryToFixMe Sometimes all you need is a hug in a cup and we're glad you enjoyed that today. 🧡 @QuantumComplex HI Morgan, we're sorry that you weren't able to redeem your Rewards. Not all of the licensed locations choose to participate in Starbucks Rewards. We hope you get a chance to stop by a company-owned, stand-alone location to enjoy your stars. @bxdgvless Don't worry, there's lots of fun to look forward to! 🙂 @wowwhatageek Cheers to Mocha Monday! 🎉 @eduardomesck You said it! 💚😋 @krohrss You tell them, Kacie! It's a delish bite! @kiarasuntrice It is the perfect sip for fall, so we completely understand! @CtrlAltRockYSU Many peopl are enjoying a White Chocolate Mocha Frappuccino® with Mocha sauce at the bottom of the cup and Strawberry puree drizzled on top! @_ayemrcarter That's awesome to hear! Cheers to good days and good sips. 🧡 @georgiacarney_ Enjoy your gourd life! 🙂🎃 @SaltpeterJohn Hopefully your brain remembers all the words now that you got your hands on the PSL. 😉 @Gio_Alfonzo2 It's the pick of the crop! 🎃😉 @_ajm_7 It's delicious down to the last bite! 😋 @CtrlAltRockYSU While we will not be offering a Halloween-themed Frappuccino® drink this year, you might enjoy one of our fall flavors like Salted Caramel Mocha and Pumpkin Spice! @caseyr0b We couldn't agree more! @ybthelurk So we'll see you soon? 🤞 @evan5159 Drinks are better when they are pink. 😉 @honeywater___ That first sip feeling is putting in work! @thetiarathomas It's so good with the Pumpkin Scone! 😋 @sweettea1415 Come by and hang with us! @LittleLeighXoxo Mondays are always better with your favorite drink! @amdavidson7106 We love putting you on cloud 9, Megs! ☁️💚 @majesticmesha Pumpkin Cream Cold Brew is one of fall's best drinks! @Reem_Hussein_ 💚 @HUmlaufova We're glad you loved your first PSL! 💚 @JessicaDawn_ox 💚💚💚 @elaizadungao Of course, it does! https://t.co/bOquwGfJQp @briannaaaaaaaa3 Aww! We try our best to bring you the best, Brianna. 💚 @shanchez96 We love you too! 💚 @morgaan_youngg Everyone, listen up!  A gourd friend is speaking. 😉🎃 @shanchez96 Sometimes the best drinks are created by accident! @_ayemrcarter We hope your day is getting better! 🙂 @wowwhatageek Sounds like a plan! Which one will you enjoy? @insomnia_cityB Have you tried our Nitro Cold Brew with sugar-free Vanilla? @KovalchekxPF You're welcome a latte. 😉 @KovalchekxPF Sounds like an Egg+ to us. @okaykah10 Which post gym treat are we putting your name on? @hannahestrella_ A warm chocolaty treat can be a real game changer. 😋 @cassidygatlin We already do! https://t.co/beZkySv4Kt. @dmart925s Berry delicious, indeed. 😉 @emodog420 Which one is your favorite bite? 🤔 @l0nzz Anything for you. 💚 @AlexiaRPaul1 It's that first sip feeling putting in work. 💪 @simonetyson17 You're welcome! @ftrhfh We found a Pumpkin Spice match! https://t.co/eitxHWqUCW @dionnewinn We love it when there's tasty changes in our life! @ax3andm So much yum! 🎃 @cumps_lana It makes our day to get to sip with you! @simonetyson17 😏 https://t.co/ZFmV6n50Ef. @Mackenzie832 You tell them Mackenzie! @l0nzz It's a bite that can get your through anything! @rmdeleonm Sounds like a keeper to us. 🎃💚 @amorpahas There's no love like gourd love! 🧡 @EvaTortora Mmm, we like the way you think! We hope you'll share your suggestion at https://t.co/FHAea75lZx. 🙂 @MrsDtweets13 Well that's no fun! Hopefully you could enjoy your PSL party this afternoon.  🎃🧡 @SqueeDeeLee Pumpkin Spice Latte or Salted Caramel Mocha, it's all getting us movin’ and groovin’ and sippin’. @ereesa1 We're all for helping a friend but that's a hard sell. 😉 @kurtcovanak And you deserve it all! 🎃😉 @lor_bear We know our friends! 😉 @DOGAMUSPRIME Fall mornings deserve a little pumpkin spice! 🎃🍂 @stephani_tor It's hard to keep it to ourselves too, Steph! 😉🎃 @futoshijapanese You could always bring Starbucks VIA® Instant on your space journey. 😉 Movin’ and groovin’ and sippin’. 🕺🏼#PumpkinSpiceLatte https://t.co/5waxul1kQ0 @chriscapuana Thank you Chris, can you try using this link to connect with us @Starbuckshelp? https://t.co/6ZbXmejw3U -Kevin @xonyshai Pumpkin Spice Latte is a gourd move! https://t.co/IDH8uqWZsK @fantabbilous Here's to the brewleafers! 🎃🍂 @Fabfabiola_ The feeling is mutual! @JessicaDawn_ox Aww! Wishing you a speedy recovery and that delicious drink. @TwoPeasOnAPod Genius! 🙌 @TheeOriginalJi Yes, PSLease! @AvionLukas We love it! Lots of wonderful fall vibes in it. 🧡 @Jeff_OnYaTL PSL always brings out the fall spirit in us! ✨🎃✨ @ftrhfh Is it really fall without a Pumpkin Spice Latte? 🧡🎃☕ @pinksilkcherub Gotta have that Pumpkin Spice Frappuccino® drink to start off the week, right? @miss_liss52 Way to kick off that Monday morning! @witchbev Cheers to starting a new week with new things! @thuyvyyn That's tasty knowledge! 😋 @9_bri Pumpkin Cream Cheese Muffin for the win! @eezlvc @lifeofcrystaal What a fun day! We love the pics. @smithre11 You should try it. It's amazing! @ellieuhh 💚🎶☕ @izzydjh YAY! Welcome to the Pumpkin Spice fandom. @RDose31 We couldn't agree more! https://t.co/pjLmcFsY4k @itsjustkenz_ Thanks for sharing the Caramel Apple Spice love! @PilumxMurialis It's a yummy classic! Try it iced if you prefer iced drinks. @missmeliii This warms our heart! 💚 @bethhsanchezz Thanks for the gourd review! 🎃 @PeacefulNY Sorry no but some customers have been enjoying a White Chocolate Mocha Frappuccino with Mocha sauce at the bottom of the cup and Strawberry puree drizzled on top! @karinamariax Magical! 🎃✨ @LizzieR1717 We've got a pumpkin with your name on it! 🎃🧡 @JVTWILLIE We know our friends! 😉 @__haylieann In the place where the kindest and the bravest live? 😉🧡 @JVTWILLIE Love a good cup on a Sunday evening too! 😉 @SonyP11 In other words, you're pretty committed to the gourd life! 🎃🧡 @halosnewpage We love 'em all! Right now  we're enjoying the Pumpkin Cream Cold Brew ...what's yours? @JazzyFe_ It's an awesome way to enjoy your season! 🎃🍂 @GuNMouTH We appreciate you sharing your concerns. Currently, when you pay using your app, you're able to leave a tip for your barista. We'd love for you to leave your feedback and suggestions at https://t.co/FHAea75lZx for future consideration. Thanks! @WillieshWshelby Gourd thinking! 🎃 @drhollymcgee Don't worry,  Dr. McGee! We'll be rolling out nationwide in 2020. 🙂 @xocojo 😋🎃✨ @KenzieJMeyer 🧡 @kimx360 Yes, PSLease! https://t.co/yBwrUzkGRx @deisy00molina Hope you're enjoying a PSL so you can brag about your productive day with your pumpkin! 😉🎃 @push4awarning Kudos to you for your good work and a well-deserved treat! 🧡 @xocojo Especially when paired with a warm slice of Pumpkin Bread! @LizaManangan https://t.co/4GqYQrkdMl @SerendipityWAF It's not possible to be too excited for Pumpkin Cream Cold Brew! Save some for later and enjoy every last drop. @LizaManangan Cheers to the delicious first taste of fall! @KenzieJMeyer You deserve every cup! 🙂🎃 @RKloveJets You're welcome! @Mgnxkiwi Cheers to many more happy years together. 💚 @lyea09 They're gourd to the last drop of fall! Enjoy! @snslagle All remaining cups have been sent to stores, so we recommend checking with your local store. Please note that if they have sold out, they will not be receiving another shipment. @RKloveJets We're excited and happy for you! They're amazing! @a1andreina It hits your taste buds in all the right places! @drhollymcgee We may not have you running through the streets but with Uber Eats you can have your favorite treat delivered! Just download the Uber Eats app and order your drink today. 🙂 @DAhoodsFavorite We do! Just ask your barista for cream cheese when you stop by for your item. 🙂 @jillyperi We hope to hang with you soon! 🎃 @abbygnz That's gourd living! 🎃 @melpz Glad you love it! @Brookes_HotMom Perfection! 😋 @G0Dis_AWoman Pumpkin bliss! 🎃🧡 @HotSauce_Honey Thanks for keeping the kindness going! @thechronoshow Life can be just as good in 2019. Slurp up the deliciousness to your heart's content. @cleoslife Gourd idea! https://t.co/uAkOylb0cc @catalinapaige It's a gourd-geous work of art! @dez_schwartz Another glorious tradition...makes us sip! 🔮 @paumeeaparis All remaining cups have been sent to stores, so we recommend checking with your local store on availability. Please note that if they have sold out, they will not be receiving another shipment. @Roo_Bvurere https://t.co/aB5ZE2H7x7 @ellieuhh Great music and good coffee pair well! @leonavengeance Two perfect companions for the fall season! @waited_everlong We love celebrating the fall season! 🎃🍂 @pinkx03o We'll always have delicious seasonal drinks for you to enjoy, Briana! @hannah__boothe Pumpkin Cream Cold Brew has that power! 💚☕ @madsterss Aww! We love you. 💚 @LynPhoenyx We're always open to suggestions at https://t.co/SPH9PuUUvR. Thank you! @annapsaras Cheers to all you delicious dreams coming true! @incubusetta93 🧡🍂☕ @maddienshortt Thanks for that perfect sip score! @musicfreak4589 YES! Starbucks Delivers is currently available in Boston, Chicago, Dallas, Houston, Los Angeles, Miami, New York City, Orange County, San Francisco, Seattle and Washington DC. That said, we’re rolling it out nationwide in early 2020. @lindzzx33 Absolutely! Your barista will be happy to grind your Starbucks coffee beans for you. @izzydjh 🙌🙌 @LynPhoenyx Hi, April. It didn't change. You cannot pay the difference for merchandise over $20 when using your Reward. @izzydjh We're thrilled you love it! @claud__jennings It's tastes like an even better idea! @Kheabett We hope that means we'll be seeing you soon! @izzydjh Woohoo! Let us know how you like it once you've tried it. @AqhaDreamTeam How about an Iced Vanilla Latte, Cold Foam Cold Brew, Cinnamon Dolce Latte or one of our yummy Frappuccino® drinks? @InSevWeTrust May that Pumpkin Cream Cheese Muffin make its way to you soon! @lattesnlittles Happy Sunday morning! 🧡🎃☕ @_xoJORDANxo_ Sorry, PSL. Pumpkin Cream Cold Brew is the new ⭐! @Tpoland12 😮 https://t.co/vhnPbUCFTS @cosmolicious We did? Yes, we did! 🙌 @knighvely You just made our day, too! 💚 @Taylor_Terrell Aww! The Pumpkin Cream Cold Brew is definitely one of our favorites, too. @FredsDaily Cheers to trying new things! @knighvely We hear you! @ItsMePattii Anything is possible! Please submit your suggestion at https://t.co/SPH9PuUUvR. Thank you. @uremine_angel We'll have that Pumpkin Spice Latte ready for you! 💚 @_Aryxz_ Go for it! We think you'll love it. @gallaspy_alex Sounds like it's time to stop stressing and start sipping! @muckentgrad We love it! @incubusetta93 Enjoy! The fall flavors are only here for a few more weeks. @ZarifAli9 We'd love to hear your suggestion at https://t.co/SPH9PuUUvR! @glambyaimee Same! 😊 @cicaly_ Embrace the pumpkin spice love! 🧡🎃 @tisthepod We've got you! @MarceeleeWin Enjoy the delight of delicious fall beverages, Marcee! @tht1tayy YES! @JeimarsonP Enjoy it all! @Boss_E_Brit Happy Saturday! 💚 @ShulayChusan You're a gourd person! 😉🧡 @maddiethefool Okay but we agree! 😉 @Seven16 Awesome! @queeenju Truth! 🎃 @aroxyamory YAY! 🍎💚 @__MissMonique__ We're happy you had something gourd today! @GuNMouTH We're still loving the boldly spiced brew this season but we hope you stay tuned! @lejocey Glad you're enjoying it! 🙂 @GeekyBowtie Everything you deserve! 🎃 @GuNMouTH Have you found your favorite Fall drink? @healthpro49 Enjoy! 🎃 @ObviousLacking Don't let the weather stop you from enjoying your season! 🧡 @YslLinda Pumpkin Cream Cold Brew +  Fall =  All the Feels! 🧡😊 @Sincerely_Yuli This warms our heart! 💚 @iviejoshua https://t.co/fPzg9XbbpZ @aroxyamory Allison, we got you! Our Caramel Apple Spice is just right for your season.  https://t.co/uf1wkMy02h @amberxmarie21 It will only be around for a little while but you'll always have something awesome to enjoy! @amberxmarie21 Would you say we're squashing it this season?  😉🎃 @chronos2g Yes, our hot chocolate is considered handcrafted. @unrulyjada A delicious reminder that you can enjoy summer any time of the year! 😎 @givemethelewt The spice of the season! 🎃 @eilanig It's still on our menu and is around all year long! @karensayshello We love that you love it! @da4nyy Yes! We’re partnering with Uber Eats to bring you your favorite Starbucks treats. Simply download the Uber Eats app to order Starbucks delivery today! @CarolineKeller We've got your back! @justhatspark It makes our fall quite tasty, actually! @tht1tayy Is it the Cold Brew? Is it the Pumpkin Spice Cold Foam? We think it's the perfect combination of both! @karensayshello Welcome to the delicious world of Pumpkin Cream Cold Brew! @elenaaaaaaa88 It's love at first sip! @e_reedy Join the pumpkin spice delight! @hydrotroop91 Absolutely! 💚 @msmorganjarrett Aww! That just made our day, too. @getfitmandy We totally agree! @samanthamenaa The best way to start your day is by speaking your brewth! 😉🎃 @_CLASSYK Hey K, you can earn more stars by participating in our bonus star challenges! Lookout for emails and stay tuned to your app for notifications. You can learn more about rewards here: https://t.co/8B9TVwBBJH. @handsomesnacc It can be surprisingly yummy but, have you tried it as Pumpkin Spice Creme Frappuccino® drink? YUM! @yaaagirljen So you don't hate ALL pumpkin drinks. 😉🎃 @adnama_jean It's just all those fall flavors hitting your taste buds! 😋 @aramisx Cheers to the weekend! https://t.co/y1NdcFjJq9 @Toktokte 💚 @madisonwetzel1 She needs coffee asap, friends. ASAP. Finger's crossed your friends come through soon! @Mega_Mew You deserve that compliment! Our lips are sealed about where the goodness may have come from. 😉 @golden1ne We're still super in to fall, but we can let you know once we have winter on the brain. If you want? @ahhhhitsmemike We do it all for you. 💚 @shanTHEshannn We can't wait to see you! @ahhhhitsmemike It's certainly a heavenly bite of fall. 😋 @SteamForeverFan Congratulations! 🎉 @AccidentalAstro The whoa is happy to assist in getting all your creative vibes going. 😋 @taymad1998 Mic. Drop. 🎤 @ninabenitich You tell them! @damndee__ Does that mean you love it a latte? 😉 @jokersfangirl13 Loving that you have a favorite fall drink! 💚 @niksancheta Yummy down to the last bite! @Toktokte That first sip feeling doesn't play any games. 😋 @golden1ne Anything for you! 😋 @glambyaimee Soon! ❄🎄 @lumosbxrnes Strawless lid, doo doo doo doo doo doo! 🎶 @lunar_spirits Congrats! Fall just go a little better. 🍂 @allshewhispers ... Did you just find the cure for the zombie apocalypse? @KahtaZK They are berry delicious. 😋 @Ambrosegal88 We're glad it gave you all the fall feels. 🍁🎃 @bosiebadazz https://t.co/FFhEWXTFxP @el5500 Always happy to make that perfect drink for you. 💚 @itzel19607777 Honestly, it is perfect to wake up to. @MiggiShock https://t.co/8DubiFHfRD @icamilapetrucci Perfect example of rise and shine right here. @MullerNmuller We love you too! 💚 @VortexGamer4119 You're out of bed! That's the hardest part, honestly. @maye_leee Breakfast of champs. 🏆 @SierraUrrutia1 That first sip feeling putting in work. 💪 @BexKrumm We see what you did there. 😏 @adri_baiz https://t.co/27v5UtbILT @ColinGardiner It's a brew-tiful choice for a warmer day. 😉 @Fabfabiola_ We'll toast our Pumpkin Cream Cold Brew to that. 😋 @Jojoe1953 It was tea-rific to sip with you! @Makaria_Dark We don't think so either. 😉 @DejaAriel We're happy to see you again! Enjoy your PSL. 😋 @lipsticknthangs You haven't missed them yet, Anna! @RuthSolo2u We couldn't agree more. 😋 @justkaylabayla 🎉🎉 @Makaria_Dark Is there really any other way, Makaria? @aeemili Enjoy every drop! @paulapg50 Enjoy the little things is rule number 11, so we think you made the right choice. 😉 @ImmortalxKiss We'll see you then! @mxporshe You just had to pick the right pumpkin! 🎃 @andyydreww Guess we have a standing date, Andrew! @vnxsoo Happy to hear it! We forgot to mention our Chai Crème Frappuccino® that we think you'd love. Hope you stop by soon to give it a try. 🙂 @BreyCommentator We always want you to feel like you're at home, friend! Thanks for hanging with us. 🧡 @kellybingham Glad you found your new fave! You should try it with a few pumps of Pumpkin Spice the next time you stop by. 🙂 @KylleReece How will you reward yourself? @vnxsoo We don't have frozen tea on our menu but you can always ask your barista to customize your drink! @jesssicag0n Hope you decided to stop by! @smolinsun Let the Fall festivities begin! 🎃 @Since98__ Hope you stop by soon! 💚 @lamperouges 🍂 All you're missing is a pile of crunchy leaves to jump in!🍂 @iWIC3 At this time, this can't be done on the mobile app but it's on our radar! In the meantime, we'd be happy to serve your beverage in your reusable cup when you stop by. @yalissaco Gourd pick! 🎃🍂 @cailingore Gourd! 😉 @YahMauricio Awesome! 💚 RT @Kevin_Johnson: 5 years ago, @starbucks and @ASU teamed up to provide @starbucksprtnrs like Kyle an opportunity to earn their bachelor’s… @MrsFaithSJH Sorry, they are not returning this year. @cailingore New Fall favorite? 🎃 @khugs14 Your barista is always happy to accommodate a request for light or no ice when you place your order. If you are ever unhappy with your drink please let your barista know so they can make it right. @YahMauricio See you soon? @sierrangragg We know you love the Pumpkin Cream Cold Brew but there will always be something wonderful for you to enjoy, Sierra! 💚 @its__syana That's awesome! We'd love for you to check out our careers page at https://t.co/Nmy9TG2EWb for partner opportunities. 🙂 @hopcrossbun https://t.co/nNxEytXIlo @_chitaaa @Megnasty17 Sometimes you have to switch it up! 🎃 @its__syana It's definitely delightful! 🍂 @Makeupbyvahness The Pumpkin Cream Cold Brew will only be around for the season but now you know the wonder-fall possi-brew-lities of coffee so stay tuned! 😉🧡 @PotterChick2818 The pumpkins will not be rushed! If you just can't wait for the snow to fall, try a Caramel Macchiato made with blonde espresso and extra caramel sauce. @broskimarcella https://t.co/VeJuTsY0fa @jerrrrrrxo The slow steep time limits the amount we can make daily, so it’s only available while supplies last. We’d recommend getting to your store extra early! @teena_thach Shining so bright we need some shades! 😎 @jamwsgraham Happy to hear it, Jessica! 🎃🍂 @Natalieekb You can totally do vanilla syrup with mocha drizzle or raspberry syrup with white mocha drizzle or .... SO MANY OPTIONS! @RunReadBeAFan It's a perfectly delicious day to Reward yourself! ⭐🍪 @callherrisha Oh Riiiisha! 🎃 @SpaldingLauren Five Starbucks Reserve locations in the U.S. have introduced oatmilk as their newest non-dairy milk.  Standalone Princi bakeries in Seattle, Chicago and New York will also offer oatmilk as a non-dairy milk at its coffee bars in the bakery. @jc_rutte Don't rush the seasons! The leaves are still falling, we're not ready for snow! If you just can't wait, put the shovel away and pick up a Caramel Macchiato made with blonde espresso and extra caramel sauce. @jerrrrrrxo Apologies for the inconvenience! Due to the brewing process, we’re only able to make a limited amount each day. @MsVoodooo Let's get you started earning those delicious Rewards! https://t.co/ja8W7A9v5x @hopcrossbun Welcome to the Pumpkin Spice Life. https://t.co/o51kWy4AeZ @katiiewall It's Friday. Salted Caramel Mocha is mandatory. 😎 @gianny_irl There's no argument. https://t.co/cpmmQ89yFz @jtknowles Hi John, the standard build of the Venti Flat White includes 3 espresso shots. You can always view the build of your beverages using the mobile app. https://t.co/uVyzBcopkm @laurieschh It is a good day to have a good day! @beckercomedy We got you! 😉 @ch1llandp1ll Our hearts!!! @fe8lss We're counting down the seconds! @Natalieekb We can sub any of the syrup and sauces to make you the perfect Macchiato AND we can do it in the app too! What flavors are you leaning towards? @TheEvelhoch You know how to wake up! @_jessica_mtz_ The important questions! 😉🎃 @rynedutcher That's the way we do a Friday! Cheers! @lizzystar0010 We spy a beautiful Red Cup!!! @_isayuh Welcome, friend. https://t.co/20zHHDojxj @KylieNoels It's a delicious way to start your day! https://t.co/WrV36aDOjT @ItsAmandaDe Join the PSL party, Amanda! https://t.co/glsd7dLpuc @sianybrianne Say less. Sip more! 💚 @armchairchef Cheers to PSL season! 🎃🍂 @carmenazgl We love speaking your language. 😉 @mallory_janae More like a dream come true! 😋 @nyah281 Does that mean we'll be hanging out soon? 🤞 @amberroseoatman We got your back! @mailideianira We completely agree! 😋 @kenzietraylor00 Awe thanks! We're glad you love it! @durkvader Hurry, hurry! @sianybrianne Check Uber Eats to see if Starbucks Delivers has rolled into your neighborhood yet! @LiveLoveLupus The leaves are still falling. Look for your holiday favorites closer to when the snow falls! If you just can't wait, try a Caramel Macchiato made with blonde espresso and extra caramel sauce. @dj_jcee Mic. Drop. 🎤 @GingiesMom Anything for you. 💚 @maile_sierra Confirmed! We are friends. 💚 @lauren_lee_608 Whew! We were worried for you there. Glad you're sip is safe! @dogismygod9 It is best enjoyed as a hot beverage, but your baristas will always be happy to help you find the perfect beverage to love! @NatTheSquirrel We don't negotiate with squirrels... 😂 @willyjflow The most beautiful words we've ever heard. 💚 @faiirygirl Don't make it 19 days. C'mon in and step up your pumpkin game! 🎃 @gIitterize It's the perfect way to get all those fall flavors in you at home cup! @JoMaMa85 Please? @NoahMiller33 Oh come on now! It's a beautiful day to make things happen! @duanasar And you! @monbebeorbit This is not a valid Starbucks offer, and this screenshot is fake. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to our customer care line, or ask your Starbucks barista. @gabyaguilar1 You know it! Happy Friday!!! @faiirygirl Perhaps a Pumpkin Cream Cold Brew and a Pumpkin Scone? @heyyy_katie If you just can't wait, try a Caramel Macchiato made with blonde espresso and extra caramel sauce! @mgressmen Italian Roast is inspiration personified! It's impossible not to be inspired by its beauty. @CrocsAndCrops If it's $20 or less, it can be yours for 400 Stars! ⭐ @Cover_GrL Espresso. ☕ @lilwildflowerss Perfect Friday! @faiirygirl We can help you with that. 😉🎃 @lgbtkoo This is a fake offer and not valid at Starbucks. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to our customer care line, or to ask your Starbucks barista. @colorskoo This is a fake offer and not valid at Starbucks. To confirm any Starbucks promotion, you can check your Starbucks app, reach out @StarbucksHelp, or to ask your Starbucks barista. @kiwiHaseul This is a fake offer and not valid at Starbucks. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to our customer care line, or to ask your Starbucks barista. @loonanese This is a fake offer and not valid at Starbucks. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to our customer care line, or to ask your Starbucks barista. @Iunasj This is not a valid Starbucks offer, and this screenshot is fake. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to our customer care line, or ask your Starbucks barista. @uwumilf This is not a valid Starbucks offer, and this screenshot is fake. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to our customer care line, or ask your Starbucks barista. @MlazosSmith We're ready if you're ready! @MoneyMar1980 Ahhh, that was sweet. Thank you! @GizmoduckFan Hello, hello, hello!!! @laurenperryy It's gonna be a good, good day! @LoSchlimm She's up! Friday here she comes!!! @LexoExo2 We see you drooling! Enjoy! @Backstreetsmac Agreed! @maile_sierra We knew you'd get us! @GingiesMom Coming right up! @DannyPags See you soon then! @bbghoulll Lorelai knows the truth. @maile_sierra Honestly, it's too perfect not to. @lauren_lee_608 Protect that sip before the curious cat boops it! @ImmortalxKiss Cheers to the weekend! @ace_lucci2x Sounds like you're well on your way to a perfectly peaceful Friday! Having the day off helps. 😉 @CatlinJones3 We'll put your name on it. @bananairis Happy Friday! Thanks for sharing your morning with us! @itskindabreezii We can't tell you our secrets yet! @KristenEckman We wouldn't expect an apology for showing how much you love the Pumpkin Cream Cold Brew, although it would definitely taste better in a cup! 😉 @MikaJoi_ Starting off Fri-YAY the right way! ☕💚 @sheiceeeey_ Let's do it! @nakotendo Thanks for asking! This is a fake offer and not valid at Starbucks. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to our customer care line, or to ask your Starbucks barista. @ellliphant Your hair matching your shirt and pairing with that sip. Looks like you're kicking off Friday right! 😍 @Arlene921 We got you! @HawkEmilee Cheers to FRIDAY!!! @pandigirl GOOD MORNING!!! @giraffe_boy Sorry, no. The next Happy Hour is on October 24th. We'll see you next week! @DMCohen01 Enjoy that first sip feeling! 🍁💚 @chrmarlio Oh you're sparkly, girl. 💚 @Backstreetsmac It's the perfect way to start the day, really. 😋 @PhattyPatty08 We can't wait to see you! @sparklysupermom You're always sparkly to us. ✨ @thebakinggal What'cha waiting for? Go get one! @SincerelyScarOH Ahhh yeah. @nwa517 Goodness where's our shades!?! @Cocoalicious2U Cheers! Let's make this Friday amazing! @HerseyChris Come on, sleepyhead! You can do it! @bromar6 Yes, let's! @popjoon_ This is not a valid Starbucks offer. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp, or ask your Starbucks barista. @spermiess This is not a valid Starbucks offer. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp, or ask your Starbucks barista. @capricanunot You seeeeee us. 😉 @deeog_ You bet. Check out Starbucks Rewards. 😊 You'll earn Stars towards free Rewards like coffee, food, and merchandise! https://t.co/BgsoNsCSt5 @GeraldApostol Cool shades. 😎 @ChanceButterfi1 Ideal! 🙌 @JenniferNOTJeny On its way! @jojaaaaang Us every morning now. @averagejaybx Happy Friday! @Huxleypiguk Let's be honest, sometimes we need someone to tell us to rise and shine in the afternoon, too! 😴 @JenniferNOTJeny Ok, but then we've gotta start the day! @RtheG Happy to support you! @phexaryl Funny you mention that! Starbucks Delivers is currently available in Boston, Chicago, Dallas, Houston, Los Angeles, Miami, New York City, Orange County, San Francisco, Seattle and Washington DC. That said, we’re rolling it out nationwide in early 2020! @Rave_Turtle_ Save this \"Rise and shine\" for tomorrow then! We'll focus on the West Coasters here in the US for now. 😊 @brandonmejia20 Nothing like that first sip to wake you up! @Rave_Turtle_ You're ready to take on the day! 🙌 @jessviolett We're waking you up peacefully. 😊(If you weren't awake already.) @angel_lorrice Hello! @nikkikettle3 And we'll always be here! Pike Place, coming right up! @carlegdell2 [Insert coffee time dance!] 🕺💃 @davidbrunelle It's early, we know, but it's Friday! 👏 @clipsthenerd Coming right up! @nicolesid Have a WONDERFUL day! ❤️ @MerIotttt Ok. Five more minutes, but then we've gotta get moving. @ChanceButterfi1 Best way to kick off the day! What's your go-to order? @TheNatalieS We wish we could! If it's not available near you yet, look out for Starbucks Delivers through Uber Eats coming in early 2020. 🙌 @xxtra_bratty Mmm we second this! 😍 @MikeMades Awe, thanks Michael. Can't wait to hang out with you again! @Demdooma That was beautiful! 🙌 See you in a bit! @Faalto_engineer And you're up! ☕️ @JaackLilley We wanted to wake everyone up peacefully. 💞 @radioheadfloyd Have a great day! @zoe_hal012 Good morning! ☕️ @futoshijapanese See you soon? @alarabofficial We love you. 💚 @Backpackjohn1 Cheers to Friday! @yass_coro Good day to you! @mrrlittle 🥰💚 Rise and shine. 🎶☕️💚 @mstevens59 Happy Fri-YAY! It was great seeing you! @Prince37173846 Good question. This is a fake offer and not valid at Starbucks. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to our customer care line, or to ask your Starbucks barista. @Mybatboys This drink is already caffeine free! Check it out: https://t.co/eCpUu0tHvz. @mrnzz0 We would never mess around with a drink that embodies everything we love about fall. 🎃🍁😋 @rosextrd So, we'll be seeing you soon? 🤞 @taygoffner Sounds like you already know how to apply if you want to come back! Just in case though, here's the link 👉 https://t.co/iDE99hMcaI. @haekz Great question. This is a fake offer and not valid at Starbucks. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp (or us like you did), or to ask your Starbucks barista. @rawrxrandilynn We certainly will! ⭐ @taygoffner We're glad you love it! We do it all for you. 💚 @mrrlittle Delish down to the last bite. 😋 @theresaalopez We'd knew you'd understand! @11Nayeon Hi. This is not a valid Starbucks offer. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp, or ask your Starbucks barista. @skeploona Hi. This is not a valid Starbucks offer. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp, or ask your Starbucks barista. @heizefine Hi. This is not a valid Starbucks offer. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp, or ask your Starbucks barista. @monster_v1bes Hi, no. This is not a valid Starbucks offer. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp, or ask your Starbucks barista. @bluebettasoul Hi. This is not a valid Starbucks offer. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp, or ask your Starbucks barista. @totokiAlD Hi. This is not a valid Starbucks offer. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp, or ask your Starbucks barista. @HArtSEUL Hi. This is not a valid Starbucks offer. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp, or ask your Starbucks barista. @baeb_vv Hi. This is not a valid Starbucks offer. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp, or ask your Starbucks barista. @sanrioyoongi Hi. This is not a valid Starbucks offer. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp, or ask your Starbucks barista. @abrazzell03 Hi Ari, yes the birthday reward is still valid as long as you're a Rewards Member and you've made a purchase with your Rewards card within the 12 months before your birthday. You'll get an email a few days before to remind you to look out for your reward. @PassportCarlton Just what the season calls for! Hope you enjoyed your PSL. 🎃 @egxists This is not a valid Starbucks offer. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp, or ask your Starbucks barista. @heelipves This is not a valid Starbucks offer. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp, or ask your Starbucks barista. @jin6ouI This is a fake offer and not valid at Starbucks. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp], or ask your Starbucks barista. @loonathearmy This is a fake offer and not valid at Starbucks. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp, or ask your Starbucks barista. @VulpixGood We hope you get to stop by and celebrate the life of your gourd friend! @sabitofan This is a fake offer and not valid at Starbucks. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp, or ask your Starbucks barista. @polteageist This is a fake offer and not valid at Starbucks. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp], or ask your Starbucks barista. @Aeternox This is a fake offer and not valid at Starbucks. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp, or ask your Starbucks barista. @caldopapi This is a fake offer and not valid at Starbucks. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to @StarbucksHelp], or ask your Starbucks barista. @VulpixGood Did it get squashed? @doordecorby Nope, you can have Fall in your cup all year! 🍂 @doordecorby Thanks for sharing this delicious Fall treat! 😋🍎 @mamakarwa It will be around while supplies last but there's always something wonderful on our menu to love! @stewartslarson When you're right, you're right! @atinitzagustd We can't think of a better way to celebrate the season! 🍂 @synaec We totally get it! 😋🎃 @JuliaSamudio420 It's apple-licious! We can't wait to hear how much you love it. @JuliaSamudio420 Have you tried our Caramel Apple Spice? https://t.co/UGwxY6OGa9 @loonaslesbian This is not a valid Starbucks offer, and this screenshot is fake. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to our customer care line, or ask your Starbucks barista. @psiodyne This is a fake offer and not valid at Starbucks. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to our customer care line, or to ask your Starbucks barista. @hyungwon1e This is a fake offer and not valid at Starbucks. To confirm any Starbucks promotion, you can check your Starbucks app, reach out to our customer care line, or to ask your Starbucks barista. Thank you. @zoealexa5 Maybe someone just needs to get the conversation started. 😉 @toungtiedd Enjoy every fantastic sip! @AarikaFriebs We love it when you fall for a new favorite! @_viv_perez It's an explosion of fall flavor! @RachitaTX 💍🥰 @RachitaTX It's true! You can enjoy a sip of Mocha Cookie Crumble heaven all year as part of our regular menu! @bstarr17 Happy birthday! Thanks for sharing your special day with us! 🥳 @megaansaample If you just can't wait for the holidays, you can recapture the festive flavor of the Chestnut Praline Latte with a Caramel Latte made with blonde espresso and almondmilk. You can also add a pump of toffee nut syrup! @hiatuspeyote Sounds delish! @taylorejanae_ Yum! 😋 @heylilangel Is it later yet? Looking forward to your visit! @doingalrhye Hope you're enjoying every sip! @andrelamere We love road trips! Thanks for bringing us along! @Skippy9474 Can't wait to see you! @shiestiee Sharing is caring! 🎃 @xmichaelraymond Thanks Michael! 😊 @doingalrhye See you soon! @derekspalla We couldn't agree more! 😋 @instantphoebe We'll keep you in the loop Pheobe either on our social pages, in your email, or on the app! Happy Hour is next week! We'll see you there. @AlyssaMaira_ Your favorite sip with your favorite smell at your favorite place. Sounds wonder-fall. 🍁🎃💚 @kate_amico We look forward to sipping with you when you're ready to leave your comfy bed (or seeing the person who brings you a Pumpkin Cream Cold Brew). 💚 @aries_mama Absolutely! 💚 @aries_mama The whoa helping you get an A+! @_Jeessicaaaa They are definitely egg-cellent! @Kourttneex3 💚 @CesilyAMeyer Agreed! So yummy. 😋 @derekspalla Those tiny bubbles are putting in work! @maddieeeee99 Cheers to enjoying amazing sips! @notacatladyyet Happy Hour is next week! We'll see you there. @debbiestwinn The feeling is mutual! 💚 @DayloDeer Some mornings are. 💚 @jlorenss1 We couldn't agree more! @sendingtots They might be Maria! Starbucks that are inside other retailers (like Target) are licensed stores and can run the Rewards slightly different than the company-owned (stand-alone) stores. We suggest having a chat with your local store to see how they participate in Rewards. @maddieeeee99 You can enjoy that Snickerdoodle flavor any time when you order a White Hot Chocolate with cinnamon dolce syrup and cinnamon dolce topping! @Kourttneex3 Nothing like sipping your fave with a pup! @Jaclyn311 We can't wait! @mrs_polito It's that first sip feeling putting in work! @Chopper_Shaggy Are you full yet? 😉 @_Txshv_ Accidental new favorites are the best! @JesSunny It's an egg-cellent bite, for sure! @Bretteeee We couldn't agree more! @auryyyscott2000 Definitely a delicious bite! 😋 @Young_Cheeky They are berry good! 😉 @nvfisa Egg-cellent breakfast sandwich choice! @solflowerr Awe, thanks! We do it all for you. 💚 @xoxo_ceciliaa We couldn't agree more! @__mtxo Sounds delish! Thanks for the suggestion! Anything is possible if you submit it to https://t.co/SPH9PuUUvR RT @kythejedi: Pumpkin spice lattes are great and all, but I think we as a culture are severely under valuing the power of the salted caram… @JadoreSiwoh We knew you'd feel the same. 😊 @mthays10 We are wonder-fall! How are you doing, Matthew? @liz22189 We're just thankful we got to sip with you, Liz! @MannyElguapo Does that mean we'll be seeing you soon? 🤞 @HollyDreschel Hooray! 🎉 @JadoreSiwoh Literally nothing is better than starting your work day off with that first sip feeling. 💚 @JustaCrzyGemini We agree! It's a wonder-fall sip. 😉 @chaela8794 Everything we do is all for you. 💚 @missbriia We couldn't agree more, Bri! @solflowerr Nothing better than making it rain stars. ⭐ @HollyDreschel So, we'll be sipping with you soon? 🤞 @RachMoskowitz It's a game changer for sure! @Dave_Foundation There's nothing like when those fall flavors hit your taste buds. 😋 @lngtrz Delicious down to the last bite! @MarvelEquest Mic. Drop. 🎤 @ilithegemini You're dad sounds fall-some! 😉 @curlycaitt Does that mean we'll see you soon? 🤞 @RockyElmore You know yourself so well! Enjoy every sip! @mthays10 Everything we love about fall in one sip deserves to be on a level all on it own! @BxBombers2791 Make it rain stars. ⭐ @marinanicholsx It's the perfect way to get all of fall in you at-home sip! @Fantasia_Hunt That first sip feeling putting in work! @umn0pe We're just doing our thing, no apologies, and we hope your day got better! 💚 @whatsupsamm Love you back. 💚 @breyonslayy We look forward to our next sip together! @lucyrayanneb Yay! Can't wait till our next sip together! @bryantheosha We knew it would be the apple of your eye. @doublezercs Wonder-fall choice! @mdmills99 😉 @SilvaWenda 😎 @warmbeiges 😋 @mdmills99 Thanks! That sounds delish! @SilvaWenda We hope that means we'll be sharing a sip with you soon! @Redwing2Zain If this is something you would like to see, we encourage you to submit your suggestion at https://t.co/SPH9PuUUvR @amy__bradfield Some days you just need to double down. 😎 @ThatsMrRomances That sounds next level apple-licious! @p05terboy Let's get you in touch with @StarbucksHelp to look into this. @p05terboy In order to receive your Birthday Reward, you need to have earned at least one Star this year. If that’s the case, we’re happy to look into it for you. @karlapink Maybe! Check Uber Eats to see if Starbucks Delivers has rolled into your neighborhood yet! @Tashagigz Not yet! If you just can't wait, try a Caramel Macchiato made with blonde espresso and extra caramel sauce! @gmvalerio17 We can't wait to celebrate you today! Happy birthday, Gina. 🎉 @furaeshu 🙌 @_hannahaleene Thanks for sharing the joys of being a Starbucks Rewards member! 💚💚💚 @gmvalerio17 We sure do Gina! To qualify for the Birthday Reward, you must join Starbucks Rewards at least seven (7) days before your birthday and have made at least one purchase in a store using your registered Starbucks Card. @tectonicplate1 It's definitely love at first sip! @kayla8272 It's easy to fall in love with the magic of a Pumpkin Cream Cold Brew! @qiellanabilahhh Enjoy the season! @Hollywood_Munoz It's a beloved fall classic! @OGprisci That Pumpkin Spice Cold Foam makes all the difference! @SarahPerez_ Sounds like a keeper. 💚 @fatheralexandra It's even better with a Pumpkin Spice Latte! @briizzlee 💚💚💚 @alexisBaybe_ Next time, don't hesitate to ask for a splash of cream or extra Pumpkin Spice Cold Foam. @furaeshu Cheers to the Pumpkin Spice season! @tristoncole_ Welcome to the PSL fandom! 🍂🎃🍂 @selenlanoir YAY! We're happy you discovered that delicious Pumpkin Spice steamer. @_hannahaleene That's very exciting! @hopeann923 Grab your Pumpkin Cream Cold Brew and jump on the fall hay wagon! 🎃🍂 @kelseypratt_ We'd love to hear your request at https://t.co/SPH9PuUUvR, Kelsey! @priyaalovee Woohoo! Pumpkin Spice Frappuccino® drink is a go. @briizzlee Anything is possible if you submit it at https://t.co/SPH9PuUUvR, Brandie! @priyaalovee Did you reach a decision? @alexisBaybe_ We think you'll love a Pumpkin Cream Cold Brew! We hope we're not too late. 😉 @lxxzz0 It's all about the foam! @Emilyburns1116 The secret is in the Pumpkin Spice Cold Brew! @LilaEspinosa1 You should, because you are! 💚 @KAmoirM Your barista is always happy to accommodate a request for light or no ice when you place your order. If you are ever unhappy with your drink please let your barista know so they can make it right. @joeely14 Glad you're enjoying every amazing cheesy bite! @LilaEspinosa1 Thanks for starting your day with us! @Milan_Rouge Secret shared! @GeminioHD Proof that details &amp; the little things matter. @S_HoneyBunches Whew! Finally! @EchoingArt Yes. The answer is yes! @MrZendejas We love that! @kasedm The Pumpkin Cream Cold Brew love is real! @kalia_glez Welcome to the pumpkin spice lovers' world, Kalita! @43Manha You're welcome. @Jparitsky41 The feeling is mutual! @mslauryntrill 💚 @maceyclewis The whoa got you! @dslundberg No worries! We'll see you as soon as the sun shines again. 💚 @whatsupsamm With all of fall in one bite, how could anyone think differently?! @mslauryntrill It's certainly a heavenly sip. 😉 @_jdao Just thinking about it has us drooling too! @Cheyl00 You tell them! It's everything you could ever want from fall in a sip! @Jparitsky41 We're glad you love every bite! @izzy_mccuskey Agreed. 💚 @WifeofWhirl It looks so delicious! @LizbethGodina Good down to the last bite! @DlWilson5 It's an egg-cellent bite to be in love with. 😉 @holla_at_meee We could not ask for higher praise. Thank you! 💚 @Purple_Murp We toast it with love! @erin_vukovich Your friends feta try it after such a strong recommendation. 😉 @lucyrayanneb You need, we got. See you soon? @claudio316 The whoa has your back! @AngelleKristin It's definitely something the need to give a chai. 😉 @SmartyGaby We love that you have a new fall favorite! 🍁🍏 @bryantheosha Gir would approve. 😉 @JeneaIA A happy dance with your favorite sip is a great way to start the day, especially before class! @KevKofi Yes, Stars expire 6 months after you’ve earned them. @CraigBoliek Hi, Craig. This is only valid for merchandise under $20. You cannot redeem your Reward and pay the difference for merchandise over that price. @theresaalopez When that first sip feeling hits! ☝️ @michaelxmacko It's a classic combo really. 😉 @breyonslayy Does that mean we'll get to see you soon? 🤞 @KKSearcey Brew-tiful choice! @doublezercs Such a hard decision! How will you decide? @WriteMonet All you need in life is a sip as unique as you are. 😉 @izzy_mccuskey Is there really any other reaction to all of fall hitting your taste buds?! @umn0pe Just do your hair toss and check your nails while you're sipping that Pumpkin Cream Cold Brew. 😉 @kleigh_ruth Awe, we're glad you think so! 💚 @kels_ryannn It's every fall mood and vibe in one sip! 🎃🍁 @CentVAstorm You're welcome! @WriteMonet Way to think outside of the box! @_Chill___ Three cheers for pumpkin love! 🙌🎃 @RKitten15 Making that amazing drink even more amazing, are you? @vmxliv You found the one! 🧡🎃 @andiexpansy Cheers to finding something pumpkiny to love! @photobaugh How sweet! 💚 @RURALCHICNE AGREE! Megan should listen to Kara! @aika_miyabi Look at you! Customizing like a pro! @RHansen3rdGrade Tis' the season for cooties. 😷 @_lynnmarie24 Of course, we do! 💚 @BrendaBas87 Apples meet cinnamon meet cream...it's incredible!!! @dprice2413 ⭐☕⭐ @ella_rossy Love at first sip? 👀 @therealluvlg We'll cheers to this! @mrsmesserxo Did you have to grab a jacket this morning? @CarissaBeth7564 Sounds like your therapist's love language is receiving gifts. 😉 RT @Kevin_Johnson: Since launching our Vets initiative, 26k veterans &amp; military spouses have been hired to wear the Starbucks green apron,… @Daniel_Lyddon Very true. The Holiday season and all its delicious drinks is just around the corner. @saraahstevenson Yes! You made it, Sarah. @Daniel_Lyddon So are we! Sipping on a PSL is making our day so much better, too. 🍂 @Charlys_Mom It's a game changer for sure! @JUSTASHSID Stars expire 6 months after they are earned, Ashley! Enjoy! @Daniel_Lyddon Happy Wednesday, Daniel! @Isabell60530666 We can say that Pumpkin Spice season is here! @CHEDDARIC There's something about that Pumpkin Cream Cold Brew! @itss_kelsey Here's to a new fall drink to enjoy! @dprice2413 Pumpkin Cream Cold Brew is the new star! @clarbbbb While it will be around as long as fall is, we recommend the Cold Brew with Cascara Foam as your core menu sip! It will give you similar vibes, but with brown sugar notes instead of pumpkin. @tdyoakum We commend your ability to resist a sip that's everything we love about fall AND looks that delish! @allyy1212 That's just your taste buds waking up to all those fall flavors! @K_Mitch865 It's the perfect way to get all those fall flavors in your at-home sip! @amp920 You're welcome! @CentVAstorm We would try ordering a solo Espresso with light steamed milk. You can always as for a bit more if it's not enough! A barista would love to make sure the sip is perfect for you, so please have a chat with them as well. @amp920 Great question! You can purchase any merchandise that is $20 or less for 400 stars. ⭐ @MonetPolny Pumpkin Spice Lattes (and Frappuccino® drinks) is to muggles as Butterbeer is to witches and wizards. 🎃 @chasingburritos We think we found your Starbucks-run partner! @happipapi34 Hooray! Looking forward to sipping with you again! 🎉 @cakedupleena At least you have a sip to look forward to! 💚 @Bucketnate Hi Nate, this sip is made with steamed apple juice, Cinnamon Dolce syrup, whipped cream and Caramel drizzle and does not contain any caffeine. https://t.co/Qn84dNpdMn @lookingformsEms No need to be afraid, we got you! Your barista would be happy to craft another sip if the Pumpkin Spice Latte is not right for you. 🙂 @cakedupleena You'll have something else wonderful to sip when the seasons change! @Luda_1214 The best snacks give that awesome Tuesday feline! 😉 @fancamboy Especially when you sip it with the Pumpkin Scone! 🎃 @_delicatedjh_ Yay! 🧡 @EricHasATweet The Blueberry Black Tea Lemonade is around all year so you have time to catch up on sips! @aishaonearth Welcome to the gourd life! 🎃 @_delicatedjh_ Was it gourd? @DannyFTW_ Perfect way to spice up your sip! 🎃 @iamjovaun It's a delicious combination of flavor combination of pumpkin, cinnamon, nutmeg and clove that is perfect for Fall! 🎃 @KavyInDaKlutch Yes, the Caramel Apple Spice is served hot. @WNavikas Thanks for reaching out with this suggestion! We hope you'll share this with us at https://t.co/FHAea75lZx for future consideration. @fleetwudfirefly 😊🧡 @virgoleci Yessss, especially with the Pumpkin Scone! 😋 @marianita3578 Cheers to gourd sips! 🎃 @xmichaelraymond Pumpkin Spice is kinda our thing! 😉🎃 @AriaLoveJackson For gourd, for sure! 😉🎃 @sxdayana We love you too! 🧡 @mia_schryver Here's to the gourd life! 🎃 @CrystalMayA_ We believe you! Enjoy every sip! @Fawn70116547 Yummy! 😋 @CrystalMayA_ Have you tried our Caramel Apple Spice? It's fall in a cup! https://t.co/uf1wkMy02h @sxdayana Pro Tip: ⬆ @momo_jaime Three words: Nom, nom, nom! 😋 @not_in_the_eye Your barista is always happy to accommodate a request for light or no ice when you place your order. If you are ever unhappy with your drink please let your barista know so they can make it right. @mermaidtymes Sorry no, this sip is not available in the UK. @KaitlinSacher Don't worry, there will be something delicious for you to sip! @Very_NESSAsary Your favorite sip is very NESSAsary before class!  😉 @TayHammerhead And we hope to spend it with you!  🧡 @YanzMilli We hear ya and would love for you to let us know what you'd like to see at https://t.co/FHAea75lZx for future consideration! @TayHammerhead Did you have a brew-tiful day? 🎃 @YanzMilli It won't be back this year but we hope you'll try the Pumpkin Cream Cheese Muffin! @rtc_41 We're pretty passionate about our Pumpkin Spice! 😉🎃 @kdjohnstone Yum! 💚 @lizzsthoughts You're welcome! ⭐ @lizzsthoughts No more missing out on those delicious Rewards! Let's get you started: https://t.co/ja8W7A9v5x @AlexisFoster96 In order to receive your Birthday Reward, you need to have earned at least one Star this year. If that’s the case, we’re happy to look into it for you. @SurfGirlAlexis Hope you'll stop by for some apple picking fun soon! 🍎😋 @clairekope You deserve it. See you soon! @arunsrinivasan While that is not an option, you can save your custom drink in the app for quick and convenient ordering! https://t.co/0hlOhsuJyr @katieanndowns 💚 @robseize_ It's never been more pleasing to give in to temptation! @grammyandoo Just ask your barista for a Caramel Apple Spice! https://t.co/uf1wkMy02h @caitie_jett We love that you found your best sip of fall! @JayDevvvv Awesome! 💚 @bluebillieniche 🧡 @itsadamuk They were super happy to be covered in caramel and whipped cream, so we're going to say they are not. @xXkitteakatXx Just the right amount of cozy! 💚 @Write_frank Yes! We love reusable cups! @SaphirePhoenix_ We'll get your cup ready! 🍎 @alliepaige0707 Anything is possible is you submit it at https://t.co/SPH9PuUUvR. Thanks! @KSlayNoir It' all about the Pumpkin Spice Cold Foam and that smooth Cold Brew! @mckaylavan_ Whoa! Bringing pumpkin spice to the next level. 🙌 @miaquintoMJ Enjoy this core drink! @rllyjessie Sounds like a love triangle to us. 💚 @moonlightsuga_ We love to hear that! @_lynnmarie24 We'll have new seasonal drinks to cheer you up, Lynn Marie! 💚 @_kyuhhhh You can enjoy that Snickerdoodle flavor any time when you order a White Hot Chocolate with cinnamon dolce syrup and cinnamon dolce topping! @niyahnaomi It's definitely a hit this time of year! 🎃 @quietlieswithin It's apple-licious! @kiasherria_kia Bring on those fall vibes! 🍂🎃🍂 @_mtzdanielaaa Anyone? Pumpkin Spice Latte delivery for Danielaaa! @43Manha We hope all your Caramel Apple Spice dreams come true! @daviechen We see you drooling. We hope to soon see you sipping! @Coneill14 That's true Pumpkin Cream Cold Brew love! 🙌 @chooch1196 It's the little things that make big differences! 😉 @herBUTTERFLYway Definitely! @cocoprincess805 If you think it sounds yummy, just wait until you taste it! @moionlynoor 😋 @Cole4Kansas Our Caramel Apple Spice is all kinds of wonderful!  https://t.co/UGwxY6OGa9 @ACE2REAL4U We're glad you're sipping your best sip! @grownupjuicebox 💚 @Misssamantha_93 It's definitely fall in a cup! 🍂 @thebakinggal Here's to an exciting new sip to try, Angela! 🙌 @NickHoward100 One of our fall favorites! @grownupjuicebox Way to treat yourself, Diana. Happy birthday! 🎉 @MariahTheBudd Sorry, Caramel Apple Spice is only available as a hot beverage. @AlexisEgleston If you need something to sustain you until the holidays, try a Caramel Macchiato made with blonde espresso and extra caramel sauce! @lauren_reney Thanks for the suggestion! Anything is possible if you submit it to https://t.co/SPH9PuUUvR @tmariea_ Glad you enjoyed every crumb of yum! @tinyklancer Let us know how you like it! @sunshinececyy It's a great match to a cup of coffee or a Pumpkin Spice Latte! @quintero_emilyy It might become your new fall favorite, Emily! @lauren_reney We love it when you fall for a new favorite! @boringfileclerk Apple-solutely! @moionlynoor It's the flavor of the season! 🎃 @ashelsoflee That Caramel Apple Spice is waiting for you! @__royaldiamond Pumpkin Spice and everything nice! 🎃 @aheath0385 😱😍 @Re7elationHDR Go for it! We think you'll fall in love with it. @joseph44758 Right? We apple-solutely love it! @Kassiokorinzu That's something we love to hear! @JackHites There's fall vibes in every sip! @B_M_Nichols See you soon for that delicious sip, Brianne! @Christine_Friis We like what you did there, Christine. @msswpr It's amazing! We hope you'll give it a try. @miaquintoMJ We'd apple-y sip on a Caramel Apple Spice right now! @carlegdell2 You rock! Thanks for all the love. 🧡🧡🧡 @Coneill14 We do not have a Cold Brew version of this beverage. Have you tried our Pumpkin Cream Cold Brew, though? @oofyboioof The pumpkin spice love is real! 🧡🎃 @yara_yogi Sorry! This drink is not returning this year. @alwayshomealone Caramel, apple and spices is the perfect fall combination! @sara_b1022 Caramel Apple Spice is available all year round. Your store might be experiencing a temporary outage. @pattymajj Nitro Cold Brew topped with Pumpkin Spice Cold Foam is heaven! @TRock21 YAY! You're definitely off to a great day, Terika. @alyyeu May that delicious drink make its way to you soon, Alyssa @TheLashBistro Cool weather is pumpkin spice weather! @beth_eff That's truly spooktacular! @sharifahaunii Absolutely! @IzzatiTaufek It tastes like fall in a cup! @tinyklancer It's an a-maze-ing fall drink! A must-try. @saraahstevenson Pumpkin Cream Cold Brew for Sarah, please! @TimKerrr Pumpkin Spice season all year round? Anything is possible if you submit it at https://t.co/SPH9PuUUvR. Thanks! @BawangByte It's fall vibes in a cup! 🍂 A Caramel Apple Spice today keeps the autumn chill at bay. 🍎🍂 https://t.co/paQfu0YW9b @trillliana Could it be pumpkin spice love? @_chingp It's love at first sip! @fabuboss1 Talk about Pumpkin Spice magic! @stephrestituyo She knows. ☝ @ezzie_izzxt ✨🎃✨ @Damphotomas Go for it. 🙌 @JacquelynMorriz Pumpkin spice season is back! @EberlyJustin We can tell you enjoyed that drink! Have a nice trip. @grandeeiIish The joys of customizing your drink so it's exactly how your taste buds like it! @joseymegan If you like brown sugar notes, we suggest trying a Flat White with toffee nut syrup! @jessixajanelle YAY! What's the verdict? @ezzie_izzxt Pumpkin Spice coffee dates for the win! 🙋 @CatNicoleXO You just needed some pumpkin spice! 🎃 @rickgalvao123 You know we can't celebrate Fall without it! 🎃 @AnimeWorld31 Then you must hang out with us! 🎃 @desirae__jones We're glad to hear it! 💚 @sk__angel You deserve the gourder things in life. Reply tweet. @ryanssims You have  gourd taste, Ryan! 😉🎃 @delanners_ We won't fight you on that! 😉 @IbtisamDD You and your sip make a great matcha! 💚 @JayDevvvv Hope you had an amazing day! 🙂🍂 @desirae__jones It was a pumpkin kind of day! 😉🎃 @bluebillieniche Fall joy, is that you? 🎃🍂 @Rosie_tweets666 Enjoy! 🎃 @flyseokjin That makes us smile, Em! 😊💚 @ashatcher1 You're welcome! @ashatcher1 That's a good question! Whenever you stop by to order --- whether inside or in the drive-thru --- just let your barista know that you'd like to use your stars. Choose Pay In Store in your app or just hand them your card and your barista will do the rest! @_ShanAsh We love when you find a fall favorite! @_lizbet13 You have to let them know about this yummy bite! @saraaahall Delish down to the last bite! @annadalepink_ You tell them, Ashley! @Kellyreads08 We loved sipping with you! @happipapi34 Fingers crossed you love every sip! @EmilySOfficial1 Awesome to know that our little pumpkin won your 🧡! @kirsten_h45 Welcome to the Pumpkin Cream Cold Brew Club! @anthhendriks Mic. Drop. 🎤 @GLuvsDawgs We're always happy to help! @Rosie_tweets666 🧡 @princesspjk Cheers to a whole latte love and brew sips! 🧡 @Bana_Escamilla5 That's just all the fall flavors waking up your taste buds! @_jonesstyle_ Happy Birthday! 🥳 @violetconner Your welcome! @Rosie_tweets666 We hope we sip with you soon! @kdjohnstone Something delicious to nosh on! @fashiongvd_ We're glad you're loving every bite! @Dredupree_ We're egg-cited you think so! 😉 @mannie206fresh So, we'll see you soon? 🤞 @baileey_holtt Honestly, we couldn't agree more! @slimkeepitg_ Agreed! 😋 @jokoriches Team work makes the dream work! @violetconner You're plating skills are egg-cellent! @itsmari_b It's a bite that's cheesy to love. 😉 @jonhikes We've always got your back! @lalalaleigha We wouldn't change anything about this egg-cellent tweet! @ThimSlim It's a nut-ural reaction to this bite. 😉 @thatsaletho Looks great! Glad you enjoyed your sip. 🧡 @JosieAnastacia We just want you to have your favorite snack! @cyntiaaaml We recommend the Cold Brew with Cascara Cream! It would give you similar vibes with brown sugar flavors instead of pumpkin. @gracemcculloug It's every bit of fall in a sip! @SandyKulkarnee We can't wait to sip with you! @Iampictorius 💚🎃☕ @bridgett_m25 We're glad you love it! 💚 @emilyvpalmer You can always suggest a sugar-free version on our idea's page! https://t.co/EFFd3FUwu4. @AnandiDance 🧡 @GLuvsDawgs We only offer tall and grande Nitro Cold Brew because we want you to have the best sip possible! With larger sizes, the Nitro cascade leaves the beverage before it can be consumed. @ambers_95 With a sip like that we can't blame you! @HerreraClass We hope we get to sip with you, soon! @rusting_oceans Not tomatoes, just our gourdgeous pumpkins! 🎃 @morgan_cip We knew you'd love it! 😉🎃 @AmandaAl3jandr3 Gourd choice! 😉🎃 @dopeymorris Sip, sip hooray! 🎃🧡 @chrismaurelli We love that Pumpkin too! 🎃 @itsjaidesworld PSLs and love languages were made for each other, honestly. @_boudrot It was the perfect way to combine love of fall and making yummy sips! @moelizjacks We couldn't agree more! @mrmikeMTL Thanks, friend! 🧡 @mrmikeMTL We're sharing the excitement! Happy Thanksgiving. 🍂 @mercado_neftali Thinking ahead and making your day more wonder-fall! 😉 @M_CERNS Definitely a wonderful sip to FALL in love with! 😉🍂 @EwangEmbola1 If you'd like to see it on the menu, let us know at https://t.co/FHAea75lZx. In the meantime, a Flat White with Toffee Nut is a delicious alternative. @mrmikeMTL An gourd way to sip-lebrate your season! 🎃 @EwangEmbola1 Not this year, but we hope you stop by to enjoy a PSL with us! @PalmerLizzette See you soon? @PalmerLizzette An Iced PSL can be cozy too! 🎃 @Coffeeandscarfs C'MON FRIDAY! 🎃😉 @ahadzovic2018 🎃🍂 So cute when they’re all grown up. 🧡 #PumpkinSpiceLatte https://t.co/ty6TFSasGW @VivaLaCindy_1 Sounds good! @lorenamyst You're welcome! @dreaminbouths 🙌 @joseyken On March 12, five Starbucks Reserve® locations in the U.S. introduced oatmilk as their newest non-dairy milk.  Standalone Princi™ bakeries in Seattle, Chicago and New York also offer oatmilk as a non-dairy milk at its coffee bars in the bakery. @jessixajanelle Only one way to find out how delicious it is, Jessica! @PhoenixYani Hi, Phenix. We understand that sometimes plans can’t be changed. Just let @StarbucksHelp know if you can’t make it in and we’re happy to find a way to celebrate your belated birthday! @Sam_Ra3 Hi, Samantha!  In order to receive your Birthday Reward, you need to have earned at least one Star this year. If that’s the case, we’re happy to look into it for you. @_vmvndv__ It's calling your name! @MargaritaBloom Halloween is coming! @tlaur88 Please submit your request at https://t.co/SPH9PuUUvR. Thank you! @dreaminbouths Happy Monday, Katie. We couldn't think of a better way to start off the week. @ElleakaL Mission \"Pumpkin Spice Creamer\" accomplished! @callmeashanty We love it when ❄☕ is 🔥! @happilydarren Love you BFF! 💚 @polandbros_des Thanks for the suggestion! @HeyMunchables Enjoy this delicious fall bliss! @NurdiyanaAli Look at you! Trying new delicious drinks. @jacqueenxx We hope that fall sip made its way to you, Jacqee! @inspiRIZZ Absolutely! And they're perfect with your Iced Caramel Cloud Macchiato. 😊 @espurrly Glad you had the chance to sip with us! @inspiRIZZ Which snack wears a halo? @MizzMaryKhalaf We 💚 love! @jennaquick19 Welcome to the gourd life! @klaflameee It's a fun, delicious way to spice up your season! @houtshouse Awesome! @yourstrulymiiaa Perfect for the season! @mawilespino Hope we see you soon! @fableboyblue Enjoy! @repub84 So many options! A new tumbler  is a fun way to start. 🙂 @Rabananda Welcome to the club! 🎃🍂 @VivaLaCindy_1 Did you try it hot or iced? @kbordinaro Say no more! 🎃🧡 @skskvscobaby We're glad you can be there for her during her season! 🎃 @omfgmo Aw, so do we! We also hope that you had an awesome Sunday. 💚 @kristagramm Especially with the Pumpkin Cream Cheese Muffin! 🎃 @tmonizzle Was it your Sunday move? @sabrinawilliam_ Now that your eyes are open, you can enjoy it with your Pumpkin Cream Cold Brew! 😉🎃 @Tyler_carter18 Awesome! 😊 @Tyler_carter18 Nice! The next time you stop by, we hope you'll try it with a Pumpkin Scone for the ultimate Fall pump-perience. 🎃 @MARKLEESQUAD Glad you love it! 🧡 @Alexispakouvang We're glad you're loving it, and it will be around for the season but don't worry! You will always have something delicious to sip-lebrate. 🧡 @vitogiovanni2 Looks awesome! 🧡 @Alexispakouvang So it's your Fall favorite? 😉🎃 @MeganErickson84 Welcome to the world of Pumpkin Spice! 🎃 @honeyeyedgrl YAY! 💚 @AlexisKirschkee Both make our hearts smile! 💚 @MrsGameGerbil Same to you! We're so glad that you enjoyed it. 🧡 @MrsGameGerbil Cheers to gourd Sunday fun! 🎃 @LuisDiMac It's pretty fun for us, too! 🙂 @tbaugh725 That's one great pumpkin! 🎃 @BrittanyNiax3 That's definitely a self care win! Happy Sunday. @cynthianagle Happy birthday! Thanks for sharing your special day with us! @claudio316 Hanging with you is ours! @MaBoLa87 Ol' Zuula you nut, now c'mon. C'mon. We've got a Frappuccino® drink for Dana. Dana. Just relax, c'mon. @taymadison22 The game has never been more delicious! @savson_ Sounds like a perfectly delicious day! Thanks for including us. @gisellegranit Delish! @BabyHailz_ Glad you have a favorite sandwich to spice up your life! @lexie_bahm The 6 most delicious words of the day! @milkteagrl Who doesn't love humor topped with whipped cream? Keep smiling, jazmin! 😎 @imwayne_ Sipping with you is the highlight of ours! @MizzMaryKhalaf Saved by the sip! 😂💚 @tnomady13 Sounds amazing! Thanks for sharing your delish fall custom creation. @jedip13 Best day ever! 🎃 @peachpriestess Some questions have no answers. @imtryingringo That face says it all! @happilydarren YAY! @alanb856 We love to hear that! @_inlikeflynnn If this is something you would like to see, we encourage you to submit your suggestion at https://t.co/SPH9PuUUvR @realitywarps Cheers to tasty fall firsts!  🍂 @MysticMusicBox Sounds delish! Thanks for sharing your custom creation with us! @DanaijahH We're glad it scores a perfect 10 with you! @_annalachimia Aww! *blush* @ImpatientTrdr Thanks for starting your day with us! @ANDRADAARRGGHH Pumpkin Cream Cold Brew for the win! @polandbros_des Anything is possible if you submit it at https://t.co/SPH9PuUUvR. @KeeLeeStocks If that's something you'd like to see on our menu, please let us know at https://t.co/SPH9PuUUvR. Thanks! @hayliemichele_ Here's to that new fave! @briellesaige 🍂🙌🍂 @itsmenavil We're happy you love it! Let's make it easy for you to order next time with Mobile Order &amp; Pay: https://t.co/ldgVGvZx18 @Orlandobrandon3 We love those type of news! #PumpkinCreamColdBrewFTW @FrankieLazar Woohoo! @moonhiive It sure is a winner! @ElyssaMarie7_ Sounds delightful! We can't wait to see you. @NIAAELLISSE They're the champion of breakfast! @xoBadGalReRe We hope this means we'll see you soon! @JakeLX Happy birthday! Thanks for including us in the celebration! 🥳 @_misskaela We'll be your date! 💚 @Natasha1295 Cheers to all the happiness of autumn sips! 🍂 @TheEvelynRomo It's literally fall in a cup! @noraitayem Pumpkin Spice season is here! @megallice Cheers to pumpkin everything season! @monicarysavy How lucky is your mom to have such an amazing daughter! 🙌 @Alexmh23 💚 RT @laraabaddancer: one day you’re young and wild and the next you’re going to starbucks at 7 in the morning so you can “enjoy your coffee… @Alexmh23 Absolutely! We plan to eliminated plastic straws globally from our stores by 2020. We're also testing new to-go cups that will be both recyclable and compostable, over the next year in several markets worldwide. Learn more here: https://t.co/MymmW7B45s @I_AmRIEL We're always open to suggestions at https://t.co/SPH9PuUUvR, Ariel. Thank you! @xxselflovexx1 Yes to all of it! @marissaa_isabel Go for it! @thedinadn Hi, Dina. The Cold Brew itself is smooth. It's also sweetened with vanilla syrup and the Pumpkin Spice Cold Foam will add creaminess to it. We think you'll love it! @nataliaaahdez Don't worry, Nat. We'll always new seasonal deliciousness for you to enjoy. @alyyroseee Woohoo! This is going to be a great weekend. @krazywakko33 Sounds like you had a great day, Julie! @ImDreamzy_ Sending all the lucky vibes your way! 🍀 @_kenn_dall Join our amazing team by applying online at https://t.co/Nmy9TG2EWb, Kenny! Thank you. @kujatribals Of course, we did! Pumpkin Spice Latte is a must-try. @kujatribals You're on a pumpkin spice quest! @ImDreamzy_ Next time! @lillymay29 We hope you got a chance to sip it too! @redredhothead We can't think of a better way to spend your Saturday! @olinewalk Welcome to Fall! 🎃 @BrookeTx Patience, dear friend! The holidays will be here soon. 😉 @borowiecrn YAY 🧡 @_vivelamour It's a gourd direction! 🎃🧡 @BriliantVane That's usually our answer too! @jaileenejmnz Enjoy your sip while it's still Fall and when the season changes, choose a delicious new favorite! 🧡 @gulfcoastashley Thanks for your feedback! 🙂 @montgomary We celebrate those who use their reusable cup with the discount but we are also working in other ways to reduce waste. This includes our plan to remove single-use plastic straws from all of our stores in 2020. Learn more: https://t.co/d3jrjoSxFG @gulfcoastashley We'd love to hear what you'd like to see at https://t.co/FHAea75lZx for future consideration.  In the meantime, we hope you'll try our plain bagel or sprouted grain bagel, warmed with our avocado spread! @CooShelleyLoo Thanks for sharing this! We'd love for you to let us know what you'd like to see at https://t.co/FHAea75lZx for future consideration. @TianaReyes13 🧡🧡🧡 @alaysiaapursell Hope you got a chance to sip with us! @TianaReyes13 Don't worry Tiana, they'll gourd it! 🎃 @RTRN2004 This is on our radar! We are working on bringing these to scale but the lids will be available more broadly soon. @GhostLCGH26 My, what a productive Saturday you've had! 🎃 @thelexidiaries Was your Saturday filled with gourd sips? @kaaatie_g We'll always have something delicious on our menu that you won't want to miss out on! 😋 @Mikec1029 Awesome! 😊🎃 @itsunicornkitti It's a delicious fall sip made with pumpkin and spices! We hope you give it a try and let us know what you think. 🙂🎃 @_kenn_dall THAT is true Pumpkin Spice Cold Foam love. 👆 @jayyllaaa_ Will you look at that! Enjoy this yummy treat. @lifeoflynds Now, that sounds like liquid pumpkin pie deliciousness in a cup! @askbeans24 Thanks for sharing! 💚 @askbeans24 We're always open to suggestions at https://t.co/SPH9PuUUvR. Thanks! @corabellexox Yummy twist! 🧡 @natewilder84 If that's something you'd like to see on our menu, please let us know at https://t.co/SPH9PuUUvR. Thank you! @ignxred_ We'd love to hear your suggestions at https://t.co/SPH9PuUUvR. Thank you! @areimers6894 We've got your back, Alex! @Sweeet83 💚💚💚 @crerrity How's the gourd life, Charlotte? @netty_w In other words, all things cozy! 🍂 @Sweeet83 Enjoy your weekend and those yummy sips! @KiaraPorter15 We tried to tell you, Kiara! 😋🎃 @eviangrace You deserve the gourd life! 🧡 @Sweeet83 Drinks taste better in a beautiful cup! @Courtnugget6 It's calling your name! @h8youlovebooks So glad you found your pumpkin! @Alex_thefool Awesome! 🧡 @jayamorena Hi JD, yes there is dairy in the Pumpkin Spice Syrup. If you're looking for a Fall sip, we recommend a Chai Tea Latte made with coconutmilk and Pumpkin Spice Topping. @eriwinkle Eri has a big heart! 💚 @iZain_al Our favorite time of the year! @KelliChunn YAY! Bring on the pumpkin spice bliss. @heatherhaney It was chocolate spice fate! @Alex_thefool Exciting times, Alejandro! How's your sip? @naremannnnn Love ya too! 💚 @JennaFleming Feel free to customize a Cold Foam Cold Brew with peppermint syrup or submit your idea at https://t.co/SPH9PuUUvR if you'd like to see it on our winter menu. @Ginge1129 Thanks for kicking off fall with us! @__Lexxaayy__ It's a small sip that goes a long way! @emlonng Go for an Iced Mocha with peppermint syrup. It's available all year round! @_alonsoadri YES! @jade_Amanse10 That's spooktacular! 🧡🎃 @alexandriaxo94 How could they resist the perfect bite of fall?! @mr_watsononYT We're happier now that we got to sip with you! @oneofakind_jade Does that mean we'll see you soon? 🤞 @lorenamyst Enjoy every sip! @Its_Alondraa Woot! We knew you'd fall in love with it. It's all about that Pumpkin Spice Cold Foam. 😍 @Liveloveliara It makes fall even better! @lizwanderz Shout out for trying something new! Otherwise, you would have never known that it's amazing. @jonathan_shen7 We couldn't think of a better way to kick off the weekend. @Quez_johnson We look forward to sipping with you! @AlantaeDeior We completely understand! It's basically October in a sip! @PatrickCorsi It's a sip that will make your taste buds happy it's fall! @MagicalBClub Hermione would be proud of your form! @tylerbrianne3 We're here whenever you can escape the warm blankets. @briitt03 We knew you'd fall in love with it. 😉 @katiejlutz We recommend giving the Cold Brew with Cascara Cold Foam a try when fall is over! It might be the core menu item for you! @MarissaChoiceXO Does that mean we'll be seeing you soon? 🤞 @kingashley211 It's you're birthday, you can cry if you want to. 😉 @awieneke17 It's a sip their taste buds will thank them for! @ejoglez It's just your taste buds waking up to all those fall flavors! @kingashley211 Happy Birthday! 🎉🥳 @_kurtvana We're glad you loved every sip! @sh4ylee So see you a bit later then? 🤞 @savaaxo Delish down to the last bite! 😋 @brendaa_1324 We'd love to put your name on one! @reedusologist_x Mic drop. 🎤 @erninlow 💚 @Kassiokorinzu 💚 @naremannnnn Why thank you, friend! 😊🎃 @daneredd Hoping you find the one like you found the sip! 🎃🧡 @ynimsaf Listen up, this is im-gourd-tant! 😉🧡 @theregansimone Was your Friday filled with your favorite treats? @juliakay31 Which snack do you love sipping this with? @maxiepape That's a delicious idea that we'd love for you to share with us at https://t.co/FHAea75lZx for future consideration! @zaraie07 Yes, on select Thursdays we'll have BOGO for Happy Hour! Just download the app for notifications of upcoming dates. 🙂 @eileenislike The strawless lids were rolled out in Starbucks locations in Los Angeles, San Francisco, Seattle, San Diego, Washington, D.C., Indianapolis and Toronto, while the rest of the U.S. and Canada will receive them by 2020. Thanks! @malyaka1 The magic of Fall brings us this cup of gourdness! 🎃🍂 @Delfina_B_ That sounds like the perfect way to end the week! @jonnapeterson81 Delish! Thanks for sharing your fall beverage customization! @rahoward77 We are so insanely excited to be a part of this amazing community. 💚 @indecisivebe So honored that you've made this decision! 😉🧡 @RobinDawnAgain Cheers to that! Sip happy! 💚🎃🍂 @eafarabee The love is real. 💚 @breanna_miranda @DaisBabee Thanks for sharing your thoughts, Breanna! @breanna_miranda We don't have plans to but we're always evaluating our menu and would love for you to share your feedback with us at https://t.co/FHAea75lZx for future consideration! @KatLucchesi Awesome! 🧡 @sweeetheartlexx Here's to love at first sip! @breanna_miranda Awesome recommendation. The Caramel Apple Spice is also a delicious way to sip-lebrate! 🍂 @FaithChristin13 Cheers to finding new delicious sips! 🎃 @Bboys84377530 Have you found the one? 🎃🧡 @Megkp007 You're welcome! @knapikwho Gourd choice! 🎃🧡 @_michelle226 We completely agree! 🎃 @scuba4steve Apologies for the inconvenience! Due to the brewing process, we’re only able to make a limited amount each day. @bigpimpingloria Life has never been more delicious! @Zandaman101 It smacks your taste buds in all the right places! @0_Michelle_0 When it comes to PSL, we invite you to jump on the fall hay wagon! @yooadrienne_ You definitely deserve it! @KatLucchesi Did it spice up your day? 🎃 @MissRissa5 Sorry, it is not returning this year. @Slay_S30 It must be Friday! 😉 @michi1328 Is it gourd? 🎃 @Ethaandraake Actually, single-use straws are not recyclable, they are too light and too small to be captured by recycling equipment, whereas our lids can be captured and recycled. @mackdash99 You know what they say... https://t.co/r9wLsgpAtT @dianavazquezxo The real question is how could it not? It's literally everything we love about fall in a sip! @jo_wiggy 💚 @reedusologist_x We totally get it! @Ammyvh We'd do anything for a true coffee lover like you. 💚 @Iampictorius 👋💚 @Skylir2004 It was great to sip with you! 💚 @JerrrseyyyLovee Hot Chocolate is absolutely included in BOGO! We hope our delay didn't stop you from sip-lebrating! @Iampictorius Perhaps you mean wonder-fall? 😉 @kraZiTymZ Honestly, we feel the same. @486dxDOS No, thank you for sipping with us! @gabyaguilar1 What sips did you get for BOGO? @erninlow This is the perfect reaction, honestly. 🙌 @Iampictorius A toast to BOGO! @goaldigger88 Sounds like you're having a glorious sip-lebration! @jo_wiggy We're thankful we could be there while you bonded over that sip! @TheRealBBMcNeil We love a Mommy-Daughter date! Which sips did you decide on? @Gods_So_Belle Road trip! Thanks for bringing us along for the ride. @_misskaela We can't wait! @arizzle16 Your next new friendship could just be a sip away. 💚 @R_J_I Thanks for the suggestion! Anything is possible if you submit it to https://t.co/SPH9PuUUvR @Natasha1295 The wait is nearly over! Tomorrow can't get here soon enough. @ezziedolly Breakfast of champions! @tigerlilly0405 That sip isn't returning this year. If you love sweet brown sugar notes, try a Flat White with Toffee Nut syrup! @bbyxlyssa2 So, see you soon? 🤞 @ericka_15rivera We look forward to sipping both of these with you soon! @reedusologist_x We hope you loved every sip! @Kassiokorinzu What a perfect reward for your walk! Enjoy! @chocolate_cait Cheers to life changing in the most delicious ways! @Tawns0chirps Feel free to add pumpkin sauce to your favorite hot beverage. It pairs beautifully with an Americano or a Chai Latte! @Konnieg14_ It's so gourd! We love that you found your fall fav! @teart0wn So, see you soon!? 🤞 @MollyGriger It's the perfect sip to incorporate into your daily routine! @jerimiyahv The whoa got you! @BLGGB Really, who doesn't love melty, gooey cheese? @LILMELIMANE Egg-cellent choice to for a bite! @channymackk That's our jam too! 😉 @J_Lee423 Hen-sight is always 20/20. 😉 @Jixiessss Ice Coffee will help you beat all the levels! @Vick881Victor It's life and it helps you live your best life! Just an all around perfect sip! @rosaperalta101 💚 @ddrexha 🙋 @courtlynnmount They wanted to sip it all for themselves! Now that you're in the know, we look forward to sharing one with you soon. @1lakersgurl 🙂 @ChrisForever94 Happy Fri-YAY to you too! @_KeaTheElysian Fall is here, so it's time to sip that PSL! @rosaperalta101 Sounds like a wonder-fall breakfast! 😋 @ambooklife Happy birthday and enjoy your PSL! 🥳 @SouledP Loving that you found a new favorite sip! @lilmissflips56 When that first sip feelings becomes that \"thank goodness it's Friday\" feeling. ☝️ @dfcassady A little bit of fall in your routine can go a long way! @IliyahBerry_ That first sip feeling is putting in work! @Coach_Backhaus3 It's coming soon! Check back with us towards the end of the month! @paullanza It's a delicious fall bite! @biebernzayn Caramel Brulee beverages aren't currently on our menu. @JesseIngram51 Which sip do you enjoy with it? @_Paaaolaaa Autumn way to spice up your cup! 🍂 @rudy_iconik 💚 @JoshYouWhaB Because it's an awesome time to come together for your favorite beverages and team fun! Hope you guys enjoyed your Happy Hour. 🙂 @shaquangordonn Which one is your favorite? @Ionelylush It's the delicious new sip on the block! We hope you give it a try a let us know what you think. 🙂🎃 @keysrobertson That's gourd innovation! 🎃😉 @lanysmalibu_ For a sip with less sugar, we recommend the Cinnamon Dolce Latte made with sugar-free Cinnamon Dolce Syrup! @knapikwho Did you make your decision? @Bonnielim555 Looks great! @rudy_iconik Glad you sipped with us today! @_Kimberlake Glad you loved it! 🧡 @Megkp007 You can order a Chai Tea Latte and in the section, 'Tea' add Matcha Powder to your sip! @oxmxf_ Thanks for sharing, Queen! 🧡🎃 @_Kimberlake Perfect Thursday snack! @Megkp007 We may not have this sip on the menu but you can always order it by recipe! @itsjohnnysee For life! 😊 @http_lxlyyy Sounds delish! 🧡 @itsjohnnysee 🧡 @rae_kai Fall feeling all around! 🎃🍂 @itsjohnnysee Welcome to your season! 🎃 @cjuned81 Cheers! 💚 @DmoneyRozayy Happy Hour includes all handcrafted drinks! @janelleyooo We could put it on any sip you'd like...does that count? @JPargaz Gourd? 🎃 @mathewpoptartm A sip worth loving! 🧡 @floralsLA Your taste buds will thank you! 🧡 @jslii Under sauces in the Flavor section of your order, you'd be able to add extra sauce to your sip. If you'd prefer not to have the Pumpkin Cream Cold Foam, we recommend ordering a Cold Brew with Cold Foam and add Vanilla and Pumpkin Spice Sauce to your drink. We hope this helps! @sandrahuynnh Thanks for sharing, Sandra! 🎃 @only_nonie Gourd insight! 🎃 @TaylorGormley Especially since it's Happy Hour! @MeganDrewTiller Thanks for sharing this with us! We'd love for you to let us know your thoughts at https://t.co/FHAea75lZx for future consideration. @bbdollmiller She totally gets it! 😉🎃 @dimasahuri 💚 @floralsLA Have you sipped this with the Pumpkin Cream Cheese Muffin? @dimasahuri Cheers to a new sip! 😉🎃 @clothesarerad Just let your barista know that you want to use your Happy Hour offer prior to paying for your beverage. @crancii We're happy to hear it! 💚 @TeKoyaCouture87 That is quite generous of you! We hope that yummy beverage number two makes it all the way to its intended sipper before you give into temptation and chug it down yourself. But if it doesn't? We'll never tell. 🤐 @TaraJacklyn Hey Tara, we automatically loaded your Happy Hour offer onto your Starbucks Rewards account. On the review page of your mobile order, be sure to hit “Apply” or tell your barista you’d like to Redeem it prior to scanning your Starbucks App! @TeKoyaCouture87 Delish! Are you sharing or are they both for you? 🙂 @dcoyy You're welcome. @dcoyy There doesn't even have to be a second person. 😎 @fitzroy_lincoln If this is something you would like to see, we encourage you to submit your suggestion at https://t.co/SPH9PuUUvR @1lakersgurl It's BOGO. Get both. 😎 @GabbyLewis4 We thought you might see it that way. 😉 @wigtoss You can be a friend to yourself and drink both. 😎 @mimmified Your barista is always happy to accommodate a request for light or no ice when you place your order. If you are ever unhappy with your drink please let your barista know so they can make it right. @monkeydog9 It sure is! @denaedibrell Yay! We can't wait to share a Happy Hour sip with you! @ReQuelJones Happy Hour happiness lasts from 2pm until 7pm! @1lakersgurl Absolutely! Which sip will you celebrate with at Happy Hour? @GabbyLewis4 One for now, one for later. 😎 @denaedibrell Yes, just be sure to scroll all the way down on the “Review Order” page and tap “Apply” on the Happy Hour deal prior to placing your order. @Kashco84 Thanks for the suggestion! Anything is possible if you submit it to https://t.co/SPH9PuUUvR @jmikell Hi, Mikell. In order to redeem the BOGO, the order needs to be placed for 2 grande or larger handcrafted beverages. Then when you scroll all the way down on the “Review order” page you will be able to tap “Apply” on the Happy Hour deal prior to placing your order. @Princessmiriann Cheers to FALL-ing in love! 🍂🧡 @pearlgirl1983 Hi, Phyllis. To redeem the BOGO Happy Hour offer, you have to place an order for 2 grande or larger handcrafted beverages and you will receive one of them for free. @RoselinWriting Today's Happy Hour so pick up the sip that you deserve! 🎃 @sophiexoxo95 You know how to sip! 😋 @liveserna_18 Pair it with a Pumpkin Cream Cold Brew for absolute snack perfection! @haleyyrenner We see no lies here! 😉🎃 @Dendill Oh no! When you scrolled all the way down on the “Review Order” page did you see the option to tap “Apply” on the Happy Hour deal prior to placing your order? @karlimeredith That's the most delicious PSA of the day! @itsfaitthh2 Cheers to delicious milestones and that first sip feeling! 🎃 @whizbeesaur Glad you're enjoying every yummy sip! 🎃 @kelsijunehall That's right. Mind ur business. No one said BOGO meant you have to share. 😎 @NicolePKitten You're welcome! We can't wait to share a Happy Hour sip with you! @OhhBryanne And life is delicious! 🎃 @Mitsi619 Absolutely! So enjoy your woahment. 😉 @Liz242907 Hey Liz, you're looking at the Vanilla Sweet Cream Cold Brew, a sip that warms the heart! 😉 @daniwil3 You can have it delivered to you! Simply download the Uber Eats app to order your Pumpkin Cream Cold Brew today! @TristanBlair22 Oh, we already planned on hanging with you Tristan! 💚 @GoneBag You're welcome. @LMH381 You can get it unsweetened. Full nutritional and customization options are available in the app. @GoneBag Sorry, no. You will only earn Stars for the amount that was applied to your registered Starbucks Card. @daniellepic Hey Danielle, do you happen to see  “Apply” below your order? Just tap it and you'll be on your way to enjoying Happy Hour! @WWESuplexSgnGuy We can't wait to share a sip with you! @NicolePKitten Yes, just be sure to scroll all the way down on the “Review order” page and tap “Apply” on the Happy Hour deal prior to placing your order. @AzizChristian You're welcome. @WWESuplexSgnGuy Yes, just be sure to scroll all the way down on the “Review order” page and tap “Apply” on the Happy Hour deal prior to placing your order. @kspizzle Interesting, they should have a bit of ice, not a lot, but some to help chill it. Our Nitro Cold Brew does not have ice. @keiishaaaaaa_ We can't wait either! 💚 @stardance808 Nothing better than taking a break with your favorite sip!"}