{"tweets": "https://t.co/hhG9sTF1za RT @chartdata: .@samsmith and @Normani's \"Dancing with a Stranger\" has now sold over 2.5 million units in the US. RT @grimmers: me in art at school https://t.co/O7k0ZImKh3 I’m an alien @outmagazine https://t.co/W2FZGmhoZ1 .@outmagazine https://t.co/bpkn9grwQf Thank you so much @pfpicardi for believing in me and creating such a beautiful safe space that day. You are such inspiration and angel guardian to us all. Truly xx \n@outmagazine https://t.co/dYg3TUccIc I have never felt as free as I did the day of this cover shoot. Eternally grateful to you @outmagazine 🙏🏻 https://t.co/ZeaVaHZbQK 🌸’Feet, what do I need you for when I have wings to fly?’ - Frida Kahlo https://t.co/iRFEKr9Cwu Truly honoured to have written ‘For The Lover That I Lost’ for the new @celinedion record, with the incredible @jimmynapes &amp; @stargatemusic ❤️ Celine, you are my everything and you are the reason I even sang in the first place. All hail the queen, the legend and the icon x https://t.co/9Co34cYXnh What’s her name https://t.co/gaZFETvwgM It’s batty them https://t.co/ILptVbKNvr @nikosaliagas 🖤 https://t.co/ldb7WzHmJu 👋🏻 https://t.co/LV3soQ27s0 Mr. Blue Sky please tell us why\nYou had to hide away for so long (so long)\nWhere did we go wrong? https://t.co/JjsWrkf4fX IN MADRID WEARING THE STUNNING Mans Concept Menswear 🖤 #los40musicawards https://t.co/9QYsvH7U3p https://t.co/EYJm0KLd9r RT @JohnnySibilly: LET YOUR FEMME FLAG FLY BABY! ( 💽: @samsmith )#wig https://t.co/VufeK6l070 🙏🏻 https://t.co/yV3czr057G Watching prince of Egypt! The music in this film is INCREDIBLE!! See you in December @CapitalOfficial  x https://t.co/xuIQ1Hzvgv #CapitalJBB https://t.co/RWlc6YI3Ol 🌙 Issey M https://t.co/lhHW0MhyGp @LarryFlick Miss you Larry x 2 years #thethrillofitall https://t.co/zqbxjD9UoN RT @disclosure: When @samsmith approached me about taking on such an important disco record, I have to say I was a little nervous! However,… Highest song I've ever fucking sang. But a joy. I hope you all like it xx\nhttps://t.co/gyazEk0XSr As a queer person ‘I feel love’ has followed me to every dance floor in every queer space from the minute I started clubbing. This song to me is an anthem of our community and it was an honour and most importantly so much fun to have a go at it... https://t.co/gyazEkiyJZ https://t.co/IlRUBzW4XK RT @MikeAdamOnAir: \"Dancing With A Stranger\" by @samsmith and @Normani is the WORLD'S most played song on the radio this year!! Congrats #S… 🙏🏻 @ParrisGoebel https://t.co/bQelzDIk3D .@MunroeBergdorf ❤️!!!!!!!!!!!!!!!!!!!!! ❤️ https://t.co/7UAhprfycC Anything from the trolley dears? 🧙‍♂️ 🚂 https://t.co/4JbbC7qk20 Fuck yes https://t.co/kVeY2BmlVX CHER IS ABOUT TO SING TO LONDON. I AM READY. I WAS BORN READY FOR THIS. @cher https://t.co/vaii5DxyWF Thank you @OnAirRomeo and to all the @MostRequestLive listeners who sent in questions for my @iHeartRadio @AskAnythingChat. You can listen at https://t.co/iGklEaDB08 #HowDoYouSleep HAPPY NATIONAL PRONOUNS DAY 🔥❤️🔥 https://t.co/JNHhm6ROTw SING BABE!!!!!!!!!!! https://t.co/5RDN3NrrUG 🎹 \n📷: Aria Shahrokhshahi https://t.co/B5b5G4kvoU 🖤\n@AttitudeMag \nPhotography Ferry Vandernat\nCreative direction Joseph Kocharain\nEditor in Chief Cliff Joannou https://t.co/UtheX9Uf3U RT @Labrinth: Be who you are, not what your supposed to be 🧬 Last night was incredibly overwhelming. I am so touched by everyone’s kindness and support. Thank you from the deepest part of my heart @AttitudeMag ❤\n\nPhotography Ferry Vandernat \nCreative direction and styling: @josephkocharian https://t.co/4sgUOxsH1y “The city seen from the Queensboro Bridge is always the city seen for the first time, in its first wild promise of all the mystery and beauty in the world.” – F. Scott Fitzgerald, The Great Gatsby https://t.co/8VFwWDbuC7 I'm performing at this year's #iHeartJingleBall tour ❄️✨ Find pre-sale tickets at https://t.co/b6NHwZbk0j See you all soon x https://t.co/3Si6HEYxfv Lana del they ✨ @alokvmenon https://t.co/lIV7I2R22D In 2 weeks time I'll host my first @iHeartRadio @MostRequestLive @AskAnythingChat . You can submit questions here https://t.co/qRrrBs2P4T and watch on @OnAirRomeo on the 19th xx RT @MunroeBergdorf: 💜 u @samsmith https://t.co/eE2yoKBe5G 🎵 https://t.co/LsSKVITqQx ‘We live on coffee and flowers’ - The National https://t.co/QKlE9U8Qvd studio studio studio studio studio https://t.co/9ZPG7jljxe @kannonradio @OpenHouseParty ❤️ @MikelleStreet ❤️❤️❤️❤️❤️❤️❤️❤️❤️ Truly honoured to be a part of this book @scarcurtis 💙 Your drive and passion to help us all feel less alone in our heads and hearts is absolutely inspiring and other worldly. Thank you for being in my life. EVERYONE needs to go and get this book right now xx #oktofeelblue 💙 https://t.co/MSjJIdgjke Writing my third album like... https://t.co/cL9N6KlGFk 🌈@ismaelalvarez https://t.co/uOMbEw83w8 Nudes https://t.co/ZSrlaMX95J Vegas https://t.co/PqdfIKQsuY Disco tits https://t.co/A1pPKuJL4b 🖤 \n📷: https://t.co/ukH7lz6UMQ https://t.co/HxWskLxFAn x https://t.co/FCftUcdSTt 'Get Happy' is out today ♥️ Such a pleasure to collaborate with the gorgeous and talented Renée Zellweger on this - I hope everyone hears it and smiles https://t.co/x6m9l14j4e Please go and see the film and celebrate the ICON that is Judy xxxx https://t.co/3RQUT7p1VN ❤️ https://t.co/YLATLRLiXE https://t.co/bvVDSZFp3L ✨✨✨✨ https://t.co/5dedIso3wb 🌊 https://t.co/fbPZqmfM4p GO TO BED WITH ME ON @AppleMusic \nListen to the 'How Do You Sleep (Sleep Mix)' on Peaceful Beats https://t.co/egUrOWBTNv xx https://t.co/LkI3pMgtlW Love to you is just a game... 🖤\nhttps://t.co/7vJAPRwk7q TRANS AND NON BINARY MAGIC ✨💎🔥 @iamsheadiamond @alokvmenon https://t.co/fI4kqoovqQ 2017 x @JAMESMSBARBER https://t.co/fjr1CbuLKy How Do You Sleep? Sleep Mix\nListen on @Spotify https://t.co/HnibP0xNLP 😴🌖 https://t.co/dwc3AJOPXh I just went to the JUDY premiere with my beautiful friend @alokvmenon and I wore big white heels and a beat face and they wore dicks in their ears. Life is good. Everything is in its right place https://t.co/7mSArJPTyj @TheLondonHughes YOU ARE UNREAL X THANK YOU RT @TheLondonHughes: I performed #ToCatchADick for a sold out crowd in LA tonight and @samsmith came. It was magic. Things will never be th… RT @NBCNewsTHINK: It can be hard for those of us who present as more traditionally masculine or feminine to convince others of our genderqu… RT @TransEquality: ┻┳|\n┳┻|\n┻┳|\n┳┻|\n┻┳|\n┳┻|\n┻┳|\n┳┻|\n┻┳|\n┳┻| _\n┻┳| •.•)  Non-binary people\n┳┻|⊂ﾉ   like @SamSmith\n┻┳|        deserve respect… Over 1 billion views on Stay With Me on @YouTube\nThis song will always have a very special place in my heart, and to cross one billion streams and then a billion views in one week is incredible!! Thank you 💛 https://t.co/FYhip3d0mZ ❤️ https://t.co/GCdaYmU3OB I am so ecstatic that I have my song on the @calm app. It’s a special version to help all you beautiful people have a lush sleep. Dream of me 💙 https://t.co/YhpQAQPWlq Nails, hair, hips, heels, ass fat, lips real, purse full, big bills, bitch I’m a big deal 💎@todrick https://t.co/sdpu6dhqov Hey https://t.co/hxY4q32GI9 @TomGlitter @MunroeBergdorf @travisalabanza @alokvmenon @katemoross @Glamrou @jvn @Lavernecox @stonewalluk @glaad @Mermaids_Gender @HRC Love you all. I’m scared shitless, but feeling super free right now. Be kind x These are activists and leaders of the non binary/trans community that have helped me and given me so much clarity and understanding.\n\n@TomGlitter @MunroeBergdorf @travisalabanza @alokvmenon @katemoross @Glamrou @jvn @Lavernecox @stonewalluk @glaad @Mermaids_Gender @HRC P.s. I am at no stage just yet to eloquently speak at length about what it means to be non binary but I can’t wait for the day that I am. So for now I just want to be VISIBLE and open. If you have questions and are wondering what this all means I’ll try my best to explain... I understand there will be many mistakes and mis gendering but all I ask is you please please try. I hope you can see me like I see myself now. Thank you. I’m so excited and privileged to be surrounded by people that support me in this decision but I’ve been very nervous about announcing this because I care too much about what people think but fuck it! Today is a good day so here goes. I’ve decided I am changing my pronouns to THEY/THEM ❤ after a lifetime of being at war with my gender I’ve decided to embrace myself for who I am, inside and out... https://t.co/IVoLTYbAWd Eye love u https://t.co/s7yxIivJao Seems like yesterday that me, @jimmynapes &amp; @Tourist wrote 'Stay With Me'. I remember playing it to friends &amp; family. Feeling so proud and excited. Incredibly surreal &amp; mad feeling knowing that our little kid's been streamed over 1 BILLION FUCKING TIMES. Wild wild wild. Wild life https://t.co/Ttp9ri7ncQ @imjamesbarr @hitsradiouk You’re one of the first people to use these pronouns with me. Thank you. That feels really beautiful 1 billion streams of 'Stay With Me' on @Spotify. THANK YOU 😭❤ https://t.co/KnHq2ZUROO Gorgeous night at @BritishGQ  man of the year awards last night. I got to present my friend and one of the most talented souls in the game @Santandave1 with his breakthrough award ... https://t.co/bTNZRnlJfx RT @_MAXWELL_: how do you sleep ? @samsmith • 🇬🇧 https://t.co/LNvhj4YCaa My new best friend https://t.co/kF019Skwh3 Not sure what I’m doing in this picture. But I have eaten pasta almost everyday for two weeks and I feel so full and sexy 👅🍝🍞🥖🍕🍷🇮🇹 https://t.co/Qg2KsldsEe How do you sleep acoustic out now https://t.co/ZCioR31PSH I JUST MADE THAT #nopants https://t.co/07wAN6gII0 RT @THR: Sam Smith (@samsmith) is going from James Bond to Judy Garland https://t.co/RVY4bejieV RT @BillboardPride: Get ready, queens! #ReneeZellweger is set to give us some duets with @SamSmith &amp; @RufusWainwright for the soundtrack of… RT @billboard: .@samsmith and @rufuswainwright will join #ReneeZellweger on a pair of duets that will appear on the 'Judy' soundtrack https… RT @JudyTheFilm: Come on, get happy! 🎶 #JudyTheFilm’s soundtrack featuring Renée Zellweger, @SamSmith, and @rufuswainwright will debut on S… 🇮🇹🇮🇹🇮🇹🇮🇹🇮🇹🇮🇹🇮🇹🇮🇹🇮🇹🇮🇹🇮🇹🇮🇹🇮🇹 https://t.co/g3LbpYev3y ❤️ https://t.co/KHOTpUI9NP Three musketeers https://t.co/zgCfQRqJlJ When it starts raining men https://t.co/VdRFRcl6Jb Flames https://t.co/9W1VIcyQew @Ashton5SOS ❤️ @BreneBrown 😭 xxxxxxxxxxxxxx no, thank you Brene xx RT @BreneBrown: @samsmith Yes to it all: Especially that all of us have so much heavy shit and that mess in our mind is OK. We’re enough. J… RT @CapitalYorks: @samsmith And if you want to pull of the @SamSmith look around the pool this Summer... They're a bargain at £16 https://t… @BreneBrown Now every morning and every night before you go to bed. Say these words to yourself in the mirror. I’m gonna do it too. We are in this together 🙏🏻 Hope you’re all having a gorgeous summer x @BreneBrown Sorry to blab on. But I know we are all dealing with some really heavy shit at times. And I find listening to words from strangers comforting. So hopefully sometimes I can be that stranger to you guys. @BreneBrown By constantly trying to change and seek perfection and a life of no pain only causes more pain I am realising. \nStill on course and learning but feeling the closest I’ve ever felt to a real space of joy, gratitude and peace. But I’m slowly starting to realise that the words above are the only words that really matter.... and they are the words of the incredible @BreneBrown .... ‘You are enough’ \nThat mess in your mind is not a mess. It is who you are. I’ve watched and read so much over the last 6 months to try and make sense of all the mess in my head. Tried to find ways to organise all of my problems so that they are bound and organised into folders and boxes, so that they will never haunt me or effect me again.. Just wanted to share a little thought with you all. Sitting here on my first holiday in a long long time. Looking back on a year and a half of therapy and what has been probably the most challenging time of my short 27 years here.. https://t.co/5AIMxNi4n6 I just had a siesta. I want to have a siesta everyday https://t.co/BCOc5fRnqE Hot girl summer ✅ https://t.co/aoNHpV0jYl Fail https://t.co/KKfTqyJzgi ❤️ https://t.co/C31jl58l12 Excited to share an acoustic version of 'How Do You Sleep?' today. You can listen here https://t.co/3q9NHSbbm8 Thank you to everyone supporting my new song x https://t.co/QgqbGaNZJ0 Tomorrow x https://t.co/AQniIXOiAo @heysophlewis❤️ https://t.co/3FM1y2B4TG I’m done hating myself for feeling... \nhttps://t.co/07vv14RSh2 https://t.co/pcALoBeg46 Love will keep you up tonight 🌙\n#HowDoYouSleep\nhttps://t.co/USVTwaTusE 🦆 https://t.co/X4qB59iKrO Beautiful people of the US, thank you for making Dancing With A Stranger with @Normani double platinum ❤️ https://t.co/h1FHaQTRTE What a day. Just did my first ever Munro in Scotland. Such a beautiful, fulfilling and exhausting experience haha. Loved it so much. This was me drinking water from the waterfall on the way down. Best water I’ve ever fucking had #parched https://t.co/MX6HKG5F2r Re charging like never before these past few days. Exploring a part of the world I’ve never seen. Honestly nothing like it. Super grateful for this time x https://t.co/yBLM3b1P9Z RT @charli_xcx: sorry i’m late on this but my friend just showed me the latest @samsmith video and I think it is a work of ART! totally glo… @charli_xcx 😭 thank you so much! Genuinely means the world coming from you. Hope you’re well gorgeous x Photographer: Act natural https://t.co/RyhlAtVEte Applecross x https://t.co/LHoXqjnAAD Wet wet wet https://t.co/T14HBWdoC9 Lox on the loch https://t.co/vhNG5YwAUP How Do You Sleep?\nWatch the exclusive video for @Spotify on Today's Top Hits https://t.co/V185KnOI5r https://t.co/yhN1ckBvxf @Glameriss ❤️ 💚 https://t.co/36JYsOjfLl 💙 Confess to me https://t.co/d3E2vo7L5u James Dean kissing Marlon Brando by https://t.co/ChzrsUr1Qs https://t.co/4Vc6MfepMg RT @luciacantshutup: @samsmith you look a lil Bavarian (German) and I'm honestly here for it RT @TweetsBryBree: “There’s a vivacious woman inside my body that is being set free.” - ⁦@samsmith⁩ \n\nCategory is Femme Kween Realness and… To feel free, and to feel no fear is really quite special… \nHow Do You Sleep? Behind The Scenes, watch at https://t.co/9p4W2bLSRC https://t.co/YeD2yRUgfm 15 and fabulous https://t.co/5SVV3kWKJW 🌸🌼🌸🌼🌸🌼 \n@BritishGQ @LouieBanks https://t.co/bNseYyDhSA Tell me how do you?\nhttps://t.co/LpqzixcOdz #HowDoYouSleep https://t.co/abtmsuaxTT RT @GIANTS_Netball: Hey @SamSmith - I think we've found your back-up dances for your next Australian tour. 🤣🧡\n\n#RiseAsGIANTS #DanceAsGIANTS… How Do You Sleep? has been out for one week now, and I am LIVING for all your dance videos.\nIt was incredibly important to me to make a video like this, and seeing such an incredible reaction and reading your messages means so much https://t.co/68sUnnyqg0 Listen to DANCING QUEENS on @AppleMusic  https://t.co/2GeLicukzr\nThese are all the songs that inspire me to get up and dance through my days https://t.co/0hNUS7b2A9 MOOD https://t.co/tro15ie5qt Watching Beyonce homecoming for the 12th time. I’m partly embarrassed and partly proud. I’m obsessed. It’s so beautiful @BonnieHunt_real  ❤️ been so long HOW DO YOU SLEEP? 🌙  \nhttps://t.co/07vv14RSh2 https://t.co/bmUtC7Kmf1 Too hot for hair https://t.co/MdCL9ibPfO 😭😭😭😭😭😭😭😭😭😭 https://t.co/UIRIx9e03A RT @4Music: It's stinging season. 🐝🐝 @samsmith https://t.co/rsSwAKofmj RT @anoncontent: .@samsmith #HowDoYouSleep directed by @grant_singer. Watch the full video:  https://t.co/v9AAZHKlU5 https://t.co/v09kzN0gpE RT @Deezer: Release your inner dancing queen🕺💃🏽 with @SamSmith's new lovelorn single #HowDoYouSleep out today.  Listen here ▶️ https://t.co… @therealgokwan ❤️ RT @therealgokwan: I bloody love @samsmith new video... #werk #pose RT @BBCR1: Feeling sleepy but make it fashion ✌️\n\n#MondayMotivation from @samsmith https://t.co/wempGElKmZ Catch your tears, feel your tears, then throw your tears away 😂 https://t.co/JwbssPENzv 🧡 \nhttps://t.co/LpqzixcOdz https://t.co/25NzPFYZpg RT @MariahCarey: So.. am I the answer to \"How do you sleep?\" 😜 I LOVE the song and I couldn't be happier than to be starring in your dreams… @MariahCarey 😭😭😭😭😭😭😭😭😭😭 thank you gorgeous xx I hope to see you soon! @ItsMya16 I need everyone to learn it too so we can dance together soon!! xx RT @hsainxo: THIS. IS. THE. SAM. SMITH. MUSIC.  IVE. BEEN. WAITING. FOR. https://t.co/tZyXcHe08T 🖤 https://t.co/k9KBTZWIGJ I had the best dream last night. I was at a Mariah Carey album launch with all my friends and she dedicated ‘A no no’ to me! Ugh! Dreams! Woke up in such a good mood @MariahCarey @wemawems 💃🏻💃🏻💃🏻 😂😂 https://t.co/xaS6glgoGm RT @idolator: .@samsmith puts a fresh spin on heartbreak with his dream-like anthem \"How Do You Sleep?\": https://t.co/d4XVm7hPKP https://t.… Me at 22 on the set of my first music video for Money on my mind. Everything and nothing has changed https://t.co/fPqnZnqjC7 HAHAHAHAHAHAHA LOVE THIS https://t.co/HWOTf3ril7 10 million views in 24 hours. Are you fucking joking? Ahhhhhhhh! https://t.co/HpvK3IPeYQ thank you everyone xx 😭 RT @Ron_blake1: I’m loving @samsmith new song and video https://t.co/6BgQkqqcYP Thank you x \nhttps://t.co/07vv14RSh2 #HowDoYouSleep https://t.co/R05BAGTiF0 🖤 https://t.co/qZOMN2ofST How Do You Sleep? Times Square, NYC \nThis is incredible, thank you @YouTubeMusic. LOVE ❤️\nWatch the official video at https://t.co/SYd2rRyo6T https://t.co/gy2xV9Byct Thank you x https://t.co/vr2mNQb2Mp 😢 https://t.co/oGUUkiWTPY ❤️ https://t.co/fUWd7XqtsN My new single 'How Do You Sleep?' is officially yours, thank you so much for the most incredible response. Overwhelmed!! 😭\nListen on @Spotify at https://t.co/zfINZK6UhC xx https://t.co/b1d2pAi7uc I’m so happy x RT @JohnnySibilly: me listening to that new @samsmith honey. The tear wipe at the end 🥳🙌🏽 https://t.co/l9aaQB0QOL RT @LayzSlayz: I’m living for @samsmith shaking his hips and dancing 🙏🏼🙌🏻 https://t.co/hVfsRfzOnK @alexander_olly ❤️❤️❤️❤️❤️❤️❤️❤️❤️ RT @alexander_olly: the queer energy !!!! go on Sam!!!!! ❤️❤️ https://t.co/7VTZxbnGir RT @bergenleah: Happy Friday! @samsmith gave us a new song, it feels like Christmas!!! https://t.co/Zj3WrXHDcL I'm hoping that my love will keep you up tonight... 🖤\n Listen to #HowDoYouSleep? on my @AppleMusic Essentials playlist https://t.co/vUnkHQVBsa 🍎 https://t.co/ZiXGyHc7dG RT @CliffJoannou: This is a JAM! @samsmith 😻😻😻😻😻 https://t.co/BkNbLsE3og Ah man! Thank you 😭❤️ https://t.co/bPQqLtkV49 RT @SpotifyUK: @samsmith @mikeskinnerltd @flohio16 @aboveandbeyond @PRETTYMUCH @liltjay @eykmusic @FreyaRidings @weareider @easylife .@sams… Love you gorgeous xx that means the world https://t.co/hw8mmyhgUw ❤️❤️❤️❤️❤️❤️ love you monsieur https://t.co/UdKcYX7mEa Sitting here reading all your comments and freaking the fuck OUT!! This feels like the day I came out 😂❤️ Love you Katy xxxx https://t.co/aTvhCb2eGX ❤️ https://t.co/omXHmCU4D2 RT @Vevo_UK: we'll all rest easy tonight knowing @samsmith has returned 🖤🛌\n\nwatch the BIG new video for #HowDoYouSleep and get ready for th… RT @Labrinth: Go @samsmith and my bro @ilya_creates on the beats for this one 🔥 https://t.co/7Ir9MMIPWb RT @druidDUDE: so this video is perfect. they create portraits, shapes, moments! it's beautiful, @samsmith! (also these lyrics fuck me righ… RT @jordanthomason_: So in love with this @samsmith 🖤 https://t.co/uCueS4Po9U HOW DO YOU SLEEP? My heart is beating so fast. I'm so proud of this one. Thank you to all the beautiful humans who've helped me really come out my shell over the past year.  I hope you all enjoy this &amp; please learn the moves so we can dance together soon x https://t.co/HpvK3IPeYQ How Do You Sleep? The new single. Listen and watch now at https://t.co/07vv14AgSs xx https://t.co/B3lEogaWxZ HOW DO YOU SLEEP?\nListen to the new single and watch the official video from 5am BST / 9pm PT.  Join the YouTube premier now at https://t.co/OLmunjcVt3 x\nI am SO excited for you to finally see this 😭❤️ https://t.co/4uSah3BDXU Grandpa or Grandma? 💅🏼 I’ll take both #batch https://t.co/HZ6pfYkhRh So truly happy I got to meet @lizzo the other day. Her show was out of this world!! Made me feel so high on life!! She is the one. Can’t wait to watch you continue to take over the world gorgeous xx https://t.co/waBOE9PHd3 How Do You Sleep?\n19.07 \nhttps://t.co/Yl3gL7Mja3 https://t.co/sjFsgH9bvk Farewell Montreux my darling https://t.co/UkwVY4zEae I have never been this excited for a release. Ah  My inner dancing queen is about to come out. You ready? July 19th x https://t.co/4jvkR3kxlM HOW DO YOU SLEEP?\n19.07.2019\nPhoto: @maggiewest https://t.co/3pZ68CeomJ HOW DO YOU SLEEP?\nJuly 19th https://t.co/P0bEltaW2C 🔥🧡 sound on 💛🔥 https://t.co/b8AM9Tv3M1 Thank you @youtubemusic for this 👅 10 million bloody subscribers! Absolutely nuts!! 🖤 https://t.co/kwSbVZBtoq 🌹❤️ https://t.co/aItWu7sUNx I have truly never felt this proud to be queer. What a day. Thank you #queerbritain @Queer_Britain https://t.co/ae7v9cPhq8 🖤 @edsheeran https://t.co/a38S3g97i2 CELINE DION CHANGED MY LIFE https://t.co/Y8l73PJQSL Beautiful afternoon at the 02 silver clef awards for @NordoffRobbins1 ❤️ what an incredible charity. So honoured to win best Male today &amp; be in that room and see all that money raised ❤️ https://t.co/4uyQSdQEZR Mondays got me like https://t.co/itSDcdmZ8w My dad got married yesterday. So happy 🌞 https://t.co/UO86ui9mdB Hey https://t.co/VTs2f4HnLz ☕️ https://t.co/0hkVjJm3Yb I have ALWAYS wanted to find a heel I could wear everyday to the shops 💅🏼 dream come true!! I love you SYRO https://t.co/kYOyctbxLd Spice Boy https://t.co/RqZ1ayMlDk God I love singing so fucking much. I miss you all https://t.co/g9XkNyzt2K Ladies with an attitude\nFellows that were in the mood\nDon't just stand there, let's get to it\nStrike a pose, there's nothing to it 🖤 @LouieBanks @britishgq https://t.co/ztvczaOmpN Beautiful day in Victoria Park yesterday, watching beautiful music. What it’s all about x https://t.co/Z1C3zoJc0J KING 👑 @slowthai https://t.co/1EfpWIuHK2 https://t.co/txMPp0nYHq Yesterday was a good day xx https://t.co/lv0aJD5tLb Last night of being 26 ❤ Miss you all x https://t.co/RsVB0z46lO Rest in Peace Calamity x https://t.co/J5xQcLuTEk Well this made my day. Honoured to be on your cover again @BritishGQ  🖤  \nThank you to the incredible Louie Banks and Luke Day https://t.co/icXRAmyfpX https://t.co/iQKQa6GrTb Good Afternoon Cape Town https://t.co/c7qRWC8jlD Mood https://t.co/bhNfJvrc5F 💁🏻‍♂️ https://t.co/kRlg9jng3e This drink tasted like the bottom of an orange Calippo. So boom https://t.co/JJVEjZMEj1 Excited to perform at the 2019 @BBMAs with @Normani ❤️\nTune in May 1st at 8/7c on NBC x https://t.co/wXZ9osjiwB BOGOTÁ. I am in a deep love affair with you and with Colombia. I’ve had so much fun here. So much amazing food and wine. Danced all night last night and I don’t want to leave!!!!!!! Thank you so much for this experience xx https://t.co/P2FxyjM1OX To all my beautiful fans and friends in Brazil. Thank you for always being so welcoming and showing so much love to me. It truly means the world. I can’t wait to be back one day. Hopefully soon!! I love you all xx https://t.co/qKCnym4Ndm Altitude swag https://t.co/50eL32ULqM DRIES https://t.co/aTs0SCM9XX Me today on my day off https://t.co/50reJlbJoj Feeling bloated and gross after my flight so thought I’d post a mirror selfie of my sexy bloated boobies coz we are friends. Finally https://t.co/geW5X2L2ej CHILE https://t.co/i57w2gOG2x I love you Chile x https://t.co/eVKcIYWjj0 Love you all. Just sayin After 3 months off from performing, the last week has been a game of catch up. Been training my voice everyday and also getting back into my fitness. So nice to get back into the swing of things. Rehearsed last night &amp; feeling stronger and stronger x THREE DAYS till South America https://t.co/5idXAu8qeg Fake Laugh https://t.co/83CWTnRwjg True blue baby I love you https://t.co/1Qu7UTYCse Here's the link if you'd like to bid on the tambourine from One Red Nose Day and a Wedding https://t.co/3xJESMLdWn signed by me and @nicolawalkerhq. All proceeds go to @comicrelief ❤️ Thank you @AppleMusic ❤️🍎\nListen to 'Dancing With A Stranger' with @Normani on https://t.co/5dIVLSEem1 https://t.co/B88xqgaqgS Thank you for inviting me to be a part of One Red Nose Day and a Wedding @comicrelief ❤ \nPlease do all you can to support people in need, across the UK and around the world https://t.co/xFKzfgIYBN https://t.co/V33OB8jp83 Under bite growing at rapid speed in this picture https://t.co/yojgi13aw2 🖤 @Deezer https://t.co/uB0dCiAU3H https://t.co/atHGQZKYPH Lost my IKEA virginity today. I am well and truly fucked https://t.co/c1fsjOgllh POW 💥 @jameelajamil https://t.co/DQzB9t3L2u Want to say a huge thank you to everyone supporting 'Dancing With A Stranger' 🖤 https://t.co/O0CwdvOFtU My friend just sent me this picture of me and two sausages. I thought I’d share my happy place with you all https://t.co/TOS3RohRZu RT @BakuCityCircuit: The writing was on the wall and now he has the green light - @samsmith will be headlining the Formula 1 Azerbaijan Gra… A few months ago, I sat down with @jameelajamil and spoke with her for her incredible @_iweigh movement. I know this sounds dramatic but this interview completely changed my life. Watch in full on my IGTV now (please be kind haha) xx https://t.co/IMDLSUayso Bananas in pyjamas are coming down the stairs https://t.co/VnKNR8saLx Dancing With A Stranger. Behind the scenes 🍂 https://t.co/XOv5dFHXXK LOVE MUSIC HATE RACISM https://t.co/99mxqDTnQx please watch this video &amp; find out more about the story of #LMHR it's such an incredible, positive message and it's so important it's seen by as many people as possible so share and spread the word! #beautifulresistance @lmhrnational Don't drink kids https://t.co/51HUzT8yXv I don't wanna be alone tonight... \nhttps://t.co/kdTKNv2rOR https://t.co/97PLE25NTG Blossom Baby https://t.co/kyZPKxHXet To all the phenomenal women making the world a better place with your strength, wisdom, kindness and courage...thank you ❤ Celebrating you all today and every day  #IWD2019 https://t.co/mdNPx0NsjM Everyone needs to listen to this album right now. Listen to every word. This man tells stories &amp; makes art like no other @Santandave1 - Congratulations to the method family &amp; everyone involved 🖤🖤 https://t.co/t1ieoTO5KG https://t.co/P0gk53NaFq Thank you so much @givenchy for having me in Paris this weekend. Congratulations to Clare Waight Keller and the entire team on a truly sensational show!! 🖤 such a warm and kind family of people xx https://t.co/fIQb7BGfCb Thank you for supporting #DancingWithAStranger @SiriusXMHits1 ❤️🌹 @spyderharrison, @MikeyPiff, @kidkelly So excited to share this acoustic version of Dancing With A Stranger that @Normani and I recorded in LA last year! Listen at https://t.co/KOhlovExYG\nThank you to Normani for recording this with me, and to everyone supporting our song ❤️ https://t.co/BnBhC8yFvt Dancing With A Stranger (Acoustic) 🌹 https://t.co/11E3KUJzJM ONE BILLION VIEWS 😭😭😭\nI remember being so nervous to release this after taking some time out... So grateful for the reaction, thank you for watching x https://t.co/X6aejmRTKb Because you can can can https://t.co/Ym5mUQVwAS Frosting ❄️💎💦 https://t.co/QaxTtlN3To https://t.co/PlKFdqwkt9 In bed about to go to sleep at 10pm on a Saturday. I couldn’t be happier Excited to show you the behind-the-scenes for my new video with @Normani 'Dancing With A Stranger'. Working with Vaughan Arnell and the team was a dream and I am so proud of how the video came out https://t.co/upDyFG9RMy Incredible!! @KyleHanagami https://t.co/aWENkSWeRb Listen to 'Dancing With A Stranger' with @Normani on the Pop Hotlist at https://t.co/Zm9SklTX9O ❤️ @YouTube #DancingWithAStranger behind the scenes. \n5pm GMT tomorrow x\n@Normani https://t.co/DRJ68Johd8 Pounding grape https://t.co/USLlWNx43a Please vote for the gorgeous @Mabel who is nominated for British Breakthrough at this years @Brits. Here's the link https://t.co/GqrxWQPqhv  xx LOVE @Normani xx\nhttps://t.co/kdTKNv2rOR https://t.co/SJQwWV2r54 #AlexaPlay Dancing With a Stranger 🌹❤️\nhttps://t.co/Q6xhGHIjlg @Normani @AmazonMusic https://t.co/2oW5mJ9yXz A ltd number of scented vinyl and long sleeve tees are available at https://t.co/oAyeS3u6o3. ❤️ to everyone sharing their Dancing With A Stranger merch photos x https://t.co/gymjRz3DRr @JKCorden Isn’t it out of this world x RT @JKCorden: Oh my god. This is the most beautiful thing I’ve seen today x https://t.co/L8xECzVDF5 RT @jameelajamil: Today I interviewed @samsmith and it changed my life. And when you watch our interview it will change yours. What a human… 🧡 @maggiewest https://t.co/WnW5rTfWlH Dancing With A Stranger x \n@Normani https://t.co/LfikTIBnxR https://t.co/llWJSddxKQ I’m so happy to finally show you the video for dancing with a stranger with @Normani!! This was directed by Vaughan Arnell and we had so much bloody fun making this one!! So lucky to work with such talented and kind people xx ❤🌹 https://t.co/O0Cwdvx4Cm @bIindeye 😭 RT @slowthai: MONEY DONT MAKE YOU IT BREAKS YOU!!! DANCING WITH A STRANGER @Normani\nWatch the official video on @AppleMusic at https://t.co/GdbRqJ2G2n 🌹 https://t.co/PQXT4G4NF0 DANCING WITH A STRANGER @Normani\nWatch the official video exclusively on @AppleMusic at https://t.co/B7NTj8HZSa 🌹 https://t.co/jKplKjARQI DANCING WITH A STRANGER @Normani\nWatch the official video exclusively on @AppleMusic at https://t.co/csGRH1b97y https://t.co/dT0b27oQ7l Dancing With A Stranger ❤️ @Normani \nOfficial video premieres midnight GMT tonight on @AppleMusic x https://t.co/RXSL4iQev7 Dancing With A Stranger\nOfficial video. Coming soon.\n@Normani @AppleMusic https://t.co/EtLMs16h2A Had the pleasure of going into @Beats1 recently to chat to my dear friend @zanelowe ❤️ you know how much I love you Zane. Always floating after our chats xx Full interview out on Monday 🤘🏻\nhttps://t.co/sKMaQSJT3d https://t.co/YznoOJfTqe RT @zanelowe: Catching up with @samsmith next 👉🏼 https://t.co/5Hwep9qGvE https://t.co/ut3e73WAE5 RT @zanelowe: On the show in 30 min. Big #WorldRecord vibes. Incredible new @flo_tweet ‘Moderation’. New @juliamichaels x @selenagomez ‘Anx… RT @BRITs: ✅ CONFIRMED: @CalvinHarris, @DUALIPA, @RagNBoneManUK and @samsmith ALL performing at The #BRITs 2019!! 🔥 \n\nFour artists. One epi… . @BRITs 2019!! so excited to perform 'Promises' with @CalvinHarris x https://t.co/Pxyr3jjsN9 When the tequila hits ⚡️@streetstyleposer #DancingWithaAStranger https://t.co/WSgKYCNpjg 🖤 @Normani https://t.co/kdTKNv2rOR https://t.co/HC3ruFBWsw Thank you all for the reaction to 'Dancing With A Stranger'. So happy... FEELING THE LOVE @Normani 🌹 https://t.co/kdTKNuKQqh #DancingWithAStranger https://t.co/ZWJbuZXfUf It’s pretty clear that I’m not over you\nhttps://t.co/kdTKNv2rOR ❤️ https://t.co/9UOCwV2w2d #DancingWithAStranger https://t.co/jKWRaj0Cht RT @BBCR1: Not many people can claim that ACTUAL @eltonofficial gave them their very own drag name, but @samsmith can! 💅🏻\n\nListen to episod… RT @TinyikoSAYS: Where's the video for dancing with a stranger @samsmith https://t.co/nNatLST4Eo RT @CapitalOfficial: Who cares who you're dancing with - as long as you're dancing to this bop @samsmith and @Normani. 💃 https://t.co/du34Q… That picture of all that McDonald’s and trump in the White House is actually fucking crazy. What is happening 🤦🏻‍♂️ Stye with me https://t.co/K8Yw8FhzUs RT @CamMansel: 3 times a charm aye @samsmith about to play #dancingwothastranger again! ❤️ @CamMansel @ZMonline 😂 legends!! I’m so happy xx thank you @CamMansel @ZMonline YOUVE MADE MY HOLIDAY XX@THANK YOU SO MUCH CAM ❤️ https://t.co/uzLzujmNnW @CamMansel @ZMonline LISTENING NOW! 91 yeah!? @TheEdgeNZ I know you’re doing your top 30! But I’ve never heard dancing with a stranger on the radio before!! Pretty pretty please 🙏🏻 @TheEdgeNZ oh my god! PLEASE play dancing with a stranger! I’m listening now 😭 Reading through all your tweets about dancing with a stranger! I’m so fucking happy you are all loving it!! ❤️ Miss you all. Get me back on the road immediately 😭🌹🌸 LOVED shooting this with @Normani x\nWatch #DancingWithAStranger' filmed for @Spotify at https://t.co/0BqcuObHF1 💃🏼 https://t.co/fAYsUUskYv Listen to #DancingWithAStranger on @AmazonMusicUK's Brand New Music playlist at: https://t.co/uKFcwhGgjI https://t.co/QFYwa5Rtj0 Nominated for BRITISH MALE at this year’s Brit Awards!! Thank you @BRITS ❤️🇬🇧 https://t.co/68OzERPdFh RT @BRITs: The nominees for #BRITs 2019 British Male Solo Artist are:\n\n🕺 @AphexTwin\n🕺 @CraigDavid\n🕺 @george_ezra\n🕺 @officialgiggs\n🕺 @samsmi… RT @pandoramusic: .@samsmith and @Normani's magnificent new duet has arrived. Listen to \"Dancing With A Stranger\" now: https://t.co/awBbbLt… 💙 https://t.co/a0by62TEgq RT @chadwinclark: Sooo... I’m kind of obsessed with this @samsmith and @Normani song! #DancingWithAStranger https://t.co/lzaMZb85VZ ❤️🌹 https://t.co/aImj7cV2xr RT @_patihs: Look what you made me do, I’m with somebody new. Oh baby, baby, baby I’m dancing with a stranger🥰🎶 @samsmith This is incredible ❤️ thank you @amazonmusic #DancingWithaStranger @normani https://t.co/aoRdkIRswy RT @Normani: I was never amazing at keeping these kinds of secrets but thank you GOD ♥️ #DancingWithAStranger is finally YOURS! I live for… Dancing With A Stranger with @Normani is here ❤️\nYou can find the new single on my @AppleMusic essentials playlist https://t.co/f4L61aNRnJ https://t.co/4i8G8VTVpF Here it is, 'Dancing With A Stranger'. https://t.co/kdTKNv2rOR\nAnother musical baby. Popping them out over here!! Hope you enjoy it ❤️ I live for you @Normani ❤️ #DancingWithAStranger https://t.co/ytxjNdqNsV 5AM GMT / 9PM PT\n@Normani https://t.co/dbM4CyJY56 ❤️ @Normani https://t.co/kDdNuWEBIq Gorgeous people... @Normani and I have new music for you this Friday. Tweet with #SamAndNormani to see new lyrics from Dancing With A Stranger x This video and song is out of control @slowthai!! You take me to another world bro!! https://t.co/DVPKi2Ggr3 500 limited edition Dancing With A Stranger scented vinyl are available to pre-order on my webstore at https://t.co/oAyeS3cvwv, along with long sleeve tees. Cannot wait for the track to be yours this Friday 🌹❤️ https://t.co/GBHGYwH4zd 🌸 https://t.co/8fG8YCFK8u 🌹 https://t.co/KuMlZwBqfO Dancing With A Stranger\n11th January 2019. @Normani \nhttps://t.co/t3aDlLJRfw https://t.co/GSNjE6ZtmI Well fed and ready for the new year https://t.co/uul023t3f8 Honour to work with the incredible @maggiewest recently. I love you Maggie x https://t.co/AOsF144FXY AHHHHHH @Normani!! \n@twitteruk @twittermusic #SamAndNormani https://t.co/wXno6Be34j January 11th https://t.co/oAczOf8AFo DANCING WITH A STRANGER with @Normani \nJANUARY 11th 2019\nhttps://t.co/4VIPj3xDpd https://t.co/rZaFYqVPcH Happy new year one and all. I’m so ready for you 2019. Thank you to everyone who made 2018 a year I’ll never forget. Love xxxx https://t.co/A9ZX5MG09w FIRE ON FIRE. Out now https://t.co/wIRmD1T6i5\nSo honoured to be a part of the new @BBCone / @Netflix adaptation of Watership Down. This story is so powerful and timeless and it's been thrilling to work on a song for it. I hope everyone loves it as much as I do x https://t.co/cRmJgzms45 What a year!! @Spotify @SpotifyUK \nThank you for listening 🖤 https://t.co/XwcRN7NxWr ...Time for me to take a little break over Christmas and new year to be with my family and friends. I will speak to you all soon. I love you. Be safe and have a beautiful time. Always and forever. Sam xx After a year and a half of travelling I am finally back home in London!! Farewell 2018. This year has been a year of love, travel, music, lessons, ups and downs, but most importantly a year of YOU... my fans. I’ve loved spending this year with you... https://t.co/5z638WPug0 ❤️ https://t.co/QX5FVaJo61 One more show left this year with these beautiful humans 🖤 Performing alongside you all every night is a fucking honour x https://t.co/01GGSarpKr Farewell The Thrill Of It All x https://t.co/jPCiufTXGM Tonight is officially the last night we are performing with our beautiful stage. We’ve been through so much on this stage &amp; I can’t tell you how sad I am to see it go. We gotta go bigger and better next time guys!! Perth we can’t wait to send off TTOIA stage and tour with you 🖤 https://t.co/Oj8lCLUJuv Tree Beard https://t.co/5C7Z67oB3n SYDNEY. Emotionally exhausted from these shows!! Your energy is out of control!! I can’t believe there’s 3 shows left of this tour 😭 https://t.co/UvBCF0C3Ic 🖤 https://t.co/mYkoLcMxSW Tonight Mathew, I am gonna be... @GloriaEstefan https://t.co/Fyl4JOpmZr Walk-walk passion baby, work it I'm a free bitch baby https://t.co/jcEsRQ7bEW Melbourne to Brisbane https://t.co/0ZCcBiFryG Melbourne. Thank you for the last few days. What a wonderful way to kick off this Australian tour. 93 shows down &amp; 7 more shows left this year. Madness 🖤 https://t.co/6c1NMI8dKw https://t.co/0KJyXMI9bJ So excited and honoured to be a part of the new adaptation of Watership Down, showing on @BBCOne this Christmas and internationally on @netflix. This story is so powerful and timeless and it's been thrilling to work on a song for it. I hope everyone loves it as much as I do x Thank you to everyone who has listened to or downloaded my song with @brandicarlile 'Party Of One'. So grateful for all your support, which helps to raise funds and awareness for Children In Conflict https://t.co/6CpCFDxzYj Can’t believe I’m about to say this. Found out today I have officially sold over 20 million albums! What the fuck! Unbelievable news. Thank you to all my beautiful fans for your continuous support and love🌈❤ https://t.co/tM8QTEmjuy BANGKOK! Me, my team, my family &amp; friends are all so emotional right now. I couldn’t of wished for a better night to end this incredible leg of the tour! YOU WERE PHENOMENAL TONIGHT! To my fans in Asia, I am deeply in love with you all. ❤️ Speak to you all in Auckland ❤️🌈 S xoxo https://t.co/2YWeSCt2qb Oh my dear god. Clearing out my house and found my 21st birthday card from my best friends 🤦🏻‍♂️ thought I’d share 🤦🏻‍♂️ https://t.co/yK2ITn7bB6 @GordiMusic I can’t wait xx your music is so beautiful Magic is in the air ✨\n‘PROMISES’ is out everywhere now! Thank you for listening https://t.co/rro4NWOSCq x @CalvinHarris https://t.co/bQyV5Hly2g 🙌🏻 https://t.co/SuxIAXDyBC RT @CalvinHarris: Promises back at number 1!!! 6 weeks! 😵 @samsmith https://t.co/uL7LCIiZxr I’m so thankful she asked me to feature on her single. I hope you all love this as much as I do. And I hope this raises as much support as possible to the incredible charity @CInConflict and its partner, @WarChildUK, of which I’m a global ambassador. Thank you for listening x I am so excited for everyone to have Party Of One in their ears and hearts Working with @brandicarlile is truly one of the highlights of my career. Her voice and songwriting get me through the dark days. Brandi is a mentor to me and now a friend. https://t.co/idNa3KetyN Tomorrow 🖤 @brandicarlile I love you. I’m so excited x https://t.co/Z1ld1L4zcV Exploring Kyoto https://t.co/2OA2R9HXZU OSAKA. Arigato gozimasu x https://t.co/mcTdah8UZR CONGRATULATIONS TO @Santandave1 ON YOUR NUMBER ONE!! I love you to bits. Watching you shine and take over is so special. One of the truest and greatest talents I’ve ever known. And congrats to my family at Method &amp; Neighbourhood ❤ FUNKY FUCKING FRIDAY EVERYDAY https://t.co/6IwLYFx0Y1 Excited to share the Promises live video, filmed at #TheThrillOfItAll Los Angeles shows. It's been so much fun performing this live and dancing with everyone  🖤 https://t.co/Z03RCmEh0B https://t.co/JWHprDGpwJ Sam and Takeshi take Tokyo xoxo https://t.co/jfuewg43ei RT @CalvinHarris: Promises vinyl is out now 🤜 https://t.co/ArHOX6GxSc Atomic Kitten in Tokyo https://t.co/Jin43is90b SEOUL, YOU READY? https://t.co/OJEtoC3rIn Gwangjang Market. Best part of my job is the music and the shows, second best part is getting to try all these mad and different foods. What an amazing day. P.S. this was genuinely nice, wasn’t just saying it x https://t.co/EviZE4gOrj Seoul https://t.co/JVRCnPnIIl RT @CalvinHarris: Thank you for 5 weeks at number 1 with Promises !!!\n@samsmith @Jessiereyez xxx https://t.co/F7XaoipfiB RT @SonyMusicUK: 👏👏👏\n\n@samsmith: Wouldn't it be funny if we spent a FIFTH week at #1 with 'Promises'? \n\n@CalvinHarris: It would make up for… RT @mca_music: Congratulations to @samsmith for reaching 8X Platinum record for ‘The Thrill Of It All’ in the Philippines 🇵🇭🙌🏼  #SamSmithAt… RT @sbooth29: Ellie has learnt some new ‘words’ #samsmith @samsmith https://t.co/fMXkx61iZP SINGAPORE. I can’t express how full my heart is tonight. Thank you for having me in your country. I’m sorry it took so long!! ❤️ https://t.co/NZivCIQu0j 💙 https://t.co/nznbnX6nKx Singapore. Night 1 was a dream. Thank you all for coming. Massive shout out to @mrkimjones &amp; @dior for my new looks. I’m obsessed xo https://t.co/P67CkqvSyv Singapore x I’m so excited to see you all tonight 🌻 https://t.co/nt7u4kKQPv Work Hard • Be Kind • Stay Strong ‘Sometimes opportunities float right past your nose. Work hard, apply yourself, and be ready. When an opportunity comes you can grab it.’ - Happy Birthday to the beautiful Julie Andrews. Thank you for all you do x https://t.co/Ku8xVy0jjT RT @officialcharts: They ain't going anywhere! @CalvinHarris &amp; @samsmith are locked in for another week at Number 1 with Promises. 🏆 https:… Fourth week at number one in the UK. Thank you to everyone who has supported this song. Sending giant kisses to @CalvinHarris &amp; @Jessiereyez right now xx https://t.co/JshSXe3jaw https://t.co/Ojt3NjF9gN 🖤 https://t.co/ASXWROGfFo RT @PeaceOneDay: Check out this incredible film, released on #PeaceDay at the #IHeartFestival, partnering with @iHeartRadio and @23andMe. W… @samsparro Congrats gorgeous x 🚗 @theststyle https://t.co/UMqu6kvKap RT @TheSTStyle: Cover star @samsmith opens up about his anxieties, and explains why dating is great fodder for songwriting https://t.co/twd… Hello beautiful people. Thank you for your lovely messages. Just been to see my voice doctor in Boston after last night’s scare in Vegas, everything is luckily ok but I need to rest it this week in preparation for the start of Asia tour. I’m sorry everyone. All my love, Sam xx https://t.co/r3zRhNm2wB Dear all, Due to unforeseen circumstances which transpired after rehearsal, it became clear that I’m sadly unable to perform at the iHeart Radio Music Festival in Vegas tonight. I am so so sorry about this and I want to apologise to all my fans. All my love, always. Sam x RT @officialcharts: Unstoppable! @CalvinHarris &amp; @SamSmith extend their reign at Number 1 for a third week on the Official Singles Chart: h… RT @ColumbiaUK: When you reach #1 for the third week in a row... 😏 #Promises \n\n@CalvinHarris \n@SamSmith https://t.co/goKcmOzJis 🍉 https://t.co/YjB16yguMs 🖤 https://t.co/BgE71oJwSm RT @UMusicuk: SAM SMITH x SUNDAY TIMES STYLE 🖤 https://t.co/Yinr3uDlae RT @SundayTimesLC: ANOTHER EXCLUSIVE! One of the most talented and pleasant men in music @samsmith on our @theststyle Men’s Fashion Special… SUNDAY TIMES STYLE @TheSTStyle\nWords: @ScarRoseRussell \nWearing @DriesVanNoten\nPhotography: Beau Grealy \nStyling: Charlie Casely Hayford https://t.co/4nMusiQO3E RT @PopCrave: “I’m Not The Only One” by @SamSmith has reached 600 MILLION streams on Spotify. It is his third most streamed song on the pla… @Elie_Fahed 😭❤️ what a gorgeous girl Sangin https://t.co/GWnkeP776X Brits abroad in Hogsmeade 🇬🇧🔮 https://t.co/DICPOxIJKq RT @CodyLaGrow: when @samsmith says he needs my green light https://t.co/7akEzip36I RT @TheComedyStore: Thank you @WhatsupDanny for putting on a great show and @samsmith for coming in! Next Weho Brunch is October 12th! #The… ❤️ https://t.co/rLfBBz5FCZ RT @CalvinHarris: Thank you for our second week at number 1!!!! @samsmith https://t.co/bj18oL9AbY Day and night, say that you’re mine https://t.co/y064eltGV2 Calgary, thank you for tonight. Brought me to tears. What an end to a truly special North American tour. Every time I get on stage and see you all I feel truly happy. Thank you for having me in these amazing cities. I’ll always be there as long as you’ll have me. https://t.co/D68070i3Hr Edmonton x Last night was so fucking beautiful. https://t.co/FXst6o7DNd https://t.co/tLyxnjqhfP Last two shows of the North American tour tonight &amp; tomorrow. Can’t believe it PROMISES on Vinyl!! I can’t wait to hold this in my hands 😍https://t.co/DE0dYTaO4x https://t.co/U7PNXqBiJS I love pop music Seattle! What an amazing show. That was our last show in America!!!! I love you all &amp; I can’t wait to be back. We had a bus party last night. Loads of crying and dancing to Robyn!! Canada tonight! p.s. to whoever gave me these light up initials, thank you! I love them haha! https://t.co/bNZ2lQYW8c Cape Town, so excited to see you next April! We've just added a third show, tickets at https://t.co/bBYtha53Tz The first two dates are sold out. Thank you ❤️ https://t.co/FA1LuK2GsG Will you show me the piece of my heart I’ve been missing @CalvinHarris @Vevo 😩 Happy birthday Too Good At Goodbyes  🍰\nYou are 1 year old today x https://t.co/Zg7uXfpXS7 RT @Kehlani: check on ur friends even the strong funny ones RT @CalvinHarris: Promises is number 1 in UK!!!! Thank you so much 🙏🙏🙏 Buzzing you like it as much as I do... @samsmithworld what a blessin… RT @officialcharts: They can't do golden rings… but they *can* score a Number 1! @CalvinHarris and @samsmithworld hit the top with Promises… GUYS!! Just found out that Promises is number one in the UK 🇬🇧 ❤  So grateful for my 7th number one 😱 and to everyone who's listened and watched the video. It's been incredible working with @CalvinHarris and I'm so proud of the track. Means the world that you love it too xx https://t.co/3hPUMBtvBy San Francisco https://t.co/zH27YqCR0T PROMISES @CalvinHarris\nThe official video is here!! Watch now at https://t.co/1u6Bw00V9l 🖤 https://t.co/dMLZ3Ea6qR RT @billboarddance: Meet the dancers from @CalvinHarris &amp; @samsmithworld's ball culture-inspired \"Promises\" video https://t.co/cxrXQpY0Rs h… Honoured to be on tour with you @bethditto ❤️ I love you so much x https://t.co/ghu20seIQj RT @CalvinHarris: Promises w/ @samsmithworld video is out now!!!\nhttps://t.co/5oMW664QSk RT @outmagazine: Watch @samsmithworld get ready for the ball in \"Promises.\" https://t.co/tXHJG80p00 So excited to show you the official video for Promises. Never had so much fun shooting a video. Felt like a normal horse meat disco Sunday night in Vauxhall haha!\n@CalvinHarris https://t.co/1eFpgAQH7g RT @CalvinHarris: Promises video coming in 9 hours !! @samsmithworld https://t.co/sdsNtSXrRz PROMISES @CalvinHarris\nThe official video\nTues Sept 4th, 8am BST https://t.co/Stdw929Qh1 Such a relaxing day off today. Started reading this new book. It’s a beauty. I recommend x https://t.co/ftUTvo3OCI San Diego. What a night. One of my favourite shows of the tour. I love you all very much x https://t.co/ED2NbdzCKC RT @CalvinHarris: 💫💫💫 https://t.co/E8x8MWcN3L PROMISES - OUT NOW - https://t.co/HLzSJYfgVA https://t.co/leLx1nGzXW Capitol tower. Home away from home @CapitolRecords https://t.co/DoDRfmHtI0 ❤️ https://t.co/SHcA3zZqCe RT @CalvinHarris: If you haven’t heard it yet, here is my new record with Sam Smith, have a listen ▶️ https://t.co/vWvYMSdIIp Magic is in the air... ✨ https://t.co/rCtIxe0lH1\n@CalvinHarris https://t.co/TSuaXV2sa3 STAPLES NIGHT 1 - photo by the legendary @JAMESMSBARBER https://t.co/otwKQymFZR South Africa 🖤  \nSo excited to see you in April! Tickets go on sale August 30th at 9am x https://t.co/wzV9lzHXmk RT @STAPLESCenter: The name’s Smith, Sam Smith 😉 @samsmithworld https://t.co/v027SEOWqk RT @STAPLESCenter: .@samsmithworld performing his new song #Promises that he just released with @CalvinHarris 🔥🔥🔥 https://t.co/aqAYgc04KL RT @fellzy: This guy absolutely tore the house down tonight. The entire @QuincyDJones team was blown away; one of the best male vocal displ… RT @BrianEBee: This Queen just told us all to pretend like we’re at @TheAbbeyWeHo, before launching into his new song with @CalvinHarris 🤣🤣… Macau 🖤\nBringing The Thrill Of It All World Tour to you this October. Tickets go on sale 10am local 30th August https://t.co/LDpZkq9kPz I am so excited to be bringing the tour to South Africa!!!!!!!! RT @BigConcerts: The sensational @SamSmithWorld will be bringing his #ThrillOfItAll tour to SA in April 2019! Don’t miss this incredible ar… RT @ElBroide: It's happening! @samsmithworld is bringing his 'The Thrill Of It All' tour to South Africa in 2019! Everything you need to kn… I wanna go camping so badly at the moment. No idea why https://t.co/3j6J0wtQoi @gracedavies Thank you gorgeous x .@calvinharris  Hahahahahaha #promises https://t.co/ccpjj8omsZ @iamTanika 😭🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻 RT @CalvinHarris: Just got my 32nd top 10 UK production with Promises...Thank you so much 🤯🤯🤯 @samsmithworld SALT LAKE CITY. That was a VIBE!! So much energy. I love you all so much. I hope you had a beautiful night xx https://t.co/fq8jB3mtTe It has always been a dream of mine to work with @calvinharris and I'm so proud and in love with this song. I had so much fun writing this tune with Calvin and @Jessiereyez and I hope you can hear that. Turn it up and let's dance our way into tonight https://t.co/rro4NWxhdQ https://t.co/kJfgRVXmU0 RT @BBCR1MusicBot: Now Playing Calvin Harris, Sam Smith - Promises @CalvinHarris, @samsmithworld https://t.co/kxT7rHET3q RT @officialcharts: Promises by @CalvinHarris &amp; @samsmithworld set for a Top 5 debut on this week's Official Singles Chart https://t.co/xTS… Cuddling strangers dogs on the streets of Denver. https://t.co/Bg3HGITVDL Gorgeous people, thank you for all your amazing messages about PROMISES 💍💃🏼 \nYou can watch a new video exclusive to @Spotify at https://t.co/TMyZKgQdnZ xx\n@CalvinHarris https://t.co/DxVVZDVCxB Magic is in the air #promises @SGLewis_ @CalvinHarris ❤️ thank you bro xx RT @SGLewis_: The new @CalvinHarris x @samsmithworld is fucking excellent isn’t it?🔥🔥🔥 @DUALIPA @CalvinHarris LOVE YOU! I’m so happy you like it ❤️ RT @CalvinHarris: Number 1 WW iTunes with Promises !!! Thank you so much!!! @samsmithworld https://t.co/eGvdavL1cI Thank you @Spotify 💚\nhttps://t.co/m3AfB6tavv https://t.co/YSuqZXzW9w RT @malibulox: it was not easy to do this but I wanted to show my support there are your in this new phase and I decided to spread #promise… @JKCorden 😂😂😂😂😂😂😂😂 Hahahahahaha. Shit, delete delete delete. Send me those videos though 😘 ‘PROMISES’ everywhere NOW!! @CalvinHarris  ❤️❤️❤️❤️ https://t.co/YY7IxxyLfe https://t.co/m8pj8SrQ3H RT @CalvinHarris: Promises w/ Sam Smith is out NOW everywhere!!! @samsmithworld\n\nhttps://t.co/vWvYMSvjzX https://t.co/MfNEl1QbG0 RT @997now: @samsmithworld .@BigReidRadio is feeling himself way too much with this one 🕺🏽🔥#Promises #NewHitMusic https://t.co/mDoCOnUre8 RT @gagaoutsvng: i make no promises I can’t do golden rings but I’ll give u everything tonight @samsmithworld https://t.co/Oc8WB0FDAc Send me videos of you dancing!!!!!!!!!!! TWO FUCKING MINUTES RT @Welcm2paradise: Waiting til midnight for @CalvinHarris &amp; @samsmithworld for #promises https://t.co/VwiMGjlaS9 I’m really fucking excited for you all to hear this tune Farewell Mrs Franklin. You may have left this world but your music walks through our lives with us, getting us through, healing our broken hearts, teaching us how to love ourselves. Like a bridge over troubled water x Every year I listen to your voice more than I did the year before and like an old friend the bond I have with your talent and music gets deeper and deeper... Aretha. Where do I start? Your voice and your spirit and soul has leaked into my heart and mind and spirit since I was a child. One of the very first songs I remember hearing as a human was ‘I say a little prayer’... https://t.co/8vOebR5Af8 SANG MY TOOSH OFF LAST NIGHT COZ THE ENERGY WAS OUT OF CONTROL! I love you so much Chicago ❤️🌹 https://t.co/e2GYueggba 1 more day 😩🎼☝🏼💍🙌🏻 @calvinharris #PROMISES https://t.co/CLdAkg8XUf SAINT PAUL. It’s so fucking good to be back. Thank you for last night, we all loved every single second of it. I hope you’ve all got home safe &amp; I really hope to be back soon xx https://t.co/ZVtfQB964K ✌🏻❤️ @CalvinHarris #Promises https://t.co/mYaQt9xt1Q RT @CalvinHarris: CALVIN HARRIS // SAM SMITH // very excited about this one !!! @samsmithworld coming Friday https://t.co/U7jOqJsPtx Surprise!!!! I’m so excited for you all to hear this song. CALVIN HARRIS // SAM SMITH // PROMISES - Coming on Friday. Pre save at https://t.co/UxA71pJm2N 🌹@CalvinHarris https://t.co/bTcuwSOpBq Had the most beautiful few weeks with family and friends in California. Basically been listening to music non stop &amp; laughing and eating 🥑🎼 Second leg of tour starts on Tuesday in Saint Paul. Can’t wait to see you all xxxx https://t.co/IWVcneWb2q I wasn’t gonna post for a few weeks, but just found out we hit 10 MILLION FOLLOWERS ON INSTAGRAM!! Celebrating in the ocean today 🌊🙌🏻 love you all.. This cyber love is strong x https://t.co/kZDmCk9bmv Thank you for such a special first half of our North American tour. Me &amp; my entire team have made memories that we will never forget. I’m going to have a little social media break for a few weeks now. I’ll see you in Saint Paul on the 14th of August!! I love you all very much 🌹 https://t.co/I2VEfnfwix I promise I’m happier than how I look in this picture. Monterrey last night was UNREAL x so high right now on Love and life x https://t.co/cjdqok3m98 Mexico here we come x https://t.co/pkNcScPsQ1 The world is deeply In Love with you @ddlovato xx Had the most amazing day at a friends house in Dallas yesterday, eating home made BBQ and deep frying a turkey and playing some amazing games. Been away from home for a while now &amp; really needed this ❤️ https://t.co/RUfI6oQIYl My manager got the most amazing video of you all last night Houston 😭 thank you for such a magical show x https://t.co/DoGS2QlW4u Farewell Orlando. Tampa we are coming for you next. Show 46 of The Thrill of It All world tour 🙏🏻 https://t.co/QajAIjjqJt RT @bethditto: OVER THE MOON to be touring the US with @samsmithworld this August+September! GET READY! Tickets are on sale now! https://t.… Georgia x \n@JAMESMSBARBER https://t.co/hTwunmtyMk https://t.co/hN7bYFxBIW ✨ Happy 4th of July America ❤️ Be safe &amp; have all the fun xx https://t.co/iMQgSlK2pc ‘We were reaching in the dark, that summer in New York’ https://t.co/6bRmDJqyPy Driver roll up the partition please https://t.co/tOFcVhSLl8 So ready for this https://t.co/aHqHFr5h7t MSG 🙌🏻 https://t.co/OCwjH2Adat Boston. Had me in tears last night. Brooklyn tonight. Can’t fucking wait x https://t.co/Sh8XOMUJ5I Beautiful people. Me and my wonderful friends filmed a special video for Baby You Make Me Crazy in Verona, one of the most romantic cities in the world. https://t.co/trTQr0lBbX It was such a magical experience to be surrounded by all that history and beauty. I hope you love it x Montreal. The sun is out and we can’t wait for tonight x pic by @jamesmsbarber https://t.co/TaGMFDGuJe Beautiful few weeks off in California. Ready to kick off our North American tour in @Drake‘s Kingdom - Toronto - TOMORROW!! Can’t wait to see you all there xx\nhttps://t.co/YO6uidRvHP https://t.co/yNo2G2sIzb There's dread in my heart\nAnd fear in my bones\nI just don't know what to say https://t.co/p7tIllhWiz Too Good At Goodbyes. The Thrill Of It All 🖤 https://t.co/ox0CoCL0gm https://t.co/oMZMzS3hyf 💚Always and forever in our hearts https://t.co/xwu5U4t0QM Shanghai x \nBringing The Thrill Of It All World Tour to you this October. Tickets go on sale 10am local 22nd June 🖤 https://t.co/qajdM4PKCF THRILLS https://t.co/SLUNn8UCo2 https://t.co/80njGEj0U1 #TheThrillOfItAllWorldTour North America\nONE WEEK!!\nI've missed performing for you so much, can't wait to see all your beautiful faces  🖤😭\nhttps://t.co/YO6uidRvHP https://t.co/gxQ6gXcx5s Bangkok 🖤\nSo excited to see you this October! Tickets go on sale June 30th x https://t.co/s08FFw75oy Music was my first love, and it will be my last  https://t.co/HQ2gb2lgXO https://t.co/JfzNtE6xSn Bejing x \nTickets for my show at Cadillac Center have just gone on sale https://t.co/j7KEXaFGc8 See you in October 🖤 https://t.co/S5IVZSavMQ https://t.co/2elJz6hvAm Why am I so emotional This made me cry xx thank you so much xx https://t.co/fOdILPzBDj Beijing! So excited to bring The Thrill Of It All World Tour to you 🖤 Tickets go on sale 10am, June 7th x https://t.co/26DQOQVMJq ‘Me and my confidence. We are now more than friends. We’re growing up slowly’ - @mariamena_no RT @BBCR1: We laughed, we cried (a lot) - that performance had it all @samsmithworld 👏\n\nWe're no good at goodbyes - so let's just say see y… RT @huwstephens: Last week I was in a shop in Swansea and the nice ladies there said ‘Can you deliver a Love Spoon to Sam Smith from our fr… SATURDAY 🖤\n@BBCR1 https://t.co/4z2xsN1QTM Shooting PRAY.  \nThank you to everyone watching the official video, over 10 million views 🖤\nhttps://t.co/HcJ1gbuou9 https://t.co/dFe7BFerfl PRAY live on The Thrill Of It All World Tour x\nThese shows have been INCREDIBLE. North America next 🖤 https://t.co/GQ5LsZUHjz @adamlambert ❤️ @TheEllenShow LOVE YOU ELLEN X RT @TheEllenShow: Happy birthday, @samsmithworld! I hope you have a year filled with joy and an album filled with heartbreak. Thank you so much to everyone  donating to @WarChildUK for my 26th Birthday. There’s still a few hours of the fundraiser left so please give what you can and share the link https://t.co/V9hdBXtobq so close to the target 🖤 https://t.co/Kk0r118StE Xx https://t.co/9HBKKRAmtU Thank you x https://t.co/au1Oi9XsZx TWENTY - SIX https://t.co/P1rSnELeL3 It’s my birthday and I’ll cry if I want to https://t.co/BaGIeht1ad Australia &amp; New Zealand... the gorgeous @PalomaFaith will join me for my #TheThrillOfItAllWorldTour shows. Such an incredible artist, so excited xx THANK YOU SO MUCH to everyone who's donated to my 26th Birthday fundraiser for @WarChildUK... just two days to go!! Please keep sharing the fundraiser page and donating whatever you can https://t.co/ytJHudmJxc I love you all 🖤 https://t.co/Y2goZwzOAi Blue https://t.co/V0VgaXmZ8r 🖤 @WarChildUK https://t.co/B1LDXwJzOW Italy x the last few shows have been out of this universe. Thank you for giving me your all. I’m so thankful, and filled up with love. SPAIN - here we go.... X see you tomorrow Barcelona! https://t.co/geWAciAnVQ Thank you all so much for my birthday donations to @WarChildUK so far 🖤 Just one week left for us to hit our target! Please keep sharing the link  https://t.co/7173tVVZdE… xx https://t.co/GQwuhww0ev North America... x \nSo excited to see you again next month for The Thrill Of It All World tour! You can find shows and ticket information at https://t.co/YO6uidRvHP Let's have a massive singalong 🖤 https://t.co/Spykp4VUaU RT @HYPEBEASTMusic_: .@samsmithworld and @Logic301's @Timbaland-produced single gets a reflective visual https://t.co/pGJ9Jh5sRr Im not a saint. Im more of a sinner. https://t.co/HcJ1gbLZlH https://t.co/XHzzUlOyCS RT @RecordingAcad: What better music video backdrop for a spiritual track such as \"Pray\" than an Italian villa? Directed by @JoeVConnor, @S… BELLA VITA 🇮🇹 https://t.co/62pQGbm5fE Singapore! My October 2nd show has sold out, thank you all 🖤 We've just added a second date at Singapore Indoor Stadium on October 3rd, you can find tickets at https://t.co/feoIdUXBjx #TheThrillOfItAllWorldTour https://t.co/2htIXwBVDt PRAY ft @Logic301 x \nhttps://t.co/DNZcBpAAiM I'm so happy to share this with you... the official video for PRAY ft @Logic301 https://t.co/HcJ1gbuou9\nThe vision for this video is so exciting to me, and different to anything I've done before. Thank you to the amazing director @joevconnor, to Logic, and everyone involved x PRAY.\nOFFICIAL VIDEO 6PM BST\n@Logic301 https://t.co/LQntZfiuui CANNOT WAIT for you to see this.  Pray feat. @Logic301 official video. TOMORROW https://t.co/B32oW7irMu £26K – could support 85 families in Yemen for 4 months OR could pay for 300 children to attend a Child Friendly Space for a month. They can play, learn and gain the support of specialist child protection staff who can help them deal with all they have faced. £10K - could pay for 150 children to attend a Child Friendly Space for a month. Keeping them off the streets and in an environment where they can be children again... 5K - could save 5 children's lives by reuniting them with their family or being placed in a safe foster family. Please share this link, spread the word and donate what you can.\nhttps://t.co/B1LDXwJzOW\nAgain, a huge thank you for helping to make a difference, I love you all xx Guys... Thank you so so much for your donations. It means the world to see such incredible support for such an important cause. So, I'm wondering, since it’s my 26th Birthday this month AND we've already hit over double the target... can we make it to £26,000 for @WarChildUK??!! https://t.co/CGQF4k0sA9 Release the leg type of day https://t.co/ty0n0eKdNj Pray feat @Logic301\nThank you for all the love you've shown this track. It was amazing to collaborate with Logic, a truly special artist. Watch an exclusive video on @Spotify at https://t.co/kaYSur3aUf x https://t.co/bveD8dDnWn TOMORROW @spotify @Logic301 https://t.co/P0OMvfgoqD PRAY\nhttps://t.co/m8xpKAiaG8 https://t.co/D3oMT0u1UL Singapore, I’m so excited to bring The Thrill Of It All World Tour to you. Tickets are on sale now https://t.co/1ZwGhxnOfs x #THETHRILLOFITALLWORLDTOUR https://t.co/NqG1yzedPi Me and my divas https://t.co/a1eSEkG3LD Paris🌹photo by @jamesmsbarber https://t.co/EiT8LB1uPD Hello beautiful people.. Plans are underway to open an LGBTQ centre in East London -  this will be a safe &amp; supportive space that will open up many new opportunities for members of the LGBTQ community. Find out more &amp; please show support https://t.co/ktqsk5GgW9 x @LdnLGBTQCentre I'm Still Standing, the @eltonofficial Special, airs on @ITV tonight at 10.45pm. Such an honour to be a part of this tribute to an incredible artist and friend. x https://t.co/Dfh1EEnvy4 ...who have been affected both physically and mentally by war. Let’s keep donating and spreading the word. Love is the answer x Thank you, Sam x https://t.co/B1LDXx1aGu https://t.co/D11coIOtiq Happy Sunday everyone. I’m absolutely blown away and so touched by all your donations already! Thank you all for your kindness. I have seen with my own eyes the incredible work @WarChildUK are doing to support and help innocent children all over the world... Day off in Berlin. Not leaving this spot https://t.co/aHOfoUpzga Was so lovely to sit down with @george_ezra a few weeks ago and do his podcast xxxx it’s out now!! George Ezra and friends. Go check it out. Thank you for having me sir. You are truly one of the kindest and truest and realist x https://t.co/VFw5oKJbgf https://t.co/G9rTtRehOa Oslo. Thank you so much x I love you all. https://t.co/FZ25AGQjg9 I want to live in Copenhagen https://t.co/buNE2AiuKN @charlieputh Can’t wait to hear it sir x @natashabdnfield ❤️😭❤️ I have just found out that ‘Too Good At Goodbyes’ has sold 10 MILLION COPIES worldwide. My heart is crying right now. Thank you to every single person who has purchased and supported this song. I love you all so deeply xxxx https://t.co/0h7JGn7u0o RT @camcountry: Ok you asked for it, so I made my version of Palace available everywhere! (Spotify, iTunes, Apple Music, Google Play, Amazo… Last night in Stockholm x https://t.co/renJtSIKkJ The European tour BEGINS 🚀 xx Stockholm that blew my mind. Thank you for singing your hearts out and coming away with me for the night xx I love you unconditionally. Photos from @JAMESMSBARBER  #THETHRILLOFITALLWORLDTOUR https://t.co/7bDyk9qW2A Me and my wonderful singing teacher Yvie Burnett x my life saver on this tour https://t.co/w4ADaxebPM Maybe I’ll pray...\nhttps://t.co/m8xpKAiaG8 https://t.co/P85KCYivsP “Gratitude is riches. Complaint is poverty.” - Doris Day RT @BBCR1: 🔁 @claraamfo wants to rewind a @SamSmithWorld cover from the Live Lounge at midday, but which one to choose?! \n\n@EdSheeran, @Pin… Seoul, so excited to bring The Thrill Of It All World Tour to you this October. Tickets are on sale now https://t.co/iM1XZ4CVfl #THETHRILLOFITALLWORLDTOUR x https://t.co/O0HIibPNH2 MANILA! Tickets for my show at @MOAArena are on sale now https://t.co/gKgYsJFfRa. So excited to see you x #THETHRILLOFITALLWORLDTOUR https://t.co/qQTifvblm2 Curls https://t.co/T5Isaban4g ❤️🌹@JohnNewmanMusic https://t.co/RzhzYaF3Ye Beyoncé at coachella looks out of this world 🔥🌹❤️ @aaronamoso03 See you there babe x RT @aaronamoso03: gotta spoil your best friend sometimes😁 ready for @samsmithworld ! https://t.co/j3nDwl5YpL I love these humans so fucking much. https://t.co/egWOX2ti35 @AttitudeMag ❤️❤️❤️❤️❤️❤️❤️❤️ @littlebigtown Thank you ❤️❤️ you guys are sensational 🌹🌹🌹🌹🌹🌹🌹🌹 TONIGHT. Watch the @eltonofficial special 'I'm Still Standing' from 9pm on @CBS, in celebration of the new album #EltonREVAMP. Elton is an amazing artist, friend, and a huge inspiration to me. This was such an honour. xx\nP.S. I LOVE YOU @KeshaRose\nhttps://t.co/CLbH36Yxv3 https://t.co/5izm8SKhug RT @HenryFricker: @samsmithworld was just awe inspiring last night. One of the best concerts I’ve witnessed, thank you 🙏🏼 https://t.co/V65w… RT @jemmataylxr: Just when I thought I couldn’t love @samsmithworld more than I did. Last night was incredible 🖤 https://t.co/3kd8nTFGUe RT @camcountry: ✨ P A L A C E ✨ \nLive from London tonight with @samsmithworld @TheO2 https://t.co/7RXNQ4VUIK En route x https://t.co/8SCPsi4plk RT @MrBrunoMajor: Tonight will be my final arena show with @samsmithworld ...see you onstage at 7:45pm 🌙✨ 📸 @andytsv https://t.co/bRfWp9mOpL RT @TfLRail: @SamSmithworld plays @TheO2 this evening. You may ask us How Will I Know travel plans to see him? That’s easy. Just click here… @camcountry @TylerSamJ You are out of the world. Honoured to have you on stage &amp; know you and call you a friend x RT @camcountry: Wrote #Palace with @samsmithworld &amp; @TylerSamJ...and tonight, I got to sing it w/Sam for the 1st time...AT THE O2!!! 😭\n\nSam… RT @TheO2: That moment when #TheO2 lights up with @samsmithworld ✨😍 https://t.co/NQLoeNJlH6 LONDON. LET’S GO https://t.co/Qo2rVLKRIp #TheThrillOfItAllWorldTour https://t.co/oe6kLPTtBd Gratitude BIRMINGHAM 🌹Thank you so much for two beautiful shows xxxxxx I love you with all my heart. Singing scars in the city me and @bpgbass wrote it in was so magical. See you soon xxxx https://t.co/XRSPQQKzLY @MrBrunoMajor I love you Bruno xx so honoured to tour with you man!! ❤️ @paulaparsons45 @joeykanowee1 Love you xx miss you xx RT @supadupastacey: @samsmithworld HIM was EVERYTHING! Love IS Love 🏳️‍🌈 my Him is a her and I too am PROUD 🏳️‍🌈❤️ @_alicetilly ❤️thank you x RT @amazonmusic: .@samsmithworld gives \"Pray\" a remix, with @Logic301 making a guest appearance. #JustAsk, \"Alexa, play the Song of the Day… MERCH https://t.co/llZMvCK4jc Thank you @claraamfo. Pray feat. Logic is Tune of the Week on @BBCR1 🖤 Take me to your river https://t.co/PMFG2v5vej 🖤 https://t.co/A5deGXHvOf Be real. Be you. Start your week of with a smile and a coffee everyone xx Happy Easter from me and my chicken wings https://t.co/Tjun9k0tc9 I love singing so much I'm young and I'm foolish,\nI make bad decisions https://t.co/zvXxSgRt3a Farewell Ireland xx I’ll miss you Listening to the lord of the rings film music. Howard Shore is a genius x You lift my heart up https://t.co/cjOFpJ8Y4r 007 called and said we need EXTRA drama https://t.co/VHl8kahXoV Honoured to have @Logic301 join me on PRAY. I’m such a fan of his work &amp; his inspiring lyrics. Thank you logic for blessing the track xx\nhttps://t.co/m8xpKAiaG8 https://t.co/8cW72b33RV @krischin Successful RT @Logic301: This is the most important feature I've ever done. Writing from the perspective of someone who feels unwanted and un accepted… RT @AnnieMac: ❤️🚀 https://t.co/tnojcIYLH1 . @AnnieMac @BBCR1 today from 7.30pm 🖤🖤\nhttps://t.co/VH4XU9h0Md https://t.co/kz357aDQTq RT @AmiyahYoung: best thing to wake up to 😍😍😍 https://t.co/gQJOBnqYQP RT @getstiggywidit: Already loved Pray @samsmithworld but Logic 👌 brilliant choice, can’t wait to see you next Friday 🙌 Gorgeous people... my new single Pray featuring @Logic301 is officially out now 🖤🖤🖤\nListen at: https://t.co/m8xpKAiaG8 https://t.co/zoc1UzEae0 @thedannybeard ❤️ I love my job. Thank you for making this tour possible x https://t.co/sv3UDdZKND PRAY ft @LOGIC301 \nTOMORROW https://t.co/D28N6wZDLK Manchester. I am floating after last nights show! The energy was OUT OF THIS UNIVERSE! ❤️ Thank you xx https://t.co/MTo8V5gmM8 My new single is PRAY feat. @Logic301 \nI am so excited for you to hear this new version of one of my favourite tracks on the album. It was an absolute pleasure to collaborate with Logic to create this, such an incredible artist x Released Thursday https://t.co/RXLLTv8qjM So happy to announce I've partnered with @PLUS1org so £1 from every ticket on #TheThrillOfOtAllWorldTour goes to @WarChildUK. Please support and help this incredible charity to protect, educate and stand up for the rights of children caught up in war: https://t.co/Syr35GgX94 https://t.co/cihdAqKoE7 So happy and overwhelmed by the The Thrill Of It All shows!!\nThank you for supporting me, it honestly means so much. I am incredibly grateful that I'm able to take this tour to so many of you around the world x https://t.co/YO6uidRvHP #THETHRILLOFITALLWORLDTOUR https://t.co/QLbutN8qhZ Grammys 2018 @Logic301 🌹 https://t.co/o7H6gKlR0u RT @nwiggins02: Love this @TheSSEHydro all rainbow for the man himself @samsmithworld which by the amazing concert!!! Yeah I will keep twee… @MsnHeyder ❤️❤️ RT @lisamcd2612: Sing song in the clyde tunnel leaving glasgow hydro after seeing the fabulous @samsmithworld 😍💖 @chris101285 https://t.co/… RT @Kaaayss: @samsmithworld didn't think I could love you any more than what I did but you just blew my mind tonight .. incredible 💖 #Glasg… RT @honestlyspn: One of the most emotional parts of tonight. Such an amazing night. Thank you @samsmithworld for coming to Glasgow and allo… RT @SammyMactaggart: Another concert over with.... girlies had a great night! Have to say, the staff at Hydro are great too!! Great seats!!… RT @katycatcaitlin: @samsmithworld 💕💕💕💕what a night !!!! https://t.co/MpZOfNWPTd RT @Leeziooooo: @samsmithworld I am proud to call myself a gay man in this generation 🏳️‍🌈 you made us feel at home and welcome and I thank… I can’t believe the SS HYDRO did this!! Has made me so emotional 🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈 https://t.co/u2Epzy66h5 @wildfreckle It wasn’t me! It was the venue! So amazing 😭 RT @mandychic1: @samsmithworld iv been to loads of concerts, you have beaten them all by far !! what a night your voice gets you lost in th… RT @Jackkbbrennan: A full on spiritual experience at @samsmithworld tonight 🙌🏽 RT @emilyosborneexo: @samsmithworld blew everyone away tonight!! So so amazing❤️❤️❤️ RT @PopCrave: 'The Thrill Of It All' by Sam Smith is now certified 2x PLATINUM in the UK.\n\nCongratulations, @samsmithworld! https://t.co/5F… RT @EllieGelsthorpe: I have absolutely no words for how amazing @samsmithworld was tonight!! I’ve said it once and I’ll say it again, you c… RT @AishaAToussaint: @samsmithworld Exceptional! You did it, I forgot about reality for the last two hours! Pray holds a very very special place in my heart x\n@Timbaland @JimmyNapes @AppleMusic https://t.co/yq9GhiWe4T For every show on the tour someone from my band or crew is choosing a record of the day. I'm so excited to be introduced to everyones favourite albums and to have them blaring before the show!! Todays record is... https://t.co/0qpTB5KBW6 #THETHRILLOFITALLWORLDTOUR https://t.co/r3ohFC6cDF RT @bpi_music: Big congrats to @samsmithworld as his latest album 'The Thrill Of It All' is now 2x Platinum in the UK!\n\n#bpiAwards  \n\n💿🇬🇧 h… @ollielarrr Oh my gosh!! This is the most thing ever! CONGRATULATIONS. She is so beautiful 😭 I’m happy to have minorly helped Hahahaha @george_ezra @JAMESMSBARBER ❤️ NEWCASTLE, you never ever ever disappoint. Last night was so wonderful x @JAMESMSBARBER #THETHRILLOFITALLUKTOUR https://t.co/GHuXMQVOxQ RT @NadineTaylor6: I didn’t think anyone would fill the void George left. Thanks @samsmithworld tonight in Newcastle you healed the pain x RT @hollyjadee_x: Gutted I didn’t get to see @samsmithworld tonight in Newcastle 🙁 RT @laugh_100: The biggest compliment I could pay @samsmithworld is that I felt whether he was playing to 5 or 5000 people tonight he would… 😂😂😂😂😂😂😂😂😂😂😂😂😂😩😩😩😩😩😩😩😩😩😩😩😩 https://t.co/1C1LqOy4WV Sheffield. You took us to the moon and back. Thank you for taking #THETHRILLOFITALLUKTOUR's virginity 🖤 https://t.co/TXradfKizr RT @JessicaEhallxxx: @samsmithworld I’m bringing my friend to your show tonight as she went last night and her boyfriend didn’t propose whe… RT @victoriathorpes: So went to see @samsmithworld drank tea, sang a couple riffs and left the world behind for a couple hours. What a terr… @paulaparsons45 @lauraalison86 I LOVE YOU PAULA RT @Jh9Hague: Ok but have you ever seen a more iconic t-shirt??? @samsmithworld https://t.co/kkBEaMOt3D RT @AmieBradwell: My mascaras running and my voice has gone but I’ve just had the best night of my life @samsmithworld 😍😭🤪❤️❤️❤️(everyone p… RT @chloetayls: .@samsmithworld puts on quite the show 👌🏻 https://t.co/znsFOrWjSV RT @leah_till: @samsmithworld  was unbelievable tonight... without doubt my favourite gig I've been to! ❤️❤️❤️ RT @Shan12xox: The best night ever @samsmithworld  thank you https://t.co/NiQ3zyNtsw WE HAVE LIFT OFF!! SHEFFIELD 🖤\n@jasonsherwooddesign #THETHRILLOFITALLUKTOUR https://t.co/MHlQAR71qP U.K TOUR LIFT OFF IS HOURS AWAY. LET’S GET SPIRITUAL ✨🖤 #THETHRILLOFITALLUKTOUR https://t.co/ghJJO7DZVc FIFTH HARMONY!!!!! NO!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! TOMORROW ❤️🌈🇬🇧\nhttps://t.co/YO6uidRvHP #THETHRILLOFITALLWORLDTOUR https://t.co/6U2eYv2eJ7 @MrBrunoMajor @Selimmunir @lithophyte_vw Fuck yeaaaaaaaaaaaaaah @clairebooth3003 ❤️ I’ll see you Tuesday Claire xx your courage and bravery is so inspiring to me xx Me and my dad https://t.co/rSJOWSRczy Three Days. #THETHRILLOFITALLWORLDTOUR 🖤🖤🖤\nIf you'd like the chance to win a pair of tickets to one of my UK shows... https://t.co/XsIhpE4Tvy https://t.co/uXK4IptKFv 4 DAYS 🌈🌈🌈🌈 #THETHRILLOFITALLWORLDTOUR https://t.co/RJGeT6IDHr RT @TheGarden: Tickets are ON SALE NOW for @SamSmithWorld's newly-added second show due to phenomenal demand at The Garden on June 30! Don'… New US shows on sale from 9am local today 🖤\nhttps://t.co/YO6uidRvHP #THETHRILLOFITALLWORLDTOUR https://t.co/o6uo0v9B2T 5 DAYS #THETHRILLOFITALLWORLDTOUR https://t.co/LD6K4jJwxS So honoured to receive this from the sensational @vincekamp, I am such a huge fan of his work. His paintings take me to a magical place. I love you Vince, and I’m really excited about the possibility of us collaborating in the future 🖤 https://t.co/yJinsy9YaI ‘Science is not only a disciple of reason but, also, one of romance and passion’ - what an incredible human. Every time we look up at the stars we will think of you Stephen Hawking ✨ https://t.co/4R1pjzIk0M Happy Birthday @QuincyDJones ❤️ Thank you for everything x @andrew2themic Thank you for listening. Your voice sent shivers all over my body! Don’t you EVER EVER EVER stop singing! Ever! ❤️ RT @HamburgSamSmith: 🎶Let's turn off our phones tonight\n&amp; rely on the stars\nWe've been so lost lately\nWe forgot who we are\nBut I got everyt… @merrellgomez This made me cry 😭 I can’t wait to see you gorgeous girl ❤️ I’ll be looking out for you xx RT @merrellgomez: My sister has been feeling like crap everyday for about 5-6 months now but despite that she manages to be positive throug… ANAHEIM! Excited to announce a new show for you as part of The Thrill Of It All tour. Tickets go on sale this Friday at 9am. See you on August 25th 🖤 https://t.co/I45YN4SUVq @andrew2themic YOUR VOICE ❤️ xx RT @MiguelAcostaTV: LISTEN | I don’t normally do this but it’s not every day you get chills walking down the street that didn’t come from t… NEW YORK I LOVE YOU 🖤 My first show at Madison Square Garden this June has sold out and we have just announced another date on June 30th! So excited to return one of my favourite cities and perform for you beautiful people x https://t.co/WEUpH1Q5cb A little creativity everyday, helps the demons stay away When you’ve sang ‘like I can can can’ 100 million times in rehearsal https://t.co/PsOVxs2txc See you in Swansea!! @BBCR1 x\n#BiggestWeekend https://t.co/j4de3VqMRt @lilyallen You can hear how much of your heart is in it gorgeous. That snippet of higher had me holding my breath xx can’t wait xx all my love All of @lilyallen ‘s new music is sounding UNREAL. I can’t fucking wait to sit and live with this album ❤️ YES LILY ❤️ ✌🏼🇺🇸 https://t.co/0ZfOHTtj1N When I was three years old I used to dress up as Mary Poppins and my dad would fly me around the house (gay from birth) - Last night was a dream come true ❤ Words cannot describe last night. Such an honour to sing in support of The Voice Health Institute. Steven Zeitels &amp; his incredible team saved my voice. Forever grateful &amp; so passionate about the work you do.  I'll also never ever forget the night I met Dame @JulieAndrews... https://t.co/EAYhjJc43W https://t.co/XG7CQQyAQg 2016 Oscars. Congratulations to all the winners and nominees tonight x https://t.co/AjAL0i7SEy What a magical night at the first ever @global awards 💙 thank you so much for my award xxxx I hope everyone had a wonderful evening xxxx https://t.co/2La9V8zN89 If you'd like to watch my performance at tonight's Global Awards, tune in from 7.30pm at https://t.co/bxgt0gtLQ3 x https://t.co/etLacde3gK Incredible video from @WarchildUK. Please watch, retweet &amp; support if you can x #EscapeRobot https://t.co/rIGO2ojKRo ASIA! incredibly excited to announce some shows for you 🖤🖤🖤 \nLet’s sing together this October x https://t.co/7B9wb3oamd HIS FUCKING VOICE IS INCREDIBLE 😍wow xx https://t.co/4IHK1pk7ev I love London so much. Nothing like home x RT @AnnieMac: Last night at @AMP was unforgettable. Thank to all the artists who showed such good will. We raised a lot of money for @Round… LAKE COMO. TOUR REHEARSAL. THE THRILL OF IT ALL WORLD TOUR COMING VERY SOON 🌹 https://t.co/CHHwOka3qW 'Too Good At Goodbyes' • Brits • 2018\nhttps://t.co/TwMZrAtNls @BRITs @DUALIPA CONGRATULATIONS YOU STAR 🔮 So lovely to meet @Stormzy1 last night for the first time. Congratulations man &amp; that performance was iconic. Unreal xx https://t.co/bfRTr3rmyl @MrBrunoMajor @ItsReubenJames Got my amazing trainer on tour so let's get BUFF Literally feel like an elephant is sitting on my head right now. Worst hangover ever. All worth it though! Massive shout out to @alesartori &amp; everyone at @Zegna for my outfits last night. Such beautiful fabrics and made me feel fabulous https://t.co/8Yk69ScH6j @NiallOfficial I love you bro. Oh what a night xx RT @Zegna: British singer @samsmithworld wears two custom made looks designed exclusively for him to #BritAwards at The O2 in London. #Zegn… @MrBrunoMajor Mate - I can't fucking wait!! We get to hang out every day ❤️ you need to get a bike! I wanna go cycling round every city we are in 😍 haha RT @MrBrunoMajor: I will be opening for the incredible  @samsmithworld on his UK Arena tour, a run that includes two nights at the o2. 😁 ..… @LewisCapaldi I'm going to sit on the side of that stage and drown in my tears every night when you sing 'Lost On You'!! I'm so excited to meet you. Thank you so much for coming out with us ❤️ RT @LewisCapaldi: can’t get my head around this...\n\nmy hometown has a population of 20,000 people and I’ll be playing to nearly that many p… Almost time... @BRITs 2018 #SamSmithBRITS https://t.co/Woua1ck2k7 The @BRITs 2018 TONIGHT!  \nCan't wait to perform 'Too Good At Goodbyes' for you. Tune in on @ITV or watch live on @YouTube from 8pm https://t.co/BrA3X1F1BU x \n#SamSmithBRITS https://t.co/YEV8MFLoDi . @MrBrunoMajor and @LewisCapaldi will join me on my UK and European tour - two incredible artists! Take a listen and make sure you arrive early to see them perform x https://t.co/YO6uidRvHP https://t.co/6xDC3hy2gn Just one month until #TheThrillOfItAll world tour begins in Sheffield 🖤 \nI'm this writing from rehearsals. You have no idea how excited I am to see all your beautiful faces. S x https://t.co/00aNNqnlZ9 Sending warm light &amp; cyber hugs to you all today. Hope the February blues aren't effecting any of you. If so, look after your mind and soul &amp; remember.... this too shall pass 🌸🌺🌹🌷 Thank you @TheEllenShow, always a pleasure 🖤 https://t.co/IzT6ad1a27 Excited to perform at The @BRITs next week x \n#SamSmithBRITs Happy Valentine's Day to you all. Love is all around ❤️💜💛💙💚🔮🌸🌻🌹 https://t.co/a3sVDnPlOM RT @palmerportraits: My @samsmithworld portrait is finished!! \nI don’t have money on my mind \nI do it for the love ❤️ https://t.co/aPnofPFT… I LOVE SINGING When I was a young boy, my mum sat me and down and went through her vinyl collection. She took out @realoletaadams, Get Here. The minute I heard that voice, those lyrics, I was lost. I loved recording this &amp; I hope you all enjoy it. This is for you mum x https://t.co/TsGP6taoui https://t.co/r7xfFmwkuD JT smashed the Super Bowl so hard ❤️ Guys.. it's so so important to talk about mental health. Please support Time To Talk day today wherever you are. This really does affect all of us, and no one should have to feel ashamed, isolated or suffer in silence! x #TimeToTalk RT @FallonTonight: Tonight on the show: @samsmithworld, Cecily Strong, and a performance from @Danwhitemagic! Plus, your funniest #MyWeirdS… Hello everyone x Looking through some of the incredible artwork you send me.  From now on I'm going to change my profile image to artwork. It's so inspiring &amp; you're all so fucking good 😍❤️  Artists names will be in my bio. This is from @samsmithbatch Love you all so much xo S https://t.co/AJBKHCabzz Always remain a student. Always seek to learn and explore x Performing 'Burning' and 'Get Here' by the incredible @realoletaadams in session for @Spotify 🖤  You can listen to my Spotify singles at https://t.co/TsGP6taoui x https://t.co/WX28Ha8tim 'Pray' is such an important and personal song for me. It was an honour to sing it for you at such a special event. Thank you to the #GRAMMYs and congratulations to all the winners and nominees x https://t.co/MO3Nv5479C @alessiacara congratulations on the Grammy beautiful ❤️💛💚💙💜 🏆🏆🏆🏆🏆🏆🏆 Looking forward to performing at the Global Awards 2018 this March. Tickets are on sale now https://t.co/Fplia9DDBR x RT @AnnieMac: a 3 day festival. and 3 female acts. the shortsightedness of this is staggering. how did the organisers not think this could… 500 million views for 'Too Good At Goodbyes' - completely overwhelmed. Big shout out to @lukefmonaghan for directing this video and @youtube for this boom cake. I love you all deeply. https://t.co/zm9ziO1PoS Had such a beautiful day in Tokyo 🇯🇵🖤🙌🏻💜 Little bit down today. Seeing all of your tweets about coming to Australian shows is lifting me up. I can't wait to see you all x Australia, New Zealand... tickets for my #TheThrillOfItAll November shows are on sale at https://t.co/YO6uie96zn. Can't wait to perform for you again x https://t.co/lnWzFQxxRO Australia, New Zealand... such an incredible response to my #TheThrillOfItAll tour announcement. Thank you. \nNew shows have been added in Auckland, Melbourne and Sydney. You can get tickets on Monday from 2pm local time S x https://t.co/Ee7lBqEXm5 Australia. Just sitting here thinking about how beautiful the last 3 weeks have been. Thank you all so much for making me feel so at home here &amp; for some unforgettable shows. I'll be back very soon! All my love, always and forever 🙋🏻‍♂️ https://t.co/d413P2mgTx Thank you for featuring my playlist @starbucks https://t.co/2KqN0H9hdV Meet my new friend. His name is Ozzie 🙌🏻 https://t.co/MGHfAp6N19 I'm just protecting my innocence. I'm just protecting my soul. See you tomorrow @sunriseon7 x https://t.co/LyjayJQMU2 The last two night at the opera house have been out of this world. So thankful and honoured to have played in such an iconic venue. Thank you Sydney 😭🔮🦄🌷🌹🌸🌺 https://t.co/RSnPc8BceZ Congratulations to all the Brit Nominees!! Can't wait to perform on the night xx not long now xx Australia x So happy and excited to announce a tour in one of my favourite countries! Tickets go on sale on Monday 22nd at 2pm local. See you soon S x https://t.co/GuxD4ZWouU First day back at work tomorrow after the Christmas holiday. Can't wait to sing for you all at the opera house ❤️ x S RT @vmagazine: In conversation with friend Sarah Jessica Parker, @samsmithworld ruminates on his evolving sound and refreshingly honest yet… @YebbaSmith 😂😂😂😂😂😂😂😂❤️ Big Head https://t.co/enVEqiluuN I hope you've all had a beautiful start to the new year. Rounding up my holiday and so excited to perform for Sydney at the opera house. Very very soon. Love you all x S @TheeRealBurnell You better sing!! What an incredible voice x #V111 #BRAVENEWWORLD  @vmagazine @formichetti https://t.co/zg5I0oB3aI @vmagazine ❤️ https://t.co/54UlBVYEoV RT @CapitolRecords: .@samsmithworld is \"the voice of freedom\" &amp; cover star of @vmagazine's Discovery Issue. Read more: https://t.co/Grkk5IQ… RT @formichetti: It’s time to spread your wings! 💫  @vmagazine #V111 #discoveryissue @samsmithworld out very… https://t.co/timJ0LnfRT #V111 https://t.co/AsuLUdXdl1 RT @vmagazine: .@samsmithworld speaks with friend Sarah Jessica Parker on his evolving sound, and experiences with love and loss while navi… RT @vmagazine: The best Instagrams from #V111 cover star @samsmithworld: https://t.co/QedQlll3lw https://t.co/blkVt0rbQ1 #V111 https://t.co/UnzyIvd4uB Honoured to be on the cover of @vmagazine &amp; to have got the opportunity to sit down with the sensational @SJP and talk about life and love. And thank you to @formichetti for making me feel so comfortable in front of your lens x https://t.co/scs8F3LwM5 RT @fluffikins_rini: Got this denim jacket painted by artsybit @samsmithworld ❤️ https://t.co/ruv20lqN9f Happy New Year Darlings. Thank you all for the most beautiful year of my life. Drink loads, pour flowers from your chest and celebrate your fabulous self. S xo https://t.co/SYf5aTclRa Just found out that 'In The Lonely Hour' has just gone 8X PLATINUM in the UK. My heart is so full. I look back on these songs, and these lyrics like I would an old photo album. Thank you to whoever has got this album, I hope it continues to be your friend on those lonely nights x https://t.co/dfyOWiGbKf RT @AnnieMac: So many amazing quotes from last night's co-host with @samsmithworld but this was my favourite - \"I LOVE Stefflon Don,  ‘16 S… @BryonyMcharg_3 See you there beauties x I hope you all have the most beautiful day. Filled with love, music and mountains of food. S xx MERRY CHRISTMAS BISH https://t.co/KzkSrN3qH2 I love seeing all your drawing and paintings and videos of you all singing. It fills my soul up. Never stop creating x let it pour out of you. Good night beautiful creatures x Music is art It is expression &amp; therapy Art is powerful. You made me sad till I loved the shade of blue...\nhttps://t.co/ox0CoCL0gm https://t.co/jft2BAyvzv RT @jamesvmcmorrow: I love coffee so much, but whenever I see someone eat pretty muchanything coffee flavoured I'm like \"why are you doing… Coffee, jazz &amp; you The Thrill Of It All @AppleMusic 🖤🍏\nhttps://t.co/vtuJ1lIGBZ https://t.co/482sfoh2vp Winter Ballads x  \nhttps://t.co/KCmrhI6SlO @DeezerUK Cannot wait x https://t.co/jaeiVZt2Ai 😂https://t.co/jzOuvYq159 RT @danwootton: BIZARRE AWARDS REVEALED He surpassed sky high expectations to deliver a sublime sophomore album. Congratulations @samsmithw… The royal wedding is on my birthday!!!!! A royal birthday it shall be 💅🏻 RT @MTVMusicUK: We're loving @samsmithworld's #OneLastSong music video so much that we've made it MTV's Most Wanted ❤️ Watch the full video… Don't try and be someone else. You are enough Be yourself Thank you to everyone who listened to @BBCR1​ for my Live Lounge yesterday. Such an incredible response 🖤😭  This is One Last Song x https://t.co/ox0CoCtpoO https://t.co/Gz3Z0XaTTP Officially Christmas. Work is over 🎄 https://t.co/PKycuLRtYI Swept away https://t.co/vHH8DIYWIT Ready for my @BBCR1 live lounge performance! Tune in now to hear One Last Song along with my Christmas cover. So excited x https://t.co/xgi14BSkfl RT @BBCR1: Today is all about @SamSmithWorld in the Live Lounge! \n\nMake sure you're listening to @ClaraAmfo 👉 https://t.co/48RuyzVNDg 💫 htt… TOMORROW! Tune into @BBCR1 from 11.45am for my Christmas Live Lounge x https://t.co/SL1xEFMoh5 It's officially Christmas after that performance x I love you London. Thank you @CapitalOfficial x \nhttps://t.co/ox0CoCtpoO https://t.co/IfTpPqR8uL RT @nasirahzamanii: But real love is never a waste of time. #Palace @samsmithworld RT @hannahgebauer: You reached a limit, I wasnt enough. It’s like the fire replaced all the love. 🎶🎶🎶 @samsmithworld Tim Walker has created pieces of art from sound waves captured while recording 'Stay With Me'. A limited number of signed versions are on sale at https://t.co/AD6wwOTx2P in support of @WarChildUK. Please do all you can to help this incredible charity x https://t.co/xUIoJ7f1YG 'Burning', for me, is the most personal song I think I've ever written in my life...\n#TheThrillOfItAll Track 5  https://t.co/ox0CoCL0gm https://t.co/dtWz13euPj Room Service? https://t.co/S3PGhpwKDW I miss you It's like forgetting the words to your favourite song. You can't believe it, you were always singing a long 'Palace', recorded live at my @AppleMusic album release show. Favourite part of my show is performing this with the incredible Lucy Jules. You lift my heart up Lucy x https://t.co/h1JJJBFflB Bay watch is a fucking funny film!!!!!!! PALACE, TOMORROW x https://t.co/Wh8DNC5i05 RT @khloekardashian: 6am and singing (loud) and blasting Sam Smith around the house! Love you Sam ! ❤️ @khloekardashian Love you too!! Miss you gorgeous ❤️ Guys... new The Thrill Of It All merch is up on my official webstore today https://t.co/45BeSGurJ5 x https://t.co/BJtkCfUdax RT @TheCrownNetflix: @samsmithworld  https://t.co/qTOnEoODIB RT @WarChildUK: Help us to rebuild childhoods this winter: https://t.co/DkuULWVs8J @samsmithworld https://t.co/iRpxb8vaIU RT @WarChildUK: \"We can't live our lives while they're living their lives like this.\" - @samsmithworld. Donate now to protect children affe… RT @Burberry: .@SamSmithWorld wears a @Burberry jacquard tuxedo to the #FashionAwards 2017 in London https://t.co/hAR1DrjnKD December 13th! @BBCR1 x https://t.co/uzhbmVYtWF Sunny London #ONELASTSONG https://t.co/RsVnuWzoGx I am so honoured to be a part of such an incredible team and I am truly excited to start helping to raise as much money and awareness as possible. Stay tuned &amp; please watch this video. You can donate here at.... https://t.co/WPWNd1Jb9V thank you x @warchilduk https://t.co/50pvW55oNo To my wonderful fans, I am so excited to announce that I have become a global ambassador for the incredible humanitarian group @WarChildUK. Over the past year I have been on two trips with War Child to Iraq &amp; to Jordan to witness first hand what this incredible charity are doing https://t.co/zxEaxkar2Z @iWolfGirl ❤️❤️ @iWolfGirl Be romantic to yourself gorgeous x take your wonderful self out for dinner and realise how amazing it can be to be single xxx I love romance Thank you to everyone watching 'One Last Song', and to everybody supporting my new album 'The Thrill Of It All'. I love you all 🖤 https://t.co/HF69JONG6X @TheCrownNetflix 😂😂 Thank you X Factor. Good luck to all the contestants xx https://t.co/HjYioadzDx So excited to perform on @TheXFactor final tonight! You can watch on @ITV from 7.15pm x https://t.co/R9gksbgNp8 RT @vsinclair522: @samsmithworld All we can do is keep believing in LOVE 🏳️‍🌈 @ddlovato So are you beautiful! So happy I got to give you a hug last night xxxx see you in NY hopefully Heartbreaking to hear about the defacing of this beautiful mural in Sydney of George Michael. I'll never be able to get my head around some of the hate in this world!! #LoveIsLove 🏳️‍🌈 https://t.co/v7IHO5pqpF @bydarrenstyles ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ @RyanSeacrest ❤️ thank you sir. Was so lovely to see you x https://t.co/N6fT3r8WsW @AnneMarieIAm ❤️ so lovely to spend some time with you gorgeous!! Xxxxxx Mabel sends her love as well!! Sorry I had to dash off x @MrMatthewTodd ❤️ thank you sir. Lovely to meet you x I chose to cover @jonimitchellcom's 'River' for my @Spotify Christmas track  https://t.co/xE7NRxd8eo. Joni Mitchell is one of the reasons why I write music. It was a dream to be given the opportunity to cover this song. I hope you love it as much as I loved singing it. x https://t.co/vn7TxGbFV4 Absolutely magical and inspiring night at the #eltonjohnaidsfoundation CLUB LOVE event. So much… https://t.co/1kJ7KaPPjf RT @JKCorden: Mr President, please take down the videos you retweeted from the Britain First group. It is beneath even you to do such a thi… I'm so excited for @TheCrownNetflix 😩 I LOVE @BetteMidler SO MUCH!!!! Best person on twitter ❤️🦄❤️🙌🏻 RT @CapitolUK: The beautiful video for @samsmithworld's 'One Last Song' is live! 🎉🎭📽️  https://t.co/VBBg53Ddl0  #TheThrillOfItAll I am so excited to reveal the music video for my second single One Last Song. This track is my final love song directed to an old love of mine. I had so much fun making the video and, after a 25 hour shoot, I truly believe we created something beautiful x https://t.co/wabrcLrUrI @thegreatkhalid Miss you too bud!!!! @outmagazine ❤️ @thegreatkhalid @VirginRadioTO ❤️✨✨✨✨✨✨✨✨✨✨ @grimmers 🤶🏼🎅🏼🙌🏻 just a touch of snow ONE LAST SONG. TOMORROW X https://t.co/qCDFoGt4yK The grammys new artist nomination list is SO INCREDIBLE &amp; EXCITING!! Congratulations to all nominees this year ❤️✨ I'll fix you with my love ONE LAST SONG. COMING SOON. https://t.co/Y5rr23s7sX @alice_fearn I really really did. I'm 100% coming again. So made up for all of you. Thank you again x @SophieEvans I admire YOU!! Hope you're on for a long time to come so I can bring my friends and family x @SophieEvans YOU WERE UNREAL tonight!!!!!! So powerful x thank you for such an amazing performance xxx @alice_fearn unreal. Unreal. Unreal. Your voice is a gift from above beautiful. Thank you so much for tonight. Me and my sister cried so hard xx ❤️❤️❤️❤️❤️ Just saw @WickedUK !! Alice Fearn as Elphaba is actually out of this universe. Best production of wicked I've seen xx thank you xx I regret ever complaining, about this heart and all it's breaking. It was beauty we were making x https://t.co/Z99lUw6zwv Here I am\nPrayin' for this moment to last\nLivin' on the music so fine\nBorn on the wind\nMakin' it… https://t.co/XqhtZxX2gk CONGRATULATIONS @Palomafaith ❤️❤️❤️❤️❤️❤️❤️❤️✨✨✨✨✨✨ well deserved xxxx. #TheArchitect Everyone who is on oxford street right now, stay safe!! 🖤 https://t.co/gNr5OKsIrt RT @BBCRadio2: 👀 Wooo check out who's coming in to see @achrisevans today!\n\n👑Claire Foy &amp; Matt Smith👑\n🎸@NoelGallagher🎸\n🍰Mary Berry🍰\n🎶@samsm… @camcountry @Apple @TylerSamJ 😭❤️ RT @camcountry: My heart just skipped watching our lyrics play out to such beautiful visuals in the new @Apple commercial. 💫😭 if you haven’… Gorgeous people x You can hear me live in session for @achrisevans on @BBCRadio2 tomorrow morning from 7am 🖤 https://t.co/yDgGmmSpm9 No way that you'll see me cry\n'The Thrill Of It All' is out now. https://t.co/ox0CoCL0gm xx https://t.co/708Nj8Kq27 @Apple My new album 'The Thrill Of It All' is on @AppleMusic now https://t.co/Zt9g5f5w2t xx #movesomeone Real love is never a waste of time.  \nSuch an honour for @Apple to choose  'Palace' to soundtrack their holiday advert. I hope you enjoy watching https://t.co/H87Xak5NfU 🖤🍏 Yeah, you were beautiful and in you I could trust https://t.co/gVh7c9q1u6 If I kiss you where it's sore, will you feel better? Will you feel anything at all? - @respektor ❤️ BAMBIS https://t.co/IL1w8qRdBb The Thrill Of It All, track four. \nMidnight Train x \nhttps://t.co/ox0CoCL0gm https://t.co/GaO9kIkG1u Frida Kahlo takes my breath away. Stay With Me x\n@BBCMusic @BBCOne https://t.co/oxTG1JMTQ8 https://t.co/ux9RB4ROF9 YOU ARE LIGHT I love jazz I guess I got lost in your heartbeat, in The Thrill Of It All\nhttps://t.co/ox0CoCL0gm https://t.co/MiaNAoRvV0 All my love to @BenSPLATT on his last few shows of Dear Evan Hansen ❤️ Sending hugs to you all today xx Everybody GO GO GO and purchase this beautiful record from a beautiful artist @Palomafaith https://t.co/Kny2xQyyrv Side By Side x https://t.co/LQVwySLXuy\n@AmazonMusic @AmazonMusicUK https://t.co/2aAFU6YSrW @EllaHenderson ❤️❤️❤️❤️❤️ SAY IT FIRST. I NEED TO HEAR YOU, SAY THOSE WORDS. IF IM ALL THAT YOU DESIRE, I PROMISE THERE'LL BE FIRE RT @TheEllenShow: Compassion, social intelligence, decisiveness, patience, wisdom. These are all qualities found in elephants and not found… WOW. This is powerful &amp; important!! @justtranter @RuPaul ❤️🌈 https://t.co/4AvCjzuw8y @imjmichaels Miss you has taken over every inch of my soul!! You and @cleanbandit have smashed it!! So beautiful 'wishing that I was your bottle' 😩😭❤️ @imjmichaels ❤️ Seeing the news of Lil Peep is so desperately sad @Camila_Cabello ❤️😭❤️😭 Back into working out. Getting up and going is the hardest bit. LETS DO THIS THOUGH!!!!!!!!!!🙌🏻💪🏻 @troyesivan ❤️🌈❤️🌈❤️🌈❤️🌈 you are there in everyone's hearts beautiful boy x congratulations!! Seeing my feed full of rainbows leaves me breathless. So happy. Everyone tweet rainbows until your thumbs hurt!!!!!!! 🏳️‍🌈🌈🏳️‍🌈🌈🏳️‍🌈 https://t.co/WQohc0sqXL RT @TheTodayShow: A historical day for Australia... The majority voted YES in the same-sex marriage postal survey!\nLive coverage here: http… RT @TheEllenShow: It’s a g’day. Way to go Australia. #MarriageEquality https://t.co/0tdnBHPAW1 RT @NandosAUS: 🌈SHE SAID YES! 🌈 Well done Australia on saying \"I do\" when it comes to believing marriage is about love and should be availa… @MileyCyrus 🌈❤️😭 RT @MileyCyrus: Yes!!!!! Congrats Australia! Every step taken is one closer to World Peace! Love love love you! Proud to be Australian by a… I WISH I WAS THERE CELEBRATING WITH YOU ALL 😭🌈 YES YES YES YES YES AUSTRALIA - YES!!!!!!! 😭😭😭😭😭😭😭😭😭🌈🌈🌈🌈🌈🌈🌈🌈🌈🌈🌈 I'm sitting in the car on the way to the airport completely overwhelmed. I just played a gig in… https://t.co/6kMsfRUXHV Just played the best gig I've ever played. I'm overwhelmed. Was in a tiny church in Cologne. Absolutely flabbergasted!! RT @itssylviaplath: I must bridge the gap between adolescent glitter and mature glow. RT @itssylviaplath: Yes, I was infatuated with you: I am still. No one has ever heightened such a keen capacity of physical sensation in me. @Smallzy Shit, I should have Just met Ted Baker. What a lovely guy. I went for a job at his Cambridge store when I was 17. Didn't get it. Mad how things turn out haha The Thrill Of It All track three, 'One Last Song'  \nI remember being really angry the day that we wrote this! https://t.co/ox0CoCL0gm https://t.co/cAypKBPGSa Healthy dinner &amp; Harry Potter kind of night ❤️ RT @islandrecordsuk: .@SamSmithWorld joins @JessieWare on the first episode of her fantastic new podcast 'Table Manners'! Subscribe here: h… @ddlovato @BBCR1 Ditto!! 'Only forever' has me deeply into my feelings xx congratulations beautiful xx YES @ddlovato ❤️ SAAAAAAANG IT ❤️ @BBCR1 @YebbaSmith 😂😂❤️ @mjubelirer @CapitolRecords ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ RT @billboard: .@SamSmithWorld's \"The Thrill of It All\" debuts at No. 1 on the Billboard 200 albums chart https://t.co/GiRH37bQsf Completely and utterly overwhelmed. The Thrill Of It All is officially number one in America. Truly, a dream come true. Thank you all from the deepest part of my heart ❤️ https://t.co/fCdT6T46kq SO I'LL LIGHT UP A CIGARETTE. I'LL DRINK IT DOWN TILL THERE'S NOTHING LEFT - @YebbaSmith https://t.co/fs46aQcu58 My heart is drenched in wine, but you'll be on my mind forever x Oh Norah Please check out the incredible work of @JamesMSBarber who captured the making of #TheThrillOfItAll for my @AppleMusic On The Record documentary  https://t.co/3M112VcGz5 Some of the most precious and private moments of my musical life x https://t.co/Gg59rwJUcZ 👇🏻x https://t.co/KtTSXhQ6AX So let's sit by an English river till the water runs dry. https://t.co/S9yExUXHXf @tyrabanks I adore you in every way. Thank you so much for your support!! I promise I will, always ❤️thank you for being YOU xx @JKCorden ❤️❤️❤️🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻❤️ RT @JKCorden: I️ KNOW YOU DONT WANNA TALK TO ME, so this is what i will do, maybe you’re listening, so here’s one last some for you... http… RT @BRITs: Congratulations on your second No.1 album @samsmithworld!! 🙌👏🎉 #TheThrillOfItAll https://t.co/0EO23YJ5pi Luckiest man in the world to have these people on my side. I love you all, eternally x https://t.co/xMTgBrNYLE THE THRILL OF IT ALL IS NUMBER ONE  My heart is so full and happy with this news. Thank you to every single person who has got my album. This is a dream come true for me, thank you x https://t.co/lhFHkgXo5X RT @bbcmusic: Still getting over @SamSmithWorld's epic 'Stay With Me' performance TBH 💖 \nWatch #SamSmithAtTheBBC 👉https://t.co/NOylmy7OIQ h… Midnight Train (live from The Hackney Round Chapel)... watch on @AmazonMusic https://t.co/KoBgndiRox 🖤 https://t.co/8RIzTFbazG RT @UMusicuk: Here's @samsmithworld performing 'Burning' - tune in to @BBCOne now for more live performances 🖤\n#SamSmithAtTheBBC https://t.… WHEN IT WAS GOOD IT WAS BITTERSWEET HONEY. YOU MADE ME SAD TILL I LOVED THE SHADE OF BLUE - One Last Song I SING BECAUSE IM HAPPY. I SING BECAUSE IM FREE. RT @urbina_brandon: Maybe one day, l won’t sing about you. I’ll sing a song about someone new. But right here, right now. You are on my min… Overwhelmed by all your comments and messages about my @bbcmusic special 😭😭😭\nThank you so much to everyone supporting #TheThrillOfItAll. I love you all so much xx\nhttps://t.co/yAPq4WyqMn RT @samo4179: Don't have no degree, I'm somewhat naive #pray @samsmithworld 🙌 @ronanofficial Thank you sir ❤️❤️❤️❤️❤️❤️ @CaraDillonSings @BBCOne That means the world coming from you x RT @Suggyshelley: Not even food will distract my brother from watching @samsmithworld #SamSmithAtTheBBC https://t.co/MRqWhi5JEt RT @Glennbob123: Omg got goosebumps watching @samsmithworld performing ‘Burning’ 👏🏼👌🏼 #SamSmithAtTheBBC https://t.co/0rhL67KqaP RT @jackkchall: ‘Such a burden this flame on my chest’ - @samsmithworld 🙌🏼 RT @Breakstuff69: .@samsmithworld my son James is engrossed!!!! Just like his mum and I! https://t.co/nNPCM56r1z Watching the BBC special with my family and friends ❤️I hope you all like it x TONIGHT - @BBCOne 8PM https://t.co/3BpS4TVpc5 Got my best friends &amp; family coming over tonight to eat @NandosUK &amp; watch the BBC SPECIAL 👅👅 so fucking excited Farewell NY. What a beautiful trip. I loved singing with you all so much ❤️ Say It First… I think it’s the only positive love song I’ve ever written in my life x\nListen at https://t.co/ox0CoCtpoO #TheThrillOfItAll https://t.co/YiHdp0E6kf RT @JessieWare: Incredibly excited to introduce my dear mate @samsmithworld as 1st guest for our new podcast Table Manners! Enjoy! https://… RT @5revive: Thank you @samsmithworld ! #nowords  #amazingman #amazingvoice  #lgbtwedding #surprisegig  @MetroUKNews @BBCOne   https://t.co… @tydollasign @paulaparsons45 @YebbaSmith ❤️❤️❤️❤️❤️❤️ only if you don't stop @tydollasign @paulaparsons45 @YebbaSmith I'm a huge fan of yours. Horses in the stable &amp; Credit were played 100's of times last year xx thanks for the music xx Fuck being up this early. This is PEAK December 9th!! @CapitalOfficial https://t.co/LCEuI1eUmY #CapitalJBB 🖤❄ https://t.co/adKGITon4z RT @CapitalOfficial: THIS. IS. HUGE! The star on the top of the tree that is @samsmithworld is gonna be joining us for the #CapitalJBB! 🌟 h… RT @traviswiggins68: But lately that shit ain’t been getting me higher. I lift up my head and the world is on fire. There’s dread in my hea… @DHewitt2 😭 RT @ro_ro36038: @samsmithworld Won't you call me \nCan we have one to one please \nLet's talk about freedom \nEveryone prays in the end 😍😍😍 RT @shortie__mac: My head is filled with ruins most of them I built with you now the dust no longer moves don’t disturb the ghost of you -@… EVERYONE PRAYS IN THE END - Pray RT @ladyjaymarie: I know you’re feeling weighed down tonight, and you can’t find the breaks\nEvery day is too long for you, You are sworn to… Just two days until my @BBCMusic special 🖤\n@BBCOne, Thursday at 8pm https://t.co/zpdANAhdw8 RT @eltonofficial: #RocketHour is a @samsmithworld special today as Elton chats with Sam for the release of #ThrillOfItAll! 2pm GMT, only o… RT @Beats1: \"One of the best songs written in the last 10 years.\" @eltonofficial on @samsmithworld's \"HIM\" https://t.co/xrZdJy0Wau https://… RT @KIIS1065: @samsmithworld is coming to Oz to do a special performance! Listen to @KyleandJackieO to win!!! #KIIS1065\n@Optus #YesMusic #i… RT @amazonmusic: .@samsmithworld loves letting it out to this @FifthHarmony track 🙌 Here's \"Work From Home\" #SOTD https://t.co/oOB0Vp509F h… RT @eltonofficial: Elton John. @samsmithworld. One special #RocketHour. Join them tonight at 7pm PT for an hour of music and chat, only on… RT @PwallowYoSride: “I gave my heart to a gahdamn fool.” 😩😩 @samsmithworld RT @cuttiegrande: but lately, that shit ain't been getting me higher,\nI lift up my head and the world is on fire @samsmithworld 🥀 RT @Chris_Boyne3325: “Say I shouldn’t be here but I can’t give up his touch\nIt is him I love, it is him” - @samsmithworld ❤️ RT @HamburgSamSmith: 🎶I know just what you're saying\n&amp;I regret ever complaining\nAbout this ❤&amp;all its breaking\nIt was beauty we were making… RT @michgc2604: \"I'm not a saint, I'm more of a sinner. I don't wanna lose but I fear for the winners.\"⭐️ @samsmithworld I love music RT @fellzy: Huge congrats to our friend @samsmithworld on the release of #TheThrillOfItAll. Here we are waiting for the 🌅 at @MontreuxJazz… RT @camcountry: I️ got to sing on @samsmithworld ‘s new album and that pretty much made my life https://t.co/DbrIFgMwPA Beautiful people... my @BBCMusic Special goes out this Thursday. So excited to perform for you all! You can watch on @BBCOne from 8pm x https://t.co/QlRb5DjKvP Seeing you tweet the lyrics gives me goosebumps 💜 RT @haxxs_: @samsmithworld they will love the better you\nBut I still own the ghost of you RT @HeyYallItzJamol: And if there are feelings there, they are not mine. @samsmithworld RT @_Rianna_xx: I know you’re right for me\nBut I’m waiting for everything in your world\nTo align with my world❤️ @samsmithworld RT @Nbreanna01: “We’re neither saints or sinners\nSo leave your history behind\nLet’s grab a bottle and take it one day at a time” 💕 @samsmit… I'm so happy you guys are connecting to these lyrics 😭 IF I'M ALL THAT YOU DESIRE. I PROMISE THERE WILL BE FIRE - SAY IT FIRST COZ I SURE CANT GET NO SLEEP, AND LORD KNOWS THERE'S NO RELIEF - NO PEACE 🖤 SO I LIGHT UP A CIGARETTE. I'LL DRINK IT DOWN TILL THERE'S NOTHING LEFT... RT @bbcmusic: \"But babe I don't understand...they're letting Fearne wear heels\" 😆😂\nAre you ready for @SamSmithWorld At The BBC?\nWatch: 09/1… Too Good At Goodbyes. The Thrill Of It All, track one  🖤🥀\nListen at: https://t.co/ox0CoCL0gm x https://t.co/nHA8c586WM RT @lecg88: Me listening 👂🏿 to new @samsmithworld and getting over someone I’ve never dated. https://t.co/IKFlMEh99a Pillow Talk https://t.co/eL47sp5pzF Just got back to London. NY tomorrow. I'm fucking exhausted but lord is it worth it. Sending love to you all wherever you may be 💜💚🖤💙 If you guys listen carefully to 'Palace' you will hear the goddess that is @camcountry 💛 writing this one with you &amp; T was an honour x Sometimes I wish we never built this Palace, but real love is never a waist of time 💛- Palace @camcountry 💛 @edibow Thank you Edith ❤️that means the world to me. Hope you're well beautiful x RT @jimmynapes: @samsmithworld ‘Midnight Train’ #thethrillofitall https://t.co/lE5VUjSZek I was so honoured to have one of my favourite singers in the entire world come on stage with me… https://t.co/8ZI6uCK10c @MisterMarilyn ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️adore you x thank you RT @Beats1: .@eltonofficial x @samsmithworld.\nMonday on #RocketHour:\n7PM LA / 10PM NYC / 3AM LDN.\nhttps://t.co/Mb2YQmljlO https://t.co/BpiQ… RT @dinmagtoto: I guess I got lost in the moment.I guess I got lost in the fall.I guess I got lost in your heartbeat.In the thrill of it al… The Thrill Of It All. @amazonmusic  \nhttps://t.co/fPqIjIGH38\n📸 itsmarialderete https://t.co/hDnsom9X8Y @NaughtyBoyMusic ❤️ @Stormzy1 🖤 RT @AppleMusic: Here we go!\n#TheThrillofItAllLive: @samsmithworld\nhttps://t.co/msls1rAR9Y @AppleMusic Check back at 9pm GMT if you'd like to watch a livestream of my @AppleMusic album release show in London 🖤 Guys.. you can listen to 'The Thrill Of It All' &amp; watch my On The Record documentary on @AppleMusic https://t.co/3M112VcGz5 xx https://t.co/l5GyD3HV2U .@NME 🖤💜 https://t.co/5cuqj7O7ut @nme 🖤💜 https://t.co/F5PRx056b2 RT @camcountry: NEW @samsmithworld IS HERE!! I'm singin &amp; playin electric on “Palace.” 💛 Go get this gorgeous album. Right. Meow. 😻 https:/… @Palomafaith ❤️❤️❤️❤️❤️❤️thank you beautiful RT @Palomafaith: Congratulations @samsmithworld my fave is HIM very important and beautiful song xxx RT @LarryFlick: With the exquisite #HIM, @samsmithworld offers queer kids the song I would have given anything to hear as a teen. Lives wil… Thank you to everyone listening to my new album on @Spotify x\nThis is #TheThrillOfItAll... https://t.co/XpgIK2VDty https://t.co/hb2UqJPTg2 RT @bexstringo: Already obsessing over Midnight Train @samsmithworld I can feel some drunk singing coming on #thethrillofitall https://t.co… RT @nakelmcclinton: Top 5 songs on The Thrill of it All:\n1. One Last Song\n2. HIM\n3. Pray\n4. Nothing Left for You\n5. Palace \n\nBoy this is go… RT @aIleycats: @samsmithworld i dont know how to put it into words but ‘one day at a time’ means so much &amp; just made me cry in public liste… RT @jimmynapes: @samsmithworld 'The Thrill Of It All' is out now! Hope you enjoy it as much as we enjoyed making… https://t.co/LgDzuPpZYO @TheVampsJames ❤️ RT @TheVampsJames: Congrats to the darling @samsmithworld for releasing his second album. Incredible as always. Please get it here! ❤️\nhttp… The Thrill Of It All is in your hands🖤 https://t.co/ox0CoCL0gm\nEvery song on this record is a part of my heart &amp; my soul. I hope you love it https://t.co/VZNFK306rV I'll always love you, but tonight's the night I choose to walk away - midnight train RT @R1Breakfast: From 9am @samsmithworld will play his shiny new album with @grimmers 🤗🤗🤗\nCome join 👉https://t.co/e6wCXyJWmZ\n#SamSmithOnGri… RT @grimmers: today @samsmithworld joins us live to share some of his favourite songs from his brand new album and tell us the stories behi… RT @Josef____: \"Let's turn off our phones now, and rely on the stars. We've been so lost lately, we forgot who we are\"@samsmithworld  #TheT… RT @DaydreamerAlina: Dear Mother, how you’ve come so far\nYour love has fixed all of our broken hearts\nI hope you’re proud, Mother, of what… RT @thiasguimaraes: @samsmithworld will you give me the piece, Will you give me the piece of my heart? RT @paaradize: If I run every time it starts...\n@samsmithworld \n#TheThrillOfItAll RT @kuhidalgo11: @samsmithworld I got my reasons, but darling I can’t explain\nI’ll always love you\nBut tonight’s the night I choose to walk… RT @facesonseb: @samsmithworld it is him i love, it is him.. i love 💭 RT @amberfsnt: @samsmithworld i am so proud of this. \nspreading the love on my snap x https://t.co/42QwxvfZIA The Thrill Of It All is yours now... https://t.co/ox0CoCL0gm xx https://t.co/q0fOYbsK40 The Thrill Of It All. Finally yours. I love you friends. Thank you for making my dreams come true &amp; for being there. Enjoy x 10 minutes UK 20 minutes UK 50 minutes Shitting a brick RT @colettebennett: @samsmithworld Sam! ITS SO FUCKING SOON! https://t.co/6E9clDIhPL 🖤 https://t.co/pciG3x5LaY RT @zobeexx: Waiting for @samsmithworld to heal me at midnight ❤️ #TheThrillOfItAlll A letter to my beautiful fans... 🖤 https://t.co/CjYiitMceA It's all feeling real now @Louise_molony We were 100% married and lived on a farm @lauramvula ❤️❤️❤️❤️❤️ thank you beautiful ❤️❤️❤️❤️❤️❤️ That moment when all your carpool karaoke dreams come true @FifthHarmony @JKCorden @latelateshow 💛💚💙💜 https://t.co/wHFrgAFg1v Tomorrow is the day! I just can't wait for you to hear this record x \n#TheThrillOfItAll On The Record premieres tomorrow on @AppleMusic x https://t.co/3M112VuhqD #TheThrillOfItAll https://t.co/P7e5KLHwyk Guys, I have butterflies 🦋!!!!!!! Not long now 😩🙈 RT @FifthHarmony: Surprise!! Couldn’t resist joining @samsmithworld and @jkcorden for a little @latelateshow #CarpoolKaraoke 🚗🎶\nhttps://t.c… RT @JKCorden: Brand new #CarpoolKaraoke anyone? https://t.co/ekzuZZbFGE TOMORROW \nhttps://t.co/ox0CoCtpoO #TheThrillOfItAll https://t.co/qn1tCGoKg1 I'm so ready for you to hear this album 😩 RT @LouisOrtiz92: This interview with @samsmithworld is a must-read. An amazing journey by a talented, kind artist: https://t.co/re7KE2v6jg RT @oliviafecteau: “The Tear-Stained Confessions of Sam Smith” https://t.co/whjxMDu4e6 @samsmithworld So much love for @taffyakner ❤️ I'm normally scared to read anything written about me, but this made me cry (again) &amp; made my mum cry lol Wow. Really emotional reading this. Thank you Taffy for being such an incredible writer &amp; human. Hope you like it xx https://t.co/OjkOusokFG https://t.co/MirSS0aGZD @taffyakner @nytimesarts ❤️❤️❤️❤️ RT @taffyakner: Guys, I finally met someone more emotional than I am! My @nytimesarts debut is a tear-soaked profile of Sam Smith. Please b… #TheThrillOfItAll... TWO DAYS 🖤🖤\nUntil then, here's a link to listen to my 'This Is Sam Smith' @Spotify playlist https://t.co/LERWNkOdJV x https://t.co/JaxKXxk97x @SophieFaldo CONGRATS 😍❤️ YAY!!! I'm so happy Sophie won!!!! So deserved xx @BritishBakeOff I don't know what I'm going to do without you 😭 New York. My heart is with you always and forever. Devastating news. My soul and heart is with the victims and there loved ones x horrific RT @NicolleMonico: \"I've been burning/Yes, I've been burning...No insurance to pay for the damage/Yeah, I've been burning up since you left… Really In love with this. Thank you @i_D for capturing me in this way x\nhttps://t.co/aGep19hlUg https://t.co/rDRx1qkUlo I hope you're all as excited as I am for the final of BAKE OFF 😩 BE KIND. BE REAL. BE YOURSELF @nathanaelcooper @smh ❤️❤️ Carpool Karaoke!! This Wednesday on @latelateshow with @JKCorden. Had an AMAZING time filming this, can't wait for you to watch 🖤 https://t.co/CaVSClsi8w Meetings https://t.co/runFQokNEv @MaverickSabre ❤️ thanks bro x Ahead of album release, I wanted to share the most personal piece of music I think Ive ever written. This is BURNING https://t.co/kL43mwKHAH Freaking out a little bit, at the fact that my album is out in FOUR FUCKING DAYS. Jesus. Nervous Sitting at the airport, bored shitless. What's everyone up to? Hope you're all smashing life wherever you are RT @hmvtweets: .@samsmithworld fans, be here at 12:30pm!\n\n#TheThrillOfItAll https://t.co/0jGMMV6bY0 @MOMOMOYOUTH You're sensational x I'll never forget the day me and the incredible @PooBear wrote this song. This one really healed my heart. Here is 'BURNING'... https://t.co/S8t0fFN4FP RT @danwootton: LISTEN @samsmithworld on emotional secrets of new album in Bizarre Life. Subscribe on Apple Podcasts &amp; get on iTunes https:… MANCHESTER New date just announced! See you on March 29th 😭  https://t.co/yzTDvP0qTo https://t.co/5YZ087NPSq In my wildest dreams, I never thought that I'd be announcing to you a FOURTH date at the O2. Completely overwhelmed😭 https://t.co/yzTDvP0qTo https://t.co/cnP3KeP4wi RT @CodyLaGrow: *plays @samsmithworld’s new song #burning on the bus*\n*gets to 2:38* https://t.co/8jVePHV40w Gorgeous people... my UK &amp; European tour has just gone on sale at https://t.co/yzTDvPi1KW. Thank you for an unbelievable reaction so far x https://t.co/bYhBcJ47W7 RT @HarryCook: Last day to get your Yes Vote in. Come onnnnnnnn. Tell everybodyyyyyyyy. #PostYourYes Last chance to #PostYourYes 🏳️‍🌈 !! Come on beautiful Australia ❤️ RT @CloverMoore: Final week to #PostYourYes - last day recommended to put your YES vote for #marriageequality in post is Friday. Don't take… @iamTanika ❤️ RT @iamTanika: THE TRUTH. 💓👑 https://t.co/Xj4o7dzzPs ❤️I love you all. Thank you for being here xx ... well, that is the fucking coolest &amp; most overwhelming feeling in the world. Thank you for all listening to me bloody Moan about my heart ... but to be able to use music as therapy, and to put my heart into songs like burning, and then to give those words to you ... at the time when I was writing it, I didn't like myself. I didn't respect myself. I still struggle everyday with just being myself I can't explain how healing it is to have 'Burning' out in the universe. That song came from a place of so much confusion and heart ache You reached a limit. I wasn't enough. It's like the fire, replaced all the love - BURNING Tune into @Mistajam from 7pm tonight if you'd like to hear BURNING... a new track from 'The Thrill Of It All' x https://t.co/E2SWna2gd7 RT @NRJMusicAwards: 🚨 @NRJMusicAwards 2017 🚨\n@samsmithworld confirme sa présence sur la scène des NRJ Music Awards !!! Juste ÉNORME quoi 🤗#… RT @TheO2: The one &amp; only @samsmithworld has announced a third show at The O2 next April. Tickets on sale Friday at 9am https://t.co/LnCAjH… RT @bbcpress: 🎤 @samsmithworld to perform new tracks from his new album in a one-off special @BBCOne: Sam Smith At The BBC (Thursday 9 Nove… BURNING. Tomorrow xx \nhttps://t.co/jCMlyTazEQ https://t.co/7gI8dvE7tb @TheO2 ...Tickets for all shows go on sale at 9am BST / 10am CET this Friday x WOAH thank you so much for an incredible reaction to my UK &amp; European tour 🖤🖤🖤 \nSo excited to announce a 3rd date @TheO2 on April 9th... https://t.co/V4KXO7RufK RT @Beats1: .@samsmithworld is on with @JulieAdenuga talking #TheThrillOfItAll + the behind the scenes film. https://t.co/fJF6Nl4EGR https:… @AppleMusic I'm also celebrating the album release with a special live show in London on Nov 3rd. You can apply for tickets at https://t.co/AvvEhjlqeJ 🖤 I collaborated with @AppleMusic on a short film to take you behind the scenes creating 'The Thrill Of It All'. Can't wait for you to watch x https://t.co/iHl5KbSVMD 12pm today x https://t.co/suzKge5iFj https://t.co/RdrQ7IPUjN Pour myself over him, Moon spilling in Ride or Die \n...Part two 🌴 https://t.co/NoHqgmEoct Feeling so happy today. Sun &amp; smiles are out. How are you all? hope you're having a beautiful day wherever you may be xx I wrote Pray this year with the incomparable @Timbaland &amp; @JimmyNapes. It holds a very special place in my heart https://t.co/rrcA5yr7ou https://t.co/HG2UcL6XeY Beautiful people of the UK... you have until 12pm on Tues if you'd like to access pre-sale for my UK tour https://t.co/nazmdLq4yF xx https://t.co/3zR7n4Zn7D RT @ST_Culture: For someone who specialises in slow, sad ballads, @samsmithworld ascent has been giddily swift. Read the interview https://… Magical moment when your a fan of someone's music &amp; you meet them and become MORE of a Fan! @thegreatkhalid ❤️❤️what a special guy Hollywood bowl that was magical #WeCanSurvive Everyone go &amp; listen to @JessieWare 'GLASSHOUSE' !! Love to love, Sam, Selfish love are my favourites. Gorgeous work, you beautiful soul x Midnight Train xx\n#TheThrillOfItAll Nov 3rd. https://t.co/jCMlySSYNi https://t.co/bGoiv2E7dE Head to @AppleMusic if you'd like to listen to my essentials playlist 🍎🖤 https://t.co/AkNtV3UYLr This Sunday x https://t.co/j8xGTcpqcr TWO WEEKS till the birth of my second album x\nhttps://t.co/suzKgemTwR https://t.co/CkcT9YYcO4 Unbelievably excited to announce UK &amp; European live shows!! For UK pre-sale, pre-order The Thrill Of It All at https://t.co/suzKgemTwR xx https://t.co/U7CLXV8Czy To my fans in the UK and Europe, I have big news for you tomorrow x\nThank you for waiting patiently guys, I love you all 🖤 https://t.co/YK39NWTRcS @ddlovato Demi.... the new album is 🔥 your voice and lyrics are incredible!! Daddy issues, cry baby and concentrate got me in my feels ❤️ Say It First xx\n#TheThrillOfItAll Nov 3rd https://t.co/ox0CoCtpoO https://t.co/6KVdmbvfFO What an incredible doco. My heart is so full after hearing George's music &amp; hearing him sing all evening ❤️ It was truly amazing to share 'The Thrill Of It All' with some of you at my @Spotify listening session. Can't wait for everyone to hear it!! https://t.co/7vpWBDNHiH Hope you're all tuning into Chanel 4 tonight to watch the George Michael doco. I'm so excited to watch it x Ride or Die https://t.co/MtcqeVfuoT @lorde ❤️❤️🌷🌷 'We're the greatest. They'll hang us in the Louvre. Down the back, but who cares, still the Louvre' https://t.co/9J1usD1PMt Come away with me in the night. Come away with me and I'll write you a song - @NorahJones  ❤️ Can’t wait to see you all at the iHeart Jingle Ball tour later this year xx https://t.co/b6NHwYTIBJ @iheartradio 😡 https://t.co/RZC89VJ9ED RT @Lavernecox: Thanks attitudemag for the honor and thank you @samsmithworld for presenting it to me. I feel… https://t.co/KImPhX5GQr POWERFUL words from Emma Thompson this morning about Harvey Weinstein. Fucking RESPECT!! @kayyllla_ All the time Beautiful people of North America!!Tickets for my tour are on sale at https://t.co/BIA41Fd2zZ. Can't wait to sing with you, I love you all 🖤 https://t.co/13s87h9Rsl Overwhelemed seeing all your tweets about you all getting your tickets for next year. The show is looking unreal. I can't wait The Thrill Of It All. North American Tour.\nTickets on sale from 10am local today at https://t.co/BIA41FuDrx xx https://t.co/VvUCD5cs37 @_helloemma ❤️ 'So do your worst to me. Test my loyalty. I will pass with distinction of first degree' - Bruno Major @JKCorden ❤️❤️❤️❤️❤️❤️❤️ RT @JKCorden: Favorite album of the year so far! #MidnightTrain #OneLastSong #Pray https://t.co/LIgHJ1lCar To all my fans in North America... I'm so excited to see you again. Tickets go on sale tomorrow at 10am local https://t.co/BIA41Fd2zZ 🖤 https://t.co/KvhBONafvH It's nearly time for me to give my album 'The Thrill Of It All' to you all. I'm scared, but so ready...\nWatch in full on my facebook xx https://t.co/5JoGSTX72D What are you looking at? https://t.co/SrwPzaM5zz MAN FLU. In need of hot drinks &amp; cuddles https://t.co/DsXlhrlAFo SO happy to see all the love for 'Pray' 🖤 Thank you to everyone supporting https://t.co/ox0CoCtpoO 'The Thrill Of It All' Nov 3rd 🖤\nPre-order on my webstore at https://t.co/dIxtBMpyJd to get pre-sale access for UK shows. Announced soon!! https://t.co/2RkRhTvdMX Watching the notebook. It's that kind of day @_DionneWarwick Thank you so much Dionne. You are such a huge inspiration to me x RT @_DionneWarwick: Sam Smith is a talented young man! @samsmithworld So sad to leave New York. Thank you for being so good to me &amp; my team. Feel so lucky and blessed to do what I do for a living. Love you x Australia, my home away from home, I'm so excited to announce I will be performing at Sydney Opera House!! On sale 16th Oct at 12pm AEDT 🇦🇺 https://t.co/Owm3uzSH1w Thank you so much to everyone who watched my @nbcsnl performance 🖤PRAY is out now, you can listen on @Spotify at https://t.co/i0IqDtS6sj xx https://t.co/iWmG92Nt06 Fuck that was a rush. @BenSPLATT ❤️ RT @Timbaland: @samsmithworld #Pray https://t.co/o57ZMLsfiW @jamesvmcmorrow Thank you bro!! Means the world coming from you x RT @theniconni: I'm not a saint, I'm more of a sinner             @samsmithworld RT @_ItsJose_: I’m young and I’m foolish , I make bad decisions @samsmithworld Pre-order 'The Thrill Of It All' on @AppleMusic if you'd like to get an instant download of my new song 'PRAY' https://t.co/ox0CoCL0gm 🍏🖤 https://t.co/kvOvBRh4jx RT @DearSam2: @samsmithworld #Pray\nI'm young and I'm foolish, I've made bad decisions \nI've blocked out the news, turned my back on religio… RT @kajzizz: *inserts entire Pray lyrics* @samsmithworld RT @Katie_Foulkesx: Everyone prays in the end✨\n@samsmithworld RT @klimtsdanae: Don’t have no degree,I’m somewhat naive I’ve made it this far on my own but lately,that shit ain’t been getting me higher… RT @Anthony23f: Everyone prays in the end\n@samsmithworld 🥀 North America, I am so psyched to come and perform for you again. Pre-sale for all shows, begins on 11th October https://t.co/BIA41FuDrx xx https://t.co/rPIFcJBNEV RT @_chic27: Let's talk about freedom\nEveryone prays in the end\nEveryone prays in the end \nhttps://t.co/cZS9i2LaBR\n@samsmithworld \n....Mayb… RT @_chic27: There's dread in my heart and fear in my bones\nAnd I just don't know what to say\n@samsmithworld \nMaybe I'll pray, pray \nMaybe… RT @blueaguaaa: \"I'm not a saint.. I'm more of a sinner. I don't want to win but I fear for the winners\"- Sam Smith RT @salsapockbill24: Thank You @samsmithworld for perfectly articulating how I feel about the state of the world right now. This song is be… RT @papawheelie246: I lift up my head and the world is on fire.\nThere's dread in my heart and fear in my bones.\n@samsmithworld #pray #TheTh… RT @ItsChelseaRose_: \"I'm not a saint 🙏🏻I'm more of a sinner ♥️\nI don't wanna lose \nBut I fear for the winners\"\n@samsmithworld #pray RT @Cathleen_Tung: @samsmithworld I lift up my head and the world is on fire\nThere's dread in my heart and fear in my bones I'm so happy you guys are feeling the MUSIC!! Reading through all your comments &amp; my heart is so full RT @Asirveronica: I lift up my head and the world is on fire,There's dread in my heart and fear in my bones,And I just don't know what to s… Shit is getting real now. I need to start writing again and get my mind off this record. TO THE STUDIO.... @jimmynapes ❤️❤️❤️❤️❤️❤️❤️❤️ I can't wait for you all to hear my duet with @YebbaSmith on my new record 😩🙌🏻❤️ one of the best voices on this planet right now 🔥🔥 I hope you love 'Pray', I hope it becomes your friend in those deep dark nights of confusion &amp; loneliness. Love you all so much xoxo We are one step closer to the birth of my second musical child. Holding the vinyl in my hand is the moment this becomes real &amp; scary... https://t.co/hIo9KOhvoI My second album 'The Thrill Of It All' is yours Nov 3rd!! You can pre-order now and find out about live shows at https://t.co/BIA41Fd2zZ xx https://t.co/qh338MCAHb My beautiful fans, I am so so excited to finally share this news... 2 minutes.... RT @nbcsnl: Who knew @samsmithworld and @officialkenan went to high school together?? #SNL https://t.co/LuutGe4De8 RT @zanelowe: LOVED THIS ONE. My full interview with @samsmithworld is streaming now on @Beats1 👉🏼📲 WATCH IT HERE https://t.co/b5OzFgCibZ h… TOMORROW xx https://t.co/HvyiRPA8Ea 06.10.2017 https://t.co/p5isyLR2Nk Just went to see 'Dear Evan Hansen' - out of this universe. I properly snot cried throughout!! @BenSPLATT was sensational xx GO SEE IT 5 more days till Saturday Night Live. Can't believe my first SNL was over three years ago!! Fuuuuuuuuck. https://t.co/TOzFsNpj7L RT @TheEllenShow: Care. Love. Be outraged. Be devastated. Just don’t give up. The world needs good humans today. Watching the news in tears. Something needs to change!!!!!!! This hate has to stop!!!!! Heartbreaking Horrifying scenes in Las Vegas. My heart and soul is with all the victims &amp; their families and friends. Everybody please stay safe. Up early for a flight. Just wanted to check in &amp; tell you all I love you. Hope you're all happy and healthy wherever you may be x @kell751 ❤️have a wonderful day RADIO 1. I'm on such a high. Thank you for having me ❤️❤️overwhelming x https://t.co/lwCPvczaY0 'Too Good At Goodbyes' Live From Hackney Round Chapel xx\nhttps://t.co/tXpuR4Vdq5 @DebraMessing I can promise you I am a much bigger fan of yours ❤️❤️❤️❤️I can't bloody wait. Hope I get to give you a big hug in person some day xx Rehearsals all day today with my beautiful band for tomorrow's LIVE LOUNGE. Here is me in a… https://t.co/t7TF4upoFH Too Good At Goodbyes Acoustic. Tomorrow xx https://t.co/7B4O3vXvZ8 @Natalie_Ferg @paulaparsons45 Sounding wonderful Natalie x RT @BBCR1: Friday is all about @SamSmithWorld closing #R1LiveLoungeMonth with a very special performance 💫\n\nListen from 6pm 👉 https://t.co/… RT @WillAndGrace: Honey, you’re making our hearts sing! We can’t wait to celebrate our return with you. #WillAndGrace https://t.co/uqYrgnjm… @DUALIPA I dance naked to 'New Rules' and try to re create the video at least once a week. Today is that day. I love you Dua x I AM SO EXCITED FOR NEW WILL &amp; GRACE!!!!!!!!! 🏳️‍🌈 @AttitudeMag https://t.co/CPVU5XIWMm @cuttiegrande Beautiful Australia - the time has come. You have a special special place in my heart. Vote Yes &amp; join us… https://t.co/H3G1mMYqnm So good to be back 😭😭😭\nThank you to everyone supporting Too Good At Goodbyes https://t.co/9gx94guuLS https://t.co/Jy9jLWceoU @LarryFlick ❤️ Stay Humble Folks https://t.co/vm4xGgaddX @kash_1988 Don't you worry, I'm watching it Mood. #FarewellParis (Artwork by https://t.co/SeRWPsCfet ) https://t.co/gGzIqAooE4 Paris, I have fallen into a deep deep love affair with you. I can't wait to sing with you all again very soon xx Australia, I can't thank you all enough for making me number 1 for a second week in a row. Australia is a home away from home for me... Too Good At Au Revoir 👋🏻🇫🇷 https://t.co/I5i1RY7ZqZ RT @LizziePaton: A show to remember. For the 20th anniversary of the death of Gianni @Versace, the 90s supermodels came out of retirement a… x https://t.co/gk1vmMOIJS RT @CapitolRecords: Mark your calendars... @samsmithworld returns to the @nbcsnl stage on October 7th! 🎤 🥀 https://t.co/mmxObLQ2hL RT @nbcsnl: Happy Fall! #SNL https://t.co/gnHXjREPlN 🖤 @nbcsnl https://t.co/5pJ70Mmzbx RT @Deezer: It’s always about love. \n@samsmithworld’s 'Too Good At Goodbyes' features in our Today's Best Ballads playlist 👉 https://t.co/X… I can't sleep. I keep thinking about tour &amp; performing for you guys again. Fuck I am excited ‘Too Good At Goodbyes' https://t.co/9gx94guuLS \nThank you to everyone listening 🥀🖤 https://t.co/vtcl6HRpJp My prayers and thoughts are with the people of Mexico City &amp; Puerto Rico today and everyday. Devastating news to read!! Heartbreaking @DianePeck19 @BritishBakeOff Amen 🙌🏻 @BritishBakeOff 😂😂😂😂😂😂😂😂😂😂❤️ RT @BritishBakeOff: We're just too good at good pies, @samsmithworld... 😉 #CaramelWeek #GBBO  https://t.co/C8fn49iIvC Bake off is getting TENSE. Caramel week and I'm feeling the pressure 😰 The last week of shows have been the best gigs of my life. Ive missed singing to you all so much. Thank you to everyone involved 🖤 https://t.co/fZGpcj8l68 Thank you all for your beautiful comments about the TGAG video. This one is a love letter to England &amp; to love. It's always about love. Here it is xx https://t.co/0EEMYvbm5R\nThe official video to 'Too Good At Goodbyes' RT @kayleighallen17: When @johnlegend does an acapella cover of @samsmithworld's 'Lay Me Down' 😍🎼🎤© #faultless https://t.co/esYLdMZFho Too Good At Goodbyes official video. Tomorrow x https://t.co/cC8NVWEYbK Come on beautiful Australia.... Let's change things for the better. LOVE LOVE LOVE is LOVE. Can't believe my eyes. 'Vote No' being written in the sky over Sydney from people against equal marriage If you can't handle the heat, get out the green house #KEW https://t.co/e1Wvyk36iu @dualipalouis 100% 'Although my pride is not easily disturbed, you sent me flying when you kicked me to the curb' - AMY RT @amazonmusic: We can't get enough of this track. #AskAlexa, \"Play Song of the Day\" &amp; hear @samsmithworld's \"Too Good At Goodbyes\" https:… RT @ARIA_Official: Too Good At Goodbyes lands @samsmithworld his first #1 single on the #ARIACharts! https://t.co/ZIhUKdUb6l https://t.co/Y… 😩😭😂 https://t.co/fKe1zvJMfM London, my heart has melted. Forever thankful and yours x https://t.co/pvIPIPTxf6 OFFICIALLY NUMBER 1 IN THE UK!! Thank you all from the deepest part of my heart. We can't wait to celebrate tonight with you London x https://t.co/9LiwUt6fW6 Just got back home to London. Still floating from the last two shows. Can't wait to sing for you tomorrow London x 🥀🖤 \n@AttitudeMag @eltonofficial @dielamb https://t.co/4PltKUNSUv @LarryFlick Love you so much Larry xxxxxx RT @AttitudeMag: .@samsmithworld is BACK with a world exclusive interview with @eltonofficial in our new October issue: https://t.co/XjyW7m… Thank you @AttitudeMag for having me on your cover &amp; I love you @eltonofficial 🖤 https://t.co/4wDo3EIjPx @AttitudeMag ❤️ MERCURY LOUNGE. NEW YORK CITY. HOLY FUCK https://t.co/bRMt3hzhkm @kelly_clarkson You are truly wonderful in every way Ms Clarkson. All my love forever and always. Hope to see you soon!!!!! 🖤🖤🖤🖤 @SnickersUK @grimmers Thank you guys for being there at my time of need x RT @SnickersUK: Congrats on the new record @samsmithworld! Next time hunger strikes at 4am, at least you’ll be prepared. #SometimesYouNeedA… Text GIVE to 80077 please beautiful people 🖤 #HandinHand https://t.co/rztItjmOAz #handinhand @handinhandfund  - PLEASE donate guys 🖤 @wakeupcaIl @Spotify 😭😭😭😭😭😭😭😭😭 Still so high from last night. Thank you for having me back Los Angeles x https://t.co/OwK3rtscj6 @_alyssayung_ 😭❤️ https://t.co/WhLPsiPZEt Thank you to everyone listening and downloading on @AppleMusic https://t.co/p5GTkIEkwC 🍏🖤 https://t.co/L00t6I7mdy RT @CapitolRecords: Fans in front of the LA @samsmithworld flower wall! Located on Melrose &amp; La Jolla 🖤🥀🎶 #SamSmithFlowerWall \n(Installatio… So overwhelemed at the reaction to the new music 🖤🥀 thank you for all your incredible messages and comments. I am reading them all!! 😭😭 https://t.co/01K45aCxxD I can't actually contain my excitement for Monday. Los Angeles I can't wait to see you 🖤 RT @CapitolRecords: Fans in front of the LA @samsmithworld flower wall! Located on Melrose &amp; La Jolla 🖤🥀🎶 #SamSmithFlowerWall \n(Installatio… @DanReynolds Thank you man!! Big fan ❤️ means the world RT @Nataliaqm00: I know you're thinkin' I'm cold\nI'm just protectin' my innocence\nI'm just protectin' my soul\n @samsmithworld #TooGoodAtGoo… RT @Dul__c: And every time you walk out, the less I love you.\n#WayTooGoodAtGoodbyes @samsmithworld @QuincyDJones Love you Quincy ❤️ thank you xx UNBELIEVABLY excited to announce 4 intimate shows in LA, NY, London &amp; Berlin https://t.co/bOmOQGlk77 Can't wait to sing for you again xx https://t.co/JnnRgJ2SVY RT @jayvee_bala: Im just protecting my innocence\nIm just protecting my soul @samsmithworld #TooGoodAtGoodbyes @JKCorden Love you James xxxx thank you RT @JKCorden: Loving #toogoodatgoodbye @samsmithworld @LarryFlick Love you Larry x thank you I'm about to get on a plane, so I just wanted to write to you all to say thank you. This week… https://t.co/HdhkIyMZHv @jacquiepope 😭 @Woodkid 🖤🖤🖤🖤🖤🖤🖤🖤🥀 Massive shout out to @jimmynapes &amp; @stargate 🖤 writing this song with you all under the dreary London smog was truly an honour xx love you. @IsabellaBiricik Love you beautiful girl x don't cry xxx @londongrammar ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ @BBCR1 @Pink UNBELIEVABLE. Tears in my eyes &amp; the fullest heart. Thank you 🖤 @iamrationale @jimmynapes @stargate Thank you 😭❤️I'm a huge fan RT @SamSmithNews: ‘Too Good at Goodbyes’ is Number One on UK iTunes! https://t.co/D1aKVZusVQ Guys 🖤 You can watch a video of 'Too Good At Goodbyes' I recorded exclusively for @Spotify at https://t.co/SR9cF3fPkq xx https://t.co/pweAcFBnNC #TooGoodAtGoodbyes \n#TooGoodAtGoodbyes RT @reileenmoranaa: \"Baby, we don't stand a chance, it's sad but it's true. I'm way too good at goodbyes\" 🖤🖤🖤 @samsmithworld 🖤🥀 RT @JimmyMarinho: I'm just protecting my innocence\nI'm just protecting my soul 😍🖤#TooGoodAtGoodbyes @samsmithworld RT @amberove: \"I'm never ganna let you close to me, even though you mean the most to me, cause everytime I open up it hurts. \" -@samsmithwo… RT @AnaPinzonC29: Every time you hurt me, the less that i cry.\nEvery time you leave me, the quicker these tears dry.\n@samsmithworld  😍😍😍😍 RT @Beats1: According to @samsmithworld:\nNew album before Christmas.\n2 versions: 10 and 14 tracks.\nhttps://t.co/8TI9rRzeAZ https://t.co/smC… RT @AppleMusic: All the feels for @samsmithworld's #TooGoodAtGoodbyes. Listen now. ❤️\nhttps://t.co/WUNhutBmxe RT @Complex: .@samsmithworld released his new single \"Too Good at Goodbyes.\"  https://t.co/RJ9nCMqoga https://t.co/cHO6kklApz 'Too Good At Goodbyes' is finally here gorgeous people!! https://t.co/9gx94gcTni 🖤 https://t.co/3SSHHLWLEj LIFT OFF 🖤 LOVE YOU ALL. It's yours now xx hope you like it xx 5 10 minutes 😩 30 minutes till #TOOGOODATGOODBYES 1 HOUR TO GO. Shitting a brick 😭 @LiamPayne ❤️❤️❤️❤️ TOMORROW x https://t.co/XsES79hFAb @oakleyorchard ME 🙋🏻‍♂️ @alexiagonzalezl Fucking love you guys @JKCorden ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ Last night in my bed before release. Starting to get nervous now 🤢 @leonalewis 🖤🖤🖤🖤thanks beautiful TWO MORE DAYS. Attempting to cook to distract myself x https://t.co/TILieOjINR @CerysClack You don't need me for that beautiful. All in your heart. Just ask yourself the right questions 🖤 @YebbaSmith Amen. NOPE The wait is nearly over x https://t.co/zNcT4eFmpV 🖤🖤🖤more days https://t.co/Dp2LC7zE9w @Fadzeanforward #teamburger 😩 @hussarftlawley Preach Just got out the gym. Can we all be honest for a minute.... does being out of breath actually ever REALLY get fun!?!? #NAH Watching the Whitney Houston doco on BBC iPlayer - fuck, this is so deep and devastatingly sad. Incredible and important watch Can’t wait for you to hear ‘Too Good At Goodbyes’!! Pre-save on @Spotify at https://t.co/EBGVod9NWW if you’d like to see a video message xx https://t.co/eW7Hr1EIOe RT @R1Breakfast: ⚠️⚠️⚠️ BIG GUEST ALERT ⚠️⚠️⚠️\n\n@samsmithworld joins @grimmers with new music... Friday at 7:50AM\n\nListen here 👉👉👉https://t… ‘Too Good At Goodbyes'. 8th September 2017. So excited for you to hear the new single... 🖤 you all xx https://t.co/JOja98qnjk 4 days https://t.co/MW0CqPZUQh @vsinclair522 YAAAAAAAAAAAAAS 🖤 RT @DanieleMagroOff: Guess me and @samsmithworld lived a parallel childhood according to this Spotify playlist ❤️🙏🏻\nThe Jojo track is 🔥\n\nht… @MyqueenMahoLOX And you're my happily ever after x @samsmithxbae I kept fucking it up 😂😂😩🖤 @alexiagonzalezl 🖤🖤 @holdonxroses 😩 I love you all so much. Reading your messages over the last few days has made me so emotional. I'm so excited!! 6 MORE DAYS 🖤🖤🖤🖤🖤🖤 NYC x https://t.co/xoKpqmx1FZ Morning Los Angeles x https://t.co/PQO8cmfoMF @livdawsonmusic ❤️ Morning London x https://t.co/eDbRPuz3vc @alexiagonzalezl 😂 https://t.co/27UTvMLWg2 @lorde 💜💙 you killed that VMA stage, you beauty Rehearsing x https://t.co/QYtsTHqMMb RT @LeoDiCaprio: Flooding has forced thousands in Texas &amp; Louisiana from their homes. Join me in supporting the @RedCross: https://t.co/MoT… Be strong Texas x My heart and soul is  with all the people in Houston right now. Devastating news. @DHewitt2 😂😂😂😂😂😂❤️ https://t.co/MP06HdW4e5 My heart is forever with the people of Barcelona &amp; all the families and friends of the victims. Hold each other close today and everyday x Drinking coffee, listening to Laura Marling, reading every lyric and looking out at New York. Bliss RT @BarackObama: \"...For love comes more naturally to the human heart than its opposite.\" - Nelson Mandela RT @BarackObama: \"People must learn to hate, and if they can learn to hate, they can be taught to love...\" RT @BarackObama: \"No one is born hating another person because of the color of his skin or his background or his religion...\" https://t.co/… RT @jk_rowling: Thread 👏👏👏👏👏👏👏👏 https://t.co/zZBFlOlS3V @Pink ❤️❤️❤️❤️ Hope I get to meet you soon xx @PUSHA_T Amen RT @PUSHA_T: To all artist: Never stop being a fan. When u find something you admire in another artist, let… https://t.co/MZNrANn5Qy Fucking love you @Pink !! 'What about us' is 🔥your music always inspires Just sensational. So moved &amp; emotional after that. Thank you so much #angelsinamerica https://t.co/KL4tW9rHWd Couldn't be anymore in love with you @rupikaur_  ❤️ thank you for your talent RT @fellzy: Wonderful review of @MontreuxJazz on @HYPEBEAST feat. @samsmithworld @gucci1017 @terracemartin @questlove @Usher &amp; + https://t.… Just watched Dunkirk. Wow. Everyone should get down to see it. Powerful. Magical weekend in Bruges with my dad. Boat loads of pasta &amp; wine &amp; cheese. One last holiday x https://t.co/vO4Js4uXOF @forlarryonly 😂xxxx RT @JessieWare: I am back. Properly back. My new single Midnight is out today. https://t.co/PP0wJhU0OJ https://t.co/f3i2b0wE46 SO GOOD TO HEAR YOUR VOICE AGAIN @JessieWare ❤️❤️ everyone go and dance &amp; kiss to 'Midnight' ❤️❤️ Hello beautiful people. Please support #Game4Grenfell at Loftus Road on 02.09.17.  For tickets and info visit: https://t.co/YBwZS4821y https://t.co/XZJ8DcQGnN Sending so much love to all my followers right now. Love you all xx @Rosie ❤️🙌🏻😂🙌🏻❤️ @lenadunham ❤️❤️❤️❤️ RT @lenadunham: Hey trans teens: this man does not represent the overwhelming love, support and pride waiting for you when you step out int… RT @LenaWaithe: I stand with my Trans family today and everyday. RT @marylambertsing: There isn't a more harmful, knife-like word than \"burden\" to describe LGBTQI people. Cant stop crying. What a horrible… RT @TheEllenShow: We should be grateful to the people who wish to serve, not turn our backs on them. Banning transgender people is hurtful,… #ProtectTransTroops #ProtectTransTroops #ProtectTransTroops #ProtectTransTroops #ProtectTransTroops #ProtectTransTroops !!!!!!!!!!!!!!!!!!!! In utter disbelief. #ProtectTransTroops RT @MattBellassai: transgender people show more courage when they leave their fucking houses in the morning than donald trump has shown his… 'Cause I gotta have faith @livdawsonmusic @sza @brysontiller Hell yeah ❤️ 'Cross around my neck and a crystal in my pocket. My love is the bomb and forgiveness is the rocket' @emelisande #lyrics @dinnertan 😭❤️ @MetroRadioNews ❤ Filming - Last Day x https://t.co/BZShNjGY60 Filming - Day 1 x https://t.co/ypdFH5joMz @fellzy @MontreuxJazz miss ya buddy ❤ I'm very late to the party, but Laura Marling is actually unreal. Her lyrics hit me in the stomach The sun is out for Pride in London today!! Have a wonderful day everyone. Be safe &amp; be PROUD 🌈 Oh I wish I had a river\nI could skate away on\nI wish I had a river so long\nI would teach my feet to fly\n- JONI &amp; THIS TUNE!! @lorde - your talent leaves me breathless ❤ https://t.co/p79NBQcnFH This kills me. SO GOOD ❤❤❤❤ https://t.co/FTkERRAHxf Amen. Can't wait to hear what you drop next Laura ❤ https://t.co/SJiG0CkyYB Fuck I can't wait to sing live again!! Miss it so much Worst hangover in the world but it was so worth it. Farewell Montreux ❤ Thank you for the music. Thank you for the memories ❤ RT @QuincyDJones: Such a pleasure to do the hang-thang with u at the @MontreuxJazz my bro @samsmithworld! Looking forward to tonight! 🎉\n📸:… #MontreuxJazz  I can't thank you enough @QuincyDJones for showing me such an amazing time ❤❤ I love music so much!!!! https://t.co/8f3Ppe3F0I I don't see nothing wrong https://t.co/OWijhYCCar Yesterday was a beautiful day. New York was alive &amp; proud 🌈 so much love to everyone who came out &amp; marched &amp; supported x https://t.co/d0X1B0lHHt Can't remember the last time it was this bloody hot in London 😎make sure you all wear sun cream 💅🏼 Happy Freddy Day Paps ❤ https://t.co/LnUpqJqKao This @sza album 😍 #ctrl Horrifying news to wake up to this morning in London. My thoughts and prayers are with all the victims xxxx NEW ORLEANS X I LOVE YOU https://t.co/R2wjKzrbz2 Alright you beautiful people - make sure you vote today!!!!! Get your voices heard xx ❤ @JKCorden ❤ hope you're well sir xx been too long!! Reading through all your comments x Love you all so much. Can't wait for you all to hear the music!!!!! ❤😭💃🏼 Recording x https://t.co/UzvjioyKY9 Sending all my love and thoughts to @ArianaGrande and everyone involved in tonight's show. ❤🇬🇧 https://t.co/dWPyCrMGRt #OneLoveManchester Happy Anniversary you guys!!!!!!! My first born 'In The Lonely Hour' is officially THREE years old today. Love &amp; miss you all desperately x https://t.co/gmCKI4nW62 Sitting in my room. About to go to bed. Just want to let you all know how much I love you all &amp; there is good in this world x Hold each other close today and everyday. Love is the only way to answer to something this hateful RT @gmpolice: An emergency number is available for those who are concerned about loved ones or anyone who may have been in the area - 0161… RT @Dynamomagician: https://t.co/jfBT9UWRls Just woken up and seen the news. My heart and soul is broken for every single victim, and their families and friends. So painfully sad x The Syrian war has raged for 6 years #EnoughisEnough. I'm so so proud &amp; honoured to support the @WarChildUK campaign\nhttps://t.co/65DuoK0Mry I would not be the artist I am if it wasn't for you. @GeorgeMichael &amp; celebrate one of the most magical, talented, bravest &amp; important figures in music &amp; life as I know it. Your music &amp; message will live on.. @GeorgeMichael. Words can't express how much you and your music meant and means to me. Please play his music as loud as you can today... https://t.co/ojnEircyQM My heart is broken. Let people be people, let's love together. The world is with you Orlando ❤️ https://t.co/pH5tBYn60o I'm logging off for a while. Some Martinis shaken not stirred are definitely in order. @vanityfair https://t.co/UkFH5y3B8g @theweeknd @LeoDiCaprio @TheAcademy you were sensational last night sir x @IanMcKellen Thank you Ian xx I am a huge fan xx Sorry for the hiccup. @DLanceBlack well 'Milk' was a masterpiece sir xx x @common @johnlegend @jimmynapes https://t.co/h5zODHlBTa Congratulations to my brother, my family... @jimmynapes x https://t.co/70Bnfx7CU6 😩😭😩😭 https://t.co/qcxzyyPSVz I can't put into words how I feel other than... Hungover and Insanely happy x https://t.co/apGme6HGhM Apologies for the mix up @DLanceBlack I'll be sure to check out your films now x Belated Congrats on the Oscar x My point was to shine some light on the LGBT community who i love so dearly. Second openly gay man to win an oscar or third or fourth or 100th, It wasn't my point. So hungover. genuinely feels like a dream I've never been so fucking nervous in my entire life. PHWOAAAAAAAR Just posted a photo https://t.co/IcMsfYsv8M Thank you @laurensarmes @pauledmonds217 @katesomerville georginahamed and DUNHILL. I feel so… https://t.co/AOLZiAMgme LET'S GO @jimmynapes https://t.co/6gfCGmdLQu Thanks dad for the good luck present 😩 https://t.co/IJO6BMn4uV Just watched 'Brooklyn' the film. I am ugly crying. Unbelievable. I am also completely in love with @EmoryCohen !! My heart is hurting 2 more days https://t.co/4WjV8XQL4j Congrats to everyone at the Brits tonight!! Looked so fun. I just can't get over how fit Rihanna is 😩❤️🙈 Rehearsing for Sunday. Fucking scared but also so excited!! Miss you all x https://t.co/BIjlsfuM3Q #freekesha Sitting here reading about everything  @KeshaRose is going through right now. Everyone send her as much love as possible. We love you. @JussieSmollett just read your out magazine cover story. You're amazing x So many amazing artists nominated for @BRITAwards. Please vote &amp; support my friends @JamesBayMusic &amp; @JessGlynne https://t.co/b8G1OVkbVQ xx Deja Vu being at @TheGRAMMYs tonight. Thank you for a great time &amp; congratulations to all x https://t.co/J9FNybLLfC Why is there not a day for the singles? OUTRAGEOUS haha Happy Valentine's Day to all the lonely hearts out there today ❤️ https://t.co/8TOaSc36sE Met these sensational Voguers last night. Love you guys ❤️❤️ ( That's me trying to give blue… https://t.co/I6pSSiEgV9 Met these sensational Voguers last night. Love you guys ❤️❤️ https://t.co/I6pSSiEgV9 @disclosure HAHAHAHAHAHA My name is Pepper LaBeija and I am the legendary mother of the house of LaBeija I have https://t.co/reX1Ojj8uC I love you @nayyirahwaheed - beautiful words https://t.co/CD0nkfu5fa Just posted a photo https://t.co/Ug9zYzGyHw Just posted a photo https://t.co/eMhks1jCY6 RT @KellyEclair: Click on the link below to see a few snippets of a little story I told/film I wrote. 'Meliorism'...Screening soon!\nhttps:/… Go on my son @jimmynapes https://t.co/mGqTkfqd4a Saint Laurent https://t.co/givVaOmEEB ❤️❤️ https://t.co/0TGYZPDUGg @reggimisam xxxx RT @billboard: 1 year ago today, @samsmithworld took home #GRAMMYs for record and song of the year -- and best new artist! https://t.co/aHk… Another fucking surreal day!! https://t.co/orqruClCze Beyonce 😛 Witnessed the amazing @sglewis_ smash his show last night in East London. Such a talent and the… https://t.co/9yXr0BtHte @IanLewis1960 @claraamfo @SGLewis_ lovely to meet you sir xx what a gig Just posted a photo https://t.co/KMBm8RpWad Living for Celebrity Big Brother UK right now Support my girl people. She's everything @iamTanika https://t.co/ASIgC1nO50. Sending all my love and prayers to Terry Wogans family &amp; friends. Such sad news Just saw 'Spotlight' I can not express enough how important it is for you all to see it. Powerful RT @theforum: #FlashbackFriday: On this date last year, @samsmithworld played the first of TWO SOLD OUT shows at the Forum! https://t.co/MG… Just finished 'making a murderer' woaaaaaaaaaaaaaaaaaah @thedanieb @BwayColorPurple I really really want to see it xxxx @CaraDillonSings can you sing yourself to sleep?? I would if I were you!! Every night haha x Having a massive @CaraDillonSings listening session. This women's voice holds so many beautiful memories in my heart The sun will dry the ocean. Heaven will cease to be. The world will lose its motion my love, If I prove false to thee Black is the colour of my true loves hair Went to see Wicked tonight. Properly took me back to my childhood. Made me emotional. Amazing… https://t.co/fzvNdweIx9 I wrote this quote in my year book when I finished school when I was 17. I live by this https://t.co/gAcOpMjvNd @Rosie 100% I'll direct message you gorgeous x It was not long ago but it's all coming back to me now @Rosie you are so lovely x thank you. Best concert EVER RT @Rosie: met this beautiful 23 year old sam smith - just about perfect in every way - he was a madonna concert VIRGIN !! XXX https://t.co… My fave https://t.co/PC9UiKWF6k Just posted a photo https://t.co/cHMSjrF4kv 🙌🏽 https://t.co/fH7jFH50w2 Miami. What a wild weekend. Had the best time with friends. Highlight was watching @madonna Slay!! https://t.co/1xKghfOt2n @4everBrandy aww. Tell her I said hello!! Her mother is the most talented human on the planet!!!!!!!! Unreal x congratulations @4everBrandy NEW SONG!! EUUUUUURGHHHHHHHHHHHHHHHHHHHHHHHH. Your voice is everything to me. So good!! WAVE ME BACK 'I find beauty in the grotesque, like most artists' x every now and then I escape into McQueens… https://t.co/VohNnp0y76 Just posted a photo https://t.co/QI2QkTh4sc ✂️ https://t.co/2QURomI32m Wrap up warm New York x Just posted a photo https://t.co/WKX6X0pWfV Not fun https://t.co/mW1uCEWTew Hangover Breakfast https://t.co/GDxMUCt35l @hollytmusic SANG Miami birthday love https://t.co/9Nz8amJOdb When your heart is broken down and your head don't reach the sky - take your broken wings and fly YESSSSSSSSSSS https://t.co/UfnymYGxNg @WhisperingBob yes please sir xx Please Read. https://t.co/m4O1ijlQi8 I want to start listening to some more country music. What albums should I buy? Beautiful night visiting my friends baby and drinking wine. I thought this picture summed up my… https://t.co/33l4blzEkx RT @inayik: @samsmithworld Racism is a refuge for the ignorant, it seeks to divide and to destroy, it is the enemy of freedom, it should be… I just got home and Nina Simone is on the radio - fitting I feel like I have to say something. I'm just so upset. So UPSET Humans are HUMANS I feel like I have to shine some sort of light on it. The police were so unhelpful in the situation and its deeply shocked me. I never ever ever ever thought that would happen here. Absolutely speechless and hurt. Just experienced my friend getting verbally abused racially in London. I am absolutely SPEECHLESS. Getting some air in the lungs https://t.co/jjnuoVcRpr Have courage and be kind. For where there is kindness there is goodness, and where there is goodness, there is magic. @inayik TRUTH Just know I love you x miss you guys x Hope you aren't feeling the January blues. They're killer xx I know I need a break but not singing to you all every night is killing me. I love and miss you all so so so so much I'm drunk tweeting and I don't care I'll be loving you always 1 year https://t.co/1KtBNWXJMe Laura Mvula is back with FIRE. @lauramvula love this gorgeous... https://t.co/SuiqfokuRT #BRITWOTW !!\nThis is the hashtag if you'd like to vote for 'Writing's On The Wall' to win Best British Video @brits https://t.co/Bc2jCYJyZz Watch The Brits Are Coming on @ITV from 10.40pm tonight to find out how you can vote xx Writing's On The Wall is nominated for Best British Video in this years @brits!! https://t.co/xphU45quIe Heartbreaking news. My favourite actor. Sending my entire heart and all my thoughts to Alan's… https://t.co/ujaLmrziQ6 This is my Oscar Nomination face. Unreal. Freaking out. Thank you Academy - Thank You Thank You… https://t.co/Penjai6TIk I dream of a love that even time will lie down and be still for. @charlieputh lovely to meet you finally sir xx thank you for your kind words @Lavernecox @Sarah_Hyland @InStyle you two..... 😍😍😍😍 Thoughts and heart with David's family and loved ones 💔 https://t.co/juboSMMK6h What. Just. Happened ❤️ @jimmynapes https://t.co/oSlqJYZVmO Had my radio on in the kitchen today. Still get a wave of heat and excitement through my bones every time my songs come on. So surreal @lizgarbus @netflix @NinaSimoneMusic MASTERPIECE ❤️ Just watched the Nina Simone documentary on Netflix. Holy shit. So fucking inspiring and… https://t.co/496izoYAK3 Just went to see 'The Danish Girl' - so powerful. Makes you think. About everything 2015 - best year of my life to date. To all who have shared it with me.... CHEERS ❤️ love you… https://t.co/h5VGfjn3Zt BOW DOWN TO THE QUEEN @ArethaFranklin   https://t.co/0HEe60GUlO Happy Birthday little sailors x Just posted a photo https://t.co/JE0I3LqDUO @thisNAO BAD BLOOD BABE 🙌🏽🙌🏽 unreal ❤️❤️❤️❤️ LADS LADS LADS https://t.co/I2NZplbjhZ DADA ❤️ https://t.co/Bi5i7zKbuX Driving home for Christmas https://t.co/wZFF2PDQt4 As if Christmas couldn't get any better - P.S. I love you is on TV!! Cue tears and me hunting for my Gerry for the next two weeks Trying to see the moon in London tonight. Is it too cloudy? Can anyone see it? Table set https://t.co/oIesU2q3Tl Best Christmas present of all time. Dumbledores cloak 😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭 https://t.co/EpCQgybAW5 MERRY CHRISTMAS TO ALL ❤️ I hope you have the most beautiful day with your families and loved… https://t.co/xFulCeVzTz CYAMON FULHAM https://t.co/hyXr1TAygs So good to see all my famalam today in Fulham #ROOTS https://t.co/rjX4N0JstS Christmas Eve eating and snuggles begin. Time to lay on the sofa like a beached whale for the… https://t.co/reccT6YBl8 It's not easy to find someone who cares - \nIt's not easy to find magic in pairs This film is my entire childhood. Always watch this at Christmas x https://t.co/QHRyRPw1sc Now that you're gone, I'm not covering https://t.co/nDFSXrfbb6 @kellyeclair ❤️❤️ https://t.co/KMp99Jcog2 It will all make sense, when the growing pains subside Just because it hurts, doesn't mean it isn't worth it 🙌🏽 https://t.co/ONjS5OC2Wt Watching Skins!! Proper throwback. Reminds me so much of school lol https://t.co/cpHxHcNbJK Romeo, Romeo, where for art thou Romeo? https://t.co/JFyPzIdNLf Jet lag tea party's https://t.co/VXcMxaHPvc Shame @bpgbass https://t.co/JP1DoJY6Cf Just came home and my house has been CHRISTMASFIED x https://t.co/ZvHHBLO3W5 I'm hoooooooome 😁 https://t.co/w4iio7M0Jt RT @ScottFeinberg: EXCLUSIVE: Watch the #SPECTRE title sequence feat. @samsmithworld's 'Writing's on the Wall' https://t.co/Tcsowyk4U6 http… Listening to loads of musical theatre tonight. Taking me back to my childhood x Where has the starlight gone? Dark is the day. 😭😩😭😩 #Holdingtheman https://t.co/d2bWDbWcgO Just watched 'holding the man' on the plane for the second time. Crying MESS @HTMmovie For you But oh darling my hearts on fire Australia. It has been magical. Thank you to everyone who has made this trip extra special. In… https://t.co/LQRhBvOiDm Tea tree river https://t.co/jEEFzk4n3Q Meet me in the middle of the night.\nThe morning light is comin', don't it make you wanna go and… https://t.co/eUpHHsk6vQ You are my sweetest downfall https://t.co/EOsqqvj4ZT Listening to Jeff Buckley Live at Sin-è whilst walking through the rainforest. Life is good https://t.co/Mo8LDj2oQn @respektor xxxxxxxxxxxxx I hope to thank you in person one day xx I just wrote my new album title in the sand. I always start new projects with a working title or… https://t.co/2D7o3TMnwk If I kiss you where it's sore - will you feel better? Sitting by the pool listening to @respektor - your music gives me life. Thank you for it x Take my hand https://t.co/xPrFsbGnBO Re charging under the stars https://t.co/WKP3Z7cruC So upset that I won't be seeing my incredible band for a while x I love you all dearly https://t.co/e0xJJCLdVu Sorry to be intense and cringe - but it's the truth. I will always be in complete awe and filled with complete confusion at the stars x Reminds me how small we all are, but also how mighty and magic we all are as humans. I find just sitting and watching the stars is almost like plugging your spirit and soul on to charge. Star gazing in Australia is other worldly. Just sat on the beach with my family and star gazed. I have never seen anything like it @MusicLapsley fall in love with 'Hurt me' more and more each day x Holiday https://t.co/75TshA5usn Cut and bruised. What a night https://t.co/CI07Z8Ad1i ❤️ https://t.co/N50OV3Pm5l THATS HOW FUCKING INCREDIBLE THAT FINAL SHOW WAS - WARRIOR CUT https://t.co/j06Kwq3EmV hoodclips's video https://t.co/zRP3FNROef Last workout session of the tour. Getting ready for the last ever In The Lonely Hour show tonight 😓 https://t.co/3insHXXSI9 @lisafischersing hope you're well beautiful girl xxxx Never cease to explore https://t.co/Hgv4aNX3VG 🐍 jackmethod https://t.co/7hwztnuqBk Me attempting to do the Britney Spears VMA slave 4 U performance https://t.co/lGGJF5BGoF ELLO https://t.co/93zn7T7wRx New addition to the family https://t.co/pasSf7cDo3 Snake Fam @mrjamielblake @itsreubenjames https://t.co/RJIa83Qaqm I've fallen in love https://t.co/tsX5oUcrWb Just posted a photo https://t.co/uckRbDoaqN I want one https://t.co/ebwPRz4uRJ 🙌🏽 @bpgbass https://t.co/4LZ5y70aIE LEGGO 🎢 https://t.co/v8jmDEfwIy Me and my brother @jimmynapes ❤️ https://t.co/l9GEGqKizq RT @jimmynapes: @samsmithworld and I have been nominated for a Golden Globe! https://t.co/uL0XoB60Ca RT @007: Congratulations to @SamSmithWorld on his Golden Globe nomination for Best Original Song for Writing’s On The Wall #SPECTRE AHHHHHHHHHHHGGHGGGG!! ❤️❤️ so excited about getting a nomination. One step closer to meeting… https://t.co/VqbZYEHaew MY LIFE GOAL IS TO BE DUMBLEDORE https://t.co/YDf0gOG6Sb Just found my dream house ❤️ https://t.co/Cj3E0hACB2 Love you Melbourne x until next time ❤️❤️ https://t.co/asPx4hqcra ❤️ tonight was a seriously emotional one. Can't believe there is only one show left!! https://t.co/4bYYxzGv1V It was all make sense. When the growing pains subside ☕️❄️ https://t.co/WpXWaCue8r On another note - IM HAVING THE BEST TIME xxxx 🙌🏽🙌🏽 I'm getting there thou lol slowly but surely xx Why is it when you have a crowd of people saying you're great - you notice the one who says you're not? Haha the heart is complicated The reviews I care about are from YOU. And only you - my fans. The people who have put me here. Sometimes you're never going to win It's so tough to win the thumbs up from people that are paid to come to see what you do, when they could hate your music to begin with I've decided to try not to read reviews anymore. I never claimed to be flawless\nI owned up to my faults\nYours were subtle,\npainful betrayal\nBut I… https://t.co/QWDpnElEg9 Melbourne, that was so special. I gave you all of me and you hit me straight back with all of you… https://t.co/2DY07Zt4qA Third - This is what I promise to be in my music. It's what I live by. In the words of… https://t.co/7I0nEApnxY Second - this tattoo is inspired by one of the oldest tattoos ever found on a mummified body that… https://t.co/LwBKfFmhll First one - the equality sign on my wedding finger. This ones pretty self explanatory. It shows… https://t.co/ipm7jQhIxh So honoured &amp; overwhelmed to not only have met this incredible but artist, but to have her tattoo… https://t.co/ycnLwWQXWp xxxx https://t.co/ivVu2rMUug If you've been with me this year, you'll recognise this... https://t.co/D7O5194eDg 999 https://t.co/DYXtRJ8fpG @Smallzy aww man I'm so happy you liked it xx see you soon. Looking really great by the way xx Three Musketeers ☝🏻️☝🏻☝🏻 https://t.co/7LOWbGhkR3 Cheat meal https://t.co/zltugdgiDJ One of those days https://t.co/rjXvVUwxtx Sydney - last night was un fucking real. You knew every word. I can't wait to be back here x 3… https://t.co/utjrTj5eud Channelling my inner George Michael last night xx https://t.co/MK97VWiI6J ❤️❤️❤️ new friends https://t.co/5Ow6cb3aQv Goodnight Sydney x can't wait to sing for you all again tomorrow x https://t.co/g64ryzR06L SYDNEY 🙌🏽❤️😭 https://t.co/dMCbXBbUy5 The fam have arrived. Curing the jet lag with some pampering xx lol https://t.co/wMg9x9SpTe Everybody needs to go out today and purchase this little beauty of an album @troyesivan !!… https://t.co/2PM71OD2aL Just watched the documentary 'Remembering the man' - left me in a right old state. I wish both… https://t.co/tGVfQ4nFkN Wish I was there to see these boys in our home town tonight @disclosure - but my pink bubble face… https://t.co/sCvH7FsYm8 There she is https://t.co/UXTrPRps5n Helping my two loves put up there first Christmas tree ❤️❤️ @trentoz #ANTHONY https://t.co/SCqYpUFgRZ Fresh shave ✂️ https://t.co/9brcxvZLwz I  love you John Grant https://t.co/cpRopazHcx Sydney I love you - but what's the deal with the weather lol https://t.co/x5N3AqHy4m Reunited with my bestie @trentoz https://t.co/ORVPVeeYBg Sydney we here YO https://t.co/Spqq77EGSd Adelaide I've loved every minute of being here x thank you all for having me https://t.co/GNJV3A8C9p Breakfast selfie 🍳 https://t.co/IFGveiwXsG xx Goodnight all xx https://t.co/4ZmrzDKJz6 😩😱😛😭😁👐🏼 https://t.co/rtNRxef3sF Pirelli calendar. POWERFUL, STRONG, SMART, REAL WOMEN!! YES 💪🏼 I would kill for this in my home xx https://t.co/OSu4FvxvVe ADELAIDE. Made me feel like I was in a dream tonight. Thank you all so much x https://t.co/fEGh1CGntU Everybody please support and donate &amp; just take a minute today to pray for all of those suffering… https://t.co/YUi38q6afz @giordyycimmino love you all x 😧 https://t.co/4ED888cuGT @thisisLANY my absolute pleasure x thank you for the music I am so obsessed with thisislany ❤️ https://t.co/daB2nnF0IN New addition to the Smith &amp; Claire household @tiffanyeclair ❤️ everybody meet Winston 👶🏼😂 https://t.co/m1jRad54PJ Ever since I started writing songs, from the age of 12 (my first song I wrote was called 'Yellow Hat'… https://t.co/fL7qsKs21n Just fine. Nothing more - nothing less https://t.co/LPWUZYlKX4 The only way I'm not gonna munch up that bread... @chenjerbi https://t.co/ybh9wmHfWa I'M DEAD 😩😩😩😩😂😂😂😂 @vulavox YOU ARE ONE OF A KIND https://t.co/8fjA9GYF12 Still on such a high from last night. It's so strange but I think it's only just hitting me what's… https://t.co/3E9xgnp8Q7 ❤️ https://t.co/GwLgMywadT @MNEK @DeRozenDontCare HAHAHAHAHAHAHAHAHA amazing PERTH. I'm an emotional wreck after that - I love you https://t.co/kvhKedvaDF Half a billion views. Not bad @lukemonaghan x https://t.co/p9Q4PGEQjU Completely obsessed with this Instagram babes_in_boyland https://t.co/biWyzNrNhT 😝 https://t.co/xpJVRXZAM6 Working hard for those Shia abs 👐🏼 https://t.co/alO4AmEn7T It feels like we are coming to an end but I have to remember - this is only the beginning xx Sitting with the band tonight. Reminiscing on the past few years and the amazing memories we've made with you all Lads on tour https://t.co/ElFDrl2f3T Lush colours https://t.co/4oeXSaWSe2 Perth looking beautiful tonight. And you insta_paddyp haha x https://t.co/Lm059J90WF Australia. We are here. Enjoying the sun. Brits abroad https://t.co/Y7YfaT5Ez4 HAPPY THANKSGIVING to my beautiful American friends and fans and family. I  love you all ❤️ https://t.co/a22ipENMr6 👧🏼👦🏻 https://t.co/ODoXZ8f8oG One of my favourite films &amp; soundtracks x https://t.co/MNepZuUyBi Farewell Japan 🙌🏽🙌🏽🙌🏽🙌🏽 it's been incredible. Australia here we come!! Trying to stay as healthy as… https://t.co/BwMpvTdIjn Snooze ya lose @itsreubenjames https://t.co/Gm6Gocy9aU Goals https://t.co/3NnsXooZud ❤️🌷 https://t.co/cNCieYBtEv You're the one designed for me...\nhttps://t.co/Jb5ZaZbC55\nhttps://t.co/SniYAoJ4WR Just for the record - I'm not a huge Star Wars fan haha I just love ewoks haha x I need to watch all the films for sure thou x First bullet train 😂 https://t.co/M0kX61Od49 TOKYO ❤️ I love you https://t.co/te9tha2TWE Going to miss my Japanese fans!! So amazing haha. The guy on the rights name is 'YAS' - best name… https://t.co/xnc2GhjWLS Alan is going IN https://t.co/jKperfi8Dx Another Ewok from my fans ❤️❤️ oh no - is this gonna become a thing? Haha https://t.co/ggGi5KYI2G Just chilling with my Ewok - admiring this beautiful city ❤️😩😂 https://t.co/rDt3yheVM7 Jet lag is an actual bitch https://t.co/1575Tqa2MZ RT @gwenstefani: @samsmithworld totally agree #thisguyisheaven #soluckytoknowjustin gx https://t.co/J5RHcLndm7 RT @GagaReece: @samsmithworld I CANT PAY MY RENT BUT IM FUCKING GORGEOUS!! ❤️ to everyone at the AMA's tonight!! Especially tranterjustin for being the chicest!! Here is a… https://t.co/6hAPGn1ExB Me when I'm older ❤️ https://t.co/GO4bRFQUd5 My all time favourite quote. Live my life by this one ❤️🙌🏽❤️ https://t.co/7PwULPsKMh I am what I am. I am my own special creation @bpgbass @maxgerrans https://t.co/lBWFE45zVf First sushi of the trip ❤️ https://t.co/zOyNFptJXa Ami 😍 https://t.co/KIkEvhSMUd Definitely just purchased a life size Ewok https://t.co/7BscLWzPcA Military doughnut!! Prepare yourself for loads of posts today!! Japan fascinates me ❤️ https://t.co/bknyq38H5I Morning Japan ✌🏽️ https://t.co/MkiO8Jnx09 My fans are the chicest 💅🏼 https://t.co/9Z7CakUtR5 👭👬👫 https://t.co/Xu0EQG3j0t Officially the weirdest present I have ever received. By the way - that is not my ting in the trunk 🐘 https://t.co/r4xTvd8sTK Just posted a photo https://t.co/IfFMvP3cxe ❤️❤️❤️❤️🙌🏽🙌🏽🙌🏽🙌🏽 see you soon Manilla xx https://t.co/dpAhGI7fIj Got given this last night to certify that In The Lonely Hour is 3X PLATINUM in the Philippines… https://t.co/dkWmKWGdj9 YAS @Tinashe YAS YAS YAS!! https://t.co/okTigMg6gd 😭 https://t.co/630bZoCEWI And the last EVER 'In The Lonely Hour Tour' Begins... Manila - that was unreal xx https://t.co/Hh0MWEPMfc ❤️ georginahamed ❤️ https://t.co/Yn9fF4gLwY Breakfast under the trees x https://t.co/kOCoHzdCqw Fuck. I am in love with @justinbieber 's album!! It's soulful and honest and just beautiful xx thank you for Le music sir xx Well Manilla - you're beautiful https://t.co/kGWDkzFeHj RT @edvaizey: Congrats @SamSmithWorld whose album #IntheLonelyHour becomes only 6th album this decade to pass 2 million UK sales https://t.… Airport nights x https://t.co/zBYThz6eo5 Planes fuck with me so much. Feel like shit every time I step off one IN THE LONELY HOUR: DROWNING SHADOWS EDITION\nThank you for listening @sarahgrrlonfire\nhttps://t.co/GaC3BfbVts https://t.co/jIetdrnM5s After watching the film 'FLIGHT' last night - I must say I am shitting myself right now about this… https://t.co/ergzlrZ6ih I am sorry we are not where we thought we would be Maria herself has just sent me her new album @mariamena_no !! I am a crying mess. This shit is my… https://t.co/kmzX07jK8r There are 100 signed pieces of 'Stay With Me' soundwaves art for sale at https://t.co/LGXhMaB4iu for @WarChildUK xx https://t.co/9bHSAWmGfc RESTART\nTrack eleven: In The Lonely Hour Drowning Shadows Edition \nhttps://t.co/aHnZj0Y9X0\nhttps://t.co/UzNrFtxoP6 New additions to my playlist on @Spotify.. @mariamena_no &amp; @KELLYROWLAND ❤\nhttps://t.co/ubY2A26ggo, if you'd like to listen xx Everything and more https://t.co/vMoHRDhko2 Just been to see the beautiful @ameliafreer !! Feeling inspired again and staying on track with my… https://t.co/HFgQUWVHMa WRITING'S ON THE WALL. Live on @TheGNShow \nThank you to everyone supporting my song for SPECTRE xx\nhttps://t.co/O2b5RxBWWB Night in with papa smith x https://t.co/XxfBDmpljm The response to the special edition of my album has been overwhelming. So happy you're enjoying 'Drowning Shadows' https://t.co/GaC3BfbVts @lordemusic pizza in the club ❤️❤️ I adore you I'm an Englishman in New York x https://t.co/atOWzfZHc9 OMEN!! @nbcsnl, @Disclosure\nhttps://t.co/w6X8r28nVa Just landed back in London x what a lovely few days!! Still on a high from SNL x @disclosure @lordemusic https://t.co/6yukh6OgfU That just happened ❤️ love my brothers so much @disclosure so proud and honoured to have stood on… https://t.co/Bmvf6UpIhZ It's days and moments like today - we must turn to music. I promise it will sooth and comfort the… https://t.co/DlJjbyf2DQ Paris tribute in New York tonight ❤️🇫🇷💔 https://t.co/frLAjkGpt0 Praying For Paris. Sitting here staring at the news. My thoughts and my heart is with all the family… https://t.co/evCI1GOjdY My heart and thoughts and prayers are with all the family and friends of the victims and all the people in Paris tonight xxxx Tearful watching the news of what's happening in Paris. There is such evil in this world. ❤️💔❤️ https://t.co/n4bXET19mo Love A night in. Resting my voice. Just me - A romantic film &amp; this romantic sky ❤️ https://t.co/9ykWdLcy9P I love you but not in that way.\nTrack nine: In The Lonely Hour Drowning Shadows Edition \nhttps://t.co/GaC3BfbVts\nhttps://t.co/6LNdZ44rW0 Saturday Night Live rehearsals ❤️ @disclosure @lordemusic https://t.co/hFysbZnDdu DROWNING SHADOWS \nhttps://t.co/Jb5ZaYU0Gv // https://t.co/gllOSmDoJy https://t.co/3JqS1lP4Jy ❤️💔❤️ https://t.co/CBqis2xoUQ LIFE SUPPORT \nTrack eight: In The Lonely Hour Drowning Shadows Edition https://t.co/GaC3BfbVts\nhttps://t.co/9VrCbiZLdB @example @professorgreen @marmite haha 😩😂 Before I sleep however I'm watching one of my favourite movies of all time. Weekend xx https://t.co/BfIplC3VKC @EstelleDarlings LOVE 'beat it up' - I'm vibing with it. It's a tune xxx haha x @professorgreen @marmite @example I'm dying of laughter. Twitter beef with official marmite 😂😩 welcome to the marmite party Pro xxxx Hope you all enjoyed Fallon. Such a lovely man. Little bit in love with him haha. Off to bed 🙌🏽 https://t.co/uYjBiWLU0w NEW YORK. Feels good to be back ❤️ https://t.co/WFhFQQUOss Looking fresh @laurensarmes https://t.co/QjMuP6MiBn And now the final frame, Love is a losing game... xx\nhttps://t.co/Ntg0qqjqe3 @marmite @example I LOVE marmite. Let's have a marmite party. I like marmite and cheese toasted sandwiches. FIT RT @jimmyfallon: Tonight on the show: James McAvoy, @samsmithworld, stand-up from @kurtbraunohler and a new Tonight Show Suggestion Box! #F… ❤❤❤\nThank you @shanni20s\nWebstore: https://t.co/gllOSmV088 https://t.co/wbKUm9UlVM So I'm sitting in bed googling pictures of fish and chips. This is a mixture of being home sick and… https://t.co/sZyP4eRDRK Thank you to everyone listening to Drowning Shadows. You can find a copy here if you'd like https://t.co/GaC3BfbVts\nhttps://t.co/ym2NqaUdqK Your face is pasty coz you've gone and got so waisted, what a surprise, don't want to look at your face coz it's making me siiiiick 🙌🏽 East Coast we here yo https://t.co/lsZ2RjRQIn ❤️❤️ https://t.co/hC2v4eL7ib RT @DameEdnaEverage: @samsmithworld 😘🐨 TUUUUUUUUUUNE https://t.co/zUVZJ8a4Fx My chin and ear sending love ❤️ Too early to show full face haha https://t.co/1jUZ0phEPR 🙈🙈😂😂 he cray  https://t.co/60rtJXN8r0 ❤️❤️❤️❤️ https://t.co/o7WkoyfB2c Farewell LA xx https://t.co/4Fr4RfGnqZ IN THE LONELY HOUR DROWNING SHADOWS EDITION\nThank you for listening MrSmithsWorld\nhttps://t.co/GaC3BfbVts https://t.co/MUTP1rAjGa My favourite writer and artist ever @mariamena_no has released her new song!! Me and Maria have… https://t.co/tdBaMNmDFC I've Told You Now\nTrack Six: In The Lonely Hour Drowning Shadows Edition \nhttps://t.co/GaC3BfbVts\nhttps://t.co/AR4LWJ8bKd @Frances_Music XXXX Happy Birthday Joni x https://t.co/NOhuklZ7fH My local firework night!! Wish I was there xx happy firework nights UK - be safe xx https://t.co/0kqbXC6S7N Hope you're enjoying the new tracks. xx\nhttps://t.co/aHnZj0Y9X0 RT @TheEllenShow: I ❤️ @SamSmithWorld https://t.co/ybDzVwjtG7 RT @AppleMusic: The Drowning Shadows Edition of In the Lonely Hour has arrived.\n@samsmithworld https://t.co/Jh4NoqVjop https://t.co/v2YPYhN… One of my favourite people in the world ❤️ theellenshow https://t.co/g6cwtZvVqd Proudest moment https://t.co/SM5bGV8vQD Like father like son @jimmynapes misstilda https://t.co/dGky9ovaUd This re pack is directly from me to you. I love you guys. I hope you like my little note inside.… https://t.co/KRpWbKiKil Thank you so so much to all of you for supporting my music. I love you all so much xx\nhttps://t.co/gllOSmV088 // https://t.co/hPuOT2jzkV IN THE LONELY HOUR DROWNING SHADOWS\nThe special edition of my debut album is out today!! \nhttps://t.co/GaC3BeUkBU https://t.co/gImnZM3eJK IT'S OFFICIALLY HERE!! My re-package. I hope you all love it as much as I do x I tried to make this… https://t.co/gsjOL8BE1W MIDNIGHT TONIGHT!! \nhttps://t.co/Jb5ZaYU0Gv  //  https://t.co/gllOSmDoJy // https://t.co/5dtokIP0Z6 https://t.co/LVjJ3nGYv5 RT @BBCR1: 😍😍😍 https://t.co/qcvAWwecRw You can hear my cover of one of my favourite Amy Winehouse tracks 'Love Is A Losing Game' on @AnnieMac's @BBCR1 show tonight @greysonchance really lovely meeting you sir xx @edibow Thanks gorgeous!! I'm currently in bed with a scarf Round my throat, that apparently helps. Hope you aren't feeling too bad :-( Feeling very sorry for myself tonight. Throat Glands are so fucking big. Feel like I have a tennis… https://t.co/wslz1K2fUm LA nights x https://t.co/6t5t5UPHIA Congratulations to all the winners at the @MOBOAwards tonight, last year was a very special evening for me ☝🏻️ https://t.co/rh2MFO1o40 Fake fall https://t.co/oMAvsb1AkQ I'm Not The Only One\nTrack Five: In The Lonely Hour Drowning Shadows Edition \nhttps://t.co/xMshoKk6DG\nhttps://t.co/6YlDTqyGvn I'm nominated 3X at @theAMAs! RT this to vote \"@samsmithworld ARTIST OF THE YEAR #AMAs” https://t.co/uW6yfajFB1 https://t.co/5nmOHUGMqf About last night https://t.co/53QEvh2l3b Farewell Mexico x I love you https://t.co/3wewdniJW0 Returning to this album x haven't listened in so long!! It's so beautiful x https://t.co/YT7oV8znNd When I sit back and listen to @emelisande 'River'... I swear to god - I get my shit together haha. It helps me clarify what's important DROWNING SHADOWS  \nPre-order the album on @iTunes https://t.co/Jb5ZaYU0Gv, and my new song will download instantly.\nhttps://t.co/TKXrGGtL6R 🙌🏽 https://t.co/ASJFNP8s3K Massive shout out to @FraserTSmith who wrote 'drowning shadows' with me. Thank you for being my therapist xx love you sir Xx IT'S HERE!! https://t.co/GaC3BeUkBU #drowningshadows https://t.co/ktg3x8SW6G Mexico City x here we come #spectre https://t.co/XQyL2spSvL RT @professorgreen: Today is the day, 'Suicide and Me' is on bbcthree at 9pm this evening. Please spread the word. X https://t.co/9n9lvgn0cl RT @liamaliciosa: most beautiful and sad song i've ever heard @samsmithworld #drowningshadows If you pre-order 'In The Lonely Hour Drowning Shadows Edition' on @iTunes https://t.co/Jb5ZaZbC55, the track will be yours at midnight xx Thank you for all your messages about 'Drowning Shadows'!! https://t.co/iPi0Yrsaik RT @NylonMag: Crying real tears over @samsmithworld's new song: https://t.co/Zc92e3ykfn https://t.co/kkBmU3sfWD RT @MTV: Well, I'll be crying at my desk for the rest of the day. Thank you, @samsmithworld. https://t.co/WbMVc5y5Bt RT @MTVNews: .@SamSmithWorld just released the saddest song EVER. We are drowning in tears: https://t.co/Ukt2VUb8oL Drowning shadows is out tonight!! You ready guys?? I'm feeling way more emotional about this one than I thought xx ❤️❤️ RT @vegandoris: Wow @samsmithworld so raw, so real, so beautiful ❤ #drowningshadows RT @brittrodd: I can't even breathe. Drowning Shadows is so amazing, so heartfelt, so soulful, so everything oh my gosh @samsmithworld RT @fentyphxcker: What a way to bow out of an amazing era. We all know it's for the better. But we'll miss you @samsmithworld https://t.co/… RT @Kevinkiley123: @samsmithworld you slay my life #DrowningShadows  ❤️ RT @_EUsOJ: Excuse me, what did you just do to me @samsmithworld ? what an amazing song you have created! 💙 #DrowningShadows RT @Rebekah_X0: #drowningshadows really hit me😭😭😭❤️ @samsmithworld💘 RT @Aisyahzsleng: im in love #drowningshadows @samsmithworld 😍 RT @tattooedreams: @samsmithworld #drowningshadows it soooooo dark but so good at the same time 😭😭 RT @Focusonbabe: @samsmithworld i love THIS OMFG #drowningshadows @zanelowe xxxx ❤️❤️ RT @zanelowe: @samsmithworld  what a sad and beautiful song, brother. #DrowningShadows #WorldRecord RT @NowMag: .@samsmithworld just dropped ‘the saddest song I have ever written’ and we CAN’T HANDLE https://t.co/GrlvNrBzwk https://t.co/ia… RT @johnmarkowsky: Drowning Shadows by @samsmithworld - the most incredible, personal, touching song I've ever heard. So sad, so relatable. RT @zanelowe: 'Why don't I just sit back, take a breath, kiss some more boys and write some more songs' - @samsmithworld on (maybe) taking … RT @KevinOGarrett: @samsmithworld @zanelowe @Beats1 @AppleMusic 🔥🔥🔥 @zanelowe @Beats1 @AppleMusic love you sir. Thank you x RT @zanelowe: The incredible @samsmithworld 'Drowning Shadows' #WorldRecord @Beats1 @AppleMusic now Do I go home to nothing? Or Stay out more? Give in to someone? Or lock down my door? Or Drown all my… https://t.co/LeOJRUQBNP Just posted a photo https://t.co/VxQ5sPgmYO Everyone tune into Beats1 - My song 'Drowning Shadows' from In The Lonely Hour Drowning shadows… https://t.co/RJbvoAKJgr RT @zanelowe: 'It's the saddest song I have ever written' - @samsmithworld. 'Drowning Shadows' World Premiere. 9:30amPST. 5:30pmGMT. @Beats… RT @Beats1: New @samsmithworld playing in 1hr on #Beats1!\n+ @gwenstefani x @zanelowe interview @ 10AM PT\nhttps://t.co/rAPwDbsSan https://t.… Drowning Shadows...\nTonight!! 5.30GMT 9.30PST @Beats1​ @zanelowe https://t.co/QNJRiW3L7i https://t.co/ViUckw8Fvt 👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼 https://t.co/0rN8bC6zYh xx https://t.co/gA8DEEScIH 🙌🏽 https://t.co/GI4oklxguC IM DEAD 😩😩😩😩😩😩😂😂😂😂❤️😂😂😂 @katyperry https://t.co/hOhxin3nlV Can't take the kid out of me https://t.co/nEHAQ8HQ1B I hunt for a love as deep as yours Frida ❤️💔 https://t.co/TbLRQXufLf 💙 Frida Kahlo's house. One of the most beautiful houses I've ever seen https://t.co/WBcPzuEgrT Afternoon Mexico ✌🏽️ https://t.co/Bm81LCWnyi Leave Your Lover\nTrack Four: In The Lonely Hour Drowning Shadows Edition \nhttps://t.co/Jb5ZaYU0Gv https://t.co/ZlqgZF6F29 Throwback x https://t.co/S58QsdpGnP Happy Halloween All. Hope you have a frightfully amazing night 👻 throwback to two years ago when I… https://t.co/DPl8mCioLs Next stop https://t.co/2uPOcViQbn THIS KISS THIS KISS ❤️🙌🏽❤️ https://t.co/uySb0ieNX4 In just one week's time 'In The Lonely Hour Drowning Shadows Edition' will be yours. https://t.co/xMshoKk6DG xx https://t.co/rUhM9jaRtZ GET YOUR ASS HOME NOW @tiffanyeclair ❤️ this is gonna taste boom https://t.co/usyl40GGvb Going IN https://t.co/w7u35muowA Thank you to everyone who watched my @BBCRadio2 in concert show, such a special night!! https://t.co/7GZgUzwajf https://t.co/AOSIZJJ6nW Woke up to a present from @17Dobson ❤❤❤❤ she knows me too well. My favourite album x https://t.co/ubY2A1OFoQ https://t.co/81WvC0cEAq Just woke up to a present from @17dobson ❤️❤️❤️❤️ she knows me too well. My favourite album x https://t.co/eUQvxoItLU ❤️🙌🏽👐🏼⭐️☀️🌠🌍🎹✈️⚓️⛵️🔮 https://t.co/OYi2ARLPxL Me &amp; @jimmynapes just took @aliciakeys to her first English Pub. Unbelievable Geoff https://t.co/ksc2DwJuXJ I owe a lot to this woman @anniemac !! Thank you for everything - and for loving music so fucking… https://t.co/wd3OUxAuP5 Just received The Drowning Shadows edition of my album in PHYSICAL form. Nothing beats this feeling.… https://t.co/9XgUD2Znwo And so the lion fell in love with the lamb RT @AnnieMac: My guest on tonight's show is the humble &amp; hilarious @samsmithworld. Listen from 7pm for his party playlist &amp; reflections on … Having a very Emo moment. Watching twilight by myself Sometimes I wake up with so many lyrics in my head. I wish I could put every single thought of mine… https://t.co/YVzWSzZP7k @iAmShakka congrats on the Mobo man x 🙌🏽🙌🏽 @iAmShakka new song is unreal. Such a huge fucking talent xx Good Thing\nTrack Two: In The Lonely Hour Drowning Shadows Edition \nhttps://t.co/Jb5ZaYU0Gv\nhttps://t.co/59B6BinScw Big shout out to @prada last night for the beautiful outfit xx https://t.co/MtPK4Qo8sb Just sat and introduced this film to my dad x LOVE this film even though it makes me so hungry x https://t.co/4SPy6oo5Vm Couldn't be more excited for this @mariamena_no https://t.co/7XfTqdHeKX RT @BBCR1: Which solo artist tops your chart? Vote for Best British Solo Artist in the #R1TeenAwards https://t.co/a82c4iZSB6 https://t.co/U… Still in a dream after last night x https://t.co/kJA2y2z95a @DrBrianMay WOW X thank you sir ❤️ rolling with the family tonight https://t.co/6abaPkVaXf Peak. When your laces go 😱 https://t.co/uQYSBc1Wo1 McRomance @tiffanyeclair https://t.co/RuvW63Hyor 'This lamps HOT which means there is a student out of BED' #FILCH https://t.co/uBrUF584H6 FILCH ❤️❤️❤️😩😩😩🙌🏽🙌🏽🙌🏽😭😭 https://t.co/yheGMy6sj8 ❤️'s of my life @jimmynapes misstilda https://t.co/Z42ESYEMZm IM STRAIGHT STRAIGHT STRAIGHT FOR THIS GIRL @tiffanyeclair https://t.co/d0LtIrxakk What a surreal evening. Unreal. Hope you all love the film as much as I do https://t.co/wIMffXnfJW Oh what a night https://t.co/CjtDvqNBoy Let's go https://t.co/BaKZ9xIXuF Prince Henry https://t.co/gzpSXaO6oq Having a huge @iamjojo listening session on the plane right now xx LA - short but sweet. See you soon x https://t.co/rOYkQR0uR1 👒 https://t.co/fIWUREdGGG This picture sums up my night perfectly https://t.co/tcf9QKzNU4 😋 https://t.co/Ith3m1QNxV Last night x https://t.co/sFMaLDm0FO 😏 https://t.co/LdLWguPYbB High school sweethearts ❤️ @jessieware https://t.co/Zb6lowLlV8 When in LA https://t.co/qinXApgeXV NME https://t.co/CTgvWO9NYP Hope you all enjoyed x https://t.co/keWrTh0z5g Thinking of everyone in Mexico tonight!! Really hope this isn't as bad as predicted xxxx Possibly my favourite picture ❤️ @_lilysmith https://t.co/Gz4qmKmN7r My 'I'm tired as fuck' face https://t.co/e277yXHLAF Tonight... @TheGNShow https://t.co/cDasKCOy1g This look adele actually made me scream like a little girl https://t.co/W4rQs8drZR Tonight... https://t.co/B1IhkmlkvQ 'Writing's On The Wall', my track for James Bond #Spectre is out now on CD and vinyl!! https://t.co/7RpiBDL5Mf https://t.co/LrSwX8Fyd6 Me and Mr Mendes x https://t.co/wKxfTjoQ2D RT @disclosure: .@ElizabethBanks @nbcsnl We’re ready… and we’re bringing some friends! @lordemusic @samsmithworld letsgoooo! https://t.co/n… 🙌🏽 https://t.co/uJXwT2NyNK ❤️ @frances_music https://t.co/2UTaoWVV82 Pig Riding https://t.co/AGJuFSKSQd It is always going to be about love - quote from yours truly lol That's also my dream house!! https://t.co/4wUqVJ9TXL Just watched my favourite film with my other half @tiffanyeclair ❤️ this film makes my heart ache x https://t.co/Gip5CGTFDb You're in my blood like holy wine. Say my name say my name RT @007: Director Sam Mendes and @samsmithworld discuss the #SPECTRE theme song in this new behind-the-scenes vlog.\nhttps://t.co/oxZGjgHFIB TRUTH - Honesty. My girl killing it right now. Music with a message. Very proud of you @iamtanika… https://t.co/Fb2toDRevd YEAH BOI guinnessworldrecords https://t.co/K3ornMPJKv HYPED over that Adele snippet. Anyone else? x Lushest weekend away with my family in Whitley Bay/Newcastle. Been coming here since I was born. It's… https://t.co/AQsCHN6zlZ Locked out the light today and watched 3 Harry Potters. Good going https://t.co/5T5wqwdRdR Thank you to everyone listening to my playlist, glad you're enjoying the tracks I've chosen http://t.co/ubY2A26ggo http://t.co/uJYj01mdkr Happy Birthday Terry 😂❤️ @mrjamielblake https://t.co/flkT6c8RUs 👧🏻👦🏻👧🏼 https://t.co/joRB773zQU ⚡️⚡️⚡️⚡️⚡️⚡️⚡️⚡️⚡️⚡️⚡️ https://t.co/SvdY8H53Uz Famalam https://t.co/Nim2MBExUz King Of The Castle https://t.co/MaJuG4oBdI Writing's On The Wall is released on CD &amp; vinyl in one week. Pre-order here if you'd like http://t.co/xMshoKk6DG xx http://t.co/Po6h3VD79f The other night I was so so lucky to catch @frances_music play in such an intimate venue. Can't wait… https://t.co/KvCe4qvjss Regram from @jimmynapes xx https://t.co/ra1IL6lBZE HAPPY BIRTHDAY ❤️ @JessieWare ❤️ How do I live, how do I breathe... x\nhttp://t.co/LYGQePI8Cm http://t.co/BDmavITE06 ❤️❤️❤️❤️❤️❤️❤️❤️❤️ https://t.co/19cGUsnHQR Breakfast with this beautiful boy today xx https://t.co/C70YbZSqzV Possibly the best tweet I've ever seen https://t.co/sodUFYoUal ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ https://t.co/NUPpktYx6T Feeling blessed to be with my besties for the last few days xx without these two.... I wouldn't be… https://t.co/kGn1Jq5UtB In therapy https://t.co/UzQ37SzCJl How is it jet lag STILL kicking my ass https://t.co/Z4fNik4vMl ❤️ https://t.co/Xrul8Jrz6P Two For Joy. Painted for me by Evi Antonio . Going to look incredible in my house xx https://t.co/vxBYhr8VJD Hahahahaha my fans made this. Amazing haha https://t.co/bIw6OSwT9I 🙌🏽🙌🏽🙌🏽🙌🏽 Happy Coming out day to all the brave hearts xxxx https://t.co/j73DB8jfIG 😂😂😂😂 https://t.co/i8sHxAQRNQ Well I'm having a very cultured evening. Thanks to @17dobson ❤️ https://t.co/UmBPGfDIDP My new favourite album from one of my all time favourite books and films xx https://t.co/OfGeRBhJyD RT @disclosure: Our new single JADED is track of the day on @BBCR1!\nListen out for it on every show till 7pm http://t.co/fwitCkHIBG\nhttps:/… My jet lag recovery day has begun. I plan to drink copious amounts of tea, and watch as many Harry… https://t.co/XYdl3tw9fT You can follow my playlist if you'd like to hear more http://t.co/ubY2A1OFoQ xx http://t.co/zqnzS66bjI Wanted to share some of the music I love, along with a few artists who are such huge inspirations to me http://t.co/ubY2A1OFoQ xx Just landed back home!!!! And THIS comes on the radio ❤️❤️ happy to be home London ❤️❤️ https://t.co/ERYIRNHtz3 3 Years ago xxxx https://t.co/QaSXI4jC9U It has OFFICIALLY been 3 years since this song was released. I'm tripping out thinking of where I was… https://t.co/FDN9rMtWQc LOSING MY SHIT!! #ANTI #ANTI #ANTI #ANTI my giiiiiiiiiiirl @rihanna https://t.co/rHvke6HFlh You go back to her and I go back to black 😘😁😘😁 https://t.co/UPDQFVURln Vibes x this makes me happy https://t.co/NLaUkQlkmw Thank you to everyone watching 'Writing's On The Wall'. You can download the single here http://t.co/LYGQePI8Cm xx\nhttps://t.co/JsA5CbQSwH Going to drink coffee and listen to Joni Mitchell 'Blue' on the way home today xx thinking of you all… https://t.co/DZ96CBc6xN So excited to have this beauty jsullivanmusic supporting me for my last American show alongside… https://t.co/uX8vO4fKxe I'm an old romantic This record changed my life and means so much to me. I hope you enjoy the new tracks http://t.co/Jb5ZaZbC55 xx http://t.co/ABqO6u8a5s IN THE LONELY HOUR: DROWNING SHADOWS EDITION\nSo happy to be releasing a special edition of my debut album http://t.co/Jb5ZaZbC55 Bus BANTA https://t.co/rn7MLRiH1U One of my many little sailors. I'm writing your names down so I have you all on my phone etc. Tonight… https://t.co/5CyfQ8JRmy The official video for 'Writing's On The Wall' is here!! Thanks to everyone supporting, this experience is unreal xx\nhttp://t.co/tocob4TViV Very proud of this one x massive shout out to @lukemonaghan ❤️ for directing this beaut https://t.co/Tv817rVgBE IT'S HERE!! http://t.co/BxPohU1f8M https://t.co/WKyhMOjNRo WRITING'S ON THE WALL http://t.co/BxPohU1f8M Better late than never Officially 40 MINUTES till video. What a nightmare. 40 minutes thou.... And it is yours!! OK.... SO.... A lot of angry emails going round. It will be with you VERY SOON. Trust me it's worth it x I'm so sorry about this guys. It's coming it's coming Bare with me guys... Lol 7 MINUTES!! #WritingsOnTheWallVideo Not long now till #WritingsOnTheWallVideo !!!! #30MINS I fucking love my fans We are the new Americana - high on legal marijuana https://t.co/d0oia1ubI4 SS necklaces xx https://t.co/7MqXadMFNu 🙌🏽 LADS In Nebraska 🙌🏽 @itsreubenjames @mrjamielblake jackmethod @dev_trout https://t.co/bOICmjPJpR I'm fully in @halsey ❤️ https://t.co/ijdCNGPFOo Too much fun @mrjamielblake https://t.co/XESkSZn724 🌽🌽🌽 @itsreubenjames https://t.co/gPy3azrYZV 🌽🌽 https://t.co/gQMmKbPM5z 🌽 https://t.co/wLuxFGCZBz The official video for 'Writing's On The Wall' premieres tonight...0.07AM !! http://t.co/8UmVHy9qNd Hurt Me by @MusicLapsley has got me in a massive Emo zone at the moment. Fucking love it. What a talent x Fresh wet shave. Got me feeling like a 14 year old again haha https://t.co/iVz1xDlnyu Plus it was filmed in one of my favourite places in the world. Rockport x Thanks for your suggestions everyone haha don't ask me why... But I'm gonna watch the proposal!! That one gets me in my heart haha"}