{"tweets": "En estos últimos días de octubre, os invito a rezar el #SantoRosario por la misión de la Iglesia hoy, en especial por los misioneros y misioneras que encuentran mayores dificultades. #octubremisionero En el #EvangeliodeHoy, mirando al publicano descubrimos de nuevo de dónde tenemos que recomenzar: del sentirnos necesitados de salvación, todos. #SinodoAmazonico https://t.co/eek3dQKvyC En este #SinodoAmazonico hemos sentido la necesidad de ponernos ante el Señor, de colocarlo de nuevo a Él en el centro, a nivel personal y como Iglesia. Porque solo se puede anunciar lo que se vive. Nos hacemos misioneros testimoniando con nuestra vida que conocemos a Jesús. Es la vida la que habla. #MesMisioneroExtraordinario #OctubreMisionero Pidamos al Señor que nos dé luz para que podamos conocer bien lo que sucede en nuestro interior. #SantaMarta La vida nueva que hemos recibido con el bautismo es una riqueza que hay que dar, comunicar y anunciar: este es el sentido de la misión. #MesMisioneroExtraordinario #OctubreMisionero Al celebrar el #MesMisioneroExtraordinario, le pedimos al Espíritu Santo que nos ayude a abrir las puertas del Evangelio a todos los pueblos y a ser testigos auténticos del amor divino. #AudienciaGeneral Demos gracias a Dios por todo el bien realizado en el mundo y en los corazones mediante las palabras, las obras y la santidad de #JuanPabloII. Recordemos siempre su llamamiento: “¡Abrid las puertas a Cristo!” #SantodeHoy En este mes misionero, el Señor te llama también a ti: te pide que seas un don para los demás ahí donde estás, tal como eres, con quien está a tu lado. ¡Ánimo, el Señor espera mucho de ti! #MesMisioneroExtraordinario #OctubreMisionero Ve con amor hacia todos, porque tu vida es una misión preciosa: no es un peso que soportar, sino un don para ofrecer. #MesMisioneroExtraordinario #OctubreMisionero https://t.co/AumZ031cXd Esta es la misión: mostrar con la vida e incluso con palabras que Dios ama a todos y no se cansa nunca de ninguno. #MesMisioneroExtraordinario #OctubreMisionero En el corazón de este mes misionero, preguntémonos: ¿Qué es lo que cuenta para mí en la vida? ¿Cuáles son las cumbres que deseo alcanzar? #MesMisioneroExtraordinario #OctubreMisionero https://t.co/zgihGZ6xJj Deseo animaros a llevar la luz del Evangelio a nuestros contemporáneos. Sed testigos de libertad y de misericordia, haciendo prevalecer la fraternidad y el diálogo ante las divisiones. #MesMisioneroExtraordinario #OctubreMisionero Queridos niños, cuando recen el #SantoRosario por la unidad y la paz, piensen que en una de las cuentas yo también estoy con ustedes. @acn_int San Lucas, que nos muestras el corazón de Jesús y su misericordia, ayúdanos a redescubrir la alegría de ser cristianos, testigos de la bondad del Señor. #SantodeHoy “Tuve hambre, y ustedes me dieron de comer; tuve sed, y me dieron de beber” (Mt 25,35). Pidamos hoy la gracia de la compasión, la capacidad de hacernos cargo de la pobreza de nuestros hermanos y hermanas. #EndPoverty Trabajemos juntos para que todas las personas tengan acceso a una alimentación adecuada, según la voluntad de Dios. #HambreCero https://t.co/bLXnwZyG1m Pidamos hoy la gracia de dejarnos sorprender por Dios y de no ser obstáculos a su creatividad, favoreciendo el encuentro de los corazones con el Señor. #AudienciaGeneral El Señor nos regala a todos una vocación para que descubramos los talentos y capacidades que poseemos y las pongamos al servicio de los demás. El #EvangelioDeHoy nos muestra que la meta es el encuentro con Jesús. Sólo Él libra del mal y sana el corazón, sólo el encuentro con Él salva, hace la vida plena y hermosa. Hoy damos gracias al Señor por los nuevos #santos, que han caminado en la fe y ahora invocamos como intercesores. Oremos por nuestras comunidades, para que, dando testimonio de la alegría de la vida cristiana, vean florecer la vocación a la santidad. El Señor siempre nos recuerda lo valiosos que somos ante sus ojos, y nos confía una misión. Que el Espíritu Santo, artífice de fraternidad, nos dé la gracia de caminar juntos y el valor para experimentar nuevas formas de compartir y de misión. Jonás es obstinado con sus creencias de fe y el Señor es obstinado en su misericordia. Porque el Señor siempre quiere sanar, quiere salvar, no condenar. #SantaMarta Les pido que acompañen con la oración este evento eclesial para que se viva en comunión fraterna y con docilidad al Espíritu Santo, que siempre nos muestra los caminos para dar testimonio del Evangelio. #SinodoAmazonico https://t.co/txLpj69PUV Muchos hermanos y hermanas en Amazonia llevan cruces pesadas y esperan la consolación liberadora del Evangelio y la caricia de amor de la Iglesia. Por ellos, con ellos, caminemos juntos. #SinodoAmazonico https://t.co/Gmxtu1YCsq La voluntad de un Cardenal de dar su propia sangre -significada por el color rojo de la vestimenta- es cierta cuando está enraizada en la compasión, recibida de Dios y entregada a sus hermanos y hermanas. Hoy que termina el #TiempoDeLaCreacion confiemos el #SinodoDeLaAmazonia a San Francisco de Asís. #SeasonOfCreation #AmazonSynod A través de nuestros pequeños pasos de amor Dios hace grandes cosas, Dios logra la salvación del mundo. Confiemos a Santa Teresita del Niño Jesús, amiga fiel, el #MesMisioneroExtraordinario que comienza hoy. #MissionnaryOctober \nhttps://t.co/zgihGZo97T #MesMisioneroExtraordinario #MissionaryOctober https://t.co/flxTUDKY4L Que el domingo dedicado a la Palabra haga crecer en el pueblo de Dios la familiaridad religiosa y asidua con la Sagrada Escritura. #AperuitIllis https://t.co/JY03XWYwZz La dulzura de la Palabra de Dios nos impulsa a compartirla con quienes encontramos en nuestra vida para manifestar la certeza de la esperanza que contiene. #AperuitIllis https://t.co/JY03XWYwZz No se trata sólo de los migrantes, sino de todos nosotros, de la familia humana, llamados a realizar juntos el plan de Dios para el mundo. #NoSóloSobreLosInmigrantes @M_RSeccion\nhttps://t.co/i9GZ6y31Qh Necesitamos de los demás para vivir y compartir el amor y la confianza que el Señor nos da. El verdadero rostro del amor es la misericordia. Al practicarlo, uno se convierte en discípulo de Jesús y se manifiesta el corazón del Padre. Pidamos al Señor que, mirando a los mártires de ayer y de hoy, aprendamos a vivir nuestra fidelidad diaria al Evangelio. #AudienciaGeneral Aprendamos a llamar a las personas por su nombre, como el Señor hace con nosotros, y a renunciar a los adjetivos. Estamos llamados a ser testigos y mensajeros de la misericordia de Dios, a ofrecer al mundo luz donde hay tinieblas, esperanza donde reina la desesperación, salvación donde abunda el pecado. En el #EvangelioDeHoy, Jesús nos asegura que siempre estamos a tiempo para sanar con el bien, lo mal hecho. Que los que han causado lágrimas hagan feliz a alguien; que los que han quitado indebidamente, den a los necesitados. #Angelus La paz es una conversión del corazón y del alma. Es un desafío que pide ser aceptado día tras día. #PeaceDay El apóstol Pablo exhorta a los ministros a la cercanía: la cercanía a Dios, la oración, la cercanía del obispo a sus sacerdotes, la cercanía de los sacerdotes entre ellos, la cercanía al pueblo de Dios. #SantaMarta Si nosotros obispos y sacerdotes, nos apropiamos del don de Dios y lo transformamos en una función, perdemos la mirada de Jesús. Pidamos al Señor que nos ayude a custodiar nuestro ministerio como un don. #SantaMarta Todo proyecto humano puede primero obtener consensos y luego naufragar, mientras que todo lo que viene de lo alto y lleva la \"firma\" de Dios está destinado a perdurar. #AudienciaGeneral “El Señor sintió una gran compasión” (Lc 7,13,). Nuestro Dios es un Dios de compasión, y la compasión es la debilidad de Dios, pero también su fuerza. #SantaMarta San Pablo pide orar “por todos los que están en el poder” (1 Tim 2,2). Debemos aprender a hacerlo, incluso por los políticos que no apoyan nuestras ideas. El cristiano debe orar por todos los gobernantes, para que trabajen por el bien común. #SantaMarta Dios nos espera: no se cansa, no se desanima. Porque somos nosotros, cada uno de nosotros el hijo vuelto a abrazar, esa moneda encontrada, esa oveja acariciada y puesta sobre sus hombros (cf. Lc 15, 1-32). #Angelus Hoy la Iglesia nos hace contemplar la Cruz gloriosa del Señor. Aunque Cristo es Dios, se humilla convirtiéndose en siervo. ¡Esta es la gloria de la cruz de Jesús! El discípulo de Jesús, si quiere crecer en su amistad, no debe lamentarse y mirarse a sí mismo. Debe actuar y esforzarse, seguro de que el Señor lo apoya y lo acompaña. Deseo promover un evento mundial para el día 14 de mayo de 2020, que tendrá como tema: “Reconstruir el pacto educativo global”. https://t.co/6QiK3LNhVp Hoy celebramos la Memoria del Santísimo Nombre de María. Invito a todos a mirar a la Virgen y a dejar que nos inspire sentimientos cristianos, para vivir cada vez más como su Hijo Jesús. La esperanza del mundo es Cristo: su Evangelio es el fermento más potente de fraternidad,  libertad, justicia y paz para todos los pueblos. #AudienciaGeneral Gracias por vuestra cálida acogida. ¡Que Dios os bendiga a todos, que su amor y su misericordia continúen acompañándoos y protegiéndoos! #ViajeApostólico ¿Cómo llegar a ser un buen cristiano? La respuesta es sencilla: es necesario hacer, cada uno a su modo, lo que pide Jesús en las Bienaventuranzas. #ViajeApostólico #Mauricio Dichosos vosotros, dichosa la Iglesia de los pobres y para los pobres, porque vive impregnada del perfume de su Señor, vive alegre anunciando la Buena Noticia a los descartados de la tierra, a aquellos que son los favoritos de Dios. #ViajeApostólico #Madagascar Akamasoa, “Ciudad de la amistad”, es la expresión de la presencia de Dios que decidió vivir y permanecer siempre en medio de su pueblo. Al ver estos rostros radiantes, doy gracias al Señor que ha escuchado el clamor de los pobres. #ViajeApostólico #Madagascar Nos dirigimos en oración a la Santísima Virgen recordando hoy su nacimiento, aurora de salvación para la humanidad. #Ángelus Nuestra vida y nuestras capacidades son fruto de un regalo tejido entre Dios y tantas manos silenciosas de personas cuyos nombres conoceremos solo en el Cielo. #ViajeApostólico #Madagascar El Señor es el primero en confiar en vosotros y os invita a que también confiéis en vosotros mismos; os invita a animaros, unidos a Él, para escribir la página más hermosa de vuestras vidas. #ViajeApostólico #Madagascar Un sembrador de paz y de esperanza sabe esperar, confía, asume las contrariedades de su siembra y jamás deja de amar el campo encomendado a su cuidado. #ViajeApostólico #Madagascar Jesús propone una primera regla de oro al alcance de todos: «Portaos con los demás como queréis que los demás se porten con vosotros» (Lc 6,31); y nos ayuda a descubrir qué es lo más importante: amarnos y ayudarnos sin esperar nada a cambio. #ViajeApostólico #Mozambique No olvidemos que los nombres de los hermanos y hermanas más pobres, escritos en el Cielo, tienen al lado una inscripción: estos son los benditos de mi Padre. #ViajeApostólico #Mozambique Nadie es más pequeño que un sacerdote dejado a sus propias fuerzas; por eso nuestra oración es la oración de nuestra Madre: soy sacerdote porque Él miró con bondad mi pequeñez (Lc 1,48). #ViajeApostólico #Mozambique Intenta quedarte un momento en silencio dejándote amar por Dios. Trata de acallar todas las voces y gritos interiores, y quédate un instante en su abrazo de amor. #ViajeApostólico #Mozambique La búsqueda de la paz duradera -una misión que atañe a todos- requiere un trabajo duro, constante y sin pausas, porque la paz es como una flor frágil que trata de despuntar entre las piedras de la violencia. #ViajeApostólico #Mozambique Los invito, cada uno en su corazón, a orar por los hermanos y hermanas que han perdido la vida o están sufriendo a causa de los huracanes en las Bahamas Invito a todos a que se unan a mi oración para que Dios, Padre de todos, consolide en toda África la reconciliación fraterna, única esperanza para una paz sólida y duradera. #Viajeapostólico #Mozambique #Madagascar #Mauricio El Espíritu Santo, cuando lo invitamos a nuestras heridas, unge los malos recuerdos con el bálsamo de la esperanza, porque Él reconstruye la esperanza. Dios, que ama la vida, nos dé la valentía para trabajar por el bien sin esperar a que sean otros los que comiencen, y sin esperar a que sea demasiado tarde. https://t.co/2S6g8MisUS La creación, lugar de encuentro con el Señor y con los demás, es la “red social” de Dios que nos lleva a entonar un canto de alabanza cósmica al Creador.\nhttps://t.co/2S6g8MA3Mq Somos las criaturas predilectas de Dios, quien en su bondad nos llama a amar la vida y vivirla en comunión, conectados con la creación.\nhttps://t.co/2S6g8MA3Mq Este es el tiempo para reflexionar sobre nuestro estilo de vida y para emprender acciones proféticas.\nhttps://t.co/2S6g8MA3Mq Este es el tiempo para habituarnos de nuevo a rezar inmersos en la naturaleza, donde la gratitud hacia Dios creador surge de manera espontánea.\nhttps://t.co/2S6g8MisUS Es hora de redescubrir nuestra vocación de hijos de Dios, hermanos entre nosotros, custodios de la creación. En este #TiempodelaCreación, invito a todos a dedicarse a la oración. https://t.co/2S6g8MA3Mq En el Evangelio de hoy, Jesús nos invita a la generosidad desinteresada, que nos abre el camino hacia una gran alegría: la de ser partícipes del amor mismo de Dios. #Ángelus https://t.co/Nac6FKPTBA En la relación diaria con Jesús y en la fuerza de su perdón encontramos nuestras raíces. ¡San Juan Bautista, que dio testimonio del Mesías muriendo por la verdad, ruega por nosotros! Pidamos la gracia de no ser cristianos tibios, que viven a medias, que dejan enfriar el amor. La luz de Dios ilumina a quien la acoge. Quien se acerca a Dios no se desalienta, sigue adelante: comienza de nuevo, lo intenta de nuevo, reconstruye. En el Evangelio de hoy, Jesús nos hace entender que en el Paraíso no hay un \"número cerrado\", pero para ir allí uno ya debe cruzar una \"puerta angosta\" en esta vida: ¡amar a Dios y al prójimo, y esto no es cómodo! #Angelus Dios se acuerda de nosotros, sana nuestros recuerdos heridos ungiéndolos con esperanza, está cerca de nosotros para levantarnos desde dentro. Que Él nos ayude a ser constructores de bien, consoladores de corazones. Todos hemos sido creados a imagen y semejanza de Dios y tenemos la misma dignidad. Detengamos la esclavitud! #IDRSTA Que el Señor abra nuestros corazones a las necesidades de los pobres, los indefensos, de los que llaman a nuestra puerta en busca del reconocimiento de su dignidad como personas. Se necesita más fuerza para reparar que para construir, para recomenzar que para iniciar, para reconciliarse que para llevarse bien. Esta es la fuerza que Dios nos da. En la incertidumbre que sentimos fuera y dentro, el Señor nos da una certeza: Él se acuerda de nosotros. Hoy recordamos a todas las mujeres valientes que van al encuentro de sus hermanos y hermanas en dificultad. Cada una de ellas es un signo de la cercanía y compasión de Dios. #MujeresHumanitarias En el Evangelio de hoy, Jesús nos revela su deseo más ardiente: traer a la tierra el fuego del amor del Padre, el fuego que salva, que cambia el mundo a partir del cambio del corazón de cada uno. #Angelus Con Dios, la carga de la vida no permanece sobre nuestros hombros: el Espíritu Santo viene a darnos fuerza, a alentarnos, a sostener el peso. Pidamos a la Virgen que nos proteja y sostenga, que tengamos una fe fuerte, gozosa y misericordiosa, que nos ayude a ser santos, a encontrarnos con Ella un día en el Paraíso. El camino de María al cielo comenzó con el \"sí\" pronunciado en Nazaret. Cada \"sí\" a Dios es un paso hacia el cielo, hacia la vida eterna. Porque el Señor nos quiere a todos consigo mismo, en su casa! Pidamos la gracia de recordar cada día que Dios no nos olvida, que somos sus hijos amados, únicos e irremplazables: recordarlo nos da la fuerza para no rendirnos ante los reveses de la vida. Sólo cuando experimentamos el perdón de Dios renacemos de verdad. El perdón nos permite comenzar de nuevo; allí nos encontramos a nosotros mismos: en la confesión de nuestros pecados. La educación con horizontes abiertos a la trascendencia ayuda a los jóvenes a soñar y a construir un mundo más bello. #IYD2019 El Evangelio de hoy nos invita a abandonarnos con sencillez y confianza a la voluntad de Dios y a mantener \"encendidas las lámparas\" para poder iluminar las tinieblas de la noche. #Angelus El testigo cristiano, en el fondo, anuncia solo esto: que Jesús vive y es el secreto de la vida. #SanLorenzoMártir Los pueblos indígenas, con su variedad de lenguas, culturas, tradiciones y conocimientos ancestrales, nos recuerdan que todos somos responsables del cuidado de la creación que Dios nos ha confiado. #DíaDeLosPueblosIndígenas En medio de tantas cosas que pasan y por las que nos afanamos, ayúdanos, Padre, a buscar lo que permanece: tu presencia y la del hermano. La vía de Jesús, que conduce a la paz, pasa a través del perdón; porque ningún mal resuelve otro mal, ningún resentimiento es bueno para el corazón. En la Transfiguración Jesús nos muestra la gloria de la Resurrección: un vistazo al cielo en la tierra. El Señor nos invita a todos a vencer el rencor con la caridad y el perdón, viviendo la fe cristiana con coherencia y valentía. Gracias por la alegría con la que habeis podido dar vuestra vida, gracias por todas las veces que habeis acogido a los caídos, curando sus heridas, mostrando ternura y compasión. #AMisHermanosPresbíteros En la fiesta del Santo Cura de Ars les escribo a todos ustedes que, asumiendo la misión como un servicio a Dios y a su pueblo, escriben las páginas más bellas de la vida sacerdotal. #AMisHermanosPresbíteros\nhttps://t.co/jhkKZ6qzrJ ¡Espíritu Santo, danos la alegría de la resurrección, la juventud perenne del corazón! El Señor no hace milagros con quien se cree justo, sino con quien se reconoce necesitado y está dispuesto a abrirle el corazón. https://t.co/rVo9r0dQeJ San Ignacio de Loyola, que hoy recordamos, cuando era un joven soldado pensaba en su propia gloria; pero luego fue atraído por la gloria de Dios, que dio sentido a su vida. Oremos para que el Señor libere a las víctimas de la trata, y para que nos ayude a responder activamente al  grito de socorro de tantos hermanos y hermanas privados de su dignidad y libertad. #EndHumanTrafficking El Señor nos regala a todos una vocación para que descubramos los talentos y capacidades que poseemos y las pongamos al servicio de los demás. En el Evangelio de hoy, Jesús nos invita a hacer experiencia de oración, poniéndonos directamente en comunicación con el Padre. ¡Aquí está la novedad de la oración cristiana!: es diálogo entre personas que se aman, un diálogo basado en la confianza. Jesús busca testigos que le digan cada día: “Señor, Tú eres mi vida”. El testimonio nace del encuentro con Jesús vivo. #SantaMaríaMagdalena, apóstola de la esperanza, ruega por nosotros. El Evangelio de hoy nos recuerda que la sabiduría del corazón reside en el saber combinar la contemplación y la acción. Pidamos la gracia de amar y servir a Dios y a los hermanos con las manos de Marta y el corazón de María. Hoy, fiesta de la #VirgendelCarmen, contemplamos a Nuestra Señora junto a la Cruz de Cristo. Ese es también el lugar de la Iglesia: al lado de Cristo. Deseo expresar una vez más mi cercanía al amado pueblo venezolano, que sufre a causa de la prolongada crisis. Pidamos al Señor que inspire a las partes en causa para que lleguen cuanto antes a un acuerdo que ponga fin a los sufrimientos de la gente. En el Evangelio de hoy, Jesús presenta como modelo al samaritano, que amando al hermano como a sí mismo demuestra que ama a Dios con todo el corazón, y expresa al mismo tiempo verdadera religiosidad y plena humanidad. Hoy se celebra el #DomingodelMar, dedicado a los marineros y a los pescadores. Rezo por ellos y por sus familias, y animo a que se hagan todos los esfuerzos necesarios para proteger sus derechos humanos. La fe es un regalo que mantiene viva una certeza profunda y hermosa: somos hijos amados de Dios. Que Dios Padre acoja en sus brazos a Vincent Lambert. No construyamos una civilización que elimina a las personas cuya vida consideramos que ya no es digna de ser vivida: toda vida humana tiene valor, siempre. Oremos por los enfermos que son abandonados hasta dejarlos morir. Una sociedad es humana si protege la vida, toda vida, desde el inicio hasta su fin natural, sin decidir quién es digno o no de vivir.  ¡Que los médicos ayuden la vida, no la quiten! “No se trata sólo de migrantes”, en el doble sentido de que los migrantes son antes que nada seres humanos, y que hoy son el símbolo de todos los descartados de la sociedad globalizada. https://t.co/YAKIspUQYm En este sexto aniversario de mi visita a Lampedusa, pienso en los “últimos” que todos los días claman al Señor, pidiendo ser liberados de los males que los afligen. https://t.co/YAKIsqcrPU Jesús nos dice hoy en el Evangelio cuál es la verdadera alegría de sus discípulos: “Alegraos porque vuestros nombres están escritos en los cielos” (Lc 10,12), es decir, en el corazón de Dios Padre. Necesitamos personas e instituciones que defiendan la dignidad de los trabajadores, la dignidad del trabajo y el bien de la tierra, nuestra casa común. #CoopsDay En los periodos difíciles, más aún que en los de paz, la prioridad para los creyentes es estar unidos a Jesús, nuestra esperanza. https://t.co/yT4vbZrfyk Atendiendo a los pequeños y a los pobres podéis encender estrellas en la noche de quien sufre. La Biblia no es un libro bonito para guardar en una estantería; es Palabra de vida que hay que sembrar, don que Jesús resucitado nos pide que acojamos para tener vida en su Nombre. A todos nos toca pasar días difíciles; pero siempre debemos recordar que la vida es una gracia, es el milagro que Dios ha sacado de la nada. Los #SantosPedroyPablo fueron transparentes ante Dios. Durante su vida mantuvieron esta humildad hasta el final: comprendieron que la santidad no consiste en enaltecerse, sino en abajarse. Oren por todos los sacerdotes y por mi ministerio petrino, para que todas las acciones pastorales se basen en el amor de Cristo por cada persona. #SantificaciónSacerdotal Hoy celebramos el 175º aniversario de la Red Mundial de Oración del Papa. Les invito a orar conmigo para estar unidos al Corazón de Jesús y a entrar juntos en una misión de compasión por el mundo. Jesús nos mira, nos ama y nos espera. Es todo corazón y todo misericordia. Vayamos a Jesús con confianza, Él nos perdona siempre. #SagradoCorazóndeJesús Bienaventurado el que cree y tiene el valor de crear encuentro y comunión. Cuántas veces, mientras oramos, nos limitamos a pedir gracias y a enumerar peticiones, olvidándonos de que lo primero es alabar el nombre de Dios, adorarlo, para luego reconocer en la persona del hermano su vivo reflejo. Decir “sí” al Señor significa tener el valor de abrazar con amor la vida como viene, con toda su fragilidad y pequeñez, con sus contradicciones. El ejemplo de San Juan Bautista nos invita a ser una Iglesia que está siempre al servicio de la Palabra de Dios; una Iglesia que no quiere atraer hacia sí misma, sino hacia Jesucristo. Bendecir no es decir palabras bonitas, no es usar palabras de circunstancia; es decir bien, decir con amor. La Eucaristía es una escuela de bendición. #CorpusDomini La Eucaristía nos prepara un puesto en la eternidad, porque es el Pan del cielo. #CorpusDomini Las Bienaventuranzas no son para superhombres sino para quien afronta los desafíos y las pruebas de cada día. Sin comunión y sin compasión, alimentadas constantemente por la oración, la teología no solo pierde el alma, sino también la inteligencia y la capacidad de interpretar cristianamente la realidad. #VisitaNápoles #VeritatisGaudium Queridos jóvenes, quiero decirle a cada uno: Dios te ama. Nunca lo dudes, más allá de lo que te suceda en la vida. En cualquier circunstancia, eres infinitamente amado. Con los refugiados, la Providencia nos ofrece una ocasión para contribuir a la construcción de una sociedad más justa, más solidaria, más fraterna, y una comunidad cristiana más abierta, de acuerdo con el Evangelio. #WithRefugees Jesús se ha hecho pan partido para nosotros, y nos pide que nos demos a los demás, que no vivamos más para nosotros mismos, sino los unos para los otros. #CorpusDomini Que el Espíritu Santo nos ayude a vivir cada vez más como hijos de Dios y hermanos entre nosotros. La fe es una relación, un encuentro; y mediante el impulso del amor de Dios podemos comunicar, acoger, comprender y corresponder al don del otro. ¡Espíritu Santo, armonía de Dios, tú que transformas el miedo en confianza y la clausura en don, ven a nosotros! Para Dios, cada uno de nosotros tiene un valor infinito: somos pequeños bajo el cielo e impotentes cuando la tierra tiembla, pero para Dios somos más valiosos que cualquier otra cosa. El misterio de la Santísima Trinidad nos dice que no tenemos un Dios solitario allá en el Cielo, distante; no, es el Padre que nos ha dado a su Hijo, hecho hombre como nosotros, y que para hacerse aún más cercano nos envía su Espíritu. El Espíritu Santo nos convoca a todos y nos ayuda a descubrir la belleza de estar juntos y de caminar juntos, cada uno con su propia lengua y tradición, pero feliz de encontrarse entre hermanos. Estoy cercano a tantos ancianos que viven escondidos, olvidados y descuidados. Y agradezco a aquellos que están comprometidos con una sociedad más inclusiva, que no necesita descartar a aquellos que son débiles en cuerpo y mente. #WEAAD ¡Espíritu Santo, armonía nuestra, tú que nos haces un solo cuerpo, infunde tu paz en la Iglesia y en el mundo! Los #pobres nos salvan porque nos permiten encontrar el rostro de Jesucristo. https://t.co/zvROwVeA3E ¡Espíritu Santo, haznos artesanos de concordia, sembradores de bien, apóstoles de esperanza! Los adultos no podemos robar a los niños la capacidad de soñar. Tratemos de favorecer un contexto de esperanza en el que sus sueños crezcan y se compartan: un sueño compartido abre el camino a un nuevo modo de vida. #NOChildLabourDay Dad gratuitamente lo que habéis recibido gratuitamente, para que las gracias de Dios puedan alcanzar el corazón de todos. #SantaMarta Santa #MaríaMadredelaIglesia, ayúdanos a fiarnos plenamente de Jesús, a creer en su amor, sobre todo en los momentos de tribulación y de cruz, cuando nuestra fe está llamada a crecer y madurar. A los misioneros, a las misioneras y a todos los que en virtud del propio bautismo participan de algún modo en la misión de la Iglesia, les envío de corazón mi bendición. #OctubreMisionero #Pentecostés\nhttps://t.co/qhTsfSa5o5 Espíritu Santo, sopla en nuestros corazones y haz que respiremos la ternura del Padre. Sopla sobre la Iglesia para que predique con alegría el Evangelio. Sopla sobre el mundo la brisa que restaura la esperanza. #Pentecostés Señor, desarma la lengua y las manos, renueva los corazones y las mentes, para que la palabra que nos lleva al encuentro sea siempre «hermano», y la paz se convierta en el estilo de nuestra vida. #UnMinutoporlaPaz ¿Cómo sé que el Señor me escucha? Tenemos una certeza: Jesús. Él es el gran intercesor. Ascendió al Cielo, está ante el Padre e intercede por nosotros. Él hace la oración de intercesión continuamente. https://t.co/abmB4vyv3B La eutanasia y el suicidio asistido son una derrota para todos. La respuesta que hemos de dar es no abandonar nunca a quien sufre, no rendirnos, sino cuidar y amar a las personas para devolverles la esperanza. La fe, al igual que la vida, sin asombro se vuelve gris, rutinaria. La Ascensión del Señor al cielo inaugura una nueva forma de presencia de Jesús en medio de nosotros, y nos invita a que tengamos ojos y corazón para encontrarlo, servirlo y testimoniarlo a los demás. Elijamos la vía de Jesús. Es una vía que comporta fatiga, pero es la vía que conduce a la paz. #ViajeApostólico #Romanía Que seáis testigos de libertad y de misericordia, haciendo prevalecer la fraternidad y el diálogo ante las divisiones. #ViajeApostólico #Romanía Los cristianos estamos llamados a manifestar, también en la red, la comunión que define nuestra identidad de creyentes, abriendo el camino al diálogo, al encuentro, a la sonrisa. #JornadaMundialdelasComunicacionesSociales La solemnidad de la Ascensión nos exhorta a elevar la mirada al cielo para cumplir, con la gracia del Señor resucitado, la misión que Él nos confía: anunciar a todos el Evangelio. Dios ama con amor de Padre. Cada vida, cada uno de nosotros le pertenece. #ViajeApostólico #Romanía Caminemos juntos dejando que sea el Evangelio la levadura que lo impregne todo y regale a nuestros pueblos la alegría de la salvación! #ViajeApostólico #Romanía Queridos padres, ¡ayuden a sus hijos a descubrir el amor de Jesús! Esto los hará fuertes y valientes. #GlobalParentsDay Contemplar a María nos permite dirigir la mirada a tantas mujeres, madres y abuelas que, con sacrificio y discreción, abnegación y compromiso, labran el presente y tejen los sueños del mañana. #ViajeApostólico #Romanía El Espíritu Santo ama plasmar la unidad en la más bella y armoniosa diversidad. #ViajeApostólico #Romanía Mañana iré a Rumania como peregrino, para caminar junto con los hermanos de la Iglesia Ortodoxa Rumana y los fieles católicos. Les pido, por favor, que oren por mí. Con su ascensión, el Señor resucitado atrae nuestra mirada al Cielo para mostrarnos que la meta de nuestro camino es el Padre. Si os fiais de la bondad del Señor comprenderéis el sentido de los acontecimientos y la finalidad de vuestra vida. En la vida hay cruces, hay momentos difíciles. Pero en esos momentos se nota que el Espíritu Santo nos ayuda a seguir adelante y a superar las dificultades. #SantaMarta También actualmente hay muchos cristianos asesinados y perseguidos por el amor a Cristo. Dan su vida en silencio, porque su martirio no es noticia: pero hoy, hay más mártires cristianos que en los primeros siglos. El Espíritu Santo nos hace superar nuestros límites, resurgir de nuestras muertes, porque tenemos tantas necrosis en nuestra vida, en el alma. El mensaje de la resurrección es este: es preciso renacer. La misericordia hacia quien solo puede recibir sin dar nada a cambio es preciosa a los ojos de Dios. María es una mujer que camina con delicadeza y ternura de madre. Desata todos los nudos de los muchos problemas que generamos, y nos enseña a permanecer de pie en medio de las tempestades. #MaríaAuxiliadora Oremos por los católicos de China. Que la Virgen de Sheshan les ayude a testimoniar la fe, en comunión con la Iglesia universal, y a perseverar en la unidad a pesar de las heridas y las pruebas, confiando en la esperanza que no defrauda. Dios no habita en la grandeza de lo que hacemos, sino en la pequeñez de los pobres que encontramos. #Caritas Cada criatura tiene una función y ninguna es superflua. Todo el universo es un lenguaje del amor de Dios, de su desmesurado cariño hacia nosotros. El suelo, el agua, las montañas, todo es caricia de Dios. #Biodiversity #LaudatoSi’ La paz de Jesús es un don. No podemos obtenerla con medios humanos. La paz de Jesús es otra cosa: nos enseña a soportar, a llevar sobre los hombros la vida, las dificultades, el trabajo, todo; y a tener el valor de seguir adelante. #SantaMarta Roguemos por cuantos viven en estado de grave enfermedad. Custodiemos siempre la vida, don de Dios, desde el inicio hasta su fin natural. No cedamos a la cultura del descarte. Permanezcamos unidos al Señor Jesús mediante la escucha de la Palabra, los sacramentos, la vida fraterna y el servicio a los demás. El Espíritu Santo es el protagonista de la vida cristiana: está con nosotros, nos acompaña, nos transforma, vence con nosotros. ¡Dejaos transformar y renovar por el Espíritu Santo, para llevar a Cristo a todos los ambientes y testimoniar la alegría y la juventud del Evangelio! “La Palabra de Dios es viva” (Hb 4, 12), no muere ni envejece, sino que permanece para siempre. Promover el desarrollo de la #familia significa sostener el cuidado de todas las personas y de toda la creación. #ClimateAction Dios se propone, no se impone; ilumina, pero no deslumbra. María, Virgen de #Fátima, estamos seguros de que cada uno de nosotros es precioso a tus ojos y que nada de lo que habita en nuestros corazones es ajeno a ti. Custodia nuestra vida entre tus brazos, guíanos a todos nosotros por el camino de la santidad. En esta Jornada, nos unimos en oración pidiéndole al Señor que nos descubra su proyecto de amor para nuestra vida y que nos dé el valor para arriesgarnos en el camino que él ha pensado para nosotros desde la eternidad. #Vocaciones \nhttps://t.co/8M1bJCPrcY Dios ha puesto en la creación y en nuestro corazón este proyecto: que le amemos a Él, a nuestros hermanos y al mundo entero; encontremos la verdadera felicidad en este amor. Este es el tiempo de la misericordia, el tiempo de la piedad del Señor: abramos el corazón para que Él venga a nosotros. Pidamos hoy la gracia de la docilidad a la voz del Señor y del corazón abierto al Señor; la gracia de no tener miedo de hacer cosas grandes, y la delicadeza de cuidar las cosas pequeñas. #SantaMarta Si vivimos como hijos de Dios y nos dejamos guiar por el Espíritu Santo, hacemos el bien también a la creación. Virgen del #SantoRosario, ayúdanos a ser un solo corazón y un alma sola, pueblo santo en camino hacia la patria del Cielo. La fe nos tiene que mover a los creyentes a ver a los demás como hermanos que debemos sostener y amar. #ViajeApostólico #MacedoniadelNorte Madre Teresa, intercede ante Jesús para que también nosotros obtengamos la gracia de estar atentos al grito de los pobres, de los enfermos, de los marginados, de los últimos. #ViajeApostólico #MacedoniadelNorte \nhttps://t.co/6pVZMiL5Lo Cada uno allí donde se encuentra, realizando la tarea que le toca, puede decir: “Señor, hazme un instrumento de tu paz”. #ViajeApostólico #Bulgaria https://t.co/omvUNiAY8l Como dijo el Papa Juan XXIII: «No he conocido nunca a un pesimista que haya terminado algo bueno». El Señor es el primero en no ser pesimista y continuamente está buscando abrir caminos de Resurrección para todos nosotros. #ViajeApostólico #Bulgaria Todas las mañanas, Dios nos busca allí donde estamos y nos invita a alzarnos, a levantarnos de nuevo con su Palabra, a mirar hacia arriba y a creer que estamos hechos para el Cielo. #ViajeApostólico #Bulgaria https://t.co/1G9WbgAMKK Como dijo san Cirilo: «A pesar de estar cansado y físicamente débil, iré con alegría a aquel país. Yo marcho con alegría por la fe cristiana». #ViajeApostólico #Bulgaria https://t.co/CEx0qi6GlH Les pido que acompañen con la oración mi viaje a Bulgaria y Macedonia del Norte, adonde iré mañana como peregrino de paz y fraternidad. #ViajeApostólico En muchos países, mayo es el mes de María. La Madre de Dios nos acompaña, y protege a los cristianos en el combate contra las fuerzas del mal. Encomendémonos a ella y oremos por la Iglesia y por la paz en el mundo. Necesitamos un periodismo libre, al servicio de la verdad, del bien, de la justicia; un periodismo que ayude a construir la cultura del encuentro. #DefendMediaFreedom https://t.co/EkN8lZwzPX Que San José, el humilde trabajador de Nazaret, nos oriente hacia Cristo, sostega el sacrificio de quienes obran el bien e interceda por todos los que han perdido el trabajo o no consiguen encontrar uno. Pidamos al Señor que nos haga conscientes de que no podemos ser verdaderamente cristianos sin caminar con el Espíritu Santo, sin dejar que el Espíritu Santo sea el protagonista de nuestra vida. #SantaMarta Dios te busca, aunque tú no lo busques. Dios te ama, aunque tú te hayas olvidado de Él. Dios vislumbra belleza en ti, aunque pienses que has desperdiciado todos tus talentos. Si nuestros corazones se abren a la misericordia, si sellamos el perdón con un abrazo fraterno, proclamamos ante el mundo que es posible vencer el mal con el bien. #DivinaMisericordia El Señor busca a todos, quiere que todos sientan el calor de su misericordia y de su amor. En estos días de #Pascua, anunciad con la vida y con las palabras la hermosa noticia de que Jesús ha resucitado. Cristo resucitó, y con Él resucita nuestra esperanza creativa para afrontar los problemas actuales, porque sabemos que no estamos solos. #Pascua Los mártires de todos los tiempos, con su fidelidad a Cristo, muestran que la injusticia no tiene la última palabra en la vida: podemos seguir esperando en el Señor resucitado. #Pascua Que el anuncio de la Resurrección del Señor sostenga nuestra esperanza y la transforme en gestos concretos de caridad. #Pascua Acojamos en nuestra vida la victoria de Cristo sobre el pecado y la muerte. Así atraeremos su fuerza transformadora también sobre la creación. Unámonos también hoy en oración con la comunidad cristiana de Sri Lanka, golpeada por una violencia ciega en el día de Pascua. Confiamos al Señor resucitado las víctimas, los heridos y el sufrimiento de todos. #PrayForSriLanka La resurrección de Cristo es la verdadera esperanza del mundo. ¡Feliz Pascua a todos! #Pascua Hoy contemplamos la tumba de Cristo vacía y escuchamos las palabras del ángel: «¡No tengan miedo! ¡Ha resucitado!» #Pascua Mira los brazos abiertos de Cristo crucificado, déjate salvar por Él. Contempla su sangre derramada por amor y déjate purificar por ella. Así podrás renacer. #ViernesSanto En la Eucaristía encuentras realmente a Jesús, compartes su vida, sientes su amor; allí puedes experimentar que murió y resucitó por ti. #JuevesSanto Cristo murió por amor a cada uno de nosotros: jóvenes y ancianos, santos y pecadores, gente de su tiempo y de nuestro tiempo. #SemanaSanta Hoy nos unimos en oración al pueblo francés, mientras esperamos que el dolor por los graves daños se transforme en esperanza mediante la reconstrucción. Santa María, Nuestra Señora, ruega por nosotros. #NotreDame Cristo, por amor, se entregó hasta el final para salvarte. Sus brazos abiertos en la Cruz son el signo más precioso de un amigo capaz de llegar hasta el extremo. #SemanaSanta Hoy, Jornada Mundial de la Juventud, quiero recordar a tantos santos y santas jóvenes, especialmente a aquellos “de la puerta de al lado”, que solo Dios conoce y que a veces a Él le gusta revelarnos por sorpresa. #JMJdiocesana Con su humillación, Jesús quiso abrirnos el camino de la fe y precedernos por él. #DomingodeRamos #SemanaSanta https://t.co/WgeewS1OAI Si regresamos al Señor con nuestra fragilidad, si tomamos el camino del amor, abrazaremos la vida que no conoce ocaso. Y viviremos en la alegría. #Cuaresma Ayunar es también cambiar nuestra actitud hacia los demás y hacia las criaturas: de la tentación de “devorarlo” todo para saciar nuestra avidez, a la capacidad de sufrir por amor. #Cuaresma Desde la cruz, Jesús nos enseña la valentía de la renuncia. Porque si vamos cargados de pesos que estorban, nunca avanzaremos. #Cuaresma Dar limosna nos ayuda a salir de la necedad de vivir y acumular todo para nosotros mismos, creyendo que así nos aseguramos un futuro que no nos pertenece. #Cuaresma Que el Señor nos dé siempre la esperanza del futuro y la fuerza para seguir adelante. #SantaMarta El ayuno cuaresmal nos libra del apego a las cosas, de la mundanidad que anestesia el corazón. #Cuaresma En este tiempo de #Cuaresma también estamos invitados a mirar hacia los demás con caridad, que nos libra de la vanidad del tener, del pensar que las cosas son buenas si lo son para mí. La #Cuaresma nos invita a mirar hacia lo Alto con la oración, que nos libra de una vida horizontal y plana en la que encontramos tiempo para el yo, pero olvidamos a Dios. La #Cuaresma es el tiempo para reencontrar la ruta de la vida. El Señor es la meta de nuestro peregrinaje en el mundo: hay que trazar la ruta en relación a Él. Ayunar del pecado lleva la esperanza también a la creación, que «será liberada de la esclavitud de la corrupción para entrar en la gloriosa libertad de los hijos de Dios» (Rm 8,21). #Cuaresma https://t.co/ewv3wLxquU Cuando rezamos, hemos de pensar que oramos con Jesús. Él es nuestra fortaleza, es nuestra seguridad, y en este momento intercede por nosotros. #SantaMarta Mediante la oración aprendemos a renunciar a la idolatría y a la autosuficiencia de nuestro yo, y a declararnos necesitados del Señor y de su misericordia. #Cuaresma Si eres joven en edad, pero te sientes débil, cansado o desilusionado, pídele a Jesús que te renueve. Con Él no falta la esperanza. #ChristusVivit https://t.co/RKqw0juf9H La Iglesia es joven cuando recibe cada día la fuerza siempre nueva de la Palabra de Dios, de la Eucaristía, de la presencia de Cristo y de la fuerza de su Espíritu: cuando es capaz de volver una y otra vez a su fuente. #ChristusVivit https://t.co/RKqw0juf9H Vive Cristo, esperanza nuestra, y Él es la más hermosa juventud de este mundo. Todo lo que Él toca se vuelve joven, se hace nuevo, se llena de vida. #ChristusVivit https://t.co/RKqw0juf9H ¡No dejemos transcurrir en vano este tiempo favorable de la  #Cuaresma! Pidamos a Dios que nos ayude a emprender un camino de verdadera conversión. Jesús nos invita a contemplar el corazón del Padre. Sólo desde ahí podremos redescubrirnos cada día como hermanos. #ViajeApostólico La caridad, especialmente hacia los más débiles, es la mejor oportunidad que tenemos para seguir trabajando en favor de una cultura del encuentro. #ViajeApostólico Todo hombre tiene derecho a la vida, a soñar y a poder encontrar el lugar que le corresponde en nuestra “casa común”. Toda persona tiene derecho al futuro. #ViajeApostólico La valentía del encuentro y de la mano tendida son un camino de paz y de armonía para la humanidad. #ViajeApostólico Queridos hermanos y hermanas, siguiendo los pasos de mi santo predecesor Juan Pablo II, el sábado y el domingo estaré en Marruecos como peregrino de la paz y la fraternidad. Les pido que me acompañen con la oración. #ViajeApostólico Hermanos, Dios nos llama, una vez más, a la conversión: oremos para obtener la gracia de una vida nueva en Cristo Señor. #24horasparaelSeñor Si no escuchamos la voz del Señor, nuestro corazón se vuelve como la tierra sin agua. Por eso el Señor dice: “No endurezcáis vuestros corazones”. #SantaMarta ¿Dónde podemos fijar nuestra mirada a lo largo del camino de la Cuaresma? En el crucifijo. Jesús en la cruz es la brújula de la vida que nos orienta al cielo. La cultura de la apariencia, que nos induce a vivir para las cosas pasajeras, es un gran engaño. Porque es como una llamarada: una vez apagada, quedan solo las cenizas. Vale la pena acoger a toda vida, porque cada persona humana vale la sangre de Cristo mismo. ¡No se puede despreciar lo que Dios ha amado tanto! #DíaDelNiñoPorNacer Recordemos hoy en la oración a las víctimas de la #esclavitud moderna. Que sus sufrimientos nos empujen a luchar contra esta plaga inhumana. #RememberSlavery Que la Virgen Santa nos ayude a todos, especialmente a los jóvenes, a recorrer el camino de la paz y la fraternidad fundadas en la acogida y el perdón, en el respeto de los demás y en el amor que es don de uno mismo. Hoy se celebra la Jornada en Memoria de los Misioneros Mártires, que nos invita a testimoniar con valentía nuestra fe y nuestra esperanza en Aquel que en la Cruz ha vencido para siempre el odio y la violencia con su amor. La apariencia exterior, el dinero, la carrera, los pasatiempos: sirenas que nos encantan y luego nos envían a la deriva. La #Cuaresma es un tiempo de gracia para liberar el corazón de las vanidades. Demos gracias a Dios por la “hermana agua”, elemento sencillo y precioso, y esforcémonos para que sea accesible a todos. #DíaMundialdelAgua Hoy recordamos a las personas con #SíndromedeDown, para que, ya desde el vientre materno, sean acogidas, apreciadas y no sean nunca descartadas. Si abandonamos la ley de Dios, la ley del amor, acaba triunfando la ley del más fuerte sobre el más débil. Deseo expresar mi dolor y mi cercanía a las queridas poblaciones de Mozambique, Zimbabue y Malawi, afectadas por el ciclón Idai. Encomiendo las numerosas víctimas y sus familias a la misericordia de Dios. #PrayForAfrica #cycloneIdai La #Cuaresma es volver a descubrir que estamos hechos para el fuego que siempre arde, para Dios, para la eternidad del Cielo, no para el mundo. San José, esposo de la Virgen María, vela siempre por la Iglesia y protégela en todo momento. ¿Qué hacer para no juzgar, no condenar y perdonar? “Dad, y se os dará”. Sed generosos en el dar no solo la limosna material, sino también la espiritual: dedicar tiempo a quien lo necesita, visitar a un enfermo, sonreír. #SantaMarta Rezo por las víctimas del horrible atentado contra las dos mezquitas de #Christchurch, en Nueva Zelanda. Renuevo la invitación a unirnos con la oración y los gestos de paz para contrastar el odio y la violencia. La oración nos une de nuevo con Dios; la caridad con el prójimo; el ayuno con nosotros mismos. Dios, los hermanos, mi vida: estas son las realidades que no acaban en la nada, y en las que debemos invertir. #Cuaresma En este viaje de regreso a lo esencial que es la #Cuaresma, el Señor nos pide que recorramos tres etapas: la limosna, la oración, el ayuno. La #Cuaresma es una llamada a detenerse, a ir a lo esencial, a ayunar de aquello que es superfluo y nos distrae. Es un despertador para el alma. Les pido a todos ustedes que se acuerden en sus oraciones de mí y de mis colaboradores de la Curia romana; esta tarde comenzaremos la semana de Ejercicios espirituales. Solo quien deja los propios apegos mundanos para ponerse en camino encuentra el misterio de Dios. La mujer embellece el mundo, es la que lo custodia y mantiene con vida. Le aporta la gracia que hace nuevas las cosas, el abrazo que incluye, el valor de donarse. #InternationalWomensDay Al comenzar la Cuaresma nos hará bien pedir la gracia de custodiar la memoria de todo lo que el Señor ha hecho en nuestras vidas, de cuánto nos ha amado. #SantaMarta Hoy, Miércoles de Ceniza, comienza el camino cuaresmal. Les deseo a todos ustedes que vivan este tiempo con auténtico espíritu penitencial y de conversión, como un regreso al Padre que nos espera a todos con los brazos abiertos. https://t.co/5n1xpUtcwP La oración da solidez y vitalidad a todo lo que hacemos. Escuchemos el grito de la tierra, herida de mil maneras por la codicia  humana. Permitamos que siga siendo una casa acogedora en la que nadie se siente excluido. #WorldWildlifeDay A veces podemos pensar que estamos solos ante las dificultades. Pero el Señor camina a nuestro lado, incluso si no interviene enseguida, y si seguimos adelante nos abrirá un camino nuevo. Para rezar bien hay que llegar a tener un corazón de niño. Hagamos un breve examen de conciencia todos los días para convertirnos al Señor: cinco minutos al final del día nos ayudarán a reflexionar y a no posponer la conversión del corazón al Señor. #SantaMarta Si creemos en Dios, tratemos de vivir la justicia con todos, de acuerdo con la regla de oro: «Todo lo que deseen que los demás hagan por ustedes, háganlo por ellos» (Mt 7,12). La verdadera religiosidad consiste en amar a Dios con todo nuestro corazón y al prójimo como a nosotros mismos. El amor de Dios es la única fuerza capaz de hacer nuevas todas las cosas. Todo abuso es siempre una monstruosidad. En la justificada rabia de la gente, la Iglesia ve el reflejo de la ira de Dios. Tenemos el deber de escuchar atentamente este grito silencioso. #PBC2019 https://t.co/6keo1mzHjZ Señor, concentra nuestra mirada sobre lo esencial; haz que nos despojemos de todo lo que no ayuda a hacer transparente el Evangelio de Jesucristo. #PBC2019 Señor, líbranos de la tentación de querer salvar nuestra reputación y a nosotros mismos; ayúdanos a asumir la culpa y a buscar juntos respuestas humildes y concretas, en comunión con todo el Pueblo de Dios. #PBC2019 Señor, Tú sabes que nos resistimos a dejar que entren en nuestro corazón los dolores de los demás. Abre nuestros corazones y plásmalos a tu imagen. #PBC2019 Pedimos al Espíritu Santo que nos apoye en estos días y que nos ayude a transformar este mal en una oportunidad para la conciencia y la purificación. #PBC2019 A partir de mañana viviremos algunas jornadas de diálogo y comunión, de escucha y de discernimiento. Que sean un tiempo de conversión. No queremos anunciarnos a nosotros mismos, sino a Aquel que murió por nosotros. #PBC2019 En los momentos más oscuros de nuestra historia, el Señor se hace presente, abre caminos, alza la fe desanimada, unge la esperanza herida, despierta la caridad dormida. Entremos en el misterio del corazón dolorido de Dios, que es Padre, y hablemos con Él mirando las muchas calamidades de nuestro tiempo. #SantaMarta Les invito a rezar en estos días por el Encuentro sobre la protección de los menores en la Iglesia, evento que he querido como acto de fuerte responsabilidad pastoral ante un desafío urgente de nuestro tiempo. El cristiano promueve la paz, comenzando por la comunidad en la que vive. Jesús nos pide que llevemos a cabo una sola obra de arte, que está al alcance de todos: la de nuestra vida. La verdad es la revelación maravillosa de Dios, de su Rostro de Padre, es su amor sin fronteras. Quien ama tiene imaginación para descubrir soluciones donde otros solo ven problemas. Quien ama ayuda al otro según sus necesidades y con creatividad, no siguiendo ideas preconcebidas o lugares comunes. https://t.co/T9FxpbpkZI Distanciarse de las apariencias mundanas es indispensable para prepararse para el Cielo. A miles de niños se les roba su infancia obligándoles a combatir en conflictos armados. Detengamos este crimen abominable. #ChildrenNotSoldiers La actitud generosa hacia los enfermos es sal de la tierra y luz del mundo. Que la Virgen María nos ayude a practicarlo, y obtenga paz y consuelo para todos los que sufren.  https://t.co/dZedZnV34O Si nos ejercitamos para ver con la mirada de Jesús, conseguiremos reconocer siempre a quien nos necesita. El amor a Dios y el amor al prójimo son inseparables, son las dos caras de una única moneda: vividos juntos son la verdadera fuerza del creyente. La vida tiene valor cuando se dona en el amor, en la verdad, cuando se da a los demás en la vida cotidiana, en la familia. #SantaMarta La trata de personas es una terrible violación de la dignidad humana. Abramos los ojos ante esta plaga vergonzosa y esforcémonos por combatirla. #JuntosContraLaTrataDePersonas @M_RSeccion https://t.co/gexU2dNchA Todos tenemos necesidad de ser curados y todos podemos curar a los otros si somos humildes y mansos: con una buena palabra, con paciencia o con una mirada. #SantaMarta El viaje a los Emiratos Árabes Unidos pertenece a las “sorpresas” de Dios. Alabemos, pues, al Señor y su providencia; y oremos para que las semillas sembradas den frutos de paz. #ApostolicJourney #UEA Las Bienaventuranzas son un mapa para la vida: invitan a tener limpio el corazón, a practicar la mansedumbre y la justicia, a ser misericordiosos con todos, a vivir la aflicción unidos a Dios. #UAE #ApostolicJourney San Francisco nos recuerda que el cristiano va armado solo de su fe humilde y su amor concreto. Si vivimos en el mundo al modo de Dios, nos convertiremos en canales de su presencia. #UAE #ApostolicJourney La oración purifica el corazón del replegarse en sí mismo. La oración hecha con el corazón regenera la fraternidad. #UAE #ApostolicJourney El Documento sobre la Fraternidad Humana que he firmado hoy en Abu Dabi, con mi hermano el Gran Imán de Al-Azhar, invita a todas las personas que llevan el corazón la fe en Dios y la fe en la fraternidad humana a unirse y trabajar juntas. https://t.co/9dBqBiePsk Dios está con el hombre que busca la paz. Y desde el cielo bendice cada paso que se da en la tierra por este camino. #UAE #ApostolicJourney Hoy parto hacia los Emiratos Árabes Unidos. Me dirijo a este país como hermano para que escribamos juntos una página de diálogo y juntos recorramos senderos de paz. ¡Recen por mí! La vida consagrada es un encuentro vivo con el Señor en su pueblo, es llamada a la obediencia fiel de cada día y a las sorpresas inéditas del Espíritu, es visión de lo que importa abrazar para tener la alegría: Jesús. Que el Señor nos dé la gracia de la memoria y de la esperanza, para que podamos avanzar con perseverancia en el camino de nuestra vida. #SantaMarta Don Bosco tuvo la valentía de mirar la realidad con los ojos de hombre y con los ojos de Dios. Que cada sacerdote lo imite: mirando la realidad con ojos de hombre y con ojos de Dios. #SantaMarta El secreto para navegar bien en la vida es invitar a Jesús a bordo. Hay que darle a Él el timón de la vida para que sea Él quien lleve el rumbo. La mansedumbre, la ternura: estas virtudes humanas parecen pequeñas, pero son capaces de superar los conflictos más difíciles. Doy gracias a Dios por habernos dado la posibilidad de compartir estos días y vivir nuevamente esta Jornada Mundial de la Juventud. Gracias a todas las personas que nos han sostenido con su oración, y a quienes han colaborado con su esfuerzo y trabajo. #Panama2019 Muchas gracias a todo el pueblo panameño por habernos abierto las puertas de casa y haber acogido a tantos jóvenes provenientes de todas partes del mundo. ¡Que Santa María la Antigua bendiga y proteja Panamá! #Panama2019 Vayan y testimonien lo que han visto y oído, no con muchas palabras, sino mediante gestos sencillos, cotidianos. No sé si estaré en la próxima JMJ, pero seguramente estará Pedro y los confirmará en la fe. #Panama2019 Oremos por las víctimas del atentado terrorista perpetrado en la Catedral de Jolo, en Filipinas. Que el Señor, Príncipe de la paz, convierta el corazón de los violentos y conceda a los habitantes de aquella región una serena convivencia. Aquí en Panamá he pensado mucho en el pueblo venezolano, al que me siento especialmente unido en estos días. Ante la grave situación por la que atraviesa, los invito a rezar conmigo para que se alcance una solución justa y pacífica. Deseo expresar mi dolor por la tragedia que ha golpeado el Estado de Hidalgo, en México. Encomiendo a la misericordia de Dios a todas las víctimas, rezo también por los heridos y expreso mi afecto y mi cercanía espiritual a sus familias. A ustedes, queridos jóvenes, un gran «gracias» por #Panama2019.  Sigan caminando, sigan viviendo y compartiendo la fe. ¡Nos vemos en Lisboa en 2022! No olvidemos a las víctimas del Holocausto. Su indecible sufrimiento sigue gritando a la humanidad: ¡Todos somos hermanos! #JornadadelaMemoria Solo lo que se ama puede ser salvado. Solo lo que se abraza puede ser transformado. #Panama2019 Con su “sí”, María es la mujer que más ha influido en la historia. Aun sin redes sociales fue la primera “influencer”, la “influencer” de Dios. #Panama2019 No calmemos nuestra sed con cualquier agua, sino con ese «manantial que brotará hasta la vida eterna». #Panama2019 Amigos, Jesús nos enseña a creer. Busquen y escuchen las voces que impulsan a mirar hacia delante y no las que los tiran abajo. #Panama2019 En esta JMJ #Panama2019 los invito a rezar juntos el Rosario de la Paz a través de @clicktoprayapp. ¿Qué nos mueve a encontrarnos en esta JMJ? La seguridad de saber que hemos sido amados con un amor entrañable que no queremos y no podemos callar y nos desafía a responder de la misma manera: con amor. #Panama2019 Esta es la red que queremos. Una red hecha no para atrapar, sino para liberar, para custodiar una comunión de personas libres. https://t.co/7toELEA0rZ Me voy a la Jornada Mundial de la Juventud en Panamá. Les pido que oren por este evento tan hermoso e importante en el camino de la Iglesia. Decir “sí” al amor de Dios es el primer paso para ser feliz y hacer felices a muchas personas. El estilo cristiano es el de las Bienaventuranzas: mansedumbre, humildad, paciencia en el sufrimiento, amor por la justicia, capacidad de soportar las persecuciones, no juzgar a los demás… #SantaMarta Lo que queda de la vida, ante el umbral de la eternidad, no es cuánto hemos ganado, sino cuánto hemos dado. El Señor escucha la oración humilde. Hoy comienza la Semana de Oración por la Unidad de los Cristianos: todos estamos invitados a pedir a Dios este gran don. Vigilemos para no tener un corazón perverso que nos haga pusilánimes; un corazón obstinado que nos lleve a la cerrazón; un corazón esclavo de la seducción que conduce a una vida cristiana de compromiso. #SantaMarta El Espíritu de Dios habla libremente a cada uno a través de sentimientos y pensamientos. No puede ser encasillado en esquemas, sino que debe ser acogido con el corazón. Que no les asusten los sufrimientos que ven. Llévenlos ante el Crucificado y a la Eucaristía, donde se recibe el amor paciente y compasivo. Miremos nuestras manos, a menudo vacías de amor, y tratemos de pensar hoy en un don gratuito que podamos ofrecer. El Bautismo es el mejor regalo que hemos recibido: nos hace pertenecer a Dios y nos da la alegría de la salvación. La pequeñez es libertad. Quien es pequeño —en sentido evangélico— es ligero, está libre de todo deseo de aparentar y de cualquier pretensión de éxito. El primer paso para rezar es ser humilde, ir ante el Padre y decir: ‘Mírame, soy un pecador’. Y el Señor escucha. El espíritu del mundo se vence con el espíritu de la fe: creer que Dios está en el hermano y en la hermana que están a mi lado. #SantaMarta No tengan miedo de llorar en contacto con situaciones difíciles: son gotas que riegan la vida. Las lágrimas de compasión purifican el corazón y los afectos. https://t.co/JuCQ9DsYEr El amor no tolera la indiferencia, el amor es compasivo. Amor es poner en juego el corazón por los demás. #SantaMarta Dios se ha hecho hombre: en Jesús ha venido a compartir nuestra vida. Mantengamos viva la relación con Él y entre nosotros. Feliz Navidad a los hermanos y hermanas del Oriente cristiano. Los Reyes Magos ofrecen valiosos regalos al Niño Jesús. Hoy le pedimos a Dios: Señor, haz que descubra de nuevo la alegría de dar. La Iglesia crece en el silencio, en la oración y con las obras buenas que dan testimonio. Jesús es el regalo de Dios para nosotros. Si lo acogemos, también nosotros podemos ser don de Dios para los demás. Si vivimos como Jesús nos enseñó y en armonía con lo que anunciamos, nuestro testimonio dará mucho fruto. Construir la paz significa imitar a Dios, que ha querido hacer las paces con nosotros: nos ha enviado a su Hijo y nos ha perdonado. Hoy más que nunca, nuestras sociedades necesitan “artesanos de la paz”, mensajeros y testigos de Dios Padre que quiere el bien y la felicidad de la familia humana.\nhttps://t.co/TivtP1YjNA Que María, Madre de Dios, nos custodie y nos acompañe en este nuevo año y lleve la paz de su Hijo a nuestros corazones y al mundo. Demos gracias a Dios por el año que llega a su fin, reconociendo que todo el bien es don suyo. Que Jesús, María y José bendigan y protejan a todas las familias del mundo, para que en ellas reinen el amor, la alegría y la paz. Lleven la ternura y la misericordia de Dios a todos los que son descartados por la sociedad. Acojamos en el Niño Jesús el amor de Dios y esforcémonos para hacer que nuestro mundo sea más humano, más digno de los niños de hoy y de mañana. Contemplando a Jesús vemos el Rostro de Dios Amor y aprendemos a reconocerlo en los rostros de nuestros hermanos. La Iglesia crece con la sangre de los mártires, hombres y mujeres que dan su vida por Jesús. Hoy hay muchos, pero no son noticia. ¡Cristo ha nacido por nosotros! Vengan todos los que buscan el Rostro de Dios: aquí está, en ese Niño acostado en un pesebre. Contemplando al Niño Dios que emana luz en la humildad del pesebre nosotros también podemos convertirnos en testigos de humildad, ternura y bondad. #Navidad El árbol de Navidad con sus luces nos recuerda que Jesús es la luz del mundo, es la luz del alma que ahuyenta las tinieblas de la enemistad y abre espacio al perdón. #Navidad Encomendémonos a la Virgen pidiéndole que nos ayude a preparar el corazón para acoger al Niño Jesús en su Natividad. #Navidad Que el belén y el árbol, símbolos de la Navidad, lleven a las familias un reflejo de la luz y la ternura de Dios. #Navidad Dios entra en la historia y lo hace con su estilo original: la sorpresa. El Dios de las sorpresas nos sorprende siempre. #SantaMarta El Adviento es un tiempo para prepararnos a la venida de Jesús, el Príncipe de la paz. Un tiempo para hacer las paces con uno mismo y con el prójimo. #Adviento Hay que ser como san José: hombre de sueños pero no soñador; hombre del silencio porque respeta el plan de Dios. #SantaMarta Jesús conoce bien el dolor de no ser acogido. Que nuestros corazones no estén cerrados como las casas de Belén. #DiaInternacionalDelMigrante Oh Sabiduría, que brotaste de los labios del Altísimo, abarcando del uno al otro confín de la tierra y ordenándolo todo con firmeza y suavidad, ¡ven y muéstranos el camino de la salvación! #AntífonasdeAdviento Alegría, oración y gratitud son las tres actitudes que nos preparan para vivir la Navidad de modo auténtico. #Adviento Nuestra vida difunde luz cuando se consume en el servicio. El secreto de la alegría es vivir para servir. Este es el primer paso para crecer en el camino de la fe: escuchar. Antes de hablar, escuchar. Incluso cuando uno reza solo, reza junto con todo el pueblo de Dios. Pidamos a la Virgen María, Nuestra Señora de Guadalupe, que siga acompañando y protegiendo a los pueblos del continente americano. #VirgendeGuadalupe ¡Consuelen, consuelen a mi pueblo! (Is 40,1).  ¿Cómo consuela el Señor? Con la ternura. #SantaMarta Custodiar la fe. En esta segunda semana de Adviento, pidamos la gracia de prepararnos con fe para celebrar la Navidad. #SantaMarta Toda persona humana, creada por Dios a su imagen y semejanza, es un valor en sí misma y es sujeto de derechos inalienables. #DíaMundialdelosDerechosHumanos El Adviento es un tiempo para reconocer los vacíos que hemos de colmar en nuestra vida, para allanar las asperezas del orgullo y dejar espacio a Jesús que viene. #Adviento ¿Cuál es el secreto de la belleza de María, “tota pulchra”? No es la apariencia, no es algo pasajero, sino el corazón totalmente orientado a Dios. Amar a Dios quiere decir servir al prójimo sin reservas y tratar de perdonar sin límites. https://t.co/lFQnJIwOLP ¿”Decir o hacer”? ¿Soy un cristiano de palabras o de hechos? ¿”Arena o roca”? ¿Construyo mi vida sobre la roca de Dios o sobre la arena de la mundanidad? ¿”Alto o bajo”? ¿Se inspira mi vida en el “Magnificat”? #SantaMarta Sentirse necesitados de salvación es el comienzo de la fe: es el camino que prepara el encuentro con Jesús. Este Adviento, hazte pequeño, hazte humilde, hazte servidor de los demás y el Señor te dará la capacidad de comprender cómo se hace la paz. #SantaMarta El Adviento es tiempo de renovar la fe, para purificarla a fin de que sea más auténtica. #SantaMarta ¡Cuántas personas discapacitadas que sufren se abren de nuevo a la vida apenas sienten que son amadas! ¡Y cuánto amor puede brotar de un corazón gracias a la terapia de la sonrisa! #DiaMundialDeLaDiscapacidad Levantemos el velo de indiferencia que cubre el destino de quien sufre. Nadie puede lavarse las manos ante la trágica realidad de la esclavitud de hoy. #EndSlavery El Adviento es el tiempo para acoger al Señor que viene a nuestro encuentro, para mirar hacia adelante y prepararnos para el regreso de Cristo. #Adviento No existe una familia perfecta. La familia solo crece con el ejercicio diario del perdón. Pidamos al Señor la gracia de dejarlo todo para llevar adelante el anuncio y el testimonio, como hicieron Pedro y Andrés. #SantaMarta Ante las tragedias de nuestra vida estamos llamados a mirar el horizonte, porque hemos sido redimidos y el Señor vendrá a salvarnos. #SantaMarta No se puede seguir de verdad a Jesús cuando se está lastrado por las cosas; porque, si el corazón está repleto de bienes, no habrá espacio para el Señor, que se convertirá en una cosa más. Esta semana, la Iglesia nos invita a preguntarnos: ¿Cómo me gustaría que me encontrase el Señor cuando me llame? #SantaMarta Pidamos al Señor la gracia de la generosidad, que nos ensancha el corazón y nos lleva a la magnanimidad. #SantaMarta Mientras los grandes de la Tierra construyen «tronos» para su propio poder, Dios elige un trono incómodo, la cruz, desde donde reinar dando la vida. Nadie puede sobrevivir sin misericordia, todos necesitamos el perdón. El hombre y la mujer llevan en sí la imagen de Dios y son objeto de su amor infinito, cualquiera que sea la condición en la que han sido llamados a la existencia. A los ojos de Dios la vida humana es valiosa, sacra e inviolable. Nadie puede despreciar la vida de otros o la propia. Que la Virgen María nos ayude a seguir a Jesús con alegría por la vía del servicio, camino real que lleva al Cielo. Con ocasión del Día Mundial de la Pesca, que se celebra hoy, oremos por todos los marinos y promovamos un esfuerzo global contra la trata de seres humanos y el trabajo forzado en el sector de la pesca. #JornadaMundialdelaPesca La fidelidad es la característica de una relación humana libre, madura, responsable. No se puede amar solo cuando «conviene»; el amor se manifiesta precisamente más allá de la propia conveniencia, cuando se da todo sin reservas. Pidamos la gracia de abrir los ojos y el corazón a los pobres, para escuchar su grito y responder a sus necesidades. #DíaMundialdelosPobres  https://t.co/48ufusuzGq Nadie se puede engañar pensando: «Soy bueno porque no hago nada malo». Para ser de Jesús no basta no hacer nada malo, ¡hay que hacer el bien! No sigas a Jesús solo cuando te apetece, búscalo cada día: encuentra en Él al Dios que siempre te ama, el sentido de tu vida, la fuerza para entregarte. “El Reino de Dios está entre vosotros”. No es espectacular. Crece en silencio, a escondidas, mediante el testimonio, la oración y la atracción del Espíritu. #SantaMarta Jesús no se conforma con un «porcentaje de amor»: no podemos amarlo al veinte, al cincuenta o al sesenta por ciento. O todo o nada. El primer paso para conocer a Jesucristo es reconocer nuestra propia miseria, la necesidad de ser salvados. Recemos hoy por los obispos, para que sean siempre como san Pablo les pide que sean: humildes, afables, servidores. #SantaMarta El domingo es un día santo para nosotros, santificado por la celebración eucarística, presencia viva del Señor entre nosotros y para nosotros. #MisaDominical La comunidad científica está llamada hoy a constituir un liderazgo que indique soluciones para el desarrollo sostenible e integral de todos los pueblos, indispensable a fin de construir la paz. #WorldScienceDay Donde hay pecado está también el Señor Dios misericordioso que te perdona si tú te diriges a Él. #SantaMarta Que el Señor nos haga entender la lógica del Evangelio: proclamar la misericordia con el testimonio. #Santa Marta Rezar significa llamar a la puerta de un amigo. Dios es nuestro amigo. https://t.co/kQAukshQhV Jesús nos llama a festejar con Él, a estar junto a Él, a cambiar de vida. #SantaMarta Esforcémonos, con la oración y la acción, por alejar cualquier violencia del corazón, de las palabras y de los gestos, para cuidar de la casa común. Jesús nos ha amado gratuitamente. La vida cristiana consiste en imitar el amor gratuito de Jesús. #SantaMarta La Misa del domingo está en el centro de la vida de la Iglesia: allí encontramos al Señor resucitado, escuchamos su palabra, nos nutrimos en su mesa y así nos hacemos Iglesia. #MisaDominical Dios es fiel, y nuestra esperanza en Él es como un ancla bien sujeta en el Cielo. Jesús le ha quitado a la muerte la última palabra: quien cree en Él será transfigurado por el amor misericordioso del Padre para vivir una vida eterna y feliz. Hoy celebramos la fiesta de la santidad. Reforcemos los lazos de amor y de comunión con todos los santos que ya han llegado a la presencia de Dios. Necesitamos cristianos sonrientes, no porque se toman las cosas a la ligera, sino porque son ricos de la alegría de Dios, porque creen en el amor y viven para servir. Si quieres escuchar la voz del Señor, ponte en marcha, vive en búsqueda. El Señor habla a quien está en búsqueda. Estamos llamados a escuchar lo que el Espíritu nos sugiere. El Espíritu Santo es siempre novedad. Gracias a todos los que habéis participado en este “caminar juntos”. Que el Señor bendiga nuestros pasos, para que podamos escuchar a los jóvenes, hacernos prójimos suyos y testimoniarles la alegría de nuestra vida: Jesús. #Synod2018 https://t.co/v0VQ0qITMZ La fe es vida: es vivir el amor de Dios que ha cambiado nuestra existencia. La fe es una cuestión de encuentro, no de teoría. #Synod2018 https://t.co/v0VQ0qriop Me gustaría decirles a los jóvenes: disculpadnos si a menudo no os hemos escuchado; si, en lugar de abrir vuestro corazón, os hemos llenado los oídos. #Synod2018 https://t.co/v0VQ0qITMZ El futuro lo tienes que hacer tú con tus manos, con tu corazón, con tu amor, con tus pasiones, con tus sueños. Con los demás. San Pablo nos da un consejo muy práctico para conservar la unidad: “Sopórtense mutuamente con amor”. #SantaMarta Sería bueno que todos los días, en algún momento, pudiéramos decir: “Señor, que te conozca a Ti y me conozca a mí”. #SantaMarta La salud no es un bien de consumo sino un derecho universal. ¡Unamos nuestros esfuerzos para que los servicios sanitarios sean accesibles a todos! #HealthForAll Este Sínodo quiere ser signo de la Iglesia que se pone verdaderamente a la escucha y que no tiene siempre una respuesta prefabricada ya lista. #Synod2018 La esperanza no es una idea, es un encuentro. Como la mujer que espera encontrar al hijo que nacerá de su vientre. #SantaMarta ¡Que la compañía de los santos nos ayude a reconocer que Dios nunca nos abandona, para que podamos vivir y testimoniar la esperanza en esta tierra! Únete a Cáritas y camina un millón de kilómetros con los migrantes y los refugiados. Todos vamos por el camino de Emaús, llamados a contemplar el Rostro de Cristo. #sharejourney https://t.co/eVjfI0PfaI La transmisión de la fe, corazón de la misión de la Iglesia, se realiza mediante el “contagio” del amor. #Missio  https://t.co/vfLfyPUGUH Dios puede actuar en cualquier circunstancia, también en medio de aparentes fracasos. La levadura de los cristianos es el Espíritu Santo, que nos hace crecer a pesar de todas las dificultades del camino y siempre en la esperanza. #SantaMarta El camino del discípulo es la pobreza: el discípulo es pobre, porque su riqueza es Jesús. #SantaMarta De la escucha de la Palabra de Dios sacamos el valor y la perseverancia necesarios para ofrecer lo mejor de nosotros mismos a los demás. Abre tu corazón y deja que entre la gracia del Señor. La salvación es un don, no una forma exterior de presentarnos. #SantaMarta https://t.co/OoRiDvq2SI El mundo necesita santos, y todos nosotros, sin excepción, estamos llamados a la santidad. ¡No tengamos miedo! Cuidado con el riesgo de ser actores más que testigos. Estamos llamados a ser memoria viva del Señor. ¿Qué es peor, el demonio reconocible que te empuja a pecar de modo tal que te avergüenzas, o el demonio educado que habita en ti y te posee con el espíritu de la mundanidad? #SantaMarta Rezar no es como usar una varita mágica. La oración requiere esfuerzo, constancia y determinación. #SantaMarta La novedad del Evangelio nos transforma por dentro y por fuera: el espíritu, el alma, el cuerpo, la vida cotidiana. Dedicar tiempo a estar ante el Señor en contemplación y hacer todo lo posible para el Señor al servicio de los demás. Contemplación y servicio: es nuestro camino de vida. #SantaMarta Cada uno de nosotros es el hombre herido y Jesús, el samaritano que se acerca y nos cura. #SantaMarta #VirgenDelRosario\n#PrayForTheChurch https://t.co/F67XTzvAkl Pidamos al Señor los dones del diálogo y de la paciencia, de la cercanía y de la acogida que ama, perdona y no condena. Pidamos al Espíritu Santo que nos abra de par en par las puertas del corazón, para que Jesús pueda entrar a traernos su mensaje de salvación. #SantaMarta En un momento decisivo de su juventud, san Francisco de Asís leyó el Evangelio. También hoy el Evangelio te permite conocer a Jesús vivo, te habla al corazón y te cambia la vida. Pidamos la gracia de ponernos a la escucha los unos de los otros para discernir juntos lo que el Señor le está pidiendo a su Iglesia. #Synod2018 La presencia del Ángel de la guarda en nuestra vida no solo es para ayudarnos en el camino, sino también para mostrarnos adónde debemos ir. #SantaMarta Bajo tu amparo nos acogemos, santa Madre de Dios; no deseches las súplicas que te dirigimos en nuestras necesidades, antes bien, líbranos de todo peligro, ¡oh siempre Virgen, gloriosa y bendita. #PrayForTheChurch La santa inquietud por el Evangelio es la única inquietud que da paz. El domingo es el día para decirle a Dios: ¡Gracias Señor por la vida, por tu misericordia, por todos tus dones! San Miguel, ayúdanos a luchar por nuestra salvación. San Gabriel, tráenos la buena noticia que da esperanza. San Rafael, protégenos en nuestro camino. La vida se vuelve más bella cuando descubrimos que nuestra alma descansa solamente en Dios. Jesús nos ha dado un programa simple para caminar hacia la santidad: el mandamiento del amor a Dios y al prójimo. Espero que en China se pueda abrir una  nueva fase que ayude a sanar las heridas del pasado, a restablecer y mantener la plena comunión de todos los católicos chinos, y a asumir con renovado esfuerzo el anuncio del Evangelio. https://t.co/Tj9qagJV60 Oremos para que en el mundo prevalezcan los programas para el desarrollo y no los dedicados a los armamentos. El Señor saca el bien del mal con su potencia y su infinita creatividad. ¡Dejemos que el Espíritu Santo nos revista con las armas del diálogo, de la comprensión, de la búsqueda del respeto recíproco y de la fraternidad! ¡Donemos la vida con alegría en el servicio, para dar a conocer a todos que Jesucristo es nuestra única esperanza! Que el testimonio de san Pío de Pietrelcina nos anime a vivir las Bienaventuranzas a través de la oración y las obras de misericordia. La paz se elige, no se puede imponer y no se encuentra por casualidad. Si quieres llegar al corazón de Dios, toma el camino de la misericordia y déjate tratar con misericordia. #SantaMarta Pidamos a Jesús que proteja siempre nuestra Iglesia, que la proteja con su misericordia, dando su perdón a cada uno de nosotros. #SantaMarta El bien es amoroso y no se impone nunca. Se elige. Humilde y manso de corazón, cercano a la gente con compasión, mansedumbre y ternura. Así es Jesús. #SantaMarta Hacer siempre el bien requiere esfuerzo… ¡El camino de la santidad no es para los perezosos! Afrontemos los cambios climáticos mediante la cooperación internacional: las decisiones de cada uno repercuten sobre la vida de todos. Solo dando la vida se derrota el mal. Don Pino Puglisi nos lo enseñó: vivió para sembrar el bien. En el sufrimiento que nos producen las llagas eclesiales, agarrémonos con fuerza a la Cruz de Cristo, porque el mal se puede combatir solamente con el amor. Hoy la Iglesia nos invita a contemplar la cruz del Señor. Para los cristianos contemplar la cruz es contemplar a la vez una señal de derrota y una señal de victoria. #SantaMarta Cuando soy misericordioso, soy un verdadero hijo del Padre, porque el Padre es misericordioso. #SantaMarta María, nuestra Madre, conoce las alegrías y las fatigas que experimentamos en nuestro camino. Jesús bajó a la tierra para hacernos subir al cielo: este es el misterio de la Cruz. Dejémonos envolver en una relación de amor con Jesús y seremos capaces de hacer buenas obras que dejen olor a Evangelio. ¡Dios nunca da un paso atrás con su amor! Que la Virgen María nos ayude a abandonarnos con alegría al diseño que Dios tiene para nuestra vida. ¡Sin el derecho a la educación no hay libertad plena, que es la que permite a cada persona ser actor de su propio destino! ¡Recordad que cuanto más os donéis a los demás, tanto más recibiréis vosotros mismos y seréis felices! Portad la paz con vosotros para darla a los demás con vuestra vida, con la sonrisa, con las obras de caridad. ¡Santa Madre Teresa, ruega por nosotros! La fe nos ayuda a entender el sentido de la vida: Dios está con nosotros y nos ama infinitamente. La paz verdadera es un don de Dios; brota de corazones sanados y reconciliados y se extiende hasta abrazar al mundo entero. Que el amor de Dios se convierta más y más en la fuerza que atrae y orienta nuestra libertad. Señor, incrementa en nosotros el cuidado por la casa común, especialmente por el agua, bien primario que debemos tutelar y meter a disposición de todos. https://t.co/eEIjZcDei7 La caridad de Cristo, acogida con corazón abierto, nos cambia, nos transforma, nos hace capaces de amar. Nosotros, los cristianos, no tenemos un producto que vender sino una vida que comunicar. La oración es la primera obra misionera de todo cristiano, y también es la más eficaz. Si el Señor te ha dado riquezas es para hacer a otros, en su nombre, muchas obras buenas. Queridas mamás: como Santa Mónica, no os desaniméis nunca; rezad incansablemente por vuestros hijos. Que la bendición de Dios descienda sobre todas vuestras familias, para que en ellas se experimente el amor y el perdón. Pido a nuestra Madre Santísima que interceda por la sanación de todas las víctimas que han sufrido abusos de cualquier tipo y que confirme a cada miembro de la familia cristiana en el firme propósito de no permitir nunca más que estas situaciones ocurran. “¿No hay nada verdaderamente importante que dure? ¿Ni siquiera el amor?”. El amor es lo que Dios sueña para nosotros y para toda la familia humana. Por favor, no lo olvidéis nunca. Nuestro mundo tiene necesidad de una revolución de amor. Que esta revolución comience desde vosotros y desde vuestras familias. La #familia es icono de Dios: la alianza entre un hombre y una mujer genera vida y comunión. La #familia es cuna de la vida y escuela de acogida y de amor; es una ventana abierta de par en par hacia el misterio de Dios. Ocupémonos de cuidar la #familia: ahí se juega nuestro futuro. La #familia es un taller de esperanza. Hoy, en Dublín, comenzará el Encuentro Mundial de las #Familias. Unámonos en oración por todas las familias del mundo, especialmente las que están en dificultad. @WMOF2018 @LaityFamilyLife Que el Espíritu Santo nos dé la gracia de la conversión y la unción interior para poder expresar, ante los crímenes de abuso, nuestra compunción y nuestra decisión de luchar con valentía. https://t.co/5tFHogLbbE La Eucaristía, Jesús Pan de vida, es el corazón palpitante de la Iglesia y regenera en nosotros el dinamismo del amor. El amor supera la dificultad; el amor nos hace seguir adelante. Quien acoge el amor de Dios transforma el mundo y la historia. La fe se nutre con la memoria: ¡cuántas cosas hermosas ha hecho Dios por cada uno de nosotros! ¡Qué generoso es nuestro Padre celestial! Que María, Madre de la ternura y de la cercanía, sea nuestra Maestra de vida y de fe. Hoy también hay muchos mártires, muchos perseguidos por amor a Cristo: ¡Ellos son la verdadera fuerza de la Iglesia! Gracias al don de la Eucaristía, también nuestra vida se convierte en “pan partido” para nuestros hermanos. En el silencio aprendemos a contemplar la obra de Dios, que supera todo lo que podamos imaginar. Quien se pone al servicio de los hermanos más débiles experimenta la alegría del amor desinteresado. El Reino de Dios crece en el mundo de forma misteriosa, sorprendente, con el poder de la pequeña semilla. El mal trata de persuadirnos de que la muerte es el final de todo; pero Cristo Resucitado nos abre un horizonte de vida eterna. Jesús nos revela que el Rostro de Dios es amor. La ascensión de los discípulos al monte Tabor nos invita a separarnos de las cosas mundanas para  contemplar a Jesús. La Eucaristía es la \"reservación\" del paraíso; es Jesús que nos guía en nuestro camino hacia la vida eterna. Sostened a vuestros sacerdotes con la proximidad y el afecto. La vida cristiana es, ante todo, la respuesta agradecida a un Padre generoso. La caridad es el testimonio más eficaz, porque revela a los hombres el amor de Dios. En la Iglesia, todos tenemos la responsabilidad de santificarnos cuidando de los demás. Para poder ayudar a los demás necesitamos de encuentros personales con Dios: momentos de oración y de escucha de su Palabra. Escuchemos el grito de tantos hermanos explotados mediante tráficos criminales: no son mercadería, son personas humanas, y como tales deben ser consideradas. #EndHumanTrafficking @M_RSeccion La santidad no concierne solo al espíritu, sino también a los pies que nos llevan a los hermanos y a las manos con las que les ayudamos. Los abuelos son un tesoro en la familia. Por favor, ¡cuiden de los abuelos, ámenlos, hagan que hablen con los niños! La oración nunca es en vano: siempre hace brotar algo nuevo que tarde o temprano produce fruto. Dios quiere que lo llamemos Padre con la confianza de un niño que se abandona en los brazos de quien le ha dado la vida. Jesús nos invita a construir juntos la civilización del amor en las situaciones que nos toca vivir a diario. Que la Virgen María, Madre y Reina del Carmelo, acompañe vuestros pasos en el camino cotidiano hacia el Monte de Dios. Prueba a leer el Evangelio al menos cinco minutos al día. Verás que te cambia la vida. Europa encuentra de nuevo la esperanza cuando pone al hombre en el centro de sus instituciones.¡San Benito, ruega por nosotros! El buen samaritano también sos vos cuando sabés descubrir el rostro de Cristo en aquel que está a tu lado. ¡Cualquier ocasión es buena para llevar el mensaje de Cristo! ¡Que la humanidad escuche el grito de los niños de Oriente Medio! Secando sus lágrimas, el mundo reencontrará la dignidad. Que el Dios de todo consuelo, que sana los corazones destrozados y venda las heridas, escuche nuestra oración: ¡Paz en Oriente Medio! Los sufrimientos de tantos hermanos y hermanas perseguidos a causa del Evangelio son un llamado urgente para que los cristianos estemos más unidos. ¿Sabemos hacer silencio en el corazón para escuchar la voz de Dios? Las gracias de Dios se reciben para compartirlas con los demás. Pido a todos que acompañen con la oración el peregrinaje que realizaremos el próximo sábado a Bari para invocar la paz sobre el martirizado Oriente Medio. Permaneciendo firmes en Dios, que nos ama y nos sostiene, es posible afrontar todas las contrariedades y las vicisitudes de la vida. Cualquier pobreza material y espiritual, cualquier discriminación de hermanos y hermanas es siempre consecuencia del rechazo a Dios y a su amor. Recemos por los nuevos cardenales, para que me ayuden en mi ministerio de Obispo de Roma por el bien de todo el Pueblo de Dios. Estamos llamados a custodiar a los ancianos, los enfermos, los niños por nacer: la vida debe ser tutelada y amada siempre, desde la concepción a su ocaso natural. ¡Torturar a las personas es un pecado mortal! Que las comunidades cristianas se comprometan a sostener a las víctimas de la tortura. La fe en Jesucristo libera del pecado, de la tristeza, del vacío interior, del aislamiento; y es fuente de una alegría que nadie nos puede quitar. Como san Juan Bautista, el cristiano debe saber empequeñecerse para que el Señor crezca en su corazón. Pidamos al Señor que nos ayude a comprender que el amor es servicio, es hacerse cargo de los demás. El amor por los demás debe convertirse en la constante de nuestra existencia. Caminar juntos, orar juntos, trabajar juntos: he aquí nuestro camino principal hacia la unidad de los cristianos. #WCC70 Queridos jóvenes, ayuden a los adultos, cuyo corazón a menudo se ha endurecido, a elegir el camino del diálogo y de la concordia. La dignidad de una persona no depende de que sea ciudadano, migrante o refugiado. Salvar la vida de quien escapa de la guerra y de la miseria es un acto de humanidad. #WithRefugees @M_RSeccion Encontramos a Jesús en el pobre, el descartado, el refugiado. ¡No dejemos que el miedo nos impida acoger al prójimo necesitado! #WithRefugees @M_RSeccion La decisión de seguir a Cristo favorece la edificación de una sociedad más justa, más fraternal, más humana conforme al corazón de Dios. ¡Manifestemos la alegría del Reino de Dios en toda circunstancia! Compartamos, con gestos concretos de solidaridad, el camino de los migrantes y de los refugiados. #sharejourney https://t.co/qiJ5EgKA0K Invitemos al Espíritu Santo a nuestros ambientes, invoquémoslo antes de nuestras actividades: “Ven, Espíritu Santo”. El amor es siempre dedicación a los demás. Porque el amor se ve en las obras, no en las palabras. Envío un cordial saludo a los jugadores y a cuantos seguirán el Campeonato Mundial de Fútbol que comienza hoy en Rusia. Espero que este evento deportivo constituya una auténtica ocasión de encuentro y de fraternidad. Nadie es tan pobre que no pueda dar lo que tiene y, antes incluso, lo que es. No se cansen de encontrar al Señor Jesús en la oración, la escucha de la Palabra de Dios y la participación en la Eucaristía. Los niños han de poder jugar, estudiar y crecer en un ambiente sereno. ¡Ay de quien sofoca en ellos el impulso alegre de la esperanza! El Espíritu Santo nos da la fuerza necesaria para alcanzar la santidad en medio de las circunstancias que nos toca vivir cada día. En cualquier circunstancia, tratemos de secundar la voz del Espíritu Santo mediante buenas acciones concretas. María es exactamente como Dios quiere que sea su Iglesia: Madre tierna, humilde, pobre de cosas y rica de amor. Recemos al Señor para que nos dé siempre buenos pastores: hombres trabajadores, de oración, cercanos al pueblo de Dios. La fiesta del Sagrado Corazón nos recuerda que Dios nos amó primero: Él nos espera siempre para acogernos en su Corazón, en su amor. Para quien está con Jesús, el mal es una provocación para amar cada vez más. El amor por Cristo no es un sentimiento superficial, sino una actitud fundamental del corazón que se manifiesta en vivir como Él quiere. Señor, despierta en nosotros la alabanza y la gratitud por nuestra Tierra y por cada ser que has creado. La presencia viva de Cristo en nosotros es luz que orienta nuestras elecciones, llama que calienta el corazón que va al encuentro del Señor. En esta solemnidad del Corpus Christi, recordemos que Jesús, Pan de Vida, es nuestra fuerza, el apoyo para nuestro caminar. Busca en la oración a tu Señor, a Aquél que te ha llamado. El amor sabe ver el bien incluso en una situación negativa, sabe custodiar la pequeña llama en medio de una noche oscura. En la Eucaristía está todo el sabor de las palabras y de los gestos de Jesús, el gusto de su Pascua, la fragancia de su Espíritu. Cuando el Espíritu Santo está presente, siempre sucede algo; cuando Él sopla nunca hay bonanza. La Eucaristía nos fortalece para que demos frutos de obras buenas y vivamos como verdaderos cristianos. ¿Qué es lo que permanece, qué tiene valor en la vida, cuáles son las riquezas que no desaparecen? Sin duda, dos: El Señor y el prójimo. El misterio de la Trinidad nos invita a  vivir en la comunión, en el amor y en la fraternidad, seguros de que donde hay caridad, ahí está Dios. El Evangelio llama a una vida a menudo incómoda, porque quien sigue a Jesús ama a los pobres y a los humildes. Que el amor a Dios y el amor al prójimo sean las dos piedras angulares de nuestra vida. Hoy nos unimos en oración a los hermanos católicos de China, en el día de Santa María \"Auxilio de los Cristianos\", de Sheshan. Una Iglesia que se preocupa por los pobres permanece siempre sintonizada con el canal de Dios, nunca pierde la frecuencia del Evangelio. La vida cristiana se debe invertir en Jesús y gastar en los demás. Dios necesita personas que lleven al mundo su perdón y su misericordia. Espíritu Santo, Tú que llevas adelante la Iglesia, desciende una vez más sobre nosotros, enséñanos la unidad, renueva nuestros corazones y ayúdanos a amar como Jesús nos ha enseñado. No olvidemos nunca esta regla de oro: «Todo lo que quieran que los demás hagan por ustedes, háganlo ustedes por ellos» (Mt 7,12). María vivió como nadie las bienaventuranzas de Jesús: es la santa entre los santos, la que nos enseña el camino de la santidad y nos acompaña. El amor con el que Dios nos ama vence cualquier forma de soledad y de abandono. Deseo expresar mi gran dolor por los muertos y heridos en Tierra Santa y Oriente Medio. La violencia nunca lleva a la paz. Por ello, invito a todas las partes en causa y a la comunidad internacional a renovar los esfuerzos para que prevalezcan el diálogo, la justicia y la paz. No hay amor sin obras de amor. La entrega al hermano brota del corazón que ama. La familia es la esperanza del futuro. Oremos especialmente por las familias que atraviesan grandes dificultades, para que el Señor las sostega. No hay mayor libertad que la de dejarse guiar por el Espíritu Santo y permitirle que nos conduzca hacia donde Él quiera. Invito a los profesionales de la comunicación a promover un periodismo de paz al servicio de todas las personas, especialmente de aquellas que no tienen voz. #WorldCommunicationsDay Santa Virgen de Fátima, dirige tu mirada sobre nosotros, sobre nuestras familias, sobre nuestro país, sobre el mundo. No se responde a Jesús según los cálculos y las conveniencias del momento, sino con el “sí” de toda la vida. La paz se construye empezando por las casas, las calles, las tiendas,  allí donde la comunión se plasma de forma artesanal. En la Ascensión de Jesús Resucitado está la promesa de nuestra participación en la plenitud de vida junto a Dios. Somos cristianos en la medida en que permitimos que Jesucristo viva en nosotros. Santa María, Reina del Rosario, implora la misericordia de Jesús para todos nosotros pecadores. Señor, convierte nuestros corazones para que aumente la caridad en la tierra. Es hermoso ser “portadores de esperanza”, mensajeros simples y alegres del aleluya pascual. Cada ofensa o herida o violencia al cuerpo de nuestro prójimo, es un ultraje a Dios creador. Cumplir con alegría obras de caridad hacia los que sufren en el cuerpo y en el espíritu es el modo más auténtico de vivir el Evangelio. En la cruz, Jesús nos ha manifestado la grandeza de su amor y el poder de su misericordia. La oración es estar con Dios, es vivir con Dios, es amar a Dios. Hoy, en el Santuario de la Virgen del Divino Amore, recitaremos el Rosario rezando especialmente por la paz en Siria y en el mundo entero. Invito a prolongar durante todo el mes de mayo el rezo del Rosario por la paz. Celebremos san José Obrero acordándonos siempre de que el trabajo es un elemento fundamental para la dignidad de la persona. Sean siempre de Cristo en la oración, en el cuidado de sus hermanos más pequeños, en la búsqueda de la paz. ¿Queremos verdaderamente la paz? Entonces prohibamos las armas para no tener que vivir con el miedo a la guerra. Estoy profundamente afectado por la muerte del pequeño Alfie. Hoy rezo especialmente por sus padres, mientras Dios Padre lo acoge en su abrazo de ternura. Jesús nos comunica su amor, para que podamos amar a Dios y a nuestro prójimo como Él nos ha amado, entregándonos su propia vida. Cuando nos abrimos a la gracia de Dios, lo imposible se hace realidad. Solamente Dios nos puede donar la verdadera felicidad: es inútil que perdamos tiempo buscándola en otro lugar, en las riquezas, en los placeres, en el poder. Los cristianos auténticos no tienen miedo de abrirse a los demás, de compartir su espacio vital transformándolo en espacio de fraternidad. La vida tiene pleno sentido cuando se ofrece como un don; se vuelve insípida cuando se guarda para uno mismo. Conmovido por las oraciones y la amplia solidaridad en favor del pequeño Alfie Evans, renuevo mi llamamiento para que se escuche el sufrimiento de sus padres y se cumpla su deseo de intentar nuevas posibilidades de tratamiento. La Palabra de Dios es la lámpara para mirar al futuro: con su luz se pueden leer los signos de los tiempos. Sigamos el ejemplo de San Francisco de Asís: cuidemos de nuestra Casa común. La llamada que Dios dirige a cada uno es un don que llena de alegría. Cuando uno está lleno de sí mismo, no hay lugar para Dios.  Pidamos al Señor que convierta nuestro corazón. Para encontrar a Dios basta reconocerse necesitado; la via para encontrarlo es hacerse pequeño por dentro. Recordemos hoy lo que decía don Tonino Bello: \"No bastan las obras de caridad si falta la caridad en las obras\". La misericordia abre la puerta del corazón porque nos hace sentirnos hermanos e hijos de un solo Padre. El cristiano, por vocación, es hermano de todos los hombres, especialmente si son pobres, y también de los enemigos. Dios nos pide poco y nos da mucho. Nos pide un corazón abierto para acogerle a Él y a los hermanos más débiles. Quien cuida a los niños está del lado de Dios y vence la cultura del descarte. ¡Liberemos a los niños de todas las formas de explotación! Mientras rezo incesantemente por la paz, e invito a todas las personas de buena voluntad a continuar haciendo lo mismo, hago un llamamiento de nuevo a todos los responsables políticos para que prevalezcan la justicia y la paz. La Iglesia es joven porque el Evangelio es como una linfa vital que la regenera continuamente. Todos estamos llamados a ser santos viviendo con amor y  ofreciendo nuestro testimonio en las ocupaciones de cada día. #GaudeteetExsultate La santidad a la que el Señor te llama crece mediante pequeños gestos buenos en la vida cotidiana. #GaudeteetExsultate El santo es una persona con espíritu orante, que necesita comunicarse con Dios. No hay santidad sin oración. #Santidad La santidad es el rostro más bello de la Iglesia. #SantosHoy La palabra «feliz» o «bienaventurado» es sinónimo de «santo», porque la persona fiel a Dios alcanza, en la entrega de sí, la verdadera felicidad. #GaudeteetExsultate Mantener el corazón limpio de todo lo que mancha el amor, sembrar paz a nuestro alrededor, aceptar cada día el camino del Evangelio aunque nos traiga problemas, esto es santidad. #SantosHoy Ser pobre en el corazón, reaccionar con humilde mansedumbre, saber llorar con los demás, buscar la justicia con hambre y sed, mirar y actuar con misericordia: esto es santidad. #SantosHoy ¿Tienes autoridad? Sé santo luchando por el bien común y renunciando a tus intereses personales. #GaudeteetExsultate ¿Eres padre, madre, abuela o abuelo? Sé santo enseñando con paciencia a los niños a seguir a Jesús. #SantosHoy ¿Eres un trabajador? Sé santo cumpliendo con honradez y competencia tu trabajo al servicio de los hermanos. #Santidad ¿Estás casado? Sé santo amando y ocupándote de tu marido o de tu esposa, como Cristo lo hizo con la Iglesia. #GaudeteetExsultate ¿Eres consagrada o consagrado? Sé santo viviendo con alegría tu entrega. #SantosHoy El Señor nos llama a todos a la santidad, también a ti. #Santidad Quiero hacer resonar una vez más el llamado a la santidad: «Alegraos y regocijaos» #GaudeteetExsultate https://t.co/01GTaIAEA1 Dios sigue buscando hoy corazones como el de María, dispuestos a fiarse completamente de Él. Dios nos reviste de su misericordia, nos reviste de Cristo, para que seamos instrumentos de bondad. Como el buen samaritano, cuidemos a quienes sufren y están enfermos. #WorldHealthDay La Palabra del Señor es luz en la oscuridad, y nos ayuda a no tener miedo ante las dificultades. Sigamos adelante con la alegría de la Resurrección de Jesús: ¡Él siempre está a nuestro lado! Espero de corazón que se haga todo lo necesario para poder seguir acompañando compasivamente al pequeño Alfie Evans, y que el profundo sufrimiento de sus padres sea escuchado. Estoy rezando por Alfie, por su familia y por todos los que están involucrados. La única arma invencible es la caridad, porque tiene el poder de desarmar a las fuerzas del mal. Cristo, que ha vencido las tinieblas del pecado y de la muerte, dé paz a nuestros días. Contemplando la tumba vacía de Cristo renovamos nuestra fe en que con Él nada está perdido. Hoy resuena el anuncio más hermoso: «¡El Señor ha resucitado verdaderamente, como había dicho!» ¡Feliz Pascua a todos! Nuestra fe nace la mañana de Pascua: ¡Jesús está vivo! Este es el núcleo del mensaje cristiano. Mira a Cristo Crucificado: en Él brota la esperanza que dura hasta la vida eterna. La Eucaristía nos hace entrar en el misterio pascual de Cristo, donándonos pasar con Él de la muerte a la vida. Quien huye de la Cruz, escapa de la Resurrección. Jesús transforma nuestro pecado en perdón, nuestro miedo en confianza: en la Cruz ha nacido y renace siempre nuestra esperanza. ¡Oh Cristo, enséñanos a no avergonzarnos nunca de tu Cruz! Por favor, luchemos juntos contra el crimen de la esclavitud, que sigue causando sufrimientos indecibles. Queridos jóvenes, ¡no se cansen de ser instrumento de paz y de alegría entre sus compañeros! Entremos con Jesús en la Semana Santa para celebrar la Pascua con el corazón renovado por la gracia del Espíritu Santo. La Palabra de Dios tiene que hacer este recorrido en nosotros: de los oídos al corazón; y del corazón a las manos, a las buenas obras. Este es el tiempo oportuno para reconciliarnos con Dios. Permanecer en el camino del mal es sólo fuente de tristeza. Defender la tierra, defender el agua, es defender la vida. Nadie puede ser descartado, porque todos somos vulnerables. Cada uno de nosotros es un tesoro que Dios hace crecer a su manera. #Downsyndrome, #WDSD18 Queridos papás, ¡felicidades en su día!  Sean para sus hijos como san José: custodios de su crecimiento en edad, sabiduría y gracia. Escuchando las aspiraciones de los jóvenes podemos entrever el mundo del mañana y los caminos que la Iglesia está llamada a recorrer. #Synod2018 Jesús se ha hecho como el grano de trigo en la tierra y ha muerto para dar vida; y de esa vida plena de amor viene la esperanza. La Cuaresma es el camino de la esclavitud a la libertad, del sufrimiento a la alegría, de la muerte a la vida. Para preparar un futuro verdaderamente humano no es suficiente rechazar el mal, hay que construir juntos el bien. Si encontramos todos los días a Jesús y a los hermanos, el corazón no se refugia en el pasado o el futuro, sino que vive el hoy de Dios en paz con todos. Dejarse encontrar por Jesús es el secreto para mantener viva la llama de la vida espiritual. Vivir el encuentro con Jesús es abrirse a la cotidiana agitación de la gracia. ¿Qué sería de nosotros si Dios no nos diera siempre una oportunidad para volver a empezar? Si dedicamos más tiempo a la oración, nuestro corazón puede descubrir las mentiras secretas con las que nos autoengañamos, y encontrar consuelo en Dios. En el sacramento de la Reconciliación encontramos el camino para volver al Señor y redescubrir el sentido de nuestra vida. En medio de todas nuestras actividades, a menudo descuidamos lo esencial: la vida espiritual, nuestra relación con Dios. ¡Detengámonos a rezar! ¡Muchas gracias a todas las mujeres que cada día tratan de construir una sociedad más humana y acogedora! A veces parece que la caridad se apaga en muchos corazones; pero nunca se apaga en el corazón de Dios. Aprendamos a reconocer qué es lo que deja en nuestro corazón una huella buena y duradera, porque viene de Dios. Dios, que no se deja ganar por nadie en generosidad, se sirve de ti y de mí para ayudar a los hermanos. Cuando nos encontramos en el Señor no tardan en llegar las sorpresas de Dios. El ejercicio de la limosna nos ayuda a descubrir que el otro es mi hermano: lo que tengo nunca es solo mío. El ayuno nos despierta, nos hace estar más atentos a Dios y al prójimo, nos recuerda que solo Dios sacia nuestra hambre. La Providencia de Dios nos ofrece cada año la Cuaresma: la posibilidad de volver al Señor con todo el corazón y con toda la vida. Podemos sostenernos los unos a los otros y afrontar, armados solamente con Jesús, cualquier desafío con valor y esperanza. Todos estamos llamados a vivir la alegría que brota del encuentro con Jesús, para vencer nuestro egoísmo y salir de nuestra propia comodidad. Si queremos un futuro de prosperidad para todos, mantengamos la brújula orientada hacia el «verdadero Norte»: los valores auténticos. Pidamos al Señor el don de la paz para todo el mundo, especialmente para las poblaciones que más sufren a causa de los conflictos actuales. Dedicar tiempo a una persona difícil, ayudar a alguien que no nos resulta interesante es ofrecer un don grato a Jesús. Nuestro Padre Celestial siempre escucha a sus hijos que claman a Él en el dolor. Ofrezcámosle hoy una Jornada de oración y ayuno por la paz. Deseo a todos un camino cuaresmal rico de frutos; y les pido que recen por mí y mis colaboradores, que hoy empezamos la semana de Ejercicios Espirituales. Solo quien sabe reconocer sus propios errores y pedir perdón recibe la comprensión y el perdón de los otros. El mensaje de Jesús es incómodo y nos incomoda, porque desafía el poder religioso mundano y provoca las conciencias. En la vida experimentamos la ternura de Dios, que en nuestra cotidianidad nos salva amorosamente del pecado, del miedo y de la angustia. Quien confiesa sus pecados con humildad y sinceridad, recibe el perdón y encuentra de nuevo la unión con Dios y con los hermanos. Para transmitir la fe tenemos necesidad del Espíritu Santo, solos no podemos. Siento con fuerza el dolor por los muchos niños arrancados a sus familias para ser usados como soldados. ¡Esta es una tragedia! Servir a la vida humana es servir a Dios y a toda vida, desde la que está en el vientre de la madre, hasta la anciana, la enferma y la que sufre. Los enfermos han de ser amados siempre en su fragilidad, y respetados en su inviolable dignidad. El Señor se hace presente en nuestra vida mostrándonos todo su amor, y nos anima a que le correspondamos con generosidad. Los cristianos estamos llamados a custodiar juntos el recuerdo de todo lo que Dios ha hecho por nosotros. No podemos permanecer en silencio ante el sufrimiento de millones de personas cuya dignidad está herida. Acojamos con espíritu de misericordia a las víctimas de la trata y a quienes huyen de la guerra y del hambre. A medida que crecemos en la vida espiritual, comprendemos que la gracia nos llega junto a los demás, y que hay que compartirla con los demás. Todos estamos llamados a esforzarnos para proteger a los menores en el mundo digital. Quien es consciente de sus propias miserias y baja los ojos con humildad, siente posarse sobre sí la mirada misericordiosa de Dios. Jesús se deja encontrar por quien lo busca, pero para buscarlo hay que moverse, salir. La vida de fe consiste en el deseo de estar con el Señor y en una búsqueda continua del lugar donde Él habita. Que todos los hombres puedan llegar a Cristo, Luz de Verdad, y que el mundo avance por el camino de la justicia y de la paz. Una fe que no nos pone en crisis es una fe en crisis; una fe que no nos hace crecer es una fe que debe crecer. Jesús es nuestro mediador y nos reconcilia no solamente con el Padre, sino también entre nosotros. El bien, como también el amor, la justicia y la solidaridad, no se alcanzan de una vez para siempre; han de ser conquistados cada día. Por medio de la oración podemos entrar en una relación estable con Dios, que es la fuente de la verdadera alegría. Rezo por todas las personas afectadas por la enfermedad de Hansen, y animo a quienes se ocupan de su asistencia y reinserción social. Aquí estamos, Señor, con la vergüenza de lo que el hombre, creado a tu imagen y semejanza, ha sido capaz de hacer. Acuérdate de nosotros en tu misericordia. La alegría del cristiano no se puede comprar; viene de la fe y del encuentro con Jesucristo, razón de nuestra felicidad. Cuando rezamos, podemos vernos unos a otros en la perspectiva adecuada, la del Padre, y reconocernos como hermanos. Deseo dirigir un llamamiento a promover un periodismo de paz, hecho por personas para las personas. El antídoto más eficaz contra el virus de la falsedad es dejarse purificar por la verdad. Ninguna desinformación es inocua: fiarse de lo que es falso produce consecuencias nefastas. La oración que purifica, fortalece e ilumina el camino es como el combustible de nuestro viaje hacia la plena unidad de los cristianos. Muchas gracias a todos los que acompañaron mi peregrinación a Chile y Perú de muchas formas y maneras, especialmente con la oración. Agradezco a todos los que han hecho posible este viaje. Me ha hecho bien encontrarme con ustedes. Gracias. Hoy el Señor te invita a recorrer con Él la ciudad, tu ciudad. Te invita a que seas su discípulo misionero. ¡No pierdan tiempo en disfrazar su corazón, llenen su vida del Espíritu Santo! Queridos amigos, en esos momentos en que parece que se apaga la fe, no se olviden de que Jesús está a su lado. ¡No se den por vencidos, no pierdan la esperanza! No hay mejor medicina para curar tantas heridas que un corazón que sepa de misericordia. El lema de mi visita a Perú es «Unidos por la esperanza». Tengo esperanza en ustedes, en el corazón de tantas personas que quieren una vida bendecida. ¡Alabado seas Señor por esta obra maravillosa de tus pueblos amazónicos y por toda la biodiversidad que estas tierras envuelven! He querido venir a visitarlos a la Amazonia para reafirmar junto a ustedes la defensa de la vida, de la tierra y de las culturas. Cada vida cuenta: desde el principio hasta el final, desde la concepción hasta la muerte natural El mensaje del Evangelio es fuente de gozo: una alegría que se contagia de generación en generación y de la cual somos herederos. Hermanos, por los hijos de esta tierra, por los hijos de sus hijos, digamos con Jesús al Padre: que también nosotros seamos uno; haznos artesanos de unidad. No basta con escuchar alguna enseñanza religiosa o aprender una doctrina; lo que queremos es vivir como Jesús vivió. Hoy oramos por todos los que sufrieron y murieron, y por los que cada día llevan sobre sus espaldas el peso de tantas injusticias. Pidamos a Dios que nos dé la valentía de pedir perdón y la capacidad de aprender a escuchar lo que Él nos está diciendo. Quiero saludar y abrazar a todo el pueblo chileno, desde el extremo norte de la región de Arica y Parinacota hasta el archipiélago sur. Les pido por favor que acompañen con la oración mi viaje a Chile y Perú. Trabajemos juntos para acoger, proteger, promover e integrar a quien se ve obligado a abandonar su propia casa y vive momentos de gran dificultad. @M_RSeccion No debemos esperar a ser perfectos para responder al Señor que nos llama, sino que hemos de acoger su voz con el corazón abierto. El encuentro con Dios y con los hermanos no puede esperar nuestra lentitud y pereza: ¡La llamada es para hoy! Quien no padece con el hermano que sufre, aunque sea diferente de él por religión, idioma o cultura, debe interrogarse sobre su propia humanidad. Cuanto más enraizados estamos en Cristo, más serenidad interior encontramos, incluso en medio de las contradicciones cotidianas. Un alma alegre es como tierra buena que hace crecer bien la vida, con buenos frutos. Alegría, oración y gratitud son tres actitudes que nos hacen vivir de manera auténtica. ¡Alegrémonos con los hermanos y hermanas del Oriente cristiano que hoy celebran la Santa Navidad. Antes el bautismo se llamaba también «iluminación», porque la fe ilumina el corazón, hace ver las cosas con otra luz. Como los magos, el creyente, empujado por su fe, busca a Dios en los lugares más escondidos, porque sabe que allí lo espera el Señor. Dios pasa por los caminos a veces polvorientos de nuestra vida y, conociendo nuestra nostalgia de amor y felicidad, nos llama a la alegría. Dios se ha hecho Niño para estar más cerca de los hombres de todos los tiempos, demostrándonos su infinita ternura. En el Nombre de Jesús podemos demostrar con nuestro testimonio que la paz es posible. En la sencillez del pesebre encontramos y contemplamos la ternura de Dios, manifestada en el Niño Jesús. Cuidemos de los renuevos de paz que ya están brotando, y transformemos nuestras ciudades en talleres de paz. La familia es la unión armónica de las diferencias entre el hombre y la mujer, que es más verdadera cuanto más capaz es de abrirse a la vida y a los demás. En estos días promovamos actitudes y gestos que favorezcan la paz. La modestia es una virtud esencial para quien quiere ser conforme a Jesús, manso y humilde de corazón. Oremos hoy por los niños a los que no se les deja nacer, por los que lloran a causa del hambre, por los que no tienen en sus manos juguetes, sino armas. Dios, enamorado de nosotros, nos atrae con su ternura naciendo pobre y frágil en medio de nosotros, como uno más. Hoy queremos recordar a todos los que sufren persecuciones, y estar cerca de ellos con nuestro afecto y nuestra oración. Detengámonos a contemplar el pesebre; entremos en la verdadera Navidad con los pastores, llevando al Niño Jesús lo que somos. Contemplando al Niño Jesús, amor humilde e infinito, digámosle sencillamente: ¡Gracias, porque has hecho todo esto por mí! Si queremos celebrar la verdadera Navidad, contemplemos este signo: la frágil sencillez de un pequeño recién nacido. Allí está Dios. ¡Liberemos la Navidad de la mundanidad que la ha secuestrado! El verdadero espíritu de Navidad está en la belleza de ser amados por Dios. Sin amor, tanto la vida como la fe permanecen estériles. Para ir al Cielo no vale lo que se tiene, sino lo que se da. ¡Salgan al encuentro de Jesús, estén con Él en la oración, confíen toda su existencia al amor misericordioso del Señor! Cada extranjero que llama a nuestra puerta es una ocasión de encuentro con Jesucristo. Que el Señor nos dé la sabiduría de buscar lo que cuenta verdaderamente y el valor de amar, no con palabras sino con hechos. Nos santificamos trabajando para los demás, prolongando así en la historia el acto creador de Dios. Aunque nadie se acuerde de nosotros, Jesús está siempre ahí, a nuestro lado. Exhorto a todos a vivir la alegría de la misión testimoniando el Evangelio en los ambientes en los que cada uno vive y trabaja. El cristiano está llamado a comprometerse concretamente en las realidades terrenales, iluminándolas con la luz que viene de Dios. Mirar la Guadalupana es recordar que la visita del Señor pasa siempre por medio de aquellos que buscan «hacer carne» su Palabra. Gracias a todos ustedes, seguidores de @Pontifex, que hoy cumple cinco años. ¡Que las redes sociales sean espacios ricos de humanidad! Pidamos la gracia de hacer nuestra fe cada vez más operante por medio de la caridad. La acción política ha de estar verdaderamente al servicio de la persona humana, del bien común y del cuidado de la creación. Hay que combatir con fuerza contra la corrupción. Es un mal basado en la idolatría del dinero que hiere la dignidad humana. Que la Virgen María sea siempre nuestro refugio, nuestro consuelo y el camino que nos conduce a Cristo. Todos tenemos talentos que Dios nos ha dado. Por eso nadie puede considerarse tan pobre que no pueda dar algo a los demás. A los ojos de Dios, ninguno de sus hijos puede ser descartado; Él confía a todos y cada uno una misión. Todos somos mendigos del amor de Dios, que da sentido a nuestra existencia y nos ofrece una vida sin fin. La fe se hace tangible cuando se concreta en el amor, especialmente en el servicio a los hermanos y hermanas necesitados. Cada persona es única e irrepetible. Renovemos nuestros esfuerzos para que las personas con discapacidades sean siempre bien acogidas en las comunidades en las que viven. Queridos amigos de Myanmar y Bangladesh, ¡gracias por su acogida! Invoco sobre ustedes las bendiciones divinas de armonía y paz. La sabiduría de Dios nos ayuda a saber cómo acoger y aceptar a aquellos que actúan y piensan de manera diferente a la nuestra. ¡Cuánta capacidad de apertura se necesita para acoger a las personas que se sienten solas y desconcertadas en la búsqueda del sentido de la vida! No se puede invocar nunca el santísimo nombre de Dios para justificar el odio y la violencia contra otros seres humanos, nuestros semejantes. El amor de Cristo es como un “GPS espiritual” que nos guía infaliblemente hacia Dios y hacia el corazón de nuestro prójimo. Espero que mi visita pueda abrazar a toda la población de Myanmar y animar la construcción de una sociedad reconciliada e inclusiva. Miremos hoy a Jesús y repitámosle con el corazón: \"¡Acuérdate de mí, Señor, ahora que estás en tu Reino!\" Mientras me preparo para visitar Myanmar y Bangladés, deseo enviar unas palabras de saludo y amistad a todos sus pueblos. ¡Tengo muchas ganas de encontrarles! También hay esperanza para quien hizo el mal. Jesús vino para eso: es posible reconciliarse con Dios e iniciar una nueva vida. Al final de los días, cuando el Señor venga a nuestro encuentro, la alegría será inmensa. ¡Vivamos esperando este encuentro! ¿Salimos al encuentro de los demás para llevarles el fuego de la caridad, o nos quedamos encerrados para calentarnos ante nuestra chimenea? Que la sonrisa simple y pura de María sea fuente de alegría para todos nosotros ante las dificultades de la vida. Trabajemos juntos para que los niños puedan mirarnos sonriendo y conserven una mirada limpia, llena de confianza y esperanza. #WorldChildrensDay En esta Jornada, invito a toda la Iglesia a acoger a cuantos nos tienden las manos clamando ayuda y pidiendo nuestra solidaridad. Sin el apoyo de la oración de los fieles, el Sucesor de Pedro no puede cumplir su misión en el mundo. ¡Cuento también con ustedes! Es preciso salir al encuentro de los pobres y aprender a compartir, de forma que este sea nuestro estilo de vida. La miseria no es inevitable: tiene causas que hay que detectar y eliminar, para honrar la dignidad de muchos hermanos y hermanas nuestros. La fe es una gran compañera de vida: nos permite sentir en primera persona la presencia de un Padre que nunca deja solas a sus criaturas. Nada ni nadie puede oscurecer la luz que Cristo pone en el corazón y en el rostro de sus amigos. ¡El cristiano jamás puede ser pesimista! No podemos cambiar el mundo solos; pero juntos podemos sembrar la alegría del Evangelio estando junto a los más débiles. Recordemos en la oración a todos aquellos que, con dedicación y espíritu de sacrificio, cuidan a las personas enfermas. La ciencia alcanza su plena dignidad cuando sirve al desarrollo integral de la persona y de la familia humana. ¡Difundamos una cultura del encuentro capaz de derribar los muros que aún dividen el mundo! Solo la fe puede transformar el final de la vida terrena en el inicio de la vida eterna. Jesús de Nazaret camina con nosotros para introducirnos, con su palabra y sus gestos, en el profundo misterio del amor del Padre. La guerra causa siempre graves daños al ambiente. No maltratemos nuestra casa común, protejámosla para las generaciones futuras. Cristo ha vencido la muerte: Él es nuestra resurrección y nuestra vida. Sean testigos de este mensaje de esperanza. La Iglesia necesita personas que anuncien el Evangelio con entusiasmo y sabiduría, que enciendan la esperanza y generen la fe. Cuando se reza es necesaria la valentía de la fe: ¡Tengan confianza, el Señor nos escucha! Todos somos pequeños ante el misterio de la muerte. Pero ¡qué gracia si en ese momento custodiamos en el corazón la llama de la fe! Queridos amigos, el mundo necesita santos, y todos nosotros, sin excepción, estamos llamados a la santidad. ¡No tengan miedo! Que la Virgen María nos ayude a dar el primer paso cada día para construir la paz en el amor, la justicia y la verdad. Aprende de la maravilla, cultiva el asombro. Vive, ama, cree. Y, con la gracia de Dios, no desesperes nunca. Les invito a tener la mirada fija en el Señor Jesucristo, para aprender de Él a amar con todo el corazón. Lleva en tu corazón los sufrimientos de cada ser humano, y en la oración llévalos todos a Dios. Dios nos ama con un amor tan rico de misericordia como para acogernos, custodiarnos y perdonarnos continuamente. “Cultura del encuentro” significa saber que, más allá de nuestras diferencias, somos todos hijos de Dios. Sean testigos valientes de Cristo en el ambiente concreto en el que viven y trabajan. Trabajemos todos juntos para promover la paz entre los pueblos y garantizar el respeto de los derechos humanos. Jesús nos ha entregado una luz que brilla en las tinieblas: defiéndela, protégela. Es la riqueza más grande confiada a tu vida. Hoy, memoria de San Juan Pablo II, recordamos sus palabras: “¡No tengáis miedo! ¡Abrid, abrid de par en par las puertas a Cristo!” En esta jornada, recordemos que la Iglesia es misionera por naturaleza: la misión está en el corazón de la fe cristiana. #Missio #Domund La Iglesia está viva de verdad si es materna, misionera y sale al encuentro del prójimo. Llevemos la llama del amor de Cristo a la humanidad, que tiene mucha necesidad de felicidad verdadera y de paz. Déjate guiar por la ternura divina, para que puedas cambiar el mundo mediante tu fe. Que los artistas puedan ilustrar la belleza de la fe y proclamar la grandeza de la creación de Dios y su amor sin límites por todos. La familia humana tiene el deber de ayudar a toda persona a liberarse de la pobreza y del hambre. Para compartir es necesaria la conversión, y esto requiere esfuerzo. #ZeroHunger Hemos de responder al imperativo de que el acceso al alimento necesario es un derecho de todos, ¡un derecho que no admite exclusiones! Como los santos, mostremos la alegría y la belleza del Evangelio con el testimonio de nuestra vida. Estamos llamados a defender y custodiar la vida humana, especialmente en el seno materno, en la infancia, la vejez y la discapacidad. En el centenario de las apariciones de la Virgen en Fátima, agradecemos a Dios las innumerables bendiciones concedidas por su mediación. La Virgen de Aparecida fue encontrada por pobres trabajadores. Que hoy bendiga a todos, especialmente a quienes buscan trabajo. Como san Juan XXIII, a quien recordamos hoy, demos testimonio a la Iglesia y al mundo de la bondad y la misericordia de Dios. ¡Dios no desilusiona! Ha puesto una esperanza en nuestros corazones para hacerla germinar y dar fruto. La búsqueda de la paz es un trabajo siempre abierto, una tarea sin descanso que exige el compromiso de todos. Si la amargura te asalta, cree en todas las personas que aún trabajan para el bien: en su humildad se esconde la semilla de un mundo nuevo. El Rosario es una síntesis de los misterios de Cristo: los contemplamos junto a María, que nos dona su mirada de fe y de amor. Hagamos que Internet sea un lugar rico de humanidad y seguro para los menores, una red que no aprisiona sino que ayuda a crecer. La misión de la escuela y de los maestros es desarrollar en los alumnos el sentido de la verdad, del bien y de la belleza. Como San Francisco de Asís, dejémonos transformar por el amor de Cristo para vivir con pobreza y alegría. Solo en el silencio de la oración se puede aprender a escuchar la voz de Dios. El ángel custodio es un amigo que no vemos, pero que podemos escuchar. Nos acompaña en el camino de la tierra al Cielo. Como santa Teresita del Niño Jesús, aprendamos de la humildad de Dios, que se hizo pequeño por nosotros. En nuestro tiempo hay mucha necesidad de rezar —cristianos, judíos y musulmanes— por la paz. Este es el tema de la Jornada de las Comunicaciones Sociales 2018: \"La verdad os hará libres\" (Jn 8,32). Noticias falsas y periodismo de paz Hoy es la Fiesta de los Arcángeles Miguel, Gabriel y Rafael.  Pidámosles que en todo momento nos recuerden la presencia de Dios. Encontrar a Jesús puede cambiar decisivamente nuestra vida, llenándola de significado. #ShareJourney https://t.co/XxVcRzE5Ul Compartamos sin miedo el camino de los migrantes y los refugiados. #ShareJourney Trabajemos por un mundo sin armas nucleares, aplicando el Tratado de no proliferación para abolir estos instrumentos de muerte. La caridad es más verdadera e incisiva si se vive en la comunión. ¡La alegría se multiplica compartiéndola! Si somos fieles a Cristo y obramos el bien podemos difundir la luz de la esperanza de Dios. El Evangelio invita antes que nada a responder a Dios que nos ama y que nos salva, reconociéndolo en el prójimo. Dirijo un llamamiento en favor de la paz y del desarme: en este mundo herido por la violencia, necesitamos de la hermandad entre pueblos. La esperanza es la virtud de un corazón que no se encierra en la oscuridad, no se detiene ante el pasado, sino que sabe mirar al futuro. Trabajemos todos para encontrar soluciones para los pobres, los refugiados, las víctimas de las esclavitudes modernas y para promover la paz Tengamos el valor de purificar nuestro corazón quitando las piedras y las espinas que sofocan la Palabra de Dios. Cuánto más Jesús ocupa el centro de nuestra vida, más nos hace salir de nosotros mismos para acercarnos a los hermanos. Necesitamos una acción global para afrontar al mismo tiempo la reducción de la contaminación y el desarrollo de los países pobres. El Señor no nos dejó huérfanos: tenemos una Madre, la misma de Jesús. María nos cuida y nos defiende siempre. En la cruz renace siempre nuestra esperanza. Es una esperanza diferente de las del mundo, porque nace del amor de Jesús. La guerra es la negación de todos los derechos. Oremos por quienes tienen la responsabilidad de evitar la guerra entre los pueblos. Animo a los líderes del mundo a que dejen de lado los intereses sectoriales para buscar juntos el bien común de la humanidad. Queridos hermanos colombianos, muchas gracias. He conocido a tantas personas que me han tocado el corazón. Ustedes me han hecho mucho bien. «Dar el primer paso» es, sobre todo, salir al encuentro de los demás con Cristo, el Señor. La caridad ayuda a comprender la verdad y la verdad reclama gestos de caridad. Nuestra alegría contagiosa tiene que ser el primer testimonio de la cercanía y del amor de Dios. Hoy son muchos los que tienen hambre de Dios, hambre de dignidad. Y, como cristianos, hemos de ayudarles a que se sacien de Dios. La verdad es compañera inseparable de la justicia y de la misericordia. La reconciliación se consolida con el aporte de todos, permite construir el futuro y hace crecer la esperanza. Queridos jóvenes, no teman el futuro ¡Atrévanse a soñar a lo grande! Mantengan viva la alegría, signo del corazón que encontró al Señor. Los animo a afianzarse en el Señor: es el único que nos sostiene y alienta para poder contribuir a la reconciliación y a la paz. Queridos amigos, por favor rueguen por mí y por toda Colombia donde iré de viaje en búsqueda de la reconciliación y la paz en ese país. Así como Madre Teresa, abramos horizontes de alegría y de esperanzas para tanta humanidad desconfiada y necesitada de comprensión y ternura. Jesús está presente en muchos de nuestros hermanos y hermanas que hoy sufren como Él. Es más importante darnos cuenta de cuánto somos amados por Dios, que saber cuánto lo amamos. Jesús está siempre allí, con el corazón abierto: se reconoce en la misericordia que está en el corazón, perdona, abraza y entiende. Señor, enséñanos a contemplarte en la belleza de la Creación y despierta nuestra gratitud y nuestro sentido de responsabilidad. Si estás atento al corazón, te descubrirás cerca del Señor y de los demás. El Evangelio invita ante todo a responder a Dios, que nos ama y nos salva, reconociéndolo en el prójimo. “Nos creaste para ti, Señor, y nuestro corazón andará siempre inquieto mientras no descanse en ti” (San Agustín, Confesiones I, 1). ¡Cuántas mamás vierten lágrimas, como santa Mónica, para que los sus hijos regresen a Cristo! ¡No pierdan la esperanza en la gracia de Dios! Que la Virgen nos obtenga la gracia de estar animados por el Espíritu Santo, para dar testimonio de Cristo con franqueza evangélica. Ser hombres y mujeres de la Iglesia significa ser hombres y mujeres de comunión. Los hombres necesitan esperanza para vivir, y necesitan del Espíritu Santo para esperar. El Señor está cerca de cuantos son víctimas de antiguas y nuevas esclavitudes: trabajos inhumanos, tráficos ilícitos, explotación. Cuando estemos un poco tristes, cuando parezca que todo va mal, pensemos: “Dios me ama; Dios no me abandona”. Que el Espíritu Santo done paz al mundo entero y sane las llagas de la guerra y del terrorismo. Necesitamos mucho redescubrir siempre el amor y la misericordia del Señor para desarrollar la familiaridad con Dios. Rezo por todas las víctimas de los atentados de estos días. ¡Que la violencia ciega del terrorismo no encuentre lugar en el mundo! ¡Que nada les impida crecer en amistad con el Padre celestial y testimoniar a todos su bondad y misericordia infinitas! La Asunción de María atañe a nuestro futuro: nos hace mirar al cielo, anuncia los cielos nuevos y la tierra nueva, con la victoria de Cristo El camino para encomendarse al Señor recomienza todos los días, desde la mañana en adelante. En María vemos que la humildad no es la virtud de los débiles sino de los fuertes, que no maltratan a otros para sentirse importantes. Queridos jóvenes, ustedes son la esperanza de la Iglesia. ¿Con qué futuro sueñan? ¡Participen en el #Sínodo18!  https://t.co/h1m4oNNCDH Cuando algo nos haga sufrir, escuchemos la voz del Señor en el corazón: “¡No tengas miedo, sigue adelante! ¡Yo estoy contigo!”. Jesús no nos deja solos porque cada uno de nosotros es precioso para Él. En el testimonio de la fe no cuentan los éxitos, sino la fidelidad a Cristo. Hoy damos gracias al Padre por la obra que santo Domingo cumplió al servicio del Evangelio, predicado con la palabra y con la vida. El perdón libera el corazón y le permite recomenzar: el perdón da esperanza, sin perdón no se construye la Iglesia. La esperanza es la virtud del corazón que no se cierra en la oscuridad, no se detiene en el pasado, sino que sabe ver el mañana. El otro es un don que hemos de acoger con respeto, porque en él, especialmente si es débil y frágil, Cristo sale a nuestro encuentro. ¡En nombre de Jesús podemos demostrar con nuestro testimonio que la paz es posible! El Evangelio es la Buena Nueva que trae consigo una alegría contagiosa, porque contiene y ofrece una vida nueva. El bien se cumple y es eficaz sobre todo cuando se hace sin buscar recompensa, en las situaciones concretas de la vida cotidiana. Como san Ignacio de Loyola, dejemos que el Señor Jesús nos conquiste y, guiados por Él, pongámonos al servicio del prójimo. Hago un llamamiento a todas las personas de fe y de buena voluntad para que luchen contra la esclavitud moderna en todas sus formas. Encomiendo el pequeño Charlie al Señor, y rezo por sus padres y por todas las personas que lo amaron. ¡Qué importantes son los abuelos en la vida de la familia,  para comunicar el patrimonio de humanidad y de fe esencial para toda sociedad! Cuando necesitemos ayuda, dirijámonos al Padre, que siempre nos mira con amor y no nos abandona nunca. Es necesario superar todas las formas de racismo, intolerancia e instrumentalización de la persona humana. Dejemos que la Virgen María nos guíe por el sendero que conduce a la santa montaña que es Cristo, donde se encuentran Dios y el hombre. Europa tiene un patrimonio moral y espiritual único en el mundo, que merece ser propuesto una vez más con pasión y renovada vitalidad. Encomiendo a los marineros, a los pescadores y a cuantos se encuentran lejos de casa, a la protección maternal de María, Estrella del mar. Los emigrantes son nuestros hermanos y hermanas que buscan una vida mejor lejos de la pobreza, del hambre y de la guerra. ¡Qué bueno es que los jóvenes sean «callejeros de la fe», felices de llevar a Jesús a cada calle, a cada rincón de la tierra! La misión del cristiano en el mundo es una misión estupenda, una misión destinada a todos, sin excluir a nadie. Es muy necesario alimentar la esperanza cristiana, esa esperanza que da una mirada nueva, capaz de descubrir y ver el bien. Nos confiamos a la intercesión de los santos Pedro y Pablo para convertirnos en testigos de la acción liberadora de Dios sobre nosotros. Dios posa su mirada amorosa sobre cada uno de nosotros. Agucen la vista para ver los signos de Dios presentes en la realidad. Reafirmo la enérgica condena de toda forma de tortura, e invito a todos a trabajar por su abolición y a apoyar a las víctimas. Cada uno de nosotros es precioso, cada uno de nosotros es insustituible a los ojos de Dios. La misericordia calienta el corazón y lo hace sensible a las necesidades de los hermanos, a través del compartir y de la participación. ¡Vayan, lleguen a todas las periferias! Vayan y sean allí Iglesia, con la fuerza del Espíritu Santo. No dejemos que las falsas sabidurías de este mundo nos desvíen; sigamos a Jesús como única guía segura que da sentido a nuestra vida. No miremos para otro lado ante las nuevas formas de pobreza y marginación que impiden a las personas vivir dignamente. El encuentro personal con los refugiados disipa miedos e ideologías distorsionadas, y ayuda a crecer en humanidad. @M_RSeccion Nadie es una isla, autónomo e independiente de los demás: solamente podemos construir el futuro juntos, sin excluir a nadie. Jesús se ha dejado «partir», se parte por nosotros. Es la Eucaristía. Y pide que nos demos, que nos partamos por los demás. La preocupación por la ecología es siempre también una preocupación social. Escuchemos el grito de la tierra pero también el de los pobres. El amor pide una respuesta creativa, concreta. No bastan los buenos propósitos: los demás no son números, sino hermanos que hemos de cuidar. La existencia de cada uno de nosotros está ligada a la de los demás: la vida no es tiempo que pasa, sino tiempo de encuentro. Tenemos mucha necesidad de oración y de penitencia para implorar la gracia de la conversión y el final de las guerras en el mundo. En su Pasión, Jesús cargó con todos nuestros sufrimientos. Él sabe lo que significa el dolor, nos comprende, nos consuela y nos da fuerza. La Iglesia resplandece cuando es misionera, acogedora, libre, fiel, pobre de medios y rica de amor. La fiesta de la Santísima Trinidad nos invita a ser fermento de comunión, de consolación y de misericordia. La vida solo puede sobrevivir gracias a la generosidad de otra vida. Cada uno de nosotros, como miembro vivo del Cuerpo de Cristo, está llamado a promover la unidad y la paz. La humildad y la ternura no son virtudes de los débiles sino de los fuertes. La Iglesia necesita santos de todos los días: los de la vida ordinaria llevada adelante con coherencia. Recordemos siempre que nuestra fe es concreta: ¡el Verbo se hizo carne, no se hizo idea! No olvidemos nunca que el medio ambiente es un bien colectivo, patrimonio de toda la humanidad y responsabilidad de todos. Dejémonos guiar con docilidad por el Espíritu Santo para no equivocarnos de camino y no caer en la cerrazón del corazón. Promovamos con valor todos los medios necesarios para proteger la vida de los niños. En la oscuridad de los conflictos que estamos atravesando, seamos velas encendidas que recuerdan que la luz prevalece sobre las tinieblas. Doy gracias a Dios por los padres que tratan de vivir en el amor y siguen adelante aunque caigan muchas veces a lo largo del camino. Aprendamos de la fe recia y servicial de nuestra Madre María, a fin de que lleguemos a ser signos vivos de la misericordia de Dios. La alegría cristiana proviene del Espíritu Santo, que nos da la verdadera libertad y el don de llevar a Jesús a los hermanos. La presencia materna de María nos recuerda que Dios nunca se cansa de inclinarse con misericordia sobre la humanidad. Invito a todos a una comunicación constructiva que rechace los prejuicios hacia el otro y transmita esperanza y confianza en nuestro tiempo. Oremos juntos por nuestros hermanos cristianos coptos de Egipto que han sido asesinados porque no han querido renegar de la fe. El futuro de nuestras sociedades requiere una atención concreta a la vida por parte de todos, especialmente por parte de las instituciones. En la Ascensión de Jesús está la promesa de nuestra participación en la vida junto a Dios.Llevémosla en el corazón por los caminos del mundo Oremos con los católicos de China, encomendémonos a María para obtener la gracia de soportar y vencer las dificultades con paciencia y amor. Mediante el diálogo se puede proyectar un futuro compartido: a través del diálogo construimos la paz, cuidando de todos. Estamos llamados a vivir no los unos sin los otros, por encima o contra los demás, sino los unos con los otros, por los otros y en los otros María nos enseña a esperar en Dios incluso cuando nada parece tener sentido, incluso cuando parece que Él está escondido. La paz debe construirse sobre la justicia, el desarrollo humano integral, el respeto de los derechos humanos, la custodia de la creación. Intentemos mantener siempre alto el «tono» de nuestra vida, recordando por qué inmenso premio existimos, trabajamos, luchamos y sufrimos. Dios hace crecer sus flores más hermosas en medio de las piedras más áridas. Nuestra esperanza es el Señor Jesús que reconocemos vivo y presente en nosotros y en nuestros hermanos. Jesús nos pide que se le mire, que se le reconozca y que se le ame. Para seguir fielmente a Jesús, pedimos la gracia de hacerlo no de palabra sino con los hechos, y de llevar nuestra cruz con paciencia. Pidamos juntos el don de la comprensión de la Palabra de Dios. Fátima es el manto de Luz que nos cubre cuando nos refugiamos bajo la protección de la Virgen Madre para pedirle: muéstranos a Jesús. Cada vez que miramos a María volvemos a creer en la fuerza revolucionaria de la ternura y del cariño. Aquí en Fátima alabo a Cristo, nuestra paz, y le imploro para el mundo la concordia entre todos los pueblos. Pido a todos ustedes que se unan a mí como peregrinos de la esperanza y de la paz: que sus manos en oración continúen sosteniendo las mías. Mañana estaré con María en Fátima, como peregrino en la esperanza y en la paz. Mirémosla: todo es don de Dios, nuestra fuerza. Dios es más grande que la muerte, y basta solo una vela encendida para vencer la más oscura de las noches. Todos tienen una aportación que ofrecer al conjunto de la sociedad, nadie está excluido de aportar algo para el bien de todos. Jesús, que ha vencido las tinieblas del pecado y de la muerte, dé paz a nuestros días. Dejémonos provocar por las palabras y los gestos de Jesús, recibamos de Él una vida plenamente humana, dichosa de gastarse amando. Alégrate porque tu vida esconde un germen de resurrección, una oferta de vida que espera despertar. A través de los tiempos, el Resucitado no se cansa de buscarnos a nosotros, sus hermanos perdidos en los desiertos del mundo. Dejémonos sorprender por la novedad que sólo Cristo puede dar. Dejemos que su ternura y su amor muevan nuestros pasos. Que nuestra actitud sea siempre pacífica y humilde, atenta al cuidado de los pobres. Hagamos crecer la fraternidad y el intercambio: la colaboración es lo que ayuda a construir sociedades pacíficas y mejores. San José, pide al Señor para los jóvenes la capacidad de soñar, de arriesgar por las cosas grandes que Dios sueña para nosotros. Con su resurrección, Jesucristo nos ha liberado de la esclavitud del pecado y de la muerte, y nos ha abierto el camino a la vida eterna. La presencia de Jesús se transmite con la vida, y habla el lenguaje del amor gratuito y concreto. Que el Señor nos conceda hoy seguir caminando juntos, como peregrinos de comunión y anunciadores de paz. Estamos llamados a caminar juntos con la convicción de que el futuro de todos depende también del encuentro entre religiones y culturas. Por favor, recen por mi viaje de mañana a Egipto como peregrino de paz. Promovamos la amistad y el respeto entre hombres y mujeres de diferentes tradiciones religiosas para construir un mundo en paz. Murió, fue sepultado, resucitó y se apareció. Es decir, ¡Jesús está vivo! Este es el núcleo del mensaje cristiano. Si tuviéramos siempre la Palabra de Dios en el corazón, ninguna tentación podría alejarnos de Él. Pidamos la gracia de no cansarnos nunca de tomar de Jesús la misericordia del Padre y de llevarla al mundo. La misericordia de Dios es eterna; no termina, no se agota, no se rinde ante la cerrazón y no se cansa jamás. Señor, sana nuestras vidas para que protejamos el mundo y no lo depredemos, para que sembremos belleza y no contaminación y destrucción. Cuando hemos tocado el fondo de nuestra miseria y de nuestra debilidad, Cristo resucitado nos da la fuerza para volvernos a levantar. Si Cristo ha resucitado, podemos mirar con ojos y corazón nuevos todos los eventos de nuestra vida, también los más negativos. Meditemos con estupor y gratitud el gran misterio de la resurrección del Señor. Durante esta semana de Pascua, nos hará bien leer cada día un pasaje del Evangelio en el que se habla de la Resurrección de Cristo. ¡Sí, tenemos la certeza: Cristo verdaderamente ha resucitado! ¡Feliz Pascua! ¡Lleven a todos la alegría y la esperanza de Cristo Resucitado! https://t.co/GC5WyTvNuR Hoy es la fiesta de nuestra esperanza, la celebración de esta certeza: nada ni nadie nos podrá apartar nunca del amor de Dios. Oh, Cruz de Cristo, enséñanos que la aurora del sol es más fuerte que la oscuridad de la noche, y que el amor eterno de Dios vence siempre. https://t.co/Qu5dYLDuPc Nos hace bien salir de nuestros encierros, porque lo propio del Corazón de Dios es desbordar de misericordia, esparciendo su ternura. Si el misterio del mal es abismal, infinita es la realidad del Amor de Dios que lo ha atravesado y lo ha vencido. Jesús viene a salvarnos, y estamos llamados a elegir su vía: la vía del servicio, del don, del olvido de sí mismo. En esta Semana Santa, dirijamos la mirada a Jesús y pidamos la gracia de comprender mejor el misterio de su sacrificio por nosotros. ¡Oh Cruz de Cristo, suscita en nosotros el deseo de Dios, del Bien y de la Luz! ¡Queridos jóvenes, no tengan miedo de decir “sí” a Jesús con todo el corazón, de responderle con generosidad y de seguirlo! La Cuaresma es un periodo de penitencia destinado a hacernos resurgir con Cristo, a renovar nuestra identidad cristiana. La esperanza abre al creyente a las sorpresas de Dios. Tratemos de seguir las huellas de Cristo concretamente, dedicándonos a los hermanos y hermanas necesitados. Hoy es la Jornada Mundial contra las minas antipersona. ¡Renovemos, por favor, el compromiso por un mundo sin minas! La Cuaresma es, por su naturaleza, tiempo de esperanza porque nos conduce a renacer nuevamente “desde lo alto”, desde el amor de Dios. Cuando el Espíritu Santo habita en nuestros corazones, nos hace comprender que el Señor está cerca y nos cuida. Incluso en los momentos más duros y sobrecogedores, la misericordia y la bondad del Señor son mayores que cualquier cosa. Ayunar con un corazón orgulloso hace más mal que bien. El primer ayuno es la humildad. La oración es potente, la oración vence el mal, la oración trae la paz. La paz que brota de la fe es un don: es la gracia de experimentar que Dios nos ama y que está siempre a nuestro lado. ¡Si aprendemos a leer todo con la luz del Espíritu Santo, nos daremos cuenta de que todo es gracia! Custodiar el sacro tesoro de toda vida humana, desde la concepción hasta el final, es el mejor modo de prevenir cualquier forma de violencia La Cuaresma es el momento favorable para intensificar la vida del espíritu mediante el ayuno, la oración y la limosna. La Palabra de Dios es una fuerza viva, capaz de suscitar la conversión en el corazón de los hombres. Recordamos a los numerosos hermanos y hermanas cristianos que sufren persecuciones a causa de su fe. Estamos unidos a ellos. El ayuno es fecundo si va acompañado del amor concreto por el prójimo, especialmente por quien padece dificultades. Que la certeza de la fe sea el motor de nuestra vida. Aunque somos hombres de poca fe, el Señor nos salva. ¡Esperemos siempre en el Señor! Es urgente sembrar el bien: cultivar la justicia, acrecentar la concordia, sostener la integración, sin cansarse nunca. Que san José, esposo de María y patrono de la Iglesia Universal, os bendiga y os custodie. ¡Y muchas felicidades a los papás! Los invito a no crear muros sino puentes, a vencer el mal con el bien, la ofensa con el perdón, a vivir en paz con todos. El ayuno no consiste tan solo en renunciar al alimento, sino también a todo apego morboso, y sobre todo al pecado. La Iglesia quiere estar cerca de todas las personas con el amor, la compasión y el consuelo que provienen de Cristo. La Palabra de Dios nos ayuda a abrir los ojos para acoger la vida y amarla, especialmente cuando es débil. Oremos los unos por los otros para que sepamos abrir nuestras puertas al débil y al pobre. Que el Espíritu Santo nos guíe para recorrer un verdadero camino de conversión, para redescubrir el don de la Palabra de Dios. La Cuaresma es el tiempo favorable para renovarnos encontrando a Cristo vivo en su Palabra, en los Sacramentos y en el prójimo. El camino que lleva del amor al odio es fácil; el que lleva del odio al amor es más difícil, pero conduce a la paz. En esta Cuaresma tratemos de ayunar con una sonrisa, no con una cara larga. Les pido por favor que, en la oración, se acuerden de mí y de mis colaboradores; hasta el viernes haremos los Ejercicios Espirituales. Jesús es el amigo fiel que nunca nos abandona: incluso cuando pecamos, espera con paciencia que regresemos a Él. La Cuaresma nos dirige una fuerte llamada a la conversión: el cristiano está llamado a volver a Dios de todo corazón. Ayunar no es sólo privarse del pan; también es compartir el pan con el hambriento. Dios nos es siempre fiel y no deja ni un instante de amarnos, de acompañar nuestros pasos y de seguirnos cuando nos alejamos un poco. La Cuaresma es un nuevo comienzo, un camino que nos lleva a un destino seguro: la Pascua de Resurrección, la victoria de Cristo. La oración es la llave que abre el corazón misericordioso de Dios. Cuando nuestro camino está marcado por la precariedad y las caídas, Dios, rico en misericordia, tiende su mano para levantarnos. Perseveremos en la oración, a fin de que se cumpla el deseo de Jesús: “Que todos sean uno”. Anunciando a todos el amor y la ternura de Jesús nos hacemos apóstoles de la alegría del Evangelio. ¡Y la alegría es contagiosa! En el corazón del cristiano siempre hay alegría, siempre: la alegría acogida como un don y custodiada para compartirla con todos. No subestimemos el valor del ejemplo, porque tiene más fuerza que mil palabras, que miles de “likes” o “retweets”, que mil vídeos en Youtube Jesús confió a Pedro las llaves para que abriera la entrada del Reino de los cielos, no para que la cerrase. Dios sabe mejor que nosotros lo que necesitamos; hemos de fiarnos de Él, porque sus caminos son muy diferentes de los nuestros. Si el mal es contagioso, lo es también el bien. ¡Dejémonos contagiar por el bien y contagiemos el bien! El Espíritu Santo nos empuja a buscar con valor caminos nuevos para anunciar el Evangelio. ¡Cuántas veces en la Biblia el Señor nos pide que acojamos a migrantes y forasteros, recordándonos que también nosotros somos forasteros! Un corazón joven no soporta la injusticia y no puede doblegarse a la cultura del descarte, ni ceder a la globalización de la indiferencia. Les invito a luchar contra la pobreza, tanto material como espiritual. Edifiquemos juntos la paz y construyamos puentes entre las personas. La cultura del descarte no es de Jesús. El otro es mi hermano, más allá de cualquier barrera de nacionalidad, extracción social o religión. Es bello saber que el Señor se hace cargo de nuestras debilidades, nos pone en pie con paciencia y nos da la fuerza para recomenzar. ¡No pongamos nunca condiciones a Dios! Fiarse del Señor quiere decir entrar en sus designios sin pretender nada. La dignidad de los niños debe ser respetada: pidamos que sea eliminada la esclavitud de los niños-soldado en todo el mundo. Deseo animarles a contemplar en Santa María, Salud de los enfermos, la garante de la ternura de Dios por todo ser humano. Estemos cerca de los hermanos y hermanas que viven la experiencia de la enfermedad, y también de sus familias. La esperanza abre nuevos horizontes, nos hace capaces de soñar aquello que no es ni siquiera imaginable. Quien favorece la trata de personas es responsable ante Dios. Oremos por la conversión de los corazones. @M_RSeccion Escuchemos el grito de tantos niños esclavizados. Que nadie sea indiferente a su dolor. @M_RSeccion Llegar a ser creyentes significa aprender a ver con los ojos de la fe. Quien no cree o no busca a Dios quizá no haya sentido esa inquietud porque le ha faltado un testimonio. ¡Actúa! ¡Vive! Y ante tu vida, ante tu testimonio, alguien te preguntará: ¿Por qué vives así? No nos olvidemos nunca de rezar los unos por los otros. La oración es nuestra mayor fuerza. La vida consagrada es un gran don de Dios: don de Dios a la Iglesia, don de Dios a su pueblo. Dios desea que todos los hombres se reconozcan hermanos y vivan como tales, formando la gran familia humana en la armonía de la diversidad. Imitemos la actitud de Jesús hacia los enfermos: Él cuida a todos, comparte sus sufrimientos y abre el corazón a la esperanza. Nada es imposible si nos dirigimos a Dios mediante la oración. Todos podemos ser constructores de la paz. Señor, Dios de paz, escucha nuestra súplica y concédenos la paz en Tierra Santa. ¡Shalom, salaam, paz! El Reino de Dios está ya en medio de nosotros como una semilla escondida. Quien tiene ojos puros es capaz de verlo germinar. Hoy deseo recordar con el corazón a todas las víctimas del holocausto. ¡Que sus sufrimientos y sus lágrimas no sean olvidados nunca! La esperanza hace germinar la vida nueva como la planta crece de la semilla caída sobre la tierra. Me gusta repetir que la unidad de los cristianos se realiza caminando juntos, con el encuentro, la oración y el anuncio del Evangelio. Ofrezcamos a los hombres y mujeres de nuestro tiempo narraciones caracterizadas por la lógica de la “buena noticia”. https://t.co/uy66I8tOkP «No temas, porque yo estoy contigo» - ¡Comuniquemos esperanza y confianza en nuestro tiempo! La unidad de amor se realiza cuando anunciamos juntos las maravillas que Dios ha hecho por nosotros. Con Santo Domingo \"vamos adelante, con alegría, pensando en nuestro Salvador.\" #OP800 La unidad de los cristianos no es el fruto de nuestros esfuerzos humanos, sino un don que viene de lo alto. Invocamos la unidad de los cristianos porque invocamos a Cristo. Queremos vivir la unidad porque queremos seguir a Cristo y vivir su amor. La exigencia de estar unidos en Cristo nace de lo más profundo de nuestra fe en Él. La paz es una «virtud activa», que requiere el compromiso y la cooperación de cada persona y de todo el cuerpo social en su conjunto. No podrá haber nunca verdadera paz mientras quede un solo ser humano al que se le vulnere la propia identidad personal. Que la Sagrada Familia vele sobre todos los migrantes menores de edad, y acompañe en su camino a los más vulnerables y sin voz. @M_RSeccion Explotadores sin escrúpulos dañan a tantos niños, tratados como mercancía y esclavizados. Dios bendiga a quienes los liberan. @M_RSeccion Los niños obligados a huir de los conflictos son los más indefensos, sobre todo si están solos. Recemos por ellos y ayudémosles. @M_RSeccion Los migrantes menores de edad, especialmente los que están solos, se encuentran desprotegidos. Ayudémosles, hagámonos cargo de ellos. Todos podemos contribuir a dar vida a una cultura de la misericordia, en la que nadie mire al otro con indiferencia. Espero que durante este año crezcan en nuestros países y en sus pueblos las oportunidades para trabajar juntos y construir una paz verdadera No puede haber verdadera paz si cada uno reivindica siempre y sólo su propio derecho, sin preocuparse del bien de los demás. Que la Virgen María nos ayude a seguir a Jesús por la vía de la fe y la caridad, la vía trazada por nuestro bautismo. Recordamos a los hermanos y hermanas del Oriente cristiano, católicos y ortodoxos, que hoy celebran la Santa Navidad. Como los Magos, también nosotros caminamos atentos, incansables y valerosos para encontrar a Dios que ha nacido por nosotros. Que la caridad y la no violencia guíen el modo en que nos tratamos los unos a los otros. Ser hoy verdaderos discípulos de Jesús significa también aceptar su propuesta de no violencia. Que la no violencia se transforme en el estilo característico de nuestras decisiones, de nuestras relaciones, de nuestras acciones. Al comienzo de este nuevo año formulo mis más sinceros deseos de paz para los pueblos y para las naciones del mundo. Encomendemos el nuevo año a María Santísima, Madre de Dios, para que crezcan la paz y la misericordia. Al final del año, recordamos los días, las semanas, los meses que hemos vivido, para agradecer y ofrecer todo al Señor. Sagrada Familia de Nazaret, haced que todos tomen conciencia del carácter sagrado de la familia, de su belleza en el proyecto de Dios. Dejémonos tocar por la ternura que salva. Acerquémonos a Dios que se hace cercano, detengámonos a mirar el belén. Dios, enamorado de nosotros, nos atrae con su ternura, naciendo pobre y frágil en medio de nosotros, como uno más. La Navidad tiene sobre todo un sabor de esperanza porque, a pesar de nuestras tinieblas, la luz de Dios resplandece. En la fiesta de San Esteban, recordemos a los mártires de ayer y de hoy. Venzamos el mal con el bien, el odio con el amor. ¡Cristo ha nacido por nosotros, exultemos en el día de nuestra salvación! Que nuestros ojos puedan llenarse de maravilla, como los de los pastores de Belén,  contemplando en el Niño Jesús al Hijo de Dios. El Señor se hace hombre para caminar con nosotros en la vida de cada día. Se acerca el nacimiento de Jesús, que viene a hacerse cargo de nuestra debilidad. La misericordia suscita alegría porque el corazón se abre a la esperanza de una vida nueva. La misericordia es la acción concreta del amor de Dios que, perdonando, transforma y cambia la vida. Nada de cuanto un pecador arrepentido coloca delante de la misericordia de Dios queda sin el abrazo de su perdón. Deseo expresar mi solidaridad con los migrantes, y doy las gracias a todos los que los ayudan: ¡Acoger al otro es acoger a Dios en persona! Nuestra alegría proviene de la certeza de que el Señor está cerca con su ternura, su misericordia, su perdón y su amor. Les agradezco mucho su afecto. No se olviden de rezar por mí. El perdón es el signo más visible del amor del Padre que Jesús ha querido revelar a lo largo de toda su vida. El amor de Dios, que sabe leer el corazón de cada persona para comprender su deseo más escondido, debe tener el primado sobre todo. Es el momento de dejar paso a la fantasía de la misericordia para dar vida a tantas iniciativas nuevas, fruto de la gracia. Hoy quisiera que cada uno de nosotros recordase su propia historia y los dones que ha recibido del Señor. En la festividad de Nuestra Señora de Guadalupe, le confiamos la vida de los pueblos americanos y la misión continental de la Iglesia. Que el Adviento sea un tiempo de esperanza. Salgamos al encuentro del Señor que viene a visitarnos. Trabajemos todos con decisión para que nadie sea excluido del reconocimiento efectivo de los derechos fundamentales de la persona humana. Oremos por todas las víctimas de los genocidios y trabajemos para que estos crímenes no sucedan nunca más en el mundo. Aprendamos de la Virgen María a tener un corazón humilde y capaz de acoger los dones de Dios. La Iglesia no crece mediante el proselitismo, sino por atracción. Jesús ha dado sentido a mi vida aquí en la tierra, y me da esperanza para la vida futura. Jesús enseña a ir siempre a lo esencial y a asumir con responsabilidad la propia misión. El Adviento es un tiempo para preparar nuestros corazones a acoger a Cristo Salvador, nuestra esperanza. Estamos todos invitados a salir como misioneros para llevar el mensaje del amor de Dios a cada persona en todos los ambientes. Invito a todas las personas de buena voluntad a actuar contra el tráfico de personas y las nuevas formas de esclavitud. Recordamos hoy al Beato Charles de Foucauld, que decía: la fe es ver a Jesús en cada ser humano. Hoy es la fiesta del apóstol Andrés: envío mi afecto fraterno al Patriarca Bartolomeo y rezo por él y la Iglesia que le ha sido confiada. Jesús nos llama a ser portadores de alegría y de consuelo, como testigos suyos misericordiosos. La misericordia no es un paréntesis en la vida de la Iglesia, sino que constituye su misma existencia  y hace tangible el Evangelio. En el Adviento nos ponemos todos en camino, a través del tiempo, hacia Jesús, hacia su Reino de justicia y de paz. Tras el Jubileo, es tiempo de mirar adelante y seguir viviendo, con fidelidad, alegría y entusiasmo, la riqueza de la misericordia divina. ¡Cuántas mujeres padecen el peso de la vida y el drama de la violencia! El Señor quiere que vivan libres y con plena dignidad. Es preciso que salgamos de nosotros mismos para encontrar a los demás. Si no lo hacemos, también los cristianos nos enfermamos de división. Que el Espíritu Santo nos ayude a ser pacientes para soportar, humildes y simples para aconsejar. ¡Cómo deseo que los años por venir estén llenos de misericordia, para que todas las personas encuentren la bondad y la ternura de Dios! Recordemos con gratitud a las personas consagradas que rezan por la Iglesia y por el mundo en los monasterios de clausura. Encomendamos la Iglesia, la humanidad entera y el inmenso cosmos al Señor, para que derrame su misericordia sobre todas las criaturas. Que el bálsamo de la misericordia pueda llegar a todos, creyentes y no creyentes, como signo del Reino de Dios presente ya entre nosotros. Cerramos hoy la Puerta Santa dando gracias a Dios por habernos concedido este tiempo extraordinario de gracia. Que el Jubileo de la Misericordia, que termina hoy, siga produciendo frutos en los corazones y en las obras de los creyentes. La misericordia de Dios para con nosotros está ligada a nuestra misericordia hacia el prójimo. ¡Si quieren un corazón lleno de amor, sean misericordiosos! No basta con experimentar la misericordia de Dios en la propia vida; también es necesario ser instrumento de misericordia para los demás. No hace falta ir en busca de quién sabe qué empresas: a menudo son las personas más cercanas a nosotros las que necesitan nuestra ayuda. Si cada uno de nosotros hace una obra de misericordia al día, se producirá una revolución en el mundo. En un mundo afectado por el virus de la indiferencia, las obras de misericordia son el mejor antídoto. Si quieres encontrar a Dios, búscalo donde Él está escondido: en los necesitados, en los enfermos, en los hambrientos, en los encarcelados. Delante de la Puerta Santa pidamos: «Señor, ¡ayúdame a abrir la puerta de mi corazón!» Queridos amigos, no olvidemos nunca que en las personas necesitadas se encuentra Jesús mismo. ¡No nos olvidemos de la belleza! La humanidad tiene mucha necesidad de belleza. Hagamos que la misericordia de Dios resplandezca en nuestro mundo a través del diálogo, la acogida recíproca y la colaboración fraterna. La profecía es decir que hay algo más verdadero, más bello, más grande, más bueno al cual todos estamos llamados. Ninguna celda está tan aislada como para excluir al Señor: su amor llega a todas partes. Rezo para que todos abran el corazón a este amor. El perdón es la esencia del amor, que sabe comprender el error y poner remedio. Dejémonos conmover por la mirada de Dios; lo único que desea es que permanezcamos unidos a su Hijo Jesús como sarmientos vivos. La vida cristiana es un camino, pero no un camino triste, sino alegre. Nos detenemos con fe ante ante las tumbas de nuestros seres queridos, rezando también por los difuntos que nadie recuerda. El Padre nos mira, y su mirada de amor nos anima a purificar nuestro pasado y a caminar en la unidad. Los santos han descubierto el secreto de la verdadera felicidad, que reside en el fondo del alma y tiene su fuente en el amor de Dios. La unidad entre los cristianos es una prioridad, porque reconocemos que entre nosotros es mucho más lo que nos une que lo que nos separa. https://t.co/TcM2AammSN Pidamos al Señor que su Palabra, fuente de luz y de vida, haga que los cristianos estemos cada vez más unidos. Les pido que recen por mi viaje a Suecia, para que pueda contribuir a la unidad de todos los cristianos. Abandonemos el lenguaje de la condena para abrazar el lenguaje de la misericordia. Oremos por los hermanos y hermanas que son discriminados y sufren en su propia carne las consecuencias de su fidelidad al Evangelio. La lógica de la caridad es llegar incluso a perder todo para que venzan el amor y la unidad. El amor es la obra paciente de personas que se prodigan escuchando y acercándose a los demás. Hoy más que nunca tenemos necesidad de que la política y la economía se pongan al servicio de la vida. Seamos discípulos, misioneros y portadores de Cristo allí donde Él quiere estar presente. “¡No tengan miedo! ¡Abran, más todavía, abran de par en par las puertas a Cristo!” – San Juan Pablo II, 22 de octubre de 1978 https://t.co/T0H0mijnae Las personas enfermas y pobres, así como los niños por nacer, son imágenes de Dios y merecedores del máximo respeto. Tratemos de estar siempre unidos a Jesús, sobre todo siguiéndolo por el camino de la cruz. Santidad es vivir con amor y ofrecer un testimonio cristiano en las situaciones cotidianas. ¡Señor, ayúdanos Tú! Danos Tú la paz, guíanos Tú hacia la paz. María, Madre nuestra, ruega por nosotros. Les deseo que nada pueda impedir que crezca su amistad con Dios. ¡Avancemos con valentía por el camino hacia la santidad! Hoy Santa Teresa de Ávila nos invita a rezar más para estar más cerca de Dios y vivir una vida mejor. Dios nunca deja de querer nuestro bien, incluso cuando pecamos. Vivimos el Evangelio cuando ayudamos a los más pequeños y vulnerables. #migrants Encomiendo a todos los niños emigrantes a la protección de la Sagrada Familia de Nazaret. Nadie es extranjero en la comunidad cristiana. #migrants Los niños tienen derecho a un ambiente familiar sano y seguro. #migrants Para vivir felices es necesario dejar el rencor, la rabia, la violencia y la venganza. ¡No hay pena válida sin esperanza! #NoDeathPenalty Nosotros cristianos tenemos una Madre, la misma de Jesús; tenemos un Padre, el mismo de Jesús. ¡No somos huérfanos! La Virgen quiere traer a todos nosotros el gran don que es Jesús; y con Él nos trae su amor, su paz, su alegría. El Rosario es la oración que acompaña siempre mi vida; también es la oración de los sencillos y de los santos… es la oración de mi corazón. Dios – Amor se anuncia amando. El diálogo ecuménico e interreligioso no es un lujo, sino algo que el mundo, herido por conflictos y divisiones, necesita cada día más. San Francisco, enséñanos a ser instrumentos de la paz, que tiene su fuente en Dios. #LaudatoSi A María confío las angustias y dolores de las poblaciones que en tantas partes del mundo son víctimas inocentes de conflictos. Que el Señor, que crea la armonía en las diferencias, custodie siempre esta amada región caucásica. Dialogar y orar por todos: estos son nuestros medios para hacer surgir amor y paz donde hay odio; y perdón donde hay ofensa. Dios cambia el mundo cambiando nuestros corazones: cuando encuentra un corazón abierto y confiado, allí puede obrar sus maravillas. Las personas pobres y débiles son la «carne de Cristo» que interpela a los cristianos de cualquier confesión. A Dios no se le conoce con elevados pensamientos y muchos estudios, sino con la pequeñez de un corazón humilde y confiado. Señor Jesús, extiende la sombra de tu cruz sobre los pueblos en guerra: que aprendan el camino de la reconciliación, el diálogo y el perdón. Hoy comienzo mi viaje a Georgia y Azerbaiyán. Acompáñenme con sus oraciones para que juntos sembremos paz, unidad y reconciliación. El Señor ha confiado a los arcángeles la tarea de defender los seres humanos. Qué bello sería dejar el mundo mejor de como lo hemos encontrado. Promovamos un turismo sostenible, que lleve desarrollo y encuentro con las poblaciones locales, y evite todo tipo de discriminación. En el hermano que ayudamos reconocemos el rostro de Dios que nadie puede ver. El mundo tiene necesidad de signos concretos de solidaridad, sobre todo ante la tentación de la indiferencia. Caminemos juntos, cuidando el uno del otro y también de la creación, nuestra casa común. Dios no se cansa de ofrecer siempre su perdón cada vez que lo pedimos. Cuanto más nos dejamos abrazar por el amor de Dios, más se renueva nuestra vida. El diálogo nace cuando soy capaz de reconocer que el otro es un don de Dios y tiene algo que decirme. Todo encuentro con el otro es una semilla que se puede convertir en un árbol frondoso, donde tantos encontrarán reparo y alimento. Servir es el estilo con el cual vivir la misión, el único modo de ser discípulo de Jesús. Como cristianos tenemos la responsabilidad de ser misioneros del Evangelio. El signo concreto de que realmente hemos encontrado a Jesús es la alegría que sentimos al comunicarlo también a los demás. Sólo quien se hace pequeño ante el Señor, puede experimentar la grandeza de su misericordia. La Iglesia está llamada a caminar con Jesús por los caminos del mundo, para encontrar la humanidad de hoy. El perdón de la Iglesia ha de tener la misma amplitud que el de Jesús en la Cruz, y el de María a sus pies. Pidamos una fe que nos permita confiar en Dios en cualquier circunstancia de la vida. Un saludo a todas las atletas y a los atletas comprometidos en los paralímpicos: que el deporte sea ocasión de crecimiento y de amistad. La Palabra de Dios puede hacer resucitar un corazón vacío. La misericordia realmente puede contribuir a la edificación de un mundo más humano. El Señor se hace presente todos los días, llamando a la puerta de nuestro corazón. Ofrecer el testimonio de la misericordia en el mundo de hoy es una tarea a la que ninguno de nosotros puede eludir. Dios se apiada siempre cuando estamos arrepentidos. Qué gran regalo nos ha hecho el Señor enseñándonos a perdonar para hacernos experimentar la misericordia de Dios! Quien construye sobre Dios construye sobre la roca, porque Él es siempre fiel, incluso cuando carecemos de fidelidad. Llevemos en el corazón la sonrisa de Madre Teresa y entreguémosla a todos los que encontremos en nuestro camino. https://t.co/CNDfUjyQso Imitemos a la Madre Teresa que ha hecho de las obras de misericordia la guía de su vida y el camino a la santidad. Caridad significa hacerse cercano a las periferias de los hombres y las mujeres que nos encontramos todos los días. Dios nos ha dado la tierra para cultivarla y guardarla con respeto y equilibrio. Servir con amor y con ternura a las personas que necesitan ayuda nos hace crecer en humanidad. La misericordia de Dios hacia nosotros nos anima a ser misericordiosos con los demás. Una oración fácil de decir cada día: \"Señor, yo soy un pecador: Ven con tu misericordia.\" Un impetuoso viento de santidad recorra el Jubileo extraordinario de la Misericordia en todas las Américas. Consolando a los que sufren, seremos capaces de construir un mundo mejor. La trata de seres humanos, de órganos, el trabajo forzado y la prostitución son esclavitudes modernas y crimenes contra la humanidad. La misericordia no es \"buenismo\", ni mero sentimentalismo. Es la verificación de la autenticidad de nuestro ser discípulos de Jesús. Donde hay amor, allí hay también comprensión y perdón. No abandonemos nunca la oración, tampoco cuando nos parece inútil rezar. En la cruz podemos tocar y dejarnos tocar de la misma misericordia de Dios! Os encomiendo a la atención materna de nuestra Madre, que vive en la gloria e Dios y acompaña siempre nuestro camino. Pidamos a María, nuestra Madre, que nos ayude a rezar con corazón humilde. Que la gente vea en vuestra vida el Evangelio: un amor generoso y fiel a Cristo y a los hermanos. En la Confesión encontramos el abrazo misericordioso del Padre. Su amor nos perdona siempre. Una sociedad con culturas diferentes debe buscar la unidad en el respeto. Pidamos que sean respetados los pueblos indígenas, amenazados en su identidad y hasta en su misma existencia. Cuando en una familia hay diálogo, las tensiones se resuelven bien. A los gestos de odio y destrucción respondamos con gestos de bondad. Tenemos diferentes culturas y religiones, pero somos hermanos. ¡Felicidades atletas de #Rio2016! Sean siempre mensajeros de fraternidad y de genuino espíritu deportivo. El perdón de Dios no conoce límites... Dios mira el corazón que pide ser perdonado. #Assisi #Porziuncola El secreto de la alegría: no apagar la buena curiosidad, sino participar, porque la vida no hay que encerrarla en un cajón. Gracias queridos jóvenes. San Juan Pablo II ha disfrutado desde el cielo, y os ayudará a llevar por todo el mundo la alegría del Evangelio. Jesús te habla cada día. Que su Evangelio sea tuyo, y se convierta en tu «navegador» en el camino de la vida. Dios cuenta contigo por lo que eres, no por lo que tienes. A sus ojos, vales, y lo que vales no tiene precio. Dios nos ama tal como somos, y no hay pecado, defecto o error que lo haga cambiar de idea. Jesús te llama a dejar tu huella en la vida, una huella que marque tu historia y la historia de muchos. Dios te está invitando a soñar, te quiere hacer ver que el mundo con vos puede ser distinto. Hemos venido al mundo a dejar una huella. Jesús busca corazones abiertos y tiernos con los débiles, nunca duros; corazones dóciles y transparentes. Jesús quiere corazones realmente consagrados, que viven del perdón recibido de él, para derramarlo con compasión sobre los hermanos. \"Misericordia quiero y no sacrificio\". \nFrancisco. \n30/7/2016. Santuario de la Divina Misericordia. En esta tarde, queridos jóvenes, el Señor os invita de nuevo a que seáis protagonistas en el servicio. Abrazando la cruz, Jesús abrazó desnudez y hambre, sed y soledad, dolor y muerte de los hombres y mujeres de todos los tiempos. Quien practica las obras de misericordia, no tiene miedo de la muerte. Cómo quisiera que fuésemos capaces de estar al lado de los enfermos como Jesús, con el silencio, con una caricia, con la oración. Es Jesucristo quien nos impulsa a levantar la mirada y a soñar alto. En estos días de la JMJ, Jesús quiere entrar en nuestra casa. Un corazón misericordioso se anima a salir de su comodidad y sabe ir al encuentro de los demás, logra abrazar a todos. El Señor ama participar en nuestra vida cotidiana para caminar con nosotros. El Señor está en medio de nosotros y cuida de nosotros, sin decidir por nosotros. ¡Vivamos juntos la JMJ de Cracovia!\n#Krakow2016  \nhttps://t.co/TeH8cqI5rX Queridos jóvenes, permanezcamos unidos en la oración para que esta JMJ sea rica en frutos espirituales. ¡Nos vemos mañana! \n#Krakow2016 Queridos jóvenes, ¡ofrezcamos al mundo un mosaico de numerosas culturas, razas, y pueblos unidos en el Nombre de Jesús! \n#Krakow2016 Queridos jóvenes, bendigo vuestros pasos hacia Cracovia para que formen una peregrinación de fe y de fraternidad. \n#Krakow2016 Acordémonos de los ancianos y los enfermos, que en verano a menudo se quedan más solos y pueden encontrarse en dificultad. Rezo por las víctimas del atentado a Niza y por sus familiares. Pido a Dios que convierta el corazón de los violentos cegados por el odio. Las vacaciones son un tiempo para descansar, pero también para regenerarse en el espíritu, especialmente leyendo con calma el Evangelio. Este mes, se suspenden mis audiencias; pero yo no dejo de rezar por ustedes. Por favor, ¡recen ustedes por mí! ¡Unamos nuestras fuerzas en todos los niveles, de modo que la paz en la amada Siria sea posible! #peacepossible4Syria El verano da a muchas personas la oportunidad de descansar. Es también un tiempo favorable para cuidar las relaciones humanas. Amar y perdonar como Dios ama y perdona. Este es un programa de vida que no puede conocer interrupciones o excepciones. La verdadera alegría que se experimenta en la familia no es casual ni efímera, sino fundada y estable. Hoy, en el mundo del trabajo, es urgente educar a recorrer el camino, luminoso y laborioso, de la honestidad. El jubileo de la Misericordia es un tiempo de reconciliación para todos. El Señor repite hoy a todos los Pastores: sígueme a pesar de las dificultades; sígueme en la predicación del Evangelio a todo el mundo. Si Dios está presente en nuestras vidas, la alegría de llevar su Evangelio será nuestra fuerza y nuestro gozo. Jesús nos busca y nos invita a hacerle espacio en lo íntimo de nuestro corazón. ¿Nos damos cuenta? Me siento feliz de haber visitado Armenia, el primer país que abrazó la fe cristiana, y doy las gracias a todos por la cálida acogida. Que la Iglesia Armenia camine en paz, y la comunión entre nosotros sea plena. #PopeInArmenia Los sufrimientos de los armenios nos pertenecen, son los sufrimientos de los miembros del Cuerpo místico de Cristo. #PopeInArmenia El compromiso hacia la plena unidad y la colaboración entre todos los discípulos del Señor son como luz brillante en una noche oscura. Les pido que me acompañen con la oración en mi viaje apostólico a Armenia. Ser cristianos significa vincular la propia vida, en cada uno de sus aspectos, a la persona de Jesús y, a través de Él, al Padre. Los pueblos son los primeros artífices de su desarrollo, los primeros responsables. Todos estamos en viaje hacia la casa común del cielo, donde podremos leer con alegre admiración el misterio del universo. Unámonos en oración con nuestros hermanos ortodoxos por el Santo y Gran Concilio de la Iglesia ortodoxa que comienza hoy en Creta. El universo es algo más que un problema científico, es un misterio gozoso, es un lenguaje del amor de Dios hacia nosotros. En la oración experimentamos la compasión de Dios Padre, lleno de amor misericordioso. Incluso en la situación más fea de la vida, Dios me espera, Dios quiere abrazarme, Dios me espera. Queridos ancianos, Dios no les abandona, ¡está con ustedes! Con su ayuda, ustedes son memoria viva para su pueblo. El futuro de un pueblo supone necesariamente el encuentro entre los jóvenes y los ancianos. Invito a las instituciones internacionales a dar voz a todas las personas que sufren silenciosamente el hambre. #ZeroHunger Queridos enfermos, encomiéndense al Espíritu Santo, que nunca les hará faltar la luz consoladora de su presencia. No se cansen de pedir en la oración la ayuda del Señor, especialmente en las dificultades. La ternura de Dios se hace presente en la vida de las personas que saben comprender las necesidades de los enfermos con ojos llenos de amor. Tenemos que reconocer los valores de nuestra humanidad común, en virtud de los cuales podemos y debemos colaborar y construir. ¡Protejamos los océanos, que son bienes comunes globales, esenciales por el agua y la variedad de seres vivientes! En este tiempo pobre de amistad social, nuestra primera tarea es construir comunidad. Tenemos necesidad de descubrir las riquezas de cada uno: que las comunidades transmitan sus valores y acojan las experiencias de los demás. Los santos no son superhombres, ni nacieron perfectos. Cuando conocieron el amor de Dios, le siguieron, al servicio de los demás. Escuchemos el grito de las víctimas y de los que sufren, ninguna familia sin casa, ningún niño sin infancia. Nuestra vida sacerdotal se va entregando en el servicio al pueblo fiel de Dios, con la alegría de los que escuchan a su Señor. Recemos juntos por el Jubileo de los sacerdotes del 1 al 3 de junio, visiten https://t.co/nZhyx8tzVT El discípulo de Cristo, cuando es transparente en el corazón y sencillo en la vida, lleva la luz del Señor a donde vive y trabaja. Al término del mes de mayo, me uno espiritualmente a las muchas expresiones de devoción a María santísima. Somos custodios, no dueños de esta tierra, y cada uno tiene una responsabilidad personal en la custodia de la creación, don precioso de Dios Recibiendo la Eucaristía nos nutrimos del Cuerpo y la Sangre de Jesús, pero, viniendo a nosotros, ¡es Jesús que nos une a su Cuerpo! Permaneced estables en el camino de la fe con una firme esperanza en el Señor. Aquí está el secreto de nuestro camino. María es un icono de la Madre Iglesia que extiende el perdón a cuantos lo piden. Jesús se da a nosotros en la Eucaristía, se ofrece a sí mismo como alimento espiritual que sostiene nuestra vida. Dios ha vencido el egoísmo y la muerte con las armas del amor; su Hijo, Jesús, es la puerta de la misericordia, abierta de par en par. Dios puede llenar con su amor nuestros corazones y que podamos caminar juntos hacia la tierra de la libertad y de la vida. En un mundo dividido, comunicar con misericordia significa contribuir a la cercanía entre los hijos de Dios. La fiesta de la Stma. Trinidad nos renueva la misión de vivir la comunión con Dios y entre nosotros según el modelo de la comunión divina. Cada uno puede ser un puente entre diferentes culturas y religiones, una vía para redescubrir nuestra común humanidad. El firme compromiso por los derechos humanos nace del ser conscientes del valor único e irrepetible de cada persona. Amar y perdonar son el signo concreto y visible que la fe ha transformado nuestro corazón. El Jubileo es la fiesta a la que Jesús invita a todos, sin distinciones ni excepciones, sin excluir a nadie. El mundo tiene necesidad del valor, de la esperanza, de la fe y de la perseverancia de los discípulos de Cristo. El Espíritu Santo ha sido dado en abundancia para que podamos vivir con fe genuina y caridad operante. ¡Ven, Espíritu Santo! Líbrame de la cerrazón mental e infunde en mí la alegría de anunciar el Evangelio. Comunicar con misericordia significa contribuir a la buena, libre y solidaria cercanía entre los hijos de Dios y los hermanos en humanidad. Y si nuestro corazón y nuestros gestos están animados por el amor divino, nuestra comunicación será portadora de la fuerza de Dios. Queridos religiosos y religiosas: ¡Despierten al mundo! ¡Sean testigos de un modo diferente de pensar, de actuar, de vivir! Lo que decimos y cómo lo decimos, cada palabra y cada gesto debería expresar la compasión, la ternura y el perdón de Dios. Que las dificultades sean aliciente de unidad, para vencer todos los miedos y construir juntos el futuro de Europa y del mundo. Jesús, ascendido al cielo, está en el señorío de Dios, presente en todo espacio y tiempo, cerca de cada uno de nosotros. https://t.co/iPeulWkC5a https://t.co/GIrcBYpqH0 El amor, por su naturaleza, es comunicación, lleva a la apertura, no al aislamiento. #ComMisericordia50 Cristo es nuestra mayor alegría, siempre está a nuestro lado y nunca nos defraudará. El Señor nos consuela. Estamos llamados a consolar a nuestros hermanos, testimoniando que sólo Dios puede eliminar las causas de los dramas. Que las dificultades en el camino ecuménico nos estimulen a conocernos mejor, rezar juntos y colaborar en las obras de caridad. Jesucristo, encarnación de la misericordia de Dios, ha muerto en cruz por amor, y por amor ha resucitado. El problema del trabajo es grave, por los elevados niveles de desempleo juvenil y porque a veces el trabajo no es digno. Dirijo una cordial felicitación a los fieles de las Iglesias de Oriente que celebran hoy la santa Pascua.  Χριστὸς ἀνέστη! Trabajar es propio de la persona humana y expresa su dignidad de criatura hecha a imagen de Dios. Cristo ha vencido el mal en la raíz: es la Puerta de la salvación, abierta de par en par para que cada uno pueda encontrar misericordia. Ante las simas espirituales y morales de la humanidad solamente Dios con su infinita misericordia puede darnos la salvación. La esperanza cristiana es un don que Dios nos da si salimos de nosotros mismos y nos abrimos a él. Abramos al Señor nuestros sepulcros sellados ―cada uno de nosotros los conoce― , para que Jesús entre y llene de vida. Todos estamos llamados a cuidar con amor la vida de las familias; porque no son un problema, sino una oportunidad. Queridos jóvenes, con la gracia de Dios pueden ser cristianos auténticos y valientes, testigos de amor y de paz. Queridos jóvenes, sus nombres están escritos en el cielo, en el corazón misericordioso del Padre. ¡Sean valientes, vayan contracorriente! Un verdadero planteamiento ecológico debe integrar medio ambiente y justicia, escuchando el clamor de la tierra y el grito de los pobres. El cambio climático supone uno de los principales desafíos actuales para la humanidad; para afrontarlo se requiere la solidaridad de todos. Formar una familia es animarse a ser parte del sueño de Dios, unirse a Él para construir un mundo donde nadie se sienta solo. El camino privilegiado hacia la paz es reconocer en el otro no un enemigo que hay que combatir, sino un hermano que debemos acoger. Oremos por los pueblos de Ecuador y Japón que han sufrido violentos terremotos. Que Dios y los hermanos les ayuden, fortalezcan y consuelen. Cada vocación en la Iglesia tiene origen en la mirada compasiva de Jesús que nos perdona y nos llama a seguirlo. Hoy es el cumpleaños de Benedicto XVI: recemos por él y demos gracias a Dios por haberlo donado a la Iglesia y al mundo. Los refugiados no son números sino personas con rostros, nombres e historias, y deben ser tratados como tales. En las horas más oscuras de la familia, la unión con Jesús puede evitar una ruptura. El amor es en el fondo la única luz que ilumina constantemente a un mundo oscuro. La presencia del Señor habita en las familias, con todos sus problemas, luchas y alegrías cotidianos. El camino de la Iglesia es el de no condenar a nadie para siempre, es difundir la misericordia de Dios a quienes la piden sinceramente. La Iglesia hace suyo el comportamiento del Hijo de Dios que sale al encuentro de todos, sin excluir a nadie. Comprender, perdonar, acompañar, esperar, integrar. Esa es la lógica que debe predominar en la Iglesia. Es fundamental que los hijos vean que para sus padres la oración es realmente importante. El hogar debe ser el lugar donde se enseña a apreciar la hermosura de la fe, a rezar y a servir al prójimo. La familia es el primer lugar donde se aprende a escuchar, a compartir, a soportar, a respetar, a ayudar. Los hijos son un maravilloso don de Dios, una alegría para los padres. La fidelidad tiene que ver con la paciencia. Sus sacrificios y gozos van floreciendo con el tiempo. Saber perdonar y sentirse perdonados es una experiencia fundamental en la vida familiar. Las personas divorciadas que viven en nueva unión son parte de la Iglesia, no están excomulgadas. Las familias abiertas y solidarias hacen espacio a los pobres. Es importante que el niño se sienta querido: no es un complemento o una solución para una inquietud personal. Cada nueva vida nos permite descubrir la dimensión gratuita del amor. El amor abre los ojos y permite ver, más allá de todo, cuánto vale un ser humano. En la familia hay que aprender el lenguaje amable de Jesús. Cada familia, a pesar de su debilidad, puede llegar a ser una luz en la oscuridad del mundo. Nuestra enseñanza sobre el matrimonio y la familia no puede dejar de inspirarse en un mensaje de amor y de ternura. La fuerza de la familia reside esencialmente en su capacidad de amar y enseñar a amar. Nadie puede pensar que debilitar a la familia como sociedad natural fundada en el matrimonio es algo que favorece a la sociedad. Las personas con discapacidad son para la familia un don y una oportunidad para crecer en el amor, en la ayuda recíproca y en la unidad. La familia es un bien del cual la sociedad no puede prescindir, y necesita ser protegida. El bien de la familia es decisivo para el futuro del mundo. La Palabra de Dios es una fuente de consuelo para las familias que están en crisis o en medio de algún dolor. La familia es el lugar donde los padres se convierten en los primeros maestros de la fe para sus hijos. La alegría del amor que se vive en las familias es también el júbilo de la Iglesia. Os animo a dar testimonio con vuestro estilo de vida personal y asociativo: testimonio de gratuidad, de solidaridad, de espíritu de servicio El Jubileo es todo un año en el que acoger cada día la misericordia para que toda nuestra existencia sea santa. El Señor nos pide que seamos hombres y mujeres que irradien la verdad, la belleza y el poder del Evangelio, que transforma la vida. La fe cristiana es un don que recibimos con el Bautismo y que nos permite encontrar a Dios. Misericordia: es el camino que une Dios al hombre, y abre nuestro corazón a la esperanza de ser amados por siempre. Hacerse misericordiosos significa aprender a ser valientes en el amor concreto y desinteresado. Al cruzar la Puerta Santa, encomendémonos a la gracia de Cristo, que puede cambiar nuestra vida. El fenómeno migratorio plantea un importante desafío cultural, que no se puede dejar sin responder. Si nos abrimos a acoger la misericordia de Dios para nosotros, a su vez somos capaces de perdón. Jesús nos muestra que el poder de Dios no es destrucción, sino amor; la justicia de Dios no es venganza, sino misericordia. Todo cristiano es un «Cristóforo», es decir, ¡un portador de Cristo! ¡Jesucristo ha resucitado! ¡El amor ha derrotado al odio, la vida ha vencido a la muerte, la luz ha desterrado a las tinieblas! Vivir la Pascua significa entrar en el misterio de Jesús que muere y resucita por nosotros. La Cruz de Jesús es la Palabra con la que Dios ha respondido al mal del mundo. Imprime en nuestro corazón, Señor, sentimientos de fe, esperanza, caridad, de dolor por nuestros pecados. Jesús nos amó. Jesús nos ama. Sin límites, siempre, hasta el extremo. Ungidos con óleo de alegría para transmitir la alegría del Evangelio. ¡Con cuánto amor nos mira Jesús! ¡Con cuánto amor cura nuestro corazón pecador! Jamás se asusta de nuestros pecados. Encomiendo a la misericordia de Dios las personas que han perdido la vida. #Bruselas Tomémonos en serio nuestro ser cristianos, y comprometámonos a vivir como creyentes. ¡Vayan a Él y no tengan miedo! Vengan para decirle desde lo más profundo de sus corazones: “¡Jesús, confío en Ti!”. Inicio un nuevo camino, en Instagram, para recorrer con ustedes el camino de la misericordia y de la ternura de Dios Cuanto más grande es el pecado, mayor debe ser el amor que la Iglesia expresa hacia quienes se convierten. Nadie puede ser excluido de la misericordia de Dios. La Iglesia es la casa que acoge a todos y no rechaza a nadie. Al salir del confesionario, percibimos su fuerza que nos vuelve a dar la vida y el entusiasmo de la fe. Después de la confesión renacemos. El Padre es verdaderamente «rico en misericordia» y la extiende en abundancia sobre quienes recurren a Él con corazón sincero. El sacramento de la Reconciliación nos permite acercarnos con confianza al Padre para tener la certeza de su perdón. Rezad por mí. ... para que las familias en dificultad reciban los apoyos necesarios y los niños puedan crecer en ambientes sanos y serenos. Dios nos ha acariciado con su misericordia: llevemos esa caricia a los demás, a aquellos que tienen necesidad. Pequeños gestos de amor, de ternura, que hacen pensar que el Señor está con nosotros: así, se abre la puerta de la misericordia. Mi vida, mi actitud, la forma de ir por la vida debe ser un signo concreto del hecho de que Dios está cerca de nosotros. El Jubileo de la Misericordia es una ocasión propicia para promover en el mundo formas de respeto de la vida y de la dignidad de la persona. Que el Señor nos libere de toda tentación que aleja de lo que es esencial en nuestra misión: redescubramos la belleza de creer en Jesús. Jesucristo con su cercanía y ternura nos lleva en el espacio de la gracia y el perdón. Esta es la misericordia de Dios. ¡Abre tu corazón a la misericordia! La misericordia divina es más fuerte que el pecado. Gracias a México y a todos los mexicanos. Que el Señor y la Virgencita de Guadalupe nos acompañen siempre. Me he sentido acogido, recibido por el cariño, la esperanza de esta gran familia mexicana, gracias por abrirme las puertas de su vida Son las lágrimas las que pueden generar una ruptura capaz de abrirnos a la conversión. No se olviden que la misericordia de Dios es nuestro escudo y nuestra fortaleza contra la injusticia, la degradación y la opresión. El lucro y el capital no son un bien por encima del hombre, están al servicio del bien común. Todos tenemos que luchar para que el trabajo sea una instancia de humanización y de futuro. Queridos presos, habéis sufrido el dolor al máximo, podéis volveros profetas de una sociedad que no engendre violencia y exclusión. Celebrar el Jubileo de la misericordia es aprender a no quedar presos del pasado, es creer que las cosas pueden ser diferentes. La misericordia de Jesús abraza a todos y en todos los rincones de la tierra, ábrele tu corazón. Jesús nunca nos invitaría a ser sicarios, sino que nos llama discípulos. Nunca nos mandaría al muere, El es invitación a la vida. Me han pedido una palabra de esperanza, la que tengo para darles se llama Jesucristo. En Jesús he encontrado a Aquel que es capaz de encender lo mejor de mí mismo. Nuestra primera llamada es aprender a decir “Padre nuestro”: Padre nuestro,  no nos dejes caer en la tentación de la resignación A rezar se aprende, como aprendemos a caminar, a hablar, a escuchar. Dime cómo rezas y te diré cómo vives. Prefiero una familia con rostro cansado por la entrega a rostros maquillados que no han sabido de ternura y compasión Entre los pobres más maltratados, está nuestra tierra. No podemos hacernos los sordos ante la mayor crisis ambiental de la historia. En el corazón del hombre hay un anhelo de vivir en libertad en una tierra en la que sea posible cambiar, en la fraternidad en la solidaridad Jesús nos está esperando y quiere sanar nuestro corazon de todo lo que lo degrada. Es el Dios que tiene un nombre: misericordia. Jesús nos ayuda siempre a superar las tentaciones de la riqueza, la vanidad y el orgullo que intentan arruinar la verdad. La Cuaresma es tiempo para ajustar los sentidos, abrir los ojos frente a tantas injusticias, abrir el corazón al hermano que sufre. Mirarte simplemente Madre dejar abierta sólo la mirada Mirarte toda sin decirte nada, decirte todo mudo y reverente https://t.co/UEJUXzp0gW María es la mujer del sí, un sí de entrega a Dios, un sí de entrega a sus hermanos. Sigámosla en su entrega. México tiene rostro joven. Esto permite pensar y proyectar un futuro, un mañana. Eso da esperanza. Queridos hermanos mexicanos, están en mi corazón, nos encomendamos juntos a la Guadalupana, que no deje de mirarnos con ternura. Hoy es un día de gracia. Es un regalo de Dios este encuentro con el Patriarca Kirill. Recen por nosotros. En México miraré a los ojos de María y le suplicaré que no deje de mirarnos con misericordia. A Nuestra Madre confío desde ahora mi viaje. Entrar por la Puerta Santa significa descubrir la profundidad de la misericordia del Padre, que busca a cada uno personalmente. Dios quiere habitar en medio de sus hijos. Abramos un espacio para él en nuestro corazón. María, Madre de Jesús, ayúdanos a transmitir las maravillas del Señor a quienes encontramos en nuestro camino. Como cristianos, no podemos cerrarnos en nosotros mismos, sino estar siempre abiertos a los demás, para los demás. En la sociedad actual, donde el perdón es tan raro, la misericordia es cada vez más importante. El Evangelio nos llama a hacernos \"prójimos\" de los pobres y los abandonados, para ofrecerles una esperanza concreta. Toda comunidad cristiana debe ser un oasis de caridad y afecto en el desierto de la soledad y la indiferencia. Si confiamos en el Señor, podremos superar todos los obstáculos que encontremos en el camino. Cuando el mundo se duerme en la comodidad y el egoísmo, la misión del cristiano es ayudar a despertarlo. La misericordia se ha vuelto viva y visible en Jesús de Nazaret (MV 1). Agradezcamos a Dios que siempre está presente, cercano y misericordioso (MV 6). Nadie puede ponerle un límite al amor de Dios, que está siempre dispuesto a perdonar (MV 3). La misericordia de Dios será siempre más grande que cualquier pecado (MV 3). Oremos por los cristianos perseguidos, a menudo con el silencio vergonzoso de muchos. Cuando tienes a Cristo como amigo, tienes alegría, serenidad y felicidad. Dios está enamorado de nosotros. Se hace pequeño para ayudarnos a responder a su amor. Ante la gravedad del pecado, Dios responde con la plenitud del perdón (MV 3). La misericordia es la vía que une Dios y el hombre, porque abre el corazón a la esperanza de ser amados parar siempre (MV 2). Un propósito diario: transmitir un poco de la ternura de Cristo a quienes más lo necesitan. Que el Jubileo de la Misericordia traiga a todos la bondad y la ternura de Dios Que Dios bendiga África! Este es el tiempo para nuevos mensajeros, más generosos, más alegres, más santos. Los cristianos y musulmanes somos hermanos y tenemos que comportarnos como tales. El Jubileo de la Misericordia nos recuerda que Dios nos espera con los brazos abiertos, como hace el padre con el hijo pródigo. Donde reinan la violencia y el odio los cristianos están llamados a dar testimonio de Dios, que es Amor. Vengo a la República Centroafricana como peregrino de la paz, y me presento como un apóstol de la esperanza. Tengo grandes esperanzas en África y en la gran cosecha de gracia que Dios está preparando en medio de ustedes. Uganda ha recibido el testimonio de los mártires cristianos. Que nos ayuden a difundir sin miedo la alegría del Evangelio. El mundo es testigo de un movimiento migratorio sin precedentes. Agradezco a Uganda su generosidad en acoger a los refugiados. Que mi visita a África sea una muestra de la estima de la Iglesia por todas las religiones y afiance nuestros lazos de amistad. Mungu abariki Kenya! Que Dios bendiga a Kenia. Todas las personas –verdaderamente todas- son importantes a los ojos de Dios. Es una alegría rezar hoy en Roma con los hermanos Luteranos. Dios bendiga a quienes trabajan por el diálogo y la unidad de los cristianos. Quiero expresar mi profundo dolor por los ataques terroristas de París. Recen conmigo por las víctimas y sus familias. #PrayersForParis Todos los cristianos estamos llamados a imitar al Buen Pastor y ocuparnos de las familias heridas. La vanidad no sólo nos aleja de Dios sino que nos hace ridículos. Pedimos la ayuda del Arcángel Miguel para defendernos de las insidias y engaños del demonio. Padres: ¿saben “perder el tiempo” con sus hijos? Es una de las cosas más importantes que pueden hacer todos los días. El desarrollo económico debe tener un rostro humano, de manera que nadie quede excluido. En los pobres vemos el rostro de Cristo que se hizo pobre por nosotros. La corrupción es un cáncer que destruye la sociedad. Queridos jóvenes, no tengan miedo de dar todo. Cristo nunca defrauda. Aprendamos a vivir la solidaridad. Sin solidaridad, nuestra fe está muerta. El trabajo es importante, pero también el descanso. Aprendamos a respetar el tiempo de descanso, sobre todo los domingos. Queridos jóvenes, pidan al Señor un corazón libre para no ser esclavos de las trampas del mundo. La fe no es un don privado. La fe es para compartirla con alegría. Nuestra vida no es vagar sin rumbo. Tenemos una meta segura: la casa del Padre. Les doy las gracias de corazón. Que el amor de Cristo guíe siempre al pueblo americano. Gracias a todos los cubanos. Gracias de corazón. Los invito a rezar conmigo por mi viaje a Cuba y a los Estados Unidos. Necesito sus oraciones. A pesar de la injusticia y el sufrimiento, la victoria del Señor es segura. Dios prefiere a los humildes. Cuando vivimos con humildad, Él transforma nuestros pequeños esfuerzos y hace cosas grandes. Cada vez que nos santiguamos nos acercamos al gran misterio de la Trinidad. ¿Damos gracias a Dios cada día? Que cada parroquia y comunidad religiosa de Europa acoja a una familia de refugiados. #Jubileo #refugeeswelcome Pidamos a la Virgen María que ayude a todas las familias, especialmente a las que sufren por la falta de trabajo La guerra es madre de toda pobreza, una gran depredadora de vidas y almas. Hoy es la Jornada mundial de oración por el cuidado de la Creación. Recemos y trabajemos. Señor, ayúdanos a ser más generosos y a estar más cerca de las familias pobres. Un cristiano que está demasiado apegado al dinero se ha equivocado de camino. La lectura diaria del Evangelio nos ayuda a superar nuestro egoísmo y a seguir con decisión a Jesús, el Maestro. La experiencia del amor misericordioso del Padre nos hace más capaces de compartir esta alegría con los demás. La vida de María nos muestra que Dios realiza grandes obras por medio de los más humildes. María es la llena de gracia. Nos ofrece un refugio seguro en el momento de la tentación. El encuentro con Cristo es capaz de transformar completamente nuestra vida. Todos somos pecadores. Dejémonos transformar por la misericordia de Dios. En una familia cristiana aprendemos muchas virtudes. Sobre todo a amar sin pedir nada a cambio. Dejemos que el amor de Dios se arraigue en nosotros, así seremos capaces de darnos a los demás. La hospitalidad en familia es hoy una virtud decisiva, especialmente en las situaciones de mucha pobreza. El testimonio más eficaz sobre el matrimonio es la vida ejemplar de los esposos cristianos. Queridos jóvenes, no tengan miedo del matrimonio: Cristo acompaña con su gracia a los esposos que permanecen unidos a él. El testimonio cristiano es concreto. Las palabras sin el ejemplo son vacías. Quien ayuda a los enfermos y a los necesitados toca la carne de Cristo, vivo y presente entre nosotros. La Iglesia está llamada a estar siempre más atenta y solícita hacia los débiles. Gracias. Por favor, les pido que recen por mí.  #Ecuador #Bolivia #Paraguay Cuando todo se derrumba, lo que sostiene nuestra esperanza es sólo esto: Que Dios nos ama, que ama a todos. Es hora de cambiar de mentalidad y de dejar de pensar que nuestras acciones no tienen ningún impacto en quien padece hambre. El amor compasivo de Cristo es lo que nos da la libertad y la felicidad verdaderas. Un gran reto: dejar de arruinar el jardín que Dios nos ha confiado para que todos puedan gozar de él. Qué hermoso es anunciar a todos el amor de Dios que nos salva y da sentido a nuestra vida. La Iglesia es una madre de corazón abierto, pronta para ayudar a todos, especialmente a quien tiene más dificultad. En la confesión, Jesús nos acepta con todos nuestros pecados para darnos un corazón nuevo, capaz de amar como él ama. El amor de Dios es gratuito. Él no nos pide nada a cambio; sólo que lo acojamos. Señor, tómanos a nosotros con tu poder y tu luz, para proteger toda vida, para preparar un futuro mejor. #LaudatoSi Caminemos cantando. Que nuestras luchas y nuestra preocupación por este planeta no nos quiten el gozo de la esperanza. Una ecología integral implica dedicar algo de tiempo para reflexionar acerca de nuestro estilo de vida y nuestros ideales. La espiritualidad cristiana propone un modo alternativo de entender la calidad de vida. #LaudatoSi Vivir la vocación de ser protectores de la obra de Dios no consiste en un aspecto secundario de la experiencia cristiana. Lo que el Evangelio nos enseña tiene consecuencias en nuestra forma de pensar, sentir y vivir. Mientras más vacío está el corazón de la persona, más necesita objetos para comprar, poseer y consumir. #LaudatoSi Muchas cosas tienen que reorientar su rumbo, pero ante todo la humanidad necesita cambiar. Habrá que interpelar a los creyentes a ser coherentes con su propia fe. #LaudatoSi Sabemos que es insostenible el comportamiento de aquellos que consumen y destruyen más y más. Desacelerar un determinado ritmo de producción y de consumo puede dar lugar a otro modo de progreso y desarrollo. La reducción de gases de efecto invernadero requiere honestidad, valentía y responsabilidad. #LaudatoSi La interdependencia nos obliga a pensar en un solo mundo, en un proyecto común. Somos nosotros los primeros interesados en dejar un planeta habitable para la humanidad que nos sucederá. Lo que está en juego es nuestra propia dignidad. #LaudatoSi ¿Qué tipo de mundo queremos dejar a quienes nos sucedan, a los niños que están creciendo? La tierra que recibimos pertenece también a los que vendrán. #LaudatoSi La posesión de una vivienda tiene mucho que ver con la dignidad de las personas y con el desarrollo de las familias. Para las comunidades aborígenes,  la tierra no es un bien económico, sino don de Dios y un espacio sagrado. Necesitamos una aproximación integral para combatir la pobreza y cuidar la naturaleza. Es contrario a la dignidad humana hacer sufrir inútilmente a los animales y sacrificar sin necesidad sus vidas. La cultura del relativismo empuja a una persona a aprovecharse de otra y a tratarla como mero objeto. El pensamiento cristiano reclama un valor peculiar para el ser humano por encima de las demás criaturas. Lo que está ocurriendo nos pone ante la urgencia de avanzar en una valiente revolución cultural. #LaudatoSi El avance de la ciencia y de la técnica no equivale al avance de la humanidad y de la historia. El mercado por sí mismo no garantiza el desarrollo humano integral y la inclusión social. #LaudatoSi Con mucha lentitud se aprenden las lecciones del deterioro ambiental. #LaudatoSi Es posible que hoy la humanidad no advierta la seriedad de los desafíos que se presentan. #LaudatoSi Cada época tiende a desarrollar una escasa autoconciencia de sus proprios límites. Nunca la humanidad tuvo tanto poder sobre sí misma y nada garantiza que vaya a utilizarlo bien. Para los creyentes, esto se convierte en una cuestión de fidelidad al Creador. La tierra es esencialmente una herencia común, cuyos frutos deben beneficiar a todos. #LaudatoSi Seguimos admitiendo en la práctica que unos se sientan más humanos que otros. Deberían exasperarnos las enormes inequidades que existen entre nosotros. #LaudatoSi A veces se lleva adelante una lucha para otras especies que no desarrollamos para defender la igual dignidad entre los seres humanos. Un mundo frágil interpela nuestra inteligencia para reconocer cómo deberíamos orientar, cultivar y limitar nuestro poder. Cada criatura es objeto de la ternura del Padre, que le da un lugar en el mundo. #LaudatoSi Decir «creación» es más que decir naturaleza, porque tiene que ver con un proyecto del amor de Dios. Cada comunidad tiene el deber de proteger la tierra y de garantizar su fertilidad para las generaciones futuras. El actual sistema mundial es insostenible desde diversos puntos de vista. #LaudatoSi Basta mirar la realidad con sinceridad para ver que hay un gran deterioro de nuestra casa común. Cualquier cosa que sea frágil, como el medio ambiente, queda indefensa ante los intereses del mercado divinizado. La alianza entre la economía y la tecnología termina dejando afuera lo que no forme parte de sus intereses inmediatos. Muy fácilmente el interés económico llega a prevalecer sobre el bien común. #LaudatoSi No hay espacio para la globalización de la indiferencia. #LaudatoSi Es necesario que los paises desarrollados contribuyan a resolver esta deuda limitando el consumo de energia no renovable. Hay una verdadera «deuda ecológica», particularmente entre el Norte y el Sur. #LaudatoSi Culpar al aumento de la poblacion y no al consumismo extremo es un modo de no enfrentar los problemas. Hemos de escuchar tanto el clamor de la tierra como el clamor de los pobres. El deterioro del ambiente y el de la sociedad afectan de un modo especial a los más débiles. #LaudatoSi El ambiente humano y el ambiente natural se degradan juntos. Un problema particularmente serio es el de la calidad del agua disponible para los pobres. Estos problemas están íntimamente ligados a la cultura del descarte. La tierra, nuestra casa, parece convertirse cada vez más en un inmenso depósito de porquería. El cambio climático plantea uno de los principales desafíos actuales para la humanidad. El clima es un bien común, de todos y para todos. #LaudatoSi “Un crimen contra la naturaleza es un crimen contra nosotros mismos y un pecado contra Dios.” (Patriarca Bartolomé) La cultura del descarte de hoy obliga a un nuevo estilo de vida. Se ha de reconocer el valor propio de cada criatura. Debemos buscar otros modos de entender la economía y el progreso. Hay una íntima relación entre los pobres y la fragilidad del planeta. #LaudatoSi Necesitamos un nuevo diálogo sobre el modo como estamos construyendo el futuro del planeta. Invito a todos a detenerse a pensar en los desafíos sobre el medio ambiente. #LaudatoSi La Iglesia de hoy es la Iglesia de los mártires: tantos testigos heroicos. Aprendamos de su valor. Donde no hay trabajo, no hay dignidad. En el sacramento de la Eucaristía encontramos a Dios que se da a sí mismo. Es necesario construir la sociedad a la luz de las Bienaventuranzas, caminar  hacia el Reino en la compañía de los últimos. La luz del Evangelio guía a quien se pone al servicio de la civilización del amor. Señor, concédenos la gracia del estupor en el encuentro contigo. El cristiano no es testigo de una teoría, sino de una Persona: Cristo resucitado, que está vivo y es el único Salvador de todos. Practiquemos el cuarto mandamiento visitando con cariño a nuestros padres ancianos. Invoquemos todos los días al Espíritu Santo. Es Él quien nos guía por el camino de los discípulos de Cristo. Envía, Señor, tu Espíritu Santo a consolar y confortar a los cristianos perseguidos. #free2pray Hay silencios de Dios que sólo se pueden entender mirando a Cristo en la cruz. Dios siempre nos espera, siempre nos comprende, siempre nos perdona. Es mejor una Iglesia herida, pero que hace camino, que una Iglesia enferma porque se cierra en sí misma. Queridos padres y madres, hay que tener mucha paciencia y perdonar de corazón. ¿Por qué nos resulta tan difícil sobrellevar los defectos de los demás? ¿Nos olvidamos de que Jesús cargó con todos nuestros pecados? Aprendamos a ser amables, a tratar bien a todos, incluso a aquellos que no nos corresponden. Cuando no es posible ganarse el pan, se pierde la dignidad. Es un drama en nuestros días, especialmente para los jóvenes. Nos viene bien estar un rato ante el Sagrario, para sentir sobre nosotros la mirada de Jesús. El amor de Cristo llena nuestros corazones y nos hace capaces de perdonar siempre. Frente a tantos problemas, algunos de ellos graves, no perdamos la esperanza en la misericordia infinita de Dios. Toda comunidad cristiana debería ser un hogar acogedor para cuantos buscan a Dios o necesitan un hermano que los escuche. Nosotros, los cristianos, estamos llamados a salir de nuestros \"muros\" para llevar a todos la misericordia y la ternura de Dios. En los sacramentos encontramos fuerza para pensar y obrar según el Evangelio. Hemos de cuidar la tierra para que siga siendo, como Dios quiere, fuente de vida para toda la familia humana. María, Madre Dolorosa, ayúdanos a descubrir la voluntad de Dios en  los momentos de mayor sufrimiento. El Señor no se cansa nunca de perdonarnos. Somos nosotros los que nos cansamos de pedir perdón. Si el Evangelio arraiga profundamente en nuestras vidas, seremos capaces de llevarlo a los demás. Señor, concédenos la gracia de las lágrimas, para llorar por nuestros pecados y recibir tu perdón. Señor, ayúdanos a vivir la virtud de la magnanimidad, para poder amar sin límites. ¡Cristo ha resucitado! ¡Cristo vive y camina con nosotros! La Cruz de Cristo no es una derrota: la Cruz es amor y misericordia. Jesús lava los pies a los apóstoles. ¿Estamos dispuestos a servir también nosotros así a los demás? La Confesión es el sacramento de la ternura de Dios, su forma de acogernos. La Semana Santa es el tiempo que más nos pide estar cerca de Jesús: la amistad se demuestra en las dificultades. Como discípulos de Cristo, no podemos dejar de preocuparnos por el bien de los más débiles. La vida es un tesoro precioso, pero sólo lo descubrimos si lo compartimos con los demás. Los fieles laicos están llamados a ser fermento de vida cristiana en la sociedad. El sufrimiento es una llamada a la conversión: nos recuerda que somos débiles y vulnerables. Que las comunidades cristianas sean lugar de misericordia en medio de tanta indiferencia. Dejemos que Dios nos colme de su bondad y de su misericordia. La Cuaresma es un tiempo para acercarse a Cristo por medio de la Palabra de Dios y los sacramentos. ¡Cuidado con la comodidad! Cuando nos acomodamos olvidamos fácilmente a los demás. En los momentos más terribles, recordad: Dios es nuestro Padre; Dios no abandona a sus hijos. La humildad salva al hombre; la soberbia le hace errar el camino. Construyamos nuestra vida de fe sobre la roca, que es Cristo. Si estamos demasiado apegados a las riquezas, no somos libres. Somos esclavos. El corazón se endurece cuando no ama. Señor, danos un corazón que sepa amar. Jesús intercede por nosotros, cada día. Oremos: Señor, ten piedad de mí; intercede por mí. No hay pecado que Dios no pueda perdonar. Basta que pidamos perdón. Los Sacramentos manifiestan la ternura y el amor del Padre con cada uno de nosotros. Donde hay hombres y mujeres que han consagrado su vida a Dios, hay alegría. Señor, concédenos la gracia de reconocernos pecadores. Durante la Cuaresma, hallemos modos concretos para superar nuestra indiferencia. Jesús ha venido a traernos la alegría a todos y para siempre. Jesús no es un personaje del pasado: también hoy sigue iluminando el camino del hombre. Tener fe no quiere decir que no tengamos dificultades en la vida, sino que somos capaces de afrontarlas sabiendo que no estamos solos. Todos somos pecadores, llamados a la conversión del corazón. Hoy es urgente dar un testimonio creíble de la verdad y de los valores del Evangelio. Recemos por las víctimas de la explosión en el hospital de Cuajimalpa, México, y por sus familiares que el Señor les conceda paz y fortaleza El verdadero amor no tiene en cuenta el mal recibido. Goza haciendo el bien. Auschwitz es un grito de dolor que, en ese gran sufrimiento, está pidiendo un futuro de respeto, de paz y de encuentro entre los pueblos. Practicar la caridad es la mejor forma de evangelizar. Cada Vida es un Don. #marchforlife A mis amigos de Sri Lanka y Filipinas: Que Dios los bendiga a todos. Por favor, recen por mí. Muchas veces perdemos de vista lo realmente importante. Nos olvidamos de que somos hijos de Dios. Como cristianos, miembros de la familia de Dios, estamos llamados a salir al encuentro de los necesitados y servirlos. La com-pasión de Dios, que ha querido sufrir con nosotros, da sentido y valor a nuestros trabajos y sufrimientos. La familia es el tesoro más grande de un país. Esforcémonos todos en proteger y afianzar esta piedra angular de la sociedad. Las Islas Filipinas son un testimonio de la juventud y de la vitalidad de la Iglesia. Que el Señor bendiga y proteja a Sri Lanka. San José Vaz, enséñanos a crecer en santidad y a vivir el mensaje de misericordia del Evangelio. Hoy, que comienza mi viaje a Sri Lanka y Filipinas, les pido que recen conmigo por estos dos países. El domingo es el día del Señor: reservemos un tiempo para estar con Él. #PrayersForParis Jesús ha venido a salvarnos: no rechacemos este maravilloso don. Señor, enséñanos a reconocerte en los enfermos, en los necesitados y en cuantos sufren. El cristianismo se extiende gracias a la alegría de discípulos que se sienten amados y salvados. Muchos niños y personas inocentes sufren en el mundo. Señor, concédenos tu paz. Gracias, Señor. Hoy se sufre por carencias materiales, pero también por falta de amor. La familia cristiana es misionera: anuncia al mundo el amor de Dios. Pidamos hoy por todos los perseguidos a causa de su fe cristiana. Con Jesús está la verdadera alegría. Esforcémonos en escuchar y en estar en silencio para abrir las puertas a la belleza de Dios. A veces el pecado nos tiene esclavizados. Señor, ven y sálvanos. Para que Jesús sea el centro de nuestra vida, es necesario ponernos en su presencia ante el Sagrario. El Señor lo ha dicho claramente: No se puede servir a dos amos. O Dios o las riquezas. ¡Qué importante es aprender a escuchar! El diálogo entre esposos es esencial para que una familia viva en paz. Hoy es el aniversario de mi ordenación sacerdotal. Les ruego que recen por mí y por todos los sacerdotes. Nuestra Señora de Guadalupe, ruega por nosotros. La cuestión ecológica es vital para la supervivencia del hombre y tiene una dimensión moral que atañe a todos. La familia es una comunidad de amor, en la que aprendemos a relacionarnos con los demás y con el mundo. Aprendamos de la Virgen María a seguir la Palabra de Dios con ánimo generoso. Mi video mensaje para los Cristianos de Irak\n\nhttp://t.co/bhpOEsihni El Adviento nos invita a iniciar un nuevo camino. Dejémonos guiar por María, nuestra Madre. El tiempo de Adviento nos infunde esperanza, una esperanza que no defrauda. El Señor nunca falla. Nunca más esclavos. Todos somos hermanos. #EndSlavery La Iglesia está llamada a hacerse cercana a todas las personas, comenzando por los más pobres y los que sufren. El amor es la medida de la fe. Cuando vemos que alguien pasa realmente necesidad ¿reconocemos en él el rostro de Dios? Comportémonos como pide nuestra vocación cristiana. ¡Cuánto ruido hay en el mundo! Aprendamos a estar en silencio en nuestro interior y ante Dios. Un cristiano da paz a los demás. Y no sólo paz, sino también amor, bondad, fidelidad y alegría. La guerra destruye, mata, causa pobreza. Señor, danos tu paz. ¡Qué importante es el trabajo: para la dignidad humana, para formar una familia, para la paz! Pido la colaboración a las personas de buena voluntad a crear una cultura del encuentro, de la solidaridad y de la paz. #fotw25 La Iglesia siempre está en camino, buscando nuevas formas de anunciar el Evangelio. Quien se dice cristiano no puede permanecer indiferente a las necesidades de los demás. La humildad nos ayuda a sobrellevarnos mutuamente. ¡Cuánto bien podemos hacer con el buen ejemplo y cuánto mal con la hipocresía! La misión principal de la Iglesia es evangelizar: llevar la Buena Noticia a todos. Ayudemos a los demás a descubrir la alegría del mensaje cristiano: un mensaje de amor y de misericordia. En la cruz de Jesús se puede ver toda la fuerza del mal, pero también toda la omnipotencia de la misericordia de Dios. En la familia nos formamos como personas. Cada familia es una piedra viva en la construcción de la sociedad. Una fe fuerte y saludable se alimenta constantemente de la Palabra de Dios. Para cambiar el mundo, es necesario hacer el bien a quien no puede darnos nada a cambio. El cristiano es necesariamente misericordioso: la misericordia es el centro del Evangelio. Conforta, Señor, a cuantos sufren, especialmente a los enfermos, a los necesitados, a los desempleados. La fuerza espiritual de los sacramentos es inmensa. Con la gracia podemos superar cualquier obstáculo. Queridos jóvenes, Cristo cuenta con ustedes para que sean sus amigos y testigos de su amor infinito. Pidamos al Señor la gracia de no hablar mal de nadie, de no criticar, de no chismorrear, de querer a todos. Ven, Espíritu Santo, derrama sobre nosotros tus dones durante este Sínodo. #prayforsynod Al comenzar el Sínodo sobre la Familia, pidamos al Señor que nos muestre el camino. #prayforsynod Como Jesús le dijo a Marta en el Evangelio, sólo una cosa es necesaria: orar. #praywithus La Iglesia y la sociedad necesita familias felices. #prayforsynod Sínodo quiere decir caminar juntos, y también orar juntos. Pido a todos los fieles que participen. #praywithus La división en una comunidad cristiana es un pecado gravísimo, es obra del diablo. La tendencia a estar centrados en nosotros mismos y en nuestras ambiciones personales, quizás sea muy humana, pero no es cristiana. Jesús comprende nuestras debilidades, nuestros pecados, y si nos dejamos perdonar Él nos perdona. Cuando en una sociedad falta Dios, incluso la prosperidad va acompañada de una terrible pobreza espiritual. Queridos jóvenes, estén atentos a su interior: Cristo llama a la puerta de su corazón. María, concédenos la gracia de gozar de la libertad de los hijos de Dios. El Señor siempre nos espera para acogernos con su amor: es algo estupendo, que nunca deja de sorprendernos. A pesar de nuestros pecados, podemos repetir como Pedro: Señor, tú lo sabes todo, tú sabes que te amo. No podemos confiar sólo en nuestras fuerzas, sino en Jesús y en su misericordia. La fidelidad de Dios es más fuerte que nuestra infidelidad y nuestras traiciones. Jesús es el Buen Pastor. Nos busca y está cerca de nosotros aunque seamos pecadores, sobre todo porque somos pecadores. Cada día rezo por quienes sufren en Irak. Recen conmigo. http://t.co/9Wtv9XFfAG Nuestro testimonio cristiano es auténtico si es fiel e incondicionado. Está huérfano el cristiano que no percibe a la Virgen María como Madre. El Señor siempre nos perdona y nos acompaña. Es cuestión nuestra dejarnos perdonar y acompañar. Cristo en la cruz nos enseña a amar, también a los que no nos aman. No se puede medir el amor de Dios: es infinito. Un cristiano sabe dar. Su vida está llena de sencillos gestos de generosidad hacia los demás. Pidamos al Señor esta gracia: que nuestro corazón sea libre y luminoso, para tener así la alegría de los hijos de Dios. Gracias, amigos coreanos. Con la ayuda de Dios, volveré muy pronto a Asia. #Philippines #SriLanka Muchas personas inocentes se han visto obligadas a abandonar sus hogares en Irak. Señor, te pedimos que puedan regresar pronto. ¡Tengan fe en el poder de la cruz de Cristo! ¡Acojan su gracia reconciliadora y compártanla con los demás! Señor, que, ante tanta violencia en Irak, perseveremos en la oración y en la generosidad. La misericordia de Dios nos salva. No nos cansemos nunca de anunciar en todo el mundo este mensaje gozoso. Pidamos para que la Iglesia sea cada vez más santa y humilde, y sepa amar a Dios sirviendo a los pobres, a las personas solas y enfermas. No olvidemos el clamor de los cristianos y de cuantos sufren persecución en Irak. Los mártires nos enseñan que la riqueza, el prestigio y el honor son de poca importancia: Cristo es el único y verdadero tesoro. Se me parte el corazón cuando pienso en los niños de Irak. Que la Virgen María, nuestra Madre, los proteja. Queridos jóvenes, Cristo los llama a estar atentos y vigilantes para reconocer lo que realmente importa en la vida. María, Reina del Cielo, ayúdanos a transformar el mundo según el designio de Dios. María, Reina de la paz, ayúdanos a erradicar el odio y a vivir en armonía. San Juan Pablo II, ruega por nosotros, y especialmente por nuestros jóvenes. Dios bendiga a Corea y en especial a sus ancianos y jóvenes. Gracias a cuantos están ayudando con valentía a nuestros hermanos y hermanas en Irak. Al comenzar mi viaje a Corea, los invito a unirse a mi oración por este País y por toda Asia. Un llamado a todas las familias: cuando recen, acuérdense de cuantos son obligados a abandonar sus casas en Iraq.\n#PrayForPeace Las noticias que llegan desde Iraq nos entristecen. Señor, enséñanos a vivir en solidaridad con los hermanos que sufren. Las personas despojadas de sus casas en Iraq dependen de nosotros. Les invito a rezar y, quien pueda, a ofrecer una ayuda concreta. La violencia no se vence con más violencia. Señor, haz que haya paz en nuestros días. #PrayForPeace Pido a la comunidad internacional que proteja a todas las víctimas de la violencia en Iraq. Pido a todas las parroquias y comunidades católicas que en este fin de semana dediquen una oración especial por los cristianos iraquíes. Señor, te rogamos que ayudes a aquellos que en Iraq carecen de todo. #prayforpeace Les ruego que dediquen hoy un momento a rezar por todos aquellos que son obligados a dejar su casa en Iraq. #PrayForPeace Pido a todos los hombres de buena voluntad que se unan a mis oraciones por los cristianos iraquíes y por todas las comunidades perseguidas. El cristiano es aquel que sabe abajarse para que el Señor crezca, en su corazón y en el de los demás. Si acumulas las riquezas como un tesoro te roban el alma. Cuando no se adora a Dios, se adoran otras cosas. Dinero y poder son ídolos que a menudo ocupan el puesto de Dios. Deseo que cada familia redescubra la oración doméstica: esto también ayuda a comprenderse y perdonar. Apreciemos más el trabajo de los empleados domésticos y de los que cuidan a los menores, ancianos o inválidos: es un servicio valioso. Cuando se vive apegado al dinero, al orgullo o al poder, es imposible ser feliz. El gran peligro en el mundo actual es el triste individualismo que nace del corazón avaro. Dios ama al que da con alegría. Aprendamos a dar generosamente, desprendiéndonos de los bienes materiales. La Iglesia es misionera por naturaleza: existe para que todo hombre y mujer puedan encontrarse con Jesús. Queridos jóvenes, no caigan en la mediocridad; la vida cristiana es para alcanzar nobles ideales. Los Mundiales lograron el encuentro de personas de varias naciones y religiones. Que el deporte promueva siempre la cultura del encuentro. No tengan miedo de lanzarse en los brazos de Dios. Todo lo que les pida, lo recompensará con el ciento por uno. Con Dios nada se pierde, pero sin Él todo está perdido. Queridos jóvenes, no renuncien a soñar por un mundo más justo. Vivir como verdaderos hijos de Dios significa amar al prójimo y acercarnos a quien está solo y en dificultad. Jesús, ayúdanos a amar a Dios como Padre y a nuestro prójimo como a un hermano. Que los Santos Apóstoles Pedro y Pablo bendigan a la ciudad de Roma y a la Iglesia que peregrina aquí y en todo el mundo. Ser amigos de Dios significa orar con sencillez, como un niño le habla a su padre. Frente a las dificultades de la vida, pidamos al Señor que permanezcamos firmes en el testimonio gozoso de nuestra fe. La familia es un elemento esencial de todo desarrollo humano y social sostenible. ¡Cuánto me gustaría ver a todos con un trabajo decente! Es algo esencial a la dignidad humana. Pidamos por las comunidades cristianas de Oriente Medio, para que puedan vivir allí, donde el cristianismo tiene sus orígenes. Hay mucha indiferencia ante el sufrimiento. Esta indiferencia debe ser contrastada con actos concretos de caridad. Nunca hay motivos para perder la esperanza. Jesús dice: «Yo estoy con ustedes hasta el fin del mundo». A veces descartamos a los ancianos, pero ellos son un tesoro precioso: descartarlos es injusto y una pérdida irreparable. Que el Señor bendiga a la familia y la haga fuerte en este tiempo de crisis. Corremos el riesgo de ignorar el sufrimiento que no está cerca de nosotros. Reaccionemos y pidamos por la paz en Siria. No resistamos al Espíritu Santo, seamos dóciles a su acción que nos renueva a nosotros, a la Iglesia y al mundo. Les deseo a todos que puedan disfrutar de un maravilloso Mundial de fútbol, con un espíritu de verdadera fraternidad. No critiquemos a los demás a sus espaldas, digámosles abiertamente lo que pensamos. Hoy les pido a todos los hombres de buena voluntad que se unan a nuestra oración por la paz en Oriente Medio. #weprayforpeace La oración lo puede todo. Pidamos por la paz en Oriente Medio y en todo el mundo. #weprayforpeace La paz es don de Dios, pero requiere nuestro compromiso. Seamos gente de paz con la oración y en la acción. #weprayforpeace Como el Buen Samaritano,no nos avergoncemos de tocar las heridas de los que sufren;más aún,tratemos de curarlas con obras concretas de amor. Gracias a todos los maestros: educar es una misión importante, que acerca a tantos jóvenes al bien, a la belleza y a la verdad. A veces nos encerramos en nosotros mismos... Señor, ayúdanos a salir al encuentro de los demás, a servir a los más débiles. En los momentos difíciles de la vida, el cristiano encuentra amparo bajo el manto de la Madre de Dios. Todo cristiano, en su puesto de trabajo, puede dar testimonio, con sus palabras y más aún con una vida honrada. Entablemos una profunda amistad con Jesús: así podremos seguirlo de cerca y vivir con Él y para Él. Queridos amigos, les pido que me acompañen con su oración durante mi peregrinación a Tierra Santa. Vivir con fe significa poner toda nuestra vida en manos de Dios, especialmente en los momentos más difíciles. Quien se deja guiar por Dios nunca queda decepcionado ni pierde el camino. ¡Ven, Espíritu Santo! Ayúdanos a superar nuestro egoísmo. Quien escucha atentamente la Palabra de Dios y reza de verdad, siempre pregunta al Señor: ¿Qué quieres de mí? El mes de mayo, dedicado a la Virgen María, es un momento oportuno para comenzar a rezar el Rosario todos los días. Nuestra meta como cristianos es configurarnos cada vez más con Jesús, que es modelo para nuestra vida Pidamos al Espíritu Santo la gracia de tomar decisiones concretas en nuestra vida de acuerdo a la lógica de Jesús y de su Evangelio. Leamos el Evangelio, un poco todos los días. Así aprenderemos a vivir lo esencial: el amor y la misericordia. Nuestra vida fue salvada por la sangre de Cristo. Dejémonos renovar siempre por este amor. Unámonos todos en oración por la inmediata liberación de las niñas secuestradas en Nigeria. #BringBackOurGirls Una familia iluminada por el Evangelio es una escuela de vida cristiana. Allí se aprende la fidelidad, la paciencia y el sacrificio. La santidad exige cada día la entrega con sacrificio; por eso el matrimonio es un camino para ser santos. En la familia se aprende a amar y a reconocer la dignidad de todas las personas, especialmente a las más débiles. Una sociedad que abandona a los niños y a los ancianos cercena sus raíces y oscurece su futuro. ¿Qué significa evangelizar? Dar testimonio con alegría y sencillez de lo que somos y creemos. No tengas miedo, abre las puertas a Cristo. Nadie es más paciente que Dios Padre. Nadie comprende y sabe esperar como Él. Les pido a quienes tienen responsabilidad política de no olvidar dos cosas: la dignidad humana y el bien común. ¿Quién puede presumir de no ser un pecador? Ninguno. Pidamos perdón al Señor por nuestros pecados. La desigualdad es la raíz de los males sociales. Nadie puede sentirse exceptuado de la preocupación por los pobres y por la justicia social (EG 201) Nunca nos dejemos arrastrar por la vorágine del pesimismo. La fe mueve montañas. Un estilo de vida sobrio nos hace bien y nos ayuda a compartir lo que tenemos con quien pasa necesidad. Cada encuentro con Jesús nos colma de alegría, aquella alegría profunda que sólo Dios nos puede dar. ¡Cristo ha resucitado! ¡Aleluya! Seguir de cerca a Jesús no es fácil, porque  la vía que Él elige es la vía de la cruz. Cada encuentro con Jesús nos cambia la vida. La Semana Santa es un buen momento para confesarse y retomar el camino correcto. Qué dulce es ponerse delante del Crucifijo, quedarse simplemente bajo la mirada llena de amor del Señor. (EG 264) Sólo la confianza en Dios puede transformar la duda en certeza, el mal en bien, la noche en alba radiante. Jesús nos enseña a no avergonzarnos de tocar la miseria humana, de tocar su carne en los hermanos que sufren. (EG 270) Necesitamos recuperar el espíritu contemplativo, para que el amor de Dios enardezca nuestros corazones. ¡Cuánto bien nos hace que el Señor sacuda nuestra vida tibia y superficial! En el Evangelio podemos escuchar cada día a Jesús que nos habla: llevemos siempre con nosotros un pequeño Evangelio. Con Jesús, la vida se hace plena. Con Él es más fácil encontrar sentido a todo. (EG 266) No podemos acostumbrarnos a las situaciones de humillación y de miseria que nos rodean. Un cristiano tiene que reaccionar. Queridos padres, enseñen a rezar a sus hijos. Recen con ellos. La Cuaresma es el tiempo para cambiar de rumbo, para reaccionar ante el mal y la miseria. Vivimos en una sociedad que pretende dejar de lado a Dios; y esto, día tras día, narcotiza el corazón. Todos tenemos que mejorar, que cambiar para ser mejor, la Cuaresma nos ayuda a luchar contra nuestros defectos. La Cuaresma es un tiempo de gracia, un tiempo para convertirse y vivir en coherencia con el bautismo. No podemos ser discípulos a medias. La Iglesia necesita de nuestra valentía para que demos testimonio de la verdad. Jesús nunca está lejos de nosotros pecadores. Él quiere derramar sobre nosotros, sin medida, toda su misericordia. Jesús es nuestra esperanza. Nada, ni siquiera el mal y la muerte, podrá separarnos de la fuerza salvífica de su Amor. La enfermedad y la muerte no son tabú. Son realidades que debemos afrontar en presencia de Jesús. Aprendamos a decir “gracias” a Dios, a los demás. Lo enseñamos a los niños, pero luego lo olvidamos. Un saludo a la Red Mundial de Escuelas para el Encuentro.\nHoy plantamos el primer olivo virtual por la paz. @infoscholas El amor cristiano es un amor sin cálculos. Ésta es la lección del Buen Samaritano; ésta es la lección de Jesús. Gracias por todas las expresiones de afecto recibidas en este primer aniversario. Por favor, sigan rezando por mí. Recen por mí. El reto de los esposos cristianos: estar juntos, aprender a amarse para siempre y buscar el modo de que el amor crezca. Nuestro gozo más profundo viene de Cristo: estar con Él, caminar con Él, ser sus discípulos. Recemos por los cristianos que son perseguidos, para que sepan vencer el mal con el bien. La Cuaresma es un tiempo propio para las renuncias. Privémonos cada día de algo para ayudar a los demás. Todos nos equivocamos en la vida. Reconozcamos nuestros errores y pidamos perdón. ¿Cómo ser felices en el matrimonio? Unidos en el Señor, que hace siempre nuevo el amor y más fuerte que ninguna dificultad. Un saludo agradecido a todos los que se dedican a la enseñanza en las escuelas católicas. Educar es un acto de amor, es como dar la vida. Para nosotros, la Eucaristía es algo esencial: en ella Cristo quiere entrar en nuestra vida y llenarla con su gracia. En las familias, es normal hacerse cargo de quien lo necesita. No tengan miedo a la fragilidad. Todos los bautizados somos discípulos misioneros, llamados a ser en el mundo Evangelio vivo. La Virgen María está siempre a nuestro lado, sobre todo cuando sentimos el peso de la vida con todos sus problemas. ¡No perdamos nunca la esperanza! Dios nos ama siempre, incluso con nuestros errores y nuestros pecados. La Confirmación es importante para el cristiano; nos da fuerzas para defender la fe y anunciar el Evangelio con entusiasmo. Señor Jesús, que seamos capaces de amar como tú. Aprendamos de Jesús a rezar, a perdonar, a sembrar la paz, y a estar cerca de los necesitados. Queridos hermanos enfermos, no pierdan la esperanza, ni siquiera en los momentos de mayor dificultad. Cristo está a su lado. Pidamos por la paz en África, especialmente en la República Centroafricana y Sudán del Sur. #prayforpeace Queridos jóvenes, no tengan miedo a casarse. Unidos en matrimonio fiel y fecundo, serán felices. Pidamos por los seminaristas, para que, oyendo la voz del Señor, la sigan con decisión y alegría. Saludo a los enfermos y a cuantos sufren. Cristo crucificado está con ustedes: acójanse a Él. Recemos hoy juntos por Su Santidad Benedicto XVI, un hombre valiente y humilde. Pidamos por todos los sacerdotes buenos y fieles, que se entregan a los demás con generosidad y abnegación, sin hacer ruido. Los sacramentos, especialmente la Penitencia y la Eucaristía, son momentos privilegiados para el encuentro con Cristo. Cuando nos inunda el amor de Dios, la vida adquiere otro sabor. El mundo nos hace preocuparnos por nosotros mismos, por tener, por el placer. El Evangelio nos abre a los demás, a compartir con los pobres. Queridos jóvenes, Jesús nos da vida, vida en abundancia. Con Él, siempre tendremos alegría en el corazón y una sonrisa en los labios. Es importante tener amigos en quien poder confiar. Pero es esencial tener confianza en el Señor, que nunca falla. Que la Jornada Mundial de la Vida Consagrada sea una ocasión propicia para redescubrir la centralidad de Jesucristo en nuestra vida. A veces estamos tristes a causa de nuestros pecados. No nos desanimemos: Cristo ha venido a liberarnos. Él es nuestra paz. Nadie se salva solo. La dimensión comunitaria es esencial en la vida cristiana. No me imagino un cristiano que no sea capaz de sonreír. Demos testimonio gozoso de nuestra fe. Oremos por la unidad de los cristianos. ¡Son tantas y tan valiosas las cosas que nos unen! Queridos jóvenes, no se conformen con una vida mediocre. Déjense seducir por lo que es verdadero y bueno, por Dios. Es fácil recurrir a Dios para pedirle, todos lo hacemos. ¿Cuándo aprenderemos también a darle gracias y adorarle? Estamos llamados a vivir cada día nuestro Bautismo, como nuevas criaturas, revestidos de Cristo. Como María, conservemos la luz encendida en Navidad, y llevémosla a todas partes, en la vida cotidiana. Rezo por la Marcha por la Vida en Washington. ¡Que Dios nos ayude a respetar siempre la vida, especialmente la de lo más débiles! Si vivimos la fe en la vida diaria, el trabajo se convierte en una oportunidad  para transmitir la alegría de ser cristianos. No nos limitemos a decir que somos cristianos. Debemos vivir la fe, no sólo con las palabras, sino también con obras. Las guerras destrozan muchas vidas. Pienso especialmente en los niños a los que les han robado su infancia. ¡Qué poderosa es la oración! No perdamos nunca el ánimo para decir: Señor, concédenos tu paz. Pidamos por la paz, y busquemos construirla, comenzando desde casa. Demos siempre gracias a Dios, sobre todo por su paciencia y misericordia. El Señor llama a la puerta de nuestro corazón. ¿Quizás hemos colocado un pequeño cartel que dice: “No molestar”? Ningún anciano debe estar “exiliado” de nuestra familia. Los ancianos son un tesoro para la sociedad. No pasemos de largo ante el Niño de Belén. Dejemos que nuestro corazón se conmueva. Contemplemos la humildad del Hijo de Dios, que ha nacido pobre. Imitémosle compartiendo con los más débiles. Dejemos un puesto libre en la mesa: un puesto para el que carece de lo necesario, para el que se ha quedado solo. Queridos amigos, muchas gracias por las felicitaciones que me han enviado con motivo de las fiestas navideñas. Que Dios les bendiga. Queridos jóvenes, Jesús quiere ser su amigo; y quiere que ustedes transmitan por doquier la alegría de esta amistad. El Niño Jesús revela la ternura del inmenso amor con el que Dios nos rodea a cada uno Jesus Menino revela a ternura do amor imenso com que Deus envolve cada um de nós. Dios no se revela en la fuerza o en el poder, sino en la debilidad y en la fragilidad del recién nacido. Aprendamos del pesebre la alegría y la paz profunda que Jesús viene a traer al mundo. En el rostro del Niño Jesús contemplamos el rostro de Dios. ¡Venid a adorarlo! María, nuestra Madre, es toda belleza porque está llena de gracia. Que la alegría del Evangelio esté siempre en sus corazones, especialmente en este tiempo de Navidad. Ante el portal de Belén, recemos de modo especial por los que sufren persecución a causa de su fe. En Navidad Cristo viene entre nosotros: es el momento adecuado para un encuentro personal con el Señor. El Señor viene. ¡Recibámoslo con el corazón abierto! La Navidad suele ser una fiesta ruidosa: nos vendría bien estar un poco en silencio, para oír la voz del Amor. El Adviento es un camino hacia Belén. Dejémonos atraer por la luz de Dios hecho hombre. Intentemos vivir la Navidad en coherencia con el Evangelio, poniendo a Jesús en el centro de nuestra vida. Pidamos a Dios la gracia de que nadie más muera de hambre en el mundo. El amor de Dios no es indiferenciado. Dios mira con cariño a cada uno, con nombre y apellidos. No nos resignemos a un Oriente Medio sin cristianos. Recemos todos los días por la paz. El futuro está en las manos de Dios: en esto radica la esperanza cristiana. No temas acercarte al Sacramento de la Confesión; en él encontrarás a Jesús que te perdona. No se puede concebir una Iglesia sin alegría. Ésta es la alegría de la Iglesia: anunciar a todos el nombre de Jesús. María, Madre nuestra, ampáranos en los momentos de oscuridad,  de dificultad y de aparente derrota. Si alguien nos pide ayuda, ¿nos paramos? ¡Hay tanto sufrimiento y pobreza, y tanta necesidad de buenos samaritanos! Queridos jóvenes, les invito a poner sus talentos al servicio del Evangelio, con creatividad y con una caridad sin fronteras. La cruz es el precio del amor verdadero. Señor, danos fuerza para aceptar nuestra cruz y cargar con ella. La santidad no consiste en hacer cosas extraordinarias, sino en hacer las ordinarias con amor y con fe. Hace 50 años, el Vaticano II habló sobre la comunicación: Escuchar, dialogar y llevar a Cristo a cuantos encontramos en la vida. Todos estamos llamados a la amistad con Jesús. No tengan miedo al amor del Señor. ¿Son grandes tus pecados? Di al Señor: Perdóname, ayúdame a levantarme de nuevo, convierte mi corazón. La Iglesia invita a todos a acogerse al amparo de la ternura y el perdón del Padre. Nos resulta difícil perdonar a los otros. Señor, concédenos tu misericordia para ser capaces de perdonar siempre. Seamos dóciles a la Palabra de Dios, atentos a las sorpresas del Señor, que nos habla. La Iglesia es misionera. Cristo nos envía a llevar la alegría del Evangelio a todo el mundo. Vivir la caridad significa no buscar nuestro propio interés, sino llevar los pesos de los más débiles y pobres. Los sacramentos son la presencia de Jesucristo en nosotros. Por eso es importante confesarse y comulgar. El Reino de los cielos es para aquellos que ponen su confianza en el amor de Dios y no en las cosas materiales. Ser santos no es privilegio de unos pocos, sino una vocación para todos. Los santos no son superhombres. Son personas que tienen el Amor de Dios en su corazón y comunican esta alegría a los demás. Nos cuesta un poco confesar nuestros pecados, pero nos da paz. Somos pecadores y tenemos necesidad del perdón de Dios. Jesús ha conservado sus llagas para hacernos ver su  misericordia. Ésta es nuestra fuerza y nuestra esperanza. Queridos jóvenes, sean siempre misioneros del Evangelio, cada día y en todo lugar. Cuiden la creación. Pero, sobre todo, cuiden a las personas que no tienen lo necesario para vivir. Tengamos presentes a Filipinas, Vietnam y la región afectada por el tifón Haiyan. Seamos solidarios con la oración y con la ayuda concreta. Dios nos ama. Descubramos la belleza de amar y de ser amados. Nuestra vida debe centrarse en lo esencial: en Jesucristo. Todo lo demás es secundario. Está para concluir el Año de la fe. Señor, ayúdanos en este tiempo de gracia a tomar en serio el Evangelio. Los santos son personas que pertenecen totalmente a Dios. No tienen miedo a ser despreciados, incomprendidos o marginados. Es necesario tener valor para ser fieles y coherentes con el Evangelio. Muchas gracias a todos los misioneros, hombres y mujeres que trabajan tanto y sin hacer ruido por el Señor y por los hermanos. La lucha contra el mal es ardua y prolongada; es necesario rezar constantemente y con paciencia. Un cristiano afronta las dificultades, las pruebas, incluso las derrotas, con serenidad y esperanza en el Señor. Si los bienes materiales y el dinero se convierten en el centro de la vida, nos atrapan y nos esclavizan. Todos somos pecadores. Dios nos perdona con un derroche de gracia, misericordia y ternura. Queridos Followers ¡ya son ustedes más de 10 millones! Les agradezco de corazón y les ruego que sigan rezando por mí. Muchas veces contribuimos a la globalización de la indiferencia; intentemos, más bien, vivir una solidaridad global. La cultura del descarte produce muchos frutos amargos, como el desperdicio de alimentos y el aislamiento de muchos ancianos. Ser cristiano implica renunciar a nosotros mismos, tomar la cruz y llevarla con Jesús. No hay otro camino. El Crucifijo no nos habla de derrota, de fracaso; nos habla de un Amor que vence al mal y al pecado. Para conocer al Señor es necesario cultivar el trato con Él: escucharlo en silencio ante el Sagrario, acercarse a los Sacramentos. Seguir a Jesús significa ponerlo en primer lugar, despojándonos de tantas cosas que ahogan nuestro corazón. No nos resignemos ante el mal. Dios es Amor que ha vencido al mal con la muerte y resurrección de Cristo. Nuestra oración no se puede reducir a una hora el domingo; es importante tener una relación cotidiana con el Señor. Queridos jóvenes, no tengan miedo a dar pasos definitivos en la vida. Tengan confianza, el Señor no los abandonará. ¡Señor, ten piedad! Muchas veces nuestras vidas cómodas nos ofuscan y nos impiden ver a los que mueren a nuestro lado. #Lampedusa Cuando nos encontremos con la cruz, digamos a María: ¡Madre nuestra, danos fuerza para aceptar y abrazar la cruz! El misterio de la cruz, misterio de amor, sólo se puede comprender en la oración. Recen y lloren de rodillas ante la cruz. El secreto de la vida cristiana es el amor. Sólo el amor llena los vacíos, las profundidades negativas que el mal crea en los corazones. La misericordia es lo único que puede salvar al hombre y al mundo del pecado y del mal. Queridos jóvenes, ustedes tienen muchos proyectos y sueños para el futuro. ¿Ponen a Cristo en el centro de sus proyectos y de sus sueños? ¿Rezamos de verdad?  Sin una relación constante con Dios, es difícil llevar una vida cristiana auténtica y coherente. Donde haya odio y oscuridad, pongamos un poco de amor y de esperanza, para darle un rostro más humano a la sociedad. Todos los matrimonios pasan por momentos difíciles, pero estos encuentros con la Cruz nos fortalecen para recorrer el camino del amor. No nos hacemos cristianos por nuestras propias fuerzas. La fe es un don de Dios que se nos da en la Iglesia y por medio de la Iglesia. ¡El perdón de Dios es más fuerte que cualquier pecado! Pidamos al Señor ternura para ver a los pobres con comprensión y amor, sin cálculos y sin temores. La Iglesia no tiene otra razón de ser ni otra finalidad que dar testimonio de Jesús. No lo olvidemos. La verdadera caridad es un poco atrevida: no tengamos miedo a ensuciarnos las manos para ayudar a los más necesitados."}