{"tweets": "RT @pattonoswalt: Imagine being so hated that on the day you announce that the LEADER OF ISIS HAS BEEN KILLED ON YOUR ORDERS a stadium full… 😭😭😭😭♥️♥️♥️♥️♥️♥️♥️ https://t.co/0QAxRMAWLj RT @Michael43115519: Right behind home plate at The World Series, two men are holding up a \"Veterans for Impeachment\" sign. Every time they… RT @jmichelo: We, the veterans of the USA, must rise and reject this UNFIT occupant of our White House! He is NOT a commander-in-chief, he… @jihadwatchRS @SamHarrisOrg Yes. RT @45rapedkatie5: MISS OBAMA YET?⏬⏬⏬⏬⏬ https://t.co/HmjqQhqJq2 @lucyprebblish I always fight for,”and introducing” YO DALLAS! Where can cool ass SENIORS volunteer for liberal or non partisan causes? This is batshit crazy. And nothing will be done. We tweet our angst into our echo chambers as democracy collapses. https://t.co/VfCTbpUrUs JESUS H https://t.co/tyBFbyFKdy RT @RobertMaguire_: Hate to break it to Whitaker, but when the Founders discussed impeachment, they specifically discussed it as a remedy f… RT @FadelAllassan: This is Trump's former Acting AG -- was head of the DOJ and oversaw the Russia investigation. https://t.co/FgJKyzpPgb RT @byKateSmith: Meanwhile in South Carolina, another effective six-week ban on abortion — with no exceptions for victims of rape or incest… RT @MarkRuffalo: Are you willing to fight for someone you don’t know? https://t.co/NIaE3gS5AW RT @MattOswaltVA: I guess his other shirt, \"Build the wall or I'll gargle your balls\" was at the drycleaners https://t.co/fyylyIkaDK RT @Millicentsomer: “The poll ... finds that an astonishing 55% of Republicans who watch Fox News as their primary news source say there is… RT @robdelaney: Fun find  https://t.co/KcGBE8VfOo @Spartan31111 Absolutely but weapons of war shouldn’t be accessible to civilians. Most vets will assert that. And certainly not to anyone with a record of crime / domestic violence or mental illness. You disagree? I hate blanket-blaming senate republicans but this falls square on their shoulders. They are prioritizing their A rating w the NRA ($$$) over basic regulations that will save lives https://t.co/h8aKCrxYNJ I'm willing to fight for someone I don't know https://t.co/WJ3X8vYyXx RT @SenSanders: \"School lunch debt\" is not a phrase that should exist.\n\n@Ilhan and I want to eliminate all of it. https://t.co/icVLKvjhIF RT @remain_central: Brilliant demolition of Brexit on live TV.\n\nYou’d never see this on a BBC vox pop.\n\nRachel in Parliament Square tells i… RT @TaikaWaititi: It's punishment for you know what. https://t.co/hv1Duw1AER RT @danagould: I don’t care if you don’t like her. She was right. https://t.co/BVFxCiwvMQ RT @timkmak: The reason you've never heard of Parkrose High School in Portland, Ore -- and why it isn't on this year's list of school  shoo… RT @annamerlan: These two buskers are playing together from opposite sides of the G, fuck, ugh, my heart https://t.co/12OrSkxQUG RT @ScottHech: At the exact time Nielsen wrote this lie, a young mother was detained in Texas, her 2-year-old son ripped from her arms at t… I just got a space heater and I keep singing \nHey space heater/ Heat a little space for me\nto the tune of hey big spender This whole thread to the end https://t.co/L3ok1zLBHl Thread https://t.co/gPFZgnUill https://t.co/nfyNq650WW RT @TheDweck: Oh no what did she do, order a genocide then go tweet about Dancing With the Stars https://t.co/De8HXKSaVI RT @Eugene_Scott: A counselor told Cummings he was too slow to learn &amp; spoke poorly &amp; he would never fulfill his dream of becoming a lawyer… This epidemic is going unnoticed. #TheEpidemic #HardToSee \n[Trigger Warning. Viewer Discretion is Advised]  https://t.co/yDqafcGXCN Awesome ⬇️⬇️⬇️ https://t.co/t0OdxexUJY RT @ianabramson: Mayor Pete: Elizabeth Warren never says HOW she will pay for Medicare for all!\nElizabeth Warren: Taxing the rich.\nPete: Yo… RT @miketheidealist: @SarahKSilverman In case you missed it, here is the ad: https://t.co/S0NVH0X9sv \n\nFrom the amazing people at @FFRF. @A… Cory for the end q win #DemDebate RT @People4Bernie: NOBODY EARNS A BILLION DOLLARS #DemDebate  https://t.co/6xsicvzOuU Did Biden just burp? No judgement just looked away a sec and thought I heard it #DemDebate That Ron Reagan atheism psa to sep church and state is mmuah.  So good #DemDebate Of the top 1% of the 1% pays taxes (instead of the ZERO taxes they pay now) it will make a MASSIVE difference in American’s lives. It’s as simple as that.  #DemDebate Go Cory yas #DemDebate Thank you @KamalaHarris how are we not talking more about women’s motherfucking autonomy  #DemDebate BERNIE is back baby  #DemDebate @ChloeColemanAct @MarryMeMovie We came so close!! Trump betrayed our allies to be of service to murderer Vlad “Major Fred Trump projection” Putin \nhttps://t.co/7Dt4uDz8hg RT @kathygriffin: Im depicted as being murdered by The President of the United States in this video.The left, right &amp; center left me hangin… RT @Alyssa_Milano: I just saw a horrifying video of a mom in Syria crying over her dead child’s body. I’m not posting it here. It’s too nau… RT @GeorgeTakei: Donald, in your great and unmatched wisdom, when do you think those economic consequences on Turkey might start? Asking fo… RT @TVietor08: This is murder. How can the US actively support the slaughter of innocent women and children? And our President is busy golf… RT @davidfrum: And this is why House needs to see those Trump tax returns.  Trump has green-lit a new Middle Eastern war by a dictator who… Yes!! ⬇️⬇️⬇️⬇️ https://t.co/baltqMPoi8 Fucking brilliant https://t.co/vUBmTX36Rf @Lawrence Because with Putin he’s replaying his one true terrifying and conditional relationship, the one w Fred Trump RT @robdelaney: Rot in hell nazi cunt  https://t.co/ytXemLcpST RT @RJConway92: The most depressing, angering, saddening thing about this is that a quarterback who guided his team to the Super Bowl, and… RT @CNN: Sen. Cory Booker says he once held negative views about gay people in part because he grew up “as a young man in a toxic environme… Yes https://t.co/SjNcRWv92K I’m sure there’s a perfectly reasonable explaination https://t.co/cJXwkGmmMq RT @anthonyVslater: Steve Kerr’s full response to Donald Trump https://t.co/UWkzuJKYpM RT @PeteForAmerica: Together, we can make history: https://t.co/QqTeDy6er2 https://t.co/RR6cFZOd0v RT @BrendanNyhan: \"one of 43 women with new allegations against the president.\" \n\n43 new accusers. \n\n43. https://t.co/Qwnlb8yV9I How could the place that exposes dark dirty money take dark dirty money? https://t.co/Ezaf1nIvQb For ten bucks ENTER to get drawn into a future episode of \n@RickandMorty\nYou &amp; your friend will meet \n@JustinRoiland &amp; Dan Harmon! Tour the production offices in LA! Plus get an R&amp;M merch bundle! Roundtrip airfare, hotel!\nhttps://t.co/gqWyqdGAGK #NEXTForAutism RT @AliciaHannah: Watch this 30 min doco with all your fave comedians (@SarahKSilverman, @aparnapkin!) bringing awareness to mental health.… RT @JoshuaGreen: For skeptics of @ewarren’s claim she was from her teaching job in 1971 for being pregnant, the practice was actually wides… Oh shit HADASSAH is back on #CrankYankers tonight on @ComedyCentral 10:30/9:30c https://t.co/3vHY7tzVYs RT @AmandaMarcotte: Trump treats taxpayer-funded cities like he did contractors who worked for him: Get them to provide expensive labor, th… RT @digiphile: Check, meet balance: a federal judge rejected an argument from President Trump that a sitting @POTUS is immune from criminal… RT @BrunoAmato_1: 5X Draft Dodger whose father paid off a doctor to say he had a bone spur on one of his feet to avoid the draft, is giving… RT @JasonKander: In Syria (and in Ukraine), Trump basically switched which side we were on in a war. He switched us to the Russian side. Co… @jonfavs Butter emailz RT @ChrisEvans: I can totally picture Trump doing this 🙄\n\nIsn’t it nice to see a president let their actions speak louder than their misspe… He is the ranting madman in Dunkin’ Donuts that causes all the customers to make a go-plan with each other using only their eyes https://t.co/AHwa1gAMZl How is this raving lunatic not uniting everyone? https://t.co/MtL18KH1rw These are the ravings of a lunatic how is his insanity not uniting everyone?? WHO THINKS THIS SHIT’S OKAY?? https://t.co/MtL18KH1rw RT @dantelfer: Marc fuckin Maron, folks. https://t.co/6ir9BSfFXx RT @neeratanden: Dear sane people :\n\nAny time the name Hunter Biden crosses a person’s lips, please inform them of this. https://t.co/AK00V… RT @davidschneider: “Filthy piece of toe-rag” is the new “Please leave my town”. #FilthyPieceOfToeRag https://t.co/HyIOL0ucyg RT @DavidColeACLU: MUST-READ: My remarkable co-counsel, ⁦@chasestrangio⁩, on what it means to be a transgender lawyer fighting for transgen… I felt such deep frustration that the grown ups didn’t believe Big Bird and could never see him. It was the birth of my disdain for  “misunderstanding” comedy https://t.co/eNDPPF0IAQ Wow https://t.co/jWYX2svRXw @raesanni Norm’s This is how politics can be https://t.co/wZiu8KG2VB It’s always been odd to me how even/especially @MSNBC misrepresents Bernie, if not ignoring him altogether.  The key thing I take away from this, however, is how he perseveres - never complaining/making it about him- but sticks to the issues bc that’s what he cares about. You. Us https://t.co/9sFOueKPyG “Outrages” are more than one outrage. You provide outrages daily and your lazy, garbage spelling isn’t even close to the top of the list. https://t.co/TIhoQ48bJc RT @birbigs: This nothing burger sure does taste like a real burger! RT @nocontxtww: the west wing was truly an aesthetically beautiful show https://t.co/qBOnJMkHXw RT @chelseaperetti: hahahahahahahaahahahhaaaaa https://t.co/xZW8RYn6Gc RT @AdyBarkan: Thank you all for your kind messages! Privileged to say that I am home with Carl and @rachael_scar. \n\n@JoeBiden, my invitati… ⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️ https://t.co/PhIXMmKBdE RT @PattyArquette: Reminder- Trump promised to show his taxes. As is standard when people run for the highest office because who they owe m… Either Trump knows his followers won’t read this or he didn’t read I t or both. It’s an account about how protocol was followed perfectly. https://t.co/UjEBDVyj9S This whole campaign was Bernie with a BLOCKED ARTERY?? Can you imagine the force he’s gonna be now with it’s UNblocked?! GO BERNIE GO!  🐦 🐦🐦❤️❤️❤️ https://t.co/UNMJVJTCkc RT @nowthisnews: This law requires students to plant at least 10 trees in order to graduate https://t.co/hx4QpeWPxs RT @ewarren: Imagine Facebook and Instagram trying to outdo each other to protect your privacy and keep misinformation out of your feed, in… RT @ewarren: My plan to #BreakUpBigTech would undo their illegal, anticompetitive mergers. You'll still be able to use Facebook and Instagr… RT @ewarren: Let's talk a bit about my plan to #BreakUpBigTech and why it's got Mark Zuckerberg so worked up. RT @CynthiaNixon: “The only effective answer to organized greed is organized labor.”\n\nWhile the media carries on about polling, Bernie is q… Is this my In Memoriam? Oh my gosh I’m filthy... https://t.co/VoEoFmmhQh RT @gigiftbels: a person from the audience just jumped on the catwalk during the finale at Chanel SS20 🤣 https://t.co/aW71Wg9ddL @LeslieStreeter YUM!!! No more of this “Happy Holidays” bullshit we’re gonna say SHANA TOVA again!  \n#WarOnRoshHashanah \n#ImKiddingDummyDontAtMe RT @EricaJoy: sometimes twitter is extremely good https://t.co/9JBbpK5lGf RT @IvanBrandon: Nobody knows the gender of the whistleblower. At times like this everyone miraculously knows how to use the singular “they… RT @SteveKerr: Read the thread. https://t.co/zBYmcuUHYc RT @AmateyDoku: Hi, @Conservatives. \n\nI did not give you permission to use my photo. \n\nI do not want to get Brexit done, I want a People's… They all spoke anonymously. hm. Let’s muse about why:\n1)They have an oz. of shame &amp; know they R putting exorbitant personal wealth &gt; humans\n2) Because this is a bullshit play to scare the “who CAN win” dems w the threat of—wait for it—actual ethics &amp; a govt that works 4 its ppl https://t.co/bJLPQhyBQA RT @axios: The White House didn't just hide the Trump-Ukraine phone call, CNN reported last night — it also locked down transcripts with Ru… @birbigs So beautiful. That’s some aspirational mind -body connection shit @schwartzbCNBC Well then thank goodness they are in no way the majority of America and certainly not the majority of Democrats and we don’t need them financially to win   because people I just had the same thought people have when they decide they can’t have a dog “I’d love a man but I travel so much for work” wordsmiths https://t.co/vTmw0TLO2j Ahahahha seriously I need to know everything about the artist and what the specific assignment was. Is this how people perceive comedy? No wonder we opt out so much @johniadarola Oh my god it’s so embarrassing and so lazy I didn’t read this but the illustration is so embarrassing https://t.co/A8X5t5xhyZ RT @TheDweck: Can’t believe the attorney general whose name we only know bc he helped cover up the president’s crimes and who was only hire… RT @WalkOffTheEarth: #ThrowBackThursday to covering this 80's classic with the very talented @SarahKSilverman! 🎶\nDon't forget to download/s… We know, we know, you’re against whistleblowing https://t.co/5cV11mFO6v New podcast LAST DAY from @lemonadamedia out today. In Ep 1, I got to talk about Harris, who I love. The show zooms in on a person's last day of life to humanize, understand and unpack the opioid crisis. This show will save lives. Please listen. https://t.co/5U9jMk2t52 Yo @JoeBiden please show up for @AdyBarkan -we know you care! ♥️♥️ https://t.co/CkaMU2T3LZ RT @SpecNewsILM: In this week's episode of #TyingItTogetherNC, @DebButlerHD18 talks about the support she's seen since her reaction to the… RT @LemonadaMedia: .@SarahKSilverman talks about receiving a call from @twittels #lastday https://t.co/3XqHIIprTK RT @MCamerlengo: 24 years ago Steve Ballmer and Bill Gates celebrated the Windows 95 launch\n\nI broke down the film https://t.co/8qU9Ggr2QC RT @nowthisnews: 'Stop giving power to people who don't believe in science.' — Actor Harrison Ford is warning us to address the climate cri… Your glitch can always be your superpower https://t.co/HRyVyqcSw9 https://t.co/KEtbvIm19W Hi my name is Close-Up Magic Mac &amp; Cheese https://t.co/JMayrkM9HE RT @nowthisnews: If a picture is worth 1,000 words then this GIF is worth 100,000 #ClimateWeek2019 https://t.co/AqXdeUzgk3 RT @kylegriffin1: Greta Thunberg at #UNGA: \"This is all wrong. I shouldn’t be up here. I should be in school on the other side of the ocean… RT @JuddLegum: 1. A massive Facebook Page called \"I Love America\" — which has 1.1 million followers — is actually run by Ukrainians\n\nRecent… So “fighting the scientifically-proven man-made destruction of biodiversity in order to prevent mass extinction” is “the Jews” GREAT ANALOGY! https://t.co/SkgmosbVKO https://t.co/OwJN4zjY1S @justinkirkland4 😭❤️❤️❤️ Via @ASE https://t.co/37rLPna25n RT @CoryBooker: This is a herculean challenge—but it can be done. I know because we’ve done it before. So today, I’m asking for your help.… @NikkiGlaser You’re @Reddsaidit joke made me love you both more than I even knew I could. You murdered RT @matttburke: Viral misinformation doing rounds. This pic is from an event in Hyde Park, London in April unrelated to climate protests. h… RT @Tribeca: \"After all these years, I am still involved in the process of self-discovery. It's better to explore life and make mistakes th… @gitagovinda @constancekassor @JoelBordeaux @ProfChrisMJones Y’all can go ahead and take me off this chain. Peace♥️ RT @MarkRuffalo: This one is special to me. It’s the story of a real-life hero. And some heroes have their strength on the inside.\n\n#DarkWa… @PellsPonders @JamieLSigler Me too!! ♥️ This is amazing Jesus H https://t.co/p5BOCeeB4i Um... https://t.co/t2DpL9D0ww @Alyssa_Milano Same, my og digital scrabble friend My dad owned a store in Manchester, NH. The winters were so cold, so my dad kept the heated vestibule open at night for homeless to sleep there. https://t.co/GtD5U8VDBY This shit is so dark. Our administration is working for big oil https://t.co/rx8cVFUayK RT @GretaThunberg: \"Please save your praise, we don’t want it. Don’t invite us here to tell us how inspiring we are without doing anything… RT @THR: \"I have voted for 'Game of Thrones' in the past, but it went the bro-iest it’s ever been — it was frat-boy central.\" Read one #Emm… @CaitlinPacific I love you Mary.\nAnd I love you too, Mur!💔 @petersagal Ha! ❤️ https://t.co/W8S1tAY0tW @CaitlinPacific @SpencerKlavan I’m replying to something he quoted from a comedy special I did. When you say I said that and imply it was in earnest and not in character in a comedy special, it puts my life at risk, so please, don’t do that, okay? ♥️ https://t.co/bRIcFKrYP2 RT @Strandjunker: Keep up the drum beat: Why did Justice Kennedy retire so abruptly? What role did his son at Deutsche Bank play? Who paid… RT @RzstProgramming: “...The officer that killed Tamir Rice was rehired. I feel like that is unacceptable. Kavanaugh was voted into the Sup… The irony of it being most lost on the evangelicals who preach Noah and ark and are so totally blind to it all happening right in front of their eyes RT @ScottHech: BE HERE: At this event. Honored to bring together some of the most brilliant criminal justice minds at the same place &amp; same… RT @MJMcKean: Could we just stop calling it the “Justice Department” now? https://t.co/v0njRhOULU @OldSalt45 @AdamBaldwin Sweetie I never said that and the quote the right uses is from a comedy special I did in character. Smh @AdamBaldwin Hold up you believe 97% of climate scientists are lying? No way- RU a believer in “the globalist conspiracy2 use fear of CLIMATE CHANGE 2control people?” The modern “Jews control the weather”?  The invented answer 2Trump’s fearmongering &amp; scapegoating of immigrants as “other” ??? You think you will recognize Jesus when he comes back? He is this girl. And y’all don’t even see it. https://t.co/TAB5YafOQ0 Wait- why are people inferring this sexually- I jus meant I get tired and need more sleep in gen You think you will recognize Jesus when he comes back? I see him all around. He is this girl. And y’all don’t even see it. https://t.co/TAB5YafOQ0 When it comes to stamina I’m beyond my years RT @maramcewin: This is worth sharing \n\nThank you caller from Texas for calling out Republicans are Making America Hate! \n\nAnd Jeanine’s fa… @TuckyWilliams Oh! ❤️❤️❤️ RT @edhelms: Translation: I can treat you like an animal and traumatize your children because you had the gall to seek a better life. https… Sometimes pears have an accidentally licking deodorant texture @AmyYasbeck4real Hahaha HAPPY BIRTHDAY!!! Good grief this is shameful https://t.co/6uZuj22Wap @AOC That ad was so aggressively insane Keep the mics on #DemocraticDebate Don’t let dagnabbit overshadow the truth Cory’s preaching  #DemocraticDebate Biden just yooknthe poll from Limitless Bernie is a great man #DemocraticDebate Whoa @KamalaHarris saved her three pointers for the fourth quarter  #DemocraticDebate *I’m having a puff so in the rest of my tweets I’ll be a lil high #DemocraticDebate Did someone just drop a penny? #DemocraticDebate @NivElis Love him too!! Warren sees the big and small picture. The macro and micro. The systemic and systematic. She has long term and short term plans, and she fucking cares.  #DemocraticDebate Julian Castro: best wet look hair slick, all-time. Second place: Gavin Newsom.\nThank you. #DemocraticDebate Kamala maybe took a beta blocker #DemocraticDebate Cory is righteous  #DemocraticDebate Pete Buttigieg is by far my favorite of my son’s friends  #DemocraticDebate Yang scored w an Asian joke last debate so he tried for one again but it was mehhhhh #DemocraticDebate It’s not what’s important, but @ewarren’s neck is so creamy.  Ps man she’d be a great president.\n#DemocraticDebate @TonyAtamanuik OH MY GOD This is a big mother fucking deal. It’s fucking atrocious. Blatantly unethical. These NC Republicans should be GD ashamed of themselves. You can’t pull this shit and act like you give a fuck about this country and  it’s democracy. To end on a high note here’s the potato emoji 🥔 https://t.co/peDu0zV63D @michaelaWat Michaela I’m choked up thinking about your performance @UTKtheINC You were so great!! Okay so I just saw #brittanyrunsamarathon and laughed so hard and now am sobbing. Please PLEASE do yourself a favor and see this movie. @jillianbell and @michaelaWat and the whole cast are amazing. RT @robdelaney: YOWZA ADY ISN’T MESSING AROUND https://t.co/axUNAb9aPS RT @sfpelosi: DON’T MESS WITH MAMA! \n\n“Why don’t you go ask [#MoscowMitch] if he has any regrets for all the people who died because he has… “she’s got a son” https://t.co/PryZLj0w83 Donald J Trump, The Donald, John Barron #HOAX Lightening bug firefly #hoax Pop Coke Soda #HOAX Rotary, Roundabout, traffic circle #HOAX Rubber Band, hair tie, scrunchie #HOAX First they called it Autum, now suddenly it’s FALL???? #HOAX! https://t.co/Zaz30UFjbN Hot dogs now Weiners?? #HOAX! https://t.co/Zaz30UFjbN Hot cakes and now PANcakes???? https://t.co/Zaz30UFjbN First they call themselves Democrats, then liberals, and now left wing?!?! HOAX! https://t.co/Zaz30UFjbN I watched a Jonestown massacre doc, about a snake oil salesman who hypnotizes 1000 people into worshipping him.  He calls journos who expose him “Fake News” &amp; then instructs his followers to drink poison Kool Aid.  Reminds me of someone but I can’t put my finger on... RT @joncoopertweets: One of Trump's immigration judges threatened a 2-year-old Guatemalan boy with an attack dog, yelling: “I have a very b… RT @axidentaliberal: They lost their home in #Dorian \n\nThen @CBP took something far more precious \n\n“I don’t even want to think..about leav… Hey NYC - I’m doing one of those “in conversation with” things for @NewYorkerFest on OCT 12. I’ll be talkin w @andrewmarantz and we’ll be discussing your dad’s butt.  Tickets here: https://t.co/OF0L8h0WkS https://t.co/eVPDXpvfpv @JonahPlatt I love it. I’ve never been good w sativa before because of the edge @meganamram Wind is ghosts = best three words put together @billyeichner I love you so much Game changer https://t.co/OYrcpKWimr RT @QasimRashid: Homeless Black woman sends 5-year-old to wrong school\n•5 years prison\n\nWealthy white woman bribes college officials with t… Ur Putin me on https://t.co/YJvFII27PE I saw a play called SKINTIGHT last night at the @GeffenPlayhouse and I cannot stop thinking about it. If you’re in LA go see it now. Fucking brilliant. RT @AndyRichter: If some evil billionaire genius had become president and was diverting government and military funds into his own pocket,… Coolest Keith RT @NetflixIsAJoke: Thanks @SarahKSilverman I'll never stop thinking about this https://t.co/PK3fbgxoX9 wtaf https://t.co/7PR2tmDxKc RT @rgoodlaw: No shame.\nNo real emergency.\nNow this.\n\n“The Pentagon said on Wednesday it would pull funding from ... schools and daycare ce… RT @rgoodlaw: Trump swipes $160 million from #WestPoint—to fund border wall.\n\nFunds were meant for West Point engineering center to provide… @LibyaLiberty Agree that’s exactly what happened 100 pages over a year and a half-promising to kill undocumented immigrants, “it will be a bloodbath” \nSent to this Texas AG &amp; he and his office did nothing, didn’t report it https://t.co/qpKsK31HLq RT @SethAbramson: BREAKING NEWS: The Person Who Illegally Doctored That White House Hurricane Map Has Been Revealed, and to the Surprise of… Why are you tweeting about this? https://t.co/cNWudgzzXO RT @SenKamalaHarris: This is abuse, full stop. The lack of dignity and respect for the bodies of these young girls is immoral. No one deser… @ChefHawksworth @BurgerKing I don’t eat meat. Haven’t since I was 7. Lived next to a farm and you go one way or another with that. I went veg. Also some people are kosher and v excited about the vegan meat for cheeseburgers and the same grill is no bueno for dat (if ur interested..) @VinceMancini @CarlsJr @BeyondMeat You mean that lil Ma and pa chain CARL’S JUNIOR? Whoa and same with the @BurgerKing #i impossiblewhopper https://t.co/MMHImMCWfn Damn just found out @CarlsJr doesn’t cook their @BeyondMeat on a separate grill from the meat, which, FOR ME, is nasty RT @sssarahanne: @karavoght @russchoma \"Oh my God, my Presidency is over. I'm Fucked\" \nyeah, let's look into that loan. RT @mansoortshams: So do Muslims hate Jews and Israel? It’s often alleged in particular against @RashidaTlaib @IlhanMN. My OpEd @Newsweek.… Fixed it you sniveling ninnies https://t.co/TQznRUwh4U Hunting for sport is the sport of the diminutive penis. RT @sbg1: A daycare center... ! So literally taking money from American service members’ kids to pay for the wall...\n https://t.co/KGDIXG4K… RT @Newsweek: Fox News rejects Trump's altered #HurricaneDorian map, says Alabama \"never part of official forecast\" https://t.co/8zW3wCozaa Is it possible to be Moe, Larry AND Curly? https://t.co/1cg3GtlAuD Is that how democracy works? https://t.co/1gYpg1sgC0 @MEPFuller You know I do @MEPFuller New Hampshah!! RT @adamcbest: Poway: AR-15\nAurora: AR-15\nOrlando: AR-15\nParkland: AR-15\nLas Vegas: AR-15\nSandy Hook: AR-15\nWaffle House: AR-15\nSan Bernard… CC: @VP &amp; Mother https://t.co/OT03u6WM7O Y’all are exhausting @HalSparks Ugh yes. Y’all are killing a lean joke with your “but some hunters” ... yes I know I grew up in NH thought “sport” would indicate I meant sport hunters  ...is this why comics kill thenselves so much lately @LeslieStreeter Yes I meant for sport. Wanted to keep the joke lean, thought the word “sport” would imply... @BigIndianGyasi Meant hunting for sport- almost cleared itup but liked the joke short. Thought referring to it as “sport” made it clear RT @carlquintanilla: Billy Preston would have turned 73 today. His live version of “Nothing from Nothing” graced not only “Soul Train” (her… Hunting is the sport of the diminutive penis @LouisPeitzman Woody Pryor @jzipple Also if you’re using an AR15 to hunt you really can’t call it a “sport” it’s fishing with dynamite. Also HI FATHER JEREMY❤️❤️❤️ GOOD GRIEF https://t.co/fSrhd9dGIi 🤞🏽🤞🏽🤞🏽♥️♥️♥️ https://t.co/8CfAhXlN2l RT @WCKitchen: @elizagardens @chefjoseandres You can always text FOOD to 80100 to donate $10 to WCK. Thank you for your support! 🙏 Fuck. Oy. Get better, Kevin. 💔 https://t.co/1mWDV4MjZT RT @BradleyWhitford: In the name of God, shut your racist, incompetent, incoherent yap.  A baby was shot in the face.   Jesus. https://t.co… The president tweeted about how popular The Apprentice once was before responding to this tragedy. I guess because he’s classy? https://t.co/volfzHZchw @fortunefunny Really or pretend?? RT @joshfoxfilm: IMMIGRANTS ARE NOT CRIMINALS!!\n\nPLEASE READ AND SHARE:\nMeet El Paso's Punk Rock Border Angels.\n\nin The Daily Beast\n\nI spen… Who does my dad have to blow in  LA to fix the battery on his electric tricycle @hwinkler4real You were the guy she brought to Mary’s party who told everyone he got fired that day!! So good @JamarNeighbors You got me, Pumpkin Lol aww I could watch like 16 more minutes of this https://t.co/BFzicUSPta @MoandJinks I like it because 1) it’s gender neutral so I say it instead of “guys” because why not it makes me happier and 2) love that southern sound 3) my friend Harris was from Houston and said it lots Washing dishes singing Lizzo and subbing blame it on my juice w blame it on the Jews because I know how to have fun on a Friday night RT @mmpadellan: I am utterly disgusted right now.\n\nAnd if you love kids, and hate cancer, you should be pissed too.\n\nPolitics aside, deport… Style icon and honorary jewess. From Rhoda to Justin Theroux’s rad mom in SATC 💔#RhodaInPeace https://t.co/0qUsboNXEq patterns https://t.co/6EyKLL84lz RT @dcbigjohn: Scott Walker, who literally has never fought anything worse than a mild case of the fucking Mondays and who's greatest sacri… RT @IJasonAlexander: Yeah. But you Trumpers out there still want to believe you and he are on the side of the angels. May God forgive you.… It’s like this: yes on capitalism - you can absolutely grow up to be a rich asshole- but others do not need to suffer in order for you to be rich. Does that make sense y’all?❤️ https://t.co/nngEFaJV1I If we aren’t looking out for each other, then what are we doin? And if you read this and think “Jesus I have my own shit to worry about” then go ahead and lean on me, Pally. ⬇️ https://t.co/nngEFaJV1I @_rajdesai I hope to get another one @_rajdesai I can’t find a “I wish I could fire you from doing comedy” button so I’ll just press the  “like” one Sidenote to the delirium: he breathes in gasps through his nose https://t.co/NCmnjJNPqc *am thinking I’d like to have a man who can lift me like it’s nothing Wow the new Trump/Pence white nationalist campaign symbol isn’t trending at all but #CheetoChristStupidCzar is #3 RT @LibyaLiberty: This remains my favorite thing I’ve ever seen on the Internet. Enjoy. https://t.co/tAgWq4bMkt I keep watching it, It’s really true - he tries a couple times to pull Macron’s hand to his dick, then finally just brings his dick to Macron’s hand. It’s a real dance If I could edit the above I‘d take out  ‘ironically’. Doesnt need it. Better without it.  Please, always remember that tweet without the word ironically in it. It could have been perfect. I like to write, “FAVOR!!!!” in the subject line of emails Ironically, Mein Kampf is the Jewiest possible title for a book @rgay ...mitten? RT @realchoppedliva: when characters in musicals transition from speaking to singing https://t.co/YwZwsIZOBN RT @BernieSanders: No one should be sitting in jail because they are poor. Cash bail is a disgrace and must be abolished. RT @Andy: @realDonaldTrump Go dye your hair, Mary. @jfuentes NABE! RT @HackedOffHugh: You will not fuck with my children’s future. You will not destroy the freedoms my grandfather fought two world wars to d… Trump is for real doing that thing where you shake someone’s hand and try to force them to touch your dick https://t.co/hSzOPL1i9t Jesus H there is a fucking lunatic in the White House https://t.co/VaUi61jPUU RT @MarkRuffalo: This is so moving. https://t.co/Qxg6pFQJyM THIS THIS ALL DAY THIS\n⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️ https://t.co/0QhiHGvxs4 RT @birbigs: We all know grandpa has lost it and some of us are more comfortable talking about it. \n\nBut, to be clear, he’s lost it. \n\nMy p… GREAT PLACE TO DONATE, please do!\nhttps://t.co/weJAbLzvI5 RT @cpicciolini: ⏰Less than 1 hour until the premiere of the third and final episode of #BreakingHate! Tune in or get your DVR set! https:/… RT @ilyamerica: Another throwback to another one of our family dinners! #ILYAmerica https://t.co/I9Rs4joUhw RT @AmyMcGrathKY: Mitch McConnell is the worst of what’s wrong with Washington. I’m running against him, and I plan to win. \n\nChip in and h… Whoa I posted this right before I fell asleep then I had a dream that @JeremySisto &amp; I were teachers in a fancy nyc school and he got sick and diarrhea’d himself and I got 2 towels from the gym &amp; wet 1 w warm water to clean himself up and he was super appreciative I love that they used a still from me saying, “America’s pussy, the Grand Canyon!” https://t.co/a90P9t1qcq RT @ilyamerica: Sarah preps for her father’s death. (He’s fine.) #ILYAmerica https://t.co/CSzRLNHBBW https://t.co/2XohfjzOFF @Smashie1 Love you more It’s true maggie was going to finger you https://t.co/YK0dRLp4f0 it’s gonna get chocolatey in here is what I just said out loud while marching into the kitchen 1) Trigger warning: this is racist propaganda from the American Nazi Party 1978\n2) Please refer to me as THE JEW FROM OUTERSPACE from now on https://t.co/jHdi7b2hSQ @ypparila @racebanning Because it’s alive and well now Doll My first reaction to this picture was GROSS RED FROSTING https://t.co/78TG1ohcWp I bet that’s a @lucyprebblish line if I ever heard one “There’s no god, there’s no anything. There’s just people in rooms trying to be happy.” @ARseeg I “liked” your tweet, but also, BOOOO @Toddmasterson Horrified. I did. To the bald hipster on Laurel Ave. who gave the finger to the black Prius driving too slow for him: that was me, I was dropping off my dad.  I have memorized ur face, &amp; when I see u again I’m gonna give u a hug so tight you’ll never be angry about stupid shit again RT @PadmaLakshmi: Mmmk https://t.co/TpGFlxkG8z Sarah Snook is a fucking master class. I believe it was poop. Everybody is welcome to POOP in me.  ♥️♥️♥️ https://t.co/eIcK6aTpM5 RT @ktumulty: The party that’s constantly sounding the alarm about socialism has given us a president who hereby orders private companies t… RT @SethMacFarlane: The burning of the Amazon rainforest is the most pressing story of the day. If we lose too much, we can’t effectively f… RT @SethAbramson: (THREAD) MAJOR BREAKING NEWS (CNN): Convicted Kremlin agent Maria Butina's longtime boyfriend confirms that Don Jr. met s… Yes same https://t.co/GRXGvO7Pqn TRUMP SUPPORTERS ONLY: please can you explain to me how this is not mental hospital level narcissism https://t.co/xSTpT5NgM1 @joshgondelman *I do feel bad RTing this but it’s perfect comedy RT @SethMacFarlane: Why is our own President unconcerned with this? https://t.co/hKYSsIcV8H RT @joshgondelman: David Koch has died. In lieu of flowers please construct a shadow network of tax deductible shell companies to donate to… Smoothie https://t.co/5Anp9V8wXR R u ok? https://t.co/ymobV92j3x RT @WhitfordBradley: If I said Mexicans were rapists, my career would be over. \n\nIf I said Nazis were good people, my career would be over.… @heckyessica @NathanDrakeXX 50 bucks \nBare Home Weighted Blanket 17lb (60\" x 80\") - Standard Size for Adults - All-Natural 100% Cotton - Premium Heavy Blanket Nontoxic Glass Beads (Green, 60\"x80\") https://t.co/8eZKBIhGfi @heckyessica @NathanDrakeXX Ditch the ambien for the weighted blanket (and a small puff of indica?) @heckyessica @ThatGirlBrooke1 It’s the best - it makes you feel like you’re safe.  It feels like someone’s holding you tight and going “I got you” GREAT question, Craig! I’m talking about his diseased, pus-filled urethra! https://t.co/9gfNGjfwpC @jobellerina @OwenJones84 ? The man who david duke approves of is telling 72% of Jewish voters that they are disloyal to their people ⬇️see it⬇️be it⬇️ https://t.co/imlhgyCykK Lowell Herb Co. has launched a social justice program that provides working opportunities to non-violent cannabis offenders, who are often harmed by unfair cannabis laws https://t.co/ce2fYqLBAp Oh shit— if you type “self-hating Jew” into google\nWTAF https://t.co/9N7XKYmdgY @RobAnderson2018 It looks like they did A lot of people are saying that Trump is a gaping penis hole. ⬇️⬇️⬇️ https://t.co/1EzcdujCk1 RT @rmayemsinger: \"The Jews are not loyal to the state.\" — Adolf Hitler\n\n\"Any Jew that votes Democrat is disloyal.\" — Donald Trump RT @jstreetdotorg: It is dangerous + shameful for Trump to attack the large majority of the American Jewish community as unintelligent + di… Good grief. On Wikipedia??? https://t.co/qPLenretB9 Right there on his own fave book (besides The Art Of The Deal) https://t.co/rOrjMqiQ1s RT @DoYouEvenLIf: Trump: \"I think Jewish people that vote for a Democrat - I think it shows either a total lack of knowledge or great dislo… RT @kibblesmith: Reporters: Please ask the President about the tensions between Wakanda and Latveria you have nothing to lose RT @nhannahjones: The #1619Project published online today and it is my profound hope that we will reframe for our readers the way we unders… smooth move tea is not a joke. Do not use casually If you have 20 mins this is super interesting  episode https://t.co/Pmy73r6RSB #reparations @marwilliamson @majorityfm RT @robdelaney: Like in Maximum Overdrive? Or was a bigot cunt at the wheel, you embarrassing excuse for journalism? https://t.co/QdUjkSkt0X RT @deray: y’all. https://t.co/NDbTlVXk1w RT @CharlesMBlow: The petition to rename the stretch of 5th Ave in NY in front of Trump Tower #ObamaAve has gone viral and almost reached i… RT @PittsburghPG: Trump's large union crowd at Shell was given the option of not showing up, and not getting paid https://t.co/9SmQBOreh3 RT @dabeard: US border agents tore the 7-year-old boy away from his father and put him in a faraway foster home. There, he was repeatedly s… RT @mynameisNegan: Denmark:\n- Tuition Free College\n- Free Healthcare\n- Paid Parental Leave\n- Paid Vacation\n- Living Wage $20 \n- Shorter Wor… RT @travisakers: I don't know who needs to see this today, but here is a puppy dreaming... \n\nhttps://t.co/Yyxq52ZBFv So upsetting. Fucking gross. All my Jewish friends texting me in despair. Hoping our friends see that, just like in the US, the administration does not represent the hearts and minds of the majority of the people https://t.co/VxBuwehx3p @MsPackyetti Amen. Gosh I just read that Atlantic article and this thread said so much better what I was feeling thanks @AbuAliZarif @lsarsour Oh shit I assumed as a dem he’d be against banning the right to boycott ..\nass-u-me-d @bevysmith Comedians? NHites? @lsarsour Wait- why “even Chuck”? How is thisn inconsistant with his views? RT @ewarren: Israel doesn't advance its case as a tolerant democracy or unwavering US ally by barring elected members of Congress from visi… Jesus H this is Fucking insanity https://t.co/SAfzUWvzGv RT @SavetheChildren: Khaled is a survivor of last year's bus attack in #Yemen. He’s resilient, but his life today is still a daily struggle… Jimmy doesn’t just love Dildo.  Dildos inside him https://t.co/OM7tL4aKW2 RT @OrangePaulp: One of my favorite interviews with Toni Morrison. The interviewer asked her when she was going to “substantially” write ab… Oh the offense whites take when a Jew is called white https://t.co/LFHSxtaDv8 @rgay Smhromn Excellent piece https://t.co/jm2g735nio RT @deray: Teachers can get a free subscription to the Calm app—it usually costs $60 https://t.co/999uQvIl5A RT @DavidBegnaud: This is Antonio Basco. \nHis wife of 22 years, Margie, was murdered in El Paso. \nMr. Basco says he has no other family so… ⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️ https://t.co/xCM5cNnhzd How do we stop this? Corruption on every level. https://t.co/9ZdZeBcevf @WhitneyCummings Omg \n1) did someone hack your phone and then try to extort you?? That’s terrifying. \n2) perfect nipple stunning can RT @mjfree: Trump prefers sexual predators who don’t get caught. #EpsteinSuicideCoverUp This is huge - do you know how hard it is for a Jew to be in a bookstore and not peruse? https://t.co/LORct8rFca That baby was orphaned in the shooting. THUMBS UP https://t.co/sIzaZ77d4X ⬇️⬇️⬇️ https://t.co/VzyY2seAOX ⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️ https://t.co/IRmdt0SNgJ @stephsimbari I know that’s the crazy part I love that dood RT @DavidAmoyal: Really appreciated ⁦@SarahKSilverman⁩ perspective on outrage culture which she describes as “self righteousness porn” this… @heckyessica ♥️Sis @TymberleeHill ❤️you @WilliamMatt22 Thanks, W. I’m not scared-  I’m really ok. This is just such a microcosm of the world we’re in and we gotta change it. @WilliamMatt22 ❤️ @JarridWilson @mary_mcdermid Thanks, Doll.♥️ @brandondarby Thanks, Friend. I don’t feel scared WHAT WAS THAT NOISE RT @BillSimmons: New BS Podcast: 12 years in the making... it’s @SarahKSilverman on the state of comedy in 2019, cancel culture, SNL, death… They posted another video today assuring me that he was NOT fired because of that video and that he was right about me being a reprobate who deserves to get my teeth knocked out and then killed .♥️ I didn’t wanna post and bring more attention to them. .. https://t.co/8c5qLACqH2 @evanscottolson @Delafina777 @GMSarli Your not alone! The right and their “pro-israel” stand is not love for Jews. They in no way represent (most) Jews.  Think of it like this: to think Netanyahu represents the hearts and minds of all Jews = thinking Trump represents the hearts and minds of all Americans Re: that pastor, et al https://t.co/ZHeBrv7GIa https://t.co/CyJTX4LKA1 @TaikaWaititi @robdelaney Aw fellas This is Adam Fannin of the Stedfast Baptist Church in Florida and he is going to get me killed. https://t.co/I6Us59o59v If I get murdered, start here: https://t.co/nScRRPIAJI RT @PhilipRucker: News via @BobMooreNews --&gt; None of the eight victims still being treated at El Paso's University Medical Center agreed to… IF THIS DOES NOT REPRESENT WHO YOU ARE THEN VOTE TRUMP PENCE MCCONNELL AND EVERY ENABLER OF THIS TRUE EVIL OUT https://t.co/DZqM8dd5bN Damn. https://t.co/bVpIRAOGTx He went to Dayton &amp; El Paso, and came back with a video package of him being popular. https://t.co/5mKWRum5HA 12:00- 12:29 sit in a chair and eat a bag of marshmallows ✔️ RT @MollyJongFast: @SarahKSilverman The cruelty is the point ICE LOVES SEPARATING CHILDREN FROM THEIR PARENTS https://t.co/d83SLO5Y7t What fucking heroes. Making our streets safe from... factory workers? Parents? Families?\nSmh https://t.co/ezGgWdwCw0 RT @kathleenmonk: \"Why is it that I can order a bag of dick-shaped gummy bears, for same-day delivery, but I have to wait 208 years for gen… RT @Alyssa_Milano: To everyone wrongfully blaming these massacres on mental illness—a reminder for you:\n\nTrump Signs Bill Revoking Obama-Er… RT @louise_q10: Hey Kentucky ditch #TeamMitch https://t.co/6pufMzfHio RT @AOC: Hey @senatemajldr - these young men look like they work for you.\n\nJust wanted to clarify: are you paying for young men to practice… RT @AmyMcGrathKY: Hours after the El Paso shooting, Mitch McConnell proudly tweeted this photo. I find it so troubling that our politics ha… @meganamram I saw this in the sky today and scream-laughed! RT @RonBrownstein: Worth noting that @senatemajldr has blocked a Senate vote on the universal background check bill passed comfortably by t… RT @GeorgeTakei: Let us be clear. It is Mitch McConnell who will not allow gun safety bills to move forward in Congress. The House already… RT @Public_Citizen: As America transforms into a killing field, here are the top recipients of campaign donations from the @NRA:\n\nSen. Burr… RT @justinshanes: Ah man, just our luck. The only country with mentally ill people. Fixed it https://t.co/SGQLlVvrMf RT @monicarhor: Headline writers, be accurate: @realDonaldTrump didn’t just call for background checks. He suggested tying it to immigratio… @brandondarby @DawnDish Game changer https://t.co/3I7SvzyycJ RT @daveweigel: There are no mass shootings in Japan because there are no video games there https://t.co/IIpJPZMlrQ RT @Alyssa_Milano: Mass shootings this year throughout the world. \n\n🇦🇹 0\n🇩🇰 0\n🇫🇮 0\n🇩🇪 0\n🇮🇹 0\n🇮🇪 0\n🇱🇺 0\n🇨🇭 0\n🇬🇧 0\n🇭🇺 0\n🇪🇸 0\n🇵🇹 0\n🇸🇬 0 \n🇸🇦 0… RT @MattOswaltVA: when a politician appears on TV after a mass murder, instead of (Rep) or (Dem) next to their name they should put in pare… This doesn’t include Dayton because it was posted a whole 6 hours ago. \nMy heart. https://t.co/OfxzROMrd6 Right? Left? No matter- we are ALL being had. Do the dishes and CHECK THIS OUT\nhttps://t.co/PhLFBWRjv0 @brandondarby @DawnDish Ok I’m buying these tomorrow This is my official request that @DawnDish make eyeglasses cleaner wipes RT @stuartpstevens: Everyone at rally taking photos on their iPhones invented by son of Syrian immigrant. https://t.co/qeIbXjU7GM Oh, Sweetie https://t.co/V7w7nY7kf5 ⬇️ https://t.co/sQGaniKJAe RT @NikkiGlaser: Watch this whole thing. Goosebumps of hope. https://t.co/oAe0W3lgEA HOLY SHIT x 100000 https://t.co/Sv5cuzG0lf what channel is ur tv on https://t.co/nrYQ6aviQ4 RT @robdelaney: What the electric FUCK. I rarely watch him speak because I love myself but this is just amazing. Please watch. What a fasci… PLEASE PLEASE WAKE UP @LindseyGrahamSC @senatemajldr @GOP @VP GOD IS WATCHING https://t.co/A6vRRLRcm5 RT @keithboykin: There must be a special place in hell for shameless con artists who peddle false hope to people in vulnerable communities.… RT @SenatorLeahy: Chairman Graham just broke FOUR committee rules in order to advance Pres. Trump’s bill to lock up immigrant children INDE… @TulsiGabbard Manipulating Kamala’s response is a bad look Flagrant disregard for our democracy WOW. There are officially no rules for Republicans — if you are a Republican and not speaking out about this you ARE this ⬇️ https://t.co/GeKvFdvK1h @DaveCombs72 They’re running for their lives, Friend. Oh, I understand what is going on at the border, Daddy. My only solace is that after all this you will go to jail for your part in crimes against humanity. Ps- What happened to you? Do you know? https://t.co/H8UYE3Cdp7 RT @RepJoeKennedy: Our President is a gruesome iteration of the schoolyard bully -- taking lunch money from kids who can't fight back. http… Kamala killing her closing #DonaldTrumpIsAPredator  #DemDebate2 Julian Yas  #DemDebate2 Kamala’s plan for equal pay is RIGHT ON #DemDebate2 @johniadarola Kamala did! WHITE women make that #DemDebate2 RT @Diane_7A: “The Oval Office is full of cum.” #DemDebate2 https://t.co/U0nXWrxLLk Kind of feeling the sweet Booker Inslee moment  #DemDebate2 Exclusively Superficial:\nBennett:  has South Park mouth\nBiden: your laser facial treatments are getting obvs u don’t need them stop\nGillibrand: hair needs a soft curl\nYang: consider a tie. Just consider it\nCastro: you’re perfect. Don’t let anyone touch your eyebrows\n\n #DemDebate2 I don’t care for Gillibrand but she’s kind of right on everything across the board #DemDebate2 DYING to know who Obama will endorse.  Could be AWKWAAARD #DemDebate2 https://t.co/c4yudM01kq Go Cory Go. This is his night #DemDebate2 Oooh Cory oooh #DemDebate2 Oh Snap Cory calls Biden out so hard- you can’t have it both ways if you wanna namedrop Obama every two secs Daddy #DemDebate2 Cory brilliantly echoes what Warren said last night- making crossing the border a CRIMINAL crime (as opposed to civil) gives Trump the ability to rip children from their parents arms/commit these crimes against humanity #DemDebate2 @WayJayEDM When a candidate references another candidate, that candidate gets to rebut. They are referencing Kamala so each time she rebuts. It’s how the debate works Doll. Can someone tally how many times Biden says the word Obama?  #DemDebate2 They need to specifically speak to people who love the insurance they get from their employers.  Is seems those are the dems most worried about “Medicare for all” #DemDebate2 @deray That was good. Kamala cleated it up but still minimizes the initial impact of Sebelius’s support... Ya Cory.  #DemDebate2 When Biden gets cut off by the moderator it’s like he can’t wait to stop talking #DemDebate2 Oh shit Kamala taking Papa Joe to school  #DemDebate2 One last thought about @ewarren going into tonight. She is FEARLESS and knows her shit. She is a teacher to the core and will be unfazed by a big dumb bully RT @GaryLegum: Trump once told Don Lemon he couldn't be an unbiased reporter when talking about birtherism because he's black. So I think L… “If ur watching at home &amp; ur a Republican member of Congress, consider the fact that when the sun sets on ur career... the thing u will be remembered 4 is whether in this moment w this president u found the courage to stand up to him or continue to put party over country.”-M PETE Coming to terms w the fact that my dad has a low-grade while-awake snore  #DemDebate Watching Mayor Pete \nJodyne: I want him to have a mustache\nSarah: yes! I want to grab his face and kiss his cheekies\nDad: me too Watching w the fam and Laura just pointed something out  we can’t unhear: John Delaney has   @jimmykimmel ‘s EXACT voice.  You have to close your eyes but it’s cray #DemDebate Pete #DemDebate RT @laurenduca: \"Some of the people on this stage, I almost wonder why you're Democrats. You seem to think there's something wrong about us… Oh wow Williamson just crushed that last one. She may be granola whacky but she’s right #DemDebate Mayor Pete well done kid. Cute as a button that one. #DemDebate Moment of the debate https://t.co/mqCLWmk5HS WARREN: “We have to call out white supremacy for what it is: domestic terrorism” GO MA GO #DemDebate RT @cmclymer: \"I get tired of Democrats afraid of big ideas. Republicans aren't afraid of big ideas... please don't tell me we can't take o… Warren is SHREDDING bro  #DemDebate WARREN IS BADASSS #DemDebate Ryan: “You don’t know that, Bernie.” \nSanders:  “I do know. I wrote the damn bill.” #DemDebate Bernie and Elizabeth/ Elizabeth and Bernie — either way they’re a rad team IMOIMOIMO #DemDebate Ok it’s clearly hot as fuck in that room these people need a Beyoncé fan  #DemDebate https://t.co/k7biFET49g Elizabeth Warren is THE SHIT no one understands this shit more than her #DemDebate GO BERNIE GO\nHe is the truth  #DemDebate Kate McKinnon is amazing as Marianne Williamson #DemDebate Delaney bye #DemDebate Bullock wins best impression of Albert Brooks in Broadcast News\n#DemDebate @jzipple If you go in close it looks like Jesus is on your left shoulder ok I went in close LOL @jaredkushner you are so bad! https://t.co/PixIyMMBKE RT @BillKristol: Undeterred by McConnell crying McCarthyism, @ForTheRuleOfLaw is airing this new ad in DC and KY criticizing @senatemajldr… LOLOLOLOL #MoscowMitch ❤️❤️😜😜😜👍🏼👍🏼👍🏼 https://t.co/FlMluWV3fn How can anyone stan this pathological nasty pig?  (Earnest question.  Please answer. Not rhetorical) https://t.co/t0DX9TTpsY CORRECTION 196 MASS SHOOTINGS IN THE PAST 2 MONTHS https://t.co/YnheUox9eg RT @Bruce35dc: @SarahKSilverman Sarah, I can't buy Sudafed unless I show my ID.    I can't own a car unless I register it, insure it, have… Haha #MoscowMitchMcConnell has single handedly put a halt to each attempt to protect this country from proven, unarguable and constant election meddling by RUSSIA.  Fucking WHAT? Oh shit that’s so fucked up! Haha LOL #MoscowMitch you are crazy! RT @seanoconnz: The guy from The League lost a Buffalo Wild Wings commercial for doing this exact thing. https://t.co/pReu3WlWG9 Because I have to believe we agree on this. We are being separated by lies spread by NRA reps &amp; lobbyists who have turned off a majority of their own members because hey- that’s not where their big $ comes from.... This is not 2A shit. Just a law that makes it harder for terrorists, domestic abusers and people with mental illness to get their hands on guns? Maybe rethink weapons of war as something available online or at gun shows? WHO DISAGREES W THIS? #Maga Trumpers? Can you weigh in? A guy tries to light his shoe on fire &amp; 18 yrs later we still all take our shoes off through security.  In that time there have been 37 MASS SHOOTINGS. And nothing. Not a single regulation. BOT⬇️ https://t.co/ImFU2kGvOF Bot ⬇️ (dear Russia your bios are a dead giveaway) https://t.co/n2s3BFfsXO RT @TheDailyEdge: @realDonaldTrump Trump Tower is #INFESTED with criminals https://t.co/KkC4iKVMlK RT @funder: Trump attacks war hero Robert Mueller, and supports the Saudi Crown Prince who had Jamal Khashoggi killed. So yes, Trump’s a tr… @FINALLEVEL LOL 💔💔💔💔🎈🎈🎈🦋🦋💔🥔 https://t.co/xFww9UMFiR Bernie drops such straight (up) truth bombs you forgive his Hard A in “rationing”sidebar I’m high https://t.co/prwRyXJrHt https://t.co/tbN1eCMJyg I learned what savoire faire was from Queen Latifa’s Fly Girl in 91 RT @yashar: Take a minute to watch this magic...\n\n@DollyParton, @brandicarlile, @MarenMorris, and the High Women, singing \"Eagle When She F… Oh snap https://t.co/Wktr8Owosp We all know Putin has his dissenters killed.  Really hope @navalny has round the clock security bc someone’s gonna finish the allergy/poisoning job or help him fall out a window https://t.co/MegEL0nNAe ⬇️⬇️⬇️⬇️ https://t.co/ju4pmoMBWO RT @mansoortshams: FACT: Islam REQUIRES a MUSLIM to be loyal to his/her country of residence. Just between us three (Army, Navy, US Marine)… RT @francismmaxwell: While the president tweets about how ‘infested’ Baltimore is, @Kaepernick7 - the person conservatives claim ‘hates Ame… RT @yashar: Drop everything you're doing and watch this....\n\ncc: @VictorBlackwell https://t.co/N9ZWttHSzd RT @GerryDuggan: @SarahKSilverman @ev @jack @Twitter https://t.co/7IdCKxo5Hn A billion for FB, a couple hundred million for Twitter. Of cou… If bots can be detected why aren’t they taken off the format? They are influencing people with lies put in place by a foreign entity @ev @jack @twitter https://t.co/VYr5dhlR3K RT @RealMuckmaker: Mitch McConnell Received Donations from Voting Machine Lobbyists Before Blocking Election Security Bills https://t.co/eD… RT @shannonrwatts: “Russia attacked us in 2016. It is attacking us today. Its attacks will intensify. Yet each time we try to raise our def… RT @stevesilberman: Exactly this. One reason the GOP stays in lockstep to keep the lid on Trump's treason is that if the flag-waving \"Ameri… If this account is not a Russian bot I’ll eat my hat: all memes and messaging for easily influenced humans to spread. WAKE UP, CHAMP! https://t.co/VszmYdgX2Q Q for  #MAGA :  Will what is true ever change your mind, or will you dig in deeper to what u NEED to be true? Are your news sources varied? (I ask myself this on the regular to keep me honest) ❤️⬇️ https://t.co/ps8MkIuHmH RT @emilyslist: Alabama. Georgia. Ohio. Missouri. Kentucky. Mississippi.\nRepublicans nationwide are working hard to ban abortion. If you’re… #maga https://t.co/qiXJY3XzXK RT @JoeNBC: Why won’t #MoscowMitch let the Senate even take a vote on protecting American democracy from Russia’s ongoing attacks when Trum… RT @thehill: #MoscowMitch trends after Scarborough slams McConnell's lack of action on Russian meddling as \"un-American\" https://t.co/qpXxH… #MAGA https://t.co/lNy5RzA5CF @mojosrising @daffysirod11 @amandadeibert Wow just 13 minutes after me. Great minds #MAGA? https://t.co/qu4YGgPR1r RT @JohnAvlon: SCHIFF: “Trump and his campaign welcomed and encouraged Russian interference?”\n\nMUELLER: “Yes.”\n\nSCHIFF: “And then Trump and… RT @MrGeorgeWallace: Yo' momma's so stupid she thinks an innocent man would falsify records, try to fire investigators, dangle pardons and… I don’t enjoy being negative but I’m pretty sure the only way Trump stays out of jail is by staying president, and he probably will. RT @ThisWeekABC: Rep. Will Hurd: \"Did you think that this was a single attempt by the Russians to get involved in our election or did you f… CHILLS https://t.co/W4IZDoznNP RT @harrysiegel: Damn https://t.co/9xX4DRXx5T https://t.co/Xw86DujKDE RT @PhilipRucker: A year and a half after the fall of Al Franken, @JaneMayerNYer checks the facts and finds deep regrets among many of the… Make up your mind: #LoveItOrLeaveIt or @MAGA the hypocrisy is embarrassing https://t.co/AweQVS8XKc RT @NeverAgainActn: We are also American Jews.\n\nWe are profoundly outraged by the existence of concentration camps.\n\nWe are profoundly outr… RT @NeverAgainActn: We are shutting down every entry point to the Department of Homeland Security, the agency that is responsible for this… RT @justinbieber: I want my friend out.. I appreciate you trying to help him. But while your at it @realDonaldTrump can you also let those… Love it or Leave it #MAGA https://t.co/xpIXUjWRgZ @MegynPrice Stand up/road hours Hey @MarkRuffalo I just woke up from a dream where you told me you can only go to the bathroom every 20 days. You whispered to me, exasperated, “20 DAYS!” So I got you some smooth move tea to drink before bed and also told you to drink tons of water and you were so happy. RT @williamjordann: Here’s a sampling of Katie Hopkins, a notorious figure in the UK who the president is retweeting again. https://t.co/hZ… pig https://t.co/skuuzhhnL7 Defenders of a Racist President Use Jews as Human Shields\nhttps://t.co/HIrrdotmcl RT @irishtimesvideo: ► VIDEO: Donald Trump asks a Rohingya refugee, \"Where is that exactly?\" before inquiring where an Iraqi Nobel laureate… RT @girlsreallyrule: Nadia Murad won the Nobel Prize for her horrific struggle with ISIS-the same ISIS Trump uses to scare his base. His re… RT @girlsreallyrule: “There’s a racial division in this country that’s being instigated by the president, and we here at ESPN haven’t had t… We’re living in times where “when u see something, say something” is brave &amp; rare⬇️ https://t.co/IEJavXidqf RT @YourManDevine: I don't know. Seemed pretty goddamn professional to me. https://t.co/zD4CuA41k6 RT @JuddApatow: We are no different than Germans in the 30’s and 40’s.  Human beings are still capable of murder and madness and complicity… @rgay 100% yes that’s all I use RT @IGsolidarityNET: #Jesuit William Critchley-Menor, S.J., is arrested at the #CatholicDayofAction for #Immigrant children at the US Capit… RT @ananavarro: Pathetically weak.\nRubio’s parents fled poverty in Cuba. Ted Cruz’ dad also fled Cuba. Their US Senator sons often strongly… RT @JuddLegum: NOTE: Rand Paul voted for a $1 trillion tax cut for corporations without any spending offsets https://t.co/F7HtMC4LTf You’re the shit and I’m knee-deep in it https://t.co/JLqQzxpu8G RT @gavinpurcell: What a lovely surprise this morning.\n\nIt means something really special to still get a nom when a show was cancelled, had… @robdelaney @Dauntbooks @MichaelRosenYes My dad was called Pisher and I was a Bedwetter too 👍🏼💔♥️♥️🎈🥔 RT @AJentleson: Stop using us Jews to launder your racism and bigotry. You’re not standing up for us, you just think you’re clever. It does… RT @abobrow: @RepAbraham @realDonaldTrump Pinning this tweet for when there's a Democrat in the White House and you criticize the country. Bottomless https://t.co/vQFszqLMj8 RT @AOC: It’s important to note that the President’s words yday, telling four American Congresswomen of color “go back to your own country,… This⬇️ https://t.co/bnDxjUxDaU @waltshaub I read it on the United States Dept of Justice website in the Ethics Handbook For On and Off-Duty Conduct RT @julieklausner: This kind of “sex” is called “rape,” @latimes. https://t.co/nQWW1NpDHv RT @mkraju: This appears to be directed towards African-American and Latina congresswomen who are American citizens. https://t.co/ndbvOQIlB1 RT @adamcbest: @realDonaldTrump Pressley was born in Ohio, AOC in NYC (just like you, smart guy) and Tlaib in Detroit. So you must be talki… RT @PFTompkins: Mike Pence doing exactly what Jesus would do, folding his arms and looking over the prisoners’ heads like they’re not there… There are children IN THIS PICTURE with tin foil for blankets. They have been taken from their parents as punishment for seeking asylum. You should be deeply ashamed of yourself. https://t.co/DvK1BCZidZ Sometimes I read social/political stuff I tweeted where I use supe virtuous language like, “we must..” and it’s cringetastic Public service is a public trust. You have a duty (heh... doody) to speak out about unethical or illegal activity when you see it.  Saggy nutsacks like Paul Ryan should not make $ from obstructing justice and then writing a tell all about. Vomit I’m confused. Do you know that you are lying? God sees this. https://t.co/OwPbWh81Na How can you watch this and think in terms of political party. Shame. https://t.co/IrmCpYkCi2 Oh wow https://t.co/Pkp5SUW39Q NYC, BETHLEHEM,PA &amp; ATLANTIC CITY NEXT WEEKEND YALL https://t.co/rop3zvmoBF So lucky to have gotten 2B a party of @FRabbits The Midnight Organ Fight anniversary cover album. We miss you, Scott.  check it:  https://t.co/W7As9eoPKd https://t.co/AEqS7qQUAb RT @ohdaughter: Frightened Rabbit’s ‘The Midnight Organ Fight’ anniversary covers album is released today, featuring Daughter’s version of… RT @StevePasquale: Now he says it?\nPaul Ryan. One of the great cowards in US history.\n\nSold his soul entirely for a fuckin tax break and so… Stop calling them “underage women” if they are under age they are children.  They raped CHILDREN https://t.co/PcEi89U8qf pubic servant https://t.co/ElmU8wKxa3 They knowingly sell out our democracy,support his lies, are complicit in his crimes, and then will write tell-alls “after”. Self-interest is their only interest and they’ll all get away with it. https://t.co/ElmU8wKxa3 RT @AoDespair: These are thoughts in his head and he is pecking them out in words of his own choosing to a nation of many millions.  My god… @JamilahLemieux My sister’s family digs a hole through the middle of the challah loaf and puts a Milky Way in it, then heats it in the oven so it melts inside. My God https://t.co/6lUpSPuMws Good grief https://t.co/VHndqaOGwp RT @JohnJHarwood: “It was supposed to be an exclusive party at Mar-a-Lago, Donald J. Trump’s members-only club in Palm Beach, Fla. But othe… @IvanBrandon Saaaad RT @AmyMcGrathKY: I’m running to replace Mitch McConnell in the U.S. Senate. Everything that’s wrong with Washington had to start somewhere… ❤️❤️❤️❤️❤️❤️❤️ https://t.co/qW01oqnlle @DougBenson @nowthisnews Amazing!! Thanks, D!! RT @evaandheriud: me explaining to my boyfriend why equal pay makes actually no sense AT ALL !! https://t.co/eCBSD25YTK RT @MiamiHerald: You can read our full #PerversionofJustice investigation into Jeffrey Epstein at https://t.co/Am2ItiJtID RT @JuddLegum: 1. Alex Acosta broke the law to give a sweetheart deal to a serial pedophile, Jeffrey Epstein. \n\nTrump made Acosta Secretary… RT @MattOswaltVA: MSNBC: Jeffrey Epstein, friend of Donald Trump, has been arrested for sex trafficking of minors\n\nFOX: Jeffrey Epstein, fr… RT @SethMacFarlane: No, it’s not “Fake News,” it’s six hard-working reporters combining their efforts to present a chilling and, unfortunat… RT @kylegriffin1: Quite the ad from Nike: \"I believe that ... a whole generation of girls and boys will go out and play and say things like… ⬇️L⬇️O⬇️L⬇️ https://t.co/NflbFuwjCB RT @chelseaperetti: How crazy that a U.S. team win is seen as a blow to the president of the united states https://t.co/gpRF1xxi73 I bet Dogtv’s late night programming is consciously  made for stoners.  Either way thanks RT @TheDweck: Republicans who assume liberals will try to protect an accused pedophile just bc he’s on their side politically are really te… READ THE WHOLE THREAD⬇️ https://t.co/M1lj7XacmA RT @BFriedmanDC: For the millionth time: Realizing they could not compete with the U.S. militarily, Russia and Saudi Arabia now buy off U.S… RT @jdmaccoby: GOP: we should steal kids and put them in concentration camps \n\nDEMS: we should have universal healthcare \n\nMEDIA: how will… RT @DeanObeidallah: 'It Was The Right Thing To Do': NYPD Officers Speak Out After Their Act Of Kindness Goes Viral https://t.co/r41gSWbaId Wait until they find out what  Rocky Mountain Oysters aren’t https://t.co/TY9lOna2cj @Ryguy613 @melodysbg Whoa crazy!! @steveagee Hahaha I love you so much. God me too #laearthquake https://t.co/lFETIxWN4I My dad and step dad together made the perfect man. Between the two of them they are a masculine, gentle ex-marine with a thick Boston accent who’s liberal as fuck, funny as shit and a professor of logic and philosophy. https://t.co/KZTXsExj1Y RT @robdelaney: I support Sanders’ &amp; the House #MedicareForAll bills because my son was disabled then killed by brain cancer. That might ha… Smhatwo (all the way off) https://t.co/krRHd5sLVQ @nealbrennan @LinzDeFranco Haha is that true? Haaa Crappy fireworks all over my neighborhood still going off. I’m not a violent lady but I want to punch every one of you in the face. I want to break my hand on your faces for doing this to my dog and all the dogs in the nabe I really really do RT @9matryo: MY DOG IS SCARED OF THE FIREWORKS STOP SETTING THEM OFF MOTHERFUCKS https://t.co/oe4Z7eaajJ OMG ALL they know is fraudulence https://t.co/9gZW4NES4I I can’t stop watching this. So smooth, gentle but stern, does not miss a beat I’m LoLing @DarlaMiles7 https://t.co/usEAL7AboM RT @BettyBowers: Lou Dobbs calls serving military commanders \"Snowflake Generals.\"\n\nLou Dobbs was aged 19-to-28 during the years millions o… RT @TitusNation: It’s hard to be proud of my country this July 4th. Apologies to our soldiers who have to march and preen for Draft Dodger… RT @TheDweck: It’ll be tough but if Nike wants to get Ted Cruz back on their side they’ll have to say that his wife is ugly and his dad kil… You know sooner or later... \nYou really wear that suit @TheEricGoldman Yes same Marshall Sisco: Karen.  You were talking in your sleep.\n\nKaren Sisco:  Hm.  What did I say?\n\nMarshall Sisco:  “Hey, yourself”\n\nOut Of Sight’s pure sex RT @ScottHech: BLOWN AWAY. Learned today that Fiona Apple pledged *2 years* of royalties from her hit \"Criminal\" to the While They Wait Fun… DOG OWNERS! There r  fireworks in my nabe all week during the 4th. It sux 4 my pup. Here’s what I’m finding works:\n-1/3 of a small benedryl (she’s 11lbs)\n-1 capsule of Zyklene\n-CBD oil\n- windows &amp; shades closed w tv/music on\n-tight sweater (both of us😜)\nGOOD LUCK &amp; HAPPY 4th! @dylanmatt I miss his real teeth Grody https://t.co/IGmmHI6rhq RT @jessetyler: Do you give a shit for LGBTQ+ Equality?\n\nProve it &gt; https://t.co/aSYot1OwK5 or visit https://t.co/Nmqg1C1xQO now! @TieTheKn… RT @gavinpurcell: FINALLY please go back and watch @ilyamerica. All episodes are on @hulu for your viewing pleasure. I'm very proud of the… RT @SenSanders: This is truly a revolutionary proposal:  all Americans will get the college education or job training they need, while havi… RT @JuddLegum: 1. As a result of Trump's anti-immigrant crackdown at the southern border people are suffering in inhumane conditions\n\nFamil… RT @RepJudyChu: \"If you want water, just drink from a toilet.\" That's what border patrol told one thirsty woman we met on today's #DemsAtTh… These are deeply damaged people who are given power over wildly vulnerable people. CREATING THIS DYNAMIC IS PART OF THE CRIME https://t.co/vY9QPTsPGg Can these Fox News broadcasters watch this and be truthful with themselves at all or no possible way? https://t.co/2hJ1YoMDB2 @SondreLerche Aw friend! @NormanCharles88 Oh ya Cush Jumbo ties for first she’s amazing @natasharothwell Jesus H I’m watching @Succession_HBO and I know Brits are good at American accents but Matthew Macfaydyen’s is the best. Not that it’s a contest. But he’d win. RT @RAICESTEXAS: Here's what's going on:\n\n- 54,000 are in ICE prison\n- Over 10,000 are them are children. Yes, that's 10,000 kids. In priso… Look at my timeline OMG THIS IS CRAZY YOU GUYS https://t.co/EQiTzscVKR RT @atrubens: We have concentration camps https://t.co/fvV1BdNdCK @Pravduh15 Yes pharma as well (more) you’re right RT @Alyssa_Milano: I went to #Homestead, the detention center where the Trump administration is  holding THOUSANDS of children indefinitely… SO TRUE but as long as liquor/tobacco own certain politicians there will be red tape until they get a stronghold over this lucrative new industry. Once it’s theirs 2benefit from, it will be federal.  Until we stop this legal corruption only the richest will get richer. GO ILHAN! https://t.co/NABThporLs RT @nycsouthpaw: He had a journalist strangled and cut up his body with a bone saw in one of his diplomatic facilities. https://t.co/WGzfnY… RT @KiaSpeaks: What if I proposed the wild, absurd idea that both poet laureates and gangbangers deserved to be treated with respect and hu… RT @AriBerman: Here’s direct link where you can help @FLRightsRestore pay off fines &amp; fees for people with past felony convictions so that… RT @AriBerman: Breaking: FL gov Ron DeSantis signs bill requiring people with past felony convictions to pay all restitution, fines &amp; fees… There’s a reason why this shouldn’t be legal. https://t.co/VH3EGT77oy Amazing person @wittelstephanie has launched a new women-run podcast network for human beings who want human stories. Follow @lemonadamedia 4 news &amp; updates &amp; check out the preview for LAST DAY here, coming this fall:\nhttps://t.co/jubO7CwKae The Dalai Lama said a female successor would have to be hot. We are so far past seven in the seals of the apocalypse department https://t.co/h3EL5CXtwk Winners of the night no contest IMO:\nKamala\nBernie\nPete\n #DemDebate2 Just Spotted @iamDeJuana in the audience woo hoo!  #DemDebate2 Mayor Pete Yas “if more guns made us safe we’d be the safest country in the world” #DemDebate2 Kamala speaking truth y’all you can hear a pin drop  #DemDebate2 Oh Shit Bennett’s jewish??Walkin back my charisma jabberooni 😜 #DemDebate Bennet will never be accused of having too much charisma #DemDebate Mayor Pete calling out the disingenuous religious shroud  the @gop wraps themselves in while ripping children out of their mothers’ arms and putting them in cages #DemDebate Williamson too- it’s STATE SPONSORED CHILD ABUSE. These are crimes #DemDebate Ok hickenlooper said it right. Our government IS KIDNAPPING CHILDREN. Full stop #DemDebate Thank you, Kamala, for articulating the atrocity at the border plainly. #DemDebate What is this The View? One at a time, people #DemDebate Ya @KamalaHarris “America doesn’t wanna see a food fight they wanna know how we’re gonna put food on their table” #DemDebate He ain’t passing the torch to you kid #DemDebate Oh snap Uncle Joe Passin the torch?  #DemDebate Sanders saying it how it is. Plain and simple #DemDebate Hickenlooper lookin to act out of fear instead of courage IMOIMOIMO  #DemDebate @RickGlassman You’re acting like a Jew Fuuuck https://t.co/ZhhIpcTbxV @tkirdahy That’s hilarious RT @wmag: Watch @SarahKSilverman give #ASMR a try: https://t.co/IK0TxK8Ema RT @RawStory: Alabama is prosecuting a pregnant woman for manslaughter for being shot in the stomach — but not her shooter\n\n https://t.co/K… Speechless. OUR COUNTRY IS NOT OK. https://t.co/Ff2o0jaPl0 “Miss Hawaii’s doing pretty goddamn good”\n-my Dad\n(Sorry Rep Gabbard he’s old)\n #DemocraticDebate Warren has a comprehensive righteousAF thought-out plan for everything.  She’s so badass. But mostly I like her because she purty IM SORRY #DemocraticDebate Warren Warren all day Warren #DemocraticDebate Was not down with DeBlasio but he’s winning me over #DemocraticDebate “When people come to this country they do not leave their human rights at the border” \n♥️Cory\n#DemocraticDebate “Watching those images are heartbreaking. It should also piss us all off” \nLiking Julian Castro\n#DemocraticDebate “We’re been trying to arrest our way out of addiction for too long”\nGo Cory\n #DemocraticDebate KLO for the win on #womensrighttochoose #DemocraticDebate Yas Cory #DemocraticDebate I’m not high right now but for some reason I’m really seeing everyone’s bottom teeth. Like more than usual #DemocraticDebate GO ELIZABETH GO #KickASS #DemocraticDebate #maga https://t.co/KRnwt0N3Vm @NathanBrimmer 27 dresses? Singer: Elvis Costello/Bruce Springsteen/Stevie Wonder/ Scott Hutchison/Brandon Flowers/Joan Armatrading \nGuitarist: Carlos Santana\nDrummer: Sheila E.\nBass: Kim Deal https://t.co/SpB01C4k8y RT @johniadarola: ICE Agents Left 5-Year-Old Children in a Parked Van for 39 Hours https://t.co/GrqYzK621O via @gqmagazine RT @ChelseaClinton: Please read this thread. And, if you’re outraged (and I don’t know how anyone couldn’t be), please support, if you’re a… Thank you, John Irving.\n\nhttps://t.co/KfJp0Dtz8Z Psst https://t.co/zqwFDTcA1V For me, there’s no lyric more romantic than, “You’re the shit, and I’m knee-deep in it.” https://t.co/mcPgthqmqy So proud to be a part of this. @twittels turned me on to Frightened Rabbit in 2008. Then I got to know Scott and he and Katie let me be a part of this recording. Now Scott is gone too. Please check this &amp; the album out and if you don’t already, get to know the original. ♥️💔 https://t.co/88lpCHG5BB RT @danpfeiffer: This is a policy choice made by the Republican Party https://t.co/U5sJ3rhCix RT @nycsouthpaw: Are NYT’s media reporters free to look into why the nation’s leading newspapers didn’t deem a credible accusation of rape… RT @BetteMidler: But as long as Saudi Arabia (who sent 19 men to bomb the World Trade Center on 9/11) is buying 400 billion $ worth of Amer… RT @thehill: Lawyers say four migrant toddlers, one \"completely unresponsive,\" hospitalized https://t.co/VjvgZJ3MAc https://t.co/GJ35H29qWp RT @GeorgeTakei: This nation has a long and tragic history of separating children from their parents, ever since the days of slavery. We mu… I’m gonna say it. The nose emoji sux 👃🏼 For the myriad people asking to see the results of the LGBTQI+ poll:\n(Ps: That was a correct and kickass use of “myriad”) https://t.co/C39h3DE5fh @DougStanhope @KathrynBertine Jesus autocorrect does not want Doug to be a name. It keeps going “c’mon you mean dough right? Doughnut?” No- Doug you fucking robot in my hand @DougStanhope @KathrynBertine GO DOUG GO!! RT @DaddyFiles: @AlanTshirts @SarahKSilverman We live in a country where 15 people have accused the president of sexual misconduct with no… @edtaussig @moorehn Oh great, there’s gonna be a trial????? felt a genuine rush realizing its street corn season We live in a country where a 15th woman has said the president raped her and nothing will happen. https://t.co/W4Iy4vBKeC @jlennox61 Sames @carlisle_jamey Ha @J_A_GALLEGOS Ha true not like Veterans Day or Memorial Day But we are celebrating those who gave their lives for our freedom and independence. No? @ronbriand Semper Fi ♥️ @chickenbonewatt Yes! True! Narrowed the focus bc it’s a holiday celebrating our vets @trailerswift308 ? I was asking you. I’m fine. Please only vote if you’re a vet! Also heres another Q:  what about digital fireworks w music? No explosions? Would that be better? I have a lot of military in my fam &amp; I have a fireworks Q for Veterans. We celebrate u every July 4th w explosions &amp; simulated war sounds. Is that enjoyable or no? I always insist my thank yous be both formal and public. https://t.co/QmBkEhLcWJ RT @ScottHech: @RAICESTEXAS If ICE is outside your door, don’t panic, and remember: YOU HAVE RIGHTS. Even if you do everything right, they… ⬇️⬇️⬇️⬇️⬇️ https://t.co/zZXbOVJKAM RT @NYMag: “I made a list of hideous men in my life. It includes the president — who assaulted me in the dressing room of Bergdorf Goodman… RT @AOC: As long as the @GOPLeader supports jailing children and families on the border, I will continue to hold him to account for it.\n\nTh… RT @AOC: This is what the United States is doing in the name of the American people.\n\nIt’s child abuse, it’s indefensible, and we cannot wr… RT @nowthisnews: A Trump official tried to argue that detained children don’t need soap, toothbrushes, or beds to be ‘safe and sanitary’ wh… @jzipple Wait yes you are 👍🏼👍🏼❤️❤️🐿🥔🙏🏼 I’m not religious but I believe in many of the Bible’s teachings. You pick and choose what works for you. Like maybe you go ahead &amp; eat shellfish.  But to not welcome the stranger. This is the stuff. This tests who you are &amp; if you have a soul. IMO IMO IMO IMO Jesus was a refugee https://t.co/hsvPGh4zTw We think of history in such a detached way.  Don’t wait to see the atrocities around us for what they are.  TODAY is tomorrow’s history. Notice what’s happening with that scope. ⬇️⬇️⬇️⬇️⬇️ https://t.co/8AcKGQMQtW This helps so many people in desperate need. Please check it out and /or for easy giving: Text Sami4Syria to 71777 https://t.co/gvp1YHfpqi Please don’t vote if you’re not LGBTQIA+ because that’s who I’m askin! LGBTQIA+ fam- hypothetical question: say I’m offered a supporting character and one detail about this character is that she is gay. Is it ethical/ally-y to take this part? RT @jbendery: Anyway, Amazon will pay $0 in taxes on $11,200,000,000 in profit for 2018 https://t.co/teJd8CHL5Q ⬇️⬇️⬇️⬇️ https://t.co/yz1QwPmbjj Happy Juneteenth ♥️ Get inspired my Mayor Tubbs of Stockton, CA. @MichaelDTubbs TED talk HERE:\n\nhttps://t.co/FJojTHyvCp RT @ScottHech: @realDonaldTrump If ICE is outside your door, don’t panic, and remember: YOU HAVE RIGHTS. Even if you do everything right, t… RT @FRabbits: Tiny Changes. 12th July. https://t.co/4leEryXHkg https://t.co/YpHDSemxtK She‘s well versed in this history. That’s how she recognizes it as it repeats. Liz, you should read #FacingHistoryAndOurselves https://t.co/ffAqUWFEZF RT @MikeDrucker: @Liz_Cheney @AOC When my Jewish grandparents (who thankfully lived in America at the time) and their community talked abou… RT @harkathon: Please support @tinychanges by preordering @FRabbits ‘s Tiny Changes now! https://t.co/ZqzAqps7L6 Includes a duet version of… RT @stereogum: Frightened Rabbit (@FRabbits) announce 'Midnight Organ Fight' covers album. Listen to covers of \"The Modern Leper\" from Juli… @LibyaLiberty -Walk the high line!\n-see a musical (go to the TKTS line - seats will be available to something great)\n-walk around anywhere (avoid midtown/Times Square except when you go to a play)\n-Central Park\n-play w dogs in a dog park \n-street performers in Washington Square Park RT @JamesMartinSJ: \"I was a stranger and you did not welcome me\" (Mt 25). https://t.co/0lih4lq7zp This is how a leader behaves https://t.co/cXr6RfBBfm Thread 🇺🇸 https://t.co/MDOQeVYGeO RT @RAICESTEXAS: 🚨WE NEED YOUR HELP📢\nRodrigo Ruiz, a Peruvian🇵🇪 citizen has been living in the 🇺🇸 for 15 yrs and is fighting to stay to kee… But, Ilhan, a manufactured war w Iran is half of Trump’s whole re-election campaign! You’re ruining it! https://t.co/d41U9Tvz7i These are crimes against humanity https://t.co/EpWw69DGOZ RT @danpfeiffer: President’s Attorney General does unusual favor for a convict who potentially knows a lot about wrongdoing by the Presiden… In case you still don’t get it: https://t.co/n3vtF7ueQ0 https://t.co/AlQWlecqmx Two parts https://t.co/6E2nc2IoBX 🤮🤮🤮🤮🤮🤮🤮🤮🤮 https://t.co/D2yeFGgKDx Thread of the day https://t.co/hXwd358cno You sound like a broadway musical version of an evil dictator. The sixth lead that comes out with gems like these as the music vamps while you  don’t quite sing but more talk in 4/4 time https://t.co/UcK61200sY https://t.co/GcKAfcpKwY https://t.co/56ZitQbLIN Hey @KylieJenner here’s an amazing place to donate to help make sure Gilead doesn’t  happen in America!\nhttps://t.co/6UoAmYreZa\n#HandmaidsTale @AbortionFront @SisterSong_WOC RT @passantino: Trump just issued an executive order to slash 1/3 of all advisory committees that provide scientific advice.\n\nUnion of Conc… Life is precious or no?? Who is allowing this? Where does the buck stop?? https://t.co/boZaIvD9mI RT @SarahThyre: Text \"NOBAN\" to 44321 to help Monica and other amazing activists fight the abortion ban in Georgia. They are there on the g… @rejectedjokes @hwinkler4real Father’s D-AYY! The first time I felt the feeling of horny I was definitely in Spencer gifts OTHER POLICE OFFICERS NEED TO SPEAK OUT AGAINST THIS. THIS DOES NOT HAPPEM TO WHITE PEOPLE WHEN THEIR 4 yo TAKES A BARBIE.  THIS SHIT HAPPENS EVERY DAY. THESE COPS MUST BE FIRED AND ACTION TAKEN https://t.co/N2hZHnzsRF Thank you for being an amazing and most crucial leader.  Your voice is needed and must be amplified. https://t.co/XzIzOL54Cg RT @lizzwinstead: Thank you to all the badasses who showed UP for abortion rights last night! Follow @abortionfront to stay involved!! And… RT @AbortionFront: We had a great fundraiser to support some of our fave reproductive justice warriors! We hope this is just the beginning!… @michelebgoodwin @SarahThyre @lizzwinstead @SisterSong_WOC @superkwa @monicarsimpson @ARC_Southeast 12-eyes! Amazing- thank you both for making this night one of the greats.  Inspired and hopeful and full of love and fight Wednesday show for the @HumaneSociety Tix here: https://t.co/l2tGMtygLY https://t.co/s1SKA1UzyB It’s “Prints” https://t.co/6YDRDy1k5d @Marmel 😭 masturbation + love https://t.co/eC7n90dwiL Oh shit it’s on the @ComedyCentral website for free y’all https://t.co/QURatgRe3A @conservmillen Just the ones putting children in cages @BridgetPhetasy @chadfelixg @Lrhewat @VP The Wall Street journal, Fox News, breitbart Aww The Sarah Silverman Program isn’t on @Netflix or @Hulu it’s on Amazon Prime but for 2 dollars an ep. #SAD @jzipple I couldn’t agree more. RT @RAICESTEXAS: Police here with a chainsaw.\n\nThe State can act rapidly to put a stop to art installation but every night over 13,000 chil… @davidmweissman Must be from your old life. It was this: https://t.co/pcbqzCrORc Wake up, Champ. This is happening. Please wake up https://t.co/hpjXsL6Apg https://t.co/XHHpuuswPp @chadfelixg @Lrhewat @VP Try to watch something besides Fox News and read something besides the federalist or breitbart. Just sample other news and information RT @radicaldaily: June 12 1942 – Anne Frank receives a diary for her thirteenth birthday. https://t.co/mOYhBWRXMD “I keep my ideals, because in spite of everything I still believe that people are really good at heart.” https://t.co/bk8iTxCqOg RT @snopes: ✔️ True.\nhttps://t.co/yP0gOGJHAq @TheAdamEllis10 @BigBoyler That’s where I USED to play on weds!! Love that one they have speaker system for music! @chadfelixg @VP Thank you 4ur friendly approach, Chad! I usually subscribe2 that as well. But Mike Pence hurts people using his religion as cover for horrible un-Christian actions ie his torture of lgbt kids &amp;complicity in ripping children from their mothers at the border. #welcomethestranger @TheAdamEllis10 I can’t go this thurs but maybe another one! Thanks @TheAdamEllis10 INDOORS? @davidfuternick @BillyScafuri Oh shit Thursday I can’t I need WEDS @davidfuternick @BillyScafuri I’d go actually but can’t tonight - maybe tomorrow?! @davidfuternick @BillyScafuri Ooph that’s farrrrrr @steveagee Dammit Lookomg for an indoor basketball run in LA tomorrow - who has the hookup Dear @VP you are a hate mongering, fear based weasel &amp; your biggest irony is that if there was hell, you’d 100% be  going there. I hope you go 2 prison 4 crimes against humanity re: the lgbt community, women’s rights &amp; the babies u rip from the arms of parents seeking our help https://t.co/MDD9p9UuFm Thank you Jon Stewart. Goddamnit.  Watch this NOW ⬇️ https://t.co/4VV79N8fon RT @HeidiNBC: THIS lead:\n\nJust before releasing the Mueller Report, Attorney General William P. Barr ... \"strategized with Senator Lindsey… RT @bethreinhard: In Alabama—which banned abortion for rape victims — rapists have parental rights. Said one victim: “I’ve spent my entire… @heckyessica @gvaratta Sames I had a The Accused themed bar mitzvah https://t.co/Ry4ZQgzWcq Macgruber is on HBO tears The average Sarah loses her tv remote roughly every 39 seconds ONLY two??? How about there are TWO WHOLE ENTIRE FUCKING STATES that give RAPISTS PARENTAL RIGHTS https://t.co/LtWgEtdcc4 Speechless https://t.co/A1WofrXVsC @broadcity That’s INSANE @michellechel Love you I love love and I love you https://t.co/ujFIM5akXx https://t.co/HIeN5vtlxK 4 minute abortion bit in 2 parts: https://t.co/4fyviih8hs @yashar @Oprah The young woman who was so upset by this— chances are, now she has changed. That is progress: to be changed. I hold in my heart the hope that people still held back by fear or ignorance will be changed RT @yashar: When @Oprah appeared on Ellen's coming out episode in 1997, she got more hate mail than any other time in her career\n\nI'll neve… Hahaaa #FBF don’t show this to Drumpf @davidcrosss https://t.co/QbYLy8b2Zi Our president is an actual hockey puck https://t.co/1xdrncLb3F https://t.co/ha0UDQfZ2E @mountain_goats https://t.co/6vTvfmD8bk Watch thru the end. I am so proud to be alive to see @AOC kick ass and change the world https://t.co/WIYdbY2yLg ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ https://t.co/GxAPSe4R0f RT @prettylaura: Saving the future with the GREATEST COMEDY SHOW OF ALL TIME! Thursday, June 20th, The Theatre at the ACE HOTEL! A benefit… Yea New Hampshah!!! https://t.co/9RrtEcKAGZ @MrPaulBae ❤️❤️❤️❤️ RT @RAICESTEXAS: People we give legal services too have told us their medicines were taken away from them.\n\nImagine how uncaring you'd have… RT @AOC: This hearing was wild.\n\nFirst the FBI witness tried to say I was wrong. I tried to be generous + give benefit of doubt, but then w… https://t.co/inpNekiFAL YO \n&lt;&lt;ATLANTIC CITY&gt;&gt;\n&lt;&lt;BETHLEHEM PA&gt;&gt;\n&lt;&lt;NYC&gt;&gt;\ntix avail now: https://t.co/70fQmUy5A0 @AdamParkhomenko Won’t more people see this (at no cost) by tweeting it and retweeting and posting on socials? @Spencer4Texas You’re too young for this bit doll Ok I did a bunch and gotta shower and go to shows ♥️♥️♥️🥔🥔🥔 @kevdog Yours is the size of the entire inside of a cat @Jimney00 Substanch @RexGroovi Thiccccc @heavysweater Not long per se but wide and substantial @OleScunty I see you with a very silky feminine peen @Solidx1030 Skinny @AcquiredJoker On the healthy side of average. Light but stiff hair. Substantial. @CaloriesProper Deceivingly bigger than one would excpect. 75th percentile @MadLutian Lanky @Lycantherapy_ Excellent healthy peen. Shiny balls @The_Tim_Quick You are a grower. Exceptionally small flaccid, perfectly average erect. @abradley1974 Smooth, hairless, pink, average but nothing to sneeze at. Next Send me a pic of your face and I’ll tell you the shape of your peen I can tell the shape of your penis from your face #MenForChoice RT @FredTJoseph: 1 in 4 women will have an abortion by age 45. They didn’t get pregnant on their own. It’s time for men to speak up in supp… Crimes against humanity happening every moment of every day at the border. I feel like I could throw a motherfucking car. I am wracking my brain trying to figure out how to stop this. Gee I hope everyone from Trump to ICE agent is held accountable. WAIT-FOR REALS- detain him at @ShannonAirport https://t.co/yxPWfHLwxt Like pro-lifers, I believe in protecting the life of the child.  Where we differ is I want to protect the girl being forced to have a baby at 12, and the toddler being separated from his parents &amp; kept in a cage for the crime of wanting a safer life. See we’re dif but the same! 97% of Americans support universal background checks. The reason why it has not been passed is because the NRA pays off politicians not to pass it https://t.co/S3HIj4eJPs This is a great site with comprehensive resources and info- go Kenidra! https://t.co/IL7PV6z2ST You were elected because of fake tweets &amp; fake Facebook posts generated by Russian bots designed to infiltrate the American election so you should probably shut your shoe-in for-an-anus mouth \nIMOIMOIMO https://t.co/nP8OXgsfMZ @JamesMartinSJ Ah! Thank you! You’re wonderful Ahahahaaa https://t.co/5bKiTueju5 @JamesMartinSJ Hey friend! I just googled, ”What are woman Jesuit priests called?” And found an article about a Fr. William Brennan who’s dying wish in 2015 was to include and ordain women as Jesuit Priests. Is this progress happening? When your gut is screaming this isn’t right but your whole life is built on ignoring it https://t.co/ti5p444x54 RT @gabrielsherman: I obtained Trump’s 1993 prenup with Marla Maples that provides a new look at his finances. Plus documents show he would… @davidmweissman David your perspective into that mentality is an insight so few of us have and so helpful in finding ways to come together. Only you know how NOT different we all are. That it’s misinformation more than anything that divides us. And I’m so grateful for you. You are a butterfly @davidmweissman @ivyjofreeman And thank you for your beautiful letter. RT @travisakers: President Trump: “Haven’t seen any protests yet...”\n\nLondon: https://t.co/RjRdnLIVk0 RT @RichardEngel: One of the centerpieces of the London protests. Trump on a golden commode, and it talks, says “fake news” and “witch hunt… RT @iansmadrig: \"Donald Trump specifically asked about me because I remind him of his daughter, and she said, 'Well, she's 13 as well.'\"\n\nI… She was 13. All evidence points to this being 100% what happened. Read whole thread but omg this ⬇️ https://t.co/RihooDttaJ All JOURNALISTS &amp; State of NY prosecutors: THREAD https://t.co/M1lj7XacmA What’s your Ramadan break fast of choice? (Do you call it break fast too?) #EidMubarak HAHAHAHAHAHAHA the best https://t.co/fUZgCJ2NR3 Yo @peoplemag pitch for 2019 sexiest man alive: Randall motherfucking Park @mrbenwexler Where is his youngest? El oh ellll https://t.co/OEJTROjEg9 RT @bejohnce: LOL TO PEOPLE WHO WANT A CENTRIST, MODERATE CANDIDATE also stop having kids https://t.co/i8exCIguXu It’s amazing when you realize that every nasty thing he calls people or accuses them of is actually 100%  about himself. For reals. The Sixth Sense this and go back and look. https://t.co/bGOhLjrhoy I just admire that back in the 90s they were on to this truth of not believing women and had our protagonists make that deadly heinous mistake RT @OwenJones84: Trump doesn't deserve our respect. He deserves to be fought. Take to the streets https://t.co/zK3ySOXKFK @SyriaCivilDef Is she with a family? Is she safe? RT @fakedansavage: So the pedophiles weren't in the basement of the Washington D.C. pizza parlor that doesn't have a basement. They were on… @DonCheadle Hahahahahahahhaaaaa laughing ol https://t.co/ssmUiaDHLM https://t.co/xCpB5gftMx RT @mat_johnson: Now I know what face a Ken makes when it takes a shit. https://t.co/IoqO8OXqLU What a consummate weasel https://t.co/3OWJE9mRGF @silkiestmaria @julieco345 @KevinMKruse I somehow feel responsible #PrayForTrump https://t.co/2laKndnA4C @chelseahandler Hahahaha True but I had help\nhttps://t.co/24Dlzac4AZ Great read by a red-headed Muslim manboy named Ahamed Weinberg❤️❤️\nhttps://t.co/RdX8jTSgs8 RT @theJeremyVine: This ... is incredible. \nAmerican televangelist Kenneth Copeland never foresaw that buying a private jet with money rais… RT @THR: Off Broadway's @AtlanticTheater to premiere @SarahKSilverman's 'The Bedwetter' musical, as well as new plays by #EthanCoen, Stephe… @LeslieMac Never sure what’s right. Dif opinions abound❤️ ⬇️ https://t.co/PpsUaYZ6nm I like to jump in with an anxious,  “Go on” between, “In the criminal justice system” and, “the people are represented by two separate yet equally important groups“ I think  @jimmypardo took this picture I’m on his show Playing  Games at https://t.co/6l9bJ6J30W I think Wheeee https://t.co/JBity6LBRf ⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️ https://t.co/bQSTcsrbbR @rgay AHHHHHH!!!!! RT @wkamaubell: Save this for when someone says to you, \"bUt tEIL mE wHy hE ShOuLd bE ImPeAcHeD.\" \n\nHere's a bevy, a plethora, a veritable… This was a free flowing conversation about real shit with @racebanning and @Coach_Tea and I’m grateful for it.  The dichotomy of Coach Tea mirrors the dichotomy of America today and I truly learned a fuckload (when I wasn’t flapping my own mouth off) https://t.co/ojgYZKC2wY @LeslieStreeter Oh my heart♥️♥️♥️ @LeslieStreeter All I understand is that I can never fully understand. But I got your back the fucking rage I feel watching this is a fraction of a fraction of a fraction of the experience- the constant daily existence of being brown in America. https://t.co/mD9W7fCJNK RT @GhostPanther: This is Stalin, Idi Amin level crazy. Never imagined I’d live to see 40 percent of Americans okay with something this der… “I’m going to brush my teeth and when I get back I’d like to see some kind of attitude adjustment“ is what I just said to my dog RT @ava: The cop orders him to shut off the car. Then tells his fellow officers “he has a gun.” There is no gun, except the one that the co… Yo @GovChrisSununu your superficial reforms are not enough and NH children are dying and being abused under your watch.  \nhttps://t.co/leFPrt9mm7\nhttps://t.co/eHag3EdOCc\n#THENEWROADPROJECT cares and is watching RT @SethRudetsky: Please read; New rules allow health care providers to refuse medical care to transgendered people AND it allows homeless… THREAD⬇️⬇️⬇️⬇️⬇️ https://t.co/GDFhUDqhzN I’m not f-ing kidding - the genuine love &amp; support among competitors is inspiring. I wish our representatives would watch &amp; learn Well @LauraJSilverman has been telling me forever and it’s true- @MasterChefJrFOX is the best most hopeful brilliant show on TV Really liking @KamalaHarris in this town hall check her out y’all Ok. Time to breach the myriad NDAs that keep clinics &amp; doctors from exposing the countless abortions acquired by “pro-life” politicians.\nIMOIMOIMOIMOIMO This state by state Handmaid’s Tale pr campaign is not funny anymore RT @earwolf: Everyone sing with us... 🎶 Playing Games! 🎶 with @jimmypardo 🎶 (and today's special guest, @SarahKSilverman!!)\nhttps://t.co/Wm… Hahaaaa I love me some AL https://t.co/xchRnhqpPs This scene from Cheers always makes me cry \nhttps://t.co/nGoyb4AxOW @JamesMartinSJ You know I’m pretty godless, but for YOU, I’ll pray! Or at least send my best energy! ♥️♥️♥️ @fortunefunny You were amazing! @samesfandiari @KirkSeriousFace @bomani_jones Um RT @SteveKerr: This is fantastic. Read through the thread. Great stuff.. https://t.co/DwaqibWjSJ @mat_johnson That’s how I feel about reading them! We are so alike it’s cray @JasonIsbell What’s the word that’s a giant boo but also a genuine yay? None of the fellas from the 🏀 pickup game today knew I was gushing blood from my vagina the whole time.  Which I think possibly makes me a goddamn a hero? Fucking slacker antisemites:\n\n&lt;&lt;Brewer told FBI officers he wanted to “scare the hell out of [Jews],” and send “a message of like, get out I guess,” &gt;&gt; https://t.co/AEQ5fHGey0 @rgay I love you so RT @AOC: Can ⁦@politico⁩ explain to us how photoshopping money trees next to the only Jewish candidate for president and talking about how… Thread https://t.co/8pu9R0NY5C RT @deray: read the replies: https://t.co/5dcZGEIgep Literally ripped off @JimmyKimmelLive bit where they slow down Trump https://t.co/TUyd0KQeWt America: watch this and realize while he puts children in cages, separates families and encourages hate, our president’s every tweet paints himself the victim. Every single one. https://t.co/PMAXt6jjYs If ur a white male writer having more trouble getting jobs than usual, take this opportunity 2 realize that that’s how it’s been 4 literally everyone else &amp; conclude that from here on in u may just have 2B undeniable 2get the gig like the rest of us. I love u, bro! U can do this! https://t.co/ZvNUfXZR3Z THREAD https://t.co/JvJcbSRopz THIS⬇️⬇️⬇️⬇️⬇️⬇️⬇️ https://t.co/gLhZyhiOIA RT @JuddApatow: That is clearly a man eating ear wax. https://t.co/BZR6VfHAX6 RT @NormOrnstein: .@PeteButtigieg knocks another one out of the park: “I don’t have a problem standing up to someone who was working on sea… RT @emmafreud: Richard Curtis, founder of @RedNoseDayUSA, explaining to @jimmyfallon what happens when you spend $2 on a red nose at @Walgr… RT @AudraEqualityMc: I can’t qwhite put my finger on why this is happening. https://t.co/cShXbU7yyK RT @shaunking: BREAKING: The Trump administration hid that a 10 year old child died in their custody at the border this past September - th… RT @RAICESTEXAS: A photo of Carlos has been released. He survived the thousand-mile journey from Guatemala to the U.S. border on his own.… Holy shit-  with SIXTY THREE reviews  @Booksmart has a motherfucking 100% on @RottenTomatoes \nin kickass @oliviawilde feature directing debut WOWOWOW @michaelsheen Wouldn’t he have drawn a more realistic dragon tho don’t @ me @JamarNeighbors Texted u @JamarNeighbors Ride w us RT @shaunking: 1991. 3 years before the Crime Bill becomes law. \n\nThe bill is named after Joe Biden. Biden takes to the floor to brag about… RT @RAICESTEXAS: 52,000 people. This is a new record. ICE imprisoning a record number of migrants.\n\nNo one should be imprisoned for seeking… @takeout4five Suspended?? @ASE Its beautiful and so important. @SanaSaeed Thank you, Sister ♥️ @ASE @SanaSaeed Love you @SanaSaeed For me, ever since 2017’s dyke march in Chicago https://t.co/dVNeaUdni5 @SanaSaeed Thank you.  I hope it maybe proves that these feelings exist and are growing. Because we’re feelin it. RT @akkitwts: This baby trying to make Beatbox with his father is the funniest and most tender thing I've seen in a long time😂😍 Adorable ht… RT @ASE: The video that @ajplusarabi published that questioned the holocaust was offensive and should never have been produced, let alone p… WTF??????💔 https://t.co/HqnUV23SPa There are lots of contenders but Peter Popoff is the devil https://t.co/tHDVLNSsZY Any representative who thinks they can plead ignorance by not reading the Mueller Report is wrong - it’s their job to read it and it should be assumed they read it so you might as well know what you’re defending, dingbats #ReadTheMuellerReport RT @Alyssa_Milano: This man brought tears to my eyes. \n\n‘I fought for the rights of all Americans, and that includes reproductive rights.’… I can’t be the first to come up with Scar-Jost right? Mazel https://t.co/hzDvHMFYe9 When u see this picture know that it’s made by an artist out of resin &amp; does not at all represent what a 12 week fetus is or looks like. It’s smaller, translusent and not nearly as developed as this it does not yet look like a human baby because it isn’t yet.  Thank you @snopes https://t.co/EqPYRqlD6t RT @RabbaSusan: I have an idea! Let's be like this and take care of the already born kids! https://t.co/b1jxhha1R3 Hear me out: chilled raisins MUST WATCH https://t.co/fJ0NfheVdZ Tomi wants less government over her private choices - which is a basic republican value,  until it comes to legislating women’s bodies. IMOIMOIMOIMOIMO https://t.co/tKOkQpuirp Hey Twitter I know it’s not your job to educate people but in the time you took to shit down their throats for being wrong you maybe coulda RT @IamKevinCostner: What's the funniest two word combo you can think of? All I can come up with so far is SIX EGGS I love u but y’all are exhausting @smartsassylib @Karnythia ? I call everyone Ma. I love about 10 young comics that call me Ma. Also you should correct Nike who uses it for the US men’s soccer team also wiki it also your arrogance and lack of forgiveness isn’t very nice IMOIMOIMO RT @RabbaSusan: Jewish citizens of Alabama: Sue the state on behalf of religious freedom: a pregnancy that threatens the health of the moth… @Karnythia Gosh I just signed on and saw this.  I only knew it it was a generally douchey Texas pro gun thing. I will never know things until I know them. Deleting.  But why you give up on me so fast? You perfect Ma? RT @GavinNewsom: This barely made headlines yesterday...\n\nVulnerable children.\n\nBeing forced to sleep outside.\n\nOn the ground.\n\nOn top of r… RT @LPJLeague: Honestly, we wish reproductive rights got HALF the coverage #GameOfThrones does! So... we made this handy little video for e… @Frances_Fisher Love it! Luckily @SenatorCollins promised us that Kavanaugh  would uphold Roe #WomensRightsAreHumanRights RT @matthewjdowd: One of my younger brothers sent this to out to his nine living siblings today.  He is a doctor by the way.  And we all gr… Rage https://t.co/6L32ZtdNQ4 @SamaraKlar Excellent point. Just saying it’s the women who get punished by this not the men who impregnate them, no matter how lovely they are RT @the_wing: You can help stop these restrictions from spreading by donating to the @yellowfund here 👉 https://t.co/k9KXC1RQYi https://t.c… @CharlesKersey Brilliant - did you make this? Do you know who did? RT @ScottHech: Cop: “Show me your ID.” \nMan: “No. You just pulled up in front of my f*cking house &amp; told me I have a warrant from Louisiana… We have become our grandparents, shaking our heads &amp; saying, “What is the world coming to” but we’re talking about the decay of human rights instead of rock and roll. 27 white males just decided what Alabama women can and can’t do with their own bodies and lives.  *(Males cause 100% of unwanted pregnancies) https://t.co/QfXpnwit0w I’m noticing an excess of the word space in the wellness space RT @ava: Don’t move forward after reading this like everything is normal. Don’t shake your head at Alabama and then keep going about your d… Good grief.  Women should have the same autonomy over our bodies that men do. If we don’t have autonomy we don’t have equal rights.  \nThis is devolution https://t.co/GSPe5O4pLK please @realdonaldjtrump @vp @IvankaTrump @FLOTUS please stop this. I give up. Just please stop these crimes against humanity https://t.co/7xz4HsqhfG #isWhatIimagineMunchwouldsay2Tutuola ♥️ I was just thinking that today at brunch! https://t.co/OZajdu1WHJ https://t.co/ydohSgcsSe I used to live for the smell of my boyfriends’ armpits but I’ve found if I workout hard enough I can manifest that uber-masculine post-coital smell in my own sweet armpits and I consider that a win RT @papermagazine: \"Make no mistake, this is an attack aimed squarely and purposely at women.\"\nhttps://t.co/5WohwCioSr @oranicuhh Always RT @AndyOstroy: Hey @SarahKSilverman &amp; @realjeffreyross fans...check out the #AdrienneShellyFoundation celebrity #auction and bid on this a… @oranicuhh I’m so proud of you, and so in awe. You are loved. And you matter. There is not another person in this world qualified to be you but you. Exactly how you are exactly how you’re doing it RT @CoryBooker: We need an aggressive approach to end the epidemic of gun violence in our country. My new plan would:\n\n✅Keep guns out of th… RT @AoDespair: Can only speak for my production company. Our comparative assessments of locations for upcoming development will pull Georgi… RT @ChrisEvans: Garbage people. This thread has a bunch of them. https://t.co/PlLVAiQvAx It’s been one year since our friend Scott took his life. Please give to Tiny Changes\n\nhttps://t.co/Fs6dKmPC4J @avenaim Hm. I think maybe you should rethink your question. Sleep on it, friend @ColMorrisDavis fraternal @JosephPEbert It’s a b-ball hoop in the other room. RT @pattonoswalt: 👇👇👇👇👇👇 https://t.co/n4e4GtDtZu IG took this pic down bc it was obscene.  Unsexualized women’s breasts r obscene. If they’re oiled up &amp; smashed down by, say, sexy suspenders covering just the nipples, that’s not obscene.  That’s sexy! \nTo recap: \nwomen’s breasts = obscene men’s breasts =not obscene. https://t.co/ZlhZki9SKj @Sethrogen I love you @common ♥️♥️♥️♥️this is so important and you are so brave. ⬇️👍🏼⬇️👍🏼⬇️👍🏼 https://t.co/v1Upafy72j RT @AOC: “6 weeks pregnant” = 2 weeks late on your period.\n\nMost of the men writing these bills don’t know the first thing about a woman’s… @davidmweissman David your growth and awareness is inspiring! Therapy and getting off line is a huge next step. Know you are supported in your venture to be the best, happiest, most present you you can be, for yourself and your family. We have this one life- you’re doing it right! ♥️♥️ RT @shaunking: Local authorities kept this cell phone video from Sandra Bland a secret for 4 years. Local journalists @WFAA fought to get i… @whatsthaTweet @matthewphotos3 @carly__bird @ThatEricAlper AND her versions of greatest love of alllllll by George benson @ThatEricAlper Johnny Cash’s version of Hurt by nine inch nails ann reinking deep dive @billyeichner Me too at my lil bathroom TV. Keep hearing myself saying aloud “not camp.” @ohmercy_me @AnneWheaton Sweetie that doesn’t happen. It’s not a thing @KathrynBertine @DougStanhope Or maybe Doug changed his email address! @DougStanhope @KathrynBertine I love you so RT @RabbaSusan: When the red alerts are growing nearer and your deaf son refuses to wear his cochlear implants while he sleeps. #crazyassfi… NO ONE is advocating infanticide. You are lying. God sees you lying https://t.co/2kxaIZeVtN RT @nowthisnews: Trump’s fed nominee Stephen Moore withdrew this week over his history of racist, sexist, and insensitive comments https://… @MarwaBalkar I don’t even do yom kippur. I find I get very hungry (but Sarah, that’s the point! To connect with the suffering!) I know I know I’m the worst Ramadan Mubarak my Muslim friends! You can do this! I mean, it’s easier if you keep comedian hours, food wise, but you can do this! @welliver_titus @U2Ginger @hswandel @Connellybooks Ha!! ❤️ I may not be totally open but I’m at least ajar @jdub3o Tone deaf too. But not quite the same as what the shorter clip implies The longer clip changes the context of what he meant tho and whoever u want for pres you gotta care about what is true https://t.co/QSbCUGzR0Z https://t.co/kSzhtEniP1 @noncanadianguy @IbrahimAS97 THANK YOU @MrChuckMartin @RepCohen IMO I disagree my sweet CM. I think eating the chicken was sweaty and brought the attention to himself needlessly. The plastic chicken on his desk was a clear statement and badass IMOIMOIMO @RepCohen Always check w me. The plastic chicken on his desk is powerful and cool and funny and makes a statement. Eating the bucket of chicken feels a lil thirsty. This is good you’re learning.l!!! Professional women’s hockey players get ZERO health insurance and make TWO THOUSAND DOLLARS a SEASON. SMMFHRO (shaking my mother fucking head right off) https://t.co/6SvO5jtZPl @IbrahimAS97 Is there a place to see the rest of this? Making money from crimes against humanity SO ON BRAND https://t.co/2G0858MybY The plastic chicken is funny but the plastic chicken AND bucket of chicken isn’t- it’s what we call in comedy a hat on a hat.   #ChickenBarr https://t.co/aNFkvLVSTz @billyeichner You’re. Fuck. @TheStevenWeber Fuck goddamnit Steven shit I hate when I due that @AmyKinLA Yes @billyeichner You know your my ideal @GeneralThoughts Agree LIKE IN AMERICA This is why it kills me when western social justice excludes Jews in this fight. Who do you think is fighting the occupation most after Palestinians &amp; Arabs? It’s like thinking everyone in America loves Trump and shares his ideology https://t.co/DuYQJrsMWb RT @IfNotNowOrg: Today, a historic coalition, including many #IfNotNow members, will come together to do what the #Israeligovernment won't:… @IAmJohnAles Not a test! He can’t pretend to be these things -that’s cheating. He can openly aspire? Practice. I know I sound specific but he’s my invented man @IvanBrandon 60/40? @brandondarby Hahaaa I had to look that up Also: knows he isn’t a pussy for having feelings and is brave enough to explore them (but also: isn’t a pussy) I forgot:  not a daily drinker. RT @ABC: Israel comes to a standstill with a two-minute siren wailing across the country in remembrance of the six million Jewish victims o… -Masculine but/and a feminist\n-Kind/cares about others\n-Likes to laugh\n-Likes himself \n-Smart, w no need to prove it\n-Reciprocates\n-Likes to be alone\n-Outer spoons\n-supportive in success &amp; failure\n-Not daunted by lows- just grabs me and says, “I got you, Knucklehead” Just walked through the most powerful gas at LAX. It was like being punched in the face with a smell. What a crazy life! We need this man on the debate stage https://t.co/NBKAGXwpOF Goddamnit \nI woulda watched Get Out for a third time if I could Who’s watching @eva.stories on IG? Wow. Not shady at all https://t.co/QIYGCNyRoB @heckyessica ❤️❤️♥️ Father John Misty on PBS @mrmark77 @davidmweissman ⬆️bot @ABrightMonster @BeetlejuiceBway I love that it’s just raunchy fun and then you peel a layer and it’s about love and loss and the need to feel seen. @SOPHIANNECARUSO You were BRILLIANT!!!! Saw @BeetlejuiceBway and loved it. SO fun- so dense with hard jokes - secretly heartwarming - the actors amazing- every element was dope. Check that shit out PLEASE WATCH THIS https://t.co/xcMbJVWnBa @SMochinski Think!!!! Holy shit that last #GOT was so brilliant all the way through the end when the Allman Brothers rode up What’s this from???? \nReluctant Patient:  “Wasn’t I supposed to talk about my childhood or father or something?”\nShrink:  Oh you did WOW https://t.co/BAzLqXDY13 Even spelled correctly, making up a fake quote and attributing it to “Chief Hostage Negotiator, USA” is so goddamn funny. https://t.co/yDppKAXTeN @TheBMartin @donallogue I know WE and Sundance show them but I only have basic cable here @donallogue All versions, Declan RT @brotherjones_: This afternoon, after the vote to take $ from public ed, we ended up sitting by Rep. Justin Lafferty, Rep. Micah Van Hus… Who do I have to blow to find some L&amp;O reruns on NY basic cable? Earnest replies only. By all indications you have never had a single thought about an other https://t.co/Ky50VL0zQ7 @charliearchy @peterawolf @pauloCanning Gross. Deleting. @im_PULSE @Amotevalli @JZarif @BenjaminNorton Boom @im_PULSE Oy vey. I don’t know who the fuck Benjamin norton is I just agreed w what he said there. Sorry Pally @im_PULSE @JZarif Aw shit I just read the tweet in a column of tweets about the topic. Had no idea. RTed on the merit of the tweet alone. Ooph RT @IlhanMN: This is appalling. We have to stop selling the Saudis weapons and supporting this brutality. https://t.co/4GIOhFsLdN EVERY CEO/COMPANY OWNERS SHOULD READ THIS BRILLIANT THREAD https://t.co/70gkiQQ61a I think I’ve only dated brunettes unrelated here’s a pic of my dad https://t.co/Ca0yeSwHvR Happy Easter y’all! My mom used to hide jellybellies all in plain sight on like-colored things over the house. We’d find so many but through the year we’d still find more This coffee shop is playing all Michael Jackson and never has John Berger’s “Ways of Seeing “ been more applicable @davidmweissman Don’t try to change them.  Just love them and find places to connect - sports- a tv show or movie you all liked or didn’t like... if they ask you political questions answer honestly for you with no judgement of them. ❤️❤️ RT @benandjerrys: It’s hard to celebrate 4/20 when so many people of color are still being arrested for pot. We have to do better. Learn mo… ⬇️⬇️⬇️⬇️⬇️⬇️⬇️ https://t.co/Xmf8XTmhAP @jonahray @Henlips @TigNotaro And #MikeIvy @jonahray @Henlips @TigNotaro Oh my gosh!! in about 12 years Mueller Probe will be a cool name for a band RT @yashar: The rebuild of Notre Dame will be well funded. \n\nIn the past month, three historically black churches in Louisiana were destroy… ⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️ https://t.co/PskhObJUU1 RT @MikeGravel: Donald Trump is a servant of Saudi interests, willing to support a genocide against the Yemeni people so that a stunted cro… TEN MILLION YEMENIS ON THE BRINK OF FAMINE-by-means-of-war by SAUDI, AIDED BY THE UNITED STATES. Congress agreed\nto stop this genocide, trump overruled them.  #SaveYemen https://t.co/hNJocuw4Mg RT @SenSanders: The people of Yemen desperately need humanitarian help, not more bombs.\n\nI am disappointed, but not surprised, that Trump h… @toddbarry And you sarcastically told me to tweet it and I chuckled like “ya right”... RT @nowthisnews: What if Fox News covered Trump the way it covered Obama? It would look like this https://t.co/dLfhHToieL RT @theappeal: Wesley Shelton was arrested &amp; charged with a felony for possession of a $10 bag of marijuana in Alabama. Held in jail on $2,… What is it about getting older that makes you like the taste of arugula RT @BernieSanders: Raise your hand if you're sick and tired of your private health insurance company. We need Medicare for All. #BernieTown… RT @RBReich: At least 60 companies reported that their 2018 federal tax rates amounted to effectively zero, some even got multi-million dol… RT @nycsouthpaw: ICE forcibly breaks up the family of a US Army MP killed in Afghanistan, deporting her widower to Nogales, while her 12 ye… RT @jonfavs: The father has lived and worked here for 15 years. \nThe mother died serving her country in Afghanistan at 22. \nAnd now their 1… RT @ananavarro: Today, I saw a video clip of @PeteButtigieg playing classical piano. Another were he speaks in Spanish. And this one, were… There are powerful people who need us divided. Bernie calls bullshit. We need more of this⬇️⬇️ https://t.co/s7TxBw2sVy RT @jbendery: The guy hasn't said a thing about the three historically black churches burned down in Louisiana in 9 days. https://t.co/rEGA… RT @JuddLegum: Why are Trump's lawyers preparing a \"counter-report\" to a document we've been repeatedly told \"completely exonerates\" the pr… @zachbraff https://t.co/SduvXMWjYp Been catching up on Game of Thrones via @juliacunningham on @EW radio on @SIRIUSXM . She is going through every part of GOT in the most gossipy, spilling-tea  style and it’s honestly AS brilliant as the show itself RT @wmag: Watch @SarahKSilverman give #ASMR a try: https://t.co/afWhbQJGyJ @AdamBaldwin Fuck I typo’d RT @MarkRuffalo: My name is Mark, and I lost an uncle to Fox News... https://t.co/RyqzuFrWS1 Thank you for your service. You are American heroes.  I am shaking my head right off my neck at the unconsciousness and ignorance of this admin https://t.co/ggpWTwuRjc RT @GerryVerry: @JasonSCampbell Ironic that someone named Matt is werking such a dewy finish. RT @CoryBooker: Today is the day! The Hometown Kickoff starts in just a few hours. Watch along as I share my vision for a more just and fai… RT @13THFilm: \"In the good ol' days...\" #13TH https://t.co/2IzF87ODP6 @AdamBaldwin Come in Adam you know that’s my sweet spot Come see me with @BethStelling @marinayfranklin and @DaveJuskow wheeee! https://t.co/8jhwRg7wjn This morning Trump sat on the toilet and when he got up 10 minutes later there was a huge smelly shit in it. Clearly the work of the VIOLENT ALT LEFT Yo NYC- excited to sit down with my brilliant pal @Birbigs at #Tribeca2019 for a special  conversation about comedy and shit @Tribeca Talks: Storytellers. Join us: https://t.co/AuR0EZ9NYS Ok Sergeant Schultz https://t.co/YmNYajIdxW RT @perlapell: Being in this movie was a great joy of my life! Can’t wait for it to be here. https://t.co/QDvOr26Jxl NYC 4/30 comedy show benefitting @NRDC w this crazy line-up! Making a $10 donation towards their amazing work puts YOU in the running to win tickets! https://t.co/PI5DLUu1Mf #NRDCNightOfComedy. Help save the planet! https://t.co/O1x5FWtFSj Wow this is happening all over and all I’m doing is tweeting about it. Fuck https://t.co/SwQ28lRDDQ @KarenKilgariff Yes @KarenKilgariff My mom and I bonded so hard on this. We memorized it and did it together all the time. @MrAndyNgo Hahahaa what a SCOOP! Women must have autonomy over their bodies. No version of America would legislate men’s bodies under the guise of protecting potential life. #MyBodyMyChoice #ohio https://t.co/a0A5R4Lebs RT @gabrielsherman: Fox News is a cult\nhttps://t.co/k9aqVSiICq RT @TVietor08: Oh my god. Laugh until it hits you that people this stupid get to make laws. Then cry. https://t.co/AqCJk2P9md Omg #FosseVerdon Watch this for heart refill! ♥️ \nhttps://t.co/suCtoe46DC https://t.co/HWbnvbAYJ2 Yes @DionaReasonover https://t.co/HCUIcxVlVP Oh shit mansplaining is the most awesome when the grown-up brat who’s never heard no tells @MaxineWaters that she’s supposed to “take the *gravel* and bang it” https://t.co/Fq6bAzr2U8 RT @jonfavs: This fact check is from a year ago because Trump has repeatedly lied about this, which he did again today. https://t.co/kqP4Za… If calling out Stephen Miller is antisemitic then I’m Himmler. Stephen is what we Jews call “Bad for the Jews” https://t.co/LIepEv9q03 These lyrics sung to the poppiest tune gives me the giggs:\nFuck off/ you think I'm a punk/\nYour face looks like an elephant's cunt https://t.co/DPD110GCpA @EllenPage @TalesofTheCity I loved the one w Chloe Webb and I can’t wait for this one!!! Yo, Israel https://t.co/lnOC8RPVjV @nealbrennan Oh my god RT @BernieSanders: Another horrific attack in the Saudi-led war in Yemen. More children dead. President Trump, I urge you to sign the resol… RT @KikiAdine: Brilliant post re Georgia’s faux devotion to unborn babies &amp; the heartbreaking stats that prove how little interest GA Lawma… Please, Israel, VOTE HIM OUT. https://t.co/Zn5t9k5tBh RT @JustHallel: My sister is so fucking funny - if you don't know her you should!\n\nFollow @mrAlizaRose \nhttps://t.co/47WUxJzkmn\n\n⬇⬇⬇ https:… I can’t begin to make out what he’s trying to say. I’m using context clues and everything but also ima lil high https://t.co/2ajRkP9m2x @PFTompkins That’s hilarious you are 100% on my that list @MattOswaltVA @HollandTaylor @_AmandaWyss @henryrollins @RandyRainbow @blainecapatch @JamesUrbaniak Yes! Probably not, and it would be his biggest mistake https://t.co/HELfgZqqt4 RT @JamesMartinSJ: This is the language used by Nazis against Jews (\"vermin\"), Hutus against Tutsis (\"cockroaches\") and American slaveowner… Iron Man: @TheDweck \nBlack Widow:  @AOC \nThor:  @IlhanMN \nBlack Panther:  @Alyssa_Milano \nHulk:  @MikeDrucker \nAnt-Man:  @JuddApatow \nCaptain Marvel: @MotherJones \nCaptain America: @DonCheadle https://t.co/lsh8N64R1C RT @Alyssa_Milano: This is worth 3 minutes of your day. I’m proud to call @cmclymer my friend. She inspires many...and so it should be.  ht… I truly hope those responsible for separating these families seeking asylum go to prison for a very long time for crimes against humanity https://t.co/xU0R6kUAcx I like this guy a lot https://t.co/kwT7DEUUej RT @AndyKindler: \"Jewish Republicans\" cheering at the prospect of our country closing its doors to asylum seekers must have really short te… It is no secret that Fox News was created as a propaganda channel. They spread lies in clever legal ways (ie “MM *tells* BH that lie lie lie” tech not a lie) It’s so fucked up #ChangeYourParentsChannel https://t.co/HxJ1R49T65 I love this cooking show!!! https://t.co/YpoVj5O5g7 @paulapoundstone Huh must have been a beautiful dream @kristenschaaled @BlomquistRich Was for me @trajel 💔 @paulapoundstone It was either jon ross or Henriette mantel... Midge?i wanna day one was Midge @paulapoundstone Ha, no.  Insanely (and regrettably) I’ve never met you, though once I visited someone who was watching your cats and was very excited @RickGlassman Wait there’s a line? RT @brianklaas: Trump uses the words infest, breed, and invade to refer to immigrants. He calls asylum seekers animals. Nazis referred to J… I don’t have a person RT @RollingStone: Watch Sarah Silverman and Walk Off The Earth record \"Video Killed the Radio Star\" https://t.co/iJO1ZWL3tg https://t.co/9P… RT @MarkRuffalo: Give the man a prize! 👏👏 #GreenNewDeal https://t.co/Wzu1nDBEhR RT @dodo: Baloo the cat has a very special security blanket — his dog brother, Henry 😻❤️🐶 https://t.co/qLFS99zp45 @mehdirhasan As well as a 13 year old girl https://t.co/qvOLODBsSe RT @Lawrence: When @BarackObama was president, he released his tax returns every year by April 15th while he was being audited. \n\n(IRS rout… Google who else has called the free press, “the Enemy of the People”. You’re in like-minded company.  Stalin, Goebbels, Mao - all the big name fascists. Congratulations. Misinformation and lies are your best friends and they don’t love you. #windmills https://t.co/4DHJQqUiSV RT @jeremynewberger: @realDonaldTrump RUSSIANS, NORTH KOREANS, SAUDI ARABIA = best friends\nPRESS = enemy of the people\n\ngot it.\n\nAt least o… RT @ilyseh: If you were confused about how ingrained controlling women's bodies is to the radical right-wing as a whole, watch these militi… RT @ETCanada: WATCH: @SarahKSilverman trades in her comedy chops for singing skills in #VideoKilledTheRadioStar with @WalkOffTheEarth https… This was so fun ⬇️ https://t.co/apXtfJ1u4W RT @ThePerezHilton: .@SarahKSilverman  singing! Love this!! https://t.co/jyu64BPxwc RT @sahilkapur: In Iowa, @BetoORourke says the president’s rhetoric on migrants and calls to ban Muslims sound more like the Third Reich th… Tim Apple https://t.co/xgfrowla3b Badass head coach  @NotreDame    @ndwbb @MuffetMcGraw ⬇️⬇️⬇️ https://t.co/EJ5RdOceSa RT @FINALLEVEL: Did this MF just say “The noise causes cancer??!”  I’m done. https://t.co/Ra83iQWnEm @KenidraRWoods_ @ksdknews @reneknottsports Kenidra is doing it @wyattcenac @johniadarola @ProblemAreasHBO ♥️ 😭😭😭😭😭😭😭😭😭 https://t.co/4tlP368Igz RT @MarkRuffalo: \"My child is finally free to be who they are. With that freedom comes a responsibility, for us as legislators, to legislat… RT @Lin_Manuel: They super didn’t.\n91 Billion was the estimated DAMAGE.\nPuerto Rico is still WAITING for most of their allocated relief fun… @johniadarola @wyattcenac @ProblemAreasHBO I wish ❤️ This Friday at 11PM @wyattcenac’s @problemareasHBO returns! If you haven’t yet- check it out \nhttps://t.co/v6mR0lfbLD @TheComedyStore I’d complain but I’m sure this is the best possible picture oh Sarah you’re strong and your body works @SebastianComedy \n-Francis\n-Matteo (maybe call him Matty) \n-Alessandro (get this- call him “Sandy”. Badass)\n-Ridi (means “laugh” in Italian)\nI know this is crazy but- I love the idea of:\n-Bambino - cutest name ever and then as he’s older Bambi \nOr beanie or bino \nOK I’LL STOP RT @nycsouthpaw: It was Trump’s grandfather—not his father—who was born in Kallstadt, banished from Bavaria for dodging the draft, and woun… @haralabob I love “Doll”!!! That’s what my Nana called me. Yo y’all I’ll be chatting with @chelseahandler in San Francisco on June 1st for her Sit-Down Comedy Tour. Go to https://t.co/1fof6DtPrR to see us live  #lifewillbethedeathofme”\n @chelseahandler #lifewillbethedeathofme\nhttps://t.co/yqSWMUE7Ro @haralabob Sweetie I don’t mean he’s consciously testing his power. The opposite. he is about 8 years old emotionally @HollywoodImprov Nope at 11. @jonlovett Are you checking the bright colors of how many likes this tweet got and refreshing it’s brightness every half hour? It’s not just pathological. He’s testing his power. It comes from intense powerlessness from formative yrs.  Sad, yes, but truly dangerous &amp; happening all over.  We live in a world where unconscious people acquire massive power 2 fill unfillable holes. https://t.co/0wTjdew0pi @rgay I love you for sticking with a traditional toothbrush - I did too,  for far too long, but I’m telling you the joy of going electric is real RT @AOC: Related: Chelsea Manning has been trapped in solitary confinement for refusing to answer questions before a Grand Jury.\n\nSolitary… @IlhanMN *It takes white women 15 months. ❤️ @heckyessica It’s ok I get that a lot when I tell people I have never tried fish @heckyessica Ok I know we have our differences but this may be too much, Fletch @Castaldo2018 @starkravens I hear that.. ya RT @mkraju: Cummings tonight told us it is “a million times worse” than Clinton emails.\n\n“Because what you have here are people who literal… Catherine O’Hara the best all time https://t.co/Zd0JwspYrb I hate that your father smacked you across the face in front of your peers for the crime of not wearing a suit to a Yankees game. And I hate that abuse made you loyal to him. I hate that that behavior works. You deserved better. Now it’s just a bully cycle &amp; no one wins https://t.co/sxqwxBMMfW RT @_SJPeace_: \"My wife is Pakistani &amp; loves to watch hip hop dance. She asked me to dance to music from her culture...so last Sunday I got… “He starts the fire so he can put it out”\n- @ElissaSlotkin on #realtime last night @heckyessica Haha that’s it Hold up- is Maine’s state motto “semi permanent”? Badass.. https://t.co/M9LTivCrpb “I led my menstruate into a massacre”\n#HistoryHasItsEyesOnYou @heckyessica She and I were also a heavy metal band at i think the mothers’ hs  reunion? @EricHolthaus @AOC It’s not that corporations want the status quo - they are run by wealth addicts. They love oil /money more than life. That’s what drug addiction does. We have to stop listening to liars who will rob their grandmothers for a fix @LibyaLiberty It’s where some of my family is from! (AND I could not find it on a map if I tried...) This Uber-stupid error aside, Trump pulling aid from these countries - aid that’s proven 2 help(according to this admin’s #s), more people than ever will need 2flee/seek asylum, perfectly timed 2Trump’s anti-immigrant re-election platform. He starts the fire so he can put it out https://t.co/rBWvdLXgRa @heckyessica @amber_athey Yay! I’m 1/2 of Andy &amp; Ollie (w my sis) and Mrs. Schnur @amber_athey @heckyessica It’s a good time to finally watch LOST or re-watch The West Wing or Sopranos or Killing Eve. You’ll take pain meds for the worst of it and popsicles will feel so good. US and THEM could just be US https://t.co/wHwBBDiaXA RT @sandyhook: Mark Cortale presents @SarahKSilverman with Sirius XM Radio Star Seth Rudetsky on Sunday, May 19th at 8pm. The evening will… RT @RepJerryNadler: Banning abortion before women know they are pregnant is absurd, unconstitutional, unscientific and cruel. We will fight… @AOC https://t.co/ZFsO2NOUhF @MrCaase @AOC Ha! @AOC https://t.co/EckiuGHoI1 @AOC Great point, but I think even more importantly, I have this shirt https://t.co/A0Ws9OcKbj They do https://t.co/E3SdMLa2vN ⬇️⬇️smh⬇️⬇️#Giliad⬇️⬇️ https://t.co/PbUWo2OEZh RT @MarkRuffalo: Pine Ridge Reservation has been in a state of crisis for more than two week, leaving thousands without clean water and aid… RT @Sarah_Pickar: Josh Lyman:\nIf I see the real thing in Nashua, should I tell you about it?\n\nSam Seaborn:\nYou won't have to.\n\nJosh Lyman:… RT @mattwilstein: Insane week launching #TheLastLaugh podcast! HUGE thank you to @SarahKSilverman for being the best first guest this guy c… RT @johnsonjoeb: He's \"rich\" but you can't see his taxes. He's \"smart\" but you can't see his grades. He's \"exonerated\" but you can't see th… RT @RepAdamSchiff: I say this to the President, and his defenders in Congress:\n\nYou may think it’s okay how Trump and his associates intera… @woopigsushi @heckyessica Your use of quotes is maybe the most liberal thing about you but I’m a sucker for a man in a onesie @jmazz25 @heckyessica I’m like potato chips @heckyessica Oh, Ma. Look at us! Disagreeing brought us together! ❤️ isn’t it funny we live in this world where people think you have to agree on every single thing to love each other? Like, doesn’t anyone have parents?? RT @NARAL: Thank you to all the celebrities proudly standing against this extremist attack on the rights of Georgia women! Grateful for the… RT @TVietor08: Hi there - Qanon is a terrifying death cult. It would be good for everyone to pay attention to its spread. https://t.co/ulbC… Um lol and also oh myyy goodnesssss https://t.co/BwUK85HNpw Wow this all day this https://t.co/aUlzaCZ2ko RT @broadcity: here it is: every ending to our eps (except the major one). it's the perf mood piece before tonight's SERIES FINALE at 10/9c… Beloved comedian @jasoncsaenz was in a bad accident + you can help by attending a jam-packed show! Yes it's that easy to feel good + help a great guy who needs our support. Monday 4/1 at the Regent Theater! Killer line-up PLUS silent auction! Tix here: https://t.co/lSu55EQhJU. @BJMendelson @melissafumero @ThatKevinSmith I’ve always wanted to play Randall’s role RT @JuddApatow: One day it will all come out and we will be astonished how long it took for people to care. https://t.co/LSGqcaZ8hb RT @AOC: Look at this picture.\n\nWhen you’re looking at this photo, you’re looking at a mirror. This is America. This is Texas. This is our… RT @nowthisnews: ‘This is a warrant.’ ’No it’s not.’ — This citizen stopped ICE from arresting 2 undocumented immigrants because he knew hi… Signed! Now you https://t.co/3i3YET149f “Before you tell me about your religion, show it to me by how you treat other people” #BookerTownHall Cory is killin it. Go Cory! #BookerTownHall @NYTnickc Love Cory Love Bernie love Elizabeth  love Beto— great options and I’m rooting for all! @xiankiefer So happy she’s on the mend!! Just follow @RAICESTEXAS so I’m not contsantly RTing them - they are doing God’s work for reals Whoa 80 mins til  #BookerTownHall on @cnn y’all \n@SenBooker @matthewstoller @charliekauffman Whoa.  us three. @nealbrennan @MrJoshCharles Neal! Tee @allywalker1 Ally 😭😭😭thank you for reals @AaronNagler Spending time with them fortified me. Thank you♥️ RT @ShaneGoldmacher: Safe to presume this is Ocasio-Cortez’s next viral video from a committee hearing https://t.co/SrBd6MY5Xx @Joeydanger5 Thank you @davidmweissman 😭😭😭😭😭😭😭😭 convince me there’s a point RT @themaxburns: Betsy DeVos just announced the Department of Education will end all funding for the @SpecialOlympics under @realDonaldTrum… @ReignOfApril Wasn’t being critical just having fun thinkin on it. ❤️ ⬇️⬇️⬇️ https://t.co/Yk3eA5EWCU RT @lizzwinstead: 📣📣📣 @LPJLeague has a new great video with our own sports talk show \"Cathy and the Cooch\" (the great @frangeladuo w/@Flemi… @ReignOfApril @MsKylaK @ericandre AND @Drake Huh https://t.co/hcgG41RKPL This is lovely and I hate to push but y’all are EACH worth 4 BILLION. 11 million doesn’t even sting. You each make that while you sleep.  How about a Billion? Between the 4 of y’all? Won’t change any of your extreme levels of existence. Maybe? https://t.co/3E6KCKOUbb @rgay y @ReignOfApril @MsKylaK My nephews and also @ericandre Omg Samantha Morton on @WalkingDead_AMC *if ur response to me following you on twitter is a podcast request DM you’re part of the problem Hey sweet mama check this youngin out she ♥️s you @iamcardib https://t.co/zz1ue7kXwn RT @ilyseh: Brian Kemp could sign #HB481 in the next 24 hours effectively banning abortion in the state of #Georgia. This bill makes women… Sweet ass lineup https://t.co/3tmBG4EaRA Great news that there was no collusion with Russia by the @potus — now he can focus on finding, disabling and punishing those who worked for Russia to attack the US election. Now THAT’s a National Emergency worth skipping golf for @robdelaney I’m flummoxed top to bottom  I have so many questions about Kevin Liptak I was in one all along.. https://t.co/OGDR2G3Xco RT @Alyssa_Milano: Hey Georgia! \n\n#HB481 is bad for business. There’s a vote today and potentially the final passage next week.\n\nIf the fil… @JessMKnoll Yas RT @sallykohn: We don’t yet know what’s in Mueller’s report. \n\nWe DO know the following ppl have already been indicted:\nTrump’s campaign ma… I want to be in a psychological thriller. Just throwing that out there. Thx @BradBessey Fixed it! For people who keep sayin Hollywood should “STFU &amp; stay out of politics,” you sure elect them a bunch https://t.co/ZiaHOmWRD7 @aria_ahrary Omg I need to redo this I forgot them!! BUT HIS EMAILS https://t.co/EdaBHKiqEW RT @ABCPolitics: .@MeghanMcCain responds to President Trump criticizing her late father Sen. John McCain: “If I had told my dad ... he woul… RT @jaketapper: Combat vet texts me: “Trump’s McCain comments hurt my soul. How have we arrived at a place where this is even possible, and… RT @votevets: 1. John McCain was a war hero.\n\n2. John McCain is no longer around to answer smears and attacks.\n\n3. It is therefore repugnan… RT @PeteButtigieg: When a president (who faked a disability in order to avoid serving) attacks a departed war hero, it’s for attention. \n\nW… Bat Shit Crazy https://t.co/fhIv54QLWd RT @thedailybeast: Subscribe now for The Last Laugh, a new podcast hosted by @MattWilstein that explores this cultural/political moment thr… Of course they did smh https://t.co/lyzWDMnbxP @birbigs 😭😭😭 @nataliemorales Nat &amp; the Bryants is a good band name Bless your hearts https://t.co/LzdDCpYiPE @heckyessica Whatever’s going on- sometimes just existing through it is not just the simplest but the bravest thing you can do. Then before you know it you’re on the other side of it. @heckyessica Are you ok? Sending you love @KenidraRWoods_ Haha im just seeing this ♥️♥️ RT @nubianskin: @KrystinaArielle @SarahKSilverman @DerekSykes17 Hi Krystina! We definitely understand your frustration in finding a bra tha… RT @nowthisnews: ‘Why are you thanking me? I didn’t do anything. I didn’t help anyone. I just perpetuated a system of senseless violence.’… I am so down with this. Thank you @IlhanMN for this piece, let’s work toward a two state solution and let the US be a force for peace and freedom and justice for all  https://t.co/cOkXRO7IAe RT @samstein: Interesting. @JoeNBC says that Trump privately conceded to him that he knew the birther crusade he led against Obama was a li… RT @timkmak: Just an elected official joking on his verified Facebook account over the weekend about a civil war and how his side would be… RT @EricMcCormack: This is all I need from Twitter today. https://t.co/E6R9NMcrys RT @yashar: New: Saudi Crown Prince authorized a secret campaign to silence dissenters — which included the surveillance, kidnapping, deten… RT @willwikle: (left) New Zealand terrorist flashing white power hand signal; (right) Zina Bash, Repub operative &amp; wife of Texas US attorne… RT @brianstelter: —@AnaCabrera: \"Instead of joining the world condemning this hatred and offering support to the Muslim community in New Ze… ♥️♥️❤️ https://t.co/GA8svN6RQm The kind of emergency where he plays golf every weekend and watches reruns of SNL? That level of emergency? https://t.co/a74liNhNx8 Just like Jesus would do https://t.co/T62GLTKOna RT @shaunking: Murders by white supremacists DOUBLED in 2017. \n\nThen went up another 182% in 2018. \n\nThese numbers are widely available.\n\nW… RT @jfreewright: Is just me or are the #2A gun-rights folks not talking about arming the mosques?🧐 RT @quesepa: https://t.co/X1xguIvHyZ RT @PaulRudnickNY: Meet Jeanine Nicholson, a firefighter for 25 years, a breast cancer survivor and just appointed San Francisco's first LG… @heckyessica So many people murdered in such a small town... I blame the liars, not the lied-to.  ❤️ https://t.co/IbHN13N2Jj I so love that your name is Jessica Fletcher for that reason ❤️♥️♥️ https://t.co/C4UQfUDLWU Ur talkin abortion. I’m pro choice on abortion &amp; ur not. We disagree on what is life there. That probably won’t change. The misinformation is that anyone disagrees on life AFTER birth.  NO ONE is for ending life after birth. Please tell ur peeps we agree on at least that ❤️ https://t.co/V9fHiBvnB1 @bronk Ha I’m so glad u brought that up!U need to KNOW that that is an insane lie that’s being spread &amp; there are ZERO democrats or pro choice people who want to, or in any way approve of killing born babies. THAT IS INSANE and we ALL agree that’s murder. PLEASE LET UR PEOPLE KNOW! https://t.co/o0oAbFezt2 RT @tcbandages: @SarahKSilverman Change is here, @SarahKSilverman. Check us out at your local @Target store. 2019 baby. RT @bessbell: Whoops I just left my life and my family to shine Mayor Pete's shoes full time. https://t.co/rGJ1nRIkCO @rianjohnson @nickcuse Yes Ishtar!! @arttavana People of color and their children and people who care about them and the lil micro aggressions that make them feel shitty in tiny ways that you don’t think matter? Maybe baby? ♥️ @dbongino Agree @TianaTheFirst Ha I say “fuck” a lot.doesnt mean I’m losing my shit. Jus pointing something out I’m a comic and I notice shit and like to change w the times and see through others’ eyes n shit Mama @CatanoOfficial People of color, &amp; people who care about equality &amp; recognize microaggressions. I’m sure they don’t mean it but it should change. No big deal just change it so little kids don’t see something labelled “skin color” &amp; feel like their skin is wrong. Does that put u out 2 much doll? I find innuendo corny but I’d like to invite you to my soft opening RT @daveweigel: Bernie Sanders's campaign has recognized a union (w/ United Food and Commercial Workers Local 400), the first presidential… @CantorCWunch @millep27 Hahahahaha seriously it’s like amazing how many (exclusively white) people can’t tho k of any other word for “nude” @TheMarieFonseca It’s amazing how many thoughts and feelings I can have- like how you spent time responding to what you (White) think is trivial. I’m a comic I have lots of thoughts and ideas all the time Toots @BCtweets60618 No I can do whatever I want wheeeeeeeeee - stay big picture. Anyone else wanna tell me how to navigate life? Brett your adorbs😜😜😜 @HollieCampbell1 You truly can not think of anything but nude to describe it? Peach? Caucasian? Beige? Good grief Kitten! ♥️ @STEVEWIBLE beige? Peach? Caucasian nude? @TheRealCupofJoe LOOK AT ME AND MY GOOD POLITICSSSSSS (but it is bullshit tho. ) @PaulSoxfan2861 @CBSAllAccess @thegoodfight It’s Lay Down Sally @TheGoodFightFp @the_1_Lexi_D @CBSAllAccess @thegoodfight They should post them as they make them- because they are so timely and the more they wait the less of the moment they become. Still best show just saying the creators/writers/actors etc must be frustrated bc they’re making this powerful show about the news &amp; then have 2 hold it @dannyfocz Fuck RT @SanFranciscoBA: @SarahKSilverman 💔 https://t.co/CqRvHcp4IZ I can’t fucking believe there are still “nude” bras &amp; nylons &amp; BAND AIDS- if you are a company still using NUDE to describe an exclusively caucasian shade in 20motherfucking19 you need to CHANGE NOW or go tha way of zee dinosaur, Babee. @MarkHarrisNYC Yes!! RT @MrGeorgeWallace: So sick of the hate. So sick of the body count. And our sorry ass excuse for a leader is out there teasin' violence. I… RT @bowker_john: Last month you spoke at a rally organized by the Islamophobic yellow vests, with white nationalist Faith Goldy. Your campa… Heartbroken for my Muslim brothers and sisters in New Zealand.  We gotta reject the cultivation of hate wherever we see it, and not just recognize it when it effects us.  Come on y’all ugh 💔 @AudraEqualityMc You were amazing in this episode That fat bug that crawls down Sean Hannity’s collar is grossing me out so hard @TheRealDratch @girlscouts Literally sleeved an hour ago (thin mints obvs) (frozen) (I’m nauseous) Yo, @CBSAllAccess it’s INSANE that u stockpile this BRILLIANT, of-this-very-moment, show &amp; finally@its here &amp; ur posting 1/week?! Why wouldn’t u optimize the cultural relevance of these eps — y’all — this is ur STREAMING service!  post that shit!!! #TheGoodFight @thegoodfight RT @ProudResister: Dear @LindseyGrahamSC,\n\nHow did you go from calling Trump “a race-baiting, xenophobic, religious bigot” to betraying our… How can he single-handedly  block a 420-0 vote?? https://t.co/nmSxOvSO7z RT @RepJoeKennedy: A President that puts Americans first doesn’t unleash a budget that starves them of housing, health care &amp; food. #TrumpB… RT @Yair_Rosenberg: Today, the people of Gaza had their protest against Hamas misrule suppressed by gunfire. Tonight, thanks to terrorists… #MAGA https://t.co/YCdcipmGtx Sidebar to this awesome speech by Ireland’s Prime Minister (who is gay):  Suck it, Mike Pence. You and your wife should be ashamed of yourselves.   PEACE https://t.co/Mp80aLFraO RT @neeratanden: This is how it’s done. https://t.co/IT5mZkRh9b #MAGA https://t.co/9m7vGuqtHX @KenidraRWoods_ 🖐 Hm... “tough decisions” ay? #AlFranken https://t.co/UFwS0z3RQ9 RT @danagould: As newscasters and pundits wring their hands over Beto O’Rourke‘s purported lack of experience, let’s remember that the curr… My sis @RabbaSusan and niece @JustHallel were there as always⬇️⬇️⬇️ https://t.co/EqMH6u8Yo8 ⬇️⬇️⬇️ https://t.co/PHJMVFR1Q3 RT @tweetsby_nicole: When white women scam their children into ivy leagues vs black women who sent their kids to better school districts ge… RT @TalbertSwan: Remember Kelley Williams-Bolar?\n\nShe was was convicted of using the wrong residence to get her daughters into a better sch… RT @TalbertSwan: Remember Tanya McDowell?\n\nShe got 12 yrs for sending her 6 yr old son to Norwalk CT’s Brookside Elementary School while sh… RT @KimNoreen22: Call the Senate and demand they vote YES on SJ Res 7 - #YemenCantWait https://t.co/4ZwhjzWsSN I went to NYU for 1 yr w/ a very small scholarship ($1500 per semester) and my dad paid the rest. I was shocked at all the rich kids whose parents “made them” go to college. Seriously- let someone who wants to learn go in your shitty kid’s place. Ugh. @PPFA provides affordable healthcare 4 women. And yes, ABORTIONS, which save women’s lives in myriad ways.  For people who constantly argue 4 smaller gov’t to insist on taking choice away from women — I gotta say GET OFF OUR DICKS https://t.co/7WtlBmhjVe 25 years ago. This is why I believe in Bernie #lgbtq https://t.co/QOpZc34u4e @TaranaBurke I don’t have much in my fridge it I always have some concord grape in a squeeze bottle Yessss @oliviawilde !!!! https://t.co/oev0bX1dMv This is an ad the GOP made to appeal to liberals and oh my God it sure is wow https://t.co/XJ8lfqjaL0 wow I really stayed up until 5am watching The Beach That’s a terrible thing that teacher did but also this is the Fox Newsiest headline you guys are so fucking cute https://t.co/PF8g7pKfWw WATCH THIS. Sen. Stephanie Flowers’ face should be on money. HERO https://t.co/Ocl66ej7ZI RT @JamesMartinSJ: Are children of divorced couples welcomed? Are children of parents who have their children out of wedlock welcomed? Are… RT @keithboykin: Fate Vincent Winslow, a 41-year-old homeless black man, was sentenced to life in prison for selling $20 in weed. \n\nTrump’s… RT @JasonIsbell: Seriously y’all. I have more than I deserve and I’m grateful, but there are so many songwriters out there who work harder… RT @katewalsh: THIS is what the fight for gender equality is about. To elevate the voices of women on the front lines of the fight against… RT @representus: Will you be there? https://t.co/h9AiSM5DVa RT @DafnaLinzer: The founder of the spa attended the inaugural, has been to the White House and is a guest at Mar a Lago. Story is packed w… RT @ScottHech: For context on Manafort’s 47 months in prison, my client yesterday was offered 36-72 months in prison for stealing $100 wort… RT @mehdirhasan: I asked Blackwater founder Erik Prince about calling Iraqis \"barbarians\" and about the murder &amp; manslaughter that happened… RT @David_Leavitt: Paul Manafort committed fraud and got 47 months of prison.\n\nFate Vincent Winslow sold $20 of marijuana to a stranger and… A giant chipping away of Woman’s Rights state by state https://t.co/OXYp7qnRqW RT @People4Bernie: .@BernieSanders: We can't even use dirty words,this is the US Senate\n\n@SarahKSilverman: I can't?!\n\nBernie: No, no, this… He cannot conceive of a company not named after one’s self https://t.co/3Jb6NVsMMs RT @TheDweck: Trump may be an evil bigot but it’s important to remember he’s also the dumbest person alive https://t.co/Itf8yvVEcu Thanks friend https://t.co/vPBjGuLxVn @suzannewhang ❤️❤️❤️❤️❤️❤️❤️❤️❤️ RT @BYT: DC BEST WEEKEND BETS///\nHang out with @mikefredkrol at @cometpingpong, drink all the beers at @dcbrau's HopFest and spend Internat… THE DIFFERENCE BETWEEN NATIONALISM &amp; PATRIOTISM https://t.co/yjCEEtDIck https://t.co/SHhHSzzHcN I hate that they bleep the swears. The end is “stuffing robot sex slaves in their penthouse fuck suite” right @nickwiger ? RT @caidid: \"A $15 minimum wage is an antidepressant. It is a sleep aid. A diet. A stress reliever. It is a contraceptive, preventing teena… Oh Shaun I’m sure this is all “out of context” smh. 💔 https://t.co/BDRsbXm2oi I love you brothers but navigating the male ego is fucking exhausting NO. NO NO NO FUCK NO https://t.co/5wUf2TXb7o RT @RashidaTlaib: Yet another display of racism by the GOP. I urge my colleagues to speak up &amp; condemn this. @IlhanMN is being targeted jus… @emilyvgordon Girl I got you. Between that time I was sick (YOU REMEMBER) to my everyday melasma: https://t.co/uH61dPsr7Z RT @GuthrieGF: Just days after the United Methodist Church voted to strengthen its opposition to LGBTQ rights, the UMC’s staff in DC defies… RT @CoryBooker: The failed War on Drugs has really been a war on people—disproportionately criminalizing poor people, people of color &amp; peo… RT @ABC: On Thursday in Hanoi, Pres. Trump said he believed the dictator who runs North Korea's ruthless regime when he said he didn't know… RT @ABC: BREAKING: Otto Warmbier's family speaks out against Pres. Trump's defense of Kim Jong Un over their son's death. https://t.co/woaW… RT @RAICESTEXAS: BABIES SHOULD NOT BE IN PRISON.\nBABIES SHOULD NOT BE IN PRISON.\nBABIES SHOULD NOT BE IN PRISON.\nBABIES SHOULD NOT BE IN PR… @kenolin1 Wow thanks!!! @RickGlassman @ADAMDEVINE noway Are there 24 hour batting cages? Can someone make that happen? @TheStevenWeber @cococohen always calls me that! Penny. You kept your number, Penny @ScottGrimes Jenny Slate Hard hitting news from huffpo https://t.co/RCK1QCDJ8D Having a good ol music wallow. Thinking about the kind of love only a Morrissey song can describe The pleasure the privilege is mine This is the man who brought a black employee of Trump’s to the hearing today to prove Trump isn’t racist.  Mark Meadows is a fucking PIG https://t.co/hx3T6xJH59 RT @cspan: WATCH: Complete exchange between @RepAOC @AOC and Michael Cohen. https://t.co/dBpwzeEYRY RT @Alyssa_Milano: If this doesn’t anger you, check your pulse. \n\nHealth and Human Services docs show THOUSANDS of alleged incidents of sex… RT @IlhanMN: The Saudi government might have been strategic at covering up the daily atrocities carried out against minorities, women, acti… Earnest question: why isn’t there a #BDS movement against UAE and Saudi? Thousands killed and 10 million a step from Famine as means of war, which is a direct consequence of Saudi and the UAE’s bombs, many supplied by us?\nhttps://t.co/znBd53VU6O RT @soledadobrien: Our President is a moron and this video is just more proof. https://t.co/X5095r8X0k THREAD https://t.co/ST09Wu8srQ dick https://t.co/dmnuDiD3tX Everyone needs to watch @RedTableTalk - it is therapy. It is as real as it gets. If it’s mentionable it’s manageable. THIS https://t.co/4O0zJrsPiU RT @CNN: .@BernieSanders on Trump: “This President is the first President in the modern history of our country who is trying to divide our… RT @CNN: \"We'll bring a lie detector along and every time he lies it goes 'beep.'\" Sen. Bernie Sanders jokingly describes his strategy for… @JenaFriedman Ha! RT @foe_us: \"Nobody's outlawing cars or cows — the basic premise is government can help spur change by making renewable technologies more e… RT @HeerJeet: @JohnCornyn Senator Cornyn: You should consider the number of democratic socialists you were jailed and killed for opposing M… This show: @chelseaperetti @TigNotaro @Blacktress &amp; Me https://t.co/zUtLQTO6xm RT @nytopinion: What are Mexicans doing in America?\n\nWinning. https://t.co/zHL3VKaDap RT @robdelaney: Read up on your enemy: https://t.co/vwzUb6lb0H https://t.co/XtWMmW143g @jennav5 @DeidreLOlsen @MarcScottEmery I didn’t create it I just retweeted it!! Do not give me credit for this awesome list!! ♥️ RT @AmyYasbeck4real: Friends-please retweet https://t.co/ykJGXToDV5 RT @RepJoeKennedy: A gag rule that injects politics into health care decisions that should be made by women &amp; their doctors will leave pati… RT @CoryBooker: It’s not enough to just legalize marijuana at the federal level—we should also expunge records of those who have served the… RT @jbendery: Someone sent me this image of the latest copy of NRA's magazine, featuring a story with the words \"Target Practice\" next to a… ♥️PERFECT EXAMPLE OF BRODY STEVENS⬇️♥️ https://t.co/fIJOviNeu5 RT @DougStanhope: Brody Stevens. Some insight. RIP https://t.co/Ik4kqhKVh6 RT @emilyvgordon: I love this clip of Brody testing out bits on people in the green room. He did warm up for all three seasons of The Meltd… RT @KateAronoff: Here's Diane Feinstein telling a bunch of literal children to fuck off https://t.co/67NnpRgkcW RT @julieseabaugh: Largo - February 23, 2009 https://t.co/GCO5owA41y The comedy clubs will have “Make God Laugh” on their marquees 2nite like they always do when one of us ... I’m not sure God will GET Brody but his local references will be epic. Ugh. So sad. #818 #EnjoyIt #RIPBrodyStevens \nPs Brody would be so psyched about TMZ covering it RT @nickkroll: #RIPBrodyStevens he was so funny and weird and vulnerable and wild and kind. Every time he was onstage it was an adventure.… RT @pattonoswalt: If you are depressed or feeling suicidal please please please please please reach out to ANYONE. I never get to see Brody… The extinction of bees is the extinction of we https://t.co/2YouWtXkrT @MaajidNawaz @aliamjadrizvi “Plum” hahahaaaaa Must read- I wanna see this movie. Corrupt father, Son bent on justice... https://t.co/aFY5TaFqIZ Because the people in power are bought by big oil big banks, Pharma etc. The choices being made aren’t based on what’s best for the people, or progress, or national growth (personal growth however..).\nWe’re becoming another Trump property: elitist but dingy https://t.co/a7RTCPzrxp His hometown https://t.co/bwJdUDQJao The deep sorrow a 17 month old never usually has to feel.  THIS IS HAPPENING ON OUR WATCH. Our president did this. Our under criminal investigation president. https://t.co/rGsngn65LB fuuuuuuuuuuuuuuuuuuck https://t.co/l7G2WhMx8R Ha it really is the most simultaneously joyous and nihilistic song ever. Also check out No Children by @mountain_goats https://t.co/EBlAfPmIMy RT @AOC: If we cared half as much about the wealth we could generate by investing in human capital as much as we cared about real estate sp… Law &amp; Order is my constant.\n#Lost RT @JayRuderman: @SarahKSilverman Please consider retweeting to promote more opportunities for actors with disabilities. https://t.co/S4aER… RT @MollyJongFast: Radicalized by the presidents twitter feed. https://t.co/c41mmGYzoh RT @everythingloria: NEWS: Met with @Netflix about @OneDayAtATime S4\n\nThey made clear that they love the show, love how it serves underrepr… @chillmccool It had a typo and I couldn’t live with it THIS IS AMAZING hahahaha https://t.co/uOskegMqHp RT @renefris: Best video ever? #LoveYourPetDay https://t.co/uGuSnMw6Kb You are an exhausted toddler w a full diaper throwing a tantrum in a sandbox. You cannot even SEEM to care about others. https://t.co/08jcZEZ8la RT @chelseaperetti: 1. I just cried. 2. Drake looks weird in this like almost aged? https://t.co/7sxPz2dRkw @zoebritton Do your thing mama. I’m undecided as of now. I think if he ran as an independent people would be way more angry and rightly so. He does not want to split votes. I think that’s actually very team player of him as it was then. IMO @thunderwalker87 Ha! @xiankiefer Oh sweet one 💔-&gt;♥️ @thunderwalker87 But wasn’t it revealed that DWS was maybe... a lil biased? Holy shit I loved her so much! Where we doing Thanksgiving?? https://t.co/s4QfrFzGBV Warren, Booker, Harris, Sanders, Klob, maybe Beto, Brown, Uncle Joe, and who knows who else will join! So let’s start out supporting each other. Because we fucking need each other. ❤️ How y’all loving @AOC But crapping all over Bernie? Saying “he’s not a real democrat”. I’m flummoxed. Anyway, who knows what will happen there are so many great ones stepping up and more we don’t even know of yet! What’s peep’s prob w Bernie runnin? Lots of goodins throwin their hat in the ring.  The angle that he is  responsible for Trump is straight BANANAS. He ran as a dem SO THAT he wouldn’t  split the vote, and when Hillary was the nominee he travelled the country campaigning 4 her. RT @samstein: At 39 years old, Shakir is almost certainly the first campaign manager of a major presidential campaign who identifies as a M… RT @ScottHech: TRUTH to POWER-“Youll never know or be able to relate to the pain I felt that day.” Jazmine Headley tells City Council of NY… RT @wittelstephanie: The most dreaded day of the year is here again. Another Yahrzeit https://t.co/G2IcnbgEBw RT @robdelaney: More important than any presidential candidate. ORGANIZED LABOR WINS AGAIN. https://t.co/GLR3OyJaee RT @OurRevolution: You raised your voice, you rallied, you collected signatures, you and this grassroots movement showed @BernieSanders tha… In his defense he meant to post it on 4Chan... https://t.co/CgZ0o1ttNl @kat_blaque Wow! Been using it wrong. I learned it from Dolores Huerta.  So would you say that Intersectionality isn’t something you do but something you INFER? @brandondarby Interesting piece, Brandon. My only guess is there were several mass shootings in the states - I think 3 last week- with “official” sources that also barely got covered. But I read ur piece &amp; assuming that stuff is rampant, it shows why people there’d wanna find refuge here❤️ RT @neeratanden: New election now. https://t.co/zGmVAD2AqV RT @SenWhitehouse: When a President of the United States asks for “retribution” against @nbcsnl and calls @FBI agents “treasonous,” one has… RT @AnandWrites: This. What felt like a crazy thing to say a few years ago is, more and more, the basic, accepted truth. https://t.co/WlCOA… RT @avaduvernayfans: The power of her words. \nToni Morrison, born on this day in 1931. \n📷:@randolphjr https://t.co/SK3acrqBbH @InvisibleChimp Yes!! The study shows that when out on the defensive, or infused with fear people across the board (lib and cons) make conservative choices, when put at ease and safe secure feelings, they (across the board) make liberal choices RT @INARAorg: Join us &amp; @WarChildUSA for #GoodForALaugh - an all-star comedy fundraiser on March 1 at @LargoLosAngeles. Featuring @SarahKSi… Our government is doing this to humans.  This is non partisan issue. We have to join together to stop this. We are punishing children for seeking safety. https://t.co/wvVbFI4epg RT @nowthisnews: NFL star @Shaquemgriffin shared an adorable moment with a little boy who has 1 hand, just like him https://t.co/ILiCaIC9e4 RT @JuddApatow: People need to watch the hate and rage in Stephen Miller as he answers questions from Chris Wallace.  He is unhinged and cl… ⬇️💔❤️♥️ https://t.co/tM7lIGtavM I want a tee shirt of this picture ♥️@DonCheadle https://t.co/A4y6xKMaji Trump has taken his personal cycle of abuse to a macro level.  How are we letting this happen and how are our representatives letting this happen? THIS is an emergency https://t.co/sc4JTWraiY RT @franklinleonard: This. https://t.co/qjopSCZ7De My knee jerk reaction is the old “they’re missing an empathy gene” but that’s just  “us” &amp; “them” thinking  — I think it’s that no one can access their empathy when their porcupine needles are up. When their baseline is fear. Eh... I dunno. But maybe https://t.co/CqpzGJcFnM RT @allthingscomedy: Happy birthday to the late Chris Farley who would've been 55 today. One of the greatest and most energetic performers… I will never stop crying it’s too much /can’t handle https://t.co/zLh8PR3Saz RT @RepJeffries: Why did Trump declare a fake national emergency?\n\nMexico shut him down.\n\nRepublicans failed to fund his medieval border wa… RT @RepLucyMcBath: Today would have been Jordan’s 24th birthday.\n\nI am honoring my son’s life by working for common sense solutions to end… @ThisIsZeroHour That would have been swell but it was cancelled, Kitten. ⬇️Go Gen Z #JoinJuliana⬇️ https://t.co/bq28YF7ZxL NSFW and also CGFS (Contains Gallons of Fake Semen) https://t.co/nCc1p0NX5W RT @jonathanchait: Obamacare was passed into law by 218 House members and 60 Senators. The wall did not pass Congress. https://t.co/d5dDmK8… RT @TonyAtamanuik: I think today’s a good day to look at this again.  @ilyamerica @SarahKSilverman and @aoc you’ll enjoy this too! https://… @melissavcomedy @enayarmivla Brill RT @birbigs: A great piece about billionaires by @SarahKSilverman. https://t.co/KwnX9NMfsX @birbigs Thanks Doll BILLIONAIRES COST US MONEY CC: @AOC https://t.co/bVVrBTfhqR RT @AOC: Amazon is paying $0 in taxes on $11+ billion in profit.\n\n$0 for schools.\n$0 for firefighters.\n$0 for infrastructure.\n$0 for resear… RT @RAICESTEXAS: There's no doctor. No medicine. Sickness spreads. Ana is 10. She is looking after her mom. She can't sleep because the lig… Amazing thread - count me in as an auntie https://t.co/7EwPMNgr75 RT @ThomasSadoski: A star-studded comedy night with @SarahKSilverman, Dan Bakkedahl, @TigNotaro, @Blacktress, @chelseaperetti.\n \nFriday, Ma… Slide into my BMs RT @WeAreLoveArmy: Happy #ValentinesDay! #ReclaimLove as a force for justice and put your love into action - RT this video and help us send… @CleoProtogerou @primalpoly @hlithskjolf ? Twins? @liorca @Kveller ❤️ @NancySinatra @Jugbo ♥️♥️♥️ @TheLeadCNN @jaketapper BRILLIANT @MJMcKean Touché (tushy?) @NancySinatra @Jugbo “Sarah Silverman Erupts at Trump: ‘You Are a Smelly Penis Hole’” “we must be careful that we do not allow the justifiable aspects of the critique against Rep. Omar to lead to a reflexive position where we silence active criticism of the Israeli government, or the worst actions of the State of Israel.”⬇️ https://t.co/SHVVh9v9IW RT @NARAL: \"I decided to share my story because the next time [someone] alludes to or overtly calls women like me at best heartless or at w… Best headline ever https://t.co/LZ3MdI3wbE @Variety Hm like Morrissey Michael Stipe Ozzy Osbourne Stevie Nicks... please. Love you @TheMandyMoore George Washington Carver changed the world with his nuts RT @NSOtweets: On sale now: @BenFolds's Mar. 8 #NSODeclassified presentation!\n\nCelebrate #InternationalWomensDay w/ @SarahKSilverman, @Dana… RT @JustHallel: 2 STATES FOR 2 PEOPLES\n\n#Israel &amp; #Palestine living side by side 🇮🇱 🇵🇸 \n\nRT if you agree RT @RabbaSusan: Dear RightWingersGleefullyPointingOutAntisemitismontheLeft. It's not an opp for you to win me. Its existence breaks my hear… RT @RabbaSusan: @SarahKSilverman AIPAC doesn't rate or endorse or fund candidates. Even Friedman got that wrong. Oy. RT @JuddApatow: Pocahontas is cool?  Nazi’s are good people is cool?  Mexicans are rapists is cool?  Africa is a shithole is cool? Grab em… @moshekasher Sad Thomas Friedman Brilliantly Explains Why Ilhan's Israel Comments Are Fundamentally True @IlhanMN https://t.co/ELRc8PUYMF https://t.co/SA24bgZXkP why isn’t 3 Feet High and Rising on iTunes RT @BklynDefender: BREAKING: We’re suing ICE. Detained immigrants are being forced to challenge their detention and deportation via a video… ⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️ https://t.co/GTD6OZRbvJ @oliviawilde @megynkelly 😭😭😭😭❤️❤️❤️❤️ Which is out on digital TODAY! ❤️❤️❤️@DisneyAnimation @wreckitralph #RalphBreaksTheInternet https://t.co/moi7uEBpbc @pattonoswalt Love you @davidmweissman @IlhanMN Yep Sadly I don’t. I love children very much though. Someday if I do I hope they have a sense of justice and speak truth to power with earnestness and humor. But I’d be happy with  anything. Even a teeny tiny baby you! https://t.co/dwpLxLL8U9 Ps I’m more offended by a president who denies a real threat 97% of scientists beg him to take action on while creating a fake threat out of at-risk brown people at the border https://t.co/moi7uEBpbc It’s true! I am a blue explicit often political comedian and also love doing voices for children. I know it’s easier if people are one thing but no one is, not even you! We all have many sides and I think that’s ok. Peace Ma https://t.co/moi7uEBpbc Vanellope von Schweetz has been granted access to the internet today. #RalphBreakstheInternet is out on Digital today, Chumbos! https://t.co/LeC8j4WOWh @primalpoly I would say heroin more than anything. Also I think the balls touch water piece of the tweet was mmmmuah No shit bc It’s like every other powerful lobby buying influence. It’s fucked &amp; why we gotta REVERSE CITIZENS UNITED &amp; make laws against money in politics — NRA/Big Oil/Big Pharma -massive influence w $$that all hurt peoples.  True-not antisemitic. But always the ones singled out https://t.co/zLEHIvmwSm RT @voxdotcom: Blackface began essentially as a way for white people to signal their superiority over black people to other white people. h… RT @nowthisnews: Trump staffed his golf clubs with undocumented workers — now these women are speaking out about how they were mistreated h… Trump is a bot  omg this makes so much sense you guys Trump’s a bot -Every single thing he says is an insanity-level lie.\n-Don Jr. calling teachers losers is straight heartbreaking. \n-SMH right off https://t.co/SRAoxDyJIX @gtarplyr56 @sebastianbach That’s not true diarrhea face @AdamBaldwin Noo! Adam I know we disagree on tons but there is no way you’re a climate change denier no way not my Adam No point in explaining how mind blowingly stupid this tweet is so I’m just gonna go with FUCK YOU, and also add that you are a smelly penis hole with balls that touch water.  Eat shit, you greedy twat. https://t.co/cqUQtHWtlW Thank you for this, and yes let’s get money out of politics- starting with overturning Citizens United- the most ironic name for the biggest, shittiest threat to our democracy. #intersectionality https://t.co/BwiKsEhusK RT @SarahKSilverman: \"In spite of everything, I still believe that people are really good at heart.\"\nAnne Frank https://t.co/40lgFTgJeJ Thanks, Friend.  Now let’s work together for equality freedom and justice for all. Israel, Yemen, Syria, America everywhere we see it.  People have interest in dividing us. It’s up to us to refuse. ☮️ https://t.co/oB0xoimLg1 RT @RWPUSA: Putin controls the world’s second largest nuclear arsenal and he owns the man who controls the world’s largest nuclear arsenal.… @Rowaida_Abdel I truly don’t think she meant it that way AT ALL, but Im surprised she’s earnestly not aware of the people that will absolutely take it that way.. RT @kylegriffin1: Billionaires flooded Republican coffers just before the tax cuts passed. From the time the tax bill was introduced until… RT @davidfrum: 1108 K Street NW. Maybe you want to buy your lunch there this week. https://t.co/4ctsNij2me RT @MEPFuller: After a week discussing how politicians wearing blackface in the 80s is racist and unacceptable, maybe we can discuss how th… RT @HoustonChron: As Southern Baptist leaders reject reforms, sexual abuse continues to spread. Read part 1 of \"Abuse of Faith,\" our exclus… RT @jzipple: It's true! &amp; still can't believe we solved all but two of the world's problems in just a few hours. Tnx @SarahKSilverman, you… Must watch: @RepJeffries encapsulates this madness clearly. Undeniable:  https://t.co/HYI9Dsjhn8 night guard still in at 2:13pm RT @Misssusannahf: My stomach actually hurts from laughing so hard at this... https://t.co/Cety7KTmFB https://t.co/d8ru51FTkl RT @ElvisMitchell: This Monday I’ll head to Oakland to speak with #ryancoogler 10/9c on @EPIXHD #elvisgoesthere @ElvisGoesThere https://t.c… @clubJAGZ Me I wrote them Father @jzipple and I met and became friends on twitter but Thursday we got to hang out in real life and behold, it was very good. https://t.co/RAQC876Lnb https://t.co/VQ09l368aT @MegynPrice Yay!♥️ THIS IS SO GREAT\nPoliticians make this shit complicated to rope-a-dope us into a submissive apathy.  @AOC makes us understand bc she actually WANTS us to know what fucked up shit is going down. https://t.co/S83CVxv1OP 2things: \n1) You are a malignant narcissist \n2)the comments under your tweet are amazing https://t.co/cpI0EhZuRD RT @TheAVClub: Fuck Jerry doesn't want you to watch a Vic Berger video making fun of them; here's that Vic Berger video https://t.co/e8oqVA… RT @TomDreisbach: The NPR reporting that identified missing donations to charities like St. Baldrick's - the children's cancer research non… RT @BetteMidler: Amen, and allow me to say that out Of the 154 mass shootings recorded on the U.S. in 2018 through 28 June, not one was per… RT @joshgondelman: I don’t think I’m as afraid of anything as every billionaire is apparently afraid of becoming a hundred-millionaire. @LILBTHEBASEDGOD Fucking PHEW @danpfeiffer He’s the fucking worst most rotten of lost souls. He’s what we Jews call “bad for the Jews” if. You. Know. What. I mean. @SopanDeb I won’t even talk to an interviewer who isn’t recording anymore. You’d be fucking crazy to I‘m reading SOTU but I‘m seeing STFU @LILBTHEBASEDGOD What does this mean: THICK? is it good? ❤️🐴 RT @livefromhereapm: \"One thing we all think of when we think of country music is, of course, Judaism.\" \nWe were blessed to hear the sweet… RT @Lawrence: Trump was in favor of undocumented workers before he was against them. https://t.co/7xlE2PUhKe @iamcardib You got this. Just exist.\nYou’ll comeout the other side I promise RT @RAICESTEXAS: The government separated children from their parents for pure political reasons.\n\nThese are kids who have already been tra… @BaruchelNDG ❤️ Fuuuuuuuuuuuuuuuuuuuuu https://t.co/PLpRycnmLA Gap is closed for this one but to all these companies- would be great to donate to countless schools &amp; communities in massive sub zero areas right now. (Refugee camps in Syria too if you’re up to it all!!) can’t bear the thought of people being so very cold. Brooklyn prison? https://t.co/v6gs6iIJHM Great opportunity for @gap @jcrew @colehaan @CanadaGooseInc @WoolrichInc @Moncler @lululemon @eddiebauer  etc! Donate donate donate! ♥️♥️ https://t.co/xCk6TroGES RT @davidmweissman: This is why I will always be grateful that @SarahKSilverman dialogued with me because thanks to her and her followers I… @kthalps Agree! RT @wkamaubell: Whatever you are doing today (or not doing today #ImWithKap) we can all agree on the fact that kids should have winter coat… RT @chrissyteigen: Becoming a parent changes you. And you thought I was extra...🙄 #LoveTheChange #StinkyBootyDuty #PampersPartner @Pampers… PUKE. All I can offer is this: How much Netanyahu represents the hearts and minds of all Israelis = how much Trump represents the hearts and minds of all Americans.  I only ask we condemn the administrations not the people.💔 https://t.co/HfwsiFvxQL @DebraMessing I say this not as a Bernie 2020 person. Don’t know who yet lots of interesting options.  And also I love you, obvs RT @E_Reid35: Yall see what we’re doing today. Support @kaepernick7 today by participating in the #7Challenge and  donate $7 to @yourrights… @DebraMessing Agree Ma but this is from the 80s. Clinton was actively against gay marriage until what- 2004? @THR @boburnham Go Bo!!!!! @libbycwatson “Hello, my name is Mr. Burns, I believe you have a letter for me.\" \"Ok Mr. Burns, what's your first name?\" \n\"I don't know.” I want to know what it is that makes certain people see this and think “I’d love to kill that” https://t.co/nzC1fWw3Qb Ugh I’m so burned about that mother fucking  typo WHY THE APOSTROPHE S BRO WHY @hollywuuud @OfficialJLD Thanks doll. ❤️ It’s makes me sad that the world’s smallest violin is predominantly used for sarcasm RT @MsPackyetti: LESS THAN TWO HOURS, and @BennettCollege is 95% to goal!!!!\n\nI BELIEVE WE CAN HELP PROTECT THIS IMPORTANT COLLEGE FOR BLAC… I watch this beautiful footage and try to imagine how Uday and Qusay Trump see the same and think “ooh I’d love to pay someone to let me kill that majestic creature, cut off his tail and take a big gummy-smile pic w it!” https://t.co/nzC1fWw3Qb RT @DesiJed: @realDonaldTrump Have you apologized for demanding the death penalty for the innocent Central Park Five, dumb bitch? RT @Sia: If there are any motels or hotels in cold or rainy America who would accept a homeless guest tonight, I'll pay, and give you a plu… https://t.co/pp1lSNnxQJ https://t.co/JZ7ATIXiKw RT @livefromhereapm: Thanks to our guests @andrewbird, @jennylewis, @SarahKSilverman, @LauraJSilverman, @ciroccotweets and @NickelCreek for… @hollywuuud @OfficialJLD I think caring for a friend who did bad things is different than defending those bad things. I hope no one you love ever fucks up. And I hope if they do, your other friends don’t blame you for his or her offenses. Peace bro RT @seancwatkins: Folks, tune into your local @NPR or public radio station later today and listen to this week’s @livefromhereapm with gues… RT @HShahana: I am outside of the Metropolitan Detention Center where prisoners are without heat. The banging noise is them protesting for… RT @GlennThrush: To all Republicans tweeting about Northam and how Dems are racists/hypocrites — please include retweets of your calls for… RT @GeraldFSeib: It was 17 years ago this week that our friend and WSJ collegue Daniel Pearl was killed by terrorists in Pakistan. That is… @johnwhaskell @_rajdesai @scottsonne I MISS US!!!! RT @livefromhereapm: Tune in to public radio starting Saturday at 6 pm ET to hear our show with @andrewbird, @jennylewis, @sarahksilverman… @TinaDesireeBerg Oy. I took the tweet I responded to at face value and as accurate argh! Aaand the bit:\nhttps://t.co/OvWdTjtM77\n#Cory2020 @CoryBooker Yo yo you heard it there first (R.I.P. @ilyamerica).  https://t.co/uPvydekXoa #Cory2020 RT @ES_Entrepreneur: This is shocking @AmnestyUK. Look forward to hearing your response ✌🏻 https://t.co/EZRwJJrwwH RT @PPact: A right without access isn't a right at all. \n\n\"If the court doesn’t follow decades of its own precedents on the constitutional… ⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️ https://t.co/oYLyRtY43K RT @CoryBooker: I’m running for president. Join me on this journey. https://t.co/fEDqOVIfwh https://t.co/h1FTPUYRzo MAÑANA! https://t.co/bIIiEQshif I got @BethStelling for the win!!! ❤️❤️❤️brilliant hilarious and pure love to the core https://t.co/CkhdQYfFoM When 20,000 American Nazis rallied in New York City https://t.co/jJEahGwD2x RT @HJBenjamin: I wonder if he knows the poem from which this phrase plays on was an argument against walls https://t.co/V60ff8X2w8 RT @MotherJones: Mitch McConnell just admitted that Republicans lose when more people vote 🤦‍♀️ https://t.co/LM4FbSApBD https://t.co/VHgyBN… RT @guardian: Children and babies die as temperatures plummet in Syria https://t.co/BFlTq9jxw1 RT @JuddApatow: Republicans don’t believe in democracy.  They don’t want everyone to vote.  It’s that simple.  They need to be able to mani… @paulapoundstone @rogrtheshrubber ...is the premise for this new joke @paulapoundstone Nope! ♥️♥️♥️ I’d cut the last line but other than that perfect tweet https://t.co/ezKAVdDA8g @FBillMcMorris Haha it’s too late. Gosh I hate making those mistakes — it makes my mother roll over in her grave for sure (though, full disclosure she was cremated). @KeithLansdale @CantankerousVet OR- not against them, but for them. ♥️ @chimychanga Apology accepted but not necessary!! I’ll save it and pay it forward ❤️ You’re the embodiment of extreme, almost impossible ignorance, combined with projectile-vomit inducing arrogance.  But mostly you’re just the dumbest, shittiest person on earth.  And that’s also science. https://t.co/AFp8LuuXja RT @keithboykin: For the last time, a 70% top marginal tax rate is not a \"far-left idea.\" It was the longstanding American tradition until… @FBillMcMorris CRAP! @chimychanga @revmattjohnson That’s not true I love Jesus and his teachings and have some friends that are priests. Bringing comedy to it or pointing out the hypocrisy in people who use Christianity as a shroud for hatred is not “unsupportive” IMOIMOIMO Religious climate deniers laughing at the extreme cold weather: you are the people who laughed at Noah for building an arc Looked into y’all bc I’m looking to invest, but John Boehner’s a part of this company. How do U work w/ a dood who makes 💰 from the very thing brown people R still serving time 4 under laws he helped pushed through? SORRY ABOUT YOUR FOOTBALL AD https://t.co/mzgcqPIvHS RT @BarbraStreisand: In the United States, a recent survey showed 66% of millennials did not know what Auschwitz was. Hatred grows in the d… RT @INARAorg: We're hosting an incredible all-star comedy fundraiser in Los Angeles on March 1 along with @WarChildUSA. The star-studded li… You don’t need a relationship if you just start calling your dog Babe all the time RT @Bez: @realDonaldTrump what’s the Bible say about fucking porn stars right after your 3rd wife just had a baby choked up sobbing #RentLIVE good grief RT @Shakeenz: Everyone tweeting about #RENTlive tonight take an #AZTbreak to tweet out #BreakThePatent and get some trending attention on t… RT @RheaButcher: It’s Holocaust Remembrance Day and people with legal asylum in this country are being pulled off buses and asked for “pape… @kumailn @IssaRae NONE of us can! #Syria #Yemen #Sudan https://t.co/sAMW8t9sui @chrissyteigen No! Rebook, go to fancy hotel. Take bath. Thank you for this ☮️ https://t.co/sAMW8t9sui RT @AOC: To protect justice, #WeRemember the lessons that apply today &amp; always ⬇️ https://t.co/KgoknC4lon RT @TheKingCenter: \"Neutrality helps the oppressor, never the victim. Silence encourages the tormentor, never the tormented.\" \n~Elie Wiesel… RT @HRC: This #HolocaustMemorialDay, @HRC honors the more than six million Jews &amp; victims, including #LGBTQ people, whose lives were viciou… RT @ScottHech: HAPPENING NOW: Trump still separating families. Juliet is 15. Months. Old. Separated from her dad on December 28 &amp; detained… RT @StevenTDennis: 1. Democrats offered every day to open the government with a CR for 35 days. Trump said no.\n2. On Day 35, Trump said OK.… RT @thehill: #BREAKING: Trump admin has been illegally holding migrant children in unlicensed facilities, attorney says https://t.co/NDQFsg… Yes https://t.co/UhK0CX8TYK RT @UberFacts: The Constitution of Texas prohibits anyone from holding public office unless they believe in a \"Supreme Being.\" RT @samswey: This is the stage of fascism where the government jails the people who try to help the people it’s putting in concentration ca… RT @RabbaSusan: First in a series https://t.co/llpRTZbkkz RT @ComedyCentral: Hang on tight: #BroadCity returns tonight at 10/9c.\nhttps://t.co/HVOc8dlqNz The whole 25 min version is amazing but here’s a taste https://t.co/PpanRrHEXp 😭😭😭😭😭 https://t.co/p6N2MOokih RT @wmag: Watch @SarahKSilverman give ASMR a try: https://t.co/u0vhDpnuen Oh shit it’s so true that dood would have been remembered as the NYC Mayor that led us out of the broken horror of 9/11 &amp; went on SNL &amp; gave us permission to laugh again w that brilliant “why start now” joke but this time Rudy is right, he’ll be remembered for the lies https://t.co/LvVsQCrHae RT @ScottHech: And she’s right. Risk assessments—claiming to be able to predict future dangerousness for pretrial detention &amp; parole decisi… @GarySpedding @Esor_Fasa Huh I don’t know that site or what agenda or narrative or point of view it serves I just  thought what he said was  super interesting. Did you watch it or just see the headline? Huh. Eh I’m gonna disappoint sometimes kid I can’t bat 1000 RT @SethRudetsky: Me + \nSarah Silverman (!) + \nSan Francisco\n=\nMay 19th at the Herbst!\nTix 👉 https://t.co/yg4oY2hsdw https://t.co/j5wl2Hzned RT @Yair_Rosenberg: The campaign to keep Jews out of Ocean County, NJ, would like you to know that they are NOT anti-Semitic. They would al… RT @Yair_Rosenberg: Supporter of campaign to keep Jews out of Ocean County NJ: \"Luckily they are white so we can make an example of what th… RT @CoryBooker: It's been 9 years since the Supreme Court handed down its disastrous 5-4 #CitizensUnited ruling. Since then, countless corp… RT @vicenews: “I especially don't like that we get singled out unfairly by somebody who didn't himself serve in the military.\"\n\nThis is how… RT @SchmahlNaomi: @womensmarch @CarlyPildis @TaliGoldsheft @pplswar I would like to send some love and light out to @evvieharmon @vanessawr… @GenesisBe ? Did you watch the vid or read the headline only? @DaveImbSays Of course not! That’s not what he is saying! Heartbroken by this knee jerk reaction from a DSAer 1) Are you fucking kidding me?! 2) what other horrible thing is this news a decoy for at the expense of our heroes - \nour trans military are heroes like the rest -- more so —because they have to deal with this shit from people whose lives &amp; way of life they are protecting. https://t.co/RxlJV3LvCM https://t.co/9qJkw0cApp Yes I know I say vagina a lot but what am I supposed to do , not talk about vaginas I’m not superhuman https://t.co/qMKb5lADBe My vagina has off-beat good looks. I have a handsome vagina @timcarvell @Doug_Tilley I never remember anything but I know exactly what you’re talking about I just start kissing them. It’s like a magnet. Just kiss. I don’t even wait. When you’re a star, they let you do it. You can do anything. Grab ’em by the pussy. You can do anything. https://t.co/cS9RlvoRK0 @robdelaney Friend, are you shitting? OR, if there were background checks, James Earl Ray, who was a convicted felon, wouldn’t have been able to buy that Remington Model 760 Gamemaster .30-06-caliber rifle &amp; a box of 20 cartridges from the Aeromarine Supply Company on March 30, 1968 https://t.co/mYXZMrhKvv Colossal idiot or pure evil? https://t.co/mS7Wc7InzR RT @ScottHech: On this MLK Day eve, I want you all to see this &amp; know this as well as the “I Have A Dream” speech. Speechless at his wisdom… @EricMcCormack @netflix Ooh I heard it’s great @MJMcKean Ooh looks like I need to! Just started Patriot but  it’s on the list! @IvanBrandon Ooh ya I heard that RT @DemAwakening: It’s been 9 years since the Supreme Court opened the floodgates for unlimited corporate money to pour into our politics a… @jonahray THE BEST HANDS DOWN. Game changer I just finished Bodyguard and I Killing Eve. What next that genre’s my jam wow the anti-choice rally turned out to be a real sausage fest https://t.co/ASN5iB0EKd RT @natasharothwell: Children are DYING at our borders and being denied refuge which is tantamount to death sentence and you talmbout #Marc… 💔 https://t.co/D140wnzcsa Wow this thread⬇️⬇️❤️❤️ https://t.co/R7031VNYQi @KumquatSue @PercySodor @TamikaDMallory Because it’s true I’ve seen it RT @ElaheIzadi: Indian Country Today has details on the elder in that viral video.\n\nHis name is Nathan Phillips, a Vietnam veteran who hold… RT @AdamSerwer: White kids in MAGA hats jeering a Native American Vietnam veteran. This era is just a series of extremely heavy-handed meta… RT @EllenPage: Mike Pence is cruel and responsible for enormous pain and suffering in the LGBTQ+ community. From his days as governor of In… RT @strongblacklead: Trust me...There are plenty more quotables where this came from. 😂\n\nTrigger Warning with @KillerMike is now streaming… Psst @TamikaDMallory I know you’re busy but will you peep this tomorrow?❤️\nhttps://t.co/nlTb3ZVGJ1 My pop on his 80th #intersectionality https://t.co/yILjglOzcX Jews fight for justice not just us #intersectionality #womensmarch https://t.co/AudaR9hZ7i Not one person said that. Everything you do screams Me me me me me me me me. You are a human existential crisis https://t.co/ithYSHCXsW RT @NazitaLajevardi: Jewish women doing it up right here at the @womensmarch. This is beautiful. #WomensMarch2019  #IMarchFor #AmericanDrea… RT @paulinepark: \"The #Jewish Contingent is here! #womenswavenyc\"~Rebecca Vilkomerson (@RVilkomerson) #WomensMarch2019 https://t.co/X5BwdGG… RT @womensmarch: Jewish women of color represent! #JWOCmarching #WomensWave\n\n 📸 @KishaBari https://t.co/ipFs79J8hX @KenidraRWoods_ Wheeeee!! 🤞🏽 @BlaccToney @TamikaDMallory @LouisFarrakhan Hi I’m jewish. Meet me. Hello. I’m a person. Not a termite. And I care about you. @rolandsmartin @TamikaDMallory It’s a lil “all lives matter” @tlmundy2 @ross_tasharee @Mysonne @angelayee @TamikaDMallory @TheView @MeghanMcCain Thank you. Scary times. Looking for intersectionality ♥️ RT @tlmundy2: @ross_tasharee @Mysonne @angelayee @TamikaDMallory @TheView @MeghanMcCain It may not be a malicious intent but c’mon, we as B… @KenidraRWoods_ Argh I wish I saw this sooner!! How did it go?? Beautician and the Beast Practical Magic Ishtar 👍🏼👍🏼👍🏼 https://t.co/IgIeKwPnVp @NickAmadeus Oh my goodness that was wildly unpleasant. RT @GiffordsCourage: A message from Captain Mark Kelly 👇\n\nTell your representative that 97% of Americans support background checks on every… RT @SenSanders: Saudi Arabia's crown prince, Mohammed bin Salman, has been hailed as a progressive reformer. But his track record of impris… RT @Alyssa_Milano: Wow, @RudyGiuliani. What happened to you? I’m old enough to remember a time when you were praised for your leadership in… RT @HRC: Must watch: Senator @CoryBooker questioned Attorney General nominee William Barr about a 1995 article he wrote condemning LGBTQ-in… Enjoy some Conservative Pundit Love via this sketch w brilliant @MintMilana @Lawrence &amp; written by amazing @nickwiger https://t.co/3fY0KfA3ik RIP @ilyamerica RT @Kaepernick7: Happy Birthday to The People’s Champ! #MuhammadAli https://t.co/B5vX1yOtP1 RT @KenidraRWoods_: Today I went around the store asking people did they want a hug because it's always good to #BeKind. Everyone needs a h… RT @BarackObama: I knew it way back then and I’m absolutely convinced of it today — you’re one of a kind, @MichelleObama. Happy Birthday! h… AOC is RAD https://t.co/K4Wx5KNx3T RT @JordanUhl: Cardi B just posted this on Instagram #CardiB2020 https://t.co/zg4prRUfdG RT @EdgeofSports: Striking teachers and supporters in LA. Good gracious. (Ht @haymarketbooks) https://t.co/OBQCznIyic RT @kaysarahsera: The Uses of Sorrow\nby Mary Oliver\n\n(In my sleep I dreamed this poem)\n\nSomeone I loved once gave me\na box full of darkness… RT @ava: “It doesn’t have to be blue iris, it can be weeds in a vacant lot. \n\nJust pay attention, then patch a few words together and don’t… RT @rachsyme: RIP Mary Oliver, your words will live on https://t.co/WEZ3KtLvoq @KateQFunny @HollywoodImprov Ha! @DerrenBrown @hulu ❤️❤️ RT @DerrenBrown: So sad to hear that @SarahKSilverman’s magnificent #ILYAmerica has had to end its run on @Hulu. Please Baby J let it re-ap… Whoa yay! And @LauraJSilverman too! Wheee!!! https://t.co/bIIiEQshif 💔💔Here’s a Gofundme for William to help his fam with planning https://t.co/9cFNPKqXJp. ❤️❤️❤️ https://t.co/ziTHQuclSK RT @EstherSolomon: I wrote about the curious, painful and depressing similarities between the anti-Semitism crises in the UK Labour Party a… Yes!!!! https://t.co/IH4WJZXmnK I cannot imagine having such mild feelings over such a furious hatred of an entire people. He calls us termites.  I’m heartbroken but im gonna stay hopeful because I don’t wanna give up on Tamika. (oh wow I s that how SHE feels about LF?)\nOh this life... https://t.co/GCpOYZdgLT Pube corners? No? Just to get that perfect 🔻 Good grief you really are right on brand \n(whoa I’M right on brand with this comment! And plus I’m high!) https://t.co/MyzGYk9e03 Allies are my heroes- love this. Also, I use gillette to shave my corners! Thanks Gillette! (Y) https://t.co/5Q3jCKmVUy William Stephenson died today. Once 4 my bday he gave me a hallmark card made 4 a daughter or something -inside it said  “I love” &amp; then he crossed out the rest &amp;added “your tits.”  I loved him so much.  https://t.co/ov1w388NoO https://t.co/GO5A2h498N I do but I’ll take it https://t.co/pXAKhkPOUv An Oscar to whoever makes those University of Phoenix commercials @popyculty @JoneliaSaunders “Fun” was 2 make it like a fashion reference. They wanted a Bird Box bit &amp; I did the best I could! I’ve lost so many friends.  But I’m a comedian making a joke about the conceit of a horror movie for a horror award using gallows humor. good grief Doll RT @RancherBravado: @floodmagazine @SarahKSilverman I started watching the most recent set of episodes last night, and it remains maybe the… @JoneliaSaunders Its a reference to the movie bird box where people blindfold themselves bc if they don’t they see their biggest fear and it makes them kill themselves. It was a reference to the movie bc I was presenting best horror ♥️♥️ RT @floodmagazine: .@SarahKSilverman's now-cancelled Hulu show was like a tender, sympathetic antidote to the fast fury of Fox News. | http… RT @WhitfordBradley: A compromised Russian asset in the Oval Office is an emergency. When they’re white it’s just horseplay https://t.co/h6TePLrL81 @lucyprebblish PREBS!!! I didn’t go to college but I might start telling people I went to Kal Penn\n@kalpenn Fuuuck it’s so late.  \nHey Britain RT @SenBooker: The #TrumpShutdown is now officially the longest government shutdown in US history. The longer this continues, the more Amer… @TaranaBurke @Michael56506739 NEVER This is why Trump needs the shut down and the wall diversion https://t.co/kbpmJL8S3o RT @dodo: Gunnar the bulldog was an only child – but when his human brothers were born, he knew how to take care of them 💗👶 https://t.co/bU… RT @TaranaBurke: Last week was a lot. I had to take a step back and regroup. The support and awareness post-RK doc has been amazing. But th… @SadellaWallis UNBELIEVABLE. Wowowowowow CC: @nytimes @FoxNews @cnn @msnbc @wsj @washingtonpost        https://t.co/b1qHsq3sw5 RT @wreckitralph: In this place called #SlaughterRace... Join #Vanellope in the full video for \n\"A Place Called Slaughter Race\" from #Ralph… RT @PeterHamby: Rep. Rashida Tlaib cursing got 5 times more coverage on cable news than Rep. Steve King embracing white supremacy https://t… RT @nowthisnews: ‘Is this how you make America great again?’ — Sen. Jon Tester held nothing back in his impassioned speech against Trump’s… This looks amazing https://t.co/N1M1PBnnqo RT @AOC: New party, who dis? https://t.co/2cznisv8tB RT @mansoortshams: Next time you feel anti-immigrant, anti-this or that, please take a look at this picture. Its a small glimpse of who pro… @BenRothenberg Allies are hot *also the US President is a  Nationalist. https://t.co/EJSujv7Hcf ❤️you’re reason ♥️ https://t.co/EEzZB0tLmK It is. It’s a global emergency. You’re refusal to believe all scientists is astounding.\nYou are a hockey puck. https://t.co/8u7NRecIkf RT @MMexville: I'm Listen to a Cherokee legend that says that we have two wolves in our interior one that represents the negative and anoth… You made all my musical theater dreams come true: https://t.co/bynoxy6erd https://t.co/V1xtBlbWVF @TymberleeHill ♥️ I mean seriously https://t.co/nI2jWfQdxJ @pappy_harriets ♥️Mamas! @SimardJennifer Ya but my Bernadette Peters impression is shit ❤️ thanks my friend @SaraBareilles ♥️♥️😭😭 RT @nowthisnews: This new gun reform bill will make sure that every firearm sale comes with a background check. Sen. @ChrisMurphyCT is conf… @Spenny @JoshDeHonney Thurs @LilaGraceRose I believe that life begins at 40 @wyattcenac Ps hey are you in the baby-talk Russian punk band, Pussy Wyatt? \n\n(Look I can’t  help myself and this is my downfall) @wyattcenac That’s my Pop! ♥️ thanks W RT @wyattcenac: @SarahKSilverman Thanks for making a wonderful show. Funny, thought provoking and curious in a moment when it sometimes fee… RT @_AlexHirsch: What the fresh hell. This is REAL. Filmed in 1958- about a conman who grifts a small town of suckers into building a wall.… @rodneyrothman RODNEY!!!! It’s, “everyone’s welcome to POOP in me “ sorry to correct you Jocelyn but you have to learn. This silliness written by @johnwhaskell &amp; @kyledunnigan who really wanted the fake RIP dedication at the end to last a solid minute https://t.co/eIcK6aTpM5 @chelywright @netflix @PrimeVideo @ilyamerica ♥️♥️ ❤️❤️it’s true https://t.co/vghMw1IIHX @johnwhaskell Love you you crazy galoot I cherish you Lebow https://t.co/4uSQkgILse RT @MikeDrucker: This is such a bummer. Such a great show with so many good, jealousy-inducing bits https://t.co/R1OHNoD4uV @MikeDrucker ♥️♥️ @TimKalpakis Oh noooooo May the lord open https://t.co/8Z4Uv0kVYB You are amazing. Every single tweet you write projects your personal  character and crimes onto others. Your twitter feed is a massive confession it’s stunning. Ps snort more adderall it’s not off putting at all https://t.co/csloFP2Iia Hahaha Yassir perfectly answers the question: How do I retweet this crazy cute dog vid while still keeping my badass comedy cred? https://t.co/mi1RwNuG8W RT @kim: It’s dreadful that we’ve lost @ilyamerica. Hulu doesn’t deserve you, @SarahKSilverman, but America does! 🧡 Aw- here ‘tis https://t.co/CeGuUqy57S https://t.co/SKcWGuqmg1 Thank y’all so much for the love I’m aware this is starting to be pretty obnoxious but I might keep RTing a lil more loves @JEllisP @kenolin1 YAAAAAASSSS ❤️ https://t.co/eGrWGLHSQQ Thanks Ma ♥️ https://t.co/PEjNlPOedZ RT @HamillHimself: @SarahKSilverman Fingers crossed someone else picks it up. \nOne of the best shows in years!\n#EverythingILoveGetsCancelle… @wkamaubell ♥️WKB this is an objective, unbiased tweet.  thanks Sissy I love you mtmec https://t.co/72gfOqms2A @trumpetcake TED😭😭❤️❤️ RT @OsheaJacksonJr: Heartbroken is the right word. This is some whack shit @hulu. https://t.co/8NlId94cll RT @ChrisMartinezTV: This is a loss! Congrats to @SarahKSilverman on a smart, funny and very insightful program that should have seen a muc… @JessicaShaw ♥️♥️♥️♥️♥️💔😭 RT @JessicaShaw: @SarahKSilverman You are a goddess and I hope you are proud of everything you did on the show. We were lucky to have this… @AllanaHarkin ❤️❤️❤️ Ha D. I meant D and see I typed G. @evanrosskatz You KNOW that’s my fave! Matzoball for me tho Miss you guys- at least we’ll have a fun reunion Feb 17! ❤️ https://t.co/8xpTNVMF5I Love you so, G. Was the only job I had where I woke up before my alarm everyday https://t.co/e8Qofxdb7v @jeneuston You are the loveliest for reals Aww, can’t wait, Kitten! https://t.co/tDK1gPFHPR @SamRichardson “I Love You, Detroiters” ???? @bejohnce ❤️💔😭 RT @bejohnce: @SarahKSilverman the first episode made me weep @Lawrence ♥️♥️♥️ RT @Lawrence: @SarahKSilverman I miss the show already! Loved it. @DougHeye ❤️ RT @DougHeye: Sad news. \"I Love You America\" is exactly what we need more of. Keep on keeping on as a sultry force of good, Sarah. On your… Thank you my Princess https://t.co/zo1hd1WVlj RT @morgan_murphy: @SarahKSilverman this makes me mad and sad. you made a great show with a real purpose.   🙏❤️ RT @whatrosasaid: @SarahKSilverman Favorite memory: getting to watch you and @CarlReiner make magic. It was a dream. Thank you for everythi… RT @floodmagazine: We love you @SarahKSilverman, and will miss the quiet empathy of @ilyamerica bitterly. ✍ by @anyajaremko.\nhttps://t.co/X… RT @cinemascopian: @SarahKSilverman Hi Sarah. We don't have Hulu in Israel but we drank up every drop you shared on YouTube from the show a… RT @MaeMucho: @SarahKSilverman Your show gave me hope and made me laugh— and was exactly what Americans needed to remember how to respectfu… @JuddApatow @JimmyKimmelLive does this all the time it’s brilliant RT @messyroth: I AM SO PISSED THIS SHOW WAS SO IMPORTANT https://t.co/dVGT2M0I9d RT @kramerkram: A lot of shows say their version of late night is \"different\", but ILYA actually was. Hope it lands somewhere else! https:/… RT @AaronFlux: Hulu canceled @SarahKSilverman's I Love You America today and I'm bummed out. The goal of the show, to find a common ground… @DonCheadle ♥️♥️ RT @Thezog: @SarahKSilverman That is a true bummer. One of the best things to come out of the last 2 years. Plus, where's @johnwhaskell goi… @lizzwinstead @hulu @ilyamerica ♥️♥️♥️ RT @lizzwinstead: Hey @hulu- @SarahKSilverman 's @ilyamerica showed us humanity and humor like nothing else in our broadcast sphere. Americ… @billprady ♥️ RT @billprady: You need to understand that @SarahKSilverman's \"I Love You America\" was more than a comedy show. It was a conscious effort t… RT @almightydanish: Dear @hulu - cancelling @SarahKSilverman ‘s I Love You, America will make me never want 3 Ply again. #ILYAmerica - seri… RT @trelizabeth: @SarahKSilverman Damn. Your work on I Love You America was brilliant. I’m going to go drown my sorrows by watching the Hal… RT @johniadarola: Really sad to see \"I Love You, America\" canceled - @sarahksilverman did a great job https://t.co/vvXIU7d6F8 via @thedaily… RT @THR: Hulu Cancels 'I Love You, America With Sarah Silverman’ https://t.co/DkRe4r2myw https://t.co/d3BIIROj0j RT @DanPasternack: Dear @hulu, you cancel @SarahKSilverman and @ilyamerica, I cancel YOU-lu. https://t.co/32vey8eyCZ RT @TopherGrace: NOOOOOOOOOOOOOOO!!! This is one of the best shows out there. This isn't right. https://t.co/fdArnbsWri RT @Mike_Eagle: @SarahKSilverman on top of everything else I really appreciate you hiring people that usually dont get those opportunities.… RT @MintMilana: Feed me your tears, Silverman! https://t.co/QCxEEh3oP6 RT @awintory: This is cute; Sarah Silverman recording Alan Menken's new song for RALPH BREAKS THE INTERNET at Fox.  I so love that this all… RT @kpfallon: Oh, this is sad news! https://t.co/lC992xFaJG RT @robinmarty: @SarahKSilverman Booo hiss. Your day with Survivors of the Abortion Holocaust was one of my top tv moments. RT @kateberlant: @SarahKSilverman Truly a bad move from HU-the HELL do you think you are- LU. We needed and continue to need your show 💜♥️💜… @ParkerMolloy Haha you remember! RT @DaveWeasel: @SarahKSilverman I’m gonna study the verbiage of any successful petition that helped get a show back and start one if nobod… Ha yes that came out of brilliant @nickwiger ‘s brain https://t.co/NHGaBkb1Ic RT @MikeRoyce: @SarahKSilverman Sarah I loved ILYA and this sucks. America needed this show! America never listens to me. Looking forward t… @CarolineRhea Omg Caroline I look at your avatar w you swimming with your perfect dry hair and think about your bit with the women swimming and talking about Talbot’s ❤️ @nickwiger Nick you’re the best and put so many smart and funny words in my mouth hole #hallofpresidents #conservativepundit RT @thor_benson: I really hope @SarahKSilverman gets another show elsewhere. So many women have been refused a place or pushed out in the \"… RT @gavinpurcell: This is such a fucking bummer but I’m so proud of what we made and our team. Mad love to @SarahKSilverman &amp; @amyzvi for b… RT @guybranum: @SarahKSilverman This is bullshit, it was the smartest approach to political comedy we had. RT @kpfallon: In a late-night landscape that is often cynical, snarky, or (rightfully) angry, I found @SarahKSilverman's point of view insp… RT @thor_benson: What?? I loved this show. Big mistake, @hulu. Best of luck, @SarahKSilverman.\nhttps://t.co/sbjfxM4j41 via @thedailybeast RT @RandyRainbow: @SarahKSilverman Nooo!! This show was so special and perfect and important and getting even better by the second. I’m not… RT @mattwilstein: I'm personally a big fan of @SarahKSilverman but more importantly her show @ilyamerica was bringing something truly origi… RT @mattwilstein: JUST IN: @SarahKSilverman's @hulu show @ilyamerica has been pulled after just 21 episodes. It's the 3rd female-fronted \"l… RT @ikebarinholtz: @SarahKSilverman BOOOOOOOOOOOOOOOOOOOO god bless you for making this wonderful program RT @LibyaLiberty: This was a program America needed. Right. Now. \nWhat a loss, and what a shame. Thank you Sarah for you and your team’s ha… RT @EllenPage: No no plz no no. \n@hulu https://t.co/SYTOPM1vp2 RT @davonmagwood: HOW!\n\n@netflix do your thing! https://t.co/wGZvtmLG0d RT @MJMcKean: @SarahKSilverman Fucking outrage. RT @ScottNevins: @SarahKSilverman Wow. @hulu really got it wrong by canceling @SarahKSilverman #ILoveYouAmerica. They finally had an import… RT @Styla73: Tig Notaro was on the latest I Love You America and she was predictably brilliant. RT @kirstenolean: If you can't sleep, at least there is I Love You America with @SarahKSilverman. Brilliant, hilarious, important. RT @dylanguerra22: I Love You, America with @SarahKSilverman is one of the most brilliant things on tv. Political, hilarious, thought provo… RT @GDiLauro111: @SarahKSilverman I Love You America is Brilliant and Hilarious. Thank you for making this. RT @RamzeeRawkz: Absolutely recommend Sarah Silverman’s ‘I Love You, America’. It’s outrageously hilarious as well as being heartwarmingly… RT @_fascinoma_: Everyone should watch @SarahKSilverman's show I Love You America. It's the beautiful, hilarious open-minded show America n… RT @DJKirkbride: I wish there was some scenario in which people who don’t already agree wth her would watch Sarah Silverman’s I LOVE YOU, A… RT @DCFOLLIES: I know I'm super late to this dance, but I just started watching I love you, America with @SarahKSilverman and its hilarious… RT @SamRussellComic: @BigRichFilms Sarah Silverman does a fantastic show called “I love you America”, talking about very difficult issue an… Well, Hulu cancelled I LOVE YOU AMERICA and we’re all pretty damn heartbroken. \n\n... So in traditional twitter funeral style, I’ll be RTing the love. @LilaGraceRose Oh doll we disagree on when life begins. I don’t see fetuses as “babies” or “children” yet. I just don’t. Not gonna try to change your mind. But this is how I feel. I care about human life outside the womb far more. We are different, you and I. Is the  #TrumpAddress still on? I’m having a puff &amp; watching @BumpingMics on @netflix its so goddamn funny &amp; wrong &amp; beautiful &amp; secretly filled with love RT @thedailybeast: Fox News' Shep Smith fact-checks the #TrumpAddress: “Statistics show that there is less violent crime by the undocumente… I’m not watching how’s the stunted reading and nose breathing RT @RepJoeKennedy: An Administration that took kids hostage to convince their parents to abandon asylum claims has now taken the American g… RT @AOC: The President defended Neo-Nazis who murdered a woman in Charlottesville.\n\nThe Dept of Justice sued him for not renting to Black t… RT @ScottHech: I have an idea. Instead of airing Trump’s lies tonight demonizing asylum seekers to justify hurting more people, perhaps 1 n… We have border security. This wall is a diversion &amp; if ur buying it ur a dum dum. CLIMATE CHANGE is a national emergency. Healthcare and education 4 the rich only, is a national emergency. CHILDREN IN CAGES AT THE BORDER is a national emergency. Stay dumb- that’s how they want u RT @shaunking: A huge deal. https://t.co/NcHmn7hjaS @illTechnica Ew how much? Like a tablespoon? Can I put it in juice? This category consists of all people who are coming from *countries* who have had a terrorist. To put in perspective, *we* are from a country that has terrorists https://t.co/ACw2KkRJXy I’m sure all Americans would agree that one child ripped from their parents arms for the crime of seeking asylum from mortal danger is one child too many. (And yet a handful of people are getting rich on these cages and detention centers) Ps you’re gross. https://t.co/HiPqh6Fyk4 Forgive me but you’re a goddamn liar and I don’t like liars. https://t.co/K1SNqcOw17 I am so naked and so bloated and sprawled on my cool sheets after a hot bath.  All in all it’s good Either, Facing History And Ourselves, or maybe keep it light, like, The Bell Jar https://t.co/GdgjSloCzX Thank u Chris Wallace 4 caring about what is TRUE. Per state dept, no terrorists cross at border (those ppl r running FROM terror&amp; r asking 4our help)The dangerous ppl were stopped at AIRPORTS, where, coincidentally, we have a current LACK of security bc of Govt #shutdown https://t.co/PgcF1EuLM5 ♥️♥️♥️♥️♥️♥️♥️ https://t.co/YwnEnS7pik And yet they will, every one of them, air Drumpf’s blatant propaganda tomorrow. They want ratings AND integrity and you can’t have both. Not in this case. Nope. https://t.co/ZJhK6PApzM RT @RAICESTEXAS: OUT TODAY: Our video on LGBTQ+ migrants who made a hellish trek to seek asylum.\n\nThey were refused food, transport, servic… RT @realphilhendrie: Trump declaring any kind of an emergency around a completely INVENTED border “crisis” just so he can step around Congr… RT @jonfavs: Except they didn’t give Obama time in 2014 because they believed his speech about immigration would be “overtly partisan.” So… RT @JuddLegum: Any network that airs this live is knowingly participating in a  disinformation campaign https://t.co/PXUyOopcF7 @Tess_Holliday @InStyle You know I loved it RT @JewdyGold: She didn't lie. She didn't disparage a Gold Star family. She didn't denigrate a war hero. She hasn't called Neo-nazis 'very… RT @ScottHech: @amyriscool @ItsBennyBlanco @Miguel @CalvinHarris @BklynDefender @RAICESTEXAS @verainstitute @shaunking @Alyssa_Milano @Sara… RT @ScottHech: This is Nilda &amp; her 2-year-old. Forcibly separated in Texas. Nilda was held in 5 detention centers over 2 months. Told: “Thi… RT @BklynDefender: We are honored to have played a small part in this story. These artists are committed to bearing witness &amp; to making rea… @JeffBryanDavis Yes.on a ladder. RT @mulaney: I love @RonFunches. I really love him. He’s hilarious and we both were “I Love Lucy” enthusiasts as children. His special is a… RT @KenTremendous: TRUMP: Bomb the fuck out of them and grab them by the pussy and knock the shit out of them and he's a pussy and it's bul… RT @Braunger: There’s a concentration camp full of kids guilty of nothing and two have died. Decorum?? FUCK that motherfucker. RT @israhirsi: for the past few major things on the campaign trail(convention, primary, general), i’ve made small little videos thru my len… RT @ambermruffin: ❤️🧡💛💚💙💜🖤 \nYou may hear otherwise today but, I just want you to know, Black women and Black LGBTQ community, You are loved… RT @AOC: I hear the GOP thinks women dancing are scandalous.\n\nWait till they find out Congresswomen dance too! 💃🏽\n\nHave a great weekend eve… @Ayeee_Brandon Yessss! The 1966 Batman movie is the greatest, all time https://t.co/RWdSJHr7zx I mean it. Of all the years of Oscar, this one is perfect for Triumph #topoopon https://t.co/QYm0Z3FcYf Be honest for once:  ARE you somehow writing your tweets using Google Translate https://t.co/8fKFA7ZN3T ⬇️winner https://t.co/8QXJHq3JMz I would figuratively die to see @TriumphICDHQ host the Oscars RT @TheRoot: Unfortunately #JazmineBarnes' fatal shooting was not the first time a black family was accosted by an unidentified white male… @atrupar @owillis @nytpolitics Good RT @nowthisnews: Flashback to when Ruth Bader Ginsburg blasted the double standard for working mothers https://t.co/7FQckBwllU @NoStarsHere Well I’m writing on a legal pad not a laptop so that should be a clue!♥️ @MrPaulBae Me too!! Calling a lyft or Uber is always a crap shoot. I switched to lyft bc they tend to wear less perfume overall @AndyKindler I hate it. I’d rather smell a body than a perfume. And also perfume isn’t a shower. RT @splinter_news: Anti-Semitic Ohio doctor fired for tweets including threats to give Jews 'the wrong meds' https://t.co/JofecbIEGl https:… So cute whatdoyou feed em? https://t.co/2Gx8IJ94j3 ⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️\nhttps://t.co/m3Pzx7PxOf 1 single spray in the air then walk through It.  Any more than that is way too much - no one likes strong cologne. A person should have to have their nose practically touching your neck to smell it.\nI’ve never been more passionate or more sure of anything https://t.co/NUTaIsflzy Thread https://t.co/0U2JW8sknF Ooh for sure one that did not get on air.  Unless it was an update joke. I got those on sometimes... https://t.co/IDcX1MU30N RT @keithboykin: Who’s gonna pay for the wall?\n\nMexico!\n\nhttps://t.co/nY9FWdoFuH Joy https://t.co/darHucT5yI @cozyxdame Doll- you put words to truths that are new to people. That is so important. SO valuable. And generous. @cozyxdame You are loved and you are NEEDED!! RT @cozyxdame: Normalize apologizing to children. CC: @DoloresHuerta ♥️♥️♥️♥️♥️ https://t.co/AeRsfgy2KT @IlhanMN 😭😭😭😭❤️❤️❤️❤️❤️ Um your daddy got rich from poor peoples’ money https://t.co/LG5kWOdoCS Bro you’re embarrassing yourself. AOC lives rent free in your headddddd. All this is in her bio and wiki dum dum https://t.co/SSHa4jmaq4 Eduardo is an immigrants rights organizer. This is nuts⬇️ https://t.co/Wt0mag8ziq OMG I stole Orny’s title w my tweet!! OR: did HE steal from ME by taking a time machine to 13 years ago?! I suspect the LATTER... https://t.co/LKHlyts1N5 RT @AndyRichter: The GOP saying Dems don’t care about border security because they won’t pay for the wall is like grandpa saying you don’t… Oh no, Super! Bob Einstein’s character, Super Dave Osbourne, was so embedded that we all called him Super. Except for his grandkids, who called him Grandpa Super. I will miss his brilliant comedy and vice-like hugs. RT @hasanminhaj: Clearly, the best way to stop people from watching something is to ban it, make it trend online, and then leave it up on Y… RT @ScottHech: MONSTER. 4 days ago she visited the @CBP operation responsible for deaths of 2 migrant children. Her response: “End the Flor… @EllenBarkin Muting is always a good option. To be blocked is a badge of honor. When you mute them they are none the wiser and you never see them again RT @TaranaBurke: This. Is. Unconscionable. \n\nThis. Is. America. \n\n#sayhername #JazmineBarnes https://t.co/v9to8FwblX @itslinke AMAZING! “Never fear failure. Failure should be a badge of honor. It means you risked failure”\n-Charlie Kaufman \n\nTiff- You (Are) Ready.♥️ https://t.co/oMFFWV4OY9 This year let’s take the path of most resistance @johnddavidson @FDRLST SO sorry for your loss, that’s awful. I know what it is to lose a friend- esp a young one.  💔my heart is with you RT @rboyle31: Do you think you know grace? \nAfter Mollie Tibbetts was murdered, farm workers who knew the man accused of killing her fled t… RT @monaeltahawy: Officials in the southern #Indian state of #Kerala say 5 million women formed a 620km (385-mile) human chain \"in support… RT @Martina: Netflix Takes Down Episode Of Hasan Minhaj's Show After Saudi Arabia Complains- unreal... where the talking about killings is… RT @danagould: Are we all still being murdered by that caravan? Just trying to figure out the month. That’s bc everything he says is a lie https://t.co/J3TujpG7om That’s bc everything he says is a lie https://t.co/UIY9OirjC8 ⬇️⬇️⬇️ugh⬇️⬇️⬇️ https://t.co/kLxEYvJYND RT @funnyordie: Stock up on @Pedialyte now so you dance machines can be human beings again in the morning, and watch the 2019 #RoseParade,… RT @mattwilstein: When @SarahKSilverman perfect summed up why Christine Blasey Ford should be believed on @ilyamerica https://t.co/DH2pgzMm… @EllenBarkin @whispernghope @Mariska @LaurenHolly @RoArquette @PattyArquette @MiraSorvino @AnnabellSciorra @TaranaBurke @rosemcgowan @kathygriffin @sethmeyers @StephenAtHome I can vouch for that RT @LBC: Why do so many people hate the European Union so much? James O'Brien has the unbelievable reason why...\n\n@mrjamesob | #Brexit http… RT @OFOCBrexit: BREAKING: Jordan \"Rizzle Kicks\" Stephens has solved Brexit, from the bath... https://t.co/EUcQCtef03 ⬇️⬇️⬇️⬇️⬇️❤️❤️❤️❤️ https://t.co/2Q0CRXQDL9 RT @jor_nicole4: Did my dog just pet my cat?? And did my cat just hug my dog?? https://t.co/PuNWB1Ggzw Rad https://t.co/43Q1wDvfZo RT @tallman_bob: I’ve seen a lot in my travels over the last 40 years but this stopped me in my tracks. Thank you to this young man for ser… @SarahThyre My mother gave me white musk oil from the body shop when I was 18 and I wore it until last year. Still have a bottle... RT @maggieNYT: This is his first comment on the death of the two young children. https://t.co/tCQ5cMmnUC The US supports this war w weapons. This war that kills, sacrifices and starves children https://t.co/bRRDp1yZGt RT @ryangrim: One way to keep children from not dying in prison camps is to not put children in prison camps RT @joshtpm: I will be the one to shut it down. I'm not going to blame you for it. https://t.co/IHI7JvePnI You are a rich toddler w chocolate all over his face accusing the maid of eating the cake.  Your delinquency hurts people.  People are suffering from your tantrum-level refusal to live an examined life https://t.co/8VmSheHdzT RT @gregolear: Trump is a Russian asset, a mob money launderer installed by his mob whoremasters to sow chaos and weaken the US &amp; our allie… RT @alfranken: As the walls cave in around Donald Trump and Dems take control of the House, it's time for Republicans who knew they put a d… @Toure I’ve seen nothing this year. Just watched Wonder Woman for the first time too. @trimorphchris Touché! Ok late to the game just watched Black Panther and I finally know why sneakers are called sneakers Look at this and understand the US aided, Saudi-led war on Yemen- bombing weddings, school buses and funerals and starving the people -thousands dead and many more starving to death THESE ARE CRIMES AGAINST HUMANITY \nhttps://t.co/BvOL4PkID5 RT @ScottHech: The head of Department of Homeland Security is traveling to El Paso to see how well children are being jailed by the US gove… Jeez louise https://t.co/zgcKbP656R RT @ambermruffin: If you are not keeping up with Virgina and @edgarblackmon’s Kwanzaa raps, then what are you even doing? The krunkness of… RT @guybranum: My mother’s negativity is infectious. RT @horribleached: HAVE Y’ALL SEEN THE PANTENE PHILIPPINES COMMERCIAL IN HONOR OF TRANSGENDER AWARENESS WEEK I’M IN TEARS https://t.co/XXz0… You’re kidding me!! Did he have exactly one piece of music and it was a cassette tape of The Best of Chicago? https://t.co/IJnmc8z5aJ @K_onda_payroll @tariqnasheed No skin in this game but feel compelled to point out they’re both written by brilliant andré-naquian wheeler @andre_daren I lost my virginity in Astoria. I’m totally spitballing here but could it have something to do with that? https://t.co/HJ4XSKuL2O RT @Ocasio2018: We should aim to work for an America where developing our potential through college or vocational education isn’t a gift or… @jessicalanyadoo @YungKundalini Thank you, Friend Ezra Furman, Love You So Bad: https://t.co/MMQ5bkowsp @YungKundalini @jessicalanyadoo Couldn’t agree more. Please, if you’re interested, check out episode 113 of I Love You America on Hulu. I talk all about it.  Can’t erase it, can only be forever changed as I’ve long been now. And do all I can to make it right. RT @DebbieforFL: No child fleeing violence should fear death once they reach America. Heartbreaking doesn’t begin to describe how we should… @officialtobin @RalphMovie ♥️♥️♥️♥️ Holy shit -We have met the enemy and they are US, Pogo ! https://t.co/QNybY1NETB RT @jonallendc: In any other administration, it would be newsworthy that the new defense secretary is a defense contractor. Great piece ⬇️ https://t.co/lDaTBuEAWm @ultravalerie Because it made me feel so nice it hurts! The one time he tells the truth it’s to tell a 7 yo there’s no Santa #MAGA https://t.co/vA5ewdKzyD RT @Hilar4Charity: The face you make when you realize you're a last minute Christmas shopper. Every. . . year. . . \n\nWe suggest you forgo i… @alexkotch Jesus you gave me a heart attack RT @sarahkendzior: Reminder that Steve Mnuchin is one of few people to profit massively off the Madoff Ponzi scheme.\n\nThey will crash the e… @TheGDenise Um, YOU are a beautiful woman. Superficially. Objectively. Beautiful.  But doesn’t mean anything if you don’t feel it. If you only see it in strangers and not yourself. Ok I’ll stop RT @Alyssa_Milano: What kind of country allows its Violence Against Women Act to expire?\n\n“I just start kissing them. It's like a magnet. J… RT @Yair_Rosenberg: Anti-Defamation League: In a speech Sunday, notorious anti-Semite Louis Farrakhan claimed that Jews control the governm… This is joy https://t.co/718ctLkq5y Hungry like the wolf- when the girl is moaning https://t.co/tdJHZrNaft RT @BettyBowers: September 20, 2013:\n\nFOX NEWS:    If there is a shutdown, who should get fired?\n\nTRUMP:          The President.\n\n#TrumpChr… Smh right off https://t.co/Q6m8taMMRD RT @ChangeTheRef: Looking for a gift idea? 🎁 Here’s a suggestion by Guac and #ChangeTheRef. Happy Holidays. Merry Christmas🎄 https://t.co/X… 💔 https://t.co/UBFwS5tNGH RT @iAryeh: Folks,\n\n@JohnKasich \n\nis\n\nNOT\n\na\n\nmoderate. \n\nHe\n\nis\n\nbanning\n\nabortions\n\nin\n\nOhio. \n\nWe\n\nmust\n\n#StopTheBans\n\nand\n\nallow\n\nwomen… How the fuck is Ohio not trending they just banned the safest most common form of abortion RT @cjeggbeer: @SarahKSilverman @WhitfordBradley Saw a good one yesterday: “If you don’t see that Trump’s a con, you’re the mark. @smorton213 @manlr61 @boxbrown @MariannaDC3 Wha? We do have border security!do you know that? Rye wall is just a big ugly expensive useless symbol of Trump using fear to control people like you.  Most people crossing the border are going to work or people fleeing danger and seeking asylum. The drugs come by plane pumpkin RT @jimjefferies: I worked at McDonald’s in 1991 and we had Down syndrome employees at the store I worked at. McDonald’s gets a bad rap for… If y’all don’t leave trump from the treason, the ban of an entire religion, the tax cut for billionaires, or the the separation of families as punishment for daring to seek asylum from mortal danger,  at least acknowledge there’s a floating lady’s head in the window behind him https://t.co/gJsUySVeJ6 My Trump lovin’ friends: you are in a trance. He’s betraying  you and the country and you just seem to want a bigger spoon for the shit he’s feeding y’all. Wake up Dolls https://t.co/wXFQyI9T6Z RT @ScottHech: The cycle:\n\n1. Arrested because poor. \n2. Court fees imposed. Can’t afford.\n3. License suspended for not paying.\n4. Need car… RT @jfreewright: #FeetToFire. At 1:35 - the blistering. https://t.co/7baCMRFnhp RT @Public_Citizen: Last night, while America was distracted by a potential government shutdown, the GOP quietly passed a tax bill that gut… RT @ktumulty: Reagan 4/4/80: “Rather than talking about putting up a fence, why don’t we work out some recognition of our mutual problems a… If there was no such thing as pot I wouldn’t be able to see this for what it is which is delicious.\nCredits: mustard, relish &amp;nut -cheese (tee hee)wrapped in a slice of tofurkey https://t.co/dpr69JqgG6 RT @jonallendc: Irony: Shutting down the Homeland Security Department to protect the border. RT @ilyamerica: I Love You, America: part of a balanced diet. An all new episode of #ILYAmerica is now streaming on @hulu https://t.co/9Drb… RT @vulture: Sarah Silverman took her Emmy-nominated Hulu show 'I Love You, America' for an educational after-hours tour at the famed Hall… RT @WillMcgarvey: What is this war on Xmas?  Sarah Silverman.  https://t.co/4pLKQUKLOr RT @doughboyspod: New Doughboys Thursday! We’re joined by Sarah Silverman to discuss a worldwide cornerstone of fast food restaurants, McDo… RT @CitizenAmy: @knowitall143 @SarahKSilverman Happy holidays!  https://t.co/PoaX2OGVsW The episode when Carrie’s computer crashes is too stressful RT @RealTimers: Trump \"knows that he can start a fight and he doesn't have to finish it, because someone else will finish it for him. And t… RT @AndyRichter: Hey guys! I acted in this shit-stirring video for the holidays!  Check it out! https://t.co/McYLJCpcAE"}