{"tweets": "Pre-order now and get it for Christmas... when it's time! 🥳https://t.co/2ph4PQTHvz https://t.co/yXjeVuF4Ya @GinaLuciana @howardwrites @MatthewACherry 😘 Loving the nostalgia of Mariah/Bianca for #Halloween! Keeping the feud alive 😇😈 who can top this?!\n@JoanSDeJesus @AshleyAlese @notdulapeep https://t.co/LboKB5v5Kz Merry Christmas... in two months (to the day!) But first... Halloween!!!! 🎃👻🎃👻🎃👻 getting ready for a moment, dahhlings!! Christmas is a time for sharing. Or is it?\n\n02.11.19\n\n#MustBeWalkers @walkers_crisps #ad https://t.co/6zKBJsdQxK \"Now you’re shining like a sunflower up in the sky way up high...\" In memory of my father Alfred Roy Carey on his birthday today🌻❤️ Say it with me! #notyet https://t.co/x06wjRrXxJ @AustynTaylor_1 Yes! #tbt In celebration of #SpiritDay today, wearing purple and reminding everyone to take a stand against bullying and to support LGBTQ youth 💜🏳‍🌈 https://t.co/3iTwR1sjva https://t.co/umWKS5kJNX RT @AlbertFuentes: Got my copy of @Variety #PowerOfWomen with my girl @MariahCarey on the cover 😍😍😍 https://t.co/b7KRsleuG1 It was November 1😘 #notyet 🎅🏼 #itwas25yearsago https://t.co/zmV0tITV9U Excited to perform in #Dubai for @Expo2020Dubai’s 1 Year To Go countdown on October 20th! https://t.co/n78ELGfJOw #Expo2020 https://t.co/RJJI108hNT Guess what?\n#notyet https://t.co/ZDtWvp91ME https://t.co/HBJGh5O1ls That's idiotic. Daily Mail, Mirror, Metro, Buzzfeed. YOU'RE mistaken &amp; didn't do research. Trust me, I know the difference. I KNOW them. If this is your takeaway from an event that celebrates women, shame on you! I was referring to Reese's speech below. https://t.co/HBJGh5O1ls https://t.co/BbgSeEpgp7 https://t.co/zPNocwSjPj https://t.co/w3xlBJiTOv Required reading. https://t.co/FWurkczJHy @pebbles2day Love you💖 just listened to girlfriend last night.. Still a timeless classic!! And if you don't see what an accomplishment that is for a child that hasn't even been born yet...!!!!! https://t.co/YJtz3Xvj3O #notyet !!!!!! https://t.co/sUINwfzaq6 It is for you. And for me. And for anyone who needs to hear that message. That’s why I wrote the song. Thank you for listening ❤️ https://t.co/yZerfEeQeG RT @Variety: Mariah Carey to her fellow #PowerOfWomen honorees: \"I stand here with you in sisterhood knowing we’ll continue supporting each… Today was great🙏🙏 @Variety https://t.co/MylRb8k5XU You've got me feeling empowered! #powerofwomen @Variety https://t.co/NHfpiu1Zuv PSA: a luncheon takes place during the day Thank you @Variety for giving me a chance to speak freely and candidly in this interview for the Power of Women🙏  https://t.co/5zcqD0h1Mb @MissyElliott 🙌 https://t.co/SzvRekgS3x Missy, you've always been an icon dahhling and I can't wait to work together again! 💖💖 #iconology https://t.co/cLjtQAL6Ww Yes!! My kids are OBSESSED with her!!! https://t.co/YJN0P3atgD RT @Variety: Inside this year's Power of Women, featuring interviews with @ChakaKhan, @MariahCarey, @brielarson, @awkwafina, Jennifer Anist… Proud to be in the company of such powerful, talented and beautiful women. Thank you @Variety! And Thank you for acknowledging #campmariah 🙏💖\n@ChakaKhan #jenniferaniston @brielarson #danawalden @awkwafina #powerofwomen https://t.co/Jbj49J7ocs RT @MGMNatlHarbor: JUST ANNOUNCED - Due to overwhelming demand we are adding another @MariahCarey show for her holiday concert. Come hear t… Pre order new ALL I WANT FOR CHRISTMAS IS YOU singles!!! You'll get them in time for Christmas 🎄, because... #notyet!! 😀😘https://t.co/2ph4PQC66Z https://t.co/2Cbr89F4Fi At the dentist 😩 #notyet https://t.co/fAAPJywKgx 🎄🎄 Tour tickets on sale NOW!🎄🎄\nhttps://t.co/iCGLcnrLHj https://t.co/ciG7lSUEaZ Happy Mean Girls Day! 💖💖💖 #October3rd https://t.co/LK5NHSINs5 Oh I will https://t.co/RNheSmkDld RT @AllAboutMariah: #24YearsOfDaydream 💿\n\n💿💎Diamond\nUS\n\n💿2× Million\nJapan\n\n💿7× Platinum\nCanada\n\n💿5× Platinum\nAustralia\nNew Zealand\n\n💿3× Pla… RT @MariahTrends: Happy 24th Anniversary to @MariahCarey’s DAYDREAM! Acclaimed as one of the Greatest Albums of the last 50 years, the opus… Only 24 hours left to get early access for tickets to my ALL I WANT FOR CHRISTMAS IS YOU tour! Order now @ https://t.co/2ph4PQTHvz https://t.co/9QtRAquz4G Nope. Not yet 🙄 https://t.co/z9cTgha6QW 😮 https://t.co/pghjwhkqen https://t.co/MeEMY3mrBq Love you guys!!! https://t.co/Wv4SBe5WI7 It’s here! Take a peek at the opening of #mixedish with “In The Mix” before it debuts tonight at 9|8c on ABC! @mixedishabc 🎉 https://t.co/okXJ7WnDrH https://t.co/2wQblX37G5 https://t.co/YheX50W8gC Lambily! Celebrate the holidays with me on my All I Want For Christmas Is You Tour ❄🎄 Presales start 10/1 at 10am ET.\nGet more info @ https://t.co/4fkAcyh35z https://t.co/lz7un90OtD This choir is killing this arrangement and song! I neeeed to speak to whoever put the arrangement together and rewrote the lyrics.. Beautiful. Thank you❤️ https://t.co/k8GVFwHQwp Wish I could've been there! ❤️ https://t.co/k269WJnqZg Not yet 😘 https://t.co/jsfOKS8NV5 Sound on! 🔊🎶🧚‍♂\n❄#MerryChristmas25 ❄Pre-order now! ❄ https://t.co/twqtnCOr7N I can't wait for tonight!!! @mixedishabc (featuring the theme song that I wrote!) premieres at 9/8c on ABC, followed by @blackishabc 🎉 and the fabulously talented @TraceeEllisRoss is in both!! ❤️ #InTheMix https://t.co/lbmWvZdVoM Don’t miss it! #mixedish premieres TONIGHT at 9|8c on ABC. #InTheMix @mixedishabc https://t.co/9AX4BegdgW RT @MariahCareyAU: Two exclusive “All I Want For Christmas Is You” singles are also available for pre-order now in Vinyl and Cassette forma… Lambily! MERRY CHRISTMAS is turning 25 &amp; I’m celebrating by releasing a special 2CD Deluxe Anniversary Edition on Nov. 1 featuring my St. John The Divine performance &amp; more! 🎄 Pre-order now for early access to tickets to my US tour https://t.co/bip7dxdvZc #MerryChristmas25 ☃💖 https://t.co/QSE78fD7jO RT @mixedishabc: We got some funny ish right here! #mixedish premieres tomorrow at 9|8c on ABC. https://t.co/9IDAUXot8l RT @amazonmusic: .@mariahcarey's legendary hit #Heartbreaker turns 20 (!) years old today. We'll be blasting this one all day if you need u… RT @thefader: 20 years ago today @MariahCarey released “Heartbreaker,” simply one of the best singles of all time. 💔 https://t.co/kQRLbnE9GC Gimme your love\nGimme your love\nGimme your love\nGimme your love \n#HappyAnniversaryHeartbreaker 💔 https://t.co/ZjwgApz9fI @darrenhayes 🤣💖 RT @mixedishabc: “I’m just so thankful that this show exists” - @MariahCarey\nhttps://t.co/z9w2BSnOOi @chloexhalle Loved meeting the two of you! You're absolutely gorgeous 💖 RT @Variety: Jennifer Aniston, Awkwafina, Mariah Carey, Chaka Khan, Brie Larson and Dana Walden to Be Honored at Variety’s Power of Women L… Got to meet another MIMI last night! I can't wait for you all to see her on @mixedishabc !! 💞💞 https://t.co/qJI9Hkb6mu Caption this\n😀x😂x🤣 https://t.co/0ihSiC2Qfw Embracing our ish! So proud to be a part of this amazing family ❤️ #EmbraceYourIsh @mixedishabc https://t.co/7zug1I3VVb RT @mixedishabc: 🎶 @MariahCarey's #inthemix OUT NOW! #embraceyourish #mixedish https://t.co/Ngt7xkxe0S In The Mix (ish!) out now! Watch the music video @ https://t.co/9IsR0bwJJ7 @mixedishabc https://t.co/eUuoLIuDVw \"In The Mix\" drops tonight!! 🎉🎉🎉 @mixedishabc https://t.co/jas5T5blgw 😘 https://t.co/HsyW3KqJaK https://t.co/CCKF6b7xPr @adammcintyree The bangs tho...NO Not bad... but ugh why the lighting whyyy https://t.co/cicPQORcZU RT @Sony: Today in 1997, @mariahcarey transformed herself &amp; all of us with the release of her sixth album, \"Butterfly.\" Follow along as we… https://t.co/XET4ZyhUWR https://t.co/mwlJFUsONa RT @MTV: 22 years ago today, @MariahCarey released her sixth album, #Butterfly. In honor of the LP, we're throwing it back to her 1997 inte… RT @Vegas: @MariahCarey thank you for the iconic body of work the world knows as the album, ‘Butterfly’. We wish you the happiest of annive… IN THE MIX 📀 Tomorrow!\n@mixedishabc #EmbraceYourIsh https://t.co/gAyHTHl4Pn 🦋 Happy Anniversary Butterfly! 🦋 what's your favorite song? Here is mine 🎶❤️ https://t.co/73KQDkm7ym RT @MariahCareyAU: Today marks the anniversary of @MariahCarey’s signature album, ‘Butterfly’. Regarded as one of the greatest R&amp;B albums i… https://t.co/PWfEOFiY1C Roe roe got me to exist in florescent lighting... and she loved every second of it! https://t.co/SRCXUkJaK6 https://t.co/xZNN5f2uhB Thank you for sharing your powerful story. That day irreversibly changed all of our lives and will be indelibly etched into all of our memories. I'm so moved that you were able to find solace in my music. It means more than you know. #neverforget https://t.co/TX49AUuMoL RT @Variety: Why @MariahCarey's 'Never Too Far' Could Have Been a Post-9/11 Anthem (Column) https://t.co/Pgnq6kbaK6 In loving memory of those who have lost their lives on this day, 18 years ago, and with gratitude to all the heroes who risked theirs. #NeverForget https://t.co/CS2il58dk3 Me: pick anywhere in the world you want to go to for a shopping spree\nMy daughter: https://t.co/D625sGes7k Date night with Miss Monroe 💖 https://t.co/MQbF46u2oW I know! https://t.co/XSLOysMLDD This just made my day!!! #obsessed https://t.co/LFahW3ZIt8 😂😂😂 thank you for anointing me with the new title of season regulator! PS.. still not ready, I'll keep you posted! ☀️☀️☀️☀️☀️☀️☀️ https://t.co/VEv3UWzZVE RT @oureric: Calendar: It's fall!\n@MariahCarey : ABSOLUTELY not.\n\nhttps://t.co/SIiy9PpwSg And? It's perfectly normal! https://t.co/a9Goq9BvEK Holding on to summer 🦋 https://t.co/W0xqnjHqfZ Nooooo! You can't start without me and I'm not ready yet! 👆 https://t.co/4FWZyAC1dO @katharinemcphee Lol but please save some of that festive energy for Christmas!! 😘😘💖 Happy birthday 👑🐝@beyonce! https://t.co/1zjaZHA7xj Me + Trey + @_MAXWELL_ doing background vocals for the one and only, Prince! #laborday https://t.co/Azwab0tkPP Not yet! Let's get through Halloween first 😛 https://t.co/qEoGxjMnM4 I hate coffee but watching comedians in cars getting coffee has made me order two espressos a day. It is my absolute favorite new show!!! Love you @JerrySeinfeld !!! From the summer to the fall, we migrate #bye https://t.co/KcmjpOROLA Communicating in F#7 https://t.co/B9GMFtMwC7 https://t.co/MQc4G3Qtlo 💋🐬 https://t.co/jDyswpGRyZ Thank you for a great show Curaçao! \n📸#curacaonorthseajazzfestival https://t.co/CAx006ajGU This. Is. ADORABLE!!!!! ❤️❤️❤️ https://t.co/GnGbNaZiOI 25% OFF Labor Day Weekend Sale Starts Now! https://t.co/ywaAlHCaFQ https://t.co/zxuS4GPxRh ❤️ I miss you, Luther! https://t.co/M8MvcvlEzt Starting a band... Lol @priyankachopra @nickjonas https://t.co/TIEQVmnDJh 😮😮 thank you to whoever decided to reference this song. Only the hardcore fans know it but it means so much to me on an artistic and personal level🙏 https://t.co/9DaYt2SwlG Me: Liking a friend's 19th duck face selfie of the day\nAlso me: https://t.co/A3ueGF6Muc RT @GMA: The video has since gone viral with over 100,000 likes, and even got a retweet from @MariahCarey herself! https://t.co/j9qDW2MrwN Let's go Mr. H!!! Extra credit for all! https://t.co/nu8WsLIloV @justafantasy 😂😂😂 Wow the lambily really knows \"this one\" and that one, by the pool, on the beach, in the streets!! Do you know this one? 😂 https://t.co/02C5eUsjPZ RT @CremeDeLaShiz: Mariah at 4am when she sees the drunk lambs on Twitter...  @MariahCarey https://t.co/fBAfNa8NV6 RT @SCAMye_west: @MariahCarey Time is cancelled Thank you dahhling, I do try to make time for travel! 💋 https://t.co/EjbHAcTxXg I was just checking!! https://t.co/yKNzKuSwTJ Awwwww 💖 me and demkids singing along right now! https://t.co/IQBZ8ixbhb I prefer to wait until the day after Thanksgiving but that's just me https://t.co/qpM55HKyiI https://t.co/F5qcK5CiIg #tbt #summer pon de beach☀️\n📸 Patrik Andersson https://t.co/i3X0qNxOL0 @106th Yes, it is time for bed!😴 At the end of the day, it's just for laughs!! 😂 https://t.co/ndS1WZe4YL https://t.co/G2qUysImfd Me right now: https://t.co/4FUptNmfmu https://t.co/nXZXN2f7LG Off to put some finishing touches on \"in the mix\"! 🎶 @mixedishabc https://t.co/Gw1MHBicdJ @JR_Frank91 😂😂 Ok lambily where are you sitting? \nI'll be table hopping💃 https://t.co/p8LUVl0sYi https://t.co/rE2zUqt2mU https://t.co/eRgIKH2KgH RT @AppleMusic: Still a bop, 10 years later. Revisit @MariahCarey’s #Obsessed. \nhttps://t.co/YdkPyq6tFK For the first time in the US, DAYDREAM is now available on metallic gold vinyl exclusively through @VinylMePlease. Get your copy @ https://t.co/OcmQOb6h0A https://t.co/24wIOJGiSv Love takes time.. but so does binging this amazing show!! No spoilers please!! @PoseOnFX @theebillyporter @StevenCanals @janetmock https://t.co/NimEk3ofwi https://t.co/JmCt2SZ5Hn The \"baaaah\" took me out 😭😂 https://t.co/OhyrUnpxpv RT @HillaryClinton: The honor is ours; it’s not every day you meet a queen. 👑 https://t.co/a2W7JPwv1M RT @people: Mariah Carey Opens Up About Her ‘Tough’ Childhood as She Celebrates 25 Years of Her Summer Camp https://t.co/JD2SiZEOTN @reggieaqui And I would make an exception for you! 🤗 RT @GMA: Pop superstar @MariahCarey took @tjholmes behind the scenes of her passion project \"Camp Mariah\" that has helped thousands of low… A LEGEND.\nThank you @BarbraStreisand for a magical evening ❤ https://t.co/ocxBmD4DKZ An honor to meet President Clinton and her husband, former President Bill Clinton! 😊 Thank you for everything you have done and continue to do for our country. ❤️🇺🇸 https://t.co/uPj1WXQjnm RT @GMA: TOMORROW ON @GMA: @tjholmes' one-on-one interview with the legendary @MariahCarey! https://t.co/l4qI7Czr7e Proof of my obsession with you as Olive in Bullets over Broadway documented here! Anyone who hasn't seen this movie - it's a must!!! @JenniferTilly you're sooo good! 🤗\nThis is from a few months ago in London and my son Rocky was video bombing🤣 https://t.co/HMyM9OmcRd https://t.co/hnUD6Z4aZ8 If only you knew how many times I recited your lines from Bullets over Broadway!!! \"Olive, Olive, call me Olive honey!\" @JenniferTilly https://t.co/uIIduzLJML Dear Kenya Barris, ABC and the mixed-ish family, this is a dream come true. I'm so thankful this show exists and I couldn't be more honored to be a part of it 💖@funnyblackdude @abc @mixedishabc https://t.co/F5t3i1CZ0g RT @ABC_Publicity: New Release: Global Superstar @MariahCarey Is ‘In The Mix’ – Award-Winning Music Icon Writes, Produces and Records Theme… The latest passengers on the #obsessed train 🤣😜😍🏁🚆\nhttps://t.co/xXJn53Nek3 https://t.co/sAVflbQDN0 This must stop. For the sake of our children. Enough. https://t.co/E9Yvz5TQ87 bring in the clown car #obsessed #tiktok \nhttps://t.co/8OHTKb9IEG LOVE. Out now ❤️ https://t.co/qzilcizUMl RT @billboard: The #ObsessedChallenge has given new life to a @MariahCarey classic https://t.co/iubJdz9270 We were joined by the incredible @mistyonpointe whose prolific career and unprecedented accomplishments have inspired so many. Getting to finally meet her, and knowing how much she has overcome as a biracial woman to get to where she is, is so inspiring to me. I'm forever a fan. https://t.co/9zEDnDSUNb Happy anniversary \"CAMP MARIAH\"!!  🎉 I was so honored to celebrate this milestone with the @FreshAirFund at the career awareness summer camp that we founded together back in 1994. Meeting the campers and the amazing staff was the highlight of my summer so far. https://t.co/hS3JJxz2zB Bonus video: when we walked into the West side market looking for anyone with a car😂 https://t.co/36h16t68Ez My adventures on the streets of NYC! Car problems, walking in the rain, shouting out best friends of people stuck in traffic.. typical New York antics! https://t.co/1ac1SL954n The freaking car broke down on the way to Camp Mariah 🤬 so I decided to participate in the Tik Tok #Obsessed challenge... I lost! \nhttps://t.co/Jwespt6lqw https://t.co/8mGKBZk6AK Dancing and crying at the same time, more than I could do 😘 Wipe them tears girl! #Obsessed https://t.co/WsUcYnP6Jz Thank you for acknowledging this song ❤ One Sweet Day will always hold a special place in my heart and I want to thank anyone who's ever told me how this song has affected them and their loved ones. https://t.co/zUT1f3IzEc https://t.co/0aImKtzpXc Sending love &amp; congrats to @LilNasX on breaking one of the longest running records in music history! We've been blessed to hold this record with a song that means a great deal to @BoyzIIMen and myself and has touched so many. Keep living your best life! ❤ https://t.co/3YorLCg3lx You: waits for the camera to stop\nMe: https://t.co/ZsjMQYTAbu Studio time is always a fun time!🎼🥰 https://t.co/DUe6yW4oi1 On today's episode of #MomentsWithMimi, @thepizzacupcake is teaching me &amp; Dev Hynes how to make pizza! Watch @ https://t.co/9FTY90aGmr https://t.co/R43yEUeLQW So.. am I the answer to \"How do you sleep?\" 😜 I LOVE the song and I couldn't be happier than to be starring in your dreams, dahhling! ❤️❤️❤️@samsmith https://t.co/8DqQKx9mNa RT @voguemagazine: There’s one grownup celebrity on social media who continues to show the kids how it's done: @MariahCarey. https://t.co/E… RT @dailydot: .@MariahCarey refuses to participate in old-age FaceApp challenge: https://t.co/NiXJasGxKM https://t.co/emcpisOaGj RT @HuffPostUK: .@MariahCarey's response to the FaceApp trend is very Mariah Carey https://t.co/ZCwvnLeuGL RT @wmag: Why FaceApp memes are over, according to @MariahCarey. https://t.co/h6rMUcpKLq The only way I'm leaving my house today is with 3 portable a/c units blowing directly at my hair. In slow motion. #nyc #heatwave https://t.co/tECScxLPgC On the next #MomentsWithMimi, Dev and I put on our aprons and learn how to make pizza 🍕🍕! Tune in on Monday on my #igtv! https://t.co/xtPCcqlgWf Congratulations @jermainedupri! Loved being a part of the #SoSoDef moment! 🎉🥂 tonight on @WEtv 10/9c https://t.co/HCOzgbgD2O FaceApp is not something I acknowledge https://t.co/X2aEatobBC ❤️🐑 #WorldEmojiDay Happy anniversary, Loverboy! 🏁 \naka the best selling single of 2001😄 https://t.co/DXwOD9T12B Check out the latest #MomentsWithMimi on my IGTV! https://t.co/lkFADyoTUI This episode features home-made spa treatments with the beautiful @dinahjane97! You're welcome everybody lol! https://t.co/7YOEsZQkEh In case you had any doubts, thankfully my kids love Christmas almost as much as I do!!! https://t.co/6EiMQ5yhyr Thank you! Adding to my list immediately https://t.co/OJ6lxQj487 My first female guest on Moments with Mimi, the beautiful @dinahjane97! Tune in Monday to learn some tricks of the trade on my #igtv 💅💄 #MomentsWithMimi https://t.co/c4SofnjkZw One Sweet Town Road! https://t.co/Y30tSz2Fhw https://t.co/viPrYNAnfM @CharlieL_ On Monday!!! @_Whk_ 327,000 💖 Mimi!\nI mean.. Mimi? \n😜 https://t.co/IuvFxgn9B4 @melissasprofile Yeeees! But Coming to America is a classic too 😘 I love you Dev! Thank you so much for bringing your brilliance to the Caution album. I really hope to get back in the studio with you soon. xo https://t.co/5ycNJ2yNbZ One Sweet Day last night in Quebec 💖 https://t.co/8aWbkPBj97 @mindykaling ❤️ thanks for making me LOL 😂 and to my fans everywhere - I love you. Thank you for everything! ❤️ #lambily #L4L https://t.co/Ra8uYQyJhr Thank you so much Quebec for making it \"through the rain\" with me at the show last night. You were an incredible audience and I appreciate you so much. Hope you enjoyed the show even though I was doing my best not to slip and fall on my a** lol! @FestivalEteQc https://t.co/vRisUli3gn Binge watching #TheMindyProject! I'm trying to go back to sleep but it's too funny 😂 Need suggestions for what to watch next! Want the tee? Get it here:  https://t.co/F9W0Hzb8Hg\n\nWant a pic of me wearing the tee? Get the August edition of @cosmopolitan! https://t.co/Ts3YL0UdJx I approve this message https://t.co/dXFYImwkGB https://t.co/JAbWBTe2Yu https://t.co/nlvqodgGlT RT @VinylMePlease: Now available exclusively in the VMP store: A metallic gold vinyl reissue of @MariahCarey 1995 masterpiece, 'Daydream.'… 🧾 https://t.co/IBbmsUmlIM https://t.co/eAxRCBEGv7 I finally got to put my #500hours to use and tried to paint @kristoferbuckle! How did I do lambs?? https://t.co/BaE9veBEvL #Facts https://t.co/VAwThNjOCs RT @Cosmopolitan: Meet our August cover ⭐️, you *def* know her. @MariahCarey has seen your memes. She’s read the DMs. She knows all you wan… Today’s episode of #MomentsWithMimi is live on my IGTV! @marshmellomusic is Roc &amp; Roe's favorite artist so we decided to surprise them with a special game of charades! Watch full video @ https://t.co/UhDUBOGRyF https://t.co/fK5r9Nj44x Well, that was fun! my next challenge is trying to get my kids off their iPads 🤦‍♀ @dinahjane97 Perfect dose of drama 😂💖 Challenge accepted! #bottletopchallenge https://t.co/Rygijd6z5W Playing charades with @marshmellomusic and Roc &amp; Roe! Naturally, I decided to play by my own rules 😂 #MomentsWithMimi tomorrow @ 12pm ET! #igtv https://t.co/r2jTSjtlJE Tune in to the next episode of MOMENTS WITH MIMI on Monday @ 12pm ET on IG to find out! 😜 #MomentsWithMimi https://t.co/oQK7CQzze9 Dem kids agreed to get off the bouncy house for a minute to take a quick pic with mommy on Fourth of July 🌻🇺🇸 https://t.co/s55i5Nl8z8 Finding my light https://t.co/bGaS0qCngG Can I borrow your handbook to share with some of my current staff? 😜 https://t.co/dEe0vPHGQz @ivanmpepen Wow 😮😮 I love it!! 🦋 Sounds like a plan! https://t.co/XPulsljgiN Congratulations Halle!! My kids and I are so excited for the emancipation of Ariel 🧜🏾‍♀️ @chloexhalle https://t.co/6UwrduDQuc I was like... Do I roll out of bed and get to the doorway? I'm from New York, I can't handle this! https://t.co/6eNWOFfubu Check out the 4th of July weekend sale @ the Mariah store: free shipping on orders over $35!  https://t.co/Z72864zW5H https://t.co/EzQvu3V35M 🦋 One of my favorite songs (vocals only), aptly titled.. Fourth of July! 🦋#FourthofJuly https://t.co/vVUvlHsPHL Waiting for Instagram to work again... https://t.co/BBHoKI7ATF Oh yes.. last year I cancelled \"brunch\" https://t.co/43ORuuM7xA Watched \"Little\" with Miss Monroe 🤗 We loved it!!! Let me sleeeeeeep 😴😴😴 https://t.co/i6G6yXc6sY Mariah Carey loves this Mariah Carey video 😜 https://t.co/JftvaA4F5M RT @papermagazine: .@MariahCarey giving the content we NEED! #MomentsWithMimi\nhttps://t.co/2tm6jQjzG4 The 1st episode of my #MomentsWithMimi IGTV series is Prank Calls with Dev Hynes! Watch now @ https://t.co/jp19JTAd4Z https://t.co/vYae67tcyT I Stan for Stanford https://t.co/40iv6mTAkM Visine https://t.co/d4CGwfU62B https://t.co/Pd87thbAOM It hit me differently at sunrise too after singing Fly Like A Bird all night! ❤️ https://t.co/7vrE8PvcRi Can't wait 😂😂😂 tomorrow at noon @ https://t.co/C5CuTkI4eB https://t.co/ZeQk1mrpg1 RT @jermainedupri: July 18th “This has to happen”- @mariahcarey #SoSoDef https://t.co/NHJwh44nNT @katharinemcphee congratulations!!! 🎉🥳💝 @Butterflymcc @SnoopDogg OMG so sweet 😍😍 that would be JJ's child, the good Reverend Pow Jackson 🤣 https://t.co/QPkSFOcGHz Happy anniversary to Jack Jr. (JJ), Cha Cha's husband, father of many, King of Voice over ft. @SnoopDogg, still a stud, still my sweetie, still pissing on couches 🤣 love you pup!! https://t.co/Fb2e1VjVCK It was Nightmare On Elm Street 5!!!! What can I say? I needed to know how it ended 😂 https://t.co/LWyQ6kiOdq Lamb trivia: guess what movie sequel I went to see by myself when I was working on my first album? https://t.co/r78N9iSRJm Find out what kind of tomfoolery Dev Hynes and I are into 🤣 Visit my IG on Monday @ 12pm ET! https://t.co/NpIW0Q3uxr 🥂 let's make it Fridays too! https://t.co/14q3YGy6PR https://t.co/5owQ21OQFw WiseGirls! https://t.co/Zqci8cz8sh Thank you 😘 they're always a blow dry away 🤣 https://t.co/uMTIAbAktq NTT: \"Have you ever felt so enamored baby (that's how much I love you)\" 🎶 If you don't know it, listen to Rainbow! ⁦@Usher⁩ https://t.co/rQGIwZItSg @bluberry_bagel West coast dahhling and I'm pon de studio 😘 Oop https://t.co/u1QZkxt1pT First night out after sing sing so I tried to bring it 🤷‍♀️ https://t.co/MoCV0G4TG7 @JessicaJungxBgA That's not what I said in that video but it's pretty funny 🤣 @thatlevity 🤭 soon! Aaahhhh 🤣 https://t.co/lIKzQOBE01 @careylikeburiah I'm taking notes lambs 🤣 Oops🤣  I do love that particular part of the song #TheRoof https://t.co/gUG8QIrive https://t.co/M5iz5dfMuo @ashleyrichmxnd Do you think of me!! NTT: \"last night I had the strangest dream, it was actually quite symbolic\" 🎶 #ntt Love you and live for your comedy special 🙌🙌 @aliwong https://t.co/FWXmilxEGL Love your taste in music @netflix 😉 for those who are just discovering it now.. you can listen to \"Always Be My Baby\" + more @ https://t.co/7Uu8f5nYVe https://t.co/EA9EECYLa2 @Esteban_RDiva THAT is pip 🙌🙌 @dansthelovegame 🤫 Not sleeping on it chile! It was in contention for the #caution tour, in fact! https://t.co/gPwSlM1Qzr https://t.co/GvzMyGSuCj https://t.co/RH6BnpTuvo @4ourthofjuly The lambily in the replies to my other tweet! 😊 We-\n(Belong together) And it's also the Royal We I love this game! Can I get @TheCrownNetflix for We Belong Together? In honor of the Queen and her crown jewels 👸 https://t.co/edfO9CMS7L Let me help you out: Always Be My Maybe 💝 https://t.co/edfO9CMS7L 😮 Tom is a lamb! https://t.co/3Y9KdtaTPZ Friend: come to the pool party but don't be extra\nMe: https://t.co/IEJTO22lJb Come to my concert.. we have group therapy every show😉 https://t.co/tnn14V5l0X A tangent. #tbt https://t.co/OTMFU5EzjH I tried to count them all but had to stop at 27 🤪 https://t.co/RI9o6icZ51 @RyanSchocket You're the best Ryan, I loved this!!! 😊 Thank you for letting me \"relive the splendor\" of these moments 💖😘 https://t.co/A56koBAHnX RT @violadavis: EMANUEL, our new documentary film about the Charleston church shooting opens in theaters nationwide TONIGHT &amp; June 19 only.… I actually listened to this the other day 😢 \"If my shows of gratitude are minuscule, Inside your mind, sorry.\nThere's only so much I can do, I love you and did all that I could\" https://t.co/qy0r7zwP1x Use when necessary https://t.co/uw5lyyL1vB Thanks for being a part of it dahhling! Still one of my faves 😘 https://t.co/njt6VBlzQT \"Guardian angel, I sail away on an ocean, with you by my side.\nOrangey clouds roll by, they burn into your image and you're still alive (you're still alive)\" https://t.co/wFvKjdDqL3 RT @MARlAHLOOKS: celebrating the 10th anniversary of OBSESSED https://t.co/V9yCDRpLtq Awwww thank YOU so much for this and congratulations!!!! 💖 https://t.co/izOqiVdrG3 This could've been me if only I hadn't failed remedial math 🤦‍♀️ happy birthday Siobhan!! 😘 https://t.co/Ffz69lTRkc A brief moment with Olivia Pope 😎😴🤣 @kerrywashington https://t.co/gVAcPXNvwb 🦋❤️ https://t.co/taTpdlJQNO Last show of the #CautionWorldTour!!! ⚠🥳Thank you SO MUCH everybody, especially the lambs - I love you!!! #L4L 🦋🐑🥰🤩💞 https://t.co/TJLnLqlV8L RT @Shazam: Happy bday to @MariahCarey's debut album 🎉 #29YearsOfMariahCarey https://t.co/a2mmDKj6pG RT @amazonmusic: WOW! @MariahCarey's debut studio album \"Mariah Carey\" turns 29 today! What's your favorite song off the iconic record? We'… So hard to pick just one but I'm gonna go with Sense &amp; Sensibility cause I have no sense or sensibility! 😂 can't wait to see the new movie! 💖 @LateNightMovie https://t.co/BcTcVDG6lL Happy birthday \"Mariah Carey\"... born in 1990!!! (the album, not me 😜) https://t.co/61mEn2NFZs RT @MariahTrends: Happy Anniversary to @MariahCarey’s eponymous debut album! It changed the game. \n\nCelebrate with us by streaming/buying t… RT @AllAboutMariah: \"Mariah Carey\" became the best-selling album of 1991 in the US and sold over 15M copies WW.\n\n\"Mariah Carey\"\n9x Platinum… Currently winning this game lol #lambsgohard #wordscapes https://t.co/FQmJa5Qlrn Watching The Godfather. https://t.co/WYZ9UAxUKH Approved. https://t.co/OCl9I44syE After much deliberation cha cha and I decided she needs justice too! #JusticeForChaCha 🐶🥰 https://t.co/dJCw0Lzf9N Justice For Rocky 😍 https://t.co/mf32II5O1V I think you mean 2 years ago.. lol https://t.co/2i7TtcQBXD Always Be My Baby 😘 https://t.co/kb5bfnFEOG I’ll never forget this moment. On this day two years ago 😝https://t.co/0I4PvYz5sg RT @billboard: This week in Billboard Chart history: In 2005, @MariahCarey returned to No. 1 with 'We Belong Together' https://t.co/xcfoi2T… Lol gotta love the lambily!!!! We both have the same initials! Obviously so does @Madonna! And @mistyonpointe! Refer to my lyrics though 😜 jk love you girl ❤️❤️❤️ @MileyCyrus https://t.co/DQlvQWfHeJ RT @ArsenioHall: Today in Entertainment History:\nIn 1990, @MariahCarey made her national TV debut on the \"Arsenio Hall Show,\" performing \"V… #Pride2019 https://t.co/ZQwnoXOF0y Happy Pride Month!!!! 🏳‍🌈🏳‍🌈 Love always to all my friends in the LGBTQ+ community! \nGet my festive shirt and more pride merch @ https://t.co/pAoAZBILAu 🏳‍🌈🦋 #HappyPride #Pride2019 #LoveIsLove https://t.co/EZ9DQgDJiF RT @strongblacklead: “My hope is that @WhenTheySeeUs invites you to think about the overall criminal justice system and all of the people e… \"It's meeee!\" 🤣 https://t.co/VMQaGVfHZs Carry me higher! 🎶 Impromptu sing-along at dinner 🦋 https://t.co/doJHxZkanZ And we met on a Mississippi road! https://t.co/qeKh5Nj14w RT @CuffeandTaylor: 'FLAWLESS!' 🌟🌟🌟🌟🌟 - Express\n\n@MariahCarey received phenomenal reviews following a spectacular performance at the @Royal… RT @malachi_joe: @mariahcarey moments like this are what make being a lamb truly special @RoyalAlbertHall thank you https://t.co/OADcYgwQcp Grateful to receive this incredible honor by the @IvorsAcademy,   recognizing my songwriting. Thank you so much Fred Ball for accepting the award on my behalf and presenting it to me last night. This is so very special to me. https://t.co/xyJCFgTFqN My email used to be \"lemmelone\" https://t.co/vvqVlUq7mJ Rocky having a moment 😂 #endlesslove https://t.co/m3kBnbD2Hn London, I'm having so much fun!! Thank you for 'giving me life' 🙏❤️ see you tomorrow, dahhlings!! 🇬🇧 https://t.co/jf1SAgftfW I Ken Lee.... Tulibudibudoubt you https://t.co/fRrqrn2hZo With the gorgeous @priyankachopra backstage in London tonight. #lambily you were amazing!! Let's do this again tomorrow! 🇬🇧#CautionWorldTour https://t.co/KghKwXsXT6 MDW sale on the Mariah store! 25% Off Storewide. Use code: MIMI25\nhttps://t.co/Z72864zW5H https://t.co/NHntkS4aU4 #fbf My first and only time at Royal Albert Hall. One of the most amazing experiences in my life with the LEGENDARY Luther Vandross. I can't believe I'm going to perform here again for 3 nights starting tomorrow! 💖 🇬🇧 @RoyalAlbertHall \nhttps://t.co/X56clsf10x Thank you Sony Music Ireland for this beautiful 20x🇮🇪Platinum plaque! Naturally, I had to inquire about re certifications! @SonyMusicIre @Celticmariah https://t.co/8tbpJTDkSA Thank you so much. This one is really special 🙏 https://t.co/1b2AZgqrR9 RT @IvorsAcademy: \"Songwriting is the core of who I am. It's a beautiful thing to be appreciated for the songs I've been creating my whole… RT @PRSforMusic: The worthy recipient of the #TheIvors PRS for Music Special International Award is the one and only, legendary... \n\n@Maria… I’m proud to support @RedNoseDayUSA to end child poverty and help kids achieve a great future @BGCA_Clubs. Learn more at https://t.co/fTh7I2Y480! #NosesON! https://t.co/tNTN4gbc44 💚☘️🥳🥂🇮🇪 thank you Dublin!! Next stop - London!!! https://t.co/o5IH7oX8Ak Thank youuuuuuu Dublin! I couldn't dream of a better opening night for the European leg of the #cautionworldtour 🦋 my very first concert in Ireland! 🇮🇪 Slainte!! 🥂 https://t.co/eL717GUdWY RT @IrishTimesCultr: Mariah Carey ‘smashes every goddamn note’ at a glass-breaking gig in Dublin https://t.co/CeKWmSvuww via @IrishTimesCul… RT @FM104: So @MariahCarey brought her kids out on stage wearing Ireland jerseys!\n\n🇮🇪🇮🇪 https://t.co/e12P5MK4eb When you had a rough night but your friend is being extra https://t.co/AJjqtMpOYY Sparkling in Dublin! #CautionWorldTour tomorrow!! 🇮🇪 @3ArenaDublin https://t.co/lAE8POraWY Hello Ireland!! Thank you for this gorgeous welcome 🌈  Can't wait for opening night of the #CautionWorldTour in Europe on Wednesday right here in Dublin!! 💚 https://t.co/YTBdsKUj6T ⚠️LAST DAY to enter to win a trip to meet me backstage in France! Flights, hotel and VIP tickets are covered, plus it’s all to support the great work of Public Counsel. Enter now @ https://t.co/SfO8oSeG4t https://t.co/IBNiUFjJmL Want to win a trip to meet me backstage in France? It’s your LAST CHANCE to enter! Flights, hotel and VIP tickets are covered, plus it’s all to support Public Counsel. GO: https://t.co/SfO8oRX4FT https://t.co/vYYKGf5u0o Treated me kind... https://t.co/yLdAemigEV RT @MariahTrends: Happy Anniversary to @MariahCarey’s debut single - VISION OF LOVE. Undoubtedly, it is one of the most influential singles… RT @AllAboutMariah: \"Vision of Love\" was released on May 15, 1990.\n\n\"Vision Of Love\" became 👑 @MariahCarey's 1st No.1 song on @billboard Ho… Roe Roe's first back flip!!! 🥳😍 https://t.co/hj3rs0jNbv *fairy Godmother https://t.co/B3HZvQ91w7 Used in a sentence 🤣\nhttps://t.co/XIXiilTRGd https://t.co/PGNz45Nbgv 🎶🎶 happy birthday to ya, happy birthday @StevieWonder!!! (sung like you!) In honor of your special day, I'm reposting my lil' tribute to you. Love you!!! ❤️❤️ https://t.co/4SacwOdZ2S Win Caution World Tour tickets on @TIDAL! 💫⚠ https://t.co/m2RjIxusNY https://t.co/Tq1323aoPi Eat, drink, dance, rob a bank, whatever honey! https://t.co/62nwABqRLo Grateful to be a mother every day, even when you're getting a star on the walk of fame and your 4 year old decides it's time to throw a tantrum! ❤️⭐️🤩😍 #MothersDay https://t.co/wncR3aJpXB Happy Mother's Day to my mom, Patricia and to all the Mommies in the land! Wishing you a beautiful day full of love ❤️ https://t.co/p44N7n0hkz Tickets to all Vegas shows are on sale now! https://t.co/iCGLcnrLHj 🦋➕🎄@CaesarsPalace https://t.co/JpEq2au8as Basically 😂 https://t.co/WwfFlVE4HZ My latest fixation is watching The Marvelous Mrs. Maisel on a loop. Please hurry up and do season 3!!!! This show is the freaking best!!!!! @MaiselTV https://t.co/tH33lwFALw RT for CurlyRiah\nLIKE for \"sheets\" (aka straight hair lol) https://t.co/7eGXlORVGT Me three! https://t.co/1IHSvirmbV Hawaii moments 🌺🦋💖 https://t.co/wQFxeNl27v Dear makers of this swimsuit, I've had it in my stash forever. Can I please get this in multiple colors since apparently \"the crowds seem to love this\"? 😂 https://t.co/OFslv78Rfp https://t.co/NjcIL3ZzkU Heartbroken over the loss of beautiful Lynette 😢 thank you for all the memories ❤️ Rest in Peace. MC https://t.co/QAowoAIeBK Get your mother's day gift from the MC store now! https://t.co/TENSVjlzKC https://t.co/OlgHFSqsQx RT @smashleybell: l👏🏽C👏🏽O👏🏽N👏🏽I👏🏽C\nI can’t say enough what it meant to me to meet @MariahCarey and talk about being inter-racial, belonging… 🤷‍♀️ https://t.co/qpZBxMuhkA Last night’s @BBMAs moments were so ICONIC 😉 that I decided to relive them with a playlist….give it a listen!💋https://t.co/fRrGPeD398 https://t.co/I2Rc9fQuO7 @pebbles2day Pebbles, I literally listen to you every day ☺️ RT @106KMEL: .@MariahCarey is the gift that keeps on giving.\nhttps://t.co/KDvsRCoWZE .@taylorswift13 love you back!! Thank you for your incredible energy!! https://t.co/TrFnPKMcXL Dev, the feeling is mutual! Our collaboration is one of my favorite songs. https://t.co/8KXUMcUIEh .@dinahjane97 thank you for the heartfelt words and the unique song selection, see ya soon! https://t.co/M4YxoxISio .@djkhaled thank you friend for your kind words, I appreciate you so much! https://t.co/UcffZAy6z3 .@RitaOra you put a huge smile on my face 😃 good luck on the tour and see you soon!! https://t.co/qTU3bcUly9 .@Normani this really means so much to me to know my message comes through. Thank you beautiful. https://t.co/HzKE1KCpme .@jermainedupri a true friend, thank you for always having my back. https://t.co/bcq3QetzsN .@mistyonpointe YOU are an inspiration. You brought me to tears with your words. We must meet! https://t.co/ditk8j8i64 .@IAMJHUD Jennifer, thank you so much for everything and for helping me g.i.t! I love u!! https://t.co/k8kPPJDG5Q me thanking people. a thread. https://t.co/iJuV1WFBuB This is truly humbling 😢🙏 https://t.co/slBDBdbpyf RT @etnow: Mariah Carey left us with an uplifting and inspiring message at the #BBMAs https://t.co/OkWDa5YaFy RT @enews: Mariah Carey is a legend. #BBMAs https://t.co/9FDJMxDlng https://t.co/vcw6hf8hjQ RT @sesac: \"I started making music out of a necessity to survive and to express myself and I just wanted to create something so I could fee… @pebbles2day 🙏 thank you so much @pebbles2day RT @pebbles2day: Congratulations @MariahCarey What a beautiful and heartwarming speech. 🦋\nYou are SO deserving of this honor... You have wo… Toss the tissue 🗳 is the new drop the mic 🎤 https://t.co/nxg0o8Vyt4 I really did realize a dream tonight. 🙏Thank you @billboard @bbmas #lambily ❤️ #fullcircle https://t.co/ao7mzJCWrK TONIGHT 🦋🦋🦋 @bbmas live at 8/7c on @nbc #bbmas https://t.co/qEAHlE1E3T Dahhlings!! 🦋 Lil' excited lil' excited to perform tonight on the @BBMAs stage! @shazam my performance to unlock some super special BTS footage from the “A No No” video shoot 😘 It's payback time 🎉😂💖 https://t.co/GQTI1AFMtu https://t.co/Ger07s7DwF Laser tag extravaganza!!!  The festivities continue!!!  🔫🎊🎉 #RocnRoe #HappyBirthday https://t.co/2ZUuDpM89L https://t.co/FHu1Ad9aZA https://t.co/U3ZFqkhH6f https://t.co/ug6nFNob16 Happy birthday Roc and Roe!!! You are my everything 💕💕💕 and even though you're turning 8 today (how did that happen???) You'll always be #dembabies 😍 thank you for showing me the true meaning of love ❤️ https://t.co/P50woNxZBk And I'm so blessed to have you there. Thank you my friend 💖 #BBMAs https://t.co/SU6nt0wz7T Excited to be returning to The Colosseum at @CaesarsPalace, with All I Want for Christmas Is You in November 🎄⛄ and back with The Butterfly Returns in February 🦋🎙! For tickets &amp; all dates visit https://t.co/iCGLcnrLHj 💝 https://t.co/235Ac4urMk Got this while at rehearsals for the @BBMAs. Pretty darn cool 😊🙏💕 tune in for my performance on Wednesday at 8/7c on NBC! #TimesSq #NYC #IconMariah https://t.co/I8HL6iZv2S Honey, if @Oprah wants to rewrite my lyrics it’s “fine with me!”(Said like Miss Sofia from the Color Purple)🤩💜 https://t.co/Ml1qFXG9cr I frigging love this!!! 😘😘😘 4 tickets to the Billboard Awards are yours if you want them! (And thank you @RocNation ❤️❤️) https://t.co/0K1IZrDKz1 Less than a week until the @BBMAs and I couldn’t be more excited to share my custom #BBMAs x @UnfoldHQ template with you! Download at https://t.co/doFxIET0LS and tag me in your creations! https://t.co/JoVh8RRljU And I'm dying for ya, crying for ya, I adore ya! (Sung like Honey, a Billboard #1 😉) Seriously though, thank you @billboard @BBMAs for the attention to detail, the impeccable selection of contributors, for actually giving a *bleep* (choose expletive of choice), for all the hard work putting this together and for truly getting me! ❤️ This is the best piece of literature since War and Peace https://t.co/VF1kUyGWTO Noo dahhling! There's only so much time in the show!! https://t.co/d1lmm53rFq Come see me pon de Curaçao North Sea Jazz Festival on August 31! Tickets are available @ https://t.co/lMmkNDW5XY https://t.co/lPfqXgzy9r Want to meet me backstage? I want YOU to be my special guest at my Caution show in Bordeaux, France! Flights and hotel are covered, plus it’s all to support a great cause. Enter here: https://t.co/8mNErEN34V https://t.co/rwL9NkNssC I approve the song selection! (literally) https://t.co/7gONX7NWld One week to go 😲🦋😊 @BBMAs #BBMAs #IconMariah 🎙 https://t.co/fPOa1bNEEY RT @allidoislovemc: #OTD 1999 @MariahCarey was recognized at the Congressional Award Gala with the Horizon Award for her charitable contrib… Major Game of Thrones spoilers....\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n. https://t.co/NgJ3FTqTPH Eggactly!!!! #HappyEaster https://t.co/LxYAjXBhvd Sri Lanka, my heart is with you. I'm praying for everyone affected by this horrible tragedy. Stay strong ❤️ Waiting for my friend the Easter Bunny!!!! 🐰 (pre festivities celebrations 😉) https://t.co/tFavaLsKUN I've been trying to tell them!!! And yet they still don't know lol https://t.co/IPWXLcjsZi Some after school activities 🥰 https://t.co/6wlKKBLQen Now you guys are just toying with me because you know I love a good princess moment 👸 https://t.co/K4DT373l6Y I remember this moment.. the camera operator was a lil close Lil close..! 😉 #fondmemories https://t.co/FK4BcuebEc I hate to put everybody back in Math class but watch this hilarious response to Rocky's multiplication tables shenanigans 😂 leaving their teacher shook! https://t.co/XydQT6cK6c Just kidding it was my earring that fell on the stage 🤫 Fan fiction... He only gave me a dime! https://t.co/7I2uSOaQcy Happy birthday @sosobrat 🥳🥳 typical Aries! https://t.co/G2Ehjdve4k @kyletblaine Lol!!! I have a friend born on the same day, always love a Leo but I'm not mad at you for migrating to the Aries lair 😂💖 @yashar @kyletblaine @KFILE Happy birthday Kyle!!! 🥳😘 Oh dear, here we go again https://t.co/oVY99zG4hT The fan fave poll 💝 #TEOM The singles poll! #TEOM #fbf The Emancipation of Mimi 🦋 4.12.05 🦋 #lambily what's your favorite song from this album? https://t.co/x7eG77cBQh What a mindblowing experience 🙌🙌🙌 The entire show from start to finish is riveting. Thank you so much to the entire cast and crew at @HamiltonMusical for welcoming us with such warmth🙏💞 Happy birthday @bryantanaka!! ❤ https://t.co/UTv9PBrXwj @_mandygonzalez @LexiLawson @HamiltonMusical You guys were incredible. Thank you Lexi for coming to meet me! Thank you all for the great energy 💖 Hey girl hey! Can't wait to see you there! 🎙🎉💕 @BBMAs #BBMAs https://t.co/Y7p2D5kvXg RT @MariahTrends: Happy 14th Anniversary to @MariahCarey’s THE EMANCIPATION OF MIMI! \n\nLast year, the best-selling album was named one of t… 😲🥳😢☺😘🙏 Thank you so much @billboard @BBMAs. See you May 1st!🎙🦋💕 https://t.co/TW4HL6toWX I know right https://t.co/aU7BHm9VIg Whisk me away dahhling https://t.co/hZBiLv2kxc Same https://t.co/8WsxL44vWt It's a wrap on the N. American leg of the #CautionWorldTour ⚠🎉 I had the most incredible time, sharing special moments with my #lambily 🦋💖🌟 I would not be able to do this without all the amazing people on the road with me -as seen in this video! Next month- EUROPE!!! https://t.co/n2233gpwOZ RT @Barrowboy77: Nope, don't sleep on this bop from @MariahCarey feat #Shawni. \nIt's a tune! Pure Fire 🔥 \nThe tone. The lyrics. The sample.… RT @Essence: So...when are we getting a @MsPattiPatti and @MariahCarey tour? https://t.co/ei7ctduSOh A fun moment with @MsPattiPatti singing #WithYou ❤️🎶 #CautionWorldTour https://t.co/YpZiuX93qS When the kids are on their bye-pads 😂🤦‍♀️ #aNoNo https://t.co/8pC1DDyXDt RT @MikeAdamOnAir: The “A No No” remix by @MariahCarey featuring #Shawni hit #1 on US iTunes (videos)!!! Congrats #MariahCarey! Click below… RT @EverettJohn: I would like to report the new #ANoNoRemix is out, and yes, it features the new ⁦@MariahCarey⁩ high notes 🤩👯‍♀️✨💜 https://… Get on the #ANoNo train with Shawni and me! New remix is out now everywhere 💜🦋🌠 https://t.co/lsA8pWABtN @Vevo A NO NO 🔥 NEW Remix ft. Shawni @ Midnight 🔥 Video @ 3am ET 🔥 https://t.co/2orOTlzCMk With the incredible, incomparable, one and only- Ms. Patti LaBelle!! 💖💖💖 Thank you Patti and all of you who came to see the #cautionworldtour in Philly last night! 🦋🎉 https://t.co/yroLPZpJW2 Quebec city, I am headed your way to @festivaleteqc ! Tickets on sale tomorrow, 4.4 at https://t.co/ZNktHTZYug - get ready! #feq The #CautionWorldTour continues tonight at the @HardRockHCAC 🦋 only a few more shows in the North American leg! #cautionworldtour #justiceforglitter \n📸 Vlad Grach https://t.co/70RnvXu0SG Living for this!!! 💖🐑💖🐑💖🐑 thank you my talented lambily!! https://t.co/YOlVSWv5fE 😭❤️❤️❤️❤️❤️❤️ thank you my lambily. I appreciate you more than you'll ever know! 🦋 https://t.co/bJdUbvkX5G Thank you for making today so incredibly f-e-s-t-i-v-e!!!! 🥳💖🙏 #327 https://t.co/OjCUll3Nul Silly strings shenanigans 😂🥳 @kristoferbuckle @BryanTanaka https://t.co/wZEyPgejvE 3.27 💖🦋 I love you so much, thank you everyone for the anniversary love 😘 https://t.co/kQurBIc3Up Happy birthday/anniversary to all my fellow March Aries divas! ❤️ https://t.co/0Ynz3HMSqW Still laying up in bed, it's 3:27, my body's longing, why ain't you calling? NTT 327 😘 There's no place like home 💖 thank you NEW YORK for your energy last night @radiocity! Thank you to the legendary @therulernyc and the incredible Dev Hynes for performing with me and \"giving me life\"!!!🔥 #nyc #cautionworldtour https://t.co/h0XaTL6GCp RT @slmxny: THE WHOLE MARIAH CROWD SINGING ALONG TO FANTASY... THE ENERGY AND FLAVOR 🥺🦋🤡 https://t.co/dp6O1Ano7n RT @RadioCity: “There’s no place like home!” The queen @MariahCarey returned home to NYC for a spectacular SOLD OUT performance last night… Next stop, NYC! Grateful for so many amazing moments with the lambily on the tour so far 💖💖 #CautionWorldTour https://t.co/etDjr8FkJL RT @Vevo: Watch @stefflondon join @MariahCarey's subway party in the \"A No No (Remix)\" video.\n\n▶️ https://t.co/HM1lzJy9f6 https://t.co/pUYx… RT @MariahTrends: It’s a movement! New #JusticeForGlitter t-shirts are now available at @MariahCarey’s store. ✨ https://t.co/E2l0lCNXQq htt… MC x DON ⚠️ A No No Remix ⚠️ Video out now @Vevo!! 🔥 https://t.co/ucQJUmILZz My #CautionWorldTour program is available now on the Mariah Store! https://t.co/8V5KZkhTEg 💖🦋 https://t.co/wE32p64YUk 💚☘️💚☘️ https://t.co/f5uD0IR0he Happy St. Patrick's Day!! https://t.co/CIWWCGfkYo #Lambily, did you get #ANoNo on @iTunes yet? Remix ft. @stefflondon is available now @ https://t.co/A2qhHML6YD 😘 RT @stefflondon: In JAMAICA 🇯🇲 currently listening to mariah Carey featuring me 😻🙏🏽❤️  #NoNo https://t.co/XWiZIjX4Lj Now playing #ANoNo Remix @Spotify 🎶 no no that's a no no! 🎶 https://t.co/WnJ0AzaszR #ANoNo remix is available on @AppleMusic! Steam now @ https://t.co/jVqfX1xt2F Get #ANoNo Remix @amazonmusic ! 🎶 https://t.co/bvOOKsleMM #ANoNo Remix 🔥ft. @stefflondon 🔥Download/Stream now @ https://t.co/JubZgqb1by 🔥 A No No 🔥 Remix ft. Stefflon Don 🔥 Out everywhere 3.15 🤟 https://t.co/vm0qfbcslV RT @RollingStone: Mariah Carey's \"A No No\" is a perfectly pitched diss track that shows off her sense of humor. Here's why it's a Song You… RT @FedeArielS: Parlez-vous français? I said NO #ANoNo #ANoNoMusicVideo https://t.co/w0eve0cgId @chrisazzopardi @glittering_mc @NewNowNext Glad you enjoyed dahhhhling!!! 🤗 Hee hee 😜 https://t.co/kTpGzoa3t6 😲😲😲❤️ https://t.co/TB1IFhXtd5 RT @lovelovejack: 7 Reasons @MariahCarey’s \"Caution\" Concert Had Me Feelin' Emotions https://t.co/NiaVQYedrQ @NewNowNext RT @ChicagoTheatre: Daydreaming about the incredible @MariahCarey show last night! #CautionWorldTour #MariahCareyChicago (📸: @AndyArgyrakis… Any day! Hopefully you'll forgive the days when I used to jump the turnstile 😳 It was only two or three times, I'll pay you back!! 😂 https://t.co/ImVYo3RkXW @bobbywomackhbf Lol 😂 @adoreyouboy @jermainedupri @sosobrat so so def remix!!! 🤣 my babies 😍 https://t.co/WOhjWUezHD a fave 😆 https://t.co/zmIGIr9PKH RT @givinmeIife: @MariahCarey do you like this poster for a no no? 💕💕 https://t.co/k0E6DbBBmZ RT @lzmbily: @MariahCarey Look my wallpaper of A No No video clip https://t.co/gw0xrjQUAi 🤣 living for the memes ! https://t.co/VyVoOJAfMM @britneyxmariah working on it profusely 😊 RT @people: Mariah Carey Drops Music Video for 'A No No' — See the Cute Behind-the-Scenes Snap with Her Kids https://t.co/nwnuYGwkdy RT @MTV: Obsessively watching @MariahCarey's #ANoNo video on repeat, hbu???? https://t.co/DzZsiGuIh9 https://t.co/4KtWfXmQk3 🎶that's a no!!! 🎶#anono https://t.co/J9Bk8WAojU https://t.co/kM50UvG61o True love is fanning your twin before walking on stage 🤣 #twinsforlife ❤ https://t.co/ZC06U4if2a Happy #InternationalWomensDay!! This is one of the greatest moments in my life. Thank you @Oprah for allowing me to be in the presence of some of the greatest women ever to walk the face of the earth ❤ Thank you to all the amazing women in my life and everywhere in the world 👸 https://t.co/o9GeAkln9f RT @MTVNEWS: .@MariahCarey’s #ANoNo music video is a train ride to starting the weekend off right 🎉  https://t.co/3XqD69uD27 RT @Vevo: PSA: If you're having trouble getting in touch with a @MariahCarey fan (aka Lamb) today, it's because they're too busy watching h… RT @GMA: .@GMA EXCLUSIVE: @MariahCarey's brand new song and music video #ANoNo is a YES, YES from us!!!  https://t.co/dCuujVag6a https://t.… A NO NO 🔥🔥 Video out now!! Watch now @Vevo #ANoNo \nhttps://t.co/J9Bk8WAojU RT @GMA: COMING UP ON @GMA! \n👇👇👇👇👇👇👇👇 https://t.co/kn9MPz0i8P 🔥Tune into @GMA tomorrow for an exclusive first look at my music video for A No No!!🔥 https://t.co/Gug2hfcoYV @kitrell_sims It really does exist, I promise now 😂 Thank you Louisville! ❤️ #LouisvilleSlugger #cautionworldtour https://t.co/X8PcaihUzN when you have to wait for Friday to watch the a no no video #aNoNo https://t.co/muipV5y2l4 RT @MariahTrends: The @nytimes names @MariahCarey’s #ANoNo as one of the Top 25 Songs That Matter Right Now: \n\n\"This new phase of R.&amp;B. is… #ANoNo 🔥 TOMORROW https://t.co/xPaqtVWYyh Come on #lambily, help me find this lamb!! https://t.co/0sp6PRNycX #ANoNo 3.8 https://t.co/5cZPyS3KDm RT @Lambilyofmariaa: This is why lambs are the best hahah #Caution 😂🔥💕 @MariahCarey https://t.co/uwIn50nFXg #CautionWorldTour ⚠️🎉  Merch available @ https://t.co/SQEjIv49hM https://t.co/2h4Dvblo4C RT @TheFoxTheatre: Take caution Atlanta 🚧💗 @MariahCarey is taking over the Fox TONIGHT! Secure Marquee Club access to enjoy early private e… What is your favorite part of the show? 💖 #CautionWorldTour The #Caution tour arrives in Houston tonight! ⚠️ Thank you so much, my #lambily, for making me feel so happy on the opening night of #CautionWorldTour in Dallas 💖💞\nWas a lil emotional, lil emotional on Portrait, but you guys helped me through it! 😭😘 https://t.co/827bViA1Nt RT @ThePavilionTMF: Wow, what a show from @MariahCarey! ✨\nThanks for following along tonight with the #CautionWorldTour kick-off! https://t… RT @itscamrunnn: @MariahCarey brought it tonight in Dallas! #CautionTour https://t.co/5AMZLkO8wq RT @idolator: Deep cuts from 'Charmbracelet,' a 'Glitter' tribute and all the hits. @MariahCarey's 'Caution World Tour' setlist is perfect:… #Lambily!! @TIDAL is giving away Caution World Tour tickets!!\n⚠️💛 Enter to win: https://t.co/wJjp3VsHQA https://t.co/uYAtRbtLQ2 Caution tour begins now!!! ⚠️⚠️⚠️\n#CautionWorldTour 🚧💗🚧 https://t.co/TYTEp12dVd ⚠️CAUTION World Tour 💫 Opening tonight 🎙️ Dallas, TX 🦋 #CautionWorldTour 💖 @ThePavilionTMF https://t.co/oVI0TAFkLX @liyahdabaddie I just said the same thing! 💖 this is me every time someone tries to wake me up!!!! 😆 #jillebeans https://t.co/B02hiKpPlt ⚠ #CautionWorldTour ⚠ Opening TOMORROW night in Dallas!!🥳🎉 #AYNAF 🎶 🎤 \"don't be bleak dahhling\" 🤣 (thank you Michaela's mom for the shirt!) https://t.co/rF1Dv4aHlE #CautionWorldTour ⚠️🎙 https://t.co/WMEcvKJ8GE RT @RIAA: 2 #Diamond albums, 7 #multiPlatinum albums, 4 #Platinum albums, 2 #Gold albums. Only ONE @MariahCarey #BlackHistoryMonth https://… 3 days to go!!! #CautionWorldTour⚠️ https://t.co/l2p848foJ3 #TheButterflyReturns @CaesarsPalace tonight!  Can't wait to see the #lambs on the last show of this run! ❤🦋🎙 Next stop: #CautionWorldTour ⚠🎉 https://t.co/Y7HKZcCTbo A true LEGEND with a truly beautiful spirit; Thank you Karl for so many precious memories.. honored to have known you. With so much love and admiration, Mariah ♥️ #KarlLagerfeld https://t.co/XZrzuQgC7b She is so cute!!!!! A future star! 💖 https://t.co/cPaNstJwvW @cequeendion @_mroan Lol @nickguillory Yes! Check my ig story! Demkids love being on dat stage! 😂😍 https://t.co/kALdV8F91W RT @wdcnlateoctober: SISSSS YOU BETTA SCATTTT @MariahCarey https://t.co/R7N4QoAVRD DemKids with a fun Valentine's Day gift from Daddy @NickCannon https://t.co/J38vte8hu9 Happy Valentine’s Day!!! ❤️💋❤️ @BryanTanaka https://t.co/iV7janTyhj That's not bleak,\nWatch @SchittsCreek ! https://t.co/83BEEDhdwz 😍😍😍 https://t.co/dReHTVZy93 @dedicatedtomimi @lovelovejack 💕 😂 I believe my exact words were \"No, dahhhhling! The coat is part of the ensemble!\" 💖 @TheEllenShow @RebelWilson https://t.co/ueH1JLmZPX .@TheChainsmokers of course I know you!! I love your song \"that's what makes you beautiful\"! 😂😘 https://t.co/CZsK0DzoYb Back in Vegas tonight!! Can't wait to see the #lambs 🐑 @ColosseumatCP @CaesarsPalace https://t.co/8CAB0NVpQO My Roe Roe 😍😍❤️💖💖 https://t.co/aWjNfhAmp1 @NathanWyburnArt the creativity 😯🤩 This is so great!!! thank you Tyler ❤️❤️❤️ https://t.co/hlRYpBGgv2 RT @billboard: Exclusive: @MariahCarey talks excitement for Caution World Tour in new video https://t.co/OUyvnS5BJT https://t.co/zn4bvVVoxD @lannizzle @LironD @SerKokayi I love it 👏💖 have fun!!! That's a yaaasssssss #lambily!!!!!!!!!!! #L4L https://t.co/QDajjIFgGR ⚠The #CAUTION world tour is coming to Europe &amp; the UK!!!⚠ HBF fanclub pre-sales are starting now @ https://t.co/iCGLcnJmyR 😘🦋 https://t.co/RFbu1hZiHB Excited to announce I'll be performing at Florence4Ever on June 8th! Come celebrate the marvelous city of Florence with @johnlegend and me at the Artemio Franchi Stadium. Tickets on sale Wednesday, Feb 6th @ 12:00 CET. For more information, visit https://t.co/tvbEbFv4oq https://t.co/PduZaDHpYm \"Tell me about it, studs!\" 😄 https://t.co/2n2KfkYHgg Thank you @DarrenCriss &amp; @jermainedupri for being such great sports on my @lsb tribute episode! 🎉🏆 Love you @llcoolj &amp; @chrissyteigen!! Thanks for letting me stand in the key light 😂 Watch #lipsyncbattle tonight @ 9/8c on @paramountnet! 🎙🦋 https://t.co/oiq2SF1lSC Living for the tributes from @DarrenCriss &amp; @jermainedupri on @lsb! Tune in for all the fun tomorrow at 9/8c on the @paramountnet ! #lipsyncbattle @chrissyteigen @llcoolj https://t.co/mwlO9mW27X C'mon JD... 🤣 @jermainedupri https://t.co/BfRE2cW2A4 RT @lsb: Emmy Award Winner, Golden Globe Award Winner...#LipSyncBattle Champion? @DarrenCriss is goin' for gold this week on our Mariah Car… \"I have decided to stick with love. Hate is too great a burden to bear.\" - Dr. Martin Luther King, Jr. #MLKJr https://t.co/sDhrWC5PCu RT @lsb: We're paying tribute to a true musical butterfly this Thursday on #LipSyncBattle! @MariahCarey @darrencriss\n📺: Thursday 9/8c on @p… Good morning ☺️ #SundayMorning https://t.co/gotE17wUxx Entering @LSB like... 🦋\nWatch my tribute episode Thursday 1/24 @ 9/8c on @ParamountNet! https://t.co/5Dwy6ANdf5 I don't get this 10 year challenge, time is not something I acknowledge. 🤷‍♀️ *Picture taken at some point prior to today https://t.co/f5XUye3Hot A rare moment of me in (soft) punk 😄🤘🎸 #tbt https://t.co/NLFSnRCHKj Ummmm... I think Rocky’s been liking my own insta pics .. oh dear.. trying to rectify this!! lol -yikes! 🙌🙌🙌😘🦋 thank you my #lambily https://t.co/frqrLXNomP https://t.co/92dPgr0HFj Happy birthday my love 😘 sing your a** off😜🎤 https://t.co/YgNdGaQmHc https://t.co/2teiAnOlPz 🌊 https://t.co/iouhFcyXcm Thank you for warming my heart with such a beautiful story ❤ I'm so proud of all of you and wish I could have been there in person to show my support! ❤🏳‍🌈 https://t.co/6Qiot4ygF6 RT @WORLDMUSICAWARD: #MariahCarey begins 2019 atop the Global Track Chart with #AllIWantForChristmasIsYou!👏1⃣🌎👩‍🎤🔥👑 @MariahCarey \nhttps://t… RT @UKAsh: Those of you who are keeping track of @MariahCarey's #AllIWantForChristmasIsYou momentous Christmas! Been No.1 in 14 countries!!… I couldn't have asked for a better way to ring in 2019 than performing in such a magical place! @NikkiBeachWorld I'll be back ❤️ #CelebrationOfLIfe #ForeverYoung https://t.co/CF4clahWXd Can't believe this. 😮\n\nStill can't believe this!!! 🤯🤯\n\nWOW 🙏 Happy 2019!!!!!!! 🎉🥂🎊❤🦋🎅🏼🙌 https://t.co/nAY0fZuy2T You guys are the best!!! 💖 Thank you for all the support 🙏 @idolator https://t.co/URBU4C2aqD RT @ARIA_Official: Twenty four years after it’s initial release,  All I Want for Christmas Is You by @MariahCarey, lands at #1 for the firs… RT @WORLDMUSICAWARD: #MariahCarey sets new UK chart record for most streams in 1 week as #AllIWantForChristmas racks up 15.3 million plays… RT @officialcharts: A very festive moment: @MariahCarey's All I Want For Christmas Is You returns to Number 2 on the Official Chart and cla… RT @musicnewsfact: \"All I Want For Christmas Is You\" by @MariahCarey has now officially surpassed 1 BILLION streams worldwide!\n\nThis makes… Filled with gratitude and wishing everyone an extra special extended Christmas season 😘🎅🏼❤️🎄 https://t.co/GxNIy6DbA8 RT @billboard: The 10 best R&amp;B albums of 2018 (critics' picks) https://t.co/VTCOuXCpWf https://t.co/WDRgah4nTa My favorite moment of the year ❤️ Looking forward to all the festive moments in 2019 ☺️ https://t.co/rSva5VX0vw ☺️🎄💖 #MerryChristmas https://t.co/ocPwF4LpyO 🎄MERRY CHRISTMAS🎄I am so grateful for all my blessings this year🙏🏼 I am so thankful for having loved ones by my side - my family, friends &amp; fans❤️ I wish you all the merriest Christmas, may it be filled with joy, peace &amp; laughter!🙏 That's all I *really* want for Christmas!🤗🎅🏽 https://t.co/QdBSDO0gH3 Lol!!! We all know that's not true but I love you anyway 😘 Merry Christmas!! 💖💖💖 https://t.co/fHYiXzGKUY Sleigh!!! 🎄☃️🦌🎅🏼❤️🎶 https://t.co/6PfIzszrXW Wait... What?!  😳😳😳 https://t.co/C2zw3hGQeK Know this one? Retweet if you're listening to it today! #MerryChristmas https://t.co/VxjhgoggSu I will see you tonight! 🎅🏼 #ChristmasEve https://t.co/6mwuEehrxy Two horse open sleigh! ❄️☃️🎠 https://t.co/0bxG4V7WcV Merry Christmas Eve dahhlings, I’m kicking off the festivities with @TwitterUK at Piccadilly Circus! 🎄❤️🎅🏼 #AllIWantForChristmas https://t.co/pA8ghkRqTH Thank you Jason and Pat!!! Merry Christmas!! 💖🎄 https://t.co/n6vMwUEzZP RT @RatedRnB: 1. @MariahCarey, Caution \n\n“This no-fillers album is packed with ten solid tracks, all co-penned by Carey, that effectively s… Me: \"I won't even wish for snow!\" 🎶\nAlso me: https://t.co/cM64Cy7Wpn Thank you so much!! 💖 https://t.co/ImjInBsGcY Just got the #!!! We're gonna make it happen guys! #festive #callingfromaspen ❄️🎁🎄💖 https://t.co/D915e9keXh It’s almost Christmas!! Stream my album \"Merry Christmas\" on @applemusic @ https://t.co/5goW67SMot https://t.co/ebIcb926zb RT @PopCrush: ✨🎄 Queen of Christmas 🎄✨ @MariahCarey's classic #AllIWantForChristmasIsYou is currently the #1 song on both the Worldwide iTu… RT @MariahTrends: .@MariahCarey’s “All I Want For Christmas Is You” is currently the #1 song on Spotify &amp; the #1 song on iTunes. 🎄👑 #Stream… Wow 🤯🤯🤯 https://t.co/oZPoBmqPDk My official #MimiBot got a festive makeover ❄️🎅 Come chat with me, get your playlist and you’ll see what I mean 😉 Don’t forget to tweet me your playlists so I can listen!! https://t.co/GuxX6P6ARA @NIKOLI75 @tonsalltv I'm ready!! 😮🙏💖🥳🎄🎶🌈🎉 https://t.co/Ep2ic5d8Lv I had the most amazing time on my Christmas tour in Europe &amp;  wanted to share a glimpse of it with you 🦋💖 Join me on stage for the \"All I Want For Christmas Is You\" finale! Hope you enjoy it &amp; Merry Christmas!!! 🎄🎁https://t.co/DsuMSn5E37 @MissyElliott That's my girl Cha Cha 🐶😂😂 'Tis the season of giving, and I have a special holiday gift for you lambs! Enjoy up to 4 free months of @AppleMusic, on me 🎁 Redeem now: https://t.co/m3XXBm64uT https://t.co/WOCpHbcrP5 RT @TfL: Have you noticed some festive sparkle at London Bridge, Waterloo or Stratford stations this week? ✨\n\nWe’ve teamed up with Sony Mus… I know him! #tbt https://t.co/GTqNVkJZ8a RT @billboard: .@MariahCarey on biggest #Hot100 holiday hit in 60 years: \"This is the star on top of my Christmas tree\" https://t.co/jqJW04… #1?! Thank you @papermagazine !!! ❤️⚠️ https://t.co/LwKXX70cQZ RT @biillyjean: Can you imagine being so FUCKING powerful, that they change the sound of the fucking METRO ANNOUNCER TO YOUR VOICE!?!??!?!?… Checking in on the North Pole! 🎅🏼🤶🏼 https://t.co/nUWtnqLCEc Listen to my favorite festive songs on my 'Christmas Songs by Mariah' playlist, only on @AppleMusic. 🎶🎄💖 https://t.co/QXNWlcrZJo https://t.co/eg26xqPxdz Someone get me this family's phone number so I can call and say Merry Christmas!!! 🎄🎄🎄 https://t.co/ZRL2WPIJze Goodbye 2018, Hello 2019! Super excited to be performing at #NikkiBeachSaintBarth and toasting to the New Year with @NikkiBeachWorld! #ForeverYoung #CelebrationOfLife 🦋 https://t.co/IgoyMWr1pw Check out the festive Christmas playlist I curated for @iHeartRadio @ https://t.co/fnzuFmrQFK https://t.co/bUfzjDYPSV RT @iamjojo: Paying homage to the QUEEN @MariahCarey. Imagine being so dope you own an entire holiday season?!!!! Dedicating my version of… @kelly_clarkson 😯 End of tour holiday party in Madrid! 🎄💖 https://t.co/GSotpIyMvh Grab some hot cocoa and put on the 2018 @iHeartRadio Jingle Ball! The show airs tonight at 8/7c only on @theCW #iHeartOnCW #AllIWantForChristmas ♥️ https://t.co/EKoO7Cn5EF My step-by-step guide to surviving the holidays is on @GIPHY! ➡️ https://t.co/PZypC32bG6 https://t.co/DHS9gPPlgr Thank you to this amazing choir and everyone in Brussels for such a festive show last night!! 🥳💖 See you in Madrid on Monday for the last show of the tour! #MakeMyWishComeTrue https://t.co/u9eRur34ye RT @LironD: Slay, @MariahCarey. Slay. https://t.co/EP8XGotyrc ⚠️ Caution vinyls are starting to ship now! Available at  https://t.co/u99kuqnxTY ⚠️💿 #MariahCaution https://t.co/6yvHBTeMpa #Caution #Lambs https://t.co/ARhAUIJdiy Thank you @Deezer for making me the cover of your RnB Hits Playlist 📸💞 Listen here https://t.co/RzVVWyH1J3 https://t.co/q9vrcxVSnj Tea ☕ Glitter 🌟 Caution ⚠️ Merry 🎅🏼 Christmas! 🎄#2018In5Words https://t.co/AzKPO3Lzyp Backstage fun with Dem Kids!! ❤ I don't want them to ever grow up! 😭😭 https://t.co/nT5Im9oQNf RT @MariahTrends: .@MariahCarey’s All I Want For Christmas Is You enters @Billboard’s top 10 at #7 - a new peak 24 years after release. LEG… It's the most festive time of the year! Play \"All I Want For Christmas Is You\" on over 75,000 @TouchTunes jukeboxes across the globe.❄ https://t.co/XV7pXXwn4n https://t.co/CECdnUpGbx RT @lsb: #LipSyncBattle is back with @QueerEye, @BrooklynDecker &amp; @AndyRoddick, @BigBird, @DarrenCriss, a @MariahCarey Tribute, and more! S… Thank you for an amazing show London @TheO2!!! 3 more shows left on the #AllIWantForChristmasIsYou tour- are you coming to celebrate the holidays with us?🎄🎁🥳 https://t.co/2bUlcWIrPr ❤️ from London https://t.co/s9uvLrr0Ht 🙏🙏 #L4L https://t.co/mByx540IEq Listen to my favorite seasonal songs on my 'Christmas Songs by Mariah' playlist, only on @AppleMusic! 🎶🎄💖 https://t.co/QXNWlcaoRQ https://t.co/RfI1pFhSlE RT @pandoramusic: Get into the holiday spirit with some of @MariahCarey's favorite seasonal hits from Nat King Cole, Donny Hathaway, and mo… RT @YvetteCaster: It’s the @MariahCarey London show tonight @TheO2 so of course @allontheboard did this for those of us arriving by Tube 😊🦋… Can't wait for my Christmas show at the O2 tonight in London!!! It's so festive here @HotelCafeRoyal!! 🎄 https://t.co/WxjhBtfz4N RT @JanetJackson: #StandUp4HumanRights #WorldHumanRightsDay https://t.co/oBX65txnkp RT @TicketmasterUK: Check out these fantastic snaps from @MariahCarey's tour opener in Nottingham last night! Don't miss your last chance t… Saw a 🌈 in Paris as we were leaving 💝 https://t.co/q3Cq2Dnapx This is the greatest article ever!! Thank you for getting me into the Christmas spirit and making me laugh out loud 😂😂 Happy Hanukkah!!! 🕎 And MERRY CHRISTMAS! 🎄 https://t.co/rz68zJn0jh @DebbieGibson 😘😘🎄 Cheers 🥂 😂 @jimmyfallon https://t.co/a8qJ5FhNeW RT @billboard: .@MariahCarey's 'Merry Christmas' replaces her own 'Caution' at No. 1 on Top R&amp;B Albums chart https://t.co/76UqbhxEZT [via @… We made the A-List lambs! Listen to A No No on @Applemusic’s “A-List R&amp;B” playlist now 🤗  https://t.co/3MoASCqmcx Tune in to Cumulus Radio to hear \"Mariah's Favorite Christmas Songs\"! Find your radio station @ https://t.co/LmXXm1Fbuy https://t.co/TjtweLrcEy Warming up for the holidays 🎶🎄 https://t.co/La8LQ6PSEc 🎶 Joy to the World 🎶 in Paris! https://t.co/op6Qhe74CF It's bleaaaaak!!! 😩 https://t.co/mNjeWzWuLM It's one of my faves on the album 💖 @Timbaland love you guys! https://t.co/b1WV2Hi1kx Love you @heidiklum, you are so festive!!!! 😍🎄 https://t.co/asjN7C1iSj RT @fusetv: .@MariahCarey is and will always be the Queen of Christmas https://t.co/oSFDluMW82 Thank you to @tidal for showing #Caution lots of (real) love on their “Real Love” playlist! 💋https://t.co/keQwht4TZr Thank you to my friends at @spotify for adding Caution and A No No to their “Are &amp; Be” playlist! Go give it a listen https://t.co/luVjx59jyD 💕 I'm taking over The Sweat Hotel radio show tonight at 8pm ET playing fan requests, music from my new album #Caution, and other favorites. Tune in on the @iHeartRadio app &amp; @ https://t.co/Ci9XiKcGLP https://t.co/CvaArllvLH Watch my lyric video for A NO NO @youtubemusic #aNoNo https://t.co/F6rj5vySiH Silent Night 🎄 https://t.co/4gG1SoR8DJ Have you been to #TheMariahExperience yet? Revisit some of your favorite Mimi moments @SonySquareNYC now through December 7th! ❤🦋🌈⚠ https://t.co/byz9CRnaAn 🎶Ed Scissorhands, AKA I cut you off🎶Check out the lyric video to A NO NO @vevo #aNoNo #MariahCaution https://t.co/F6rj5vySiH RT @MariahTrends: .@MariahCarey’s ALL I WANT FOR CHRISTMAS IS YOU named @ASCAP’s Top Christmas Song for second consecutive year. (📸: Dailym… Michael, thank you for making my day with this beautifully written and moving piece! ♥️🎅 https://t.co/hRVyXHgunu Hear how I gear up for the holidays on @amazonmusic’s Today in Music. Just ask “Alexa, enable Today in Music”, then ask “What’s the news?” https://t.co/BCXesPL3EI RT @billboardcharts: On this day in 1995, @MariahCarey and @BoyzIIMen's \"One Sweet Day\" hit No. 1 on the #Hot100, where it spent 16 weeks. Ready to go on stage! Let the festivities begin 🎄🎶🎄 #MakeMyWishComeTrue https://t.co/2sLjve9YAJ Ready to start my European Christmas tour tonight in Stavenger, Norway! ❤️#MakeMyWishComeTrue #AllIWantForChristmas 🎄🎅 https://t.co/RjBFo4NcNH @TheOnlyMayhem ♥️ Writing our letters to Santa! It’s a big moment!!!🎅🏼 https://t.co/uNiNHgrCRJ Tune in tonight for my interview with Delilah TONIGHT at 9:30pm EST on @iHeartRadio &amp; @1067Litefm! #MariahCaution https://t.co/VLYDQHZElz Can't wait to see you and everyone in Europe! Headed to rehearsal in Norway right now ☺️ https://t.co/lp2rztNkbf RT @MTVMusicUK: The countdown to Christmas is officially on here at MTV HQ! We’re celebrating with @MariahCarey’s classic Christmas album &amp;… RT @billboard: .@MariahCarey's 'Caution' debuts at No. 1 on Top R&amp;B/Hip-Hop Albums https://t.co/BMlCfx3nMh [via @billboardcharts] https://t… RT @pitchfork: There is only one Mariah Carey https://t.co/U1AVBy6yyV Roc &amp; Roe have been practicing the background vocals to \"All I Want For Christmas Is You\", we're gonna take this one step at a time - we're very excited about it! It's our first video doing this! It's festive, Cmon!! 🎄🎶🎄🎶💖 https://t.co/ddlzCtwT3d RT @alexgfrank: Shared a really good bottle of red wine with @MariahCarey and it got real ! https://t.co/FuQmiE4hRz RT @MariahCareyAU: Congratulations @MariahCarey! ‘All I Want for Christmas Is You’ has now spent 50 weeks at #1 on the Billboard Holiday Di… Tune in to 106.7 Lite FM at 7:10am EST for my interview with Bob &amp; Christine! @1067litefm @LiteFMMornings #MariahCaution https://t.co/eSAKEkLAqc Getting into the holiday spirit with @AmazonMusic! #AlexaPlay holiday music https://t.co/ezpLKhRVxq https://t.co/lQT4MySCwR Sat down with @Genius to talk about certain aspects of my career, such as songwriting and deep album cuts, that often go unnoticed. I can't thank Genius and @RobMarkman enough for giving me the opportunity to do so! ❤️🦋 https://t.co/MgUyOfrOBh RT @champagnelali: happy to announce i'm now contributing to @ForbesEnt! for my first piece, i wrote on the queen @MariahCarey and how her… RT @billboard: .@MariahCarey puts a 'Caution' warning on her cleavage in response to funny tweet https://t.co/94Q6vnMj41 https://t.co/IupRm… RT @minasaywhat: Interview: @MariahCarey Talks Being The Pioneer To Feature Hip Hop Artists On Pop Songs, Glitter Going #1, Being On #TheVo… @mikewassmusic thank YOU! RT @MariahTrends: .@MariahCarey’s “All I Want For Christmas Is You” now #7 on iTunes - it’s highest peak on the chart since at least 2005.… 😂 https://t.co/1oj9V7k36S Here's what you missed lol https://t.co/R9Mj3GXH2d @PeripateNic wow thank you for this!! @Lila_Punct thanks Lila ☺️ #MariahCaution https://t.co/FLrZPfSMYs #Caution 🔥Available Now 🔥https://t.co/noxGeYiwck https://t.co/mZ0JffWw0E Kicking off the season with @AmazonMusic in Times Square baby! Who’s feeling festive? #AlexaPlay holiday music https://t.co/ezpLKhRVxq https://t.co/nwZhIqbRiI The foodies on Thanksgiving! 🦃😂 #HappyThanksgiving https://t.co/BrUderuUER You continue to shatter boundaries and amaze us with your unparalleled talent and I'm so honored to have been even a small part of your journey. ❤️❤️❤️\nP.S. Lambs, go see @thenutcracker if you haven't already! Dear Misty, thank you so much for acknowledging the lyrics and the songs that I've written throughout the years for those of us who needed to hear them to feel encouraged, myself included. Your achievements are so incredibly inspiring to me and millions around the world... https://t.co/TL5YoOpeiA RT @RollingStone: Mariah Carey made her best album of the decade by embracing a new way to work https://t.co/ZYkMbmNOgF https://t.co/apxgES… RT @TRL: i cant stop thinking about @mariahcarey jamming out in an elevator with her fans AND i cant stop listening to #mariahcaution but i… RT @MissyElliott: @MariahCarey Your album is Snapping🔥🔥 &amp; i am honoured to be able to say I’ve had the chance to work with you because you… Happy Thanksgiving, everybody! 🦃 Let's be grateful for all the blessings in our lives this year and every year. In addition to that, I want to thank everyone for an amazing #Caution release week! Love, Mariah ❤ https://t.co/91VrUfgD63 Jason!! Thank you for that epic segment on ET live! You really made me smile, thanks for bringing the receipts 😂😊💕 @etnow @jjcforever https://t.co/rn2QGNIAgX RT @pandoramusic: ‘Caution’ is here. @MariahCarey’s 15th album is filled with R&amp;B-tinged winners, from her gorgeous pop ballad “With You” t… RT @AppleMusic: Get yourself some @MariahCarey in your life. Listen to #Caution.\nhttps://t.co/LszS0gTIk6 RT @amazonmusic: Here for it.\n@MariahCarey, #CAUTION https://t.co/XIPRyaf9cW https://t.co/RiA6iG5TRQ My new album CAUTION is available at Target for $7 only through black Friday! Pick it up now at your nearest Target store 🔥 #MariahCaution https://t.co/Uqr49HZTO0 Lol!!! Love you 💖 https://t.co/B4g2E8bxVT RT @MariahCareyITA: Mariah's most critically acclaimed album ever #Caution keeps getting great reviews!\n\nYou won't miss it: https://t.co/3v… RT @BAHjournalist: Can we talk about how fun @MariahCarey's promo tour for #CAUTION has been &amp; how much joy it's given me and the Lambily t… Catch my interview on @LiveKellyRyan at 9am on ABC! #Caution ⚠️⚠️⚠️ https://t.co/xKupb9776v Tune in to @Z100NewYork at 8am for my interview with @elvisduran @ElvisDuranShow\nI really want that golden microphone!  #MariahCaution https://t.co/1TPNoOWbeM Tune in to @1035KTU now for my\ninterview with @PaulCubbyBryant &amp; @TheRealCarolina! https://t.co/sblMVEUbZ8 Check out my interview with @DJSussOne &amp; @Power1051 right here @ https://t.co/BGwcSqp5DG #MariahCaution Lambs, join me this Wednesday 4pm PST in the Beat Fever listening party for #CAUTION! I’ll be answering your questions. https://t.co/NlG8ia3ucp https://t.co/z30MArxR4U YOU are LEGENDARY. You've written some of my favorite songs of all time. I've always loved and respected you. I will never forget when we wrote Babydoll in that hotel suite 😂Congrats on the songwriters hall of fame nomination. Whyyy must we be nominated on the same year? lol❤️❤️ https://t.co/dsoYsjoK6s love you!!! 🙏😘❤️ https://t.co/LbAOUtmDtO thank you so much, right back at you!!! ❤️ https://t.co/e2C5xUKkcX Bibi, dahhling!!! I can't help talking about you-- I loved our collaboration! You are more than fabulous and I know what it feels like when people try to bring you down. You've more than surpassed all expectations. Love you love you love you!! https://t.co/So5kwwxsd8 @nessnitty @KarlFergusonJr Love you!!! and that jacket dahhling, chic!!!! RT @nessnitty: Queen. Icon. Respect. ❤️❤️❤️ You Already Know ‼️ @mariahcarey #caution out now 📸 @karlfergusonjr #lamb #lambily https://t.co… Get me Ed Shapiro on the phone, case closed 🎶 @ezclimb in the flesh! #ANoNo #MariahCaution https://t.co/45kDL67ZIt RT @MusicChoice: .@MariahCarey says #Butterfly is still her favorite album and more on the newest episode of #DeleteOrRetweet! #MariahCauti… RT @etnow: 28 years into her career and @MariahCarey delivered one of her most iconic albums ever with #Caution. The #Lambily is living for… Check out a preview of my interview with @1035KTU @ https://t.co/Ul1DMkDgAB\nMy interview with @PaulCubbyBryant &amp; @TheRealCarolina airs tomorrow at 7:20am! Pick up Caution for only $7 at all Target stores now through Black Friday!! #MariahCaution https://t.co/kIm4laQz1x https://t.co/olWuaCB6qk New additions to the #MariahCaution store! The limited edition Caution picture disc is available only until 11/22! Buy now @ https://t.co/Z1dnMPFfyF https://t.co/8MXiSsb7CL Now that you've heard my new album #Caution, be sure to get tickets to the CAUTION WORLD TOUR starting Feb 27 in Dallas! Tickets available at https://t.co/iCGLcnJmyR #MariahCaution https://t.co/FAPWeiRPGR RT @BravoWWHL: Hey, West Coast! Looking for the AFTER SHOW with @MariahCarey? Watch here! https://t.co/Kddx2Cc226 @PCBSNews19 @AaronTheNewsGuy 😂 RT @AaronTheNewsGuy: On my drive home for Thanksgiving I listened to @MariahCarey. I’ve always known her voice is incredible, but this time… Tune in to @BravoWWHL tonight at 11pm to see my #MariahCaution interview with @Andy! https://t.co/o0fDysgfZs 🙏 https://t.co/4YIErh0RE9 @benlewishere @jpbevi @Genius @RobMarkman Lol!!! RT @BravoWWHL: TONIGHT at 11/10c it’s #WWHL w/ the iconic, skinny, elusive, legendary, queen, etc. @MariahCarey! https://t.co/QwbdEiISSA RT @1067Litefm: It is officially the most wonderful time of the year! 🎄✨ Here's a look behind the scenes of the LiteFM Switch to 24/7 Chris… Sporting my Mimi pin while looking at the limited edition of #Caution ⚠️ for the first time! Get both at the MC Caution store! 💖🦋 https://t.co/eWBB25Dhj4 https://t.co/D15Vc7cL9p RT @pandoramusic: \"There's a lot of different types of songs on the album ... I tried to make a little bit of something for everybody,\" say… RT @BravoWWHL: Relive some of our favorite @MariahCarey moments before tonight's show @ 11! 🦋 https://t.co/eqGmldGxu4 Lambs! What’s your favorite track on #CAUTION⚠️💕 ? Listen on @TIDAL: https://t.co/zRmR9yIyRU #MariahCaution https://t.co/OYOSoinCOc RT @GMA: Pop icon AND super mom?! @MariahCarey can do it all -- including taking her kids on tour! #MariahOnGMA https://t.co/W1vUNMab63 htt… RT @GMA: If anyone needs us, we'll be listening to @MariahCarey's new album 'Caution' all day. #MariahOnGMA https://t.co/gnk9RPtELC RT @adrianampratt: Jumping into the holiday week like .... #MondayMotivation \n\nCC: @MariahCarey @michaelstrahan @GMA https://t.co/Z99kyPtqBO #MariahOnGMA @GMA https://t.co/vhbcBHg3yY Early morning on set @GMA https://t.co/hzGDnkVzn0 RT @GMA: COMING UP: MUSIC LEGEND @MariahCarey performs live on @GMA! It feels like a sweet fantasy! GET READY, AMERICA! #MariahOnGMA https:… Thank you @nessnitty for being so festive and for such a great interview!!! 😘 https://t.co/PMzbUrbnkX RT @Missinfo: Watch @MariahCarey and @tydollasign perform \"The Distance\" on @FallonTonight: https://t.co/kXHR4yGubP  https://t.co/BeAwDJfjxC Hope you all are loving #Caution!! 😉💖 Make sure you give my official chat bot a spin and I’ll make you a personalized playlist! 😃 Love you, lambs! #MimiBot https://t.co/GuxX6P6ARA https://t.co/vCFK8klmWc #Portrait thoughts @MusicChoice #MariahCaution https://t.co/L4jGO1ssTT CAUTION taking over Times Square! Thank you @spotify 😘 Stream the album now @ https://t.co/D2lfZYu70y #MariahCaution https://t.co/Heo9o2NNbn Thank you beautiful 😘 https://t.co/Ff2zL7dzVI RT @tufayel: Mimi still has it. @mariahcarey https://t.co/3qmbdfpBbY I love you!!!❤️ https://t.co/uTXQFJRbUT 👀😲 Thank you 🙏❤️ https://t.co/spbiO0Nf7C Tune in to GMA tomorrow morning on ABC for a live performance from my new album Caution! #MariahOnGMA #MariahCaution @GMA https://t.co/eaeixxc5Vh Pre-order an exclusive blue vinyl version of my new album Caution at https://t.co/r4Ik4lYRIK #BNVinyl #MariahCaution #TheMariahExperience #SonySquareNYC #MariahCaution https://t.co/EOLFcDdmwA Lambs, my new album #Caution is out now!! Go Stream it on @Amazonmusic ✨✨ https://t.co/CdR34hR7CY https://t.co/P0DSjlj6qS RT @youtubemusic: The Queen has returned 👑 Play @MariahCarey’s Caution now on the new YouTube Music app → https://t.co/fxkQwXo5gA https://t… Tune in to see me and @tydollasign performing THE DISTANCE at @FallonTonight! 11:35/10:35c on NBC! #MariahCaution https://t.co/jTPrBiuNma My new album #Caution is OUT NOW on @applemusic!! Love my #lambily https://t.co/3KlSU4D5I9 RT @kingsleyyy: Having the longevity to release 15 albums is an accomplishment in itself.\n\nTo have your 15th album be a solid body of work,… RT @TRL: .@mariahcarey and whitney houston had an ICONIC matching moment at the 1998 VMAs that i think about constantly. mariah's new album… S-P-I-R-I-T it's great to see!! Check out the lyric video for THE DISTANCE ft. @tydollasign #MariahCaution @vevo https://t.co/VwR5CsEDLN See you on Monday @GMA!! #MariahOnGMA https://t.co/4wWVFoPQ0u RT @Spotify: It's @MariahCarey season. \nListen to #Caution now. https://t.co/cA0z21d5aU https://t.co/YLFMlsOFPr You know what to do.. don't be Bleak! @MusicChoice #MariahCaution https://t.co/enhNqLvJV9 Happy #Caution day!!! Get the album @ https://t.co/noxGeYiwck and tell me what your favorite song is! See you tonight in New York 🔥💕 #MariahCaution #sonysquarenyc #themariahexperience @sonysquarenyc https://t.co/OFUnztMM1x RT @peopletv: .@MariahCarey's new album #CAUTION is out now! In honor of the release, we want to see your favorite #MariahCarey GIFs. Send… RT @FallonTonight: Tonight on the show: Benicio Del Toro! Plus, @MariahCarey is here to talk and perform ft. @tydollasign, Jimmy writes out… RT @TRL: the QUEEN @mariahcarey is on #TRL right NOW on @mtv i am SHAKING https://t.co/Du1pmTkcBZ 8th Grade #MariahCaution https://t.co/PlpDcGdKv4 Yassss listening to it in the car now!!! #MariahCaution https://t.co/XjJIaChjSK RT @mrdoc: Listening to @MariahCarey’s new album #CAUTION but this track “Giving Me Life” is GIVING ME LIFE! The production by Dev Hynes, t… RT @leo_richardson: Let’s take a moment, please. @MariahCarey has NOT ONE, but TWO ALBUMS in the top ten, OKAY. #MariahCaution #JusticeForG… RT @MariahTrends: \"Feelin' myself like I'm Norma Jeane…” 🔥 #GIVINGMYLIFE #Caution #MariahCaution @MariahCarey \nhttps://t.co/hFCagkkQ7Y http… #Lambily how do you like my pink caution emoji! #MariahCaution https://t.co/noxGeYiwck #CAUTION 🔥🔥🔥 OUT NOW!!! #MariahCaution https://t.co/noxGeYiwck https://t.co/ExSZTaT4K4 RT @TwitterMusic: Over 37,000 Tweets later, #JusticeForGlitter has been served! ✨\n\nTwitter Lambs know how to rally. https://t.co/06FqrwskUq RT @TRL: 🚨THE ONE AND ONLY @MARIAHCAREY IS ON #TRL TOMORROW @ 8 am on @MTV 🚨 https://t.co/XMu3ZBJc2s Bringing #CAUTION to TV! 📺 @trl @FallonTonight @GMA @BravoWWHL @LiveKellyRyan https://t.co/vujOd9YGxX Lambs, I’m SO excited to share with you my official chat bot!! Come chat with me and I’ll give you a playlist just for you 😘😘Hope you love it ♥️🎶 #MimiBot #Caution: https://t.co/GuxX6P6ARA https://t.co/oiHxwYn9ON @PadmaLakshmi @iTunes Hilarious!!! 😂 First snow of the season in New York!!!! Festive!!! ✨✨ https://t.co/YeFwMZpwOb I love you Malaysia!!! 🤩🤩 #Lambily #Caution https://t.co/rX9iM7kWf6 Singapore in the house for #Caution and #Glitter 😍😍🤗 #L4L https://t.co/swJn5DZ6HU #Caution in Thailand!!! You guys are making me so happy 💖💖😘 https://t.co/BOVsgW8E8c Yassss Taiwan!!! 💖😊⚠️ https://t.co/eqdqoGRs0j Mahal Kita Philippines!!! 💖💖💖 #CAUTION https://t.co/nSn0c8u9ev It’s the most wonderful time of the year!🎄Join me and @1067LiteFM as we flip the switch to #Christmas music THIS Friday at 5PM #1067LiteFMChristmas📻 CLICK THE LINK 2 LISTEN:https://t.co/NBUdgzgZrv #Caution is almost here!!!! Is everyone ready to play it at midnight?? ⚠️⚠️⚠️ https://t.co/noxGeYiwck https://t.co/3sJCGXyrfd #Caution is coming soon!! Grab your Echo and ask Alexa to “Follow Mariah Carey on Amazon Music” to be notified when it’s here! 💕 https://t.co/0a9c8O93ih https://t.co/Sd9ndBd4Og Good news to start the day 🙏🙏😊🔥⚠️ https://t.co/p6uqQey4sb I have to dedicate today's #tbt to Glitter, which is currently #1 on the iTunes albums chart, 17 years after its release and on the eve of my new album release! My fans are THE BEST 💖💖💖 #JusticeForGlitter!! LET'S GO #CAUTION⚠️ https://t.co/i2v8Zkp1oy 😱✨💖 https://t.co/IpEqxQTGq7 ⚠️🔥💣 https://t.co/bK7J7qcMZL #8thGrade #Caution @Genius https://t.co/heet0C6T9d #TheRoof @Genius https://t.co/gSpVR6F366 I CAN'T EVEN KNOW WHAT TO SAY #JusticeForGlitter https://t.co/yuI5eigp8V ❤️❤️❤️ #caution on @mtv @trl 11/16 @ 8am https://t.co/s3TFLEw1Qk #Caution @pandoramusic ⚠️🔥 https://t.co/ksPpIsfoIV #Caution 11/16 @SIRIUSXM @CaymanKellyshow https://t.co/asSBbf1Kni Ran into @Andy &amp; @SandraBernhard at @SIRIUSXM! Gotta proceed with #Caution in these halls lol 😂 #JusticeForGlitter https://t.co/lc1JutbkUr RT @idolator: A moment of healing for the Lambily (and for the nation as a whole). @MariahCarey's 'Glitter' soundtrack is currently #6 on i… RT @DustinCL: I owned the old school CD. Now I have the digital copy. #JusticeForGlitter has pushed this @MariahCarey gem to No. 5 on iTune… 🎄 I hear those sleigh bells ringing!\nI can’t wait to spend a beautiful Christmas evening with you all.\nTickets for my European Christmas Concerts are on sale now! 🎄 https://t.co/nBMgcNmIN0 @NathanWyburnArt @EverettJohn Love it!! Not sure what's happening but I love it! The lambily is amazing at getting #JusticeForGlitter 💕✨ https://t.co/VYt2OsEXze RT @MCareyPH: Yes ladies and gentlemen, GLITTER IS NOW NUMBER 1 on the iTUNES PHILIPPINES ALBUMS CHART. Congratulations Queen @MariahCarey… ⚠️🔥 https://t.co/xEVEPvy6kA #JusticeForGlitter 😉 https://t.co/9ZVxFNSR8i ⚠️ https://t.co/j09P4paSDv Pre-order my new album #Caution with exclusive new bundles! What lyric shirt do you like the most? https://t.co/Z1dnMPFfyF https://t.co/F9NYWnGaDF RT @GMA: Are you ready?\n\nNEXT MONDAY 11/19: @MariahCarey performs LIVE in Times Square only on @GMA!\n\nhttps://t.co/W1vUNMab63\n\n#MariahOnGMA… RT @BishopJakes: I want to commend the brave men and women who have served in the United States Armed Forces. The amount of courage and str… RT @Meghan_Trainor: Any amount helps 🙏🏼😘💗#WoolsleyFire #hillfire https://t.co/KYVPcXsoS9 https://t.co/fEJ1TL01Bq Having fun pon de wrap party! 😘 https://t.co/bP9asiZBkw It's a wrap on #MCLiveInAsia! Thank you so much to all of my amazing fans for an incredible month and so many unforgettable moments! I love you! 💖🇲🇾🇹🇼🇨🇳🇵🇭🇯🇵🇸🇬🇮🇩🇹🇭💖 https://t.co/xbjckhiqCq #Lambily, customize your profile picture with a #Caution sticker via  https://t.co/cGPES2Z3qA ! who's in? ❤️ RT @Genius: 🐑 CALLING ALL LAMBS 🐑\nour next installment of #GeniusLevel will feature an intimate conversation with @MariahCarey, one of the… CAUTION⚠ Join me for a special album signing event at the brand new MARIAH EXPERIENCE @ Sony Square NYC on 11/16! If you can't make it to New York, join us on IG Live to take part in the festivities! 💽🐑💝https://t.co/iE08IXV4aC https://t.co/zl0GWCq0K5 RT @vulture: At long last Mariah Carey and Missy Elliott could get the songwriting recognition they deserve https://t.co/tC2ZOxPgzB Japanese lambs! I have a special bonus track for you, RUNWAY, only available on the Japanese edition of my new album #Caution ⚠️ it's another collaboration with the amazing @Skrillex and I hope you like it 😊 Pre-order now @ https://t.co/nrJwY485nX https://t.co/ueqLC15MEy I love this mashup of A NO NO &amp; Crush On You!! This song is such a classic! @lilkim Thank you @justice4glitter for making it 💖 https://t.co/pf5FJHO3WB That was pretty good! 🍩🌊 #RoeRoe https://t.co/agiQwxzmls What an incredible experience it was to perform in front of the beautiful Borobudur Temple. Thank you so much for a great show, Indonesia! 💖💖 https://t.co/tdeiIx5ktZ Wow 👀 I haven't even put up my Christmas tree yet! 😳🎄 https://t.co/ptHbrKuCVX @iamjojo 😊💖 It's #ElectionDay! 🇺🇸 Find your polling place &amp; go vote!! 🗳 https://t.co/ylywR3jV8D https://t.co/8CP3jxqCXe Keep calm and Carey on 💃 https://t.co/miSZkJM0TV Check out my final appearance on @nbcthevoice’s #VoiceKnockouts, TONIGHT at 8/9c! https://t.co/pYzWYbdZfg Thank you for welcoming me to Indonesia, I can't wait to perform for you on Tuesday! 💕 https://t.co/HSVCiu1b35 ♥️♥️♥️ https://t.co/zeNN3h5xp0 He's the champ! #Rocky 💪 https://t.co/jKPI0MxfSo Rockstar 😍 https://t.co/LdeyJ3d06b #ANoNo #Caution https://t.co/vnNNXnF1dW Hope you like the new song A NO NO from my album #Caution. What's the track you're looking forward to the most? ⚠️🙂 https://t.co/HbEV5CIFuH Me on Oct 31🎃  ➡️   Me on Nov 1🎄 https://t.co/RigjhM6Ey0 Surprise! You can now get \"A NO NO\" with a pre-order of my album #CAUTION ⚠️ Hope you like it! https://t.co/noxGeYiwck https://t.co/kufoTkrcm6 #Caution⚠️ out 11/16! Pre-order @ https://t.co/noxGeYiwck\n01. GTFO\n02. With You\n03. Caution\n04. A No No\n05. The Distance ft. Ty Dolla $ign\n06. Giving Me Life ft. Slick Rick &amp; Blood Orange\n07. One Mo' Gen\n08. 8th Grade\n09. Stay Long Love You ft. Gunna\n10. Portrait\nTHANK YOU LAMBS! https://t.co/XaGiuMujfr Track 6 ⚠️ GIVING ME LIFE ft. Slick Rick &amp; Blood Orange ⚠️One of my favorite moments in the studio for this album was working with Dev Hynes. Dream come true to have Slick Rick on my song! 😊🙏 https://t.co/fUHMIsBUC6 HAPPY HALLOWEEN on stage in Tokyo! Aishiteimasu Japan!! ♥️ #MCLiveInAsia https://t.co/iHNqfT5mH3 TRACK 9 ⚠️STAY LONG LOVE YOU ft. Gunna ⚠️Had such a fun session with the Stereotypes coming up with this one. It's a feel good record! @Only1_Gunna @Stereotypes https://t.co/7J0hz370mb @Akosibachie and thank you for sharing it 😘💖 Watching the great pumpkin with Rocky! #classic @Snoopy #HappyHalloween https://t.co/A4IkmxdbvV Track 4 ⚠️A NO NO ⚠️ Wrote this one with my friend @PriscillaRenea. Girl power! 💁‍♀️ So much fun in the studio with that gal! #Caution LYM!!! https://t.co/7pMyjv3xSZ Track 7 ⚠️ONE MO' GEN⚠️ A slow jam that adds a great texture to the album. @poobear  #Caution https://t.co/LfhxXgPiKj RT @mariah_china: I came to have a party! @MariahCarey #MariahCarey #MCLivesinAsia #CAUTION https://t.co/8XIzonCwe2 yasss dahhling! https://t.co/ExhQw4HPua RT @iamawong: @MariahCarey Thanks for letting me help reveal the #CAUTION Tracklist! Here’s track 1 #GTFO ! https://t.co/6bWd56Cux4 RT @ro20_angel: @MariahCarey I’m loving this concept. Sending your lambs pink #Caution tape ⚠️ via @FedEx to reveal your upcoming album tra… RT @itsRORYjames: @MariahCarey thanks for the package!!!!! I love you and can’t wait for #Caution TRACK 10! PORTRAIT!!! https://t.co/ahuhvj… RT @gabeAlfassy: What better way to start the day than with some Mariah mail?! #CAUTION Track 2 - With You 💕 https://t.co/gFBFgSjEpH Thank you to ALL the #Lambs who are helping me reveal the #CAUTION ⚠️ tracklist! Only 4 tracks left 😊 https://t.co/0tzyvHzGCo Keeping it festive in Tokyo! #HappyHalloween 🎃⚠ https://t.co/4nvMyw2mQS Track 3 ⚠️CAUTION⚠️The last song I wrote for this album. Originally titled PROCEED WITH CAUTION and then went on to inspire the album title! #Caution \n\nThanks Anthony! 😘 https://t.co/v5aeSf6wV0 Track 10 ⚠️PORTRAIT⚠️ A reflection. Cuts deep. 😢 #Caution \n\nthank you for sharing it Tom ❤️ https://t.co/EEo88jGbZX Track 5 ⚠️ The Distance ft. Ty Dollar $ign ⚠️ I love a good chant! S-P-I-R-I-T! 📣 #Caution @skrillex @tydollasign https://t.co/mjyblL7qsU @Liam_Prest_1994 😊😘 Track 1 ⚠️ GTFO ⚠️ You know this one - a fun opener for the album! Hopefully you like it and if not, how 'bout you... 👉🚪 😉 lol #Caution https://t.co/KJPtNN2IHn Track 2 ⚠️ WITH YOU ⚠️ One of the first songs I wrote for the album. For the nostalgia! ☺ #Caution https://t.co/eb3aAz66qe Lol!! I'm sure your singing is better than me even attempting to hit a tennis ball! 😂😂 ❤️👑🎾 @serenawilliams https://t.co/2nUh0q3uSV Track 8 ⚠️ 8TH GRADE ⚠️The title reflects on the melancholic feeling I used to have as a kid 😳☁️ https://t.co/3AChJX28vq About to reveal the tracklist for my new album #CAUTION ⚠️, and wanted to let the #Lambily do it with me! Let's goooo! 🦋🎉🥳🍾 Tokyo show on Halloween!! 🎃👻 #MCLiveInAsia https://t.co/eVHVBLkrqR Loved being on @NBCTheVoice with my two new favorite divas @IAMJHUD &amp; @kelly_clarkson!! Thank you for making me feel so at home ❤️ I'm back tonight at 8/9c on NBC! https://t.co/TdCJRkURVb Yayyy Ayanna!! 🎉🎉 @B96Chicago https://t.co/p6Qs8pEt70 Thank you lady! So honored to get such a compliment from you ❤️ @LadyJHOLLIDAY https://t.co/8RVsQjXUko Rosie!! Someone just reminded me about one of our \"moments\" on your show..soooooo fun! 💕 @Rosie https://t.co/AC1vb1Knfy RT @NBCTheVoice: This is a MOMENT. @kelly_clarkson being a @MariahCarey superfan just makes us love her more, honestly. 🤗❤️ #VoiceKnockouts… RT @NBCTheVoice: THIS IS NOT A DRILL! @MariahCarey is in TEARS and you will be too. 🗣😭\n\nSee what performance is getting MC in her feels  TO… Tune in to THE VOICE tonight to watch me as the coaches' key advisor! 8/9c on NBC! @NBCTheVoice #VoiceKnockouts https://t.co/BK80kGQYxO Happy #NationalCatDay!!!! 🐱😻 https://t.co/peA7ki9KOp On my way to the stage in Osaka #MCLiveInAsia https://t.co/DEBCEne3LM ahhhh Bianca!!! I can't believe the details!!! 😂😂❤️ https://t.co/bKkXeS5Fwv Carving pumpkins 🎃🎃 #Caution ⚠️🎃🎃 countdown to Halloween! https://t.co/koXwOTZh52 @BinyaLin love it!!! 😘 🌈🌈 https://t.co/lZQnaS08Oa that is so pip !!!!! https://t.co/fuct7KaaDM Getting ready for Halloween in Osaka!! 🇯🇵 https://t.co/TdVafbgMjr You guys are amazing!!! Thank you to all my Filipino lambs, I miss you already! ❤️ https://t.co/Vcvg7Xfni8 Here's a sneak peek into the making of #TheDistance with @Skrillex &amp; @poobear 🎹 Hope you like it! Pre-order my new album #Caution⚠️ now @ https://t.co/noxGeYiwck https://t.co/PEbjmXGFo7 can't wait to see you in ATL! 🎶🎶 https://t.co/QiaAELLnmX RT @damigonz00: CAUTION!!!⚠️ Tickets for the New York Show have been bought! 😩 I can’t simply not wait to see the mesmerizing @MariahCarey… amazing audience. Thank you Manila!!! 💕🦋 https://t.co/BFLKdMkZZG MAHAL KITA Philippines!!!! ❤️❤️❤️ https://t.co/e5gmDCZQHd CAUTION TOUR ⚠ Tickets on sale now!! ⚠ https://t.co/iCGLcnrLHj https://t.co/gHOH4fg4mL Only a few hours left to get early access to tickets for my #CAUTION tour! ⚠️🦋🎶 https://t.co/8z0uC72Anm RT @SoulTrain: The 2018 #SoulTrainAwards Best R&amp;B/Soul Female Artist nominees are…\n\n@Beyonce\n@EllaMai\n@HERMusicx\n@MariahCarey\n@SZA\n\nFind ou… Can't wait for Monday!! @kelly_clarkson @IAMJHUD @adamlevine &amp; @blakeshelton are such great coaches and amazing artists. Very privileged to be a part of this MOMENT! @NBCTheVoice 😊😘 https://t.co/fJLlOhOqKg Vogue Magazine 1994 by Steven Meisel #tbt https://t.co/ro67Hgcw0D I love you!!! 💖💖💖 I will always be #WithYou 🇨🇳 #L4L https://t.co/0S1KTQoqAB RT @NBCTheVoice: A QUEEN IS IN OUR PRESENCE. 😱👑\n\nYou KNOW it's gonna be a MOMENT when @MariahCarey advises our #VoiceKnockouts teams on MON… LOL! You guys are hilarious 😂 https://t.co/JjYh2jQhTn Thank you for the amazing shows, China! 💖 Xièxiè! #MCLiveInAsia\n📸 Live Nation China https://t.co/2p3NMsM2vU RT @Diddy: I have some special amazing news!! We are opening up our THIRD SCHOOL - Capital Prep Charter School is coming to the BRONX in 20… #WithYou💕Shanghai!!! #MCLiveInAsia https://t.co/rkkQY8AjOw #LAMBS!!! You can now pre-order a limited edition of #Caution ⚠ with an alternate cover! Check out the hot pink vinyl, new t-shirts &amp; more! https://t.co/Z1dnMPFfyF https://t.co/ZMFaubRJil We like her too!! 😃 See you on the #Caution tour! https://t.co/MdoyOEDrzu It’s a MOMENT. I’m advising for the @NBCTheVoice Knockouts starting Monday 8/7c! 😘 https://t.co/ysoFUEMgTO Ticket presales are now in progress for my #Caution Tour! For Honey B. Fly preferred access, get full details here: https://t.co/iCGLcnrLHj https://t.co/jHP5H3841G RT @TODAYshow: We can exclusively reveal that @MariahCarey will be the key advisor on @nbcthevoice this season! https://t.co/job2O2mggI Thank you to my Chinese fans for remembering my father, Alfred Roy Carey, on his birthday.. #neverforget you ♥️🌻 https://t.co/OXKi9MM0MZ I told you I hold off until after Halloween but.. Come on, this is amazing!!!! I ❤️you Holland!!!! 🎄 https://t.co/0pcKmT8mr7 I'm so excited to bring the CAUTION WORLD TOUR to you, starting Feb 2019! ⚠ I can't wait to perform songs from the new album + some of our favorites 💖 HBF Presales begin tomorrow! Public on sale 10/26 @ 10am 🦋🎵 #CAUTION https://t.co/iCGLcnrLHj https://t.co/ABrZ7RBg6N Warm days, cold nights...🎶 #TheDistance \nNow it's time to 💤 ! 💖 https://t.co/MPOPBgeBw3 Now taking requests! 🤣 #SingingMimiMoji https://t.co/iFYuviMqBJ ⚠ Big news coming tomorrow! ⚠ #Caution https://t.co/8S4IAbrpFi Learning to use my Memoji! Lol 🎶🎶 https://t.co/upknrwTKod RT @WongZebadiah: @MariahCarey Amazing show last night ! @MariahCarey see you TMR night in Shenzhen https://t.co/rqhomCMO6O #WithYou💕 MimiMoji version 🤗💖 https://t.co/PuUenxeAkL Hi from beautiful Shenzhen!!! Hashtag badhairday 😂 https://t.co/2VzDrwOCSh Thank you so much Sony Music Asia Pacific for this honor! 1.6 BILLION?!?! Wow!!😮😮🙏🙏 Thank you to all of my amazing Asian fans for all the years of support. I love you and I'm so excited to be here on this tour! ❤️❤️ https://t.co/sHmcjj8nnW I love you Macao!!! Thank you so much for an amazing night ♥️♥️♥️ #MCLiveInAsia https://t.co/8EcbOJP7nH @itsjojosiwa Thank you!! She loves it!!! 😊❤️ The S-P-I-R-I-T chant from #TheDistance in beautiful Macao! 👏🙌 See you at the show tonight!! 💖#MCLiveInAsia https://t.co/GVajVwlOKQ 😂 https://t.co/lnOofdugD6 #Caution ⚠ pre-order available now! 😊😊 What's your favorite song so far? 🎶 #GTFO #WithYou #TheDistance 🎶 https://t.co/noxGeYiwck https://t.co/QPwfniu31V Who's excited for Caution?! Check out my @iHeartRadio takeover at 6pm ET tomorrow for exclusive info! https://t.co/fDfZhMyJYl https://t.co/rrOIxMhUHi #Caution ⚠ is now available to pre-order on digital, CD, vinyl  &amp; with exclusive bundles 👕💿🧢! Get it now @ https://t.co/Z1dnMPFfyF https://t.co/koA9FDW5sv Happy #GLAAD Spirit Day! 🏳‍🌈 I don't have purple ensemble with me in Asia, but I'm celebrating #SpiritDay to support LGBTQ youth! 💜💜💜 https://t.co/3iTwR1sjva https://t.co/4eZZ5I3GCm What an amazing experience in Taipei tonight. Thank you!!! #LYM 💖💖 #MCLiveInAsia https://t.co/yJBq3rUnSY 🎶 They said we couldn't go the distance 🎶 #CAUTION https://t.co/ztoat0A9M5 Pre-order my new album #Caution ⚠ NOW and get a new song - THE DISTANCE ft. @tydollasign 🔥🔥 (prod. by @skrillex) https://t.co/noxGeYiwck https://t.co/78usG98v55 Less than 6 hours till you can pre-order #Caution ⚠ (+a surprise)!!!! 🔥 Sitting here looking at the beautiful book and shirt the Malaysian lambily gave me 💖 Thank you for a great opening night, I enjoyed ya! #MCLiveInAsia 🎶🦋 https://t.co/KAhccqfazK Take a look at the making of the WITH YOU video! #WithYou💕\n #BehindTheScenes https://t.co/V2oLvJjqgo @SmithBermas 🤣😘 Making Taiwanese desserts! 😊 #MCLiveInAsia (lambs- should I pick a different hashtag?) https://t.co/8d6tpKcQ8p Making dumplings in Taipei! See you at the show tomorrow 🇹🇼! https://t.co/rvaKK0paoz CAUTION 🔥 Pre-order 10/18 @ 12am ET 🔥 https://t.co/cYV4ORMdxk Keep sharing! Pre-save #Caution on @Spotify to get a sneak peek of my album artwork @ https://t.co/cGPES2Z3qA! #CAUTIONUnlock https://t.co/S1rqvRbbVQ Hiiiii 💖 You guys can pre-save my new album #Caution NOW and help unlock my album art! #CAUTIONUnlock 🔥 https://t.co/cGPES2Z3qA https://t.co/LKT0Phw4WC My Asian tour starts tomorrow in Kuala Lumpur! 🇲🇾 Can't wait to see you 💖 #finalrehearsal https://t.co/mnppd4H5eY CAUTION 🔥 NOVEMBER 16 https://t.co/uZahorDGdZ At the butterfly conservatory in Kuala Lumpur 🦋 https://t.co/mg7GSSdO6S RT @TIDAL: Our community is taking a stand. \n\n@MariahCarey supports the fight for criminal justice reform. Get tickets. Donate. Join us.… @aditfentyy yes!! The excitement of Kuala Lumpur is upstaged by the loss of Pringles 🤣 https://t.co/V96EfO1Sjy Good morning, Kuala Lumpur! 💕 https://t.co/hBT5fvDvfD #lambilymoments in Tokyo 🦋💖#L4L https://t.co/2D8bx4pBs4 @aya327 @lovelovejack I did!! ❤️ RT @GoldenPetalsJP: @MariahCarey thank you so much for the beautiful show!!! I enjoyed ya much!!! #lambily #aishitemasu 💕💕💕💕💕 https://t.co/… I knowwww it's too early but it was a request 😳 I can't let my Japanese #lambily down 🎅😍 https://t.co/ammDikU05s Thank you to all the lambs who came to see me tonight at the #WorldBlockchainFestival in Japan! You always make it festive and I can't wait to see you again at the end of the month! ❤️🦋❤️ RT @lovelovejack: @MariahCarey It was A+mazing night! I'm so excited that I don't know how to come myself down😍 Thank you for loving my #AB… Watch the #WithYou💕 MV on @Vevo! What's your favorite scene? 😊\nhttps://t.co/e0gq6hu4Rh Japan is amazing as always! Can't wait to come to Manila and everywhere else 🤩😊 #TheExcitement https://t.co/S57cd7jIQ1 So beautiful. Hope it makes it to @TheCrownNetflix 😜 https://t.co/vR62xGm7qe RT @idolator: Imagine being this iconic. @MariahCarey shows the girls how it's done in her stunning \"With You\" video: https://t.co/JaaXXu1D… RT @HotNewHipHop: Check out @MariahCarey's new black &amp; white video for #WithYou\n\nhttps://t.co/pApazKDw6i https://t.co/mwkOz7YxaI #tbt we shot this campaign in 2004 but the message is still relevant today. VOTE! Your voice matters. Register to vote now @ https://t.co/tLsautMcTp https://t.co/D6WzjNKoNL To the nice people trying to take pictures of me while I'm trying to sleep... Kindly... https://t.co/xzpWe2DrDT RT @billboard: .@MariahCarey is the queen of her L.A. castle in sultry \"With You\" video https://t.co/Cy7C3Jh1MU https://t.co/sDDsfxKb7K same 😚 https://t.co/2mdSs84sYk Pon de plane to Japan, so excited to start my tour in Asia!! Currently listening to the song Portrait from my new album 🦋 #LYM RT @immahit: Congrats @MariahCarey #WITHYOU video is number 1 on USA iTunes. https://t.co/7zH1vIOvAu RT @MariahCareyAU: Congratulations @MariahCarey! #WithYou is the #1 music video on iTunes Australia! 👑\n\nhttps://t.co/3V1ZJ2imAJ https://t.c… RT @rita_ricks: @MariahCarey Queen of Hot tea ☕️ #WithYou https://t.co/1gwRrfr0zD Watch the WITH YOU music video now on YouTube! I hope you like it 😘 #WithYou💕\nhttps://t.co/Z01vw2rLKH coming tonight! 💖 https://t.co/PObVBfIlDG Watch the #WithYou💕 music video now on @etnow!\nhttps://t.co/IBvri4RoT3 RT @etnow: Attention, Lambs! 💖 Don’t miss the exclusive premiere of @MariahCarey’s new music video #WithYou, tonight on ET. 😘\n\nhttps://t.co… Watch the exclusive video premiere of WITH YOU tonight on @etnow at 7:30pm ET! #WithYou 💕 https://t.co/4MIDm6UCOy RT @youtubemusic: Only one word for @MariahCarey's #AMAs performance– flawless 💁‍♀️ https://t.co/qZVtRTKOVv RT @TooFab: We STAN a legend! @MariahCarey's #AMAs performance was perfect: https://t.co/DVkpgj0k6I Every day?! 😂❤️ https://t.co/dfQpWd02ts RT @AMAs: Still thinking about @mariahcarey and her beautiful #AMAs performance 👑 https://t.co/jhyOnzk34J #WithYou💕 #AMAs https://t.co/IYBMqnIDrW RT @AMAs: I'm in love WITH YOU, @MariahCarey 💗 That #AMAs performance was amazing! https://t.co/hTEG2qw90e TONIGHT! I can’t wait to perform the world television debut of “With You” on the @AMAs 🎶🎉 Tune in at 8/7c on ABC! #AMAs #WithYou 💕🦋 https://t.co/pzHpaZ8Ig8 @KayLamb510 Lol ! Yes- it's coming, I promise! #WithYou💕 https://t.co/VWJ1EB3q4E Much love to the @iHeartRadio fam! Watch my performances of \"Emotions\" and \"Always Be My Baby\" tonight during the #iHeartOnCW special at 8/7c on @TheCW 🎵😊 https://t.co/TcSwYEomvk Excited to return &amp; perform at the @AMAs! Tune-in TOMORROW at 8/7c on ABC #AMAs https://t.co/FURpOztCrq Make sure to stream #WithYou on @Spotify!!! 💕🎶 https://t.co/uUgpuCCoLo https://t.co/aEJmSCm3uN #WithYou is out now!!! Get it on @iTunes!!! ✨💖 https://t.co/BWZgKxNiTc https://t.co/fYG4na9H0t RT @jermainedupri: X @MariahCarey - Sweetheart\n\n10/6/98 #20YearsOfSweetHeart https://t.co/SbuBO4Q8Dn Don't forget to stream #WithYou on @AmazonMusic 🎶😘 https://t.co/ilYGfZyjC3 https://t.co/uOpuOaHlqM Stream #WithYou 💕on @AppleMusic 🎶 https://t.co/ApLe0KPp3d https://t.co/NkCAfpFbMF Lambs, my new single #WithYou is out on @Spotify  😘💋 Love you much! https://t.co/uUgpuCkNmO https://t.co/SqOb3GZ0ZQ My new single #WithYou is out now on @AppleMusic!!! More moments like these to come lambs 💋✨ https://t.co/ApLe0KPp3d https://t.co/kPUC7srAPN I’m so excited to share this moment #WithYou all! 😂You can now get my new single “With You” on @iTunes today! 💖😘https://t.co/BWZgKxNiTc https://t.co/EKf3lfG3JM Lambily! My new song #WithYou 💕 is out now!! Go stream it on @AmazonMusic! 💋 https://t.co/ilYGfZyjC3 https://t.co/pScqnkFFny Surprised the lambs on Wednesday night with a listening party!!!! Thank you to my amazing #lambily for your eternal support, I couldn't be happier to share this new music #WithYou😍😍 https://t.co/TvPmvdV1tf damn, I fux witchu! 🎶 #WithYou💕 https://t.co/6MLz0r1Qp3 “With You” is officially out and I am so excited for you to hear the Premiere of it on @iHeartRadio #WithYou💕 https://t.co/2zhqm1CmF6 https://t.co/UFI281ymKw @lambilyaaron it should be!! was gonna go to sleep.. but then I saw that #WithYou is trending!! 💖💖💖 who's up &amp;listening right now??  🐏 WITH YOU 💕 is finally here! 🎵 Available everywhere @ https://t.co/cmp0FaGnni ❤💙💜 https://t.co/pGLtt2WW4M I hope you're wearing pink!! @IamLaceyChabert 💖💖 happy October 3rd!!! ps. it's Wednesday! #MeanGirls 💖💖💖 @KristoferBuckle @EBUNC1 😂 #WithYou💕 10.4 @ 12am ET https://t.co/UdOx75RUg7 @mariahcworldd Nooooo @J_Glover_1999 Yes That's kind of how the intro goes! 😂#WithYou it's less than 24 hours away!! https://t.co/ptHfzBpuMS @michaelbodnar98 I don't know where the underneath the stars video is 😭they hid it from me lol @JessicaWeeny not on this one but they do have their own song that I may share with the world one day 😍 @FAMOUS1MC 🤫 it's only midnight dahhling! that's like the afternoon for me 😁 https://t.co/Y34pr9fsJR Roc &amp; Roe are asleep in the back of the car so I have a moment to talk to the lambs 😘 @liyahdabaddie yeessesssss @therealcandra @Seaniebubble I did forget! but thank you for reminding me 🙏💖 do you check your service every second? 😁😘 https://t.co/mWaGoWz9gQ @Seaniebubble happy anniversary 😘 lil excited lil excited... 😊 #WithYou RT @allidoislovemc: #OTD 1995 @MariahCarey's best selling album in the US, \"Daydream\" was released. It debuted #1 on the Billboard 200 with… @Suz888Suz Can't wait for Tokyo!! Only ONE WEEK to go! The @AMAs are LIVE Tuesday, October 9th at 8/7c on ABC and I can't wait to perform! 🍵 #AMAs https://t.co/zr9UIHyKEt #WithYou 💕 - only 2 days to go!! https://t.co/sq1zHcrCCP Oh I forgot how shady I was being there on the left 😂 https://t.co/QkO4y2CfVx #WithYou 💕 https://t.co/Qa79sGWfYJ WITH YOU ✨ 10.4 https://t.co/tjCUtiennJ Caymus 2014 is one of my favorite wines ever! 🍷 https://t.co/v7HSOMMFcD let's get past Halloween first! 🎃😁😁 https://t.co/BT1xamnyRa I do believe so in fact 😃 https://t.co/kXj7yFfliH @freddieMC can't wait for Amsterdam! that is so funny 😍 https://t.co/FYnqGhJldc Can't wait!! 🇵🇭💖 https://t.co/FbWgvZZMSv Just finishing up the video! 😊 https://t.co/hhOcun77wD @fentyxweeknd what are your top two? 😲 @NicwithoutaK83 😂😂😂😂 I was just thinking of that! And also of #meteorite 😉 https://t.co/LYzUBjZ7gG RT @Slant_Magazine: A quick look at @MariahCarey's exhaustive canon of remixes proves her commitment to not just the process, but the club… Sitting here \"underneath the stars\", looking up and just saw a shooting star 🌠 #blessed thinking of you #lambily Big Jim, Thank you for years of your musical genius and for your friendship. May you rest in peace. Love, Mariah ♥️ https://t.co/ypvft60hk1 Hello dahhlings! I have a special treat for you ✨ My new single “With You” is available NOW to pre-save on @Spotify! 💕💋https://t.co/Y8uQSmaWAi https://t.co/7btuXWMV7z #GTFO 👉🚪 @ https://t.co/Lv8E1thJFx 💝 https://t.co/WUplibwzsz Proud of my little sister and friend @sjeter2 for putting out this inspiring book that everyone should read about overcoming obstacles. We all face them in life and this book helps us live our very best STUFF! @StuffMovement https://t.co/lOir9rn8sd 😲🎉🙏🙏 https://t.co/6mNb31GPKF I Just Can’t wait…\nTickets for my ‘All I Want For Christmas Is You’ European Concerts are on sale now! The Christmas countdown starts here! https://t.co/D2fMfsEQlW https://t.co/zERsIS45iH Video games night w/ Dem kids! https://t.co/lVjoQybKbd I’m using my voice for peace. What will you do? Join me in celebrating #PeaceDay with @iheartradio and share the love. https://t.co/wW6cfqDZEb @manessaislah @RyanSeacrest @LiveKellyRyan 😂 No! I only use olive oil from a very specific elite region in Italy, exclusively hand picked by boys named Ryan 😂@RyanSeacrest @LiveKellyRyan https://t.co/aVYraKRwux 🙏😘 https://t.co/PkpCe5GRSm RT @tom_aspaul: 2. That time @MariahCarey brought Olivia on stage to sing (her best song) ‘Hopelessly Devoted To You’. ICONS ONLY. https://… I'm coming back to the #AMAs!!! Can't wait for you all to see my performance at the @AMAs on Tuesday, October 9th at 8/7c on ABC. 🥂🦋🎉 https://t.co/DK4vIbXWFm RT @INTSonyMusicJP: 💫マライア・キャリー💫\n\nまもなくJapan Tour🇯🇵\n来日直前に日本独自のこれぞ❣“ベスト・アルバム”リリース決定🙌\n初回生産限定盤には、マライア・キャリーの豪華オリジナル・ハンカチが封入✨\n\n予約はこちら：https://t.co… it was so great to see you @PaulaAbdul, looking gorgeous as always!!! Hope to catch you on tour💖 https://t.co/fJDx9iLFJD When someone tries to take a picture of me without the appropriate lighting\n#GTFO 👉🚪 https://t.co/ff0KrkPLQx Thank you for having me @iheartradio! I enjoyed ya 😘 #iHeartFestival https://t.co/irZeNDRDHf RT @iHeartRadio: Legit SHOOK. This is EVERYTHING!!!\n\n@MariahCarey | #iHeartFestival https://t.co/pH1sqbZYHA RT @iHeartRadio: How bout you....\n\n@MariahCarey \n#iHeartFestival \n#GTFO https://t.co/5Ovrm0GX96 RT @Y100MIAMI: Don’t mind us crying in the corner because @MariahCarey keeps singing all her bangers #iHeartFestival https://t.co/ysORd4xVlw RT @1043MYfm: Oh @MariahCarey we belong together forever and always bb♥️ #iHeartFestival https://t.co/vlxvMLobKH It’s show time! Watch the #iHeartFestival right now on https://t.co/qFpeGjMTq1 🦋💖 https://t.co/3Zuegtuo5X Oh #iHeartFestival we belong togetherrrrr 🎶 https://t.co/vhwLZXDhLr Tonight’s the 2018 @iHeartRadio Music Festival! I’ll be performing later so make sure you watch it on https://t.co/qFpeGjMTq1 at 7:00pm PT! #iHeartFestival https://t.co/C3YFV2SvgV #GTFO 👉🚪@iheartradio tonight! #iHeartFestival https://t.co/BUz8Q5s8O0 RT @accessonline: #TBT! @MariahCarey officially wins for throwback of the day with this old school snap of her and Will Smith! https://t.co… when people ask me if I own a turtleneck\n#GTFO https://t.co/gzTkh2C571 Get all the #GTFO gifs on my @GIPHY channel! 👉🚪 https://t.co/RGDHDOVDQL https://t.co/JL4H42Amn8 RT @BNEventsGrove: Calling all @MariahCarey fans!!!\nHave you seen the #GTFO sign in our front window to support Mariah's new single? Come d… when someone wakes me up at 9am for a business call\n#GTFO https://t.co/3oOf53GbQh I freaking love you!!! You guys just made my night!! #GTFO ❤️❤️❤️ https://t.co/TbcP6P1KAl This is the best!!! #gtfo😮🦋😍 https://t.co/xHn66y15WV Congratulations Claire Foy and @TheCrownNetflix on your #Emmy wins!!! My fave show ☺️👸🏼🇬🇧 RT @DimitriL4L: The lambs are here at The Grove and we are READY! @MariahCarey #GTFO 🦋 https://t.co/RNqCoM4iKv RT @DimitriL4L: How bout you... #GTFO @MariahCarey https://t.co/C86t9SuVJC RT @mejustinbobby: #GTFO @MariahCarey @BNEventsGrove 🦋 https://t.co/50jl4yNQZt RT @marcolamb4life: @gillesakacake @BNEventsGrove @MariahCarey @KristoferBuckle GTFO is lit up https://t.co/CdlYvkXbvR Many exciting moments! ☕☕ https://t.co/c76zq9VNPq RT @idolator: Her mind! @MariahCarey's \"GFTO\" spawns an onslaught of memes: https://t.co/1UQXyLzfPe https://t.co/epz3SP4i6j LA Lambs – heard there will be something cool at @BNEventsGrove at the Grove tomorrow 👀 #GTFO Happy anniversary Butterfly 🦋This is still my fave album and always will be♥️ https://t.co/EsL1Extdcq @katharinemcphee Thank you gorgeous!! 😘 just tell them to \"take your tings and be on your merry way\" 😂❤️ https://t.co/oXIXYQp3XL RT @Epic_Records: . @MariahCarey #GTFO #1 WORLDWIDE!! 🦋👏🏼 https://t.co/2WIXpXsSCL https://t.co/OL6FGB0pj0 RT @oureric: It should come as no surprise that the woman who knows her way around an instantly meme-able quip and often writes her own son… @Walmart @HectorHoe I could've sworn you'd love me harder! #GTFO https://t.co/CUoWyxjUyD RT @emilytesskatz: \"Go stay at your friend's house or something\nDon't mean to be rude, but take your shit and leave\"\n\n@MariahCarey somehow… RT @Vevo: Now I know exactly what to say to every single one of my exes. Thank you @MariahCarey. Watch \"GTFO\" now.\n\n▶️ https://t.co/wkVjf7b… Be sure to get my new song 🎶#GTFO 🎶 on @iTunes ! 💕❤️ https://t.co/4tjROcHkwL RT @Deezer: It's here 😍\nStream @MariahCarey's new song #GTFO ▶️ https://t.co/8QqmOxDgFC https://t.co/TZMfPOzpRv RT @glittering_mc: Peep a cameo by yours truly, the incredible Cha Cha the Wonder Dog, in @MariahCarey’s new video #GTFO 🐶 https://t.co/90i… @BeccaONLINE702 ❤️ 🦋 #GTFO video available now! 🦋 https://t.co/33lp8xg2yO 4 hours to go until the #GTFO video is out! 💋🦋 https://t.co/MLy6Br9stc Happy birthday @tylerperry !!! ❤️💙💜 https://t.co/eI2t3mhYiD Stream #GTFO 👉🚪 on @AppleMusic! ✨https://t.co/M804bIFtC4 RT @Shazam: #GTFO by @MariahCarey is our Song of the Day 🦋 Listen now on @AppleMusic ---&gt; https://t.co/ytxr9uv1jY https://t.co/CXwWKf3EuK Thank you dahhling! Yasss we ❤️ Bibi! I had so much fun working with her 🎉🍾 @BibiBourelly 🎵take your tings and be on your merry way (hey hey hey)🎵🍷🍷🍷 https://t.co/mrXLqYD401 #1 on iTunes worldwide?!? GTFO! video coming in 8 hours! #GTFO👉🚪 https://t.co/AFukhgDxtt Feeling festive 🎉 My new song #GTFO is out today! Stream it on @AmazonMusic! 💋✨ https://t.co/n6O2UH7BHK RT @MariahTrends: Congrats @MariahCarey! #GTFO is the #1 song on iTunes Worldwide! 🔥🎶\nhttps://t.co/FPMVITUEx6 https://t.co/xrE2p1LgLM RT @Spotify: #GTFO\nThe new @MariahCarey track is out now!\nhttps://t.co/uZ2R3Ugykd https://t.co/naHw6euZ1Z RT @TIDAL: Stream @MariahCarey’s #GTFO on #RealLove: https://t.co/mf6PoVFoXk https://t.co/3YwBF3UsZO G❤️T❤️F❤️O❤️ !! #gtfo https://t.co/shI0YJl8yF great playlist 😆 https://t.co/HQ3hQ3Aw3u LOL might as well! 🤣 #gtfo 👉🚪 https://t.co/kiJlf68cV0 @chance_hookua love it!! 💋 #gtfo #gtfo 😲😲 https://t.co/t0629S3pMY RT @RollingStone: Mariah Carey unveiled an understated new pop gem with a crystal clear message, “GTFO.” Hear it here https://t.co/3Uzd1dAH… RT @idolator: The not-so-elusive chanteuse has returned, and she singlehandedly saved music. @MariahCarey's \"GTFO\" is a sassy breakup anthe… RT @glittermagazine: .@MariahCarey Drops New Music and We’re Here for It, How Bout You #GTFO ⚡️LISTEN: https://t.co/qMDtGbhCxb https://t.co… how bout you… check out my new song #GTFO! 👉🚪https://t.co/Lv8E1t08gX https://t.co/0qzMAVqg8x #GTFO 🦋 8am ET Tomorrow https://t.co/kBcgGqnL7o It's a wrap on #TheButterflyReturns in 2018! Thank you so much to everyone who came to the shows, I hope you had as much fun as I did 😄💝 See you again in February 2019! 🦋 https://t.co/HhAMbN1e31 how bout you... We have a winner!!!! Congratulations Acacia!! 🦋🦋 https://t.co/J9sJKH6KEb First person to show up in fabulous MC attire to the MARIAH BUTTERFLY by the Spanish Steps @CaesarsPalace gets FRONT ROW SEATS for tonight's show! #TheButterflyReturns 🎙🦋 [TEAM MC] https://t.co/ZUR1wJsfWM Come see my last two Vegas shows of the year! #TheButterflyReturns at @CaesarsPalace tomorrow 9/9 and Monday 9/10! 💖🎶🦋 https://t.co/h0Lxv2PS9Q #Lambily at #TheButterflyReturns 🦋🦋 https://t.co/NsSH2q2Gep RT @CaesarsPalace: It’s giveaway time! 🎉 First two couples to meet us at the front doors of the @ColosseumAtCP and sing their favorite @Mar… Can't wait to see you all tonight! #TheButterflyReturns 🎙️🦋 plays at the Colosseum @caesarspalace at 8pm! Get tickets @ https://t.co/iCGLcnJmyR 💖 https://t.co/k81N0zyaIy RT @CaesarsPalace: .@MariahCarey returns to the @ColosseumatCP tomorrow night.  🎉 https://t.co/7UHXDLw977 #TheButterflyReturns https://t.co… Like for Fuchsia\nRT for Metallic\n#TheButterflyReturns @CaesarsPalace comes back on 9/5! 🎙️🦋 https://t.co/XcVLCXovMu Going 🎶back in time🎶 with these amazing singers backstage 🦋 https://t.co/axDdGohiYP Thank you for this 💖 it reminded me of some songs I haven't heard in awhile 🎶 https://t.co/TAmJ5UwDLV Jackpot! 🎰 @CaesarsPalace \nWho's coming to play? 🃏 #TheButterflyReturns https://t.co/w9nsxz0qRk It's all about the #LambilyMoments 💖💖 #TheButterflyReturns https://t.co/nRCY2SDb9g Reflections... 🦋 https://t.co/WyZ7rqcYRs Feeling the love of the #lambily ♥️🐑 #TheButterflyReturns @CaesarsPalace back again tomorrow! 🎙️🦋 https://t.co/Gz8EErVZAd RT @JuddApatow: Great time seeing @mariahcarey at @caesarspalace!  Pure joy. https://t.co/jkQLxVSlMl #LambilyMoments #TheButterflyReturns 🦋 https://t.co/FqOAwI2dKg Loved being back @CaesarsPalace tonight, the audience was giving me life! 😘🎙️🦋 #TheButterflyReturns #Lambily https://t.co/6EutXXkL1s I'll be lovin u long time!!! But I love Stay the night too! 😉 https://t.co/UEmHHuXkrP Last touches 💋 #TheButterflyReturns @CaesarsPalace @KristoferBuckle https://t.co/LVRg6Xnmkd #TheButterflyReturns is back tonight at @CaesarsPalace. Can't wait to see you!!! ♥️🎙️🦋 https://t.co/vo8mla69jV Happy anniversary #MusicBox 💝 #fbf https://t.co/D7Q5Miu6En 😄💝💜🎈🔬🦋 https://t.co/ZhKP9DDwXl RT @AndyGoulding: The @MariahCarey wall at @CaesarsPalace #TheButterflyReturns https://t.co/FwqKb0D0FH 3 days until I'm back in Vegas for #TheButterflyReturns!  @CaesarsPalace,here's an updated rider for my dressing room, basically the usual! 🤗 https://t.co/XqvYDyT1Eh RT @cameron_kasky: Please go contribute to this gofundme raising money for the victims of yesterday’s senseless shooting in Jacksonville, F… RT @people: Mariah Carey Spills Details on Her Upcoming Album and Says She’s ‘Having a New Moment’ in Life https://t.co/Ey5HYyVpGM This 🦋 is returning to Vegas on Friday! In celebration, we’ve announced 5 new residency dates in February! New dates go on sale this Friday at 10am. For tickets to all shows including VIP packages, visit https://t.co/iCGLcnJmyR ! See you in Vegas ❤️ https://t.co/xNMROBiXlF 🤫🤫🤫 https://t.co/f6x1qev9NI Happy #NationalDogDay !! 🐶🐶🐶 https://t.co/KJaV4oP1V3 Having a splash! 💦 https://t.co/BhQ1IZIY79 Friday #Moments ✨ https://t.co/LbEmr19uEC RT @OriginalFunko: Coming Soon: Pop! Rocks: Mariah Carey!\n@MariahCarey \nhttps://t.co/s5HbgBtt3l https://t.co/g8tk6VQLBm Yaaaasss!! One of my favorite moments! @DaveNavarro https://t.co/4TP5PO0yvQ #tbt Bringin' on the Heartbreak @DaveNavarro https://t.co/4fHah1hxpv Vocals night🎙️#focused #inspired https://t.co/P4Zn6uSCcf Less than ten days until I’m back in Vegas for #TheButterflyReturns! Can’t wait to see all the #lambs in the land, it's been a minute! Who’s coming? 🎙️🦋https://t.co/CRkGxpinrs https://t.co/W97fRFepRP Sippin' ☕ https://t.co/XoXAAOhbKR RT @CaesarsPalace: Get ready! @MariahCarey returns to the @ColosseumatCP on Friday, August 31. Get your tickets today: https://t.co/nEBmdpL… Anyone care for a ride? 😉 Off to the studio! https://t.co/R8xcY4cfwx Admiring the sunset 🌄 https://t.co/5iiSIxp75J I'm upset!!!! 🦈 https://t.co/IgqzR1FEew #fbf one of my favorite songs to perform in Vegas was #CantLetGo 🦋🎙️ Which song do YOU want to see me perform on #TheButterflyReturns in September? https://t.co/oYGqTpv8oH I will forever cherish the moments I spent in your presence. Your indelible impact was earned not only by your incomparable voice but by your bigger than life personality, wit and humor. I say a BIG prayer for you. You will forever have all our RESPECT. Love, Mariah ♥️ https://t.co/97qk0J64rO You showed me I could sing the songs I wanted to sing and bring God with me. You've inspired millions everywhere yet never left home, never left church. Today the entire world mourns your home-going and celebrates all the brilliance you left behind. https://t.co/Ek0yHdXcRF Aretha Franklin. The Queen of Soul. The Icon. The ultimate singers' singer. The greatest singer and musician of my lifetime. The power of your voice in music and in civil rights blew open the door for me and so many others. You were my inspiration, my mentor and my friend. https://t.co/QD9pxvGLLh Aretha Franklin. The Queen of Soul. The Icon. The ultimate singers' singer. The greatest singer and musician of my lifetime. The power of your voice in music and in civil rights blew open the door for me and so many others. You were my inspiration, my mentor and my friend. https://t.co/YDQL2zzgdM 🎶Ken Leeeee🎶 🤣😚 https://t.co/1yX6xu9q3p \"Pose like Mommy!\" 😎⛵👯 https://t.co/FgktAO3JBn Resting on the boat and counting down the days until #TheButterflyReturns comes back to Vegas! See you 8.31 😎🦋🎙️https://t.co/bIkDpj91bg https://t.co/z8xa1xfQb4 Praying for the Queen of Soul 🙏🙏 #ArethaFranklin https://t.co/5cfNPrQrq3 ⛵ https://t.co/lOpINBj1z4 Going on vacation, and we somehow landed in the wrong spot 😂⚠️⛔ #groundedInNowhere https://t.co/7cYn1Sz4ln This means so much to me ❤ Thank you and congratulations, Batwoman! #Hero #Superhero @RubyRose https://t.co/tpWX0XMZrH Thinking of Whitney on her born day. I miss you, friend ♥️ #tbt #WhitneyHouston https://t.co/QZ87K6g7CN #ntt 🤣🏁 https://t.co/340hxl5Oif Happy anniversary Billboard Hot 100! A true honor to be a part of this great legacy 🦋💿 https://t.co/EbvBGbk4lR THAT IS A-MAZING!!!!!!!🎅🏽🎅🏽🦋🦋🦋🦋 🇮🇪🇮🇪 https://t.co/GZX01W6sfm Bid now for a chance to meet me in Vegas and watch The Butterfly Returns live @CaesarsPalace! ALL Proceeds go to the Olivia Newton-John Cancer Wellness &amp; Research Centre!\nhttps://t.co/enj2n9J6Q3 With Monroe and Moroccan on @harpersbazaarus (on newsstands Aug 21) 💖 #familyfirst #RocnRoe #BAZAARICONS https://t.co/Kwe9u61fTc Strings session 🤫🎻 https://t.co/Vq0qOr3fBq Mommy-daughter quality time 💞 https://t.co/cK9V21NYDW Vision of ♥️ #tbt https://t.co/XDW4kTx5D4 Really looking forward to #MammaMia2 featuring my Golden Globes seat buddy #MerylStreep, and the epitome of fabulosity... @cher!! #epic 😍🎶 #tbt with @britneyspears. We need a new picture, Brit 😂😘 https://t.co/X4QZG2GgDJ Thank you #Lambily !! 🎉💞 https://t.co/xIKdz7glh7 Daniel, I'm so happy you won @thevoicekidsuk with such a beautiful rendition of my song. Congratulations!!! Love, MC ❤️ #AnytimeYouNeedAFriend https://t.co/pNnv7Dn03J Good Mornting! #SundayMorning 🌺 https://t.co/zXZO8WVyrz Moments with Ms. Monroe 💖 https://t.co/mZDCvaYr2B Mood: #Summer ☀️👙\n#fbf https://t.co/4CJoopGfNw Thank you @voguemagazine and all involved in coming up with these beautiful ensembles 😘😊 https://t.co/rFg47qTHfo #tbt to a magical moment in time with an incredible, inspiring leader who would have turned 100 yesterday. #Mandela100 https://t.co/ryDo6VF1dP @Gabbyw327 I am now 😘 Hey Gabby!!! Love the ensemble.. and the shoes!! 💖🐑 #LambilyMoments https://t.co/bUrA9r93HT 😘😘 my kids were reading this with me and were not impressed by/did not believe the garage door story! I'm crushed, I thought that was my #superhero power 😭😂 https://t.co/iVSkYndQce Jermash!!!!! 🤦‍♀️ https://t.co/frO83j5FTT \"A kiss on the hand may be quite continental, but diamonds are a girl's best friend\" 😍💎 https://t.co/oDwugUn2fH Happy anniversary to one of my favorite movies \"Gentlemen Prefer Blondes\"!!! ♥️ https://t.co/KWZtjKkuqP 📝🎶 https://t.co/V1ftQOXTaK That's a wrap on the July shows of 🦋 THE BUTTERFLY RETURNS 🦋! Thank you so much to everyone who made it such a great experience - my team, all the crew at @CaesarsPalace and of course the incomparable #lambs! Can't wait to see you again in September!! 💖\n📸 Denise Truscello https://t.co/G5xtGUMNMn #Loverboy #Glitter #LaChapelleMoment https://t.co/K22bv9X7ra Thank you to all the lambs in the land!!!!😂 We still like this even though it only went to #2!!!!! OMG whaaat a trrrraaavessty!!!!!!! Lol 😆 https://t.co/ooRESWdxbH Might have to do something about that! 😘 #TheButterflyReturns 🦋 https://t.co/n0tbQcIwAL he said yes!!!💍👨‍❤️‍👨 #thebutterflyreturns https://t.co/L2NTAgCEwj Night off... #pondestudio 🎤 https://t.co/LuY297GLxO Now on @spotify: 🎶This is: Mariah Carey🎶 playlist! 🦋\nhttps://t.co/nF64FmdtgC https://t.co/yb5NCO7qa2 Festive!! 🦋🥂🦂 https://t.co/VzRDMY1gfL Thank you to my fantastic creative director Jesse Blevins for such a beautiful set 🦋 #TheButterflyReturns See you tonight @CaesarsPalace! https://t.co/1WaIfwAVFA #TheButterflyReturns 🦋 #Vegas 🦋 Thank you for another great show 💖 See you on Tuesday! @CaesarsPalace https://t.co/EaNYIK1Cfc Thank you dahhlin', glad you enjoyed!😊😊 https://t.co/rDQcH1cm1b RT @SeanFOX5: @MariahCarey’s kids just joined her on-stage in her #ButterflyReturns residency @caesarspalace. So cute! https://t.co/9LOZ9ku… Opening night of #TheButterflyReturns 🦋 in #Vegas! Thank you all for being an amazing audience 💖💖 @CaesarsPalace https://t.co/yMTP7JDhXq RT @HighRollerVegas: Tonight we light up the wheel for The Butterfly’s Return! Welcome back to Vegas @MariahCarey  ❗️ https://t.co/TTYo9EGU… Hola España!🇪🇸 I'm so happy to announce a new date on my Christmas tour in MADRID! 🎄🎄 Special pre-sale for HBF members begins Thurs, July 12 @ https://t.co/iCGLcnrLHj! https://t.co/THElQrhApQ https://t.co/UmNYvZIXJz Happy 4th of July!! 🇺🇸💖🌻#FourthofJuly2018 https://t.co/S1ROLJ29sZ RT @ormslovemariah: Happy 4th of July!!! Perfect day to play Fourth of July by @MariahCarey, amazing record!! #vocalist #songwriter #butter… RT @SoniaSongs: Happy 4th July everyone &amp; look, @MariahCarey https://t.co/pRZoiYao91 RT @allidoislovemc: Have a happy and safe #4thofJuly everyone! 🎆🎆🎆 @MariahCarey https://t.co/7bfd8JEFeM Only 1️⃣ day left!🎙🦋 #TheButterflyReturns #Vegas @CaesarsPalace @ColosseumatCP https://t.co/4GBw1IyxIC MANILA! I'm excited to see you soon at Araneta Coliseum 🦋🦋🦋 Get your tickets now to my concert on Oct 26th @ https://t.co/tMn0BAqA4P @WilbrosLive https://t.co/53kUhtRKKP 2️⃣ days to go!🎙️🦋 #TheButterflyReturns #Vegas https://t.co/otoWlx7Q9K 3️⃣ days to go! #TheButterflyReturns #Vegas 🎙️🦋\n\nTickets: https://t.co/iCGLcnrLHj https://t.co/kwWADkglxC 🔥🔥🔥 @Drake https://t.co/FBcfOBMS69 Congratulations!!! And thank you for listening to my music 💖🦋 https://t.co/pSw3i5XGeO #tbt #honey A picture of my bad side I kind of like! (Quite the rarity! 😂) https://t.co/O8ecciqIim #Lambs, if you missed Mariah's hilarious interview with @jimmykimmel, you can catch it again tonight on @JimmyKimmelLive at 11:35pm/10:35c on ABC! [Team MC] https://t.co/4UAGUq7kau RT @billboard: Remembering Michael Jackson  ❤️ https://t.co/VUbWlTvbzb RT @billboard: Remembering George Michael on his birthday 💗 https://t.co/DtncmZVXrP Happy to announce a new show on my Asian tour this fall in Shenzen, China! 💖 I'll be at the CR Shenzen Bay Sports Center Arena on October 22nd!🎙🦋\nMore details @ https://t.co/iCGLcnrLHj https://t.co/qLiICbWnWR A lil' sneak peek at one of the concepts for my new Vegas show #thebutterflyreturns 🦋 work in progress! https://t.co/ElDkUntb6o Watching the world cup like...\n#dontforgetaboutus #fbf #WorldCup https://t.co/Zi7VWqKbIM \"I really gotta get back in the studio\" -- Miss Monroe Cannon\nRocky wouldn't pose #rockstar 🤩 https://t.co/uaBCWhDeBK Battle of the Encores: Hero vs. We Belong Together!\n\nRT for #Hero\nLike for #WBT https://t.co/26tYaSS9DW Congratulations @jermainedupri on getting inducted into the @SongwritersHOF!! See ya in the studio to continue making magic 🦋🎧📀 #WeBelongTogether #Honey #AlwaysBeMyBaby #ManyMore https://t.co/bp4Tc2qp8Q VEGAS! Catch me as I perform at the #iHeartFestival this fall! Tickets available now during the @CapitalOne pre-sale: https://t.co/B2s1EMlBjl https://t.co/4b7TD5hirN RT @MariahCareyAU: Today marks the anniversary of @MariahCarey's self-titled album. With four #1 hits &amp; over 15 million copies sold, it bec… RT @wemissmusic: On this day in 1990, @MariahCarey’s debut album was released. It spent 11 consecutive weeks at #1, and its first 4 singles… Proud of my little lamb @PriscillaRenea, this butterfly is spreading her wings with an incredible new album #COLOURED on June 22! 💖💖 Let's do this again! Vote for the song you want to see me perform in #Vegas on my new show #thebutterflyreturns 🎙️🦋💖 All I Want For Christmas Is You, Europe! ♥️🎅 Tickets for my European Christmas tour are on sale now!! 🎉🎄 https://t.co/iCGLcnrLHj https://t.co/zp4cWVXNpV Thank you for having me @jimmykimmel and thank you as always to my amazing fans who came out and made this so much fun! 💖💖 See you in Vegas!! https://t.co/nAWaBWcfDl RT @harpersbazaarus: Watch Mariah Carey Spill the Tea During a Game of 'Never Have I Ever' https://t.co/hvSYQdF4r6 On with #Kimmel tonight! 🦋💖 @JimmyKimmelLive https://t.co/GMg0pA1AuP 📺 Watch Mariah on @JimmyKimmelLive TONIGHT on ABC at 11:35pm/10:35c 📺\n[TEAM MC] https://t.co/oWr5LNCA7d Watch Mariah talk about her upcoming European Christmas tour &amp; hear what she's been up to in the studio! https://t.co/brS90GfsUv [[TEAM MC]] Prepare to get festive, Lambs! My 'All I Want For Christmas Is You' tour is coming to Europe this December!! 🎙🎅Tickets go on sale Friday, June 8. Fan club pre-sale starts tomorrow @ https://t.co/iCGLcnrLHj!🎄 https://t.co/5vDrc0iKYH RT @lorraine: We’re officially declaring tomorrow #MariahMonday in honour of the one and only @MariahCarey! 😍\nDon’t miss the full interview… Loving your comments! keep the votes coming 😘🦋 Working on the setlist for my new Vegas show #thebutterflyreturns 🦋🦋Which of these songs would you like to see me perform? ☺️ #Lambily Happy Pride Month!! 🏳️‍🌈 #PrideMonth https://t.co/ZUQOXxUMA1 Tune in on Wednesday to hear me tell @JimmyKimmelLive about my new Vegas show #thebutterflyreturns and more! 🦋 https://t.co/3GcHeLpw2A 🎶 Anytime you need a friend... 🎶 #tbt #aynaf #anniversary https://t.co/oLo3A6PoWh Honoring all the brave men and women who sacrificed their lives serving our country. We thank you and will forever remember you as Heroes. #MemorialDay #ThankYouForYourService Working 🦋🎶🎙️ https://t.co/cv2IhgkRM3 Happy birthday to the incomparable Miss Patti LaBelle! Honored to call you my friend and fairy Godmother 💖💖💖 @MsPattiPatti https://t.co/Woi3MNg1mq Thank you @glamourmag and all you amazing artists for sharing these beautiful renditions with me! ♥ Come to my brand new Vegas show THE BUTTERFLY RETURNS to hear these songs &amp; more, live! 🎙🦋 https://t.co/2z9RtVUMhG Tickets available @ https://t.co/CRkGxpzYQ2 Happy Mother's Day to all the mommies in the land &amp; of course my mommy Patricia Carey ♥️ Remembering this moment with \"The maestro\" Luciano Pavarotti! https://t.co/Tn7HPuqF18 Happy Mother’s Day to you all from me and @PremierDeadSea_! Enjoy your special day with an additional 10% discount on all Premier Dead Sea products, using coupon code MARIAH 💞 https://t.co/9UlzmdDpAy https://t.co/fhAn0mwPGS My heart is shattered today hearing about the passing of this beautiful soul Larissa Podermanski. Thank you for listening to my music, I'm grateful to have gotten the chance to know you and your spirit. Sending my deepest condolences to the family. Rest in Peace, my friend. 💔 https://t.co/ixtvlZniwT Happy Mother's Day Weekend! Treat your mother like royalty today with a gift from Tresor Rare. Use the coupon code MARIAH for an additional 10% discount! @TresorRare_ https://t.co/pFaqNec61i https://t.co/UpDedIqGgC Excited to headline #Blackpool's @Livewire_Fest 2018 on Friday, August 24th! Tickets are on sale NOW! 🎙️🇬🇧  2018 on Friday 24th August! https://t.co/dYh0BE7SIA https://t.co/raeOdOWMxG My heroes!!!! 😢🤗 https://t.co/Ddezsoye5l I just didn't wanna give away my skill set in such a public arena! 😜 https://t.co/Z8IBPhFhjr Thank you @allure, this was fun 😂! I won't be singing the make-up tune, but I have many surprises for you in my new #Vegas residency #TheButterflyReturns 🦋! Tickets are on sale now! https://t.co/XHDswnjZG1 https://t.co/e6KAIVlItq Tickets to \"The Butterfly Returns\", my new residency at The Colosseum @caesarspalace are on sale now! See you in #Vegas, lambs!  🦋 #thebutterflyreturns https://t.co/XHDswn2ohr https://t.co/lYxGgi47Mj #tbt https://t.co/rjPDDVBH2W Message received and appreciated! 😂😘 https://t.co/ybUXcpaIAK #Lambily! Special fanclub pre-sale for THE BUTTERFLY RETURNS @CaesarsPalace in Vegas starts now! #thebutterflyreturns 🦋🎙️ https://t.co/XHDswnjZG1 https://t.co/MmON0CZjYC I’m thrilled to be returning to The Colosseum at Caesars Palace​ with a BRAND NEW residency, THE BUTTERFLY RETURNS, beginning July 5th! Fan Club presale starts Tue 5/1 before the public on sale this Friday at 10am PT! For tickets &amp; all dates visit https://t.co/OHpG7pZ7iY! ❤ 🦋 https://t.co/n0Xv3lXSK3 Lucky 7️⃣🎂🎊🎉🎈♥️#demkids https://t.co/TrAgrHNTs0 Pon de lab 🎙️🦋 https://t.co/0yDcGv2V5V awww that made my day! Congratulations!!! \"Time stands still and two hearts catch fire\" ♥️ https://t.co/aSzcWrINfX @AllAboutMariah 😘 RT @AllAboutMariah: #NewPictures wow The #Beautiful @MariahCarey !!!!!! https://t.co/AyTfN8g9Bf It's 5:15am here.. so, quite naturally I'm Pon de studio and everyone else is knocked out! 😂\"Late nights, playin' in the dark...\"#ntt Thank you for reminding me about the anniversary of My All! It was my only video directed by the late legendary Herb Ritts and remains one of my favorites to this day. RIP Herb Ritts. #MyAll 🦋 https://t.co/kpSlpo4PVl Just announced 🎙️ New dates in Malaysia, Macau and Singapore! More details @ https://t.co/iCGLcnrLHj https://t.co/i0jM0Wi4BS #tbt https://t.co/IFBE5YLwC8 @VibeMagazine @PrincessGabbara Thank you for choosing \"I Wish You Well\" for #1, as most people haven't heard it before 🙏 @Bush_Bluebyrne @MariahTrends I agree! 😄 RT @BET_Soul: Today makes 10 years since @MariahCarey's CLASSIC album E=MC2 released! Make sure you tune in at the top of the 9a, 5p, &amp; 1a… RT @VibeMagazine: 10 Years Later: @MariahCarey's ‘E=MC²’ tracklist, ranked\nhttps://t.co/FWgEFylBen (by @PrincessGabbara) https://t.co/FVvi0… RT @_mroan: Happy 10th Anniversary @MariahCarey's \"E=MC²\". Here's a little flashback of all the music videos from this era! https://t.co/mp… LOL!!! 😂💖💖 https://t.co/Z0VQmSaQWN I've been hard at work, feeling inspired by each of your stories and uplifted by your overwhelming support. Let's continue to encourage each other on our journeys. https://t.co/8bytv0oGRG I'm grateful to be sharing this part of my journey with you. @MrJessCagle @people \nhttps://t.co/jy1fOk4mMK https://t.co/9E2D2OTARo They booked me in a hostel... 😱 Full drama here: https://t.co/EMmzfyUTYS @hostelworld #ad https://t.co/3BMNE9ZqrV @PadmaLakshmi 😂💞 If you                          then you don't\ndon't love                   deserve\nme at my                    me at my https://t.co/pvDwOOvJsM So excited to add two more shows in Asia - Manila, Philippines on 10/26 @ Araneta and Magelang, Indonesia on 11/6 @ Borobudur Temple! More info @ https://t.co/iCGLcnrLHj 🦋💖🎶 #tbt what's your favorite song from #Daydream? 💖🎶 https://t.co/5yUH2GQjMg 50 years ago on April 4th Dr. King’s life was cut short but his dream still lives. \nShare your dream in the comments or post your own video. #DreamStillLives https://t.co/AyfRXT0qWP RT @StevieWonder: On April 4th, 1968 at 7:05 p.m. central time, Dr. King’s life was cut tragically short. 50 years later a need for his dre… #Easter Eve festivities with #demkids 🐰 https://t.co/t1wGdeQSe2 Visiting dembabies' classroom.. the only way to get me back to school 😂🦋 https://t.co/TBISR0sBJE #TBT #HappyAnniversaryWBT\n🎶 When you left I lost a part of me,\nIt's still so hard to believe,\nCome back baby please,\n‘Cause... https://t.co/uwRZXYbFXV RT @Jeff__Benjamin: @itscottmichael @MariahCarey Am I right or am I right? #HappyAnniversaryMariah https://t.co/5XokYnf1uW RT @fusetv: 1. Stunt, queen! 😍\n2. This Wu-Tang tee, tho?! 👌 https://t.co/ofN3ASvWUi I love seeing these! What are your picks #lambily? https://t.co/JsQPAfa0Um #327 ♥️ https://t.co/M65X5EdTVE Anniversary celebrations at the most festive place on earth! 🎉🎉 #disneyland #327 https://t.co/8ztOaVZnpg @TheLambsOfMIMI 👋 RT @PrincessGabbara: Happy anniversary Queen @MariahCarey 👑!!!! To celebrate the incomparable diva a.k.a. the GOAT, I wrote about (and gush… Kon'nichiwa Japan! Pleased to announce I will be coming to Osaka Chuo Gymnasium on 10/29 and Budokan on 10/31 🎙😊 I really hope to see you all there! For more details visit https://t.co/zbbHWeJJGI https://t.co/4S7K0IY4xh Happy birthday to the fabulous Miss Ross! Much love always!! 😘♥️ https://t.co/whbBHDYPxK RT @nickguillory: How adorable??? @MariahCarey, this is goals! https://t.co/KxPCRY7HGh Happy Birthday to the Queen of Soul, Aretha Franklin!! We ♥️ you! @ArethaFranklin https://t.co/Ex0GiX4dFv @ClaudeKelly ♥️ (but why take away the glitz &amp; glam? 😄) https://t.co/W7Tuu0DeLJ #fbf my best friend 🐶♥️ #NationalPuppyDay https://t.co/5ogPbsedAI 🙏💖 https://t.co/7yVjr1ZYrv So it WAS you!!! 😡🤣 @JKCorden https://t.co/d5WEdiFWpk \"That was ONE TIME!!!\" (Name that 🎥) 😂💖 https://t.co/TIi15t3rit https://t.co/rDPHRoaOYs 😂 https://t.co/llnbTjJFts RT @PopCrave: 20 years ago today, @MariahCarey releasesd \"The Roof\" as the third promotional single from her studio album \"Butterfly.\" The… Okay, so it's 5 am.. pon de booth! 🦋💖 https://t.co/ZpN8S6iG6S I remember!! ♥️ https://t.co/3sMWfQX4uH What is it? 💖 https://t.co/7LMemNrw2s Pon de studio 📝 Happy St. Patrick's Day! 🍀😘❤️ https://t.co/HqCiECYrEH I'm a wee bit Irish! ☘️☘️ Happy St. Patrick's Day! https://t.co/bjC4fpEG8q @ShellyAkaSpanky 😘 RT @EddieGriffinCom: #ThrowbackThursday with the incomparable vocalist songbird Ms. @MariahCarey music video for #Honey got to show off my… Every time I feel the need, I envision you caressing me and go back in time... 🦋🎶 #ntt https://t.co/ZVxqY9iWLe #tbt Happy International Women's Day!!!  #MissMonroe #InternationalWomensDay #GirlPower 💕💗💕 https://t.co/BoT9pFl81a Honored to be on the cover of @vmagazine this month. Read about my new musical chapter &amp; more @ https://t.co/F6y2Er9HqN\n🦋 https://t.co/IV04fwaAjW RT @vmagazine: .@MariahCarey is in full bloom this Spring, back in the studio and happier than ever. https://t.co/4S23qSncqA https://t.co/J… V Magazine 🦋 March 2018 @vmagazine https://t.co/IQX7rxJSkn Please sign the petition in support of #MarchForOurLives https://t.co/hzjgHgObul @AMarch4OurLives I couldn't possibly choose! They're all my babies 🦋😘😊✍️ https://t.co/YXgtD66qQ4 Thank you lamby 😘 https://t.co/EZr4yjeNBv 😂 it's a moment, dahhling!! https://t.co/irs1dQ6qnc 📝 https://t.co/YZs2pztWuC Hey lambs, The Star🌟 is out now on Blu-ray! Pick up your copy today and sing along to me on the bonus features 🎶🎶 @thestarmovie https://t.co/OH9I7rm2qM https://t.co/grbz9ajQOs @MCsButterfly1 😂 I liked seeing what the lambs chose Honored 🙏♥️ https://t.co/buBcySMY7a RT @MariahTrends: .@Billboard praises @MariahCarey’s “We Belong Together” as one of the Best Love Songs of the 21st Century: “It's hard to… Happy Valentine's Day #Lambily!! Tag the person you can lean on when times get rough ♥️♥️♥️ #ValentinesDay https://t.co/Ms0SiScNYh It's beautiful, I love it!! Happy #ValentinesDay ♥️☕ https://t.co/UKVoumE5zo 😍🐶 https://t.co/QoKGLKviSv Come onnnnn!!! Look at this face 💞 https://t.co/On6WI8mDbn Going through finalists now 😂🐶♥️ https://t.co/DhwXahY4WJ Soorrry 😊 I can't even choose myself! #lambs vote for your fav songs on my IG @mariahcarey https://t.co/BQSlXvswr8 RT @ITVLorraine: ❤️ @MariahCarey is looking for a Valentine's for her pup Cha Cha... look no further, Mariah! \n#Angus https://t.co/YluBXi64… Cha Cha is looking for a Valentine! 🐶💞 Any takers? 🐶 https://t.co/hPzrVqheSi RT @PopCrush: .@MariahCarey's unforgettable \"Touch My Body\" turns 10 today! 💋 We're giving her what she deserves and looking back on why it… \"Well done you!\" 😃 (said like Claire Foy as Queen Elizabeth II in @thecrownnetflix) 👑 #MattSmith #LilyJames @adrianhansel https://t.co/s0RT8usZIq Hey guys! I’m very excited to share that The Star⭐️ movie is out now on Digital! I hope you love the film as much as I do 🤩 #TheStar https://t.co/wjw8d3OnNV Australia &amp; New Zealand! Tickets for my shows in October are on sale now! 🎶💖 https://t.co/iCGLcnrLHj https://t.co/bX1fCFUpGW It's snowing in NY!!!! I may have to go get another 🎄! (Thanks to my little brother Mike for taking the picture ☃️) https://t.co/SrqI5Jbrnk RT @VogueRunway: .@MariahCarey just proved she's the queen of Twitter: https://t.co/Hcj5LYTSBg https://t.co/lhHpKjF4df If @jermainedupri likes it... 😊 #ntt 🦋 https://t.co/Lu9DXsavLO Me too 😘🦋🦋 https://t.co/qctgE8Xl68 EXCLUSIVE: I also like dry kale chips 😂 https://t.co/AuHTBskD8b RT @fusetv: Come THRU @MariahCarey! 👑 The legend looked gorgeous tonight out to support her friend #JayZ at the @CliveDavis #PreGrammyGala… More time than I ever spent in my school's cafeteria LOL 😂💖🎶 https://t.co/oG3WPxzrDY Missed my 2nd home. Feels good to be back 💞💞 #StudioTime #GettingStarted https://t.co/YMttYhNC4u RT @ava: Today would have been Dr. King’s 89th birthday. He was murdered at age 39. Join @UnitedBlackout as we gather for our annual #MLKNo… #Lambily, you asked for it! Here are some tea-shirts for you 😊 😂☕\nhttps://t.co/8V5KZkhTEg https://t.co/d5tekGsiiD Only if we can alter the uniforms and wear diamonds as well 😊 @sharonstone https://t.co/WYOCc3yahu @smashleybell ♥️🦋♥️ Linner is inner! 😂🥂 https://t.co/kANpV4dslG Lol!! Love her!! 😘 https://t.co/iB8nndFwnK Last night was so much fun and empowering at the same time. I feel blessed to have stood alongside these strong, beautiful women! #whywewearblack #TIMESUP #girlsoutforlinner #GoldenGlobes https://t.co/ZH7lGHyyad (me) Dear Meryl, please forgive me!!! 🙌🙌\n(MERYL STREEP) You can take my seat any time! 😂😂\n💖💖💖💖 Got caught mingling on the way to the loo during a commercial break.. took the first seat available, happens to be right next to Steven Spielberg 😮😮 Cut to next commercial break, guess who comes back to her seat... Congratulations @Oprah! You are an incredible role model. Thank you for your inspiring and moving words and for everything you have done for me personally. You have changed my life. ❤ Congratulations \"This Is Me\"! A beautifully written song and very deserving 🎶💖 Marc &amp; I will try another year! Are they serving tea here? #GoldenGlobes RT @RyanSeacrest: The last time I saw @mariahcarey she was hitting the high notes in low temps. Good luck tonight dahling :) #GoldenGlobes… Very proud to be a part of #TIMESUP and stand in solidarity with all the women here on the red carpet as well as those watching at home! Join us at https://t.co/rirpXUxEwY #WhyWeWearBlack You guys are cracking me up with all your comments 😂😂😂 for those asking about #linner times- for as long as the kitchen stays open! https://t.co/MU3GooMTvW RT @TheKitchenista: It's official... brunch is dead 🤷🏾‍♀️ https://t.co/SR6P58N59d RT @mattstopera: @MariahCarey ended brunch RT @Essence: Linner vs. Brunch what’s the move? #linneristhenewbrunch https://t.co/NXmKiiXych RT @POPSUGAR: Don't you dare ask @MariahCarey to brunch 😂: https://t.co/aLzgA4oC7f A friend called and asked me to do brunch. Come on.. I don't do brunch, it's daytime!! I suggested linner instead 😂☕ (definition: a late dinner!) #linneristhenewbrunch #tbt to last year #goodbye2017 #happynewyear2018 🎉2️⃣0️⃣1️⃣8️⃣🎉 https://t.co/VCKsGcDXoE Standing in solidarity &amp; fighting for equality with all women around the world, in every industry. Today we say #TIMESUP on abuse, harassment, marginalization and underrepresentation. Sign the solidarity letter &amp; donate to the @TIMESUPNW Legal Defense Fund https://t.co/rirpXUxEwY https://t.co/BTo087Cd25 RT @shondarhimes: Time's up on silence. Time's up on waiting. Time's up on tolerating discrimination, harassment and abuse. #TimesUp Sign t… RT @kerrywashington: I stand with women across every industry to say #TIMESUP on abuse, harassment, marginalization and underrepresentation… Dearest Jennifer, I'm so honored to receive such a beautiful note from you, you've always been one of my favorite vocalists ♥️ Thank you for acknowledging the freezing cold weather and the necessity for hot tea!!! Much love and respect always!!! - MC #foundmytea https://t.co/XuP9SN0GJ8 That's pretty funny 😊 It wasn't done on purpose! 😯💞 https://t.co/BLeZV3A02L ♥️🙏 https://t.co/h8WTF1jvmM Found my tea! 🍵 https://t.co/r5EIIbT5Zw Happy New Year!!!! ♥️🦋🎉 https://t.co/7QMeQa5THV 🎊🎉🎊🎉🎊🎉\nFestive even in single digits! See you tonight, everybody!! @NYRE #RockinEve #HappyNewYear https://t.co/edR6fYSvbv It ain't over ! The party's not over!🎄☃️❄️❤️ #ourlastvacationday https://t.co/LoII79DYMo See you tomorrow @NYRE!! 🎉🥂 Tune-in 12/31 at 8/7c on ABC! #RockinEve https://t.co/CerSCUiKX5 Apreś-ski #MerryChristmas 🎿⛷❤️ https://t.co/yH3oTVNhxb Dahhling! Not till July 4th! 😉 https://t.co/uO4YqRRxU8 Merry Christmas!!! 🎄🎄🎁🎁🎅🏽🎅🏽 https://t.co/hyZulN6diB Merry Christmas!!! Thank you Santa and the reindeer for stopping by!  See you next year! ✨🎄🎅🏽❤️🦋 https://t.co/8de5vjfmVo All I Want For Christmas Is..........\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nYouuuuu, baby! 💖🎄\nhttps://t.co/bD9hgZr4BR 🎉🥂#AllIWantForChristmasIsYou #AIWFCIY on @Spotify! \nhttps://t.co/nF64FmdtgC RT @Mark_Beech: “All I Want For Christmas is You” by @MariahCarey is top @YouTube Christmas song: more than 100m views this December. https… RT @RyanSchocket: Congrats @MariahCarey. A song you wrote 23 years ago is the #1 song in the world right now. https://t.co/9xo9ljfE0o RT @mclamb4ever1: Yes M!!! 👸🏼✨🎄🎅🏼 @MariahCarey Keep breaking records Queen! https://t.co/FoBak3LnNY Take 2. #RockinEve #NYE 🎉🥂\n\nhttps://t.co/Zdo8ngYNFx https://t.co/qkgmJhVLlU Merry Christmas! Jay's ensemble is so much more festive than mine! 😉😊🥂 #rocnation #JayZ https://t.co/Ocxm7ibv6p Soooo festive!!! 🎉💫 Thank you #Lambs!💝🐑 Thank you @SonyLegacyRecs 📀🎶 #moments #AIWFCIY 🎄🎅🏼🎁❤ https://t.co/3sMLkwCm0Q I had the most amazing time starting the holiday festivities with my fans and hope you had as much fun as I did! Wishing you all a safe holiday and a very Merry Christmas! -- Love, MC #AIWFCIY #Lambily #MerryChristmas 🎄🎅🏼🤶🏼🎁🎉💫❤ https://t.co/xxvGCEObmY With only one show left on my \"All I Want For Christmas Is You\" tour, I wanted to thank everyone that came to celebrate Christmas with me in New York, Las Vegas, Paris, Manchester and London! #AIWFCIY 😘♥️🎄🦋🥂 https://t.co/EvkTNHpjSm Thank you @peta for this honor!!! ♥️♥️♥️🐕🐕🐕#AnimalsForLife #Jack #JJ #Chacha #Jilly #ReverendPow #Mutley https://t.co/Nnsyd9ENsB yay!! #StreamMariah 🎶💚❤️🎄 https://t.co/QQO8EbZzj4 haaa!! I love @netflix ! currently watching the Crown! https://t.co/USFO6hznr5 RT @MariahTrends: .@MariahCarey has had a @Billboard top 10 hit for three consecutive decades. #AIWFCIY #Longevity #Mariah10s https://t.co/… New Dates and information for current ticket holders available here: https://t.co/uCQ8SwBAYO An update for my lambs in Australia &amp; New Zealand! I have exciting news for you. We're now planning a much bigger tour in 2018! Because of this we're moving the Australia/NZ dates a few months to October. I’ll be kicking off my tour with you then &amp; can't wait to see you all! 🌏🦋 https://t.co/v7caO5HSjr RT @billboard: .@MariahCarey's 1994 holiday classic \"All I Want for Christmas Is You\" finally hits the #Hot100's top 10, dashing to No. 9!… 💕🎅🏼😉 https://t.co/mHgM4PxiyB RT @billboard: .@MariahCarey reacts to \"All I Want For Christmas Is You\" hitting #Hot100's top 10: \"It truly warms my heart.\" (exclusive) h… Can't even know what to say other than thank you to my #lambs worldwide!!!🙏🙏🙏 https://t.co/xAvmNFeViF Last minute Christmas shopping? Order the Butterfly vinyl + tee bundle by tomorrow and get it by Christmas! 🦋🎁🦋  https://t.co/TqahJknVT8 https://t.co/RGqlZo8jOb RT @officialcharts: So. CLOSE! @MariahCarey's All I Want For Christmas Is You returns to Number 2 on this week's Official Singles Chart - m… RT @AppleMusic: .@MariahCarey's #MerryChristmas album on repeat for the next 11 days. 🙌\nhttps://t.co/Ui9hF7cUr5 Get the limited edition of my \"All I Want For Christmas Is You\" movie soundtrack at @walmart in time for Christmas! https://t.co/pP1tWsgh6H https://t.co/IVKGBa7Kjl The limited edition of my \"All I Want For Christmas Is You\" movie soundtrack is available to stream &amp; purchase on @amazonmusic! https://t.co/K2eltUL2Ew https://t.co/bzwxWcHZsx #Lambily get into the Christmas spirit with me and stream \"All I Want For Christmas Is You\" on Spotify, YouTube and Apple Music! 🎄🎅🏼 #AIWFCIY #StreamMariah https://t.co/srzJxnNUS4 https://t.co/kkAUlwQnl9 RT @MCConnection: You can support @MariahCarey's All I Want For Christmas Is You this festive season by streaming daily &amp; purchasing a down… RT @SonyPictures: Congratulations to @MariahCarey and Marc Shaiman on their @GoldenGlobes​ nomination for Best Original Song for THE STAR.… RT @TheStarMovie: Congratulations to @MariahCarey and Marc Shaiman on their @GoldenGlobes​ nomination for Best Original Song for THE STAR.… 😯😯😯🙏🙏♥️🐑 https://t.co/CInc4URAJq RT @MariahCareyAU: It was a sold out event at @TheO2 to see the Queen of Christmas - and she didn’t disappoint! @MariahCarey looked &amp; sound… Cheers, toast.. 🍾🥂 #grateful Thank you Manchester and London for being incredible audiences! #TheStar 🌠 #AIWFCIY🎄🎉🎁🎅🎄 #GoldenGlobes https://t.co/Y8fo0bIB0T Thank you so much to the #HFPA for the Golden Globe nomination for The Star. As songwriters, myself and my dear friend and collaborator Marc Shaiman are truly honored. What a humbling experience to be included in this group of amazing songwriters. #TheStar 🌠#GoldenGlobes https://t.co/Hw3O11bUEY Writing our letters to Santa Claus! 😄🎅🏽❤️ #AlliWantForChristmas #TheStar #NorthPole #IKnowHim https://t.co/6wIFPrxVRk Check out the festive video for Lil Snowman! 🎅🎄🎁 https://t.co/UuW0MXE0P3 Sending love and prayers to all those affected by the fires in California. Be safe everyone! 💝 Thankful for our incredible firefighters and rescue-workers #Heroes🙏 I'm so grateful and still overwhelmed by the success of this song. Thank you to all my fans around the world for your continued love and support every year! Excited to bring my \"All I Want For Christmas Is You\" show to Europe this year 🎄🎅🏼🎁💝💝💝 #AIWFCIY #Lambily https://t.co/frcvj8sf34 @nickmaslow @EW Thank you, Nick! 😘 RT @nickmaslow: I had a religious experience at @MariahCarey's Christmas concert and wrote about it for @EW: https://t.co/VfjCeOIveK https:… Personalize your \"All I Want For Christmas Is You\" products on @Walmart 🎅🏼🎄\n\nhttps://t.co/lxsNmg09hn https://t.co/M5RhkQmOYt #Lambs, bring the Family together this holiday! For a limited time get a FREE soundtrack download card with a purchase of @ALLIWANTMOVIE now on Blu-ray and DVD. https://t.co/2964inUIF0 https://t.co/qAndtx6BPq Forever my favorite 💖🦋\nhttps://t.co/TqahJknVT8 https://t.co/UwGKEsTEXx Trimming our #nyc tree 🎄🎉🎀🎁💖 https://t.co/qRqM4fHrCU RT @sesac: Happy 15th anniversary to Songwriter Hall of Fame nominee @MariahCarey's #Charmbracelet! Take a trip down memory lane and listen… Chills\n🙏🙏\n#Lambily #AIWFCIY https://t.co/5NZz5ZoR5X Thank you New York!!! So happy to be back at the @beacontheatre for the 4th year 🎉🎉🎄🎄 See you on Monday 💖 #Lambily https://t.co/uhKCtHwA4s LOL 😂 https://t.co/6DJuTjM6og Thank you to all who came out last night to help raise awareness for World AIDS Day ♥️ @aidshealthcare #AHFWAD #IAMAHF #AHF30\n📷 @GettyImages https://t.co/6dFjXmqxL8 Calling all NYC #Lambs! I'm giving away 2 tickets to each of my Christmas Shows at the @BeaconTheatre! Just use the hashtag #MariahBeacon and let me know why I should pick you! 🎄🎅🏼🎉 https://t.co/obO5Q6m9wN #Lambily\n@GIPHY https://t.co/mwrMSNI2rv RT @SonyMusicGlobal: The @MariahCarey x @GIPHY channel is now live and it has everything you need for your holiday tweeting needs 💁 https:/… RT @MarioLopezExtra: Getting festive with the Queen Of Christmas @MariahCarey \n\n#GoBackLikeBabiesAndPacifiers https://t.co/M4ocVLvOSq Feeling better and back at work! Looking forward to seeing you today at the World AIDS Day 2017 concert and then starting the Christmas tour festivities! 😘💖🎄🎅\n@aidshealthcare #AHFWAD #IAMAHF #AHF30 https://t.co/BoBaGnn8cz #Lambily, get an early start on your Christmas shopping and check out my new \"All I Want For Christmas Is You\" collection! 🎅🎄🎁\nShop now at https://t.co/8V5KZkhTEg https://t.co/A1hsM1HOTq LAMBS! I can’t wait to see you TOMORROW (11/30) at the @aidshealthcare World AIDS Day Concert! To join this important global conversation use the hashtag #AHFWAD and make sure you follow @aidshealthcare on Instagram and Twitter for LIVE UPDATES from the big day! #IAMAHF #AHF30 https://t.co/Q9sdmn8hFM ♥️♥️♥️ https://t.co/z2a50LfA7Y #Lambily, send a custom \"All I Want For Christmas Is You\" digital greeting card to your loved ones! 🎅🎄🎁 https://t.co/ZcZoFAquTh https://t.co/x88O3FgFMO https://t.co/XCkviaV5lO https://t.co/Os2r6UySoU Biggest Sale of the Year - Black Friday Starts Now in the official Mariah Carey Store!  Save 25% off using code “BF25” + Free US Shipping on orders over $50 now through Monday &gt;&gt; &gt;&gt; https://t.co/8V5KZkhTEg https://t.co/CUsoe3gxS5 Happy Thanksgiving everybody 🦃!!! I'm still under the weather 🤒 but grateful to be able to celebrate with family and friends ♥️ #tbt #tbthanksgiving https://t.co/6oDG0dA1Xp I’ve partnered w/ the AIDS Healthcare Foundation to spread awareness \nfor World AIDS Day with a free concert in LA! To enter for a chance to win\nVIP seats, visit https://t.co/HvZuyGFGpe &amp; write #TeamMariah! Winners will be announced on @AIDSHealthcare #AHFWAD #IAMAHF #AHF30 https://t.co/R5CPdViuOd Get an autographed booklet with purchase of my new \"All I Want For Christmas Is You\" soundtrack while supplies last at @officialfye 🎄https://t.co/XNs6DAY6b4 it was super festive, dahhling!! those puppies!!! 🐶🐶🐶💝💝💝 https://t.co/ljgLwYxHKj Thank you for the amazing opportunity, @DeVonFranklin ❤️❤️ https://t.co/Mr2iYrSZEH 😘🎅 https://t.co/5SWAqPOXcC Devastated to hear about the passing of my friend Azzedine Alaïa. Mr. Alaïa was a genius and an incredibly kind man. Thank you for everything. R.I.P. https://t.co/DD2u5VVbDl RT @Vevo: The queen of the holidays is kicking off the season with \"The Star.\" Watch @mariahcarey's new video now: https://t.co/fnt6AYPBN2… Early Black Friday sale starts now in the official Mariah Carey Store!  Save 20% off TODAY ONLY using code “EARLY20” + Free Shipping on Orders over $50. https://t.co/gFwDVDTo99 https://t.co/CAsKrkXCjE RT @AmazonVideo: Special announcement from @MariahCarey: #AllIWantMovie is now available to stream exclusively on Prime Video! https://t.co… RT @LiveNation: Listen to the soundtrack for @MariahCarey’s animated film ‘All I Want for Christmas Is You’, featuring her new song “Lil Sn… Spread the holiday cheer with your family! My new movie, All I Want for Christmas is You, is available on @iTunes! #AllIWantMovie 🎅🐶 https://t.co/McEHWmDqjg 🎶 Follow that star above you🎶#TheStar 💫\nhttps://t.co/0HX2pMB1yE Excited for the exclusive premiere of The Star 💫 music video on @ETnow tonight! #WatchingFromBed #SickYetFestive https://t.co/8THAPao2xs https://t.co/w4yUgrDmzb Get your Blu-ray or DVD copy of my all-new holiday film, All I Want for Christmas is You at Walmart or https://t.co/s4lphLGEX3 today! 🎅🐶 https://t.co/xtH49GvoB6 I’m so excited to finally share my new movie with you! Get All I Want For Christmas Is You TODAY on Blu-ray, DVD &amp; Digital! #ALLIWANTMOVIE🎅🐶 https://t.co/QMEHAaAeCK Listen to my new Christmas song LIL SNOWMAN⛄❄ and the soundtrack for #AllIWantMovie on @AmazonMusic and tell me your favorite song! https://t.co/NAeRv40wpw https://t.co/rxOl7u50NQ RT @YahooEnt: .@MariahCarey on how her movie blends a love for pets with her hit song ‘All I Want for Christmas Is You’ https://t.co/YGhgvq… RT @UKAsh: @MariahCarey looked amazing on UK's @ITVLorraine earlier today. https://t.co/aJqTaoyNTW It’s #WorldKindnessDay! Share a hug with a loved one! #ALLIWANTMOVIE 🎅🐶 @AllIWantMovie\nhttps://t.co/0F2ue3mcQd https://t.co/WCenkiu4hX RT @billboard: .@MariahCarey reflects on \"All I Want for Christmas Is You\" and her growing holiday mini-empire https://t.co/luNiVv6J4v http… RT @idolator: \"Lil Snowman\" is @MariahCarey's latest flawless Xmas anthem: https://t.co/XABGeQgFyB https://t.co/Bq2MCbEaCP It’s almost time! Get my new movie, All I Want for Christmas is You, TOMORROW!  #ALLIWANTMOVIE 🎅🐶 @AllIWantMovie\nhttps://t.co/0F2ue3mcQd https://t.co/b20GaOf8Xf Can’t wait for you to hear my new soundtrack for the #ALLIWANTMOVIE! 🎅🐶Stream it now on @Spotify https://t.co/VsaKAIFDPy RT @FirstTimeMomMN: After seeing @AllIWantMovie twice my three dog loving kiddos have a newfound appreciation for our family dog. Get your… My new soundtrack for the #ALLIWANTMOVIE 🎅🐶 is out NOW! Check out the new song LIL SNOWMAN ft. Miss Monroe Cannon 😍  https://t.co/DvZarJUKbs https://t.co/VhHqUQ0V28 My new song LIL SNOWMAN &amp; the soundtrack of my animated movie \"All I Want For Christmas Is You\" are out now! 🎅🐶\nhttps://t.co/n1GYe9UQOG https://t.co/hx7lrjQVi5 Wow!! The limited edition of the 🦋BUTTERFLY🦋 vinyl has sold out! Thank you so much for all the support!! 🐑❤  Due to #lambily demand, we have made an exclusive fan bundle with the picture vinyl and a Butterfly T-shirt! Order @ https://t.co/TqahJknVT8 https://t.co/QFULtlAjiW RT @billboard: Mariah Carey, the artist w/ the most No. 1 hits on the #Hot100, has been nominated for the Songwriters Hall of Fame https://… 1 week to go! My new movie, 🎄All I Want for Christmas is You🎄, is on Blu-ray &amp; Digital 11/14 https://t.co/0F2ue3DOeN #ALLIWANTMOVIE 🐶 https://t.co/hImMpqayGQ Blessed 🙏🙏 https://t.co/NW37J3tah6 #PrayForTexas #SutherlandSprings https://t.co/ZvS0n2H8X3 RT @RonConway: From SV to North Bay, time to #BandTogetherBayArea. Concert tickets on sale now @Metallica @davematthewsbnd @G_Eazy https://… RT @LiveNationUK: How's your playlist looking right now? Book your tickets to see Mariah Carey this Christmas 👉 https://t.co/RGPFUyMLN9 htt… Can't wait to bring my Christmas show 🎄ALL I WANT FOR CHRISTMAS IS YOU🎄 to Manchester on Dec 10 😘! Get tickets now @ https://t.co/jIbWC9RhFm https://t.co/yJABfY6nD8 RT @XHNorthAmerica: American singer @MariahCarey puts her handprints and footprints in cement at the TCL Chinese Theatre in #Hollywood, U.S… RT @etnow: .@MariahCarey fulfills her \"childhood dream\" at her hand and footprint ceremony. https://t.co/2PMIQWfB0i https://t.co/uXZZH1yHZD I ♥️NY 2 weeks left! My new movie, All I Want for Christmas is You, is on Blu-ray &amp; Digital 11/14 #ALLIWANTMOVIE @AllIWantMovie https://t.co/baY9z7tJ6U New York! I am adding two more Christmas shows 🎄🎄at the Beacon Theater on Dec 1 &amp; 2. Pre-sale starts tomorrow @ 12p!\nhttps://t.co/bIkDpj91bg https://t.co/M00s6wb6hY First performance of #TheStar🌠 ! Christmas 🎄 in October 😆 #thestarmovie @TheStarMovie https://t.co/NquKVsrY2J Paris #Lambily, I'm bringing my All I Want For Christmas show to you on December 9! Can't wait to see you! 🎄🎅💖 https://t.co/RQQ0SVx9zb Listen to my new Christmas song 💫 #TheStar 💫 now on Spotify\n\nhttps://t.co/T9zUXoVQ3b Christmas is early!🎄 Get THE STAR soundtrack now featuring my title track #TheStar 💫💫💫 https://t.co/bOzkYI1MRU https://t.co/lE2rLUwqm8 RT @vmagazine: The legendary @MariahCarey lights up the mic in honor of Karl Lagerfeld. https://t.co/P14ERCqTT3 https://t.co/7g7SknFQoQ RT @etnow: .@MariahCarey serenades the \"incomparable\" @KarlLagerfeld and hangs with @NaomiCampbell in New York. https://t.co/nh2Jr1bCqM htt… Honoring the incomparable @KarlLagerfeld @vmagazine https://t.co/1V7OJ2z3Mv RT @glittering_mc: .@MariahCarey and @KarlLagerfeld last night in New York City. https://t.co/zJT5Ude8OF 🎶🎶 follow that star above you🎶🎶 https://t.co/WRuNxZkcMS https://t.co/FovugEMwAu RT @POPSUGAREnt: Excuse us while we jam to @MariahCarey's brand-new Christmas tune, \"The Star\" ⭐️ https://t.co/QnasmDjyW0 Tickets are on sale NOW for my Australian #1's tour dates! Get yours @ https://t.co/Sa1iBKB0f0 https://t.co/6ujoC5PnRo RT @MariahTrends: Out Today on #Vinyl: @MariahCarey’s gorgeous new picture disc commemorating the 20th Anniversary of her magnum opus, BUTT… RT @BUSAPAR3: New #mariahcarey #vinyl #Butterfly and #merrychristmasiiyou @mariahcarey please pick up your copies now! #music 🎶 https://t.c… RT @blackoutbaby09: ITS HERE 😭😭😭 @MariahCarey #Lambily #Butterfly https://t.co/36C1MnX6Gg RT @106th: got my @MariahCarey #Butterfly 🦋 20th anniversary-edition vinyl today! an over-the-top photoshoot was the ONLY appropriate way t… RT @CallumEdwardsUK: Just got my copy of the greatest album ever recorded - @MariahCarey’s #Butterfly on vinyl. What an inspirational recor… Get in the holiday spirit with my new song #TheStar from @TheStarMovie soundtrack! Listen to it today: https://t.co/WRuNxZkcMS 🌟 https://t.co/WIr0x9eGCL Surprise! My new Christmas song THE STAR is out now! #TheStarMovie  🌠🎄\nhttps://t.co/bOzkYI1MRU RIP Voodoo Ray. A great person with an incredible heart. You'll be missed. 💔 Celebrate Butterfly's 20th Anniversary with a special picture disc vinyl! Order now @ https://t.co/5F0WJcZlux https://t.co/SNrd4ueAPa Thank you @FoxwoodsCT, thank you #lambs for all your support, I enjoyed you!! 😘😘🤗 https://t.co/kzvoqVYmyu RT @LironD: Is she serious with this? #VOL #Slaying \n@MariahCarey snatching wigs since 1990 https://t.co/9YVUgVJWde RT @gtinari: Well @MariahCarey killed it at @foxwoods last night. Looked and sounded flawless. Legend. https://t.co/ijkdwrWaYe Excited to be a part of #TheStarMovie soundtrack - pre-order it today, out everywhere October 27th! https://t.co/WRuNxZBNEq https://t.co/OBoDrtrh17 Australia &amp; New Zealand! Full dates and venues now announced for my #1's Tour in Feb! Sign up for presale access @ https://t.co/pJ1015ccgO https://t.co/mIV4NYLOGk Australia and New Zealand! I'm bringing my #1's Tour to you this February! Sign up to get presale access at https://t.co/pJ1015ccgO 💖🇦🇺🇳🇿 https://t.co/CFQKzFtB5X This holiday season, witness the story of the first Christmas...through a whole new set of eyes. Watch the new #TheStarMovie trailer now! https://t.co/Bi7rUMe7lr @lindsaylohan @AllIWantMovie Haaa yes!! on Wednesdays we wear pink! 👗💕#MeanGirls https://t.co/Sh9JADQG7t RT @SonyLegacyRecs: Celebrate 20 years of @MariahCarey’s ‘Butterfly’ hitting the top of the @billboard 200 #OTD with the new picture LP: ht… The All I Want For Christmas tour is coming to the US &amp; Canada! 11 new Nov+Dec shows🎉 Presales begin today @ 12pm!🎄🎶 https://t.co/iCGLcnrLHj 🎄 All I Want For Christmas Is You tour is coming to Paris on December 9th at AccorHotels arena! Presale begins NOW 🎄\nhttps://t.co/RTwl5QbTOU Horrified to hear about the shooting in #LasVegas. My thoughts are with the victims and their families. Praying for everyone's safety 🙏💔 #Lambily tune in to @GMB #GoodMorningBritain now!  #Christmas #UK #Paris 🎄🎄💖💖 Thank you @VH1 for honoring me at #HipHopHonors. Tune in tonight at 9/8c to watch my performance with these amazing collaborators! 🍯🦋 https://t.co/SnxnsPEQM7 Happy anniversary #Butterfly! https://t.co/NngQPEhKlA\n\nThank you for the video @_mroan 😘 https://t.co/UPS712WviN Thank you so much #lambily!!! 💝💝💝  I have many more surprises for you this year+next 🦋🦋 Now back to work on #HipHopHonors! RT @SonyLegacyRecs: .@MariahCarey spread her wings with the release of 'Butterfly' exactly 20 yrs ago!🦋 Pre-order the new picture vinyl: ht… @SebastianCosmo Thank you! 💝 No other #Babydoll takers? 😂 I love this one! S/o @MissyElliott https://t.co/auECjSRfPw A personal favorite 😘😘🦋 https://t.co/3tI8APV7em Yaaaas! 🦋🦋 https://t.co/21YuHoQAYb I get emotional every time a fan tells me they can relate to this song. https://t.co/mmpv70487W Humbled and overwhelmed by your tweets. Thank you for celebrating #Butterfly with me 🦋🙏♥️ ... On that fourth of July...😍 #Butterfly https://t.co/F04tNwRKi4 @Carey4Mariah I wanna see it! 🐑 👇 this lamb wins! 😘 #outside #butterfly https://t.co/dYJY3WZ2vV Still true today 🌥️🦋♥️ https://t.co/arxBpdjXQh #NTT one of my favorites! #ButterflyAnniversary https://t.co/SGjOMcUrW8 🙏🙏 https://t.co/3X8acNuOad #NTT Lambily, do you know the rest? #ButterflyAnniversary 🦋 https://t.co/3voDNBf8Mj #Lambs, what's your favorite lyric from the album? 🦋🦋🦋#Butterfly #ButterflyAnniversary Can't believe #Butterfly is 20. I wasn't even born then! My fans &amp; I know that this is \"our album\". Happy anniversary, Butterfly! ❤🦋 https://t.co/4vIrkSRAPg RT @Essence: It's been 20 years since @MariahCarey's 'Butterfly' debuted, the iconic album that forever changed her career: https://t.co/lu… RT @VibeMagazine: 20 Years Later: @MariahCarey's #Butterfly Tracklist, Ranked https://t.co/7VkRWX0Prt https://t.co/ck0JT0Q35e RT @hellogiggles: A love letter to @MariahCarey's “Honey” music video on its 20th anniversary https://t.co/Gxzb5h9vZ7 https://t.co/MxxPUEPs… RT @BET_Soul: BUTTERFLY by @MariahCarey dropped 20 years ago and we're celebrating the greatness at 7a, 3p &amp; 11p ET. #Happy20thAlbumversary… RT @adelleplaton: hbd to my favorite album from MC 🦋 | #nowplaying \"butterfly\" by @MariahCarey in @TIDALHiFi https://t.co/aBix9DKqwl RT @Slant_Magazine: .@MariahCarey's #Butterfly turns 20 today! Revisit Rich Juzwiak's review: https://t.co/WMpMall9jY via @Slant_Magazine h… Celebrate the 20th anniversary of #Butterfly 🦋! Pre-order the Limited Edition Picture Disc Vinyl out Oct 20! https://t.co/NngQPEhKlA https://t.co/6Ag1xRJs2m RT @KimKardashian: My fave!!! https://t.co/K6Qpd1ZORT RT @MariahTrends: In celebration of the anniversary of #Fantasy and @MariahCarey's #HipHopHonors, here's the late O.D.B. on his love of M.C… RT @VH1: You DEF know this '90s game-changing diva, @MariahCarey​! 🎤✨ We're honoring this ICON Sept 18 at 9/8c! #HipHopHonors https://t.co/… RT @VH1: THIS is better than any sweet sweet FANTASY! ✨ We're celebrating the LEGENDARY @MariahCarey at #HipHopHonors! https://t.co/pjgndpC… Tickets on sale now!! https://t.co/6AcWMoBiRn That's a wrap on #AllTheHitsTour! 🦋 Thank you @lionelrichie, thank you #lambily  and see you at Christmas!!! 🎄 https://t.co/waC05CZppU RT @usatodaylife: See the first photos from @MariahCarey's new animated movie 'All I Want For Christmas Is You' @AllIWantMovie: https://t.c… TONIGHT! @SugarFactory https://t.co/eugDbEVI6y RT @KeyArenaSeattle: What an amazing last set of the tour. Thank you @MariahCarey #simplyamazing https://t.co/wfV6Te2PeE Here’s the first look at my brand-new animated film, Mariah Carey’s \"All I Want For Christmas Is You\"! #ALLIWANTMOVIE @AllIWantMovie https://t.co/eOk0tTz89V RT @laurenepowell: A terrible day. But a day that will elevate millions to stand up for #Dreamers. Congress, we’re all watching https://t.c… Honey B. Fly pre-sales are starting now for the 'All I Want For Christmas' UK shows! Get your tickets now @ https://t.co/IdiCFTMHvr https://t.co/wcUVHLN4UC Meet Little Mariah! It was a dream come true helping to create this character in my upcoming animated movie! #ALLIWANTMOVIE @AllIWantMovie https://t.co/35zEZgvia3 Excited to bring my 'All I Want For Christmas' tour to Manchester+London this December! 🎄🎅 Tickets avail Sept 8 @ https://t.co/JYcZCN1A6m https://t.co/471Sy3Zjoz RT @MariahNetwork: Chills. Every time. Everything dark but @MariahCarey, singing her ass off! #TheVoice https://t.co/UReQVcEaEq RT @CalebMosier16: I never wanna hear \"Mariah Can't Sing\" or \"Mariah's Not Relevant\" ever again! THIS WAS AFTER HER AND THE BAND WALKED OFF… RT @JeremyGoldMedia: Auntie had Denver SHOOKETH in the fashion game last night!! 😍😍😍😍@MariahCarey #lambily #AllTheHitsTour https://t.co/6kh… RT @divos: AFTER @MariahCarey had left the stage. WE were shook Sunday night!! #onlyalegendcan https://t.co/yuQP5KBNPT Happy birthday to the King of Pop, Michael Jackson!! We will love you forever ♥️ https://t.co/UfGTtAIDAd RT @Balmain: In @VogueMagazine's video featuring @MariahCarey, #DemBabies are seen wearing #BALMAINKIDS #BALMAINARMY https://t.co/r95o9Ddn3q RT @Essence: .@MariahCarey talks about her feature on @FrencHMonTanA's 'Unforgettable' and other potential rap collages: https://t.co/dqKtd… RT @billboard: .@MariahCarey talks \"Unforgettable (Remix),\" touring with Lionel Richie &amp; upcoming Christmas movies https://t.co/ePjXwRQDX7… RT @InStyle: .@MariahCarey's daughter Monroe sang on stage with her mom and obviously nailed it: https://t.co/eNMnty5NDS Thank you @voguemagazine for coming by ! 👠 👢👡👗👜 https://t.co/QfTuWmbxHK RT @QueenriahCarey: THAT RIFF THAT FALSETTO IM QUIVERING #Visionoflove  #AllTheHitsTour https://t.co/FFBywLWcAm #Hero ♥️\n#Chicago #unitedcenter #AllTheHitsTour https://t.co/ZErndoby7F Happy anniversary #Honey and happy #NationalDogDay! 💖🦋🐶🦋🐶🦋💖 https://t.co/PAKwDPjZZy RT @MariahCareyAU: Today marks the 20th anniversary of @MariahCarey's career re-defining #1 hit, #Honey. Classic song + amazing remixes + i… RT @_mroan: Happy anniversary @MariahCarey’s #honey! https://t.co/A6Tctye6TX RT @AllIWantMovie: Happy #NationalDogDay! Introducing the cuddly “furriends” in @MariahCarey's all new animated movie... #ALLIWANTMOVIE htt… 🔥#Unforgettable 🔥\nVevo https://t.co/tQq75NNJQ3\nSpotify https://t.co/dcdm2XGanQ\nApple https://t.co/Jh2kiDJX45\niTunes https://t.co/1KWOVMT0xl 💖💖 https://t.co/4LDFqi4UgM RT @billboardhiphop: .@MariahCarey adds her sweet touch to @FrencHMonTanA's acoustic \"Unforgettable (Remix)\" https://t.co/ewy1TBEGZR https:… 🔥🔥🔥#Unforgettable #Remix &amp; #Acoustic out now everywhere! 🔥🔥🔥#NewMusic \n🦋 https://t.co/1KWOVMBp8L 🦋 Thank you #Toronto!!! I love you so much!!! ❤️💕🦋💕❤️ #Lambily #AllTheHitsTour https://t.co/Y2bRWdZ8nb RT @DamnitMaurie: Those who @mariahcarey together stay together! https://t.co/XncjsnsMnZ 😮😮 https://t.co/Sz58Lu0UZm Yes I do! 😘 #L4L https://t.co/AZOzOpNYWH 🎶 #Unforgettable #Remix + #Acoustic 🎶\n🔥 French Montana x 🔥Swae Lee x 🔥MC \nOut 8.25 @ 12am! 🌎 #NewMusic\n@FrencHMonTanA @goSwaeLee https://t.co/IjAP8JbUHU Celebrate the wrap of #1toInfinity in #Vegas with limited edition merch now available on my official store! https://t.co/hoB7tGVFgk https://t.co/RXVQ0bvGGZ Bringing glitz ✨ glamour 💃&amp; #AllTheHits 🎶 to #Boston tonight! @tdgarden ✨ https://t.co/rR4VlN9rXn RT @papermagazine: \"I've never had a diva moment.” --@MariahCarey https://t.co/dnKLcM46nk #VivaLasPaper @papermagazine 💝💝💝 it's all about #Vegas, baby!! https://t.co/hKA3wcDD7E RT @MariahCareyAU: Photos: @MariahCarey dazzled the audience &amp; critics at @TheGarden last night. Queen of New York! 👑 #AllTheHitsTour https… RT @adelleplaton: .@mariahcarey just gave me my entire life 😭 #allthehitstour https://t.co/nB32BguKKA RT @TheGarden: MIMI playing all the hits tonight at The Garden! What’s your favorite song that @MariahCarey  performed tonight? #AllTheHits… #mysquad #curlyhaircrew #newark @PruCenter  #allthehitstour getting ready for you #nyc @TheGarden !! 🎶💝🦋💝🎶 https://t.co/KDM9R8vHGu RT @papermagazine: We're bringing all the glitz, glamour &amp; glory of Las Vegas to life with @MariahCarey, one of our four iconic cover stars… RT @PaulFromFox5: A beautiful show from one of the most gifted vocalists of all time. @MariahCarey @Infinite_Center #AllTheHitsTour https:/… I had so much fun in #ATL thank you!!! 🙏🙏 https://t.co/JdZQc6hHfn And I love you too 😘🙏 https://t.co/72DFQallxk Thank you #ATL for an amazing show!!!💖💖💖 On the way to #Philly now 🚌 #tourlife #bleakyetfestive #AllTheHitsTour https://t.co/7e2GQEKyHz RT @SugarFactory: Concert After Party for guest of honor @MariahCarey @SugarFactory at Ocean Drive! Thursday August 10th https://t.co/MSEwj… @elvisduran Dear Elvis! Happy happy happy happy birthday !!!! I would say \"happy anniversary! \" We love you so much! 🎉🎉🎉 Thank you for the laughs #lambily 😂 here's an outtake for you! #j4l #rollingstonevibes \n\nhttps://t.co/wsX3JpsWK3 https://t.co/l87v3Lq5Wu 🙏💖 https://t.co/TlT2zuxOZY RT @AACenter: Can't wait to see you tonight either, @MariahCarey!! https://t.co/q6SZhm4pa3 Thank you so much for everything @tylerperry 💝💝💝💝 https://t.co/fLwC5Go4Ma 🙏 Billboard &amp; thank you to all the 🔥🔥fans who came to the show last night at the #HollywoodBowl and gave me such festive! 🎉🎉 I 💖 you!! https://t.co/QAGRH09U1Y 😍😍😍 #AlwaysBeMyBabies https://t.co/MbQlIf91LT RT @TheGarden: Catch @LionelRichie with very special guest @MariahCarey at @TheGarden on Aug 19! Check out our playlist now! https://t.co/w… RT @carlyjsteel: .@MariahCarey bowled over the #HollywoodBowl last night! only @etnow backstage all access for her epic performance, tune i… 😘 https://t.co/F7n8tvf324 RT @willpowerpacker: #TBT After @girlstripmovie shoot @Tiffanyhaddish told @MariahCarey how inspirational her music was. Then Mimi told a j… RT @etnow: .@MariahCarey kicks off her #AllTheHitsTour and reveals her 3 must-have items when she goes on the road. https://t.co/JTyvCCVcwi… Very excited to share a tease for the new movie #TheStarMovie which will be out in theaters in time for Christmas! #NewSong #TheStar https://t.co/uRhGKugC8k RT @Golden1Center: Full house &amp; we are all so obsessed with you @MariahCarey ❤😍 https://t.co/pgoOqfaOyI #Lambs, I'm bringing my #AllIWantForChristmasIsYou concert series to Las Vegas!!! Tickets available now! Get yours @ https://t.co/5SFZKXtElU https://t.co/DBnxk7PZeC I had a great first show, thanks to all the fans!!!! I love you guys so much! #Lambily #L4L https://t.co/kmWeLNjUVN RT @LiveNation: It's finally showtime! @MariahCarey is joining @LionelRichie TONIGHT to kickoff #AllTheHitsTour!\nDon't miss out -&gt; https://… #AllTheHitsTour with @lionelrichie starts tonight in Oakland! Lil' excited lil' excited 🤗🐑 2 hours till showtime!! 🎶🎶 Get your tickets now!💖 https://t.co/rm6a1SNGoT I'm bringing my All I Want For Christmas Is You shows to Vegas!  🎶🎉🎄 Public sale starts July 22, FC presale NOW @\nhttps://t.co/iCGLcnrLHj https://t.co/0Xkb63MGmn Could you #BeatShazam? 🎶 Tune in tonight at 8/7c on Fox! @iamjamiefoxx https://t.co/5fUwIYaAMu Tune in to see me &amp; @iamjamiefoxx on Beat Shazam tonight at 8/7c on @FOXTV ! #BeatShazam https://t.co/Py4ufrMofx Back in Vegas, baby! Back tonight &amp; through July 18, see you at @CaesarsPalace  🦋 #1toInfinity #Vegas https://t.co/8AXft1fX3c https://t.co/TgnaEZYs0K Happy Fourth of July!!!!! 🇺🇸🌻 https://t.co/VRjCmRGtca Shark day with #dembabies ... don't worry, they're gentle #NurseSharks 🦈🦈🦈 https://t.co/JQ6TvQf2c4 Last chance to order my limited edition PRIDE collection! Time and quantities are running out!! https://t.co/pAoAZC0mZ4 🌈 https://t.co/9VlH4jjVrq Floating pon de Dead Sea #israel https://t.co/JSd5QuPuxz #deadsea #israel https://t.co/8Ir4gMgZkj @PremierDeadSea_ https://t.co/ZN7bZ7Y8HS Shalom Israel! Happy to be back here to collaborate with @PremierDeadSea_ 🇮🇱🌊 https://t.co/YazEJgFNF3 Thinking of the late, great George Michael on his birthday. We miss and love you ♥️ https://t.co/Ut4FrUlnk0 RT @MariahNetwork: #AuRevoirMariah @MariahCarey spotted leaving the Plaza Athénée hotel in Paris earlier today https://t.co/PpPcLAHWh5 Met some fabulous #lambs in Barcelona!! 😘🦋🌈🐑 https://t.co/A7o7CZKJjv RT @gillesakacake: Lil' Video, @MariahCarey in Barcelona (June 21) &amp; actually taking a pic of this Lamb's tatoo herself,she's THE best!\nhtt… #RIPProdigy Gone too soon 😞 https://t.co/r9vFxF4w7j My limited edition PRIDE merch is available NOW at https://t.co/pAoAZC0mZ4 🌈 https://t.co/5mohcHJoFw My limited edition PRIDE merch- available NOW at https://t.co/pAoAZC0mZ4 🌈 A portion from the proceeds will be donated to GLAAD #MariahPride https://t.co/hI7Li6zgtC TOMORROW 10AM https://t.co/pAoAZC0mZ4 https://t.co/u5mUCRXAX4 A belated congratulations to the Queen of Soul, Aretha Franklin 4 this honor.Well deserved accolade! @ArethaFranklin https://t.co/5JKwFxGhql THURSDAY 10AM https://t.co/pAoAZC0mZ4 🌈 https://t.co/iUEZnrDH56 Festive moments forever! 💖 https://t.co/iYUZLWWTRj Happy anniversary to my debut album #MariahCarey! Thank you to the #lambily for celebrating on this day with me😘#treatedmekindsweetdestiny \"typical Aries!\" 😉 https://t.co/uzGBVmnAPR the #lambily is so good to me! L4L!! https://t.co/XSAAoLALLw Thank you so much! That lil whistle surprised me too when I was listening to it before and I almost didn't hear it 😳 https://t.co/EAZcbRfC8A Just for the nostalgia, should you wanna hear a nice tune or two 😘🎶🎶\nhttps://t.co/zdKOdh3MiJ Thursday 10am PST! https://t.co/pAoAZC0mZ4 🌈 #lgbtq #happypride\nhttps://t.co/6us5hMiCG7 @lenadunham @laurenduca Feel free to invoke me anytime #girls! 🤗❤️ https://t.co/kOaTNm26hC @MariahNetwork @Billboard \"A marionette show, who's making you move though?\" https://t.co/SfypyIJdpq RT @MariahNetwork: What's your favorite/shadiest @MariahCarey lyric? My vote goes to \"I'm the press conference, you a conversation\" #NTT ht… 🌈🐑♥️ https://t.co/RHUUd5xKUc RT @glittering_mc: A limited edition collection by @MariahCarey is coming to https://t.co/2S6SdWBYAu in 5 days to celebrate #PrideMonth!… RT @MTVMusic: Celebrating the 25th anniversary of @MariahCarey’s MTV Unplugged. \nhttps://t.co/9o1KCS036T https://t.co/vynTYDgq12 RT @JWalkerDaniels: @BeatShazamFOX had a #VisionOfLove and @MariahCarey is happy! #BeatShazam https://t.co/JzwxH4OYif Happy Pride 🌈, everyone! #PrideMonth \nhttps://t.co/rPG3O6pF0S London, stay strong. Our hearts are with you and all those affected by this tragedy. #PrayersForLondon Can’t wait to see you at Foxwoods Resort Casino on Sat, Oct 14! Get your tickets now @ https://t.co/1IoHJmqmRo https://t.co/24Yff6EZIC RT @BevHillsJFC: Please help however you can https://t.co/xpNC9RZrBF https://t.co/VJO2RH2bkC Lambs, Fan Club Presale for my Foxwoods Resort Casino show on Oct 14 begins now! Get your tickets @  https://t.co/topaN1j9q2 Hi #Lambily!  I'm coming to Foxwoods Resort Casino on Sat, Oct 14. Exclusive Fan Club Presale begins 6/1 at 10am @ https://t.co/pJ1014UBpg Thank you to all our brave Americans who protect our beautiful country. https://t.co/j46lzUaoUB Thank you so much! Same to you and all the #lambs in the land! 💓 https://t.co/uxWvWKtyjd That's a good idea but I don't know (yet) 😁 https://t.co/U4AWivrmek RT @VibeMagazine: These Mariah Carey-Bruno Mars mashups are the best things you'll hear today https://t.co/DEbl6qD7xi https://t.co/DpqXGRRi… RT @Shazam: The lovely @MariahCarey stopped by to surprise contestants and visit @iamjamiefoxx on the set of @BeatShazamFOX! Such a great m… Last night San Francisco... lit! 🔥 Wish I was there! 😊 https://t.co/5ktgxXdyTR I love this!! #pip 💓 https://t.co/QaOovRHK6e Just getting in from a late night pon de studio! Left when it was time for \"OK so it's 5am\"  😄🎶 Devastated to learn that one of the victims in Manchester was part of the #Lambily. RIP Martyn Hett. We will... https://t.co/Nzbhb4Bi47 My heart goes out to the families of those who lost their lives in Manchester last night. My thoughts &amp; prayers are with you all. God bless. Happy birthday Shawnie 😚💞 https://t.co/nrkYcnsqOd thinking about the #lambily 🐑at the studio- hard at work enjoying myself🎙️ https://t.co/rgxwZ4QLaY I think you're 100% right! Tanaka's here saying the same thing 😊 https://t.co/rXe4TI33Fs Miss Monroe &amp; Rocky are singing and they're loving it! 🎶🎶 https://t.co/WGEbuxL4Kq I'm thinking of performing FADED at one of my upcoming shows. Thank you for encouraging me 😘 #Lambily Faded vs. Thanx 4 Nothin? https://t.co/Tu7iJHt5bY I guess you must have seen that I went grocery shopping.. it was a stone groove 🤣🤣 https://t.co/FBFtXSFtcU Wow, I haven't thought of that song in forever 😢Thank you for remembering it for me 💞 https://t.co/7Suh0hDVSD thank you SO much. Looking forward to the anniversary of #Butterfly this year 🦋🦋🦋 LYM 💞 https://t.co/chLZvowhq5 My house in the Bahamas is almost finished and I can't wait to finish my album there!! https://t.co/ui02J9VIhW \"Tour de force!!!\" dahhling.. I'm working on my new music and I can't wait to play it for you 😘 https://t.co/bkvvLvsfan Listening to new music I've been working on... super excited! 🦋🐏 Hi #Lambily- I'm up! Where are you right now? 😚 That was a fun moment 😘 #gimmeyourlove 🐑 https://t.co/C9H86L4UFM Staying cool and low-cal in So-Cal with my #SodaStream🥂👓 #ad https://t.co/ldEyDy6pnt RT @F1: Baku's #F1 party just got even bigger\n\nSaturday: @NicoleScherzy and @bep \n\nAnd now...\n\nSunday: @MariahCarey 👩‍🎤 ⬇️ https://t.co/5Eq… RT @BakuCityCircuit: Race hard, party hard! We are happy to announce that the #AzerbaijanGP weekend will be capped off with @MariahCarey 's… @ACKJr @LironD ♥️ @YoungJazzyHo @LironD Yeeees I love Side Effects!! 👊 For The Record 🎶..aaand I Wish You Well (and Last Kiss for you @LironD 😘) https://t.co/uvF0h6A7Gi RT @LA_Reid: Major congrats to incomparable @MariahCarey on the launch of #ButterflyMC Records. Big things coming. https://t.co/KTDk4N7YoT RT @billboard: Mariah Carey to release new album later this year #BillboardNews https://t.co/49oc5tvmn4 RT @TheMariahReport: Mariah Carey Announces A New Album And Forms Her Own Record Label via @forbes https://t.co/Ub2XsFTafD New music ☺️🎜 Hope you're as excited as I am! 🦋 #Lambily #ButterflyMC https://t.co/Xf2L9aXnvO Take #MariahsWorld home with you! 🌎🎉 DVD is available in stores April 11. Pre-order your copy today: https://t.co/FP0o59A8B0 https://t.co/vWroFhRTMG We miss you, George Michael 😢❤ My heartfelt tribute of \"One More Try,\" live in Dubai #fbf #OneMoreTry #GeorgeMichael\nhttps://t.co/xBfdsEYYEr Really moved by all your beautiful #anniversary messages 😊😊 thank you my #lambily I LYM!! #327 Thank you, Ellen! I'm festivating right now in fact! 😁💖 Miss you xoxo https://t.co/16JWsMUIXw RT @billboard: Happy Anniversary @MariahCarey! 🎉 https://t.co/uSHyQWIoTa RT @BET_Soul: #BETSoul is celebrating a Diva's Birthday! We are giving @MariahCarey a 3-hour long birthday block at 9a, 5p &amp; 1a EST!\nHappy… RT @BET: @nuttynette81 Ms. @MariahCarey celebrates anniversaries, not birthdays. #nowplaying I Don't REMix #MC @RealRemyMa  @yg 🔥🎶https://t.co/4cj1WWvpka RT @idolator: .@RealRemyMa hops on the remix of @MariahCarey's underrated \"I Don't\": https://t.co/A45CTzpoaz https://t.co/WHcrkXgzzz RT @RealRemyMa: When @mariahcarey calls...😊\nDon't REM-mix featuring @yg &amp; Me!!\n ...available on iTunes #iLoveMC #RemyMa #RemyMafia https://… RT @MariahTrends: European #Lambily! @MariahCarey's #IDontREMIX ft @RealRemyMa &amp; @YG now available on iTunes:\nhttps://t.co/q2XoijBVLM https… I Don't (Remix) ft. @YG &amp; @RealRemyMa is now available on iTunes &amp; Spotify! 🎵'cause when you love someone...🎵 https://t.co/4cj1WWN0bI https://t.co/N9RW2zAL9d #Lambily, plans for tonight? 🐑😘\nI Don't Remix ft. @YG  &amp; @RealRemyMa\n#IDont #Remix https://t.co/pX09wW1JVn A #Dream come true “All I Want For Christmas Is You” will be a movie. I am so thrilled! Follow @AllIWantMovie to learn more! #AllIWantMovie https://t.co/ZQNAjAA9xe 😘🎂🎉🎉🎉 https://t.co/QEqB4FNp0L My song is becoming a movie! You’re the first to hear about this exciting news! Follow @AllIWantMovie for more updates. #AllIWantMovie https://t.co/vb1j75eGZk RT @TheLEGOMoviesUK: Hey @MariahCarey, #LEGOBatmanMovie would be nothing without you,  I'll save Gotham against all odds*  - LB\n\n*Ha ha, na… 🎶 Even though I try... I can't even know what to say! 🎶 For the record, I'm truly honored. Thank you @EverettJohn  😘😘 https://t.co/uIxmjT7Cht #Lambily, I can't wait to see you this summer on the #AllTheHits tour! https://t.co/gatdOPaww7 Excited to take #demkids to the Kids' Choice Awards today! Trying on a matching ensemble with RoeRoe while @NickCannon is dressing Rocky 😜 https://t.co/0ANgeyiw6O Happy #InternationalWomensDay! I want every girl in the world, including my daughter, to know that she can achieve.. https://t.co/UBaYxpcbPl .@NickCannon https://t.co/lrfLKNRdj6 Thank you to all my fans who came out to the show, I enjoyed ya! Thank you Princess Sara for this beautiful ensemble!  #Lambily #Dubai❤️❤️❤️ https://t.co/4H0nc6Dx5F Lionel, you have my unbridled love &amp; support.  Please feel better soon so we can have a great time touring together this summer. Love, MC 💕 https://t.co/gi2I39YoNw RT @skidxb: #SkiDubai and @MallofEmirates welcomed the beautiful @MariahCarey and her family and friends. We hope you enjoyed it. @majidalf… Taking in the sights before I perform for my UAE fans. Sending love from Dubai! #burjkhalifa #dubaijazzfest #mydubai https://t.co/9D1FHYUkAW Can't wait to see you in Vegas! 🤗🤗💕💕 PS love your shirt 😊 https://t.co/6UZwCh7fpC Thank you Darren 😄 #trulymadlydeeeply https://t.co/P6VPC0PYV6 RT @bobbywomackhbf: Loving the closing ad-libs with @YG #lambily @MariahCarey @TheMariahReport @fadedcrystal @badmatos239 @Careenough4mein… 😂😂 thank you brat-at-at! https://t.co/GsQ83GcIzt ICYMI: Watch #IDont ft. @YG LIVE on @JimmyKimmelLive @ https://t.co/7fkZHQQiL9  + download the track @ https://t.co/pkZT8gWr8W 🔥🔥 Bonus #Kimmel performance: Vision of Love! #VOL #Lambily #ForTheNostalgia 🎤🎤🎤 https://t.co/XezNAM9jKg Had so much fun performing #IDont with @YG last night on @jimmykimmellive! Watch here: https://t.co/PElvDlbbyO Proud to be part of the #LEGOBatmanMovie! Thank you everyone for making it the #1 movie in the country! 💕💕🦇 https://t.co/t2PpU0QwqV Thank you Melissa 😄 https://t.co/U2EVzkF8Z9 RT @_KingMeTyrez: @MariahCarey @jimmykimmel @YG @BigJimWright  SLAY US QUEEN! Yall went AWF, we want more #IDont 👑😍🔥👏👏👏 https://t.co/wnzO1x… Thank you! @jimmykimmel 😘😘 https://t.co/GfYg1Txzm0 #IDont💍 ft. @YG tonight on @JimmyKimmelLive  🎤🎶 Tune in at 11:35pm on ABC! https://t.co/PiJxq0StuY Lambs, get #IDont💍 ft @YG on @amazonmusic @ https://t.co/bNdrDEyNlP 💕 LA! Hear my new single #IDont ft @YG TODAY on the New @ 2 on @POWER106LA! @yesiortiz Going to perform my new song #IDont on Jimmy Kimmel live on Wednesday! See you soon @jimmykimmel! 😘 https://t.co/kHQQDVBQ6A Thanks for putting #IDONT on your 🔥🔥🔥 playlist @vmagazine 😘 https://t.co/CXzIGejzk9 Are you watching the #LEGOBatmanMovie this weekend? Hope you enjoy Mayor McCaskill and the rest of the #Lego crew! 😘❤🎬@LEGOBatmanMovie https://t.co/PFWq9yDji0 @Vevo #IDONT 😁💍👰🏼🔥🎤 https://t.co/cHOZVSvToC @bryanmichaelcox @jermainedupri @YG 🔥😘 #IDONT Coming to #BOSTON APR.7th;get ur tix! I'm checking in w/my friend @djPupDawg @JAMN945 on @iHeartRadio at 10 debuting #IDONT! See u soon Pup! https://t.co/rpdBFIzQ4g RT @klgandhoda: .@MariahCarey on breakup advice and burning wedding dresses: 'Let go of the anger' https://t.co/hA2hFIilAx https://t.co/XTy… Download on @iTunes, listen on @Spotify, watch on @Vevo... thanks for all the love, Lambs! 😘🔥🎶 #IDONT https://t.co/Qx0xrE9rE6 @THEBEAT999FM @YG 😘 @935wichita THANK YOU! I appreciate your support and continuing to play #IDONT. 😘🎶🔥💍 @Kathiejmornings 😂 lol. @TheBeat985 thanks for supporting #IDONT this morning w/@DanaCortez! @DanaCortez thanks for having me on your show this morning and for supporting #IDONT. 🔥💍🎶😘 @Q959_FM thanks for playing #IDONT today! 🔥💍🎶 Had so much fun calling radio stations to talk about #IDONT that I think I might do some more tomorrow. Keep requesting the song lambs. 😘🎶🔥💍 @LarryUlibarri @Kathiejmornings thanks for having me and for supporting the song on your show. #IDONT :). 💍🎶🔥 @1025Radio @TONYTECATESHOW @ItsYourGirlBre it's the best way to do it dahling. Thanks for playing #IDONT. 🔥💍🎶 @ItsYourGirlBre @Golden1Center @1025Radio right back at ya. Thanks for having me and for playing #Idont. Keep it up! 💍🔥🎶 RT @LiveNationNYC: .@MariahCarey’s new single #IDONT ft. @YG is out now! DWNLD here: https://t.co/PMhucn4Snd See her w/ @LionelRichie: http… @Refinery29 😘😘😘 https://t.co/NB4BOM72lj Talking breakup advice &amp; #IDONT with @Refinery29 😘🔥https://t.co/EgJYb2V6xF Up early doing radio. 🎙Calling a few radio stations this morning. Call your local radio stations and request #IDONT! 🔥💍🎶 #IDONT 🔥🎶💍 https://t.co/DmSdGpMGPg RT @etnow: EXCLUSIVE: @MariahCarey on burning a wedding dress in her #IDont video and Bryan Tanaka's penchant for romance. https://t.co/B3O… I had so much fun talking to the Lambily about #IDONT on Facebook Live last week 😘. Let's do it again soon! 🥂🔥🎶 https://t.co/pkZT8gWr8W https://t.co/8lnterlRg4 Celebrating #IDONT on @etnow tonight! 🥂🎉🎶 https://t.co/B5KgTw3uFc 🔥💍🎤😘@jermainedupri @YG #IDONT https://t.co/xGHkxsCHSU Thank you @ElvisDuranShow 😘🔥💍🎤#IDONT https://t.co/V6AzwIGgzR RT @Shazam: Told you I'm finished, gassed up the whip and...\n\nRear view, bye ✌️️✌️️\n\n#IDont - @MariahCarey x @YG https://t.co/WiaTClmmMZ Thanks for the love @djmaddrich 😘 @power983 9pm tonight 😊 yes, I definitely will! 🎤🎧🎤 https://t.co/1Ccf2PxUYN We love that! Thanks UK #Lambily!! 🎉🎉🎉💋 #IDont https://t.co/B1fwSt6h4B Haven't completely figured out the setlist yet but thinking about doing #IDont 😉 https://t.co/o6qDx6eKrP I would love to perform #IDont because it's becoming a favorite of mine but I'm not sure where or when! 😳 https://t.co/rYm0ScoVFq but we still did the take and my hair became a complete + total mess. Fortunately there was a hairdryer in a nearby garage 😂#IDont https://t.co/eORRgOEhjV When @YG and I were about to do our first shot together in the car, it started pouring down rain... #IDont https://t.co/eORRgOEhjV Thanks to the #lambily for all the support!! Really makes me happy 😊😊 https://t.co/mMVUX40SD6 RT @EOnlineUK: Can we have a universal cheers to the #Lambily and @MariahCarey right now?! #MariahsWorld https://t.co/8BQi8HFqin RT @hot937: LISTEN: @MariahCarey teams up with @yg on new song 'I Don't': https://t.co/kyXKHcRy3m @djreflex 😘😘😘 RT @extratv: .@MariahCarey opens up on her movie, her single... and those fishnets at the gym! https://t.co/wgHnYYQvgU https://t.co/MEuuHJd… RT @1019ampradio: .@MariahCarey dropped a new jam! check it out! https://t.co/gYZFf1sHMe Thank you @CatchNY 😘😘 https://t.co/aw3AFBk1FS RT @DJOBSCENE: Wish I could tell you guys what she told me... #MariahCarey #iDont https://t.co/cJU0GuyhYY #1 video on iTunes! Thank you! 😘😘😘 https://t.co/pkZT8he20u @patrickstarrr 😘😘😘 https://t.co/gtyuzMjK6m Celebrating the release of #IDONT with some of my favorite people. Thank you for your support! 😘🎶🔥💍 https://t.co/6VLvN7l73S RT @djreflex: Lovely to be reunited w/ @MariahCarey #IDONT 🍾 https://t.co/Mz24vK6U5S I'm on Facebook Live right now! Be sure to watch &amp; download my new song #IDONT https://t.co/pkZT8he20u 😘🔥 RT @yesiortiz: Champagne eyes thanks to @MariahCarey #IDont @ Hollywood https://t.co/N8COabAPY8 RT @Power1051: Listen to @MariahCarey's new heartbreak anthem 'I Don’t.’ Listen here: https://t.co/SX7OpFzZA5 https://t.co/8BzYCpcYxQ RT @papermagazine: Watch the insane music video for @MariahCarey’s sexy new break-up jam, “I Don’t\" https://t.co/ToHTQ21Nna https://t.co/g5… Leaving the #LEGOBatmanMovie premiere...listening to #IDONT pon de car. 🔥🎶💍😘🎬 https://t.co/VHoVM3HbtQ RT @XXL: The new @MariahCarey and @YG collab is here 🔥🔥 https://t.co/mw9e8Pjel9 On our way to the #LEGOBatmanMovie premiere. See you soon! 😘❤🎬 https://t.co/DeJNL1GdlT #IDont https://t.co/Fbvqv293Nz 😂 Yes I have it on one of my playlists 😉 https://t.co/uDTx2chYWc Thank you so much, I hope things are looking better for you soon. Lots of love 💝 I'm glad you like the new song 😘 https://t.co/KBH4xkf65X Thank you dahhling we worked very hard 😊😊 #IDont https://t.co/sFr2X3CTH8 yes I do and I can't wait to do more of that! #IDont https://t.co/bEqDWydJIk Yaaaaaay!! 🎵 (high note) 🎵 #IDont https://t.co/i7G98HWh4V I'm happy that people can relate to it! #IDont https://t.co/uHycZK280D yes I'm listening to #IDont but it's on a playlist I'm usually listening to while getting ready to go somewhere 💃💃 https://t.co/SBBMrHVz8Y Getting ready with Roc and Roe for the Lego Batman premiere ❤ https://t.co/u2Q2KsGVkX RT @donelljones96: @MariahCarey @jermainedupri @bryanmichaelcox I ABSOLUTELY LOVE THE RECORD!!!! YALL DID THE DAM THANG AND I'VE ALWAYS BEE… RT @vmagazine: Watch @MariahCarey get the best revenge on her former man in new video for, \"I Don't\": https://t.co/s5SL9Z2Fki https://t.co/… thank you so much for supporting #IDont LYM!!! 💝💝\nhttps://t.co/pkZT8gWr8W now I have to go to sleep..I actually have to be awake during the daytime tomorrow😄I'll be doing this again very soon bc it makes me happy☺️ Thank you #lambily for spending some time with me, it was a #stonegroove 😄I really enjoyed talking to you as always!! 💕😘😘😘💕 RT @Aspire91Inspire: whoa. #IDONT is the #1 trending video on @YouTube. @MariahCarey @YG https://t.co/wgmoNCMLI2 I can't even know what to say 😮 thank you thank you!! 😘 #IDont https://t.co/LDO1TsObgh #IDont #IDont #IDont 💍💍💍 https://t.co/Sw45X5lFXt whaaaat? yayy!! that's so #pip 🎉🎉🎉🎉🎉🎉 #IDont https://t.co/YgerCyT90B nails...did! now fitting ensem for the #legomovie premiere tomorrow 💃 https://t.co/2v9Mul8vTc I love this!! whoever made this is amazingly talented 😮😮 https://t.co/tz35M5oFPD Thank you so much and I have to say thank you to @donelljones96 for making such an incredible record #WhereIWannaBe 🔥🔥 #IDont https://t.co/IennhupW18 haa thank you so much for your hard work my dahhling! I love the flyer 😊😊 #pow #IDont https://t.co/O8gepv8NRk yayyy 🎉🎉🎉🎈🎈🎈 thank you to the #lambily worldwide!! #IDont https://t.co/K91BovWvLR thank you for being festive! #babydoll #IDont💍 hopefully this will be a fan favorite as well 😘 https://t.co/PxTGODCupi very nice..I like! (said like Borat 😂😂) #IDont https://t.co/3bm9t3yd2e halfway there #lambily how do you like the sparkles? https://t.co/5j1NFvx3BE I love my Thai #lambs  thank you so much for the #1 I appreciate all the support 💕💕💕 #IDont https://t.co/WepCfVVUSS Roc &amp; Roe just walked in and said \"Hi Mariah Carey\" 😕😕 Oh dear... #workmode #IDont appreciate the worldwide support from the #lambily so much 🤗🤗🤗 I can never thank you enough, you are the absolute best. ever! #IDont https://t.co/3dvhYePgJQ Progress! 💅 https://t.co/5PiUuIbsQP yes I diiid! I also directed the #Fantasy video and many more ☺️ https://t.co/qGPur0esDA 😄 that's my favorite lyric too #IDont 💍we should all have one at least once this year and see who wins #JFL 😂 https://t.co/JrODIbkI65 thank you 😘 that's so great! the creativity of the #lambily is unparalleled!! #IDont https://t.co/8drdBG1z3X thank you! your message had me like 😃☺️😌😘😚💋 https://t.co/7v2ymNV1pJ @FlyEternally I'm not sure, I'll decide in a minute! thank you for occupying my time while I'm getting my nails done 💅💅 one of my least favorite things to do 😂 https://t.co/rU0cgdfRwA Hii dahhling 😘 So glad you're listening to #IDont! Thank you so much 😊😊 https://t.co/CPwP2KEo0X Who's up?? I wanna talk to some lambs 🐑🐑  #IDont 💍 (yet really DO wanna talk to you!) RT @fusetv: Watch @MariahCarey and @YG's \"I Don't\" video: https://t.co/hs8TfzQihe https://t.co/pKTyA3yvbX RT @RealSway: Have you heard @YG and @MariahCarey's new collab? Listen here: https://t.co/IGe95TJdxi https://t.co/wqvNNE8G0x RT @pandoramusic: The elusive chanteuse is back &amp; better than ever 💅. Check out @MariahCarey’s newest single #IDont ft @YG. https://t.co/5S… RT @djkhaled: Download the new hot track by @MariahCarey #IDont ft. @YG!! 🔥🔥🔥 @epic_records !! https://t.co/7dmQrjFybW RT @VibeMagazine: .@MariahCarey interpolates a timeless @donelljones96 track on \"I Don't\" feat. @YG https://t.co/9kSRax5EbN https://t.co/iN… .@MusicChoice is playing “I Don’t” from me &amp; @YG every single hour on MC Hit List channel &amp; their app! Listen! https://t.co/FSuPxHTdpp #BNTW 🔥💍🎤❤🎶 https://t.co/7FgboJwQ7I LIVE with @BigBoy now! #IDont #LA #IDONT World Premiere @vevo https://t.co/z5zWUqsyEl lambs tune in to @TheCruzShow on @Power106LA in a few minutes! premiering my new song #IDont ft. YG! 💍💋 RT @billboard: Mariah Carey drops new YG collab #IDont https://t.co/8EiHINBVak https://t.co/R0HHd2iZTm RT @RollingStone: Hear Mariah Carey and YG's sultry R&amp;B song \"I Don't\" https://t.co/tJydSOmmAS https://t.co/MYggl0Nnxr RT @ETCanada: .@MariahCarey goes to bed for chat on #FacebookLive, talks new single, reveals top-secret upcoming collaboration https://t.co… Thank you 😘. Be sure to watch the full video release at 12pm EST on @Vevo, too! 🔥 https://t.co/nbwHmZ9Jhe ❤❤❤ https://t.co/m5mDO42pOT ❤💍🔥😘 https://t.co/9DLFBNfdZp Yayyyy 😘😘🔥#IDont https://t.co/Vp6IjXpQcr 🎤🔥 download #IDont 💍 on iTunes now! 🎤🔥 https://t.co/pkZT8gWr8W Join Mariah on FACEBOOK LIVE now! https://t.co/o8I3m7mix0 Only one day until the world premiere of #IDONT 🎶🔥 https://t.co/u6gjK6UhE0 Watch Mariah on FACEBOOK LIVE tonight! Check in at 8pm ET. ❤🎶😃#IDONT https://t.co/lmeURhQDMC #IDONT 02.03.17 https://t.co/FeN6dCwvAV 2 days. #IDONT https://t.co/9LUU4gwmDp In the studio with YG. So excited to share #IDONT with you all! 🎤🎶 https://t.co/pH2Y5r0CKF 3 days. #IDONT https://t.co/PfvTcyvLTl Here it is: the cover for my new song, I Don't, coming out this Friday. 🎤🎶😄 MC + YG #IDONT https://t.co/agiVedgpMe https://t.co/5YGp3phbUJ https://t.co/3yqRR0Ywxt #IDONT @e_entertainment @MariahsWorld https://t.co/rQYH8rOMmo #IDONT https://t.co/jjoeKwvovj Tune into @MariahsWorld tonight on @e_entertainment for a sneak peek of my new song I DON'T! World premiere 2.3.17 #IDont https://t.co/WpXj8JsszG Hey Lambs, don't forget to watch #MariahsWorld tonight on @eentertainment! - Team MC https://t.co/15KK0Ft3GA #martinlutherking #kingholiday ❤️ https://t.co/yMea0flP2i Thank you to all the #lambs for your love and support. Be sure to tune in to #MariahsWorld tonight on @e_entertainment. - Team MC https://t.co/TRN8i33kge Watch \"the scandals!\" tonight on @MariahsWorld! Tune in at 9/8c on @e_entertainment 👰😮😚 https://t.co/IXYpsmuga0 In my own words. #NYE #L4L 💖 #thefoilers https://t.co/1jZ40WUeuH Never, never listen to anybody that tries to discourage you. 😘❤️ We've got some fabulous things in the works this year. ❤️ https://t.co/LCDqXg8O1R Don't forget the mozzarella sticks... https://t.co/yuZZNTeV4p Just call my name... 🎤https://t.co/0nNuVbtPz2 Will you be joining me in Dubai this February? It's going to be a fabulous show, dahlings. 😘https://t.co/X3MssoWW8V I'm excited to be touring with Lionel Richie this spring. Have you got your tickets yet? 🎤🎶 https://t.co/bU9bc7eapP I always always love seeing #Lambily members in the audience. Thank you for all your love and support. #LYM 😘❤️ \"This is how glamorous life is on the other side for a working mommy.\" #MariahsWorld https://t.co/5erruckKiy We'll call it a family. 😘❤️ https://t.co/GtaQ1SnHdz Forget about Magic Mike....\"Magic Tanaka\" jumped out of my Anniversary Cake. 🎂 https://t.co/vTAlRXZYkC You've got to have fun, dahlings. 😉 https://t.co/LDKi1vEfwI It's true. They'll always be my babies... 🎶 https://t.co/ypyDu7pKyP That's just who I am. #Festivating #MariahsWorld https://t.co/vn3nShC6lU Everything is better with bubbles, dahlings. This is what we do! Are you watching #MariahsWorld, Lambs? This one is very special to me; I'm going to live tweet my favorite parts! @MariahsWorld Think you've seen it all? Watch @MariahsWorld on @e_entertainment &amp; live tweet with me tonight at 9/8c for a real glimpse into my world! 😘❤️ https://t.co/cj9ore4bm0 Shit happens 😩 Have a happy and healthy new year everybody!🎉 Here's to making more headlines in 2017 😂 https://t.co/0Td8se57jr I'm getting ready perform right before the ball drop on @NYRE! Are you ready to celebrate? #RockinEve #2017WithMariah @ryanseacrest https://t.co/h7ibbxAsd2 #RockinEve Rehearsals 🎉🎤❤️\nLet's do this, @NYRE! #2017WithMariah @RyanSeacrest https://t.co/dj7FjjtFpQ What a year it's been. Let's celebrate it TONIGHT on @NYRE at 8pm ET/PT on ABC! #RockinEve #2017WithMariah https://t.co/KR1RparaBm I'm so excited, too @RyanSeacrest! See you tomorrow as we say goodbye to 2016 and hello to the new year on @NYRE! #2017WithMariah https://t.co/7zXw2V6xMs Don't be naughty naughty... DO be sure to watch @MariahsWorld this Sunday. 😘📺❤️ https://t.co/VCXcjkLwRh TOMORROW! Let's say bye to 2016 and hello to 2017 on @NYRE at 8pm ET/PT on ABC! #RockinEve #2017WithMariah https://t.co/tDZCaxuOeg It's been quite a year. Keep holding love in your hearts. ❤️https://t.co/6NN2oJvwTT It's going to be a fabulous celebration! 🎉🎶 https://t.co/bY3NJf9d2G We've had the most amazing holidays, dahlings!  🎄☃️❤️️Thank you @Airbnb for the gift of this beautiful home &amp; trip! https://t.co/SvMjyWtbeF ❤️❤️❤️ https://t.co/XF5kIkXfGQ Are you all ready for a new episode of @MariahsWorld this Sunday? I can hardly wait! ❤️😘 #mariahsworld https://t.co/YLWCOC0TOQ \"Casual vacation wear\" may mean something different to you... 😘 https://t.co/hZeAvQNyYp Rest In Peace, George. ❤️😢https://t.co/S9f3MYsrba George Michael 💔😢 You were such an inspiration. I'm honored to have not only been your fan, but a friend as well. May you rest in peace. https://t.co/jJKSz22fHH 🎄🎁❤️🎶 #AIWFCIY https://t.co/En4REbaYq5 Merry Christmas, Dahlings! 🎄😘❤️🎁 Watch me on the Disney Parks’ Magical Christmas Celebration, this morning on @ABCNetwork . #AIWFCIY https://t.co/oy8xmSpIX8 Thank you, #Lambs! Merry Christmas! 😘🎄👍🏼🎶 https://t.co/f8LsR2uKG4 Oh Santa! https://t.co/BOvcwbRJkU Wishing you a magical, happy Christmas Eve with the people you love most. ❤️😘🎄🎁 https://t.co/nEnmAEzGjN In ONE WEEK I will be LIVE from Times Square to perform on @NYRE! Don't miss it, 12/31 at 8pm ET/PT on ABC! 🎉 #RockinEve #2017WithMariah https://t.co/fOyD9Apgw7 Thank you for the fabulous Christmas gift #Australia! Merry Christmas #lambs!!! 😘💕 https://t.co/BJ001yMQMa Here's my third video gift to you, dear #Lambily! Wishing you all a joyful &amp; happy holiday. 😘🎄❤️🎁https://t.co/5GroXI5uS0 \"It is Christmas, after all...\" 🎄😁 @funnyordie https://t.co/BOvcwbRJkU I'm in a festivating mood, dahlings. 😘🎄🍷🎁 https://t.co/dV8LFhhVob I'm so grateful for your love and support, #Lambily. 😘 Hope you enjoy today's video gift from me to you! 🎄🎶❤️ https://t.co/4BT37fcMJX It's almost Christmas Eve and The @EmpireStateBldg feels it! Watch the light show live at 7pm or see it here! ☃️🎄🎅🏼https://t.co/zO88OSAxjS Are you ready for another #Christmas video? Look for the next one on https://t.co/DRmUoAjL81 this afternoon! 😘🎄🎶🎁 Getting in the holiday spirit? I'm so happy to share this exclusive video with you! Check back tomorrow for another! https://t.co/FZyA5Vtfdu Here we go, the first of my three holiday gifts to you this week! Enjoy, dahlings. 😘 😘 😘 https://t.co/as4jbYJhr8 I’m in the Christmas spirit! I’ve got 3 surprise gifts for my #lambily this week &amp; the first is at 12 PT / 3 ET! 🎄😘 https://t.co/UmJsHXeIZP Merry Christmas everybody!  I'm making my favorite sauce and I hope you're enjoying the Yuletide cheer!  🎄🎁🎅🏼 https://t.co/JqVUUetRYc We had such a fabulous time making #KeysOfChristmas! Have you made a @djkhaled, @rudymancuso (or Mariah 😘) card yet? https://t.co/IX4hd4lba7 #Lambily! Look up at the @EmpireStateBldg tonight at 7:00 PM to see the #AIWFCIY light show or catch it on YouTube! Link in bio 🎅🏼☃️🎄 https://t.co/RvuFXZVquT My @MACcosmetics beauty icon line is the perfect #Holiday gift, dahlings. In stores now!  🎄💄 https://t.co/KlNYkxhI2t Look up! The lights are dancing on the @EmpireStateBldg. Must be Christmas week!🎄 #AIWFCIY #ESB https://t.co/zO88OSAxjS Now you can put me in a Christmas card! Make your own card with the #KeysOfChristmas Holiday Card Creator🎄❤️ https://t.co/wEiOrGW1nL https://t.co/Fj8u5iAOgm My new holiday special is finally here and it’s 🔥. Watch #KeysOfChristmas now → https://t.co/k1O7VisYFO #YTRedOriginals #NYC are you ready for the #aiwfciy light show on the Empire State Building? Kick off Christmas week with me! #ESB https://t.co/uIDsH1alF7 Thank you, dahlings! ❤️ #WWHL https://t.co/ktlR8czRHC Catch me in the Watch What Happens Live Clubhouse at 11pm ET! #WWHL @BravoWWHL @Bravotv So much drama! Thank you for watching and tweeting with me, #lambs! West Coast #lambily, I'll be looking for your live tweets. 😘😘😘 The fans bring me up when other people bring me down. #lambily #MariahsWorld ❤️ https://t.co/bPyaafPgun I just don't want to be thinking about all the drama... #MariahsWorld https://t.co/tgNC6NTG9J If people let themselves become absorbed in the connection of the music, we'll feel it together. So grateful. #MariahsWorld I love the #Lambily. Thank you for always being there. 😘❤️ #MariahsWorld https://t.co/icGQsFiTq2 I live in the solution.... take the blame, apologize, and keep it moving. That's the way it's got to be. #MariahsWorld 😘😘😘 @isaacboots https://t.co/V63CM00cGc Are you all enjoying #MariahsWorld? Thank you so much for watching, #lambily. 😘❤️ Thank you so much, dahling! 😘😘😘 #MariahsWorld https://t.co/d21tWKL2b7 Everybody has their own way of dealing with things, you know? https://t.co/MrYtztVxxD Queen of so many things, dahlings.... #MariahsWorld ❤️ https://t.co/36KQFRmnkx I don't have birthdays. I have anniversaries. 🎂 https://t.co/5NMXQ6VNZ3 Yes, I'm particular. But that's because I know what I like, and what works. I just honestly want everyone to get along. We're all in this together! Five minutes until show time! Are you going to Live Tweet #MariahsWorld along with me? @KristoferBuckle 😘 https://t.co/338GQrRHnZ Hi Lambs 💕 Make sure to tweet along using #MariahsWorld tonight! The best moments will get featured here: https://t.co/IKo9moKqmm Hi Twitter lambs! Only ✌🏻 hours until episode three of #mariahsworld dahlings. Tune into @eonline at 9/8c. I'll be live tweeting. 😘 https://t.co/VNjU0qfnPc Lambs!  My new Christmas special launches tomorrow, Dec 19th on @YouTube ! #KeysOfChristmas 🎁 🔑 🎄 https://t.co/gO6FahZQbC I see you up there, #Lambs! Thanks for the fabulous hype dahlings. 😘 https://t.co/hcMjoYFaxL Thank you for helping me celebrate my favorite holiday! #AIWFCIY #LAMBILY https://t.co/wMDJ0SNx0f https://t.co/hePfOpK40o Only 1 hour left to get your presale tix to my tour w/ @LionelRichie!  Get your Honey B. Fly Live Pass now:  https://t.co/SdVeqEqloh Here's a sneak peak of what’s coming this Sunday on #MariahsWorld!  Tune in at 9/8c ⭐️🎬📺🎵⭐️ https://t.co/73hVWc2BY3 Today’s the last day to get presale tix to my tour w/ @LionelRichie! Get your Honey B. Fly Live Pass for access: https://t.co/ybcciMFer0 RT @MariahsWorld: Lambs! @MariahCarey will be on @LateNightSeth TONIGHT at 12:35am ET/PT on @NBC! https://t.co/fzcMu2YXIx Hi Lambs! Tonight I will be on @LateNightSeth at 12:35am ET/PT on @NBC! #LNSM https://t.co/kTygPnDDqX It's going to be a fun night on latenight television, Dahlings. 😘❤️ https://t.co/HWKg9ljcNr You don't want to miss this!!! ❤️🎄❄️🎤 @JKCorden #CarpoolKaraoke https://t.co/imOV1z1AvP #Festivating last night with my lambs at the @BeaconTheatre. Next show is Friday at 8pm! ☃️🌟🎄🎅🏻🎁 https://t.co/cDNjuwVaMS Hello my French lambs! Don’t miss the premiere of #MariahsWorld on @eonlineFR tomorrow, Friday at 8:55pm CET! https://t.co/cwIgxTrk1V Tomorrow's the last day to get presale tix to my tour w/ @LionelRichie ! Get your Honey B. Fly Live Pass for access! https://t.co/QjpoxTMlnT Lambs!  My @MACcosmetics beauty icon collection is finally available in stores ... just in time for the holidays!  #MACMariahCarey https://t.co/PkNIL0VQEx RT @LateNightSeth: JUST ADDED: @MariahCarey will be joining us on #LNSM tomorrow night! Don’t miss it! https://t.co/ME5Rf3exrR A @BeaconTheatre moment from last night. Looking forward to more tonight at 8pm! #AIWFCIY https://t.co/ZwY1xIOCgM So excited for my @MACcosmetics collection to be available in-store tomorrow!  Check out the #MACMariahCarey #snapchat filter today only! https://t.co/9SUbQrvEQM Get access to @ATT priority presale concert tickets and see me with @LionelRichie in a city near you! https://t.co/ib0QgCwYQZ https://t.co/Lhxtv6wj4r Hello, Latin American lambs!  Don't miss the premiere of #MariahsWorld on @EOnlineLatino tonight at 10pm (Mex, Col), 11pm (Arg) 😘 https://t.co/mwFpqXpRBo Did you hear? I’m touring w/ @LionelRichie next year! Get your Honey B. Fly Live Pass for presale tix: https://t.co/OailXs6OY4 Backstage at #Christmas time with our beautiful children. @Beyonce 😘\n#family #love https://t.co/dRCWaCnD73 RT @YouTube: 💧 on🌹 &amp; 5-octave ranges\nEndless 🌈 &amp; 🔥 outfit changes\nA 🎄 special starring a queen\nThese are @MariahCarey's favorite things. #K… Presale tix to my North America tour w/ @LionelRichie are on sale NOW! Did you get your Honey B. Fly Live Pass yet? https://t.co/Oe9Ue5Kodr BIG NEWS! I’m touring w/ @LionelRichie in 2017!  Presale tix go on sale at 4pm TODAY w/ a Honey B. Fly Live Pass: https://t.co/k70vvRCYkU One minute until @MariahsWorld airs on the west coast. Are you ready, LA? #mariahsworld I love you @Beyonce thank you sooooo much for coming out tonight ❤️😘🎤🙌🏽💋 #merrychristmas https://t.co/UEEE3gJdMs Thank you for coming! \nMuch Love! Merry Christmas! 🎄🎁😘 https://t.co/PCd4324Ght I'll be onstage at @BeaconTheatre during the east coast airing of @MariahsWorld tonight. Excited to check out your live tweets later! 😘❤️ https://t.co/bRxYeZyZqv RT @BeaconTheatre: Christmas is in the air &amp;  @MariahCarey is ready to celebrate! Limited tix for TN are at boxoffice/ @Ticketmaster! https… All new #MariahsWorld tonight on @e_entertainment ! Be sure to tune in at 9/8c. https://t.co/cjJ4IG1OCg One more week of shows at @BeaconTheatre. I love ringing in the holidays with my Lambily. 🎄❤️😘 #aiwfciy https://t.co/95h6xKyJX9 Hello UK &amp; Ireland lambs! Don’t miss the premiere of my new docu-series #MariahsWorld on @EOnlineUK tomorrow at 9pm! https://t.co/EUirqzCj6f This Sunday I'm giving away 3 limited edition prize packs during my show. Just buy a ticket &amp; come to Sunday's show to enter. Good luck! 🎁🎁🎁 https://t.co/YDondrY24d Just a little sneak peak of what’s to come this Sunday on #MariahsWorld. ⭐️🎬📺🎵⭐️ https://t.co/Qm69Yy8Adi @rkelly graced my show as we performed our favorite Xmas classic \"The Christmas Song,\" by Nat King Cole. #ThankYouKellz! You're the best!!❤️ https://t.co/D56qYoZctk RT @iTunesTV: It's #MariahsWorld.\nGet the Free Series Premiere.\ncc @MariahCarey @e_entertainment\nhttps://t.co/jax4W0pLMT https://t.co/7bQ3L… Tonight I've got another great surprise guest lined up for you guys at the @BeaconTheatre !  See you at 8pm New York City!\n[📷:Michael Soike] https://t.co/iIt0T7RouW It’s finally here! Today is the day you can buy #MACMariahCarey online! The link to \nbuy is in my bio. 💄@MACcosmetics https://t.co/mCWWxj7ni6 So grateful the @BeaconTheatre stage was graced tonight with @johnlegend. I ❤️you @chrissyteigen 😘#WhenChristmasComes [video @mariahnow] https://t.co/MdZhDo77TI Getting sewn into this gown right now…I’m coming @BeaconTheatre ! So excited for tonight’s show at the @BeaconTheatre !  I’ve got a pretty amazing special guest for my #lambily lined up too! 😉🎄🎅🏻🌟☃️🎤 https://t.co/xqfSGXoaMQ Full on mommy mode this morning…and I couldn’t be happier. Love them babies! Kicking off the #NYC holiday season by flipping the lights at @EmpireStateBldg! Tune in to Facebook Live to celebrate with me! 🎄 Tonight I'm helping #NYC kick off the holiday season by turning on the lights at the @EmpireStateBldg Tune in to FB Live at 8:00pm EST! 🎄🗽 What can I say? It makes me happy. 😁💍👗💋 https://t.co/j4NbHFEohI So excited to announce I'll be at the Dubai Jazz Festival on Feb 23! Get tickets at ticketmaster.ae | https://t.co/ggLILtcUTj!@dubaijazzfest https://t.co/9RqNbtDtYM Love you @ChakaKhan! Hope you got my flowers the other day! 😘❤️💐 #Aries Right back at you @ChakaKhan ❤️🙌🏽 https://t.co/PxKLENm1qD Thanks to all who came to the @BeaconTheatre show tonight. I don’t have words. Hope you enjoyed it as much as me! https://t.co/tQcg2lEI3a Getting ready to go onstage! Opening night at @BeaconTheatre - so excited and truly blessed. ❤️🎄❤️ Love seeing my festive little #Lambily here on opening night at @BeaconTheatre https://t.co/ikEOMaFAel Tune into @VH1 #DivasHoliday: Unsilent Night tonight at 9/8c! 🎄🎅🏽 https://t.co/LrJBLkKRPh Welcome to @MariahsWorld, #lambily! Watch the free series premiere for a limited time on @iTunesTV: https://t.co/Hm98RzSHCD https://t.co/KajIJxpZpa ❤️❤️❤️ https://t.co/irOJSwwkP8 Going to #FacebookLive as soon as the show's over. Tune in on my Facebook: https://t.co/z3awTA2oAL. I have certain rules. https://t.co/CyPAfyYh87 😘😘😘 #MariahsWorld https://t.co/qINhkTCCRj I love my #JLT (Job Long Time). #mood https://t.co/R23YoSkmAz @KristoferBuckle so proud of you! https://t.co/HfPo0ggkJC Love you @KristoferBuckle! 💄💋 She knows how to make it happen, even when she doesn't want to play. https://t.co/vEHY4uR3Yt Everybody wants to see \"their\" version of Mariah...the sexy Mariah, the sincere Mariah.... at the end of the day, I have to be ME. Maybe a little bit... #MariahsWorld https://t.co/SP3kniGarh Sitting at the piano making music... nothing else compares. https://t.co/bb22KRYBZ2 Sweet! Are you all watching with us, #Lambily? https://t.co/Xi3IypFfyH @itswhitneymeyer 😘 Stella keeps me on track and moves me forward at the same time. So glad to have her fighting for me! My babies! I really never imagined how much they'd take over my world. Would seriously do anything for them. OMG you guys. here we go. Are you ready for a glimpse into #MariahsWorld? Tune into @e_entertainment now! I'll be live-tweeting the show, Lambs. Are you ready? thanks @JzonAzari! So excited for all of the Lambily to see the show!! https://t.co/dEpGrVRbdW Are you ready, #lambily ? Watch the premiere of @MariahsWorld tonight at 9/8c on @e_entertainment ! #MariahsWorld https://t.co/SGDvc8P7dH Tomorrow is the last day to get my exclusive @FanjoyCo Christmas package! Only a limited number of packages left! https://t.co/C5olKR0QBw @GWMarket is hosting #MariahsWorld viewing party Sunday at 9! Tag a friend to bring to dinner &amp; show up Sunday at #GWM to win! https://t.co/HvWBGTehFf Only a few more days until @MariahsWorld, lambs! Watch Sunday at 9/8c on E! #MariahsWorld https://t.co/79SDBKyOPT Lambily!  I'm giving away 2 front row tickets to opening night of my Beacon Theater show ... check my IG on Monday morning for a clue! #Lambs, @fanjoyco has put together a perfect gift! Get my exclusive Christmas package which includes a note from me https://t.co/C5olKR0QBw https://t.co/pWk25Jg9a6 I can't believe she's back again..ugh! #Bianca #MariahsWorld @MariahsWorld https://t.co/QLIf3aWOgz RT @RyanSeacrest: so excited that @MariahCarey is returning to perform on @NYRE this year! now, I just have to find those big blue headphon… Ring in 2017 with me on @NYRE where I will be performing moments before the ball drops! #RockinEve 🎉🎉🎉 #festive #moments #NYC https://t.co/NFBGFQplz5 Thank you @grandwailea for the amazing hospitality! Love you Hawaii, miss you already! 💖😘 https://t.co/ls0rg4bxuP RT @MariahsWorld: Tweet to Unlock a peek at my new show &amp; chance to win concert tix #MariahsWorld #Sweepstakes https://t.co/b46HwhLqOq http… Thankful for the fans who came to my concerts in Honolulu last week💖💖 Getting some extra island time @grandwailea before going back to work! https://t.co/qbK24i1d03 RT @MariahTrends: This is cute! @MariahCarey sketches her answers in Illustrated Interview with NY Times' Style Magazine:\nhttps://t.co/0bke… RT @Obsessedlamb: Mariah Carey on the cover of 'Inland Empire magazine' promoting Mariah's World. 💕 https://t.co/rl0mrvbMjV #Lambily! My @fanjoyco Christmas package is back! Includes a handwritten note from me plus my Christmas CD &amp; more!💋🎅 https://t.co/C5olKR0QBw RT @ABCNetwork: All we want this Thanksgiving is to hear @MariahCarey perform at the #DisneyHolidayCelebration TONIGHT at 8|7c on ABC! http… RT @TheEllenShow: It ain't Christmas without @MariahCarey. https://t.co/OG80fFTd78 https://t.co/n3GOZKO20C Today on @TheEllenShow 😘 tune in #lambily!! https://t.co/MNKB2j7D6x See you next week, Hawaii! Join me for my three concerts in Honolulu on Nov 23, 25 &amp; 26!  https://t.co/42o2bG2Nia https://t.co/uRXyJxPGQy Here’s a peek at what goes on in my world! #MariahsWorld premieres December 4th on E! https://t.co/5DQHTcLLGj I’m so excited to finally share my full @MACcosmetics collection – coming in December! Add it to your holiday wish list 💋 #MACMariahCarey https://t.co/hbYPb8TDSF Thank you GQ 😘😘 #Mexico, I enjoyed ya! 🤗🤗 https://t.co/Gs3yHDQcSk 4 new Christmas shows added!! Dec 10, 11, 16 &amp; 17 at the @BeaconTheatre! #AllIWantForChristmasIsYou Tickets @ https://t.co/iCGLcnrLHj 🎅🎅 https://t.co/2vCwfVr3OF Mexico, I can't wait to see you tonight!! #SweetSweetFantasy 🇲🇽 To all my American lambs, I hope… https://t.co/O1cJzQu7ib RT @VH1: ❄️ You're cordially invited to celebrate the season with the LEGENDARY @MariahCarey at #VH1Divas: Unsilent Night MON DECEMBER 5 at… Come see my performance today at Toronto Queen Street Hudson's Bay and Saks Fifth Avenue for the holiday window unveiling! @CFtoeatonCentre https://t.co/kZN3ddoEjo RT @BuzzFeedUK: Now that Halloween is FINALLY over... https://t.co/uxNH614S5d Congrats my dear @lovebscott!!! 👏💞💞 https://t.co/S19lKbkkg0 I love my lambs in #SouthAmerica and will do everything I can to come in 2017 the proper way. Thank you for understanding. LYM, Te Amo❤️MC Devastated my shows in Chile, Argentina &amp; Brazil had to be cancelled. My fans deserve better than how some of these promoters treated them. https://t.co/zuEXQL12Ek Tickets are on sale now for #AllIWantForChristmasIsYou at @BeaconTheatre 🎄 Can't wait to celebrate with you in NYC!🎄 https://t.co/kE32Q4b3V5 https://t.co/QCkQZ1u4Qd #Lambs! I'm coming back to the @BeaconTheatre in December for my 3rd annual \"All I Want For Christmas Is You\" concert series!! ❤️🎄 LYM! https://t.co/WFaKiwtvRg Thank you for having me 💋💋 @EmpireFOX @JussieSmollett @TherealTaraji @terrencehoward @JustTrai  #Infamous https://t.co/4WMg8TfOak RT @AppleMusic: The Lyons mean business 🎶\nNew music from @EmpireFOX is here:\n#Infamous ft. @MariahCarey @JussieSmollett\nhttps://t.co/VMhjtH… #lambily don't forget to download #Infamous on iTunes https://t.co/P1AFSp85Z1 https://t.co/sC8rcSvTNi Here it is! Watch our performance of #Infamous from tonight’s #Empire episode! I enjoyed ya @EmpireFOX 😘😘  https://t.co/BPQ2oZMwvB RT @EmpireFOX: Tonight @MariahCarey guest stars on #Empire. Watch LIVE at 9/8c on FOX! https://t.co/kKOgkG33BD Here's a sneak peek of my appearance on #Empire, airing on Wednesday and featuring #Infamous with @jussiesmollett! https://t.co/MULCv3lY7S #Infamous is available now. Download and listen before next week!! @JussieSmollett #Empire https://t.co/P1AFSp85Z1 https://t.co/3BSsT1WG9N So excited to be a part of #Empire Listen to my new song #Infamous with @JussieSmollett, exclusively on @EW! https://t.co/SBMjCLvSiP https://t.co/t1c8QMXW6z can't wait to be in Hawaii and see you all 😘💞 https://t.co/wJKnbBbfe5 Your vote is your voice and it deserves to be heard. Don't stay silent! Register to vote at https://t.co/kHBf7ub9nk #IWillVote https://t.co/PR9tCKeY0k Lambs! We added 2 more dates in Hawaii! @JussieSmollett will join me in Honolulu for shows on Nov 23, 25 &amp; 26! Tix @ https://t.co/Qydgr0E7R7 https://t.co/BoG19Hxoim Tickets for the final shows of #1TOINFINITY in Vegas April 26 – May 13 are on-sale now! #Lambily  https://t.co/HDQCDBlMgy https://t.co/PpCkz41ogf"}