{"tweets": "En el set de grabación. Haciendo la campaña del nuevo perfume 🔥 On set... new perfume in the works 🔥 #ShakiraPerfumes https://t.co/gLk5ZPaqeL ANUNCIAMOS NUEVO ÁLBUM EN VIVO! El próximo miércoles - el día del #ShakiraFilm (boletos e info: https://t.co/pZIUIFUlor) Shak también va a lanzar el álbum en vivo de El Dorado World Tour! Chantaje ya disponible! Reservar álbum https://t.co/4jBkZ9B41h ShakHQ https://t.co/94VectIJrq LIVE ALBUM ANNOUNCEMENT! On Nov 13 - the day of the worldwide screenings of #ShakiraFilm (info/tix https://t.co/pZIUIFUlor) - Shak is releasing the El Dorado World Tour live album! Chantaje is available to stream now + click to pre-save the album! https://t.co/1Zt712pWA0 ShakHQ https://t.co/u4W5qtOula RT @ageografa: @shakira São Paulo Brasil 🇧🇷 🤩♥️ #ShakiraFilm https://t.co/dXBcGbzwsL RT @RubenRengifo208: @shakira Lo veré en París 💛 #ShakiraFilm https://t.co/8k5Bfkq0gV RT @marcorazzi11: Portland, OR \nReady for El Dorado World Tour \n@shakira \n#ShakiraFilm ✨✨✨ https://t.co/apsqPZcSKa RT @DaanyRazo: @shakira @shakira seis días más 😍😍😍!!! Ya casiiii y ver en la pantalla grande el show más genial que he visto en mi vida, y… RT @JoansFuster86: @shakira Yo veré a @shakira en Lima Perú #shakirafilm #ElDoradoWorldTour https://t.co/s4UbWhHGFo RT @Txorrizo: @shakira París, Francia 🇫🇷💝💝💝 #ShakiraFilm https://t.co/qVngFzJjin RT @SoldierSiobhan: @shakira Glasgow 🇬🇧 @cineworld  Can’t wait!! ❤️😍💙🎶🔥 https://t.co/NyQ0ZNBQQz RT @MateoFV: @shakira Bucaramanga, COLOMBIA https://t.co/n03EUsedhE RT @andmonteiros: @shakira São Paulo, Brasil 🇧🇷🇧🇷🇧🇷😍😍😍 https://t.co/uRJAKxqzjQ RT @shakirillo: @shakira Ciudad de México, México 🇲🇽. #ShakiraFilm 🎥 (13/11/19) https://t.co/MJDJCFoVxa RT @sweetycary: @shakira Lista en Zaragoza, España 😍 https://t.co/xpX7gZqDdt RT @jorgyyporgyy: @shakira I have my ticket! #ShakiraFilm https://t.co/bE99VyGJcm RT @marie_kn67: @shakira In Strasbourg, France !!! 🇫🇷🇫🇷 https://t.co/0X5osCYW6q RT @dailyshak: @shakira Recife, Brasil! 🇧🇷😌 https://t.co/i908rIQnoD RT @TilllFindAustin: @shakira BRASIL!! https://t.co/RWmrHJL6L5 RT @LegendaryArturo: @shakira I’ll be watching it on Wednesday here in Indianapolis, Indiana 🇺🇸 I’m so excited especially because I was at… RT @NicoFrancook: @shakira Desde Buenos Aires 🇦🇷 https://t.co/38plEzUTQ5 RT @maricelahhhh: @shakira Sacramento, CA 💖 https://t.co/80lWHotMkP RT @hipoBK02: @shakira 🤩❤😊 https://t.co/G3zcwi5Lrd Faltan SEIS DÍAS para el estreno de la película documental de la última gira de Shak! Quién irá a verla? En qué ciudad? Compartan una foto de su boleto / poster usando #ShakiraFilm! ShakHQ https://t.co/iXq4vWEz7F SIX DAYS until Shak’s tour documentary is in theaters worldwide! Who’s going? And where are you watching?! Send us a pic of your ticket / poster / cinema using #ShakiraFilm! ShakHQ https://t.co/aWIKMqJzUe FALTA UNA SEMANA para que la película documental de la última gira de Shakira llegue en cines de todo el mundo por solo una noche! Están preparados? Pueden encontrar su cine más cercano en https://t.co/dRREmsaq4N \nShakHQ \n#ShakiraFilm https://t.co/PAUjVRGHQG RT @LiveNation: Sing-a-long to this clip of \"Si Te Vas\" from @shakira In Concert: El Dorado World Tour. #ShakiraFilm comes to cinemas world… ONE WEEK until Shak's new tour documentary is in cinemas worldwide for one night only! Are you guys excited? Find your local screening at https://t.co/dRREmsaq4N\nShakHQ \n#ShakiraFilm https://t.co/zm3ebMwgot Besitos desde el set de entrevistas para el estreno de la peli de El Dorado World Tour! #ShakiraFilm https://t.co/Z0aRDYHptb At the beginning of my promo day for the release of my movie doc! \nEmpezando el día de promoción para el lanzamiento de mi película documental!\n#ShakiraFilm https://t.co/KPla2DSdEO Faltan solamente OCHO DÍAS para que el #ShakiraFilm llegue en cines de todo el mundo por solo una noche! Hoy les compartimos este video en el que Shak habla de la afectación de sus cuerdas vocales que hizo posponer la gira.\nInfo/tickets: https://t.co/dRREmsaq4N\nShakHQ https://t.co/bI8TIiA3Ne EIGHT DAYS until #ShakiraFilm is in theaters worldwide for one night only! Here's a clip from the film of Shak talking about how hard it was to deal with the vocal haemorrhage which postponed the tour.\nInfo/tickets: https://t.co/dRREmsaq4N https://t.co/K40vRsMYII ONE YEAR since the incredible final show of the #ElDoradoWorldTour in Bogotá!\nTEN DAYS until you can relive the tour with #ShakiraFilm in cinemas worldwide for one night only!\nInfo / tickets at https://t.co/pZIUIFUlor\nShakHQ https://t.co/5QyiyqXKEa HOY se celebra un año del increíble último concierto de #ElDoradoWorldTour En Bogotá!\nEn DIEZ días y por solo una noche podrán revivir la magia de una gira inolvidable!\nInfo/boletos en https://t.co/pZIUIFUlor \nShakHQ https://t.co/jRgCsCr3va RT @SonyMusicCol: 😱 #ShakiraFilm en concierto 🔥#ElDoradoWorldTour en cines de todo el mundo 🎥 🙌🏼 el 13 y 15 de Noviembre ¡No te lo puedes p… Order your exclusive new El Dorado World Tour t-shirt ahead of the worldwide #ShakiraFilm screenings on Nov 13! \nYa está disponible la camiseta exclusiva del #ShakiraFilm para que la puedan lucir en el estreno de la película el 13 de Noviembre! \nhttps://t.co/pDqzq9KfPb https://t.co/KCf2YEIswm Ya estamos en Noviembre, el mes en que la película de la gira de El Dorado llegará en cines de todo el mundo el 13 de Noviembre! Para celebrarlo les compartimos este vídeo con una selección de los mejores movimientos de Shakira!\nInfo y boletos en https://t.co/dRREmsaq4N 💃\nShakHQ https://t.co/TvmBiiMzge It’s November, which means the worldwide screening of #ShakiraFilm is THIS MONTH! Let’s celebrate with some of Shak’s finest moves from the concert movie!\nInfo and tix for the Nov 13 event at https://t.co/dRREmsaq4N 💃\nShakHQ https://t.co/dyiy7Iz9wk Miau!!! https://t.co/C9qRLhuiEb RT @sonymusicmexico: 😁¿Quieres ver el largometraje de 🎼 #DoradoWorldTour de @shakira en noviembre?  🤗\nEntra a esté link para adquirir tus b… RT @SonyMusicCol: 🎉Qué estas esperando para ver #ShakiraFilm en concierto💥 #ElDoradoWorldTour estará en cines de todo el mundo el 13 y 15 d… #TBT to Halloween on the El Dorado World Tour! Así se celebró Halloween en El Dorado World Tour! ShakHQ https://t.co/wKH0okTD7d RT @DavisCupFinals: 🎤 Closing Ceremony 🎤\n\nArtists for #DavisCupMadridFinals #byRakuten Closing Ceremony on November 24th are confirmed 🤩\n\nS… CONFIRMED! Shak will perform at the @DavisCupFinals Closing Ceremony in Madrid on Nov 24 with Camilo and Pedro Capó!\nCONFIRMADO! Shakira actuará en la Ceremonia de Clausura de la #DavisCupMadridFinals el 24 de Noviembre en Madrid con @CamiloMusica y @pedrocapo! \nShakHQ https://t.co/2K7NlfphBs \"Guys, how about on Sunday night we give some clues about who I'm going to be singing with at the @DavisCupFinals Closing Ceremony, on November 24th…?\" https://t.co/aC20oKF8d0 19 days til #ShakiraFilm is in cinemas worldwide! Are you guys gonna sing along? \nFaltan 19 días para que llegue el #ShakiraFilm en cines de todo el mundo! Están preparados para cantar con Shak? \nInfo/tix: https://t.co/hmPDloZ9Ml\nShakHQ https://t.co/IWYyikH73K RT @MarkoShak: When you suddenly see yourself in Shak's story. I AM SCREAMING, QUEEENNN!!❤❤❤❤ @shakira https://t.co/hD6FTudReS RT @fpiesdescalzos: Hace 10 años llegamos a La Playa, donde habitaba una población desplazada por la violencia, con un alto índice de inasi… ha! things I didn't think I'd see today… @carlosvives https://t.co/3rYm6A5T3a Será épico!! It’s gonna be epic!! https://t.co/RQES3pxxOb Vamos! #DavisCupMadridFinals https://t.co/ERqxXIZQjr RT @SonyMusicCol: 💥 ¡Imperdible!💥 #ShakiraFilm en concierto #ElDoradoWorldTour en cines de todo el mundo 🎞🎥 el 13 y 15 de Noviembre 🙌🏼 @Sha… This is so touching!!!! Thanks to the @CalBand for this amazing tribute! https://t.co/J7cXqlmdTM La película de El Dorado se proyectará en todos estos países el 13 de Noviembre! Dónde la van a ver?\n🇦🇷🇦🇲🇦🇼🇦🇺🇦🇹🇦🇿🇧🇾🇧🇪🇧🇴🇧🇦🇧🇷🇨🇦🇰🇾🇨🇱🇨🇴🇨🇷🇭🇷🇨🇼🇨🇾🇩🇰🇩🇴🇪🇨🇸🇻🇪🇪🇫🇮🇫🇷🇬🇪🇩🇪🇬🇮🇬🇷🇬🇹🇭🇳🇮🇸🇮🇳🇮🇪🇱🇻🇱🇺🇲🇬🇲🇾🇲🇹🇲🇽🇲🇦🇳🇱🇳🇿🇳🇮🇳🇴🇵🇰🇵🇦🇵🇾🇵🇪🇵🇭🇵🇷🇷🇴🇷🇺🇷🇸🇸🇬🇪🇸🇨🇭🇹🇼🇹🇭🇬🇧🇺🇦🇺🇾🇺🇸\nhttps://t.co/dRREmsaq4N Still can't believe my concert film is showing in so many places on Nov 13!! Let me know where you'll be watching!\n🇦🇷🇦🇲🇦🇼🇦🇺🇦🇹🇦🇿🇧🇾🇧🇪🇧🇴🇧🇦🇧🇷🇨🇦🇰🇾🇨🇱🇨🇴🇨🇷🇭🇷🇨🇼🇨🇾🇩🇰🇩🇴🇪🇨🇸🇻🇪🇪🇫🇮🇫🇷🇬🇪🇩🇪🇬🇮🇬🇷🇬🇹🇭🇳🇮🇸🇮🇳🇮🇪🇱🇻🇱🇺🇲🇬🇲🇾🇲🇹🇲🇽🇲🇦🇳🇱🇳🇿🇳🇮🇳🇴🇵🇰🇵🇦🇵🇾🇵🇪🇵🇭🇵🇷🇷🇴🇷🇺🇷🇸🇸🇬🇪🇸🇨🇭🇹🇼🇹🇭🇬🇧🇺🇦🇺🇾🇺🇸\nhttps://t.co/dRREmsaq4N Trying my new fav thing, orange eyes! https://t.co/s3w1wXinNy https://t.co/bdrz3sbDSU Este año, 10 años del colegio de Barranquilla, tantos logros!! @fpiesdescalzos https://t.co/4bLq8umEAZ Me, being a basket case with my producer… https://t.co/dckXvTy5H5 Miren qué bonito! Un regalo de Julián Vásquez, artista colombiano que pinta con tinta de café!! ❤ https://t.co/dk5fPtpBZE Danilson Sepúlveda de grado cuarto, campeón de ajedrez “Supérate con el Saber\" en Barranquilla! @fpiesdescalzos https://t.co/m4O7Efb4M6 Good nutrition is essential for young children to develop healthy brains, bodies and minds but a staggering 1 in 3 children today are either undernourished or overweight. \nFind out why - and how we can help - in @UNICEF’s State of the World’s Children'19 \nhttps://t.co/0MKDCWMAJ5 El video con el audio del remix de Shakira de Tutu con @CamiloMusica y @pedrocapo es el video musical más reproducido en todo el mundo ahora mismo en YouTube! https://t.co/PxmlHML4zp ShakHQ Wow, just saw this post! Happy tenth birthday @Vevo - and thanks to everyone who's watched all those videos! https://t.co/a0qHS0Esoi RT @RocNation: SHAKIRA, SHAKIRA! 💃 4 more weeks until the release of @shakira's #ShakiraFilm... one night, one film... Only on November 13t… Faltan CUATRO semanas para que el #ShakiraFilm llegue a los cines de todo el mundo! Para celebrarlo hoy les compartimos un nuevo trailer! Para info / boletos ingresen en https://t.co/pZIUIFUlor\nShakHQ https://t.co/DkFqaPGkCc It's exactly four weeks until #ShakiraFilm hits cinemas worldwide for one night only! To celebrate, here's the extended trailer! Info / tickets https://t.co/pZIUIFUlor \nShakHQ https://t.co/4UrH995rE8 RT @Beats1: \"I can't get it out of my head, so I decided to just jump on it.\" @shakira joins @CamiloMusica and @pedrocapo on the  #TutuRemi… RT @pedrocapo: Familia!!!! Ya pueden escuchar 🎧#TutuRemix junto a mis grandes colegas @CamiloMusica y @shakira. Descargarlo aquí \nhttps://t… Por si se lo perdieron... aquí está el remix de Shak de Tutu con @CamiloMusica y @pedrocapo! \nIn case you missed it, check out Shak’s new remix of Tutu with Camilo and Pedro Capó now! \nShakHQ \nhttps://t.co/PxmlHML4zp RT @SonyMusicLatin: ¡Ya puedes disfrutar en las principales plataformas #TutuRemix de @CamiloMusica, @shakira y @pedrocapo! 🙌🎊😍 https://t.c… 🚨🔈 Ya está disponible en todas las plataformas el remix de Shakira de Tutu con @CamiloMusica y @pedrocapo! Escúchenlo AHORA aquí https://t.co/ju1Dcvlb2H \n🚨🔈Shakira’s new remix of Tutu with Camilo and Pedro Capó is available to listen to NOW! https://t.co/ju1Dcvlb2H\nShakHQ https://t.co/glTlIzi6ez RT @CamiloMusica: Pa que se emocionen como yo cuando escuché el SHAKIRA SHAKIRA jajajaja!! @shakira \nSalimos con TUTU REMIX en un par de ho… https://t.co/u6HptlYxwy https://t.co/Vw8SoVn1Ei Ustedes lo pidieron y lo que quieren de mi, lo tienen así que este martes 15 de Octubre a medianoche... Tutu el Remix! https://t.co/u6HptlYxwy https://t.co/jzV9svw6hB Soccer mom! https://t.co/N3jkQXYsYF RT @billboardlatin: .@Shakira just dropped the first full song performance from her highly-awaited documentary.\n\nWatch the clip below! http… RT @RocNation: We can't wait to see all the exclusive never seen before performances 💃 @shakira is bringing to #ShakiraFilm on Nov. 13 in c… RT @fpiesdescalzos: 130 millones de niñas están fuera de las escuelas en todo el mundo. Nos unimos al #DíadelaNiña para que maestros, famil… RT @LiveNation: JUST RELEASED! Watch this new full-length clip of @shakira performing a medley of La La La &amp; Waka Waka. Experience more thr… EXCLUSIVA! No se pierdan este espectacular video de La La La / Waka Waka del #ShakiraFilm (en cines el 13 de Noviembre). Aquí https://t.co/WxEI2AB8IX encontrarán el video entero! ShakHQ https://t.co/uACctBW9ZH EXCLUSIVE! Watch Shak's stunning performance of La La La / Waka Waka from #ShakiraFilm (in cinemas worldwide, Nov 13). See the full video at https://t.co/WxEI2AB8IX ShakHQ https://t.co/tXurorgudS Miren con quien estoy!!!!! https://t.co/z5aLuiSWaw And the finale for @MessiCirque’s, “lalala” a pleasant surprise! @Cirque @TeamMessi https://t.co/n8NOnQTqLT Con @Residente que ya lo extrañaba!!! https://t.co/elNd1VUUKu En buena cía! Carlitos!!! @carlosvives https://t.co/zO8UioCDXN En el @MessiCirque de @TeamMessi! https://t.co/Rl07CijzpZ RT @MTV: .@shakira dropped her eighth album #SheWolf 10 years ago today, so we're looking back at her 2009 with @MTVNews! 🔥 https://t.co/lu… https://t.co/qYQf8xHVSM Happy She Wolf album birthday to me! This was one of my favorite choreos of my career. Daniel \"Cloud\" Campos, a genius dancer &amp; artist! https://t.co/TZwtjoDGda El álbum She Wolf fue lanzado hoy hace 10 años! Para celebrarlo, les compartimos un fragmento de esta canción del #ShakiraFilm. En cines por solo una noche el 13 de Nov! +info/boletos https://t.co/dRREmsaq4N ShakHQ https://t.co/meN0r7I8aa Shak’s She Wolf album was released 10 years ago today! To celebrate, here’s a clip of its title track from #ShakiraFilm - in cinemas worldwide for one night on Nov 13! Info / tix https://t.co/dRREmsaq4N \nShakHQ https://t.co/vv8GMm188m And there’s more coming!!!! https://t.co/jA6S6d0wXY Pasando por la egoteca! https://t.co/h14v1jMcHf Mission accomplished! \nMisión cumplida!\n#fcbarcelona https://t.co/pb108mNoqR Felicidades @JuanLuisGuerra por Miami AA sold out! Bien merecido!!!!😘 te queremos https://t.co/Q6x8QZHiRg No me puedo sacar esta canción de la cabeza! I can’t get this song out of my head! https://t.co/RrpKsf3ZJY Con ganas de ver a Colombia jugar en la Copa Davis!! 🇨🇴 🇨🇴 🇨🇴 \nDying to see Colombia play at the @DavisCupFinals this November 18th!! 🇨🇴 🇨🇴 🇨🇴 https://t.co/AIPWMHfIxI RT @RecordingAcad: .@Shakira is not only a global superstar but has also made #LatinGRAMMY history. https://t.co/eV5Jg9Jcm3 A lil song my son 👦🏻 taught me today. “Alegria” \nUna cancioncita que me enseñó 👦🏻 Milan. “Alegria” https://t.co/mVqH5vIEM5 Cuántos campeones en nuestras escuelas!!! \nFelicidades Freddy! Un orgullo para @fpiesdescalzos!!! https://t.co/Y6n4TYCae5 This interview was fun! I can only imagine how much fun it would be on the D-day! Esta entrevista estuvo divertida. Me puedo imaginar lo que será este 2 de Febrero sobre el escenario! https://t.co/s7UXMorbOX https://t.co/vLQMdSORP1 Today an uncanny talent and unique soul has departed. \nBusbee you left us so early, but your music and your passion will be among us and forever cherished. \nMy condolences to his family and the music community in Nashville. https://t.co/g9ya0eeNav I owed you this one for making Don’t Bother the #1 past video on YouTube! (I still don’t understand why!) \nLes debía esto, por haber hecho de “Don’t Bother” el video #1 en todo el mundo con más de 5 años! (Y aún no sé por qué!)💋 https://t.co/VFByNYVjbI El orgullo es mío al llevar conmigo a todas partes mi tierra!!! https://t.co/RFeYPJsL8A RT @FOXSports: Two 👑 👑 \n\nFirst time together on stage…on the world’s biggest stage. Welcome @JLo and @Shakira to the #PepsiHalftime show at… Wow! I never expected such an amazing global response! Thank you so much for your support. It means the world to me. #SuperBowlLIV https://t.co/VtfnzhkPBQ It doesn’t get any bigger than this! So excited about getting on that #SuperBowlLIV #PepsiHalftime stage! @JLo 🤩🔥#nosvemosMiami #happybirthdaytomeee https://t.co/BVosjrOcwN Get ready 🌎 02.02.20 https://t.co/nCqtPIcc7w FALTAN 50 DÍAS para que la película de El Dorado World Tour llegue a la pantalla gigante! Para encontrar su sala de cine más cercana y reservar su boleto visiten https://t.co/3fD2MBnBjW ahora!\nShakHQ https://t.co/byJQBUGhWD FIFTY DAYS until #ShakiraFilm hits cinemas around the globe, telling the story of the El Dorado World Tour! Find your local screening and book tickets at https://t.co/3fD2MBnBjW now! \nShakHQ https://t.co/6hiyatcT8s RT @ektorin1977: El video de Don’t Bother de Shakira ya es el 5º video más visto en las últimas 24 horas en YouTube! \n\n@shakira https://t.c… Don’t Bother is at #7, insane!! \nhttps://t.co/OGRJYO6Igw La guitarra que uso cuando toco Don’t Bother en concierto! https://t.co/JLDNSVQAX7 https://t.co/NINDGnQrxw Now Don’t Bother is 11! \nAnd here I am watching it too after so long! So many fun things we got to do in that video! \nCrushing that car was a thrill!! \nhttps://t.co/OGRJYO6Igw https://t.co/8jFWoba1WR Just heard my Don't Bother video from 2005 has had 2 million views in 24 hours and is currently in the Top 20 most-viewed videos on YouTube! So random! That was a fun one to make - and I still love that pink guitar! \nhttps://t.co/OGRJYO6Igw In our Chocó and Barranquilla’s @fpiesdescalzos schools! https://t.co/i02XKuU7FT Recordando una canción inolvidable de un amigo inolvidable. https://t.co/2zxKwpGrka Dani, gracias por compartir con nosotros la importancia de programas como estos de psicomotricidad en la educación infantil!! Deseamos que todos los coles públicos y privados integren el ejercicio físico diario a la educación formal empezando desde la edad más temprana! https://t.co/KnoQvHMDxQ RT @fpiesdescalzos: ¡Estamos felices y orgullosos de poder tener el apoyo de @metodowave y @EADABusiness como parte de nuestro proyecto Tra… Shoot day / día de rodaje para el #ShakiraFilm https://t.co/hTrj4WjUfl RT @LiveNation: Just released! Check out the official trailer for @shakira In Concert: El Dorado World Tour coming to cinemas worldwide Nov… Thanks for your messages!! I’m so lucky to have you! You guys are the best!! ❤💋😘😘😘😘\nGracias  por sus mensajes tan cariñosos!! Tengo tanta suerte de tenerlos!!! ❤💋😘😘😘😘\nQué ganas de noviembre! Can’t wait for November! RT @TrafalgarRel: The trailer for Shakira In Concert: El Dorado World Tour has just launched - the film comes to cinemas on November 13.… RT @billboard: The first official trailer for @shakira's film is here 👀 https://t.co/lSkLMheGQ4 RT @SonyMusicLatin: .@shakira lanza el primer adelanto de Shakira In Concert: El Dorado World Tour, que llegará el 13 de noviembre a los ci… La película del tour El Dorado llega a los cines en más de 60 países este 13 de Noviembre! Increíble saber que en Islandia, Bolivia, Grecia, Paquistán y en muchos otros países estaremos todos compartiendo al mismo tiempo!\nAquí va el trailer, espero les guste!😘\n#ShakiraFilm https://t.co/dSFDuw19px Happy trailer day! My concert film is coming to theaters in 60+ countries two months from today, on Nov 13!! I’m so psyched that people in Iceland, Bolivia, Greece, Pakistan and many more will get to be a part of this with me on the same day! Here’s the trailer just for you! https://t.co/dybq6qvVYc ... with physical activity and movement outside the classroom, which all contribute to more outstanding academic results at school. (2/2) What happens outside the classroom counts too. At @fpiesdescalzos as part of our holistic model and open-door policy we complement our in-school programs with others for the community, like home visitation, parent education, and encouraging a healthy lifestyle... (1/2) https://t.co/RnfHobsZ08 ... donde la actividad física tiene un papel fundamental para conseguir mejores resultados académicos. (2/2) Lo que pasa fuera de las aulas también cuenta! Como parte del modelo holístico y de puertas abiertas de @fpiesdescalzos, complementamos nuestro programa escolar con visitas domiciliarias, formación a padres y maestros a través del cual fomentamos un estilo de vida sano... (1/2) https://t.co/jZcIg598Ha RT @fpiesdescalzos: ¡@metodowave educación mediante el movimiento! El Método Wave® puede ejercer un importante impacto en el desarrollo int… Preparándome para la Davis en Madrid y apoyar a mi equipo colombiano!\nPreparing for the Davis Cup in Madrid and supporting my Colombian team! 🇨🇴🎾🏆 https://t.co/icgtEg9807 Acabo de encontrar mi vehículo! Perfecto para recoger a los niños del cole!\nI think I just found my perfect vehicle for taking the kids to school and popping to the shops! https://t.co/wkl8hX8U0F We're super excited to announce Shak's dazzling new perfume, Sweet Dream! Find out more at https://t.co/wiuvah2Uef \nEstamos muy felices de poder comunicarles que Sweet Dream es el nuevo perfume de Shakira! Para poder conocer todos los detalles: https://t.co/wiuvah2Uef\nShakHQ https://t.co/7cd5ijCwiW El primer dúo de América Latina en ganar en los dobles del US Open!!!! Orgullo colombiano!!! First South American duo to ever win the US Open doubles!!!! So proud of my fellow Colombians!! https://t.co/atNBZUmkrd Two of the most in shape women I know @KellyRipa and @TheAnnaKaiser! https://t.co/Q6BPaYKtwY New York skyline! Look at that! NY y el crepúsculo! https://t.co/k5mOAKndAq With David Haggerty from @ITF_Tennis and the hubby! Con David Haggerty de la @ITF_Tennis y el maridito! https://t.co/iKZokgNHtt NY skyline! https://t.co/hGOKRmqJIy At Sony Music NY accompanying @3gerardpique and Kosmos tennis! https://t.co/wjOGSg0vvS Dani Martinez from WAVE Method working with some of our hardest to reach kids in Choco. \nDani Martínez del @metodowave trabajando con niños del Chocó, una de las regiones de mas difícil acceso. https://t.co/avm21hoM4K Implementamos el metodo WAVE enfocado en fortalecer estas habilidades  claves en el desarrollo cognitivo y socio-emocional de los niños, demostrando obtener un impacto positivo en los resultados académicos de nuestros estudiantes. En nuestras escuelas @fpiesdescalzos promovemos la actividad física y el deporte  con el fin de desarrollar la psicomotricidad gruesa desde la primera infancia. (1/2) https://t.co/qTmwGyr6nk We implement the WAVE method, which focuses on strengthening these abilities which are key to cognitive and social emotional development, proven to yield more outstanding academic results. In our @fpiesdescalzos schools we promote physical activities and sports to help our students develop gross and psychomotor skills from the early years onwards (1/2) https://t.co/Hs1Smlrirb RT @idolator: A truly global queen! @shakira is releasing a concert film on more than 2000 screens in 60+ countries in November.: https://t… Por si no lo vieron, Shakira en Concierto: El Dorado World Tour llegará a 2,000 cines en más de 60 países el 13 de Noviembre (se añadirán más cines y países)! Para encontrar su sala más próxima y reservar sus boletos ingresen en https://t.co/5MKC1TN3qb ShakHQ #ShakiraFilm https://t.co/xfFTkoRevX In case you missed it, Shakira In Concert: El Dorado World Tour is showing at 2,000 theaters in over 60 countries on Nov 13 (with more cinemas and countries to be added)! Find your nearest screening and book tickets now at https://t.co/5MKC1TN3qb. ShakHQ https://t.co/IV3a3KZ6UL RT @TrafalgarRel: We are excited to announce Shakira In Concert: El Dorado World Tour will be coming to cinemas worldwide this November.… Este 13 de Noviembre El Dorado World Tour será estrenado en cines alrededor del mundo. En este link - https://t.co/3fD2MBnBjW - obtén info sobre el estreno en tu país. Nos vemos en la pantalla gigante. Traen las🍿?! 😘 #ShakiraFilm https://t.co/pdIPRbChrg I have news! My new tour film is coming to theaters worldwide on November 13. Can't wait to relive the show with all of you simultaneously. Got popcorn?! https://t.co/3fD2MBnBjW  😘 #ShakiraFilm ⁣ https://t.co/hkCIQAyhnY My beloved Brazil! Speak up and stop the deforestation of the Amazon which is 20 per cent of the air we breathe. The home of our people and our fauna should be protected. The Amazon is ours, is everyone’s! Shak https://t.co/y9W5a5YjbO Girls night out! Shak https://t.co/10Ee1sG7WJ Yes! This is my face before every  session with @TheAnnaKaiser! Shak https://t.co/0ja9Agfal6 Con esta bici seguro que no llego hasta el Tayrona! Shak https://t.co/HPgq4oGK4K Well... it was really a rental with a soothing sound! Shak https://t.co/KjaBjonJte Check out my new video with @PANDORA_NA jewelry! Shak \n#pandorapartner https://t.co/ZfaWBQj0eh RT @PANDORA_NA: Showcase every side of your style, every side of who you are. #WHOIAM\n\nGet Shakira’s Look: https://t.co/zcHnqm6Kik https://… Ok that wasn’t too bad, I survived! Shak https://t.co/Qfz4Do3atZ Colombian coffee is a must when you’re about to get Kaisered! \nShak https://t.co/Nagd73VWAb Los equipos femeninos de la @fpiesdescalzos de Barranquilla son imparables! Campeonas de fútbol prejuvenil y juvenil! Shak https://t.co/3Gepyteoch Hasta el 28 de Agosto, si se toman un selfie en tiendas de @PANDORA_NA en 🇺🇸🇨🇦🇲🇽🇨🇱🇨🇴🇪🇨🇳🇮🇨🇷🇭🇳🇬🇹🇸🇻🇵🇾🇺🇾🇧🇴🇵🇪 y lo publican en instagram con #ShareTheLovePANDORA, Pandora aportará $1 a la @fpiesdescalzos a través de la Genesis Foundation. ShakHQ\n+ info: https://t.co/J1CtZrITpT https://t.co/6KoODMcZBW Until Aug 28, take a selfie with Shak in select @PANDORA_NA stores in 🇺🇸🇨🇦🇲🇽🇨🇱🇨🇴🇪🇨🇳🇮🇨🇷🇭🇳🇬🇹🇸🇻🇵🇾🇺🇾🇧🇴🇵🇪 and post to Instagram using #ShareTheLovePANDORA and PANDORA will donate $1 to Shak’s @fpiesdescalzos, via the Genesis Foundation! ShakHQ\nFull T&amp;Cs: https://t.co/J1CtZrITpT https://t.co/dXVuXodT8M RT @fpiesdescalzos: Felicitamos a las campeonas de fútbol femenino prejuvenil y juvenil, por su disciplina y esfuerzo ¡Orgullo Pies Descalz… ~ Twenty years ago today, Shak recorded her Grammy-winning MTV Unplugged album in New York! \n~ Hoy hace 20 años, Shak grabó su MTV Unplugged en la ciudad de Nueva York. Por este álbum, Shakira ganó un Premio Grammy (Mejor álbum de Pop Latino) y dos Premios Grammy Latinos.\nShakHQ https://t.co/h2FHfCOWXO RT @fpiesdescalzos: Ivette Angulo, rectora del Claustro de la Enseñanza, nos comparte esta reflexión sobre el compromiso que debemos tener… Construction starts today on the new @fpiesdescalzos school in El Bosque in Barranquilla. 1,000 students and 60,000 community members will benefit from it. 6000 square meters, 28 classrooms, library and cafeteria. Thank you to all our partners for making this dream possible! Shak https://t.co/pp2zq4Cq6D @fpiesdescalzos @alcaldiabquilla @AlejandroChar @SEDBarranquilla @FundlaCaixa @FundacioFCB @LaSalleCollege En un año tendremos un colegio de primer nivel con 28 salones, una biblioteca, dos laboratorios, cocina, comedor,... Gracias a todos los socios por ayudarnos a hacer posible este sueño! Shak https://t.co/Udc9YFH6sf Hoy empieza la construcción de la nueva escuela de la @fpiesdescalzos en El Bosque (Barranquilla)! 6 mil metros cuadrados de instalaciones para 1,000 alumnos de preescolar a bachillerato que beneficiará a 60,000 habitantes de mi ciudad natal (1/2) https://t.co/THn3FnL3MY RT @fpiesdescalzos: Gracias a @alcaldiabquilla, @SEDBarranquilla, @FundlaCaixa, @FundacioFCB y @LaSalleCollege, hoy cumplimos una promesa a… RT @PANDORA_NA: @shakira glowing in Pandora Rose™. #WhoIAM\n\nExplore Shakira's Picks: https://t.co/19VaqgqvUC https://t.co/ZynIvyWid7 You picked wolf / Escogieron el lobo ✅ \nYou chose coral / Seleccionaron coral ✅ \nNow we just need you to help decide on a NAME for Shak’s new perfume!❓/ Ahora necesitamos que nos ayuden a escoger el NOMBRE del nuevo perfume de Shak!❓\nShakHQ @fpiesdescalzos Education not only breaks the cycle of poverty but also serves as a ladder to help an entire generation reach for their dreams. (2/2)\nShak https://t.co/AQdFhlJqS5 Thousands of students have begun the new school year at the @fpiesdescalzos schools. Images like these remind us that education must be a universal right for everyone. (1/2) https://t.co/abp3GfRZOo @fpiesdescalzos La educación no solamente rompe el ciclo de la pobreza sino que también se convierte en una escalera para lograr los sueños de toda una generación. (2/2)\nShak https://t.co/mmjzZOSGof Miles de alumnos empezaron un nuevo ciclo escolar en las escuelas de la @fpiesdescalzos! Imágenes como éstas nos recuerdan que la educación debe ser un derecho para todos los niños y niñas del planeta. (1/2) https://t.co/KqYDQlzpF9 RT @FundacioFCB: #MondayMotivation by @shakira  📖⭐\n\n\"Cuando abres una escuela cambia el mundo\".\n @fpiesdescalzos  👏 https://t.co/Dj7bSSg3GK So proud of my fellow Colombians in @LeTour - 3 in the Top 10! Congrats @EganBernal on your incredible victory! 🇨🇴🚴‍♂️🥇\nOrgullosa de mis compatriotas en @LeTour! 3 colombianos en el Top 10! Felicidades Egan Bernal por tu impresionante victoria!! 🇨🇴🚴‍♂️🥇\nShak\n📷 @LeTour https://t.co/7VxdQfRp6o Favorite Color / Color Favorito Right… you told us the wolf is your favorite animal (auuuuu!). Now, Shak needs you to pick a color, as she continues to decide the direction of her new perfume / Ya tenemos su animal favorito (auuuuu!). Ahora ha llegado el momento para que escojan un color!\nShakHQ https://t.co/zf58r72uOo RT @FMSDColombia: Hoy celebramos el fallo que da vía libre a la construcción del colegio de #VillasDeAranjuez y otros proyectos de vivienda… RT @BibianaRinconL: Con la adjudicación del contratista que ejecutará la construcción de la primera etapa del Megacolegio El Bosque, ponemo… Congratulations to all of the @PANDORA_NA #whoiam contest winners! Enjoy your prizes! Muchas felicitaciones a todos los ganadores del concurso de @PANDORA_NA #whoiam! Esperemos que disfruten de los premios! ShakHQ #PANDORApartner. https://t.co/pvcnHhMsYk Me and the stingray (without the sting!) in absolute peace and harmony at the fantastic Balmoral island! Shak https://t.co/dnULlfV0or Su animal favorite es... Your favorite animal is... Shak necesita de su ayuda para crear su nuevo perfume Rock! Qué animal prefieren? \nShak needs your help! Vote for your favorite animal to help decide the direction of her upcoming new perfume Rock! \nShakHQ https://t.co/MaNeY1P1Ge You guys did such a great job helping to create Shak’s Dance Moonlight perfume last year, now we need your expert input on her upcoming new perfume Rock! \nShakHQ https://t.co/47FVnpSyfh Hace un año hicieron un trabajo tan increíble ayudando a Shakira a crear su perfume Dance Moonlight que queremos contar con ustedes otra vez! Mañana empezaremos a colaborar en la creación del nuevo perfume de Rock! \nShakHQ https://t.co/h0DsvFVxGE Ahora nos viene el reto de ayudar para su beca universitaria @fpiesdescalzos! Daniela, egresada nuestra de la @fpiesdescalzos, en la @NASA! Elegida para participar como ponente por América Latina. Súper orgullosa de ti Daniela!! Shak https://t.co/E2tHmrXZnQ y el refugio en tus padres, tu hermano y todos  los que también te han amado y de verdad conocido.\n\nSeré siempre tu amiga, a pesar de cualquier cosa, en el más allá, como en esta vida.\n\nTe quiero amigo,\n\nShakira. Has realizado  tantas luchas, muchas de ellas inmerecidas y aquella por tu vida la has librado como siempre, con la dignidad y fortaleza que tanto admiraba. \nAhora descansa y vuela hacia un mejor lugar donde no hay traiciones, ni desilusiones, ves a buscar la tranquilidad (2/3) Fernando querido, \n\nTe has ido para siempre amigo. \nTus hijos, tu esposa Inés, tus nietos, tus amigos y yo, te recordaremos con un grande y profundo cariño por tu humildad y el fondo tierno de tu alma que bien conocíamos quienes te queríamos. (1/3) https://t.co/mXdMBwkmgc So happy to accompany all of you with my music! ❤Shak https://t.co/Jjd9l7VRyY Kissed by Mickey, a little angel of the sea! Shak https://t.co/crZHJcwCwA Picture taken by Sasha Piqué Mebarak my new 4-year-old photographer! Foto tomada por Sasha Piqué Mebarak, mi nuevo fotógrafo de 4 años! Shak https://t.co/0jS1d5i6Gw Working out to Green Day is awesome, anything to Green Day works for me! Shak https://t.co/ZyTjkXpJvi Querido @carlosvives tu nueva canción y video son espectaculares y de muchísimo nivel! Gracias por recordarle al mundo los colores de nuestra tierra! \nPor una Guajira tan bella como Indira es entendible que no la cambies ni por mi! 😜 Shak\nhttps://t.co/pLaz2E4kCd https://t.co/9txtPPxPMb Colombia vamos que estamos increíble!!! Shak \n❤️❤️ 🇨🇴 🇨🇴 https://t.co/4IbdguRFpb Yeah! That was amazing! So cute!! \nGood choice @iamwill! https://t.co/nMC6qTh5vn Shak Felicitaciones a mi Colombia en su increíble debut en la Copa América! Vamos por más!!!! 🇨🇴 Shak Fuerza esta noche a mi Colombia!! ❤ Shak Ok...  última foto en vestido de baño... por ahora 😜... Solo una pregunta: quién quiere que le diseñe uno? Ok last bathing suit pic for now 😜... Only one question: who wants me to design a bathing suit for you girls? Shak https://t.co/1LNwPQPjfN Happy bday my good friend!!!! Shak https://t.co/sd97aiKgdI Check out the bathing suit I designed! Qué les parece este vestido de baño que diseñé? Shak https://t.co/LdslZ4mQOm Junior “tu papa” campeón de liga!!!!!!!! Me hicieron la noche y me hicieron el día!!! ❤ Shak https://t.co/YAMerG1jcg ¿Son madres o padres? ¿Qué apoyo necesitan para equilibrar el tiempo entre su trabajo y su familia? Responden la encuesta de paternidad de @UNICEFenEspanol. #LaPrimeraInfanciaImporta https://t.co/S0d8PzSfi7 The most precious thing in my life is time with my two beautiful children.\nAre you a parent? What support do you need to balance work and time with your family? Add your voice to the @UNICEF parenting poll. #EarlyMomentsMatter https://t.co/FhS5yaPWRd Poniéndome a punto en las artes marciales con cinturón negro Artes Marciales MAC! \nFine tuning my martial arts training with black belt 🥋 Artes Marciales MAC! \nShak https://t.co/MXPKd0RtNJ En paz\nPeace\nShak https://t.co/QHO33rZy4p Gracias por esas palabras y ese recibimiento!!! Si yo soy un planeta tú eres un astro y ayer brillaste como solo tú sabes @AlejandroSanz!!! Shak https://t.co/dg5Wat8qMR RT @AlejandroSanz: #Barcelona hoy me has dado la mano y ya no te quiero soltar. Como esos amores adolescentes desbordantes de felicidad, in… Esta es la pose de “miren mis flecos” Shak https://t.co/P9Qz7OUQJn Gracias Ale - @alejandrosanz - por regalarme ese momento con un público inolvidable! \nTe quiero!! Shak https://t.co/V4M5aI7j1s Un abrazo de un amigo es un bálsamo para el corazón! Shak https://t.co/MNA5btir6n Minutos antes de salir con @alejandrosanz esta noche, a última hora cortando flecos y agregando flecos! Shak https://t.co/oeDx93H8Uz Sorpresa! Con mi amigo Ale en 3’ segundos https://t.co/rlNlh2FESU Check out these exclusive, unseen images from Shak’s shoot with @PANDORA_NA!\nHoy les compartimos estas imágenes inéditas de la sesión de fotos de Shak con Pandora!\n #PandoraPartner \nShakHQ https://t.co/qSodG5ONVL Soy un koala! I’m a koala! Shak https://t.co/qBApZGhrMh The video for 'No' from Fijación Oral, Vol. 1 just became Shak’s 33rd video to reach 100m views on @YouTube! \nEl video 'No' del álbum Fijación Oral, Vol. 1 es el video número 33 de Shak que supera los 100 millones de reproducciones en @YouTube! \nShakHQ\nhttps://t.co/iHm9Bf9S83 https://t.co/QnkIwwokgT RT @PANDORA_NA: Everyone has a unique story to tell. Post a pic showing the many sides of who you\nare with #WHOIAM #contest for a chance to… Gracias Adrián (@ADRIANTORRESART)!!! \nIncreíble! \nShak https://t.co/sPaqiH0fq9 Cherries!! Cerezas!! Shak https://t.co/48EkFEk7B7 And you just made mine!!! \nThere are days when we could all use a compliment! Thanks Serena!😘 and btw I’m a big fan!! Shak #kindergirlworldday https://t.co/aHa3SLgHIj Check out this behind-the-scenes film from Shak’s recent @PANDORA_NA Jewelry shoot! Así se hizo el último rodaje de Shak con Pandora! #PandoraPartner ShakHQ https://t.co/QrjRnZe3fj https://t.co/0ajL3lgpnx Y qué me dicen de esta con la palmera en la cabeza! And here with a palm tree head!\nShak https://t.co/xCv4XSPQbZ Y para compensar por todo el sufrimiento humano... Dios creó el mar / And to make up for all human suffering... God created the sea. https://t.co/TVSYkCepZX Today, Paddle surf! Hoy, Paddle Surf! \nShak https://t.co/7abXi2uOPn RT @fpiesdescalzos: ¡Hoy es el día del maestro en Colombia! Queremos agradecer y reconocer esta labor fundamental de los profes para la con… Artista, mujer, madre, viajera. #WHOIAM. Cada persona tiene una historia para compartir. Suban una foto mostrando quiénes son y su historia personal con #WHOIAM, #contest y @PANDORA_NA. Podrán ganar un viaje a España o a Colombia. https://t.co/llvDb2m42a #PandoraPartner SHQ Artist, woman, mother, traveler. This is #WHOIAM. Everyone has a story to tell—post a photo showcasing the many sides of who you are and tag #WHOIAM, #contest, @PANDORA_NA —you could win a trip to Spain or Colombia. Rules: https://t.co/llvDb2m42a. ShakHQ #PandoraPartner https://t.co/bDr9UdpmHb Un poco tiesa pero han sido dos años sin jugar!!! #ShaksComeback!! https://t.co/t4EJdlUnD7 RT @FundlaCaixa: .@shakira visitó ayer por sorpresa a los jóvenes participantes del #RetoEmprende en #Barcelona con el que han fomentado su… (2/2)... a contarnos los proyectos innovadores que han desarrollado para mejorar las condiciones de pobreza y vulnerabilidad de sus comunidades.\nShak Con los estudiantes emprendedores de nuestras escuelas de la @fpiesdescalzos que han viajado de Colombia a Barcelona gracias a @FundlaCaixa, @fpiesdescalzos, @FundacioFCB @FCBarcelona_es y @FTelefonicaCo (1/2) https://t.co/2fKwfj1NMt RT @FundacioFCB: 👋@shakira\n\n@jordicardoner i la cantant colombiana han rebut els participants del campus \"Joves emprenedors\" de @FundlaCaix… Felicidades a la mía y a todas nuestras madres;\nPor creer, cuidarnos, enseñarnos, y por el amor que nos han dado desde siempre y que durará por siempre!\nShak https://t.co/8nbcom1IET RT @fpiesdescalzos: Los chicos de Pies Descalzos se reunen hoy con @shakira para contarle de sus proyectos del #DesafíoEmprende de @FundlaC… RT @billboardlatin: Spotify revealed that @shakira is among the most-streamed musician moms globally https://t.co/ibuyTxGW8x https://t.co/f… 1.7 millones de votos ayudaron a Shak a crear su nuevo perfume #DanceMoonlight! Muchas gracias a todos! Here’s Shak saying a big thanks for the 1.7 million votes which helped to create her new perfume, Dance Moonlight! ShakHQ https://t.co/R0RRpS9NRi https://t.co/nsC0M621hv Discover DREAM, the new perfume by Shakira. Descubran DREAM, el nuevo perfume de Shakira. https://t.co/qGZptQ6rll\nShakHQ https://t.co/8rJx9ygR0i Campeones! 🔵🔴🏆 @FCBarcelona Shak https://t.co/hTEg2DmY78 Muchísimas gracias a todos por los premios @LatinBillboards y un beso muy muy grande! Los quiero mucho! Shak https://t.co/ZrcWZjyFCw Thank you everyone for the @LatinBillboards awards! It means a lot to me! Thank you! Thank you! Thank you! Shak https://t.co/wFXDCpPptm My team at @SonyMusicLatin... Best team in the world, better than Barça 😜 Shak https://t.co/hTE2GJZ9P9 Hay que ver sus caritas de felicidad! To see their happy faces is priceless! Shak https://t.co/hDD63jMoCX https://t.co/iAIOu7t32I Good Friday drawings! Shak https://t.co/XMqMVxxB9X The video for Loca has just passed 500 million views! \nEl video de Loca ya tiene más de 500 millones de reproducciones! https://t.co/R7z9LvaRnR ShakHQ RT @billboard: Watch @shakira pay tribute to Gabriel García Márquez on the fifth anniversary of his death https://t.co/Nf0SYONgmv https://t… Tratar de resumir una persona tan grande en pocas palabras como Gabo es una tarea muy difícil pero intentar recordar alguien como él es realmente muy fácil... https://t.co/iZ3X8bINZz https://t.co/oks1meA8pk Querido Gabo, te recordamos para mantenerte vivo.\nShak \n#5AñosSinGabo https://t.co/TrXvlRJT2y Burning calories to Ice Cube’s “Arrest the President”. Shak @theannakaiser @theaktstudios https://t.co/tgZlmejGLl Para parecer más alta hay que ponerse siempre en la primera fila de una foto. Esta lección sobre perspectiva básica la aprendí de Beyoncé rodando “Beautiful Liar”.  \nShak https://t.co/wyEMVXAlqV To look taller always put  yourself at the front row of a pic! \nLearned this lesson on perspective from  Beyoncé while shooting “Beautiful Liar”. \nShak \n@TheAnnaKaiser @theaktstudios https://t.co/qgRyRlQwGV Two of our @fpiesdescalzos students, Yulieth Posso and Herling Narváez, have received scholarships to study Environmental Engineering! So happy!! Hoy estudiando Ingeniería Ambiental con becas!! Cositas que alegran el corazón!! Shak https://t.co/mF1qb1nucV Important @UNICEF report shows that 175 million children are missing out on the benefits of pre-primary education. This is unacceptable. #EarlyMomentsMatter https://t.co/jlfyTPwvpY https://t.co/POuCFCpMSw RT @UNICEF: Less likely to read.\nLess likely to count. \nLess likely to finish primary and secondary school.\n\nWhen children miss out on pre-… RT @UNICEF: Every child deserves a quality education. \n\nWe’re calling on world leaders to invest more in pre-primary education, to give chi… Qué belleza cómo se cambian “el micro”!\nTienen ritmo!\nShak\n@fpiesdescalzos https://t.co/jc6xj4cEoK .@JuanLuisGuerra me encanta tu nuevo sencillo \"Kitipun\" y el video está espectacular! Eres un genio! Un beso! Shak https://t.co/A9G1lUrJIZ Car wash cuddles! Shak https://t.co/3sefz59nTg Recordando al Joe. Genio absoluto!\nEsta música está mas dentro mío que la médula de mis huesos!\nShak https://t.co/CBrDdkJUqa Ay qué guapo mi marido en La Resistencia! Shak @LaResistencia https://t.co/PI5fxEB9Sa Happy 5th birthday to the Shakira album, released on this day in 2014 / Hoy celebramos los 5 años del álbum Shakira que fue lanzado el 21 de Marzo de 2014! ShakHQ #tbt https://t.co/xhGOjzUMJj https://t.co/0Mp5m5ludV Me gusta ver a @Oprah bailando así! Loving this playlist 😍 \nRepost • @jznotthatjayz Someone tell Tim Apple to change the dancing emoji to an Oprah dancing emoji 💃🏽💃🏽💃🏽 @oprahmagazine https://t.co/3PPJLTmbXn RT @SpotifyColombia: ¿Cuántas canciones de @shakira has cantado como si fueran tu propia vida? Ella misma nos cuenta las historias detrás d… No se pierdan la playlist #MujeresEnLaMúsica de @SpotifyColombia!! -&gt; https://t.co/d6hjU4ef6o\nShakHQ RT @UNICEF: Vanessa, 16, has grown up surrounded by violence in the Democratic Republic of Congo but she dreams of becoming a humanitarian… Every day I meet girls who smash gender stereotypes and prove that a girl can do anything.  She just needs an equal chance to discover her talents, build her skills and choose her own path.\n#WomensDay @UNICEF https://t.co/OGXU1xahcV https://t.co/5LlgxfYvG8 Women are: \nResilience  \nPerseverance \nIntelligence \nGenerosity\nLas Mujeres Somos: \nResistencia\nPerseverancia\nInteligencia \nGenerosidad \n#Womensday #FelizDiaDeLaMujer @fpiesdescalzos https://t.co/Yi58VQVDev Recordar es vivir. \nPapá con Sashi!! \nTo remember is to live. \nDad with Sashi!!\nShak https://t.co/VMYr8CzNRn Mi niño se me está creciendo muy rápido! My baby is growing up so fast! Shak https://t.co/mVNaGX91Ut Mi marido hoy un espectáculo! I want to add my support for this initiative that aims to help the people of Venezuela, who are suffering one of the worst crises in their history. Shak\nhttps://t.co/phtYlIHbjT\n@VenezuelaAid #AidVenezuela #AyudaVenezuela #VenezuelaAidLive https://t.co/zdOtFqmOXz Quiero sumarme a esta iniciativa por el pueblo venezolano que está sufriendo uno de los momentos más críticos de su historia. Shak\nhttps://t.co/phtYlIHbjT\n@VenezuelaAid #AidVenezuela #AyudaVenezuela #VenezuelaAidLive https://t.co/IVbW5gKG3G Sí se puede educar en las condiciones más difíciles! Una de tantas historias de éxito! Shak @fpiesdescalzos https://t.co/aqoyKuBqHP Me uno a este aplauso junto con todas las madres y padres, por los niños que luchan contra el cáncer #DiaInternacionalDelCancerInfantil #AplausoJuegaterapia https://t.co/XQgdY1MWtt \"Artist, woman, mother, traveler. This is #WHOIAM\"\nTell us who you are and how you show it. ShakHQ @PANDORA_NA #ad https://t.co/QTEM6ITOKm Shak has been nominated in four categories at the 2019 @LatinBillboards Music Awards! Shak ha sido nominada en cuatro categorías de los premios @billboardlatin de este año! ShakHQ #Billboards2019 https://t.co/rhc7z7AS7U Trying to burn the 4 plates of pasta from last night! Intentando quemar los 4 platos de pasta de anoche! Shak https://t.co/xuAanpBLCz Dead on! / Clavado! Shak https://t.co/2tt6XmfcZr Getting in the mood for Valentine's! Todo preparado para celebrar San Valentín! ShakHQ https://t.co/s3UKZzZsQ8 https://t.co/skykNZuoQp RT @billboardlatin: Listen to @Shakira's 10 most-streamed songs! https://t.co/wLqM01Kdo6 https://t.co/8Lvziys2rB Así es en mi tierra! Shak https://t.co/K8XT6toDsV Gracias por todos sus mensajes profundos y cariñosos de ayer, me llegaron al corazón! \nLes comparto nuestro pastel.  \nLos quiero! Thanks for all your affectionate and moving messages yesterday. \nHere is how we celebrated as family. \nLove u! \nShak https://t.co/6KDJmFHNNq RT @wef: Jack Ma: \"I believe if a person wants to be successful, they should have a high EQ.\" #wef18 https://t.co/8GMHvBtOao Break is over! Training with @TheAnnaKaiser! El descanso terminó! Entrenando con Anna Kaiser y @theaktstudios! Shak https://t.co/B2p7kGUZnJ Gerardo estoy pensando en ti y donde sea que estés te recuerdo. Shak https://t.co/HzqDXQm2lC Con profundo dolor acompaño a los familiares de las víctimas del atentado de ayer a la escuela de cadetes. Están en mis oraciones y en mi pensamiento. Colombia necesitamos hoy más que nunca permanecer unidos y luchar por la vida y el respeto a los derechos humanos. RT @ESADE: \"Education should be a right and not a privilege\". Rebeca Aguado, a BBA student granted the @tuSEAT Scholarship, wanted to share… Nuestros voluntarios son vitales para  nuestro proyecto @fpiesdescalzos. Gracias Rebeca Aguado por tu trabajo social en Colombia. Y gracias a la colaboración @ESADE / Pies Descalzos y a la Miranda Global School por facilitarla! Shak https://t.co/SziBennD0O Hips Don’t Lie ft @Wyclef just hit 400m plays on @Spotify! Hips Don’t Lie ya tiene más de 400 millones de reproducciones en @Spotify! ShakHQ  https://t.co/WLb4SFfyBW https://t.co/RTdRa9vIN8 ~ Shak has been nominated for Latin Song of the Year at the 2019 #iHeartAwards, for Clandestino with @maluma! \n~ Shak ha sido nominada en la categoría de “Latin Song Of The Year” en los @iHeartRadio awards de este año por la canción de #Clandestino con Maluma! \nShakHQ https://t.co/ALsV00LM47 Shak ha sido nominada en 3 categorías de los @premiolonuestro! Para votar -&gt; https://t.co/ZX65gja2RX (gracias!) \nShak has been nominated in three categories at this year's Premio Lo Nuestro Awards! You can vote for her to win at https://t.co/ZX65gja2RX (thanks guys!) \nShakHQ https://t.co/JwOgl9TKZX RT @RakutenArena: Head to our Facebook page NOW to see the final episode of our Tales from the Tour series ✨\n\n➡️ https://t.co/oKGcz8CJn1 ⬅️… RT @antonioguterres: One year ago, I issued a red alert to the world. The dangers still exist, but I also see reasons for hope. In 2019, le… A little look back at an amazing year / un pequeño resumen de un año increíble. ShakHQ https://t.co/tSI4S9DrMt Last moments of the year / últimos momentos de este año. Shak https://t.co/23kTWwvipD The beauty of this world / Una belleza. #nofilter Shak https://t.co/HhFyaYM22x Felices fiestas! Happy holidays! Shak https://t.co/2rfvq2b8G7 Merry Christmas!!! Shak https://t.co/CYyyE9zdss Feliz Navidad!!! Shak https://t.co/XVdMuAlihv “A dream is always alive inside you / ”Un sueño nunca se acaba. Siempre está vivo\"\nhttps://t.co/30Wc3mrO13\nDream, the new fragrance by Shakira / la nueva fragancia de Shakira.\nShakHQ https://t.co/BJTP2Jyp8i 87 añitos. Qué lindo mi papito! Shak https://t.co/ctaSJ7BGf0 Seguimos luchando por nuestra juventud! Orgullosa de nuestros graduados de este año en nuestros colegios de la @fpiesdescalzos en Colombia! Shak https://t.co/AauYMjnipJ Recordándote en tu cumple amigo! \nFelicidades @AlejandroSanz!!! Shak https://t.co/gkY30CcFIA Felicidades al tiburón! Junior tu papá! Shak https://t.co/n6zujHK5F2 Miren lo que me pasó @alejandrosanz! Increíble!!! Nunca había visto nada igual! Shak https://t.co/hFCmlRvplK RT @RakutenArena: \"Our days start at five in the morning and end at three in the morning.\" 😱\n\n@shakira fans...stay tuned for more Tales fro… RT @RakutenArena: So many amazing images were captured throughout @shakira's El Dorado World Tour 🌟\n\nLet's learn more about the man behind… RT @codeorg: Today we kick off CSEdWeek 2018, and 50 million students will try the #HourOfCode globally! What will you create? https://t.co… Me encantó lo nuevo de @AlejandroSanz! Qué pedazo de voz!!! ⭐⭐⭐⭐⭐https://t.co/rpRb2y4z7X Shak Música nueva de @AlejandroSanz! \nQué alegria para todos nosotros sus fans!!!\nEscuchando ya!! Shak https://t.co/CKjMYpyN9U https://t.co/YhLncuSBIF Nuestro #tbt de hoy recoge algunos de los reconocimientos que Shakira recibió durante su última gira y que celebran el éxito de su álbum El Dorado (que ya casi tiene 10 Mil Millones de streams!)\nShakHQ https://t.co/80nf3xC9vT #TBT to the some of the presentation discs Shak was awarded during the tour to celebrate the success of El Dorado (which has now had almost 10 BILLION streams worldwide!) \nShakHQ https://t.co/JSYyUY1Ze0 Check out the exclusive “making of” film for the ad campaign for Shak’s new fragrance, Dream! / No se pierdan nuestro exclusivo \"making of\" del anuncio de #ShakiraDream, la última fragancia de Shakira! \nhttps://t.co/nid6nWZbtH\nShakHQ https://t.co/NaCBFHQxRu Gross motor skills programs for all in our @fpiesdescalzos’ schools!  Actividades de habilidades de motricidad en nuestras escuelas! Shak https://t.co/shkRMWtIJx RT @cerati: Bios: Vidas que Marcaron la Tuya: Gustavo Cerati.\nEsta noche por NatGeo.\n\n22:00 horas | Argentina y Chile\n21:00 horas | Colombi… Proud of young artist’s talents. Kudos to my niece Isabella Mebarak! Shak \nhttps://t.co/iSgjRwAayW https://t.co/YOtiZ1NN3O Save up to 40% on apparel and accessories - including #ElDoradoWorldTour merch - in the official Shakira store. \nhttps://t.co/1OFYuLr2SR / Celebramos el #BlackFriday en la tienda oficial de Shakira con descuentos de hasta el 40%.  \nShakHQ https://t.co/oh7uslDW2I Happy Thanksgiving! I’m thankful for new experiences and for a helmet! Shak https://t.co/sZ1kQT9Jpl \"Lo importante es dar todo de uno mismo y más. Vaciarse en ese sueño que uno quiere alcanzar\". Les compartimos el último episodio de la serie DREAM que celebra el lanzamiento de la nueva fragancia de Shak, #ShakiraDream. https://t.co/AiOmCBe2ME ShakHQ https://t.co/lwmCJGw8Bu Today is #WorldChildrensDay!\n Over 260 million children and young people are out of school globally.\nPlease sign @UNICEF’s petition calling on world leaders to improve education for every child.\nTogether, we can change this. \nhttps://t.co/2MbwHJyn5Z\nShak https://t.co/NCzRsv6dgN RT @fpiesdescalzos: Promover educación de calidad para niños y niñas en situación de vulnerabilidad, es nuestra manera de unirnos a este Dí… RT @UNICEFColombia: Todos los niños y niñas tienen los mismos derechos, conócelos aquí:  \n#DíaMundialDeLosNiños #DeAzul \nhttps://t.co/5mEac… Siempre quise encontrar dos cosas: un buen hombre y una trufa blanca!! Shak https://t.co/TdCtNoIrbC Eureka!! https://t.co/biCCctaLkJ No one said it would be easy!! Shak https://t.co/BZXQ81vmkL Después de la ruta de “El Dorado” comienza la ruta de la trufa blanca!Having found El Dorado, the quest to unearth the white truffle begins! Shak https://t.co/R5nNnIF0Il No way! I always say Dua Lipa Dua Lipa! \nShak https://t.co/X3HAX6lxcw Shak wasn’t the only one doing her vocal warm-ups pre-show... Shak no era la única que calentaba la voz antes de un concierto... ShakHQ @cabify_colombia @Cabify_Chile @cabify_ecuador https://t.co/bHuVukCuy3 RT @latnpop: @shakira El otro día en el metro puse la mano en el pelo y me salió eso https://t.co/LoiQEl54zU RT @AlexDitta: @shakira ES MUY REAL, YO AÚN TENGO EN EL FORRO DE MI CELULAR #ShakiraBogotá 😍🤭😂 https://t.co/bBI5My0z90 RT @cindyferrer: @shakira Estos son mis tenis que usé el día del concierto en Bogotá. Aún no lo supero que ni los quiero sacudir https://t.… A friend still finding confetti in random places. Are u too? Shak https://t.co/jvbWNugmOG Soccer mom at work! Shak https://t.co/de3mAexcik Les presentamos el último reto de emojis para celebrar el lanzamiento de la última fragancia de Shakira, Dream? Qué canción es? Descubran más sobre #ShakiraDream aquí -&gt; https://t.co/nid6nWZbtH. ShakHQ https://t.co/LNWpWQhUd7 It's our final emoji challenge to celebrate the launch of Shak’s new fragrance, Dream! Can you name the song? Post your answer below. And find out more about #ShakiraDream at https://t.co/nid6nWZbtH ShakHQ https://t.co/j0ZcnBGACI People have been asking what my Nada video co-star is called. Nobody seems to know! So let’s give this newly-famous 🐠 a name! Any suggestions?\nEn los últimos días me han estado preguntando cómo se llama el 🐠 del video de Nada. Le damos un nombre? Tienen alguna sugerencia? Shak https://t.co/XUtV6cXETg \"Las escuelas de Shakira\" \nvia @LaVanguardia \n@fpiesdescalzos @FundlaCaixa @FundacioFCB \nhttps://t.co/KsxgFUYghd\nShakHQ Flashback to a week ago when Shak premiered the new Nada video (https://t.co/gXXTCQy7YB) on the big screens at the final night of #ElDoradoWorldTour in Bogotá! ShakHQ https://t.co/e0DWzASxTN Hoy hace una semana! Recordamos el estreno del video de Nada (https://t.co/gXXTCQy7YB) en las pantallas gigantes de #ElDoradoWorldTour en Bogotá! ShakHQ https://t.co/ey6DcOLiuJ RT @SonyMusicLatin: ¡Nuevo! @shakira estrena su video #Nada. ¡Dale play aquí 👉🏼 https://t.co/oWBygXChgO! #ElDorado https://t.co/ivSQXlUcEg RT @theirworld: \"A school opens and the world changes\" @shakira 🙌 👏 💯 😍  https://t.co/g0Na6KFCfj RT @RakutenArena: Lights 💡\nCamera 🎥\n@shakira 💃\n\nThrowback to the #ElDoradoWorldTour show in Miami 🌟 https://t.co/OsbP80k8L5 RT @SomosVevo: .@shakira's \"Nada\" nos recuerda a sus videos de antes. 😍 ¿Ya lo viste?  \n\n▶️ https://t.co/YSUEUVg9tx https://t.co/mBZoCrGOo4 Con mis amigas Maisa Henao y @XilenaAycardi! Shak https://t.co/kI4e9qVbTf RT @billboardlatin: We're obsessed with @Shakira's new music video! ❤️ Watch #Nada here https://t.co/Kxy6Krnyyb https://t.co/OvsEzHCtAs It’s not too late to use your voice-here are the states where you can still register to vote and make a difference! Aún queda tiempo para alzar la voz-en estos estados aún se puede registrar a votar y hacer una diferencia! Shak https://t.co/5pBIY9cJXJ RT @Cabify_Chile: ¡Increíble! Así definieron nuestras fans lo vivido ayer en #ElDoradoWorldTour de Shakira, ¿ Cuántas  quedaron sin voz de… Estas elecciones serán  decisivas para que se respeten los derechos  de minoridades en los Estados Unidos como la nuestra. Mañana hay que entrar en acción, tomar control de la situación y salir a votar! Shak Los latinos somos la población que más rápido crece en Estados Unidos. Ahora más  que nunca necesitamos hacer que nos escuchen. The US midterm elections will be a deciding factor in protecting the rights of minorities like ours in the US. Especially with the current divisive climate. Get out and vote tomorrow!!! Shak Latinos are the fastest growing population in the US and now more than ever we need to take action and have our voices heard. https://t.co/BXXukbSzi5 RT @SonyMusicLatin: ❤ \"Extraño tu voz, estoy en tierra de nadie, me falta hasta el aire...\". Así canta @shakira en #Nada, su nuevo sencillo… RT @VEVO_ESP: .@shakira estrena el videoclip de su nuevo single #Nada ¡Descúbrelo aquí!\n▶︎https://t.co/EDy1V80cPI https://t.co/GAU1fq0BLA Celebrating with my band at @carlosvives’s place in Bogotá! Shak https://t.co/MGf1ULRpzI We’ve reached the end of this road. Your friendship and affection are my treasure. After searching and searching thanks to you I’ve found El Dorado. Shak Bogotá, gracias por darme uno de los conciertos más bonitos de mi vida!\nShak https://t.co/ltAqcp031o https://t.co/ctJ1fh9tvM https://t.co/5myfDzmPvb https://t.co/SQzvkkof7Z https://t.co/V6VjB6uQjZ https://t.co/ZPLamTrrdj https://t.co/qxKT2ERIOs https://t.co/joiK9T4y8f Hemos llegado al final de esta ruta. \nSu amistad y cariño son mi tesoro.\nDespués de buscar y buscar, por ustedes encontré El Dorado\nShak https://t.co/ORB6p8RftN Did you watch Shak’s brand new video for Nada yet? Ya vieron el nuevo video de Shak, Nada? ShakHQ \n📺👀 https://t.co/gXXTCQy7YB https://t.co/YmseMsJ24S Último show de la gira de El Dorado. Gracias a mis fans por darme la mejor gira de mi carrera! Los quiero muchísimo! Shak https://t.co/foZCOJQGef ~ Following its showing on the big screens at the #ShakiraBogota show just now, here’s Shak's new Nada video! \n~ Después del estreno en las pantallas gigantes de #ElDoradoWorldTour en Bogotá, aquí tienen el nuevo video de Nada! ShakHQ\nhttps://t.co/gXXTCQy7YB Aquí están los horarios para el show de #ShakiraBogota de hoy! No se olviden que estrenamos el nuevo vídeo de NADA en las pantallas gigantes! ShakHQ https://t.co/MYKb0wB3D6 Gracias por esta bienvenida tan linda en el barrio de El Bosque de Barranquilla donde estamos construyendo una nueva escuela para 1,200 estudiantes y con educación temprana. Gracias a nuestros aliados: @FundacioFCB, @FundlaCaixa, @Mineduc, @alcaldiabquilla, LCI. Shak https://t.co/Ur3zyZzHjt 15,000 niños en el barrio de El Bosque en Barranquilla y solamente dos escuelas. Tenemos que hacer más. Millones de niños en Colombia siguen aún sin acceso a educación de calidad. Shak https://t.co/pFhfTpEx0p La Guajira y el Chocó, en el abandono. Miles de niños sin acceso a agua potable, energía eléctrica y educación de calidad. Debemos actuar ya. Nuestros niños y sus necesidades básicas deben ser nuestra prioridad y la prioridad de los gobiernos. Shak \"La educación es lo que nos iguala a todos. Hay millones de niños sin educación en nuestro país\" Shak https://t.co/A6yltd9Qky \"Se abre una escuela y cambia un mundo\". Shak https://t.co/Wh2tZIJ7Qk RT @FundacioFCB: ＠shakira: \"Building a school is a way to change the world\"🌎. We are giving the chance they deserve to the children of El B… Muchas gracias a todos los aliados en estos dos proyectos empezando por el @Mineducacion, @alcaldiabquilla, @AlcaldiaCTG, @FundacioFCB, @FundlaCaixa, @costacruceros, la Fundación Mario Santo Domingo, la LCI Education Foundation y la Embajada Suiza en Colombia con ETH Zürich. Serán 2.160 niños los se que se atenderán, sobre unos terrenos que suman 20.500m² de oportunidades educativas para cimentar el camino de la paz. (2/3) https://t.co/Q4tQnc553B Ayer Shakira presentó los dos nuevos proyectos de la @fpiesdescalzos: la construcción de dos escuelas, una en Villas de Aranjuéz - Cartagena y otra en Nuevo Bosque - Barranquilla (1/3) https://t.co/RrxU943BCC RT @FundlaCaixa: La #innovación y la #creatividad en el centro de la educación: los alumnos de la Institución Educativa Nuevo Bosque aprend… ESTRENO DEL VIDEOCLIP DE NADA! Antes del cierre del #ElDoradoWorldTour en el Parque Simón Bolívar de Bogotá, Shakira estrenará el videoclip de Nada para sus fans colombianos en las pantallas grandes del concierto, e inmediatamente después lo podrá ver todo el mundo online! ShakHQ https://t.co/5ZLKQSge3f NADA VIDEO PREMIERE! Before tonight's final show of the #ElDoradoWorldTour in Bogotá’s Parque Simon Bolivar, Shak will premiere the new Nada video to her Colombian fans on the big screens at the concert! And then everyone else will be able to watch the video online! 🇨🇴📺👀 ShakHQ https://t.co/h6i6uEqs1k RT @costacruceros: Ayer, en Colombia, hemos colocado el primer ladrillo de la escuela que construiremos para los niños de Cartagena junto c… RT @FundlaCaixa: Gracias @shakira por trabajar con @FundlaCaixa para construir un futuro para miles de niños y niñas a través de la educaci… RT @FundlaCaixa: Estamos muy contentos por haber participado en la inauguración del proyecto Institución Educativa Nuevo Bosque en Barranqu… RT @FundlaCaixa: Comenzamos la creación de la Institución Educativa Nuevo Bosque en Barranquilla (Colombia) de la mano de @fpiesdescalzos @… RT @FundacioFCB: @shakira: \"Los niños necesitan acceso a la educación y a las nuevas tecnologías para generar las ideas que necesita el mun… RT @FundacioFCB: ¡Increíble trabajo el estamos  llevando a cabo conjuntamente en Colombia! Seguimos juntos para hacer llegar la educación a… RT @fpiesdescalzos: Cientos de gracias a @FundlaCaixa @FundacioFCB @alcaldiabquilla @LaSalleCollege ¡Con su apoyo comienza hoy un segundo s… RT @FundacioFCB: Waiting for @shakira like 💫 @fpiesdescalzos @FundlaCaixa #EscuelasPorElFuturo\n\nListos para recibir a Shakira😍😍 https://t.c… RT @fpiesdescalzos: Es la suma de un esfuerzo conjunto el que hace posible hoy iniciar un camino de nuevas oportunidades @FMSDColombia @cos… RT @fpiesdescalzos: Este sueño inicia con el ladrillo de la felicidad que viene desde Italia para traer educación de calidad a los niños de… RT @fpiesdescalzos: Emocionados y listos esperando a nuestra fundadora @shakira para la presentación del nuevo colegio en Villas de Aranjué… Coffee kicked in!\nEl cafecito hizo efecto! Shak https://t.co/5CSGkaw9xO Una rana cantando me despertó a las 7:30 am, menos mal llevo café!!  A frog woke me up singing at 7:30 am, good thing I have coffee! Shak https://t.co/KQZcU44z73 Una rana cantando me despertó a las 7:30 am, menos mal llevo café!!  A frog woke me up singing at 7:30 am, good thing I have coffee! Shak https://t.co/Q5mBreZuPR Today as we break ground on two new school projects in Colombia, we’re reminded of all kids facing an uphill battle to get to school every day. Thanks to Sur Le Chemin De L’école for helping us spread awareness about the importance of access to quality education with this piece. https://t.co/xbsS5owAUZ Muchas gracias por mis corazones amarillos! Shak https://t.co/E30fME88ll https://t.co/njIqKSSHva https://t.co/7gZU7pUgfp https://t.co/BciZPl8il5 Ecuador! No saben lo que he disfrutado esta noche! Público IMPRESIONANTE! PUBLICAZO! Shak https://t.co/iyDV0uKSK5 Gracias Ecuador!!! #ShakiraGuayaquil. ShakHQ https://t.co/Xt5lgOpbDs ... Y vuelve!!!!! 🎆🎇🎆 #ShakiraGuayaquil. ShakHQ https://t.co/mbpF6MQVCN Ecuador, impresionante!!!! No saben como he disfrutado esta noche! Shak https://t.co/lsYtn3KP1o ... y conversamos con @Mit_C_Hell_! #ShakiraGuayaquil. ShakHQ https://t.co/kcpBIl1c5o Sorprendimos a los miembros de la banda de Shak @caitlinbird, @sterlinblu y Joe en su camerino minutos antes de salir al escenario de #ShakiraGuayaquil! ShakHQ https://t.co/wwaf1Hn546 Faltan dos horas para que empiece el penúltimo show de #ElDoradoWorldTour en Ecuador. #ShakiraGuayaquil. ShakHQ https://t.co/nLDQ6qWLS0 RT @FundacioFCB: Sigue mañana a partir de las 22.00 en directo con el hastag #EscuelasPorElFuturo el inicio del proyecto de la Escuela Nuev… Acabo de llegar a mi camerino aquí en Guayaquil y ... Shak https://t.co/hKi89KxJiH A diez minutos de la apertura de las puertas.... Este es el ambiente fuera del estadio de #ShakiraGuayaquil. ShakHQ https://t.co/gzbkQVuVOn RT @FundlaCaixa: Sigue mañana en directo con el hashtag #EscuelasPorElFuturo, el inicio del proyecto de la Institución Nuevo Bosque con @sh… Hola Ecuador! #ElDoradoWorldTour llega hoy al penúltimo país de esta gira! Aquí están los horarios para el show de hoy en #ShakiraGuayaquil. ShakHQ https://t.co/vc6716Ax70 We’ve reached our penultimate country for our penultimate show! Ecuador, we can’t wait to see you later. Here are the #ShakiraGuayaquil times. ShakHQ https://t.co/M5F9Rfhuyg 🕷🍸👻 https://t.co/fvhZICtZr5 🎃 https://t.co/axAjt3b9iH Gatita-conejo y unicornio! Shak https://t.co/04MVEjtD2X Mini, el unicornio y el y la gatita-conejo! Shak https://t.co/9WZ0J2x0TS Momentos en \"Tú\"! Impresionante oír a todo a un estadio cantando el coro de \"Tú\" conmigo! Shak https://t.co/gnxcMAjZgN https://t.co/CocT87xdiF Gracias Chile!!! 50.000 almas cantando y bailando esta noche conmigo!!! Shak https://t.co/lKGhxr0WcQ “Creí que estaba soñando woo woo!!!” Shak https://t.co/LkzMObxigb Clandestino ❤️ #ShakiraSantiago. ShakHQ https://t.co/SyjfXxdROg Gracias Santiago! #ShakiraSantiago. ShakHQ https://t.co/fnbhP8eX2o La Bicicleta ❤️ #ShakiraSantiago. ShakHQ https://t.co/PMuy9sGVBY Me Enamoré! @3gerardpique #ShakiraSantiago. ShakHQ ❤️ @ShakiraChile https://t.co/iIxMVS9fSD ¿Dónde estás corazón? #ShakiraSantiago. ShakHQ https://t.co/sFssZDhkq0 RT @UnicefChile: 🙌🏻 ¡Estamos contigo @shakira!\n\nTe deseamos lo mejor para tu concierto de esta noche y  agradecemos tu compromiso con la in… Así luce el escenario de #ElDoradoWorldTour en el Estadio Nacional! ShakHQ #ShakiraSantiago https://t.co/JvNnvD3SLT .@UnicefChile también está aquí! #ShakiraSantiago ShakHQ https://t.co/2PVpzQZXmN Hola Chile! Estamos muy felices de estar aquí nuevamente! Aquí están los horarios del show de hoy! Hello Chile! It’s so good to be here. These are the set times for tonight’s #ShakiraSantiago show. ShakHQ https://t.co/OelaKpa0Df Oh qué lindo! La entrada al estadio aquí en Santiago de Chile! Shak https://t.co/u9P3i4Xv9B Sending love to my friend Yeinely Duran Rosado, whose new exhibition opens at the Colombian consulate in Miami today. It brings awareness to the needs of the mothers &amp; children of the Wayuu, an indigenous population that's been forgotten. If you're in the area, do go along. Shak https://t.co/bVB58IW1nB \"El camino a los sueños no es un camino de rosas\". No se pierdan el segundo episodio de nuestra serie exclusiva de #ShakiraDream que celebra el lanzamiento de su nueva fragancia. https://t.co/BoFGukJvLn \nShakHQ https://t.co/tvNtAsE7Rp \"The path to pursue your dreams is not always a walk in the park.\" Watch the second part of our exclusive #ShakiraDream video series, celebrating the release of Shak's new fragrance. \nhttps://t.co/BoFGukJvLn\nShakHQ https://t.co/NwoaxcKlKm Gracias por tanto Argentina!! Shak https://t.co/FMwGJS2W3s Gracias Rosario! Ha sido espectacular! Shak https://t.co/Q8ot0R3R3X Hoy en #ShakiraRosario también podrán encontrar el stand de #ShakiraDream, la nueva fragancia de Shakira! https://t.co/l9qd2mHRUg ShakHQ https://t.co/vxUq2WGIFe Preparados! #ShakiraRosario. ShakHQ https://t.co/kbBWYMkmPC Buenos días Argentina! Aquí están los horarios para el show de hoy en Rosario. Últimos boletos disponibles aquí https://t.co/mDXmLbLg8Y.  Good morning Argentina! Here are the set times for tonight's #ShakiraRosario show. Final tickets available at https://t.co/mDXmLbLg8Y. ShakHQ https://t.co/OTxlfvLgYV https://t.co/35XmKebKzK Argentina! Qué lindo volver a tenerles tan cerca!!!! Shak https://t.co/CYBiE8tvz1 https://t.co/PvdLcqC27i Rosario! Nos vemos en 24 horas! Para hacer más corta la espera les compartimos imágenes del show de anoche en Buenos Aires! ShakHQ https://t.co/UzfY2NUBtk Gracias Buenos Aires! Los quiero!!! Shak https://t.co/EYLhW49QnP https://t.co/P50E4g9E88 https://t.co/4HWRdKXA61 Si hoy vienen al show de #ShakiraBuenosAires les invitamos a visitar el stand de los perfumes de Shakira donde también podrán customizar su foto de #ShakiraDream! ShakHQ https://t.co/8Rbh1Lqr2D Preparados! Ready! ShakHQ #ShakiraBuenosAires. https://t.co/fAu6F39vc3 Hola Argentina! Aquí están los horarios para el show de esta noche! ShakHQ #ShakiraBuenosAires. https://t.co/PQRVxZTuFo RT @educommission: Commissioner @Shakira is in #Argentina, which is also host of this year's @G20org. Last year, @MauricioMacri &amp; #G20 lead… RT @RakutenArena: All 👀 were on @shakira during her amazing #ElDoradoWorldTour performance in Las Vegas 🙌 @MGMGrand https://t.co/2p3uJB7Nvp Gracias por los globos blancos en Porto Alegre, Brasil. Gracias por todas las sorpresas que siempre me dan! Shak https://t.co/1N3KV2GYQ7 Feliz de estar en Argentina! Gracias a mis fans por esperarme en el aeropuerto a las 2.30 de la mañana ❤️ Gracias por esta bienvenida tan cálida que me llega al corazón. Shak https://t.co/hqMKzsu4hG https://t.co/dGlSNCV0CH https://t.co/0WIWEnCcdi https://t.co/ntbtVgatxN https://t.co/rDSQihQSYs Gracias Porto Alegre! Uno de los mejores públicos de esta gira! Los quiero mucho! Shak. https://t.co/9jeZUURGkj https://t.co/X43JAA9nSJ #Catdealers. -1h! #ShakiraPortoAlegre. ShakHQ https://t.co/keULBnxk85 One of Milan’s favorite songs! Una de las canciones favoritas de Milan! Shak https://t.co/4gfBuIjbdt #ShakiraPortoAlegre -2h 💥 ShakHQ https://t.co/S9XKexEDaZ Presentes dos meus fãs! \nOlha que lindo!!! Shak https://t.co/BALRKBulpz 3 canciones en una foto! 3 songs in one picture: Estoy Aquí. Amarillo y Perro Fiel ❤️ #ShakiraPortoAlegre. ShakHQ https://t.co/Fa1p1Z1mRc El Dorado! #ShakiraPortoAlegre. ShakHQ https://t.co/m6tQZCDOKG https://t.co/A41C9aBuU8 #ShakiraDream en Porto Alegre! ShakHQ #ShakiraPortoAlegre https://t.co/AEXFHD7sns https://t.co/GcR4L6YKQf 💚 #ShakiraPortoAlegre. ShakHQ https://t.co/BCwPMuamB9 Hola! Aquí están los horarios para el show de esta noche en Porto Alegre! Here are the times for tonight’s Sold Out #ShakiraPortoAlegre show at @todosnaarena! ShakHQ https://t.co/o0PeERbwRQ São Paulo entero cantando en español! Shak https://t.co/gH2gz88npa https://t.co/hMTyTyQ3LH https://t.co/oXqB6voJJF Brasil, Eu te amo! \nObrigado! \nShak https://t.co/vVmPm2ydLV Brasil, eu gosto muito de vocês! Shak https://t.co/MGvxueIwfG São Paulo, incrível!!! ❤️❤️❤️ Shak https://t.co/GIPfdH3AbE Eu amo as cores do Brasil! Shak https://t.co/G1HPrAMb9H -75 min. #ShakiraSãoPaulo. ShakHQ https://t.co/jKkgtuH0Jq #CatDealers 💙 #ShakiraSãoPaulo. ShakHQ https://t.co/hhyNJ2OUZz #ShakiraDream también está aquí! #ShakiraDream is also here! ShakHQ #ShakiraSãoPaulo https://t.co/AEXFHD7sns https://t.co/N70RqGq0zL 💛 T'estimo! 💛 ShakHQ #ShakiraSãoPaulo https://t.co/Zt6sZs4Wqy https://t.co/g7BJVNz8Wu Vista do palco! The view from stage! Desde el escenario! ShakHQ #ShakiraSãoPaulo https://t.co/LWld4BTIsv ❤️ #ShakiraSãoPaulo ShakHQ https://t.co/Q1V9lThtNx RT @AllianzParque: “Tsamina mina, ê ê! Waka waka, ê ê!”\nHoje é dia de mexer o esqueleto e dançar no ritmo com a rainha colombiana @Shakira.… The #ElDoradoWorldTour has reached Brazil! We’re so excited about tonight’s @allianzparque show. Here are the #ShakiraSãoPaulo times! #ElDoradoWorldTour ya está en Brasil! Aquí están los horarios para el show de esta noche! ShakHQ https://t.co/zV2Y2hP7Qb RT @Shakira_Brasil: Esse flashmob foi um esquenta do que vamos aprontar hoje a noite dentro do @AllianzParque!\n\n@Shakira estamos prontos!… Brasil estou muito feliz de estar com vocês de novo! Estava com muitas saudades! Shak https://t.co/N4G9nHw6MD Tenemos otro reto para ustedes para celebrar el lanzamiento de la nueva fragancia de Shakira, Dream! Sabrían adivinar qué canción representan estos emojis? Descubran más sobre #ShakiraDream aquí https://t.co/AEXFHD7sns ShakHQ https://t.co/373zrjqpo3 Time for another emoji challenge to celebrate the launch of Shak’s new fragrance, Dream! Who can name the song? Post your answer below. And find out more about #ShakiraDream at https://t.co/AEXFHD7sns\nShakHQ https://t.co/LvsKUCJ7tR https://t.co/vF5qXBvDGy https://t.co/Q9cy0D1ID2 Un concierto con brisa del Caribe! Gracias mi gente dominicana! Shak https://t.co/t3qyUP3inN 4 shows sold-out en México. Gracias Ciudad de México, Guadalajara y Monterrey por hacerme sentir en casa una vez más ❤️ Shak https://t.co/8XuTPF6M7h Gracias Juan Luis! Me encanta estar en tu tierra! Shak https://t.co/x3wT2TAQWi Hola Punta Cana! 🇩🇴 Aquí les dejamos con los horarios para el show de Shakira de esta noche! ShakHQ #ShakiraPuntaCana https://t.co/M6QA271G4s Son increíbles! Cómo se les ocurrió hacerme esta sorpresa, miles de globos y lucecitas amarillas hechas con papel celofán! Shak https://t.co/Gx04oqjPHw Few final tickets at / últimos boletos disponibles en  https://t.co/TLqDPITu1z. ShakHQ #ElDoradoWorldTour llega mañana a la República Dominicana y estamos muy emocionados! Además la previsión del tiempo dice ☀! It’s so good to be back in the 🇩🇴 and we’re super excited about tomorrow night’s #ShakiraPuntaCana show! The weather forecast says ☀ too! ShakHQ https://t.co/XCf19zc3YD Me desperté esta mañana pensando que me esperaba un día soleado en la República Dominicana!!!! Es “El Dorado World Tour” o “El Mojado World Tour”/ I woke up today thinking sunny DR was awaiting me!! Is this “El Dorado World Tour” or “El Mojado World Tour”? Shak https://t.co/Dn7I8At8oV “Yo lo que quiero es pasarla bien” y es lo que hice hoy en Monterrey!! Shak https://t.co/404HOdwUEP https://t.co/Xtp1Tr9YpB Gracias por esta sorpresa tan linda globos y lucecitas amarillas!!! Los quiero! https://t.co/uL74nBmM8b Impresionante Monterrey! Shak https://t.co/SLeoawxLow Una hora para que empiece el show! #ShakiraMonterrey. ShakHQ https://t.co/e3q3SERCvj Así luce el Estadio Universitario de Monterrey a diez minutos de la apertura de las puertas! ShakHQ #ShakiraMonterrey https://t.co/YX12LZHtko Hola Monterrey! Aquí tienen los horarios para el show de #ShakiraMonterrey de hoy! ShakHQ https://t.co/PFP8ZIoiQb Woman in red! Shak https://t.co/jh4akFUS6o Happy bday hermanito!!! Shak https://t.co/corh4CZtRR Espectacular este afiche! Muchísimas gracias Angel Treviño! Shak https://t.co/gSLtIBxf4H No puedo quitarme esta canción de mi cabeza! I can’t get this song out of my head! Shak https://t.co/Jj5teQUos2 México gracias por hacer mi corazón  sonreír todos estos días! Shak https://t.co/pCqOxS1C0f Besitos Guadalajara! Shak https://t.co/10qaF8VtUR https://t.co/mcdz8310A2 https://t.co/P4cHvezf9p Estoy muy feliz de estar de gira en América Latina! Con todos los elementos que hemos añadido creo que es el mejor show de mi carrera! So happy to be touring Latin America! We have so many new elements that are making this show the best one of my career!  Shak https://t.co/LCoKNFHz1o RT @RakutenArena: \"The best concert ever!\" \n\n@shakira treated her fans at The Forum in Inglewood, California to an El Dorado World Tour sho… \"...Y Vuelve!” 🎆❤🎆 ShakHQ #ShakiraGuadalajara https://t.co/6YPB8rvvJv Que público increíble el de esta noche en Guadalajara! Shak https://t.co/XoAHpmTtAK Muchas gracias Guadalajara! ShakHQ  #ShakiraGuadalajara https://t.co/ywhFmbecBq Qué linda sorpresa! 💛#ShakiraGuadalajara. ShakHQ https://t.co/kKW87FDBxb Tu ❤️ #ShakiraGuadalajara. ShakHQ https://t.co/0pcTqkebT1 Las De La Intuición! #ShakiraGuadalajara. ShakHQ https://t.co/TgiPtklJ4L https://t.co/lOlJhJSMHq Las puertas ya están abiertas! #ShakiraGuadalajara. ShakHQ https://t.co/XeXPJ7mxE7 Entrando en el Estadio 3 de Marzo de Guadalajara! Entering the Guadalajara stadium! Shak https://t.co/KrGZyc5nJ6 Miren el regalo que he recibido hoy de uno de mis fans! Shak https://t.co/0e5qg7JyPF Preparados! Así luce el escenario de #ElDoradoWorldTour en Guadalajara, México! ShakHQ #ShakiraGuadalajara https://t.co/1CgOuv0KQd RT @SonyMusicChile: ¡Así fue la presentación de @shakira en México🤩! Queda muy poco para poder cantar y bailar 💃🕺🎶 a todo pulmón este 30 de… Buenos días Guadalajara! Estamos muy felices de estar aquí con todos ustedes! Aquí tienen los horarios del show de esta noche! #ShakiraGuadalajara. ShakHQ https://t.co/xrDUI9Kgaa El Estadio Azteca desde arriba! 2 noches seguidas. 100,00 personas. Qué más puedo pedir! Gracias. LOS AMO! Shak \n📸 Cesar Vicuña https://t.co/CJmMumX5XK Guadalajara ❤️ Shak https://t.co/XIhnOzba7m Ustedes le dan a mi música un propósito, ennoblecen mi labor y llenan mi vida de dulzura y emoción! Shak https://t.co/yMyRQzJcRh Bailando bajo la lluvia otra vez / dancing in the rain again last night! Shak https://t.co/HK5qxaWn9N https://t.co/RI0xtWbx4l https://t.co/vCm27LEuFq México! Gracias por esta segunda noche llena de emoción y magia! Shak https://t.co/fc0aXk3je2 Que lindo verlos salir así de un concierto! ❤ Shak https://t.co/oeTGYuo7vj Ya estoy lista para nuestra segunda noche en el @EstadioAzteca pero aun no me dan la señal y el permiso para salir a cantar debido a las lluvias y las tormentas de hoy. No se vayan que muy pronto voy a estar allí! Shak https://t.co/44cNLX72Br Así luce el escenario de #ElDoradoWorldTour en el @EstadioAzteca a vista de pájaro! ShakHQ https://t.co/cK7t5wmGWt Las puertas ya están abiertas! #ShakiraCDMX ShakHQ https://t.co/jeuZEJHpGc Repasando coreo...sessy sessy sessy! Shak https://t.co/W7sNrtwkRs The hidden talents of my violinist @caitlinbird! Shak https://t.co/WxaPXHEsiN https://t.co/phScR9foUH Van a asistir al concierto de Shakira en el Estadio Azteca hoy? Si es así busquen el stand de DREAM, la última fragancia de Shak, y podrán obtener una muestra gratis y también participar en un concurso donde podrán ganar fragancias firmadas por Shakira! #ShakiraDreamMX ShakHQ https://t.co/ZF2myHJKdK Estamos aquí... disfrutando de México a tope...! Shak https://t.co/tL5qeHFmTp Un show para el recuerdo anoche en el Estadio Azteca! Y hoy... otra vez! Gracias México por hacerme sentir en casa! Shak https://t.co/VglacTlSan Preparados para el segundo concierto en el @EstadioAzteca? Aquí les compartimos los horarios para el #ShakiraCDMX show de #ElDoradoWorldTour! ShakHQ https://t.co/5p8gxsJO2A Una hora y media haciéndome el pelo para terminar con el look de pato mojado! Half an hour doing my hair to end up with the wet look! Shak https://t.co/7TY8RHNMDx https://t.co/XRYc5Hf1hr 50 mil personas bailando bajo la lluvia. Gracias MÉXICO. LOS ADORO! 50 thousand people dancing in the rain! Thank you MEXICO! LOVE you Shak https://t.co/knNkvMQ4WM México estamos esperando a que pase la tormenta eléctrica! Shak https://t.co/u7yGmTAXsu A menos de dos horas para que empiece el show, así se ve el @EstadioAzteca desde el escenario de #ElDoradoWorldTour. ShakHQ https://t.co/UEErXJBLbp Preparados! Ready! ShakHQ @EstadioAzteca #ShakiraDF https://t.co/eoWDrN44z5 We are finally in Mexico City! Shak https://t.co/vp3opc2SpC Estamos en Ciudad de México... Por fin, después de siete años! Shak https://t.co/CexqCsau43 #ElDoradoWorldTour llega hoy a América Latina y estamos MUY FELICES! Aquí están los horarios para los dos shows en el @EstadioAzteca! #ElDoradoWorldTour has reached Latin America and we are VERY excited. Here are the times for the two #ShakiraDF shows at Estadio Azteca! ShakHQ https://t.co/rOI6Vr68mm RT @EstadioAzteca: ¡La espera se acabó! @shakira está en México y #ElDoradoWorldTour hará vibrar esta noche al @EstadioAzteca 🏟️ https://t.… \"Es una perfeccionista\". Cuando faltan solamente dos días para que #ElDoradoWorldTour visite América Latina, hoy les compartimos esta entrevista con Andros, ingeniero musical de Shakira.\nShakHQ https://t.co/ReRcwVZbln “She’s definitely a perfectionist!” With just two days until #ElDoradoWorldTour reaches Latin America, watch our exclusive interview with Andros, Shak’s tour programmer/engineer. ShakHQ https://t.co/GsZ1kXMYDP Geniale! Shak https://t.co/jRTPMwJKnW Haciendo cupcakes con mis niños / Making cupcakes with my kids. Shak https://t.co/qJHE0UZvxW That was awesome! Estuvo brutal! Shak https://t.co/oKQtjoGw9H Probando el agua 🤙🏼 / Testing the waters 🤙🏼. Shak https://t.co/XQAQwLUUwF \"Está muy involucrada. Sabe perfectamente donde tiene que estar cada foco\". No se pierdan nuestra entrevista en exclusiva con el stage manager de Shak, Shawn.\nShakHQ \n#ElDoradoWorldTour https://t.co/ajMmKZhgxT “She’s very involved. She knows where every light should be pointing.” Check out our exclusive interview with Shak’s stage manager, Shawn. \nShakHQ \n#ElDoradoWorldTour https://t.co/7PiW711tCu More than three years since I last touched the clubs - great to be back out there! 3 años sin jugar al golf! Feliz de volver a hacerlo! ⛳️ Shak https://t.co/nYivKkM5Oj Not leaving till I finish all of these! No voy a dejarlo hasta que termine con estos 🤣⛳ Shak https://t.co/4vjrfY0vI4 Yes, you go @britneyspears! Amazing salsa dancer too! Shak https://t.co/Nzlp7uWYEL RT @codeorg: Aprende sobre el superpoder que solo 1% de las escuelas en América Latina lo enseña. Todos los estudiantes deben tener la opor… Imagine if all children could grow up knowing how to be real global citizens. I’m a United Nations advocate for @theglobalgoals and would love you to watch this film #worldslargestlesson @UNICEFEducation  https://t.co/MJpUhy5P0q. Shak https://t.co/e1uYuahZrz Start ‘em young 🕺🏻 Shak https://t.co/g2VeQQRRpx Waka Waka era la canción que se escondía detrás de los emojis del juego que les compartimos hace unos días que celebra el lanzamiento de la fragancia Dream. Habrán más retos en los próximos días pero hoy queremos compartirles un episodio de la serie de #ShakiraDream.\nShakHQ https://t.co/QN4Vbrk6rD LOTS of you correctly guessed that Waka Waka was the answer to our first emoji challenge to celebrate the launch of Shak's new fragrance, #ShakiraDream 👏🏆We'll have another emoji challenge soon. Until then, check out part one of our exclusive #ShakiraDream video series! ShakHQ https://t.co/aSZ2xvNbFY RT @billboardlatin: .@Shakira &amp; @Maluma's 'Clandestino' Tops Three Latin Airplay Charts https://t.co/FY3wx8byOM https://t.co/fsmYGp8lb9 En dos semanas #ElDoradoWorldTour visitará América Latina con un primer concierto en la Ciudad de México! Para celebrarlo les compartimos esta entrevista con Kevin Antunes, el director musical de Shakira! ShakHQ https://t.co/GpaxbHyuF3 It’s exactly two weeks until the Latin American leg of the #ElDoradoWorldTour begins in Mexico! To celebrate, here’s an exclusive interview with Shak’s incredible music director, @kevinantunes411. ShakHQ https://t.co/lYl6uPTsjq 3 veces número uno en los Estados Unidos! Son increíbles los quiero! #1 times 3 in the US! You guys are incredible, love you! Shak @billboard https://t.co/tX28HUSYgy RT @peopleschoice: Vote for Shakira by retweeting this post: #Shakira #TheLatinArtist #PCAs https://t.co/X8C1MNrMjs Muchas gracias Europa, Canadá y USA por acompañarme en esta increíble ruta de El Dorado! America Latina los veo muy pronto! / Thank you Europe and North America for accompanying me on this incredible journey to El Dorado! Latin America I’ll see you very soon!\nShak https://t.co/vtx6s8Kieb RT @educommission: Leaders at #UNGA: have you heard the call from Commissioner @Shakira &amp; the 1.7M+ citizens asking you to fully fund globa… Para celebrar el lanzamiento de la nueva fragancia de Shakira, Dream, tenemos un reto para ustedes? Pueden adivinar qué canción representan estos emojis? Conozcan más sobre #ShakiraDream aquí https://t.co/ArBIqzIrm8\nShakHQ https://t.co/ewzlGIPjnS To celebrate the launch of Shak’s new fragrance, Dream, we’re setting you some emoji challenges! Can you name the song? Answer below! And find out more about #ShakiraDream at https://t.co/ArBIqzIrm8 ShakHQ https://t.co/qzS8BTYJ0E Happy bday to my dear manager Jaime Levine, an inspiring woman and a great friend! Shak https://t.co/IJMUQbogwi Watch the TV ad for Shak's brand new fragrance, DREAM! And find out more, at https://t.co/HmBBoDhSGc / No se pierdan el nuevo anuncio de televisión de la nueva fragancia de Shak, #ShakiraDream! Para conocer más detalles ingresen en https://t.co/HmBBoDhSGc ShakHQ https://t.co/a2rHUk23nF Check out the new long sleeve tee, exclusively in Shak’s online store\nDescubran la nueva camiseta de manga larga en la tienda online de Shak\n-&gt; https://t.co/MEyPxBLXZG &lt;- ShakHQ https://t.co/8dDbjnHi1p Estamos muy felices de presentarles la nueva fragancia de Shakira, #ShakiraDream! Próximamente les compartiremos el anuncio de televisión! Para más información ingresen en https://t.co/0ORpzGowZV ShakHQ #ShakiraDream https://t.co/377XFrPyRb We're very excited to announce Shak's brand new fragrance, Dream! Look out for the TV ad very soon. Until then, find out more at https://t.co/0ORpzGowZV ShakHQ #ShakiraDream https://t.co/bKD4LOVBOk U.S. folks, you could fly to Argentina to meet Shak on tour next month! Just donate to @UNICEFUSA and @fpiesdescalzos to enter! \n-&gt; https://t.co/Z2oEVtVkUz &lt;- \nShakHQ https://t.co/Q4srcdAeVh Muchas gracias a todos los que participaron en en el proceso de creación de la nueva fragancia de Shakira! Más de 1.2 Millones de personas eligieron el color / nombre / estampado de MOONLIGHT, una nueva fragancia que será lanzada en Marzo de 2019!  ShakHQ https://t.co/yt7alf0tXr A huge THANKS to the 1.2+ million of you who voted to decide the look / name / packaging of Shak's MOONLIGHT fragrance. Here's an exclusive look at our finished product, which is due in March 2019! \nShakHQ https://t.co/7Cza68JZR5 Last night was date night! Shak https://t.co/IhykdVLdWa We sat down backstage with Shak in Dallas to ask her your questions for an exclusive @Viber interview! Watch the full video at https://t.co/tWeBV0aZPq . ShakHQ https://t.co/F1iuuVOPWh Thanks @RakutenArena for being part of the #ElDoradoWorldTour Shak #rakutenoptimism2018 https://t.co/ZLfVvE6lBJ Qué ganas tengo de ver esto!! Ya lo estaba esperando @AlejandroSanz! Shak https://t.co/Al1iov3eh2 Yeah girl, work it! Shak #ElDoradoWorldTour https://t.co/Ia5UBF5xHW Joe is feeling it! Shak https://t.co/Ixj5cB0KZF Go triceps! Shak https://t.co/QxPBQuiF1Q It was also a good hair day! Shak https://t.co/nrokSHAjAD Shak ha sido nominada en la categoría #TheLatinArtist en los @peopleschoice de E! Para votar -&gt;  https://t.co/MoVYonYY75 ShakHQ Shak has been nominated for #TheLatinArtist of 2018 at the E! @peopleschoice Awards! Voting is open now, at https://t.co/MoVYonYY75 ShakHQ It was so nice to have have my parents and kids in the front row last night! Shak https://t.co/Pe3a8PR1RJ You made me close my eyes and dream about new dreams! Shak https://t.co/hM2rLFOHDa Gracias por cantar conmigo y celebrar! Shak https://t.co/I8XrXZN9Di Feliz cumpleaños papá! Happy Birthday papito! Shak https://t.co/9hPbAQaIza Puro, Puro Chantaje. #ShakiraSanJose. ShakHQ https://t.co/Dh70loqGc8 Y vuelve! #ShakiraSanJose. ShakHQ https://t.co/Obxm841UfS Let’s go! Vamos! #ShakiraSanJose. ShakHQ https://t.co/C5RBKtuodO Thank you! Gracias! @RakutenArena 💛#ShakiraSanJose. ShakHQ https://t.co/bAF8qOJ0CU .@salva 💙 #ShakiraSanJose. ShakHQ https://t.co/oyyupkFpik Last show of the North American leg! So many great moments to remember! Hoy el último show de la gira en América del Norte! Muchos momentos para recordar! #ElDoradoWorldTour ShakHQ https://t.co/PAtsUuMp7M We've reached the final date of the North American leg of the El Dorado World Tour! What a ride it's been! Here are the times for tonight's Sold Out #ShakiraSanJose show at @SAPCenter. ShakHQ https://t.co/J9JmyZp4Kb Trying out a new dress for you, San Diego! Shak https://t.co/pwlcRWdZ4i San Diego’s ray of light! Shak https://t.co/OHap53YEEP US folks! You can still donate to @UNICEFUSA and @fpiesdescalzos to enter for a chance to meet Shak on tour in South America! ShakHQ https://t.co/jSEq6JRYCQ RT @RakutenArena: There is still time to win a signed @Shakira shirt…\n\nBut time is running out ⏳ Take our Rakuten Super Fan quiz NOW!\n\n➡️ h… Here are the times for tonight's #ShakiraSanDiego show at @vvcasinocenter! Very limited final tickets at https://t.co/YhaDQGCjoT ShakHQ https://t.co/Qb7gUNBqaS https://t.co/nAA3cyoGWY https://t.co/L3dsVgKlDu LA, you were amazing last night! Here are some more photos from a memorable show! / LA, fueron realmente increíbles anoche! Aquí les compartimos algunas fotos de un show para el recuerdo! ShakHQ https://t.co/lrwetYXMKe Love this one! (Just trying to figure out which song it was from…) Shak https://t.co/oPqHZHPm4C https://t.co/MIs6Yfa7Ia https://t.co/EuvnYPNQLn Thank you Los Angeles for waiting for me, for bringing so much energy tonight and for giving me such a special night to remember! / Muchas Gracias Los Angeles por esperarme, por venir esta noche y darme una noche para nunca olvidar. Shak https://t.co/CGmKrxrdXn Here we go! Vamos! #ShakiraLA. ShakHQ https://t.co/VuqBffGCzl Tonight’s show will be recorded for a concert film - so if you’re coming, dress to impress! ShakHQ Good morning Los Angeles! Here are the times for tonight’s rescheduled #ShakiraLA show at @TheForum. Original tickets still valid, very limited final seats available at https://t.co/B1AsLhKWfm. ShakHQ https://t.co/LvRInL1u9R Muchas gracias Vegas!!!! Casi vamos por más de la mitad de la gira. Lleno total en todos los sitios.\nGracias a todos por esta experiencia espectacular!\nShak https://t.co/eDGaDyo7Xn Thank you Vegas!!! We’re more than halfway through the tour and the shows have sold out all over! I’m so thankful to all of you for this spectacular experience! \nShak https://t.co/sqEKBrURo0 Waka Waka #ShakiraVegas. ShakHQ https://t.co/ndUc8XJ9lz Whenever, Wherever. #ShakiraVegas. ShakHQ https://t.co/sR2LJnHfIc Si Te Vas. #ShakiraVegas. ShakHQ https://t.co/evhIU5wIXs #ShakiraVegas is about to start! ShakHQ https://t.co/GrUBwKPr8r I’ve always wanted to drive a truck! Shak https://t.co/AFXplvXztx Gold confetti blast! Shak https://t.co/loR3w86YIg Purple rain last night in Anaheim! Shak https://t.co/oF6bWxjucK Seconds before breaking the chains last night! Shak https://t.co/wEEC3cxfmZ Hello Las Vegas! Here are the times for tonight's #ShakiraVegas show at @MGMGrand. ShakHQ https://t.co/AFux4SNj8z The stage “on fire” last night in Anaheim. Shak https://t.co/xC3lKDKYUs Levitating again!! Shak https://t.co/OoPuvaCTNh Thank you Anaheim! Next stops: Las Vegas, Los Angeles, San Diego and San José! Can’t wait to see you guys!! Shak https://t.co/3BqppsnWHK Anaheim what an incredible crowd! Shak https://t.co/0zSaZ7s1FV 👽📽🎶#ShakiraAnaheim. ShakHQ https://t.co/A2BAMEm685 En Barranquilla se baila así! #ShakiraAnaheim. ShakHQ https://t.co/H4l4XasWrE Tu ❤️ #ShakiraAnaheim ShakHQ https://t.co/952P8GZanz 🎶Mira Qué Ojitos Bonitos! 🎶 #ShakiraAnaheim. ShakHQ https://t.co/vqV4p0KMo5 #ShakiraAnaheim is about to start! El show está a punto de empezar! ShakHQ https://t.co/JLJu88b7Eo Hanging out with the band before the show! Con la banda antes del show en Anaheim! Shak https://t.co/AWNJWhfvPb https://t.co/HvVLKof8De RT @fpiesdescalzos: Conoce nuestro boletín mensual 👉 https://t.co/Mfs9cmfJ4c https://t.co/iYy496a9Tg Hello California! Here are the set times for tonight’s #ShakiraAnaheim show at @HondaCenter. Limited final tickets at https://t.co/W5Vm0vVtLB. ShakHQ https://t.co/CKQxwTLTDL https://t.co/ZXJk10Q2v3 https://t.co/96gXHvbXYh https://t.co/Lssm7pKNZB RT @shakira: The #ElDoradoWorldTour has arrived in Los Angeles for two nights at @TheForum! Here are the #ShakiraLA times. Limited tickets… Hoy cartelitos de “T’estimo” en Los Angeles! Súper emocionante! Shak https://t.co/2Ltt5qSg52 Los Angeles, an amazing first night with lots of surprises!!!! Shak https://t.co/9BHwP4GGlD Whenever, Wherever #ShakiraLA ShakHQ https://t.co/b0Xwcnhl2k Here we go! Empezamos! #ShakiraLA ShakHQ https://t.co/l4UpNztLMx RT @RakutenArena: \"Spectacularly perfect and natural, she is the best!\"\n\nIt was another stunning performance by @shakira in Madrid 🙌 #ElDor… RT @AlejandroSanz: Tal día como hoy, fue un orgullo cantar junto a @shakira en la gala de los #VMA´s de #MTV #LaTortura\n//\nOn a day like th… The Clandestino video with @Maluma just became Shak's 26th video to pass 100 million views, in just 32 days! Clandestino con @maluma es el video número 26 de Shak en superar las 100 millones de reproducciones en tan solo 32 días! ShakHQ https://t.co/sJtCSQ0xnI The #ElDoradoWorldTour has arrived in Los Angeles for two nights at @TheForum! Here are the #ShakiraLA times. Limited tickets for both nights available at https://t.co/B1AsLi2x6U ShakHQ https://t.co/KReoTNCbJo El Dorado World Tour llega a Los Angeles por dos noches al @TheForum! Aquí están los horarios para #ShakiraLA. Últimos boletos disponibles aquí https://t.co/B1AsLi2x6U ShakHQ https://t.co/KSxNQ7UHye RT @LiveNation: You don't want to miss @shakira's El Dorado World Tour. \n\nGet tickets here today -&gt; https://t.co/9FqS3rsSNA https://t.co/u4… Vote for your favorite outfit! Su look favorito es...? https://t.co/Md9lfAam1A Guys, I need your help... / Me ayudan??? Shak https://t.co/dD0SeztzgL Phoenix, imppppppppresionante! Shak https://t.co/Y9b6jwVLwU Wow, Waka Waka just became Shak’s second video (the first being Chantaje) to pass TWO BILLION views! Incredible. Increíble! Waka Waka es el segundo video de Shak (el primero fue Chantaje) en llegar a las 2 MIL MILLONES de reproducciones! ShakHQ https://t.co/cAYuaRcEvi Good morning Arizona! Here are the times for tonight’s #ShakiraPhoenix show at @TSRarena! Very limited final tickets available at https://t.co/q5gXsvAZ9t ShakHQ https://t.co/pDLQ4oV0Ka Wow!!! My fourth world record! What an incredible honor!! Shak https://t.co/RywfDY3aAg Divina!!!! Shak https://t.co/MmvXBMxfRO Thanks San Antonio for an amazing night! Shak https://t.co/j99P7WuqPF Second day at @NASA. Only a son could touch the moon for a mother! Shak https://t.co/c3xjUDj3kT US fans, starting TODAY, when you donate to @UNICEFUSA and @fpiesdescalzos, you can support children’s education programs AND enter for a chance to meet Shak on tour in South America! ShakHQ\nhttps://t.co/RKWneCLVXN In a @NASA Space Shuttle simulator at the Space Center in Houston! Shak https://t.co/Aejz3npWOU Here are the set times for tonight’s Sold Out #ShakiraSanAntonio show at @attcenter! ShakHQ https://t.co/camDDJdTMx Qué belleza!!!!!! Shak https://t.co/X3KPtA3FWC Houston you were superb tonight! Shak https://t.co/wsq4RX4uUo I insist. “No one said it would be easy”. Shak https://t.co/ASzcya8HNq Hola #ShakiraHouston! ShakHQ https://t.co/rSsNnu1pND RT @fpiesdescalzos: We want a Country in which everybody count #Education @shakira https://t.co/dyJlRdvsCE RT @attcenter: In just 2 DAYS @shakira brings her El Dorado tour to the AT&amp;T Center! \n\nGet your tickets now: https://t.co/mXyi0zngKl https:… After a great night in Dallas, the Texan #ElDoradoWorldTour shows continue tonight at @ToyotaCenter! Here are the #ShakiraHouston set times. Final few tickets at https://t.co/uTAj8v0dcj now! ShakHQ https://t.co/26WYwvsBnF RT @UNICEFUSA: Every child deserves an education. \n\nHelp @UNICEF and @fpiesdescalzos empower children with a better future, you could win a… Qué lindo Dallas!!!! No se sentaron ni un minuto!!! Shak https://t.co/bjH95upwdm Are you ready? Están preparados? #ShakiraDallas. ShakHQ https://t.co/QTnHwaNBOY Party before the party with Clandestino! Shak https://t.co/ZBFccYC3hM RT @AACenter: .@shakira and the #ElDoradoWorldTour have arrived in Dallas!! https://t.co/VnkKxjBtLZ Gracias México! Qué ganas de verlos en Octubre! Shak https://t.co/1tQysmUJoN Hello Texas! Here are the timings for tonight's #ShakiraDallas show. Very limited final tickets at https://t.co/qJgS0cHIaf now. ShakHQ https://t.co/YGo1FYGY9i Check out our exclusive behind-the-scenes film from Shak's Clandestino video shoot with @MALUMA! / Así se hizo el video de Clandestino con Maluma! No se pierdan nuestro video exclusivo! \nShakHQ https://t.co/h9xWz0ef9h After the success of our first exclusive @Viber fan Q&amp;A in Spain, Shak is doing another one in the US! Submit your questions at https://t.co/feSr1yOFXh - and you could meet Shak at a show! ShakHQ https://t.co/UZWUwFmtdG https://t.co/ftlHOP52UB https://t.co/LH6598wjhu Miami, que energía  espectacular!!!!! \nDos noches impresionantes!!!!!\nShak https://t.co/GBP3gdugUY Underneath your clothes ❤️ #ShakiraMiami. ShakHQ @AAarena https://t.co/ilfDe2ptR3 RT @SonyMusicLatin: ¡Vota por #Chantaje de @shakira feat. @maluma en los @vmas! 🎊👉 https://t.co/gDvZbzp0XU https://t.co/EnGokUy4QS See you again tonight Miami! Nos vemos esta noche otra vez Miami! Pic by my brother Edward. Shak https://t.co/CMtNGG353X U.S. fans - last chance to enter to meet Shak at her San Diego show.  Click to enter —&gt; https://t.co/f9eSw41BEd ShakHQ https://t.co/YD57Vz9puT Ésto es de lo mejor que he visto!! Qué lindura!!! Shak \n#Repost #abueloarcelio on instagram. \n・・・\nMy 90 year old hips don't lie🕺🏻 #ShakiraMiami https://t.co/XNrXVv8Uds ... y bailar! Shak https://t.co/3bTU6oiDyW Gracias por cantar conmigo... Shak https://t.co/CiRFilEmFF Miami, epic! Miami, apoteósico! Shak https://t.co/QB0lGKNDHC RT @AAarena: ✨TONIGHT✨ https://t.co/jaRfxGEWDc I can’t even shake it like Shakira!! Shak https://t.co/aUYCkjIY5y RT @BRITs: 💃@shakira's 2010 World Cup anthem 'Waka Waka (This Time For Africa)' is now #BRITcertified Platinum! 🇬🇧💿 https://t.co/GNBEIlyBmz Shak answered your questions in our exclusive backstage chat. Watch the full interview now, only on her @Viber profile -&gt; https://t.co/LgURri3cP1\nShakHQ https://t.co/ffIx1GR0WJ Here are the timings for tonight and tomorrow's #ShakiraMiami shows at @AAarena! Very limited final tickets at https://t.co/A4ornbKOXp. \nAquí están los horarios para los dos shows de hoy y mañana en Miami! Últimos boletos disponibles aquí https://t.co/A4ornbKOXp ShakHQ https://t.co/AfMrB5XAjZ Clip slip! All female artists who perform with a clip in their hair please raise your hands! Shak https://t.co/0xxCtSufs3 Wow! 6 billones de reproducciones de El Dorado! Cómo puede ser posible! Shak ❤ @SonyMusicLatin https://t.co/hzADsZiMrj Sunrise gracias por cantar y bailar conmigo esta noche! Sunrise! Thank you for singing and dancing along with me tonight! Shak https://t.co/ASOK4VhftJ Yay! Today I didn’t mess up the Waka lyrics!! Shak https://t.co/NeuiIzZ7dw Looking forward to tonight’s #ShakiraSunrise show at @thebbtcenter! Very limited final tickets available at https://t.co/ehOeUGsdqL / #ShakiraSunrise nos vemos esta noche! Últimos boletos disponibles aquí https://t.co/ehOeUGsdqL. ShaKHQ https://t.co/TAS88jdWfA Orlando covered in pink lighting. Magical! Shak https://t.co/lbtPry4F4Y Today in Orlando I saw so many of you wearing hips scarfs (just like me!) Shak https://t.co/nndRc3XNH9 Are you ready Orlando??? Preparados??? #ShakiraOrlando. ShakHQ https://t.co/L1hBtrcs1P Nothing here lies!! Shak https://t.co/Rfq6CmXcKP Hello Florida! Here are the times for tonight’s #ShakiraOrlando show at @AmwayCenter. Very limited final tickets at https://t.co/Yr6knWJIy6. Hola Florida! Aquí están los horarios para el show de esta noche. Últimos tickets disponibles aquí https://t.co/Yr6knWJIy6. ShakHQ https://t.co/JetmvavywH RT @SonyMusicLatin: Vota por #Chantaje de @shakira feat. @maluma en los @vmas 👏🎉. Ingresa en 👉 https://t.co/gDvZbzp0XU https://t.co/8LXi1ID… When you are in Washington DC and go for a coffee don’t forget to tip! Because Tips don’t lie! Shak https://t.co/f9YVusftNs https://t.co/KWs1iKeGME Washington DC, it made me so happy to see you smiling all the time tonight!!! Shak https://t.co/B1AGhF9OqM RT @LiveNation: .@shakira's El Dorado World Tour is full of dancing, confetti &amp; your favorite hits! \n\nSee her live in your city https://t.c… Feliz cumple años Cerati! Te quiero por siempre! Shak https://t.co/6RtPYMGype 🔥🔥🔥 #ShakiraDC https://t.co/H1Hx5v0Ggd Me Enamoré! #ShakiraDC. ShakHQ https://t.co/MXsmA0OnfJ #ShakiraDC is about to start! El show está a punto de empezar! ShakHQ https://t.co/fQCgEQ82R8 Amor, acaba una etapa que siempre guardaremos en el corazón. Uno de los momentos más felices  de mi vida también ha sido verte ganar en el 2010 con la selección y celebrar con España campeones! Shak https://t.co/TsUyXMLEAu Here we are in Washington DC! Shak https://t.co/LAFxFK8XTi RT @RollingStone: Shakira rocks, body rolls at New York stop of El Dorado World Tour. Our review from Madison Square Garden: https://t.co/S… Revving up the engines with Clandestino just minutes before the concert at @TheGarden! Calentando motores con clandestino minutos antes del concierto en MSG en NYC. Shak https://t.co/5GXZSathWI Meet Nadine a kick ass woman crucial part of this show, my career and my life! Shak https://t.co/lGLo17Bi2m RT @CapitalOneArena: .@shakira TONIGHT! 💃🏼\n\nDoors open at 6:30 pm! https://t.co/wkbYfqAxNh Tonight, the #ElDorardoWorldTour rolls into @CapitalOneArena, home of the @Capitals, the recent #StanleyCup winners! 🏒🏆 \nHere are the #ShakiraDC timings. Very limited final tickets available at https://t.co/zXJ69o8zao. ShakHQ https://t.co/USEEDHTQza Madison Square Garden. August 10th 2018. A night to remember. Thank you! Shak @TheGarden https://t.co/fB6Cqe2HmV Con mis fans en NY! Shak https://t.co/z1HFSFPS0W Me encanta verlos bailar!!! Shak https://t.co/U6fNRDmE7z Holding your hand is also the reason of what I do. Thanks for giving me the joy of being a part of your life! Shak https://t.co/eHYpgilUCj You melted my heart! \nMe han emocionado mucho. \nEspero que lo hayan disfrutado.\nShak https://t.co/YWXx8eWIZe Madison Square Garden you were incredible, unforgettable! Thank you New York! Gracias mi gente! Shak https://t.co/eu3on4o2B0 Welcome! Bienvenidos! #ShakiraNYC. ShakHQ https://t.co/sblyKGICii Hello New York City! Hola Nueva York! ShakHQ #ShakiraNYC https://t.co/oFcS1Przb0 Saludos desde el Madison Square Garden en NY! Shak https://t.co/Ix1OBH2WFl Good morning New York! Here are the times for tonight’s Sold Out #ShakiraNYC show at @TheGarden! ShakHQ https://t.co/GnlStSMKDJ Girls' night out! Con mi amiga Gaby en NY! Shak https://t.co/7b8RJtt5H2 Who said rehearsals were over? We keep rehearsing even on days off! Seguimos ensayando hasta en los días libres! Shak https://t.co/3x7PRQ0Jnh I wonder what lucky artist in the world has a handsome band like this one? Shak https://t.co/FONNC6YocO Who said that only girls from Cali know how to salsa? Us Barranquilleras do too! Quién dijo que solo las caleñas sabían bailar salsa? Las Barranquilleras también! Shak https://t.co/mKawESfnq2 Vous êtes incroyable Montréal! Shak https://t.co/Hv8zXr9OZa U.S. fans - you could win a trip to meet Shak at her San Diego show on Sept 5th! Click to enter -&gt; https://t.co/f9eSw3K0fD ShakHQ https://t.co/q4JZ6HHNEO RT @UNICEFQuebec: @UNICEFQuebec est au #ElDoradoWorldTour à Montréal et nous sommes prêts à vous accueillir. #ShakiraMontreal @UNICEFCanada… Inevitable ❤️ #ShakiraMontreal. ShakHQ https://t.co/0dbwb4m7Fc She Wolf! ShakHQ #ShakiraMontreal https://t.co/olnDeAyA9w Happy birthday @salva!!! Feliz cumple @salva!!!! ShakHQ #ShakiraMontreal. https://t.co/4iwqfk6kMW RT @educommission: Exciting to see Commissioner @Shakira in North America! @JustinTrudeau and #Canada have the potential to be leaders on g… Your comments online inspire me and move me!!  Thanks for making it all make sense! 📸 by @vibhatweedy https://t.co/xCbLt1KYXl 82 personas trabajando cada día para llevar este show hasta ustedes! 82 people working daily to bring this show to all of you! 👏🏻👏🏻👏🏻 #bestcrewever Shak. https://t.co/4cuITTOHQd Leila, el sol saldrá para ti. Un abrazo con todo mi cariño. Shak https://t.co/OsTR8HvgXD With my new feather skirt! Shak https://t.co/kxHyZy6jlr Bonjour Québec! Here are the times for tonight’s #ShakiraMontreal show at @BellCentre. Limited final tickets at https://t.co/Ns2noyvcZR ShakHQ https://t.co/ZI0JpNYAo2 Toronto you were pure fire! (in spite of the water!) Shak https://t.co/xaJj47lywQ Whenever, Wherever #ShakiraToronto. ShakHQ https://t.co/l9Dn4gJYCZ RT @UNICEFCanada: We’re at the #ElDoradoWorldTour at Scotiabank Arena in #Toronto! Come by and say hi! https://t.co/6OQQQn9tr6 Thank you @UNICEFCanada! ❤️ #ShakiraToronto. ShakHQ https://t.co/9QCjDrtlLv Paula! I know you are going to get through this and come out of it even stronger! See you at the show! Shak https://t.co/dWXaZsAqXl Wow! I have a double in Toronto! Can’t wait to meet you! Shak https://t.co/dIgqc0Fdh2 Good morning Canada! We’ll see you tonight at @ScotiabankArena for the #ShakiraToronto show. Final tickets at https://t.co/fSY4zVuJNS ShakHQ https://t.co/jIf9OjOaBx https://t.co/cpWSuGd5s7 https://t.co/p5rGWWHnhE What a night it was in Detroit! Now roll on tomorrow’s Toronto show...  Increíble noche en Detroit! Toronto: nos vemos mañana! ShakHQ #ElDoradoWorldTour #ShakiraToronto https://t.co/JRBM2nvzgv Trying out new pyro effects!! Exciting!! Shak https://t.co/b6Cp4g9Lyy RT @Vevo: Attention all @shakira fans. Here's your chance to win a Vevo VIP experience to see her on tour. You could win:\n\n- Front row tick… Nothing like having a laugh with my incorrigible band and crew!\nMe he reído mucho esta noche con mis músicos, incorregibles!!😛 Shak https://t.co/VjwWj1azO7 Hey Canada I’m so excited to be here!! Can’t wait to see you guys! Shak https://t.co/Kj7xi3bL3K #Clandestino is one of @YouTube’s Top 10 music videos right now! If that isn’t an excuse for a little dance... https://t.co/sJtCSQi8Mi / Clandestino es uno de los 10 videos musicales más reproducidos en YouTube en este momento... Lo celebramos con un pequeño baile! ShakHQ https://t.co/hDeFKkLAdm Crouching Tiger, Hidden Dragon!!!!! Thanks for the goosebumps Detroit!!! Shak https://t.co/5UnyXNhF43 Doors are open! Las puertas ya están abiertas! #ShakiraDetroit. ShakHQ https://t.co/FzVB4YEHEL Here are the times for tonight’s #ShakiraDetroit show. We can’t wait to see you guys! Hola Detroit! Aquí están los horarios para el show de esta noche! ShakHQ https://t.co/ptWh3978cY RT @billboard: .@Shakira Kicks Off Momentous U.S. Tour in Chicago After 7-Year Wait: 'I've Been Dreaming About this Moment' https://t.co/y8… We rock too Mommy! https://t.co/qQwlEJbXMr First night in the US, incredible! Thank You Chicago!!! Shak https://t.co/9eK40EyfBG https://t.co/aGdUi8ecLn Que emoción empezar nuestra gira en EEUU de esta manera!! \nGracias Chicago!!\nShak https://t.co/LITDEo90Nk Are you ready Chicago? Están preparados? ShakHQ #ShakiraChicago https://t.co/UpZ0UxaEeF Getting ready! Nobody said it would be easy. Shak https://t.co/J2xMMg22O7 America here we come! Shak https://t.co/NLZ279rxhL RT @UnitedCenter: Retweet this to welcome @Shakira to Chicago for the start of the North American leg of the #ElDoradoWorldTour today!\n\n🎟:… The #ElDoradoWorldTour resumes tonight in Chicago, and we’re all VERY excited. Here are the set times… #ElDoradoWorldTour empieza su andadura esta noche en Chicago y estamos MUY FELICES! Aquí están los horarios para hoy...\nShakHQ https://t.co/q8omrGaeqc Después de recorrer Europa, este viernes #ElDoradoWorldTour empezará su andadura en América del Norte! Tenemos muchas ganas de estar con todos ustedes! Los últimos boletos disponibles los encontrarán aquí https://t.co/ppPCq0fSWV \nShakHQ https://t.co/Z92BjjrVCy After an incredible European run, the North American leg of #ElDoradoWorldTour begins on Friday! We can’t wait to see you guys! Final tickets at https://t.co/ppPCq0fSWV.\nShakHQ https://t.co/U5lenrxJjN RT @LiveNation: Who else wishes they were as fierce as @shakira ? 💃 \n\nGrab your tickets and join the 🎉party🎉 on the #ElDoradoWorldTour: htt… RT @Viber: 🤩 The American leg of @Shakira’s #ElDoradoWorldTour kicks off this Friday in Chicago, Illinois! https://t.co/51kZPZ0Zcg 20 million views! 20 millones de reproducciones! https://t.co/sJtCSQi8Mi ShakHQ #Clandestino https://t.co/6bTdLXdlRA Not sure about this bandana..I’m a mix of Axl Rose and a tarot reader! Thoughts? Shak https://t.co/7ZuorTVxl4 Playing with makeup in my very little spare time before I resume my tour! Shak https://t.co/vFJGo6nuEV I am not the only one lightly dressed - My cameraman in underwear! / No soy la única en ropa ligera! Mi camarógrafo en calzoncillos! Shak https://t.co/MzSpgkPAM5 You guys have already made two big decisions for Shak's new fragrance! You chose a colour (blue). You chose a name (Moonlight). Now, finally, we need your help to pick a pattern for the box. Head to https://t.co/Lr8NQlbAHR to cast your vote!\nShakHQ https://t.co/4T5ZUWS9V7 Después de elegir color (azul) y nombre (Moonlight) solamente queda una última decisión para ayudar a Shak a crear su nuevo perfume! Qué estampado les gusta más? Para votar ingresen aquí -&gt; https://t.co/Lr8NQlbAHR ShakHQ https://t.co/lpvF5SpBDP RT @RecordingAcad: How hot can @shakira and @maluma make your summer? Take to the beach 🏖️ and find out: https://t.co/3QRNcFqH8f   #Clandes… El Dorado World Tour is heading to the US, starting August 3rd. You could fly to Las Vegas to see the show and meet Shak backstage, by donating just $10, to be shared by @fpiesdescalzos and @onedrop. This is the final week to enter! \nhttps://t.co/PsdiDOFpRA ShakHQ https://t.co/xS5rkpGjlU 🎶 Yo no necesito ningún otro Don Juan\nQue me abra la puerta cuando llego a un restaurant\nEn San Valentín no necesita más flores\nTú calladito pa’ evitar todos los rumores 🎶 #Clandestino \nhttps://t.co/sJtCSQi8Mi https://t.co/RpTTTLTZSI RT @vmas: 👏@shakira and @maluma are nominated for Best Latin for 'Chantaje' at the 2018 #VMAs. \n\nVote, vote, vote at https://t.co/l0PJzl3aI… Green make up today, at my son’s request! Shak https://t.co/d0DMP2cmIx 5 million views in a day! 5 millones de reproducciones en un día! #Clandestino. https://t.co/uWRtUXnkmt ShakHQ https://t.co/3llCXQp2Ys RT @Vevo: First we got \"Chantaje,\" then \"Trap,\" and now \"Clandestino.\" 😍 Maybe @shakira &amp; @maluma should become a duo? https://t.co/cEcThJS… RT @SonyMusicLatin: Celebremos a escondidas que el video de #Clandestino 🤫 superó el millón de reproducciones en @youtube. Felicita ahora a… That beach in Sitges felt like an afternoon in the Caribbean! Esta playa en Sitges fue como una tarde en el Caribe! Shak #Clandestino https://t.co/sDEScAcsIP https://t.co/3Quhmu5J64 RT @sonymusicmexico: 🔥 @shakira &amp; @maluma tomaron la #CDMX con #Clandestino 🔥😎 ¿Ya vieron el video que está en @YouTubeMexico? https://t.co… RT @SonyMusicLatin: El nuevo video de @shakira y @maluma fue grabado en la costa de España. 🎊😍 ¿Ya lo viste? ¡Corre! 👉https://t.co/tuEcHNs7… RT @SonyMusic: .@Shakira + @MALUMA = HINO 🔥O clipe de #Clandestino já está entre nós! Assista agora https://t.co/DU0ZC1nOul https://t.co/SC… RT @maluma: #Clandestino official video @shakira https://t.co/MF6qEfFWi4 Have you checked out the stunning new #Clandestino video ft @maluma? Watch now at https://t.co/sJtCSQ0xnI / Han visto el increíble nuevo video de #Clandestino con Maluma? Lo pueden ver aquí https://t.co/sJtCSQ0xnI\nShakHQ https://t.co/b53i9QmLy2 RT @VEVO_ESP: Recién sacado del horno... ¡No te pierdas el videoclip oficial de #Clandestino, el hit de @shakira y @maluma que no parará de… IT’S HERE! The official video for Clandestino with @Maluma! YA ESTÁ AQUÍ! El video oficial de #Clandestino con Maluma! ShakHQ https://t.co/sJtCSQi8Mi RT @maluma: Mañana WORLD PREMIER / LANZAMIENTO MUNDIAL de #Clandestino official video. @shakira https://t.co/5glC8FGqUt Tomorrow / Mañana 9am EST (8am 🇨🇴 / 3pm 🇪🇸) #Clandestino video with @Maluma world premiere! Estreno mundial del video de Clandestino! ShakHQ https://t.co/yNw0yE6AVe #Clandestino video with @maluma! This Friday! / Este viernes! ShakHQ https://t.co/qHsGzSYwX5 RT @maluma: #Clandestino official video.. this Friday!! Are you ready?  @shakira este viernes el video oficial de #Clandestino!! están list… Who’s ready for Summer Friday? #Clandestino video is coming just in time for the weekend... / Están listos para el viernes? El vídeo de #Clandestino llegará justo a tiempo para el fin de semana...🍹🏖☀️Shak https://t.co/qXj6XmiNRN Ésta es mi Barranquilla. Shak https://t.co/ClMoBzPdAO Fuegos de colores por dentro y por fuera! Gracias Barranquilla!! @Bquilla2018 Shak https://t.co/tyfKNEpKQc Que emoción cantar en curramba!! Fuegos de colores en el cielo y en el corazón!!!! Shak https://t.co/1tUBCZzeQ1 RT @Bquilla2018: ¡Apoteósico! El Show Inaugural de #Barranquilla2018 quedará para la historia de nuestra ciudad. https://t.co/BNNpRFyyqj RT @Bquilla2018: ¡Increíble 😱! Todos son bienvenidos a la XXIII edición de los Juegos Centroamericanos y del Caribe #Barranquilla2018. http… RT @Bquilla2018: El río y el mar fueron testigos de la historia barranquillera. Por el río llegaron los bailes y tradiciones, por el mar ll… RT @Bquilla2018: #Barranquilla2018 Sigue en el siguiente link la transmisión en vivo y en directo del show de Inauguración de @Bquilla2018:… Las puertas ya están abiertas! Doors are open! ShakHQ #Barranquilla2018 @Bquilla2018 https://t.co/hUyDvYs5Rf Feliz de estar en mi tierra!! Shak #Barranquilla2018 https://t.co/o61iFrnFwZ Vista desde el escenario de #Barranquilla2018! View from the @Bquilla2018 stage! ShakHQ https://t.co/WWnT7t3G9G Barranquilla! Shak @Bquilla2018 #Barranquilla2018 https://t.co/XuKitRON8B RT @Bquilla2018: Hagamos que esta fiesta deportiva sea la más grande de la historia. Sube tus fotos y vídeos en todas tus redes sociales us… RT @Bquilla2018: Estamos listos para el gran show de inauguración de los Juegos Centroamericanos y del Caribe #Barranquilla2018. Hoy la cit… Ayude a @onedrop y a @fpiesdescalzos donando $10 y podrá ganar un viaje a Las Vegas donde conocerá a Shak en el concierto de #ElDoradoWorldTour! Para participar ✈ https://t.co/PuK8ostnhy ShakHQ https://t.co/yws8lINrKy Donate $10 to @onedrop and @fpiesdescalzos and you could win a trip to meet Shak backstage in Las Vegas on the #ElDoradoWorldTour! Enter now at https://t.co/dLygx3T6Ah ✈ https://t.co/0AEECVpOH7 Tomorrow! Mañana! ShakHQ @bquilla2018 #Barranquilla2018 https://t.co/FBVcqFLup6 Last week in Lebanon, a square in the cedar forest of Tannourine - where Shak’s grandmother is from - was dedicated to Shak. / La semana pasada en el Líbano, se le dedicó a Shak una plaza en el bosque de cedros de Tannourine—pueblo de la abuela paterna. ShakHQ https://t.co/5EZ21rojMV RT @MTV: @shakira congrats on your 2018 #vma nomination 💗 vote now at https://t.co/CGTLSIBpj8 https://t.co/NC9h9lV9MT Chantaje ft @Maluma is up for Best Latin at @MTV’s #VMAs! If you’re in the US, vote at https://t.co/DliTcV9D85. \nChantaje con Maluma está nominado en los premios de MTV VMA en la categoría de Best Latin. Si están en los Estados Unidos pueden votar aquí https://t.co/DliTcV9D85 SHQ https://t.co/LyZ1z2PtWM Now it’s time to help us decide a name! Ayúdennos a escoger un nombre! ShakHQ Después de recibir más de medio millón de votos, ustedes se decantaron por el color azul! Ahora es el momento para que nos ayuden a escoger un nombre! Para votar su nombre favorito -&gt; https://t.co/Lr8NQlbAHR\nShakHQ https://t.co/P1r1S4f5Ve After more than half a million votes, you guys chose the color blue ahead of red! Now it’s time to help us decide a name. Pick your favorite here -&gt; https://t.co/Lr8NQlbAHR \nShakHQ https://t.co/P7eoUqWxAG Simply beautiful!! https://t.co/f37qbfe8uS. Shak Congratulations France for making history and to Croatia for an amazing tournament! ❤️⚽️💪🏼 Shak https://t.co/v2QORN2ReG What a rush of emotions to end the first leg of my tour in Lebanon!! Shak https://t.co/zUQfvm6Z9X Live from the mountains of Lebanon! En vivo desde las montañas del Líbano! Shak https://t.co/QUiZDow2LX Watch the exclusive vertical video for Clandestino, Shak’s new hit single with @maluma, over on Instagram’s IGTV now! \nNo se pierdan el exclusivo video en vertical de Clandestino, el nuevo hit de Shak con Maluma en el IGTV de Instagram! \n-&gt; https://t.co/KHs3XSGxZP  ShakHQ https://t.co/mJ3B1ojmjJ https://t.co/93TV1HaESd Marhaba!! Hola Líbano!! Shak https://t.co/b8Yio4A8hY https://t.co/O7c1x6bhrY Estambul con decenas de miles de personas! Impresionante!! Shak https://t.co/BKdADE3hi0 https://t.co/OQnGEV5ajj https://t.co/NZYbrtjTAf What a  feeling to have performed at this stadium amongst all of you!!! Shak #ShakiraIstanbul https://t.co/WUm1l44cRu La gallina y sus pollitos llegando al estadio de Estambul donde estaré cantando esta noche! Arriving to the venue in Istanbul where I’ll be performing tonight! Shak https://t.co/T9Ql4LChNZ RT @onedrop: Last week to donate to 2 great causes and win a VIP Experience with @shakira during her El Dorado World Tour ! https://t.co/bs… The stage is set for the first stadium show of the tour! #ShakiraIstanbul! Ya estamos preparados para el primer concierto en un estadio de la gira de #ElDoradoWorldTour ShakHQ https://t.co/PfxNF4TDMM Gracias a mi amiga @yeiduranartist por este cuadro de mi bebé Sasha! Shak https://t.co/GAsVv0um6o RT @Prizeo: 🎵Whenever, Wherever🎵... you are, donate NOW to enter for a chance to see @Shakira LIVE in concert AND to meet her in person! ON… El pasado domingo por la noche con mi increíble banda y crew celebrando el final de la gira europea en el sitio con las mejores vistas de Barcelona!\nShak https://t.co/jN4wJOSBCu On Sunday night with my awesome band and crew celebrating the end of the European leg in #BlueSpotBarcelona with the best views of Barcelona! Shak https://t.co/TSSml6aWgb La improvisación de ayer a petición del público y mi suegro! Shak https://t.co/O0zMmOyT3w Es el primer concierto de la Iaia Lina! Shak https://t.co/isnkpaKl1c https://t.co/8rEQAkpEHc Momentos imborrables!!!! Shak https://t.co/NTdRrerFBC Barcelona, dos noches impresionantes! “Soy feliz, muy feliz!” Shak https://t.co/68oAYKrg1x #ShakiraBarcelona ShakHQ https://t.co/VOGGYS9f9n She Wolf #ShakiraBarcelona ShakHQ https://t.co/tI5rYZH5w7 Vamos! Let’s do this! ShakHQ #ShakiraBarcelona https://t.co/V7wL9E1YAb Una pequeña sorpresa esta noche! Tonight a lil surprise! Shak https://t.co/Zmv8Pg9Jag You were in fine voice last night Barcelona! Question is, can tonight’s @PalauSantJordi crowd sing even louder?!  Anoche cantaron muy bien! @PalauSantJordi, nos vemos esta noche!  #ShakiraBarcelona ShakHQ https://t.co/ZzJ3PKFIjm Gracias por hacerme tan feliz esta noche Barcelona!!! Público sublime!!! Shak https://t.co/UoVzWtx9t3 Inevitable 🎸 #ShakiraBarcelona ShakHQ https://t.co/ogTAxkb6SJ Aquí está ! Here we go! #ShakiraBarcelona ShakHQ https://t.co/MVmAbYpCkz Preparados? Are you ready Barcelona? #ShakiraBarcelona. ShakHQ https://t.co/OQPo3jTNdB Estoy lista para Barcelona! Shak https://t.co/Fq1mU2nTF9 #ElDoradoWorldTour vuelve a casa (donde empezaron los ensayos!) Aquí están los horarios de hoy. Los tickets para el concierto de hoy están agotados pero quedan muy pocos tickets disponibles para el concierto de mañana https://t.co/NBE4Up7bx7. ShakHQ #ShakiraBarcelona https://t.co/NI5Wp8shn8 RT @onedrop: Donate to 2 great causes and win a VIP Experience with Shakira during her El Dorado World Tour !\nhttps://t.co/rdKz3T06aV https… Hola Barcelona! ShakHQ #ShakiraBarcelona https://t.co/dOtz2OiK2N Which colour do you prefer? Qué color les gusta más? ShakHQ Shak needs your help to create her new fragrance! Which colour do you prefer? Red or blue? Vote here -&gt; https://t.co/ClH051Eq0w\nShakHQ https://t.co/KO9L5SFgys Shakira necesita de su ayuda para crear su nuevo perfume! Qué color les gusta más? Azul noche o coral? Voten aquí -&gt; https://t.co/ClH051Eq0w ShakHQ https://t.co/OLhyvyS5gP Un tiburoncito inofensivo! Shak https://t.co/VoENFXNL7x https://t.co/H0aB5ul2vI https://t.co/w7wFobgwyn Muchas Gracias Madrid! Thank you Madrid! ShakHQ https://t.co/QEM7QIsc1v Momentos imborrables de esta noche en Madrid! Shak https://t.co/PK54b8ChMI Madrid, uno de los mejores públicos de mi vida! \nGracias por la sorpresa de los globos, el cariño y la alegría!!!\nShak https://t.co/hn7b9qwWWC Impresionante Colombia en este Mundial... Creo que el mundo entero sabe que merecíamos ganar! \nOrgullosa por siempre de mi país!!!\nShak Deseándole mucha suerte a nuestra selección 🇨🇴 hoy! Shak Hola Madrid! Aquí están los horarios para el concierto de Shakira en el @wizinkcenter. ShakHQ #ShakiraMadrid https://t.co/5i1w3UwKWQ RT @SonyMusicCol: ¡Aquí estamos los que amamos el video de #Clandestino de @shakira y @maluma en #VivaLatino de @SpotifyColombia! 😁🎶👉 https… RT @educommission: \"The one thing that can really break that cycle of poverty and bring new opportunities is education. I've seen it with m… Cosas de esta gira: en Lisboa fue una gamba, en Bilbao una vaca y ayer en la Coruña un conejo! cuál creen que será el disfraz de Tyler en Madrid y Barcelona? Shak https://t.co/McxZ9vwOAq Ya han escuchado Clandestino con @maluma en la playlist Viva Latino de @Spotify? Allí encontrarán el primer vídeo vertical de Shak (el vídeo oficial de la canción se estrenará muy pronto!!! https://t.co/8BpZlyEGud \nShakHQ https://t.co/XGmyvvZuAN Have you checked out #Clandestino on @Spotify’s Viva Latino playlist? Don’t forget to watch the vertical video (official video coming soon)!! https://t.co/8BpZlyEGud ShakHQ https://t.co/7ydQ0RcMdp RT @onedrop: . @shakira is celebrating One Drop's 10th anniversary and is helping raise funds for @fpiesdescalzos also! Donate for a chance… Tan lindo ver tantos niños en el show de hoy! So nice to see so many kids at today's show! Shak https://t.co/uNzEqxPD9c A Coruña esta noche lo dimos todo! Lo necesitábamos! Shak https://t.co/Zc1ZedL4Rz #SHAKIRAACORUÑA ShakHQ https://t.co/RvdfzXLvFW Saludos desde el stand de @RakutenArena en A Coruña! It’s busy at #Rakuten’s #ElDoradoWorldTour glitter stand! ShakHQ #SHAKIRAACORUÑA https://t.co/1eGWcFO2g9 Goool!! 🇪🇸 https://t.co/AUDeSc60LD Hola Galicia! Aquí están los horarios para el concierto de hoy en el    @coliseumcoruna. Últimos tickets disponibles aquí -&gt; https://t.co/X0xvrfLciE ShakHQ #SHAKIRAACORUÑA https://t.co/fKekgeOCF7 España! España! 🇪🇸⚽️❤️ Shak https://t.co/klRvPqmdye ⚽️🎶❤️La hora se acerca \nEs el momento \nVas a ganar cada batalla \nYo lo presiento \nHay que empezar de cero \nPara tocar el cielo ahora vamos por todos y todos vamos por ellos!!🎶⚽️❤️ https://t.co/SGs324iPy6 Tal y como lo soñé Bilbao! Shak https://t.co/54CdOlPuqp RT @SpotifyLatino: Go behind the scenes and around the world con @shakira y @maluma con su nuevo video vertical #Clandestino, ahora en #Viv… Mi primera noche en la gira española tal y como la soñaba! Shak https://t.co/TmYeddSC7V Can’t Remember To Forget You! #ShakiraBilbao. ShakHQ https://t.co/HRQi5PTkR1 Hola! @unicef_es! ShakHQ #ShakiraBilbao https://t.co/Qars5qtAHG RT @theirworld: Thanks to the campaigning efforts of @shakira, another 100,000 people have added their names to the petition to help make #… Doors are open! Las puertas ya están abiertas! #ShakiraBilbao. ShakHQ https://t.co/wdjnN49mbk Aquí estoy. Preparándome para mi primer concierto en España: Bilbao! Shak https://t.co/w9xbxRNeob RT @maluma: VIVA LATINO! @shakira spotify #Clandestino 🚀🚀🚀🚀 @ Bucharest, Romania https://t.co/TXYtVRGvEG Aquí está toda la información sobre los horarios del concierto de hoy! Últimos tickets disponibles aquí https://t.co/fNubqNW7fY ShakHQ #ShakiraBilbao https://t.co/fqFfLejbv4 Obrigado Lisboa! ShakHQ https://t.co/KGAtaJpFvl Lisboa vocês foram incríveis ontem! Um dos melhores públicos! / Lisbon you were amazing last night!! One of the best crowds!! Shak https://t.co/MdxodqSVq1 Gracias Ale! Amigos como tú son los que me han permitido salir adelante y estar mañana cantando en Bilbao!! Shak https://t.co/giDB06wvll RT @maluma: Ya vieron el video vertical de @shakira #Clandestino? Búsquenlo ya en spotify vivalatino! @ Bucharest, Romania https://t.co/1oR… Behind the scenes of the vertical video of #Clandestino! Shak @spotify https://t.co/37Sf58iHYg My first vertical video ever. I really enjoyed capturing such spontaneous and cool moments. Hope you guys like it! https://t.co/8BpZlyEGud Shak @spotify https://t.co/9qlQF5dXpn Muy pronto estaré cantando en mi casa y para mi gente en los Juegos Centroaméricanos y del Caribe que se celebran en el rincón del mundo que más quiero!! Barranquilla @bquilla2018!!!!! Shak https://t.co/Cp68qYhjMK No se pierdan el primer video vertical de Shak y @Maluma para su nuevo sencillo, #Clandestino. Lo encontrarán en exclusiva en la playlist de @Spotify Viva Latino! -&gt; https://t.co/8BpZlyEGud \nShakHQ https://t.co/X9j1V5IfJN Check out Shak and @maluma in their first ever vertical music video for the new single Clandestino, exclusively on @spotify’s Viva Latino playlist! -&gt; https://t.co/8BpZlyEGud ShakHQ https://t.co/MzPmdMdXr7 Obrigado! #ShakiraLisboa ShakHQ https://t.co/ZAGuRFfRB7 Inevitable! #ShakiraLisboa. ShakHQ https://t.co/LGye07qB02 Me Enamoré! #ShakiraLisboa ShakHQ https://t.co/vwHBa8251x RT @Prizeo: Win TWO VIP tickets to @Shakira's \"El Dorado World Tour\", TWO roundtrip tickets to Las Vegas plus hotel, an exclusive meet and… Colombia!! Colombia!!!!Colombia!!!!! Shak https://t.co/Kb3YmXlhJ4 Celebrando la victoria de Colombia!!!! Shak https://t.co/WXpXL3NWZw 🎵Y la presión\nSe siente\nEspera en ti\nTu gente🎵\n#VamosColombia! 🇨🇴\nhttps://t.co/SGs324iPy6 Tienen una pregunta para Shakira? Ella estará contestando sus preguntas, solamente en @Viber. Hagan click aquí https://t.co/oeqfEbFNR0 para mandar sus preguntas y tener la oportunidad de ganar regalos increíbles! ShakHQ https://t.co/QjsE7VKq9g Is there something you'd like to ask Shakira? She'll be answering your questions, only on @Viber! Click https://t.co/oeqfEbFNR0 to submit your questions, and get a chance to win cool prizes! ShakHQ https://t.co/p8s1C6n3uH Shak needs your help to design her new limited edition Dance fragrance! Quieren ayudar a Shak a diseñar su nueva fragancia? Aquí toda la información https://t.co/8tJtf82TfY ShakHQ https://t.co/uz2WG3aCkf Making of C-L-A-N-D-E-S-T-I-N-O! Very soon! Grabando el vídeo de C-L-A-N-D-E-S-T-I-N-O! Muy pronto! @maluma Shak https://t.co/BBMQpDDWXX Gracias por esta sorpresa tan linda, me llegó directo al corazón! Shak https://t.co/zfP0KRcnAW Vamos España! ❤️💪🏼🇪🇸⚽️ Shak Bonjour! Here are tonight's #ShakiraMontpellier times. ShakHQ https://t.co/U121CfpJMU Noche redondita en Burdeos y de Colombia en Rusia!!\nNo puedo estar más feliz hoy!!!\nShak https://t.co/vb88G7nd9n Loca - Rabiosa. #ShakiraBordeaux. ShakHQ https://t.co/soExRDDmKG Me Enamoré! #ShakiraBordeaux. ShakHQ https://t.co/ghvzgalQ1T C-O-L-O-M-B-I-A!!! ❤ Shak https://t.co/FH9AmRdZej Creo que ya tengo mi coreografía de #Clandestino! Shak https://t.co/ehd00j9xMD Amazing moment from this week’s #ShakiraMilan show: Antología with the entire crowd on backing vocals! Un momento para el recuerdo del show de Shakira en Milan: la canción Antología cantada por todo el público! ShakHQ https://t.co/C1UcH21XDr Ustedes me hacen levitar! Gracias Zurich! \nYou make me levitate! Thank you Zurich! \nShak https://t.co/9Msf2XCLgp Friends forever! ShakHQ #ShakiraZurich https://t.co/oCVM9MQZQD Con mis fans italianos que organizaron la sorpresa de anoche! With my Italian fans that organized yesterday's surprise! Shak https://t.co/aMs8dcudvc RT @LiveNationIT: Shakira // El Dorado World Tour\n\n21.06.2018 · Milano, Mediolanum Forum\n\nFoto: @PamelaRovaris https://t.co/M8iiOElo2O The @UNICEF team is ready! El equipo de @UNICEFenEspanol ya está preparado! ShakHQ #ShakiraZurich https://t.co/HDD7sqSYdB Grazie Mille, Milano! Shak https://t.co/ze8s8W15MX Hello🇨🇭! Here are the times for tonight's sold out #ShakiraZurich show! ShakHQ https://t.co/IAnBLlqRdP Uno dei momenti più magici della mia carriera. Grazie! Vi adoro! Uno de los momentos más mágicos de mi carera. Gracias. Los adoro. One of the most magical moments of my career. Thank you so much. Love you guys! Shak https://t.co/Iv7B7EOsI1 Orgullosa por tus cien partidos con la Selección Española! Shak https://t.co/TD3BU74Tkl Grazie Milano per questa notte indimenticabile!! Tanta emozione!! Avete cantato tutti!!! Lo han cantado todo!!!! Shak https://t.co/zdOnSwIOTX Los ojos llenos de agua y alma de emoción! Hacen todo posible!!!!!!\nGli occhi pieni di lacrime e l'anima piena di emozioni! Fanno tutto questo possibile !!! Shak https://t.co/IWngcqp75h La La La 🥁 #ShakiraMilan ShakHQ https://t.co/U8DgNAiqI1 Amarillo 💛 #ShakiraMilan ShakHQ https://t.co/7nBmZJu604 #ShakiraMilan ShakHQ https://t.co/4svDmPkU5c 🎶Yo vine a verte pa entretenerme \nY me robaste un beso que aun no piensas devolverme \nMe sentía volando, me iba escapando \nCuando menos pensaba ya me estabas abrazando 🎶\n#Clandestino with @maluma \nhttps://t.co/0M8Gf1wMgU https://t.co/fOZAHOqJWF Amazing to be so close to all of you last night!! Thanks to all my fans accompanying me thru the entire European tour!!! \nFue increíble estar tan cerca de todos ustedes anoche! Y gracias a todos mis fans por acompañarme en esta gira Europea. Shak https://t.co/jLMMv71Zzw Thank you for the magical night Luxembourg! Muchas gracias Luxembourg por esta noche tan mágica! Shak https://t.co/eqhLcQ9Tvp .@UNICEF is here! @UNICEFenEspanol ya está aquí! #ShakiraLuxembourg ShakHQ https://t.co/UqsTbKhOpq 💔 Hello 🇱🇺! Here are tonight's #ShakiraLuxembourg timings! ShakHQ https://t.co/Gr0dn3KFdB Vamos Colombia! 🇨🇴⚽🏆 https://t.co/UsZ7AACj8B RT @LiveNation: RT if you're seeing @shakira's #ElDoradoWorldTour. \n\nGet tickets here https://t.co/0u3scr15bV https://t.co/9mGSnV0vOV Thank you Munich! It felt so good to be back in Germany! See you soon! Muchas gracias Munich! Muy feliz de volver a estar con todos ustedes! Nos vemos pronto! Shak https://t.co/l3t7q5kCqH #ElDoradoWorldTour is back in Germany tonight! Check out our behind-the-scenes film from the opening show in Hamburg! #ElDoradoWorldTour vuelve hoy a Alemania! En este video les mostramos lo que pasó antes de empezar el primer concierto de la gira en Hamburgo! ShakHQ https://t.co/1GbxpKuKHj RT @SonyMusicLatin: Cuando menos pensabas, estabas cantando #Clandestino de @shakira y @maluma. 🎤🙊 ¡Escúchalo ya! https://t.co/As37qSdv0F h… Hallo Deutschland 🇩🇪 Last year Germany led commitments to #FundEducation at the G20. I hope Angela Merkel continues this trend by backing the new education financing facility to #MakeImpossiblePossible for millions of children. https://t.co/UzwxBBA3uL Hallo Deutschland! Here are the times for tonight's #ShakiraMunich show. ShakHQ https://t.co/avxGwr7GDw A tope!! https://t.co/t74PYhsrMc Shak Milan ayer se graduó de educación infantil y entra ya a primero de primaria!! Como pasa el tiempo! ❤\nI can’t believe Milan is now going to first grade! Yesterday at his graduation! ❤ Shak https://t.co/qgegDPEPY4 It’s great to have @UNICEF on the road with us for #ElDoradoWorldTour. Look out for them at the shows! Nos hace muy felices contar con la compañía de @UNICEFenEspanol en #ElDoradoWorldTour! Los encontrarán en cada show! ShakHQ https://t.co/V97bagA5Ke Thanks for the #Clandestino billboard in New York @Spotify! \nMuchas gracias por este billboard de #Clandestino en Nueva York Spotify! https://t.co/6AISQmpcN3 Listen to Shak’s new song #Clandestino with @maluma on @Amazonmusic’s #FUEGOLATINO playlist! \nEscuchen la nueva canción de Shakira, Clandestino, con Maluma en la playlist FUEGO LATINO de Amazon Music \n-&gt; https://t.co/H097XjOPTH &lt;-\nShakHQ https://t.co/v5dZefmVQk Paris, je t’aime à mourir. Shak. https://t.co/bKgGyuPIaF Here’s Shak telling her #ShakiraParis crowd how happy she is to be back with them…  / Aquí esta Shak explicando al público de #ShakiraParis lo feliz que está de estar de vuelta en los escenarios con ellos... ShakHQ https://t.co/8CLUhc8s96 De camino al venue en Paris! / On my way to the venue in Paris! Shak #ShakiraParis https://t.co/18Xedfbfk1 Je t'aime Paris! Shak https://t.co/QRVC0VuAik See you again tomorrow night Paris! Nos vemos mañana! ShakHQ #ShakiraParis https://t.co/OfMSTi0Q5c RT @AccorH_Arena: Fin de l’époustouflant show de @shakira ce soir à l’@AccorH_Arena  !!!! \n\nUne énergie incroyable que la chanteuse communi… C’etait incroyable ce soir! Je t’aime la France! Shak https://t.co/Szxa4ut4cn #ShakiraParis @AccorH_Arena ShakHQ https://t.co/V9qbw1lI5A Doors are open! Las puertas ya están abiertas! #ShakiraParis. ShakHQ https://t.co/AXgip0okze RT @DeezerFR: Ce soir et demain, @shakira va faire monter la température à l'@AccorH_Arena pour le #ElDoradoWorldTour 💃 Quel est votre titr… Here are the times for the two #ShakiraParis shows! Limited final tickets available at https://t.co/hlMgkVPQQJ. ShakHQ https://t.co/l1bUKB8djL Colombian designer Obando! Del diseñador colombiano Obando! Shak #ElDoradoWorldTour https://t.co/iWuxShyrQk Happy to celebrate @onedrop 10th anniversary and help raise funds for @fpiesdescalzos! Donate for a chance to win a trip to Las Vegas and meet Shak at her #ElDoradoWorldTour with a friend! Visit https://t.co/4HTM3648Ga ShakHQ https://t.co/5RnX4VH2u8 What a night in London! Thanks everyone! Roll on #ShakiraParis \nVaya noche Londres! Muchas gracias a todos! Próxima parada #ShakiraParis ShakHQ https://t.co/8KqT4j89Vh There wasn't space for a needle tonight at @TheO2 in London. Thank you for singing all of my songs, whether in Spanish or English. You made me feel at home. Shak https://t.co/gA4WWGPybR No cabía una aguja en el @TheO2 de Londres esta noche, gracias por cantar todas y cada una de mis canciones conmigo. Me hicieron sentir en casa! Shak https://t.co/P3vsgaoSI5 #ShakiraLondon ShakHQ https://t.co/KpGc4i4mPD A whole new way of making an entrance at the O2! Here I come London!!! Feeling complete! Shak https://t.co/sV4EcDFjLa Here are the times for tonight's #ShakiraLondon show at @TheO2! ShakHQ https://t.co/2cxQuwKBVZ RT @allontheboard: @shakira is bringing her #ElDoradoWorldTour to @TheO2 Get your hips ready Poem by @allontheboard #Shakira #ElDoradoWorld… Whenever, Wherever! See you tonight London! Limited final tickets available at https://t.co/tXxrHZHTNB ShakHQ https://t.co/VDfU3dTksB Sweet memories from last night. Shak. https://t.co/MwWG7bOvrZ London calling! Can’t wait to see you tomorrow... https://t.co/ppPCq0xulv Shak https://t.co/U1qPcEgUUj After the show celebrating with Clandestino! Después del show anoche celebrando con un poquito de Clandestino! Shak https://t.co/zSitB1PyIq RT @BBCNewsEnts: “There were times I doubted I would ever be in front of a crowd again.” @shakira tells us about the vocal lesions that nea… Método Wave y @fpiesdescalzos trabajando por la estimulación motriz de niños en una población en Colombia de escasos recursos! https://t.co/Bj0CggbdZU Hoy en Amsterdam, Sasha y Milan viendo a su mami por primera vez en concierto! ❤️❤️ / Tonight in Amsterdam, Sasha and Milan watching their mama live for the first time ever! ❤️❤️ Shak https://t.co/wqSt6h4S2y Thank you Amsterdam! You were 🔥! Shak https://t.co/h633Wkm9mS RT @ZiggoDome: \"I think I'm going to cry if she plays Antologia tonight\". Stiven is helemaal klaar voor #shakira in de #ZiggoDome! 🇨🇴#Shaki… RT @LiveNationUK: International superstar @shakira is playing London's @TheO2 THIS Monday! Be there 👉 https://t.co/1Ag17l4w9m https://t.co/… Clandestino ❤️ #ShakiraAmsterdam. ShakHQ https://t.co/Bl8ejPJOFy RT @maluma: \"Que comemos de una fruta prohibida, nos encanta… https://t.co/BysWaeDMtg RT @theirworld: At the start of her #ElDoradoWorldTour, @Shakira still managed to urge her fans to back the International Finance Facility… 🎤 Estoy aquí queriéndote\nAhogándome\nEntre fotos y cuadernos\nEntre cosas y recuerdos\nQue no puedo comprender 🎤\nTONIGHT / ESTA NOCHE\n#ShakiraAmsterdam \nShakHQ https://t.co/4FhN5GOFyr My new song #Clandestino with @Maluma is out now! Listen on @AppleMusic! Shak / Mi nueva canción con Maluma, Clandestino, ya está disponible! Escúchenla en Apple Music. Shak\n-&gt; https://t.co/NJqFf4H1qt &lt;- https://t.co/HkRpJ3s0Kw Ay cómo los quiero!! Shak https://t.co/57lr3wk3Sm RT @maluma: WE READY SHAK!! @shakira 🌟🌟 \n#Clandestino… https://t.co/ugauSMaWdb RT @maluma: YA SALIOOOOOO / AVAILABLE NOWWWW!! #clandestino… https://t.co/6ma7rETKV9 Una vez más nos juntamos con @Maluma y tenemos una nueva canción en preparación para el verano. Aquí está #Clandestino. Escúchenlo en @Spotify acá -&gt; https://t.co/0TleNoHLiG Shak https://t.co/evjui3YPBb We can’t help it. Got together one more time with @Maluma and a brand new song came up. Here it is, #Clandestino. Summer vibes! Listen now on @Spotify -&gt; https://t.co/0TleNoHLiG Shak https://t.co/UPEdqKMwr2 20,000 of you singing along tonight! sublime! Thanks Belgium!! Shak https://t.co/TC99jM6ciP Thank you Antwerp, you guys were an unforgettable crowd! Shak #ShakiraAntwerp https://t.co/L5O0BhFwmx Full house! #ShakiraAntwerp ShakHQ https://t.co/dTADyOq5A8 Hello Belgium! Here are the times for tonight’s #ShakiraAntwerp show - very limited final tickets available at https://t.co/DFqdUOrE5v. ShakHQ https://t.co/DyAHgVdw00 Great to be in Europe for #ElDoradoWorldTour during #EDD18. We need all countries to back the Education Finance Facility to #MakeImpossiblePossible &amp; get every child in school. Sign today if you want leaders to back this plan for universal education ✍️ https://t.co/UzwxBBA3uL Hello 🇧🇪! Here are the times for tonight's #ShakiraAntwerp show at @Sportpaleis! ShakHQ https://t.co/TPjQF2VW1n 🎙 El cielo está cansado ya de ver\nLa lluvia caer\nY cada día que pasa es uno más\nParecido a ayer\nNo encuentro forma a alguna de\nOlvidarte porqué\nSeguir amándote es #inevitable 🎙\nTONIGHT / ESTA NOCHE\n#ShakiraAntwerp \nShakHQ https://t.co/9PPfa5EpVF Moments from last night! Momentos de anoche en Colonia! Shak https://t.co/AOjXEpqVtk Anoche veía las caras de todos y cada uno de ustedes desde el escenario! Y no se me olvidan! Shak https://t.co/Dp3KySzFdV I’m finally in Cologne! Shak https://t.co/A6DqcBlqd3 Guten Morgen! Here are the times for tonight’s #ShakiraCologne show - *very* limited final tickets just released at https://t.co/WV1gaU9xBQ. ShakHQ https://t.co/Z5dktvs2xk Check this out, filmed backstage right after last night’s #ShakiraHamburg show. What a moment! Un momento para el recuerdo! No se pierdan este video de lo que sucedió anoche, después del show de Shakira en Hamburgo! ShakHQ https://t.co/WOXi2zvRXl Magical night!!!! Shak https://t.co/VaJuL25N1x RT @LiveNationES: ¡@shakira inició ayer en Hamburgo con un rotundo éxito su gira mundial 'El Dorado World Tour', la gira llegará a España e… There’s nothing like seeing you so happy!!! Shak https://t.co/nJLVQ8rk8a Esto va a ser una gran fiesta cada noche! This is gonna be a big party every night! Shak https://t.co/gw225I75AU Dankeschoen Hamburg! I had one of the best times of my life! Gracias Hamburgo! He pasado uno de los momentos más increíbles de mi vida! Shak https://t.co/ajE57wnr3q @3gerardpique Yo también a ti!!! Gracias por ayudarme a superar estos meses difíciles!! ❤ Shak Yo también los amo. Shak https://t.co/ylxmYnKkw4 We did it!!!!  It felt like performing for the first time!!! Shak https://t.co/kpO5Q77bGT Gracias a Hamburg y gracias a mi equipo de mujeres extraordinarias, Jaime Levine, Maite Marcos, Nadine Eliya, Sofi Leclair, y a mi amigazo jaume de la Iguana! Shak https://t.co/HdhDYOtGtP 🎶S-O-S she is in disguise\nS-O-S she is in disguise\nThere's a she wolf in disguise\nComing out, coming out, coming out🎶 She Wolf \n#ShakiraHamburg \nShakHQ\n#ElDoradoWorldTour https://t.co/U7aKHipK9I Esta noche se la ofrezco a ustedes mis fans, mis amigos, mi familia y a Diosito por obrar tantos milagros en mi vida! Shak The doors are open! Las puertas ya están abiertas! #ShakiraHamburg ShakHQ https://t.co/TEshNRVit9 RT @Viber: Everything @shakira in one place. Only on @Viber 🎶 https://t.co/IuCkk7stHb 🚲🚲🚲 #ShakiraHamburg. ShakHQ https://t.co/pMueBKcRbG Guten Morgen Hamburg! I’m ready for my show tonight! Shak https://t.co/N3nAXOxkxP The new #ElDoradoWorldTour merchandise range is now available in Shak’s online store! Check it out at https://t.co/C7nrxSwiXR ShakHQ https://t.co/AhX3O535K2 Estoy Aquí #ShakiraHamburg ShakHQ #ElDoradoWorldTour https://t.co/YFhGLVuwB5 It’s finally here! The #ElDoradoWorldTour begins TOMORROW! Ya está aquí! #ElDoradoWorldTour empieza MAÑANA! ShakHQ https://t.co/yuaytoAPn2 Sign up to Shak’s official chatbot on @viber messenger to control the exclusive content you see from #ElDoradoWorldTour!\nhttps://t.co/b63AAspI8q / Sigan el chatbot oficial de Shak en la aplicación Viber para poder elegir qué contenidos exclusivos ver! \nShakHQ https://t.co/T5rm2ObONe 2 days! ✌2 días! #ElDoradoWorldTour ShakHQ https://t.co/xNhzcKkHc0 RT @Bkmonline: Konser için geri sayım başladı! #Shakira, 11 Temmuz'da Vodafone Park'ta 🤩⭐ Biletini tükenmeden al 🏃🏻‍♀🏃🏻‍♂\n\nBiletler 👉🏻 http… Ya llegó el momento! Shak #ElDoradoWorldTour https://t.co/6Bo153A5wK Three days to go! And there’s still time for pyro tweaks… 🚲🔥 Faltan tres días! Y aún hay tiempo para pulir la pirotecnia y los efectos especiales del show ...  🚲🔥#ElDoradoWorldTour ShakHQ https://t.co/9OHwARSAC4 RT @carlosvives: Hey! Vine a dar la sorpresa y la recibí yo! Gracias @sonymusiclatin muy especial! La bicicleta es Disco de Diamante💎 17x P… Tour rehearsals joyfully interrupted to celebrate the birthdays of Sarah and Sofia! 🎂 🎉Los ensayos de la gira fueron interrumpidos para celebrar el cumpleaños de Sara y Sofía! 🎂 🎉 ShakHQ #ElDoradoWorldTour https://t.co/qVlNsredJ5 Meet my band! Les presento a mi banda! Shak #ElDoradoWorldTour https://t.co/2rZMhgEy6W Best tour stuff I ever had! El mejor merch que he tenido nunca! Shak https://t.co/EiZmACJYWC Six days to go! Hands up who’s excited? #ElDoradoWorldTour \nFaltan 6 días! Que levante la mano quién esté emocionado! \nShakiraHQ https://t.co/ckvEuRwV2m Backstage visitors - Visitantes tras bambalinas! Shak https://t.co/SEJwX6VpLE A musical intermission with Shak's band... 7 days to show time! / Unos segundos musicales con la banda de Shak! Faltan 7 días para el show! ShakHQ https://t.co/1eJgePOtMT 🎶Y aprendí a quitarle al tiempo los segundos\nTú me hiciste ver el cielo aún más profundo\nJunto a ti creo que aumenté más de tres kilos\nCon tus tantos dulces besos repartidos 🎶 \n8 days to show time / faltan 8 días para el primer show. \nShakHQ https://t.co/dtvtuqT4Rl Gracias en letra mayúscula! Shak https://t.co/IEw0YoDE17 A Thank You in capitals! Shak https://t.co/xG7JR9qAUo We always really knew that she could dance like that... 😆Siempre sabíamos que ella podía bailar así...😆#ElDoradoWorldTour ShakHQ https://t.co/ZuLsH2lbEj My engineer trying to put my monitors pack, not an easy task!! Mi ingeniero tratando ajustarme mis monitores... Una tarea nada fácil!! Shak https://t.co/hjGzErO4Od RT @VogueParis: Shakira reprend \"Quelqu'un m'a dit\" de Carla Bruni sur une trottinette... Un moment délicieux à voir et écouter\nCrédit : In… @ADELAKANTOR @WorldShakifans Los quiero muuucho!!!  Shak @Mariana__Barb Eu amo a voces!!! 😘😘😘😘😘 Shak 12 days! / 12 días! #ElDoradoWorldTour ShakHQ https://t.co/VoVRJribfK RT @LiveNationES: ¡Nos morimos de ganas de verte en julio, @shakira! &lt;3 Consigue tus entradas en https://t.co/caEIv3StsI https://t.co/iz5nS… Con las entradas para el primer show agotadas, Shak acaba de anunciar una segunda fecha para el Estadio Azteca de la ciudad de México para el próximo 12 de Octubre! #ElDoradoWorldTour https://t.co/ppPCq0xulv https://t.co/g9MNEylkwh Due to incredible demand, Shak has announced a second Mexico City show for the #ElDoradoWorldTour, on 12 October! https://t.co/ppPCq0xulv ShakHQ https://t.co/XZ73W4fb0J Who can name the song Shak’s been working on in rehearsals today...? Adivinan qué canción Shakira ha preparado hoy en los ensayos...? ShakHQ #ElDoradoWorldTour https://t.co/5KGW1lzex9 Production Rehearsals Day 1: meet my amazing team! / Primer día de Ensayos de Producción: les presento a mi increíble equipo! Shak #ElDoradoWorldTour https://t.co/NOV7101Sy4 The new Shakira sticker pack is available for download, only on @Viber messenger! El nuevo pack de stickers de Shakira ya están disponibles en la aplicación de mensajería @viber! https://t.co/tCwRdKB1Mp  ShakHQ https://t.co/yI8UB40Xrv Some more unorthodox vocal warmups...created by yours truly / Más ejercicios para la voz menos tradicionales e inventados por mi! https://t.co/NzUou0mroR Vocal warmups with a side of silliness / Calentando la voz para los ensayos no sin antes hacer un poco el ridiculo https://t.co/XQG0OIL6gE Merengue mañanero! / Morning Merengue! Shak https://t.co/Q7wJuoh8j1 #TBT for London! I am so excited to be back with you on 11 June at @TheO2. #ElDoradoWorldTour / #tbt en Londres! Estoy muy feliz de volver este próximo 11 de Junio en el @TheO2! Shak https://t.co/wpcOn0j1oj Prepping my body for rehearsals / Preparando el cuerpo para ensayar Shak https://t.co/FII4ONc6WL Excited to see my band again! Muy feliz de ver a mi banda de nuevo! Shak https://t.co/fZ9SIPJ3jc On my way to rehearsals! De camino a los ensayos! Shak https://t.co/t6OVY4PYBQ Nuestros niños de la @fpiesdescalzos en Barcelona!! Shak #DesafioEmprende @FundlaCaixa https://t.co/WAnlaOimb9 RT @theirworld: Here’s the moment when our Global Youth Ambassadors handed over 1.5 million petition signatures to @antonioguterres👏 \nThey… A chill way to start my 3rd day of rehearsals: it’s french fry-day! Una manera relajada de empezar el tercer día de ensayos! Shak https://t.co/i1mSGncopC RT @theirworld: Education Commissioner @Shakira sends personal message of thanks to the inspirational youth activists &amp; campaigners who've… Day 2 of rehearsals: getting my feet ready! Día de 2 de ensayos! Así preparo mis pies! Shak https://t.co/vve2XLNiRI 🇲🇽🇩🇴🇧🇷🇦🇷🇨🇱🇪🇨🇨🇴! #ElDoradoWorldTour is coming your way in October / November! #ElDoradoWorldTour llegará en Octubre/Noviembre! ShakHQ https://t.co/OItQjJQxG0 25 days / días… #ElDoradoWorldTour https://t.co/JittSYXdQw Shak has just announced her first show in Turkey since 2007! She'll bring the #ElDoradoWorldTour to Istanbul on 11 July. Full info to follow! ShakHQ https://t.co/U3XtSj7mnK Debido a la gran demanda, Shak acaba de añadir una segunda fecha de su #ElDoradoWorldTour en el @theforum de LA el 29 de Agosto. Boletos salen a la venta este viernes 5/11 a las 10am. https://t.co/ETHKu24kMU ShakHQ https://t.co/30vri1xphz Due to phenomenal demand, Shak has added a second #ElDoradoWorldTour show at the LA @theforum on August 29. Tickets on sale Friday, 5/11 at 10am https://t.co/ETHKu24kMU ShakHQ https://t.co/QCr7bsLIYk Feliz Día de la Madre! Happy Mother's Day! https://t.co/9jCpXLP9hE\nShakHQ https://t.co/0mPVLSZ30H This Mother’s Day, it’s my wish that all moms get the support they need. March of Dimes supports moms throughout every stage of the pregnancy journey, even when things don’t go according to plan. Learn more: https://t.co/ZRau34FXep. #MODwontstop #MothersDay 30 días hasta el primer show, la cuenta regresiva empieza ahora! 30 days until showtime - countdown starts now! Shak #ElDoradoWorldTour https://t.co/4IqeJPrnDw Con mi paisano Yerry Mina! Shak https://t.co/kpB3lSTFud RT @EAA_Foundation: #ItIsPossible 📚🍏✏️\n\n@Shakira @RogerFederer @RogerFedererFdn @ForestWhitaker @DMiliband @AlistairBurtUK https://t.co/nkF… Sasha photobombing @andresiniesta8! Shak https://t.co/USUsI2bSWX Qué lindo es despertar con la noticia de haber ganado CINCO Premios Latin Billboard de doce nominaciones! Gracias a ustedes, mis fans, por hacer que cada minuto de mi vida y de mi carrera valga la pena. Ustedes son definitivamente uno de los más grandes regalos que he recibido. Woke up to the amazing news that we've won FIVE Latin Billboard Awards out of 12 nominations! Just incredible. I love my fans so much for making every minute of my life and my career worth it. You're one of the greatest gifts. Thank you all. Shak Damn, I wish I’d worn a hat for this one too! Ojalá hubiera llevado yo también un sombrero en esta foto! Shak https://t.co/bEmaP0OXOv RT @billboardlatin: .@Shakira and @Maluma talk touring, kids, soccer, life advice &amp; more: watch https://t.co/URYihx9sB1 https://t.co/02xP7B… RT @billboard: Check out all the photos from @Shakira &amp; @Maluma's Billboard cover shoot 📸 https://t.co/gZdvp8tdqE https://t.co/726wTkK380 Damn I look tall in this photo! Uy! Parezco súper alta en esta foto! Shak https://t.co/fNZYdUgqyq RT @leilacobo: Check out our Badass @billboard cover story! @Shakira &amp; @Maluma on Their 'Absolute Chemistry' &amp; the New Latin Explosion http… RT @billboard: .@Shakira &amp; @Maluma on their \"absolute chemistry\" &amp; the new Latin explosion https://t.co/1jeCqRtmzk https://t.co/U1JvNj7RHq Shak and @Maluma are the cover stars of @Billboard’s new Latin Music Issue! Read the interview: https://t.co/eu2miqVPzz Shak y Maluma en la portada de la revista Billboard!  ShakHQ https://t.co/IyM2Ae3W5i RT @UNICEF: Our Goodwill Ambassador @shakira on why #EarlyMomentsMatter. https://t.co/leSZG7elPw El Dorado has been nominated for Top Latin Album at this year's @Billboard Music Awards!  #BBMAs / El Dorado ha sido nominado en la categoría de Top Latin Album en los @BBMAs! ShakHQ https://t.co/YfYjVGl3tl RT @BBMAs: &lt;Top Latin Album Nominees&gt;\n_ @NickyJamPR [Fénix]\n_ @_christiannodal [Me Dejé Llevar]\n_ Ozuna [Odisea]\n_ @RomeoSantosPage [Golden… Great to see She Wolf added to @Spotify's #ThrowbackThursday playlist today! Que bueno ver She Wolf hoy en el playlist #ThrowbackThursday de Spotify! Aaaauuuuuu! 🐺 ShakHQ https://t.co/mVub9aj1O5 It’s a red and Black day! Shak https://t.co/i1yHPauhBw RT @3gerardpique: Gran nit al Camp Nou. 👌 #BarçaRoma https://t.co/BZVJBJBwnh Staring at the sun. Shak https://t.co/0IHegD3HSw Happy Easter painting Easter eggs! Shak https://t.co/ST5MRrXyR1 ...also sharing some laughs with @TheAnnaKaiser @AKTINMOTION! Shak https://t.co/my9n1UfAth Working hard with @TheAnnaKaiser @AKTINMOTION! Shak https://t.co/RJGcdGUclC Ready for my closeup! Shak https://t.co/d56P7g2zLx https://t.co/QbuaUiCiVg Thanks for keeping my head above water on this shoot @jaumedelaiguana! Shak https://t.co/lbqmPOrGo4 A one of a kind jacuzzi! Un jacuzzi único! Shak https://t.co/d56P7g2zLx https://t.co/HKyNI2wBoq Not as comfortable as it looks! No es tan cómodo cómo parece! Shak #TrapVideo https://t.co/d56P7g2zLx https://t.co/7A8KjtgfML El Dorado was named Latin Album of the Year at last night’s @iHeartRadio Music Awards! / El Dorado ganó anoche el Premio Álbum Latino del Año en los Premios #iHeartAwards2018!\nShakHQ https://t.co/DnIQ7lks13 Want to be a #FlyOnTheWall during the #Trap video shoot? Over the next few posts I’ll show you how we made the magic! Let’s start with this one: first challenge was to make sure my makeup was waterproof! 💄Shak\nhttps://t.co/d56P7g2zLx https://t.co/jQdywVBjMt By sending a girl to school, she is far more likely to ensure that her children also receive an education. Investing in a girl’s education is investing in a nation. #IWD2018, #TimeIsNow #GlobalGoals It’s International Women’s Day!\nAn African proverb says, “If we educate a boy, we educate one person. If we educate a girl, we educate a family – and a whole nation.” https://t.co/mD31cTZ6DH Check out our GIFs from Shak's Trap video with @Maluma over on her official @Giphy page - https://t.co/ySvRRWNFNP / En el perfil oficial de Shak en @GIPHY encontrarán los GIFs del video de Trap con Maluma!  ShakHQ https://t.co/t7yqEMCC8p Happy Birthday @EmilioEstefanJr, love Shak 🎂🎉🍾 Happy birthday Chris, and thanks for being there for me when I needed you! https://t.co/b6QpWVXZ95 RT @SomosVevo: .@Shakira y @maluma son los #1 en el top 10 Latin de Vevo esta semana! https://t.co/jgAckC1PKf https://t.co/2mdOmUFzOg It’s exactly 100 days until the #ElDoradoWorldTour begins in Hamburg on June 3! Who’s coming? \nHoy faltan exactamente 100 días para que empiece #ElDoradoWorldTour en Hamburgo el 3 de Junio! Quién viene? \nInfo / tickets https://t.co/ppPCq0xulv ShakHQ https://t.co/2JWXWOR8d7 Flashback to 2007 when Shak performed \"Día Especial\" with @cerati at the Live Earth concert in Hamburg (the same city where the #ElDoradoWorldTour kicks off on June 3rd). \n#TBT ShakHQ https://t.co/c10vWvCcn1 Hoy recordamos esta actuación de Shakira y @cerati en el concierto Live Earth que se celebró en Hamburgo en el 2007 donde interpretaron \"Día Especial\" (la gira de #ElDoradoWorldTour empezará en esta misma ciudad el 3 de Junio!)\n#TBT ShakHQ https://t.co/PfCyh16qhB Check out this amazing footage of Shak singing Trap in the studio with @Maluma last year! No se pierdan este video de Shak y Maluma cantando Trap en el estudio! ShakHQ https://t.co/4EvcBnKTYv Happy Valentine’s day! Feliz día de San Valentín! https://t.co/faS3434zhY ShakHQ https://t.co/wepQPHvCBg https://t.co/DJjqabHKtA The video for Shak’s new single Trap ft @maluma just hit 50m views! Thanks guys! / El video del nuevo sencillo de Shak con Maluma, Trap, ya tiene más de 50 millones de reproducciones! Muchas gracias! ShakHQ\nhttps://t.co/d56P7g2zLx Discover Rock The Night, the new masculine fragrance by Shak!\nDescubran Rock The Night, la nueva fragancia masculina de Shak\nShakHQ https://t.co/fyAdZEQdso … and now for the boys! Here’s Rock The Night, my first masculine fragrance! … Y ahora para los chicos! Aquí está Rock The Night, mi primera fragancia masculina! Shak https://t.co/jhTD7yK9Gs Training with mom! https://t.co/wa7d29dDJy #TBT cuando Shakira actuó el el Global Citizen Festival que se celebró en el @BcardArenaHH de Hamburgo el pasado mes de julio - el mismo lugar donde empezará #ElDoradoWorldTour este mes de junio (https://t.co/xxx6EKgo50)! ShakHQ https://t.co/gHsuTOV9ux #TBT to when Shak performed at July’s Global Citizen Festival in Hamburg’s @BcardArenaHH - the very same venue where she’s kicking off her #ElDoradoWorldTour in June (https://t.co/ppPCq0xulv)! ShakHQ https://t.co/BRGMdXkiM5 En la cafetería del cole de mis hijos. “Chilling” Para esto sirve el café https://t.co/aSi8PXXVbj Thanks for these 12 nominations for the @LatinBillboards Awards! Gracias por estas 12 nominaciones a los Premios Billboard Latino! Shak https://t.co/M85FmVSpqp This is hilarious! Shak https://t.co/rauq5MEbD7 Sunday vibes! Shak https://t.co/khLMe73MxV Para mis fans que “nunca me dejan caer tan bajo, me levantan”. Shak https://t.co/Q9SMWLg2GA El cumple es siempre una buena excusa para estar con los amigos más queridos!! Shak https://t.co/9395qxggGV Gracias a todos por sus mensajes tan cariñosos en este día! Los quiero!! Thank you guys for all your affectionate messages today! Love you!! Shak 🎶Y si firmo el contrato, contigo quiero repetir🎶 \n#tbt to when Shakira and @maluma recorded Trap last year/ \nUn #tbt de cuando Shakira y Maluma grabaron Trap el año pasado! ShakHQ https://t.co/HRELXONEfF RT @LiveNation: .@shakira's #ElDoradoTour is one show you #MustSeeLive!\n\nGrab your tickets here: https://t.co/RgKb5rvNcI https://t.co/uCXLB… \"Con Trap estábamos todos como sumergidos, debajo del agua, en trance absoluto\". De esta manera Shakira definió el proceso de creación de Trap con @maluma (No se pierdan el nuevo video que pueden ver aquí https://t.co/JBvA4OHtlE)\nShakHQ https://t.co/2eCxoziuxU “We were all submerged, underwater in this complete trance!” Here’s Shakira and @maluma chatting about the making of the new Trap video. (And watch the finished video at https://t.co/JBvA4OHtlE) ShakHQ https://t.co/KMyurdfl7I RT @Vevo_Brasil: Depois de “Chantaje”, @Shakira e @Maluma se uniram mais uma vez, agora para a faixa “Trap”. O clipe, só pra variar, nos dá… https://t.co/LT6PrcbVAb Celebrating the Grammy! / Celebrando el Grammy! Shak https://t.co/53csXcDZs0 Happy birthday @maluma! I hope you are celebrating with some trap! \nFeliz cumple Maluma Espero que estés celebrando con algo de trap! \nhttps://t.co/d56P7g2zLx Gracias por este Grammy\n#GRAMMYs https://t.co/pEFHdpJNFu Thank you for this Grammy\n#GRAMMYs https://t.co/tth4lZeMRZ RT @RecordingAcad: Congrats Best Latin Pop Album - 'El Dorado' @shakira #GRAMMYs Wow, the new Trap video ft @maluma has had 13m views in two days! Incredible. Thanks everyone. Increíble! El nuevo video de Trap con Maluma ha tenido 13m de reproducciones en 2 días! Muchas gracias! ShakHQ https://t.co/d56P7g2zLx RT @maluma: https://t.co/ZmgMCDeCaz https://t.co/KACSVHmCBh RT @Vevo: .@Shakira drops a steamy video for her first latin \"Trap\" record ft. @Maluma. Watch now: https://t.co/OoPjLJ3n5E https://t.co/6tH… Thanks for making my new Trap video with @maluma the #1 trending video on YouTube! Gracias por hacer mi nuevo video Trap con Maluma el número uno en YouTube! Shak https://t.co/JBvA4OHtlE https://t.co/QZGJvdWMrv RT @youtubemusic: .@shakira &amp; @maluma turn up the heat in their new collab Trap → https://t.co/TCKv74iVPP https://t.co/BM1JbGaerB RT @AppleMusicES: Subiendo la temperatura en 3, 2, 1… 🌡\n@shakira + @Maluma\n#Trap\nhttps://t.co/xMYF7P0aBr RT @maluma: https://t.co/ZmgMCDwd27 RT @Vevo: .@Shakira drops a steamy video for her first latin \"Trap\" record ft. @Maluma. Watch now: https://t.co/OoPjLJ3n5E https://t.co/61g… RT @SomosVevo: .@shakira se lanza al latin \"Trap\" con su nuevo video ft @Maluma. 🔥 🔥 https://t.co/I3OtxyASWY https://t.co/KEFo7sHJ3X RT @billboardlatin: .@Shakira and @Maluma Turn Up the Heat in New Video 'Trap': Watch https://t.co/x96LnJ002C Ya está aquí! Here it is! Trap ft @Maluma. https://t.co/d56P7g2zLx #TrapVideo Tickets’s for Shak’s new shows in London, Hamburg &amp; Bordeaux are on sale now! Ya a la venta las entradas  para los nuevos conciertos de Shakira en Londres, Hamburgo y Burdeos! -&gt; https://t.co/qpGqaYfuiT ShakHQ https://t.co/qebdUWMiKH Mañana / tomorrow. 9am EST #TrapVideo @maluma https://t.co/EFYe1T1LbG https://t.co/0retAuYFjK https://t.co/WN2glR9A0H ~ The @Viber presale for Shak’s Hamburg, London &amp; Bordeaux shows is open now! Click https://t.co/TY5N2VWHGz to get your code.\n~ La preventa en Viber para los shows de Shak en Hamburgo, Londres y Burdeos ya ha empezado. Aquí https://t.co/TY5N2VWHGz encontrarán su código.\nShakHQ https://t.co/vUGUSuNNsi Shak acaba de añadir nuevas fechas en Hamburgo, Londres y Burdeos en la gira de #ElDoradoWorldTour este verano. La venta general empieza este Viernes pero si siguen a Shakira en @viber (https://t.co/LIYdZQAqxD) tendrán acceso a pre-venta a partir de mañana! ShakHQ https://t.co/pZsBhdHioO TOUR NEWS! Shak just added new dates in Hamburg, London &amp; Bordeaux to the European leg of her #ElDoradoWorldTour this summer. Tickets go on sale on Friday, but follow Shak on @Viber now at https://t.co/LIYdZQAqxD for exclusive presale access tomorrow! ShakHQ https://t.co/esjJlhY8YW This album is as much yours as it is mine-thanks for the love / Este álbum es tan mío como de uds, gracias por tanto cariño! Shak \nhttps://t.co/xFOFrELtJ0 Con muchas ganas de hacer lo mismo en Colombia con la población vulnerable! Shak  @fundaciobrugada https://t.co/QCKPfcN9lP What a nice way to start the new year knowing of all the great support you’ve all given me!! Love u so much! / Qué manera de empezar el año, sabiendo del inmenso apoyo que me han dado! Los quiero muuucho! Shak https://t.co/Q8JIL8AZPw Gracias a mi club de fans en Barranquilla por entregar regalos en nombre de la @fpiesdescalzos a los niños desfavorecidos. Shak https://t.co/6WjzGFQjhX Deseo que sus deseos se hagan realidad y que el 2018 traiga todo el amor y la paz a sus vidas! Shak https://t.co/DPvADUHf26 At the airport in NYC. Saying hi to my amazing NY fans. Shak https://t.co/fc2xjVmFFy Check out Shak’s incredible end of year @Spotify stats! Thanks to you all for the amazing support / No se pierdan este increíble resumen del año 2017 de Shak en Spotify! Muchas gracias a todos por su apoyo.\nShakHQ https://t.co/dWCK2gdG0x RT @AccorH_Arena: 😍😍😍 #ANNONCE 📢 C'est officiel ! Les nouvelles dates des #concerts de @shakira sont annoncées ! Les deux concerts prévus l… RT @LiveNation: RESCHEDULED DATES have been announced for @shakira’s\n#ElDoradoWorldTour. Get more info here. https://t.co/gdMWbzCuw2 RT @LiveNationES: ¡Se confirman las nuevas fechas para la gira de @shakira! 30 de junio en Bilbao, 1 de julio en A Coruña, 3 de julio en Ma… https://t.co/WhuAZOQKAK Check out the new @costacrociere commercial, featuring Shak! No se pierdan el nuevo anuncio de @costacruceros con Shak! #shakiraonboard #felicitaalquadrato ShakHQ https://t.co/WaLzcg6k32 RT @costacrociere: Il nuovo spot è finalmente online! Parla di felicità e del suo significato per @shakira. Ma cos'è per voi la felicità? R… RT @costacruceros: Ya puedes ver en Internet nuestro nuevo spot publicitario sobre la felicidad y lo que significa para @shakira. ¿Y para t… Felices fiestas para ustedes, los mejores fans del mundo!  \nEl apoyo y el amor que me han transmitido estos últimos meses ha sido un verdadero motor! \nEn los próximos días tendré más noticias sobre mi gira, hasta  entonces, les deseo mucha paz y una muy feliz navidad! Shak https://t.co/FttYkDg8D7 Happy holidays to the best fans any artist could hope for. The love you guys have shown me over the last few months has been my rock! \nI should have more news on the tour to give you in the next few days. Until then, sending love and peace to you and yours.\nMerry Christmas! Shak https://t.co/OXqm7LtycL My first self baked gingerbread man cookie! My house now smells like cinnamon, ginger, and sugar! Shak https://t.co/LO9dihRjLm Happy Holidays! Felices Fiestas! https://t.co/faS3434zhY \nShakHQ https://t.co/Cof0VpKOFU Felicitaciones Dayana de Barranquilla por tu medalla de Oro en el campeonato Suramericano de Patinaje y a Ricardo de Cartagena por el reconocimiento de Pilo Pago! Shak @fpiesdescalzos https://t.co/QIzopHcTTj Shak has been named as the most-streamed Latin female on @Spotify in 2017! Thanks for all the listening, guys! 🎧🏆 / Shak es la artista latina femenina con más reproducciones en Spotify en 2017! Muchas gracias por escucharla! 🎧🏆 \nShakHQ https://t.co/OAM6MeHn5E Hoy escuchando al Joe y el piano de Chelito De Castro con nostalgia de mi tierra. Shak https://t.co/mEXJ8vkqKi Cosa guapa con botas. Shak https://t.co/EPYNxFjQoL Wow, the Chantaje video reached TWO BILLION views! El video de Chantaje ya tiene más de 2 MIL MILLONES de reproducciones! Thank you! Gracias! https://t.co/hF1MESxQUR ShakHQ Thanks to all of you for making that Latin Grammy win a reality and this nomination for an American Grammy possible! It's all because of you!! Shak https://t.co/qMHlQKC3va Gracias por hacer realidad ese Grammy latino y esta nominación de hoy al Grammy americano! Todo se los debo a ustedes!! Los quiero mucho! Shak https://t.co/zMpvS5tKYw El Dorado, después de ganar en la categoría de Mejor Álbum Vocal Pop Contemporáneo en los #LatinGrammys acaba de recibir la nominación de Mejor Álbum Latino Pop en los  🇺🇸 #GRAMMYs! ShakHQ https://t.co/Es3muVxrTz After winning best Best Contemporary Pop Vocal Album at the #LatinGrammys, El Dorado just scored a 🇺🇸 #GRAMMYs nomination for Best Latin Pop Album! ShakHQ https://t.co/EssIoZAbhh Eu tamben te amo Brasil! Shak https://t.co/tbqoRdJwxy Our children.\nOur future.\nThis #WorldChildrensDay, join @UNICEF to make children’s voices heard across the 🌎 → https://t.co/mvHKqB6VSe ShakHQ Feeling your loss my dear friend Azzedine, wherever you are now, your love and your ingenious legacy will always be with us, with me. I will miss you so much. Shak https://t.co/PIEJgpUe01 @juanes Gracias Juanes! Shak Ustedes son mi más grande incentivo. Y cuando cante otra vez para ustedes querré que no acabe jamás! Shak https://t.co/ACkZIEqgsq RT @ShakiraRNR: @shakira cuentas con nosotros. Es deseo, promesa y ganas. Y yo cuento contigo y tu música para que sepas tomar mi mano si l… Quiero felicitar a mi amigo @AlejandroSanz por ser la Persona del Año esta noche en los @LatinGRAMMYs @Univision. Para mí es el amigo del año y de todos los años, y un talento al que ningún otro se compara! Te quiero mucho Ale! Gracias por darnos tanto!!! Shak Los quiero tanto! Gracias por ser mi apoyo. Shak https://t.co/hSmZCDDT1V https://t.co/jUTgDMfnKj https://t.co/L7Sk6jm1dQ Message from Shakira re the Cologne show / Nota de Shakira sobre el show de Colonia. https://t.co/p67cdWQlmq ShakHQ #ElDoradoWorldTour #5days #5días ShakHQ https://t.co/RrqdU1d0SL RT @MovimientoALAS: Don't miss this unique event organized with @BIDeducacion! Join us on Nov. 9 in Washington or watch it online https://t… Ensayos generales / full-production rehearsal! Shak https://t.co/RwFIlYrUJZ #ElDoradoWorldTour empieza este MES! Aquí les mostramos cómo van los ensayos... ShakHQ https://t.co/KHjdt9bLaw The El Dorado World Tour starts THIS MONTH! Here’s our latest look at rehearsals… ShakHQ https://t.co/TBj0h1dQDj #MeetTheBand @Mit_C_Hell_ (guitar), @BrendanDrums (drums), @sterlinblu (keys), @caitlinbird (strings) &amp; @erikkertes (bass) ShakHQ https://t.co/tnBSnWAh35 RT @SEDBarranquilla: Felicitaciones a nuestra estudiante de la IED Pies Descalzos, Dayana Diaz; obtuvo medalla de oro en el Nacional de Pat… Sale El Sol es el video número VEINTE que consigue más de 100 millones de reproducciones! Increíble! Muchas gracias! ShakHQ https://t.co/Tw8QdtNMba Sale El Sol has just become Shak’s TWENTIETH video to reach 100m views! Amazing. Thanks guys! ShakHQ https://t.co/nB0LCoIux9 #EDoradoWorldTour rehearsals/ensayos. 13 days / días! ShakHQ https://t.co/DWdExYUqp1 Adjourned meeting with my super team at 3 am! / En reunión con mi equipo a las 3 am! Shak https://t.co/T6vMICRfYD ✈ Aún están a tiempo para ganar un viaje a París y conocer a Shakira! Participen aquí @Viber 👉 https://t.co/ip9Rd58s1x ShakHQ https://t.co/zB9UlIt9G7 ✈ Still time to win a trip to Paris &amp; meet Shakira! Enter here @Viber 👉 https://t.co/ip9Rd58s1x\nShakHQ https://t.co/a8TWIyLczL RT @FundlaCaixa: .@shakira nos cuenta la importancia de la educación para un futuro mejor. Descúbrelo en ALMA, #laredsocialsocial https://t… RT @LiveNation: 🎶 Me enamoré 🎶\n \n@Shakira…#ElDoradoWorldTour. No te la pierdas en vivo -&gt; https://t.co/93dT4KYFCy https://t.co/hJzyGaM1Oy Let's go! Vamos! 14 días/days! #ElDoradoWorldTour ShakHQ https://t.co/GGbp9dtI8x RT @costacruceros: ¿Quieres ganar entradas para ver a @Shakira? Solo tienes que adivinar los dígitos del código e insertarlos aquí https://… Envíen un tweet con @shakira + Favorite Artist Latin + #AMAs para votar por Shakira en los @AMAs! (o hagan RT a este tweet) ShakHQ https://t.co/PQwfdxj3K3 Tweet @shakira + Favorite Artist Latin + #AMAs or RT this tweet to vote for Shak at the @AMAs! (Then watch LIVE 11/19 at 8/7c on ABC) ShakHQ https://t.co/Q9qTBQsI47 RT @AAarena: We just can’t get enough of @shakira! 💃\n\n✌️ shows right here in Miami, January 12th AND 13th! Tickets on sale Friday, 10/27. h… #ElDoradoWorldTour #16days #16días ShakHQ https://t.co/1KKUl1HYT5 Who says you can't have fun while working hard? / Quién dice que no se puede pasarlo bien mientras se trabaja duro? Shak https://t.co/Ra4w7cZIOy ✈ Ganen un viaje a París y conozcan a Shakira! Ingresen aquí @Viber  👉 https://t.co/ip9Rd58s1x ShakHQ https://t.co/QEOxBT9rc1 ✈ Win a trip to Paris &amp; meet Shakira! Enter here @Viber 👉 https://t.co/ip9Rd58s1x\nShakHQ https://t.co/jVKsHH4sGj Playing with my vocoder toy! Shak https://t.co/1S9WTZrqrE This song makes me move! Cómo me hace bailar esta canción! Shak https://t.co/4JrTmDcWoY #ElDoradoWorldTour #21days #21días ShakHQ https://t.co/xjMzrdd6Iy I ordered these online! Shak https://t.co/m2e1JP8B6x Aún hay tiempo para terminar la encuesta en @viber y ganar viaje a Barcelona para ver un ensayo de la gira! https://t.co/ip9Rd58s1x ShakHQ https://t.co/zxHuBb26tF Still time to complete the poll in Shak’s @Viber chatbot for chance to fly to Barcelona for tour rehearsals! https://t.co/ip9Rd58s1x ShakHQ https://t.co/aCzfNuP9lz Comprando máscaras! Pronto sabrán por qué! #ElDoradoWorldTour! Shak https://t.co/Fd0Z5tUcSw RT @LqdviCol: Gracias a todos los que ya fueron a ver la peli y aportaron su granito de arena, sabemos que les encantó y no podría alegrarn… My glam team doubling as dancers for my tour. What do you guys think? Hired?? Shak https://t.co/ssPmCERNGC Empieza el primer reto en @viber! El ganador viajará a Barcelona y verá un ensayo de la gira de Shakira! https://t.co/ip9Rd58s1x ShakHQ https://t.co/xPmZeE3Zk5 Check out our challenge in Shak’s chatbot on @viber for the chance to fly to Barcelona to see tour rehearsals! https://t.co/ip9Rd58s1x SHQ https://t.co/8vLUpvmTgC Shakira está nominada en la categoría de Favorite Latin Artist en los @AMAs ! Pueden votar aquí https://t.co/9FEvhdTol9. Gracias! ShakHQ https://t.co/atVeM9Bjs2 RT @PalauSantJordi: Ya a la venta las entradas para el 2ndo concierto de @SHAKIRA del 26 de noviembre en @livenationES @ticketmasterES @ElC… Shakira's been nominated for Favorite Latin Artist at the @AMAs! You can vote at https://t.co/9FEvhdTol9. Thanks! ShakHQ https://t.co/Wrzx8Gu40j Planeando el orden de canciones, sumergida en mis pensamientos / Planning the set list submerged in my thoughts. Shak https://t.co/x7NcAqMlA9 RT @UNICEF: Happy International #DayoftheGirl! \n\nEvery girl has the right to choose and shape her own future. RT if you agree. https://t.co… RT @UNICEF: Today a reader, tomorrow a leader.\n\n#FreedomForGirls is education.\n\n#DayoftheGirl https://t.co/xF14KleAjf Muy pronto podrán conseguir premios increíbles de #ElDoradoWorldTour en la aplicación de mensajería de @Viber https://t.co/pfoTMT71n1 ShakHQ https://t.co/ntsOLjUhP1 Amazing #ElDoradoWorldTour prizes coming very soon on the @Viber messenger app... https://t.co/pfoTMT71n1 ShakHQ https://t.co/vUeLMF92zO When one of your musical icons does a cover of your song 😍 ! Cuando uno de tus iconos musicales hace una versión de tu canción 😍! Shak https://t.co/FrtIixSfpN Apresentamos Dance Diamonds! Uma fragrancia fresca, sensual e vibrante! Descubra todos os detalhes aqui: https://t.co/kCyaQ2peAc ShakHQ https://t.co/JE0CIn23qJ Te presentamos Dance Diamonds! Una fragancia fresca, sensual y vibrante! Descubre todos los detalles aquí https://t.co/TdEahZ1Vwx. ShakHQ https://t.co/qTSGUAO2ZO #ElDoradoWorldTour #Rehearsals #30days ShakHQ https://t.co/rTWjStPyi7 En un mes empezará #ElDoradoWorldTour! \nEn este video Shak les muestra cómo trabaja en la creación de su próxima gira...  ShakHQ https://t.co/ppZ4xSR46P Just one month until  #ElDoradoWorldTour begins! Check out Shak’s inspiration boards...\nShakHQ https://t.co/MPeqt4OSfd Consulting my son Sasha about my tour ideas! Shak https://t.co/BoVcSO1w7s Una pequeña pausa en mi día para cantar una canción de amor! / A little pause in my day to sing a love song! Shak https://t.co/7PDQiuRBYx Yes this feels good! Shak #ElDoradoWorldTour #Rehearsals https://t.co/7DmUIqIOt0 RT @costacruceros: Hemos embarcado el ladrillo que Costa y la @fpiesdescalzos de @shakira utilizarán para construir una escuela en Colombia… It's time to recognize successful experiences in #EarlyChildhood! Don't miss the #ALASIDBAwards on Nov 9 @MorenoBID https://t.co/X6iQvZkL5s Llegó el momento de premiar experiencias exitosas en #PrimeraInfancia! No te pierdas los #PremiosALASBID @MorenoBID https://t.co/X6iQvZkL5s Muchas felicidades @KathyKopp y Fernando en este día tan especial!!!! Shak https://t.co/Dde0iz5QgQ @costacrociere @fpiesdescalzos Shakira presentó colaboración con @costacruceros que implica construcción de una nueva escuela de la @fpiesdescalzos en Colombia! ShakHQ https://t.co/pO04vkUItd Here's Shakira launching an incredible collaboration between @costacrociere and @fpiesdescalzos to build a new school in Colombia! ShakHQ https://t.co/L2rBLNX10t 5:30 am here and just finished my work day! Shak https://t.co/6m5kb7H5Fd RT @fpiesdescalzos: Se estrena en Colombia la peli que donará sus fondos a niños vulnerables. ¡Compra tu boleta y regala una sonrisa!-&gt; htt… RT @fpiesdescalzos: Brick by Brick we are building a new school in Cartagena! Thank you @costacrociere https://t.co/YVMhH6ztkY #BuildingHap… RT @fpiesdescalzos: Ladrillo a ladrillo construimos un nuevo sueño con @costacruceros! Una nueva escuela en Cartagena https://t.co/YVMhH6zt… Crunch time! Shak @TheAnnaKaiser @AKTINMOTION https://t.co/LC09SNbqri Proud to be a judge of the #DesafíoGoogleOrg. This is your chance to help. Your vote will make a difference! ➡️ https://t.co/djj8440SCq Shak https://t.co/M8xrV4KXON Orgullosa de ser jurado en el #DesafíoGoogleOrg! Tú también puedes ayudar votando por tu ONG favorita! ➡️ https://t.co/djj8440SCq Shak https://t.co/UNw3gFda3D RT @fpiesdescalzos: ¡Sumémonos todos! https://t.co/okadSMrRJT RT @LqdviCol: Es nuestro turno de ayudar, #LoQueDeVerdadImporta  ¡Danos RT y ayúdanos a que todo el mundo conozca este maravilloso proyecto… Esta es la historia de mi vida. Pensando en ideas para mi gira pero mi equipo ni me escucha! 🙄\nShak https://t.co/99otnOahE1 This is how crazy my life is! I'm thinking of ideas for my show but my team is not listening to me! 🙄 Shak https://t.co/VxYKnRbiXU Gracias a todos por hacer posibles estas nominaciones! Shak https://t.co/ediAuzrNrM Estoy feliz de anunciarles los nominados al @LatinGRAMMYs en la categoría de Mejor Nuevo Artista. Felicidades a todos los nominados! Shak https://t.co/NAU7XvtB5j So pleased to announce this year's nominees for Best New Artist at the @LatinGRAMMYs! Good luck to all the nominees! \nShak #LatinGrammy! https://t.co/gQdXnSiWgY The #ElDoradoWorldTour is getting close! Shak is going to give you an insight into her creative process… #staytuned ShakHQ https://t.co/3gytiI2Ep9 La gira de El Dorado World Tour se acerca! Shak va a mostrarles en los próximos días cómo es su proceso creativo... \nShakHQ https://t.co/u6KQzibFrl @LatinGRAMMYs Mañana a las 10am ET, Shak anunciará los nominados a Mejor Nuevo Artista en los #LatinGRAMMY! \nShakHQ @LatinGRAMMYs https://t.co/CtR7YiFVO5 Tomorrow at 10am ET, Shak will announce the nominations for Best New Artist at the @LatinGRAMMYs! ShakHQ  \n#LatinGRAMMY https://t.co/cHUjdqBpag RT @LatinGRAMMYs: #LatinGRAMMY Nominations 🎶👏👏 Who do you think will be nominated? TOMORROW 7AM PT/10AM ET https://t.co/GZ5pQRpTXC RT @LatinGRAMMYs: Nominaciones al #LatinGRAMMY ¿Quién crees que va estar nominado? MAÑANA 7AM PT/10AM ET https://t.co/cPsjil6Bp1 #PerroFielVideo The dirt bike riders in the video include champion Spanish rider Ferran Cardús! https://t.co/Rea9hrqPqt ShakHQ https://t.co/hf3NMrFTwy #PerroFielVideo Los motociclistas en el vídeo de Perro Fiel incluyen el campeón de España Ferran Cardús! ShakHQ https://t.co/Rea9hrqPqt https://t.co/ORlx0PBYA8 RT @Univision: Esta noche todos #UnidosPorLosNuestros para ayudar a las víctimas de los desastres naturales recientes. #Harvey #Irma #Maria… Vean un video en exclusiva del encuentro de Shak con @itsdougthepug en el chat público de Shakira en @Viber! https://t.co/9fgvPgkW1l ShakHQ https://t.co/AJ8ruTPAgy Check out an exclusive video from when Shak met @itsdougthepug, over on her Public chat on the @Viber messenger app! ShakHQ https://t.co/AJ8ruTPAgy RT @Trevornoah: Don't act like you've ever seen @shakira rapping Wu Tang before. Click the link and enjoy. https://t.co/UnWvAUyhHn One week, 33m plays. Thanks everyone! /En una semana, 33 millones de reproducciones. Gracias! #PerroFielVideo ShakHQ https://t.co/Rea9hrqPqt RT @AppleMusic: Whenever, wherever,\n@shakira &amp; @Trevornoah were meant to be together.\nNew @CarpoolKaraoke out now on Apple Music.\nhttps://t… RT @CarpoolKaraoke: .@trevornoah had juuuust a few questions during his #CarpoolKaraoke with @Shakira. Watch their episode now at https://t… No se pierdan este nuevo episodio de #CarpoolKaraoke con Shak y @trevornoah grabado en Barcelona! https://t.co/QttajFyYkw ShakHQ @AppleMusic https://t.co/4URxODluIt Check out Shak’s new @CarpoolKaraoke with @trevornoah, filmed in and around Barcelona! https://t.co/QttajFyYkw ShakHQ @AppleMusic https://t.co/dd1aRhSqMW Muy triste por esta terrible tragedia en México. Si deseas brindar tu ayuda, visita https://t.co/rF4McJnlxO Shak @UNICEFenEspanol https://t.co/SKMWmlrdEK RT @LatinGRAMMYs: https://t.co/swe0kf6tYv RT @CarpoolKaraoke: It's #CarpoolKaraoke day! Catch @shakira with @Trevornoah and @TraceeEllisRoss with @BigSean tonight at 9pm ET, only on… Este sobre de los @LatinGrammys hará  a varios artistas muy felices mañana a las  7amPT cuando revelo los nominados a Mejor Nuevo Artista! https://t.co/9EUKoHbgWu This @LatinGRAMMYs envelope will make  some artists very happy tomorrow at 7am PT when I announce Nominees for Best New Artist #LatinGRAMMY https://t.co/KqAtXL33KB RT @itsdougthepug: Ooh baby when u talk like that, u make a puggy go mad\n\nDoug had a great time w/ @shakira in Barcelona celebrating the re… @itsdougthepug Querido @itsdougthepug , tienes mejores modales que muchas de mis visitas 😂, por favor ven a visitarme más a menudo! Eres todo un #perrofiel https://t.co/Utm3iQ64m3 Dear @itsdougthepug, you have better manners than most of my visitors 😂, please come see me more often! You're such a good #perrofiel ! Shak https://t.co/bvjAbbv8VY Después de un año con \"Chantaje\" y 1.8 billones de visitas! Deseándole a @maluma buena suerte esta noche en el Palau! Shak https://t.co/vzGjj8XrNN Wow, 5 million views for the Perro Fiel video in 24 hours?? You guys are the best! https://t.co/Rea9hrqPqt 😍🐶🐶🐶 Shak https://t.co/KzCsf9wgH1 Wow! 5 millones de reproducciones del video de Perro Fiel en 24h? Muchas gracias! https://t.co/Rea9hrqPqt 😍🐶🐶🐶 Shak https://t.co/cf65pNFvbS 1 million views in 7 hours! Un millón de reproducciones en 7 horas! #PerroFielVideo @NickyJamPR ShakHQ https://t.co/0Eb8Pw1ZNb https://t.co/GO5sHELO4p RT @LiveNation: Watch @shakira’s new video for “Perro Fiel”: https://t.co/IHgu5HRzJt\n\nGet tickets to the #ElDoradoWorldTour: https://t.co/W… RT @VEVO_ESP: Estrenamos en @VEVO_ESP el videoclip oficial de #PerroFiel, el último hit de @shakira junto a @NickyJamPR! 🔥\n▶︎https://t.co/l… RT @Vevo: .@shakira &amp; @NickyJamPR are scared to fall in love in \"Perro Fiel.\" Watch the latest video off of 'El Dorado' now: https://t.co/g… Watch the incredible new video for Perro Fiel ft @NickyJamPR! Vean el increíble nuevo video de Perro Fiel! ShakHQ https://t.co/Rea9hrqPqt RT @despiertamerica: En exclusiva @shakira estrena en #DespiertaAmerica su video #PerroFiel unete a nuestro hashtag subiendo fotos con tu #… RT @Viber: We're too excited! Check it out! 📽️ https://t.co/OtWaK2n3dZ El video de Perro Fiel acaba de ser estrenado en exclusiva en @Viber! Véanlo ahora aquí -&gt; https://t.co/9fgvPgkW1l ShakHQ https://t.co/PiYq9i8nbJ The new Perro Fiel video just premiered in Shak's public chat over on the @Viber messenger app. Watch now! https://t.co/9fgvPgkW1l ShakHQ Mañana! El video de #PerroFielVideo se estrenará en exclusiva en el chat público de la app de mensajería @Viber a la 1pm CET / 8pm JST! SHQ https://t.co/q0QGqDhF2u Tomorrow! #PerroFielVideo - premiering exclusively in Shak's public chat on the the @Viber ​messaging app at 1pm CET / 8pm JST! ShakHQ https://t.co/OLAdoi556n Two days… Dos días ... \n#PerroFielVideo @NickyJamPR \nShakHQ https://t.co/mse1iDrXt7 Coming Friday… Este Viernes #PerroFielVideo @NickyJamPR ShakHQ https://t.co/67yNWhh6Hp Shakira acaba de anunciar un segundo concierto en Barcelona el 26 de Noviembre! La venta general empieza este Viernes a las 10am! \nShakHQ https://t.co/wTDFS0vxkk Shakira has just announced a second Barcelona date on Nov 26 (to add to the Sold Out show on Nov 25) - tickets on sale Friday at 10am! SHQ https://t.co/xVEIFmhvGG RT @CarpoolKaraoke: To support Tuesday's #HandInHand telethon, there will be no new episodes on @AppleMusic this week. Watch &amp; donate: http… Coming Tuesday... @CarpoolKaraoke with @Trevornoah / Este Martes... #CarpoolKaraoke en @AppleMusic! ShakHQ https://t.co/dv47nDXyED I hope we don't put you to sleep with my new single Perro Fiel like our jet-lagged coproducer... 😴 Shak https://t.co/uvhyLnCGgI Espero que no les pongamos a dormir con mi nuevo sencillo Perro Fiel como nuestro co-productor agotado después del viaje ... 😴 Shak https://t.co/4l9I72BTo0 .@TheAnnaKaiser @AKTINMOTION getting me ready for tour! #ElDoradoWorldTour Shak https://t.co/zHssTicHA5 Coming soon / muy pronto #PerroFielVideo @NickyJamPR ShakHQ https://t.co/MqHd7Z68RR Aún estoy esperando que me laves el carro @NickyJamPR! Still waiting for you to wash my car @NickyJamPR! Shak https://t.co/nuQ2WIkPhq Celebrando el nacimiento de Perro Fiel! Celebrating the creation of Perro Fiel! #flyonthewall Shak https://t.co/8LswrQaZVD Aquí está como nació Perro Fiel! / Here’s how Perro Fiel was born! Shak https://t.co/NjTHkrAHWZ No se pierdan este video de @ZumbaBeto bailando Perro Fiel, la nueva canción de Shakira con @NickyJamPR en Bali! ShakHQ @zumba https://t.co/ttiyhnN4DA Check out @zumba founder @ZumbaBeto’s great new video of him and his instructors dancing in Bali to Shak’s new song, Perro Fiel! ShakHQ https://t.co/78BrFmx58Z That's how we edit my new Perro Fiel video! / Así es cómo editamos mi nuevo video Perro Fiel! Shak https://t.co/luz5WfYpY9 Estoy haciendo todo lo que sea necesario para prepararme para la gira! Incluso nadar a medianoche! Shak https://t.co/O7hg33Yg3p Whatever it takes to prep for #ElDoradoWorldTour, even swimming at midnight Rocky style! Shak https://t.co/juAL60v5ld Getting ready for tour! Trying to get in shape. Preparándome para la gira de #ElDoradoWorldTour Shak https://t.co/Gv7niBePzD Stay tuned...  #ElDoradoWorldTour https://t.co/ofY91d1bck Ya tenemos los resultados de la encuesta de #ElDoradoWorldTour. Conozcan las canciones ganadoras aquí @viber https://t.co/eDmm0en9af  ShakHQ https://t.co/4QgDegqqgy The results of our #ElDoradoWorldTour song choice poll are in! Head over to @Viber to see which tracks won! https://t.co/QdyWSYBCG3\nShakHQ https://t.co/WcqrGBGHZK Someone is getting ready to dance along on my El Dorado World Tour!! Shak CC: @GiulioDilemmi https://t.co/qBgd0zZBv1 Me Enamoré just reached 100m plays on @Spotify! Me Enamoré ya tiene más de 100m de reproducciones en Spotify! ShakHQ https://t.co/NRfF89F9ZE RT @SonyMusicCol: ¡Comenzar el día con buenas noticias es recordar que @shakira recibió Disco Platino en Colombia por #ElDorado!  👏💿💛https:… Ya han participado en la encuesta de @viber sobre las canciones que les gustaría escuchar en #ElDoradoWorldTour? https://t.co/zQn2QyAPVp SHQ https://t.co/YnejmeXLBR Thanks for the votes for what you’d like Shak to play on #ElDoradoWorldTour - keep them coming on @Viber at https://t.co/zQn2QyAPVp! ShakHQ https://t.co/XPTSxL8oSY Cantas muy bien y muy afinada además! Gracias por tu mensaje cariñoso! Un beso muy grande! Shak https://t.co/2FQDZMoPfZ RT @MartinSipicki: Un regalo para @shakira de #LASBLONDIES\nhttps://t.co/4owJftAMfe @ShakiraMedia @PortalShakira @shakirashiver @ShakiraEcu… RT @CosmopolitanTR: Ağustos sayımız yarın bayilerde! Kapak yıldızımız: Shakira 💛#cosmopolitanturkiye #shakira https://t.co/UptziruN4K Feliz cumpleaños Carlos (@carlosvives), que lo pases lindo! Un beso! 🎂 Shak Estoy trabajando en mi #ElDoradoWorldTour setlist. Me ayudan seleccionando sus temas ♥️ en una encuesta en @Viber? https://t.co/zQn2QyAPVp https://t.co/uLsJYiTtO5 Hey guys, working on my #ElDoradoWorldTour setlist &amp; would ❤ your help. Please pick your faves in my @Viber poll!\nhttps://t.co/zQn2QyAPVp https://t.co/Xe1Rz5c56z Nos complace mucho poder anunciar que Shakira es la protagonista de la edición de Agosto de la revista @HarpersBazaarmx! ShakHQ https://t.co/vTiHc6X361 We are pleased to report that Shakira is the cover star of the August issue of @HarpersBazaarmx! ShakHQ https://t.co/yxW73uM6nP RT @HarpersBazaarmx: La cantante @shakira, quien ha marcado la historia de millones de personas con sus canciones, protagoniza nuestra edic… RT @GlblCtznUK: Me enamoré! #TBT to when @coldplay + @shakira TORE IT UP on stage together at #GlobalCitizenFestival Hamburg ✊ 😍 ⭕️ https:/… RT @fpiesdescalzos: Regala una huella en momentos especiales https://t.co/4bEbyrReoI https://t.co/OaE6nxNJAK RT @CarpoolKaraoke: Almost time to hit the road! #CarpoolKaraoke: The Series premieres Tuesday, August 8, exclusively on @AppleMusic. 🚗🎤 ht… 💋from the set of #PerroFiel. Shak https://t.co/eLKo19MlkM Redheads have more fun. On the set of Perro Fiel with @nickyjampr! Shak https://t.co/JGdzBThSeF #TBT to Shak's recent @cosmopolitanmx appearance! Hoy recordamos las fotos de Shak para la revista Cosmopolitan! #ShakiraXCosmo ShakHQ https://t.co/12SAsNnsdv RT @theirworld: 🙌 to the 145,000+ people who stood together - and to @shakira for taking your voices to the #G20 - to make this happen! htt… Los boletos para el segundo show de Shak en París el 11 de Noviembre ya están a la venta! https://t.co/OBdSdtYdfc ShakHQ https://t.co/vFy4rkKBqe Tickets for Shak's extra Paris show on Nov 11 are on sale now! https://t.co/OBdSdtYdfc ShakHQ https://t.co/MZdkubTcjd Feliz día de la independencia!! 🇨🇴Shak Ayer Me Enamoré llegó a los 200 Millones de reproducciones y hoy celebramos que Deja vu ha logrado lo mismo! https://t.co/lpYPYRZdh5 ShakHQ Yesterday the Me Enamoré video reached 200m views, today we're celebrating Deja vu doing the same! https://t.co/lpYPYRZdh5 ShakHQ The Me Enamoré video just reached 200m views! El video de Me Enamoré ya tiene 200 millones de reproducciones! ShakHQ https://t.co/4KsXOVTrw2 Althea is the cutest thing!!! Shak CC: @ivanrakitic https://t.co/D6Nmy4d3yz RT @Ticketmaster: Get 🎟 to see @Shakira on her #EldoradoWorldTour! \nOnly @Ticketmaster #VerifiedTickets get you in. Guaranteed. ✅\nhttps://t… RT @GlblCtznUK: \"The power to create change doesn't lie in the hands of only a few\" - @Shakira https://t.co/GHOn6aP1JN Loving this #ElDoradoWorldTour poster in Antwerp! Nos encanta este poster de El Dorado World Tour en Amberes! ShakHQ https://t.co/KBpvsFNvxz RT @theirworld: #TBT to @Shakira's amazing speech last week. With 145,000+ voices behind her, turns out the #G20 *was* with her. ✊ https://… RT @educommission: #G20 demonstrates progress toward the promise of #education for all. @Shakira &amp; Gordon Brown on this win for youth: http… RT @ticketea: ¡Las entradas para el concierto de @shakira en Bilbao ya están disponibles! Tienes que vivir #ElDoradoWorldTour 🙌 https://t.c… With PM @JustinTrudeau of Canada, discussing Canada’s feminist international assistance policy, girls’ education, and how we can do more! https://t.co/853tSbUbmI RT @vanidadesmx: #EnExclusiva ¡@shakira es una #mujerVanidades y protagoniza nuestra 2da portada de julio! #ShakiraxVanidades https://t.co/… El video de Chantaje ya tiene más de 1,500 millones de reproducciones siendo el vídeo más visto de Shak!\nShakHQ\nhttps://t.co/hF1MESxQUR Wow, the Chantaje video just passed 1.5 BILLION views - and is now Shak’s most-viewed ever! Incredible! \nhttps://t.co/hF1MESxQUR\nShakHQ RT @theirworld: \"We were brought together years ago because we agreed: this was the fight of our lives\" #FundEducation #G20  https://t.co/d… RT @educommission: Today, #G20 answered the call to support children. This commitment will help fund #education to see all children in scho… RT @GlblCtzn: We still can’t get over @Coldplay + @Shakira! #GlobalCitizenFestival https://t.co/nf6RumYnEl With the Prime Minister of Norway, Erna Solberg who is doubling the investment in education ... https://t.co/q7JR9J1hIS https://t.co/IqY5oYUv5c Singing Yellow with Chris at Global Citizen-I REALLY enjoyed this one! /Cantando Yellow con Coldplay en Global Citizen -qué canción! Shak https://t.co/ADRdlFd7gL Chris Martin se dejó crecer la barbita para esta canción / Chris let his barbita grow just to jam to this song! https://t.co/z8cekpL2u6 Congrats Shak! ShakHQ https://t.co/MFwvqmKkGB So fun to sing Chantaje with Chris Martin last night! / Con Chris Martin cantando Chantaje anoche! Shak https://t.co/o1982vCqu1 RT @CNNEE: Para @shakira, esta es la mejor inversión del mundo \nhttps://t.co/lbx4729024 – @alejandraoraa https://t.co/kXoQwwAdvH \"Shakira: Buscamos que en el 2030 toda la población infantil tenga educación\"via @CNNEE https://t.co/TdYlsdzdvx CC: @educommission \"Shakira and campaigners give G20 leaders 145,000 reasons to back education\" via @theirworld @educommission https://t.co/IpvL6tPcVQ The moving words of one of the hardest-working advocates for education and my partner on this mission to achieve education for all! Shak https://t.co/dQ2h6x4nMM RT @theirworld: .@shakira brings 145,000 signatures and calls from 30 organisations to #G20 to back global education https://t.co/QhDWOu4zXs RT @GlblCtznImpact: If current investment in education holds, by 2030, 800M people will drop out of school— #g20 hear @shakira's call https… Check out Shak’s speech about the importance of education at last night’s #GlobalCitizen concert in Hamburg. https://t.co/OcqdKVf8KE ShakHQ RT @GlblCtzn: Two of our favorite Global Citizens joined forces in #Hamburg for one amazing show ✨🇩🇪 @coldplay @shakira https://t.co/ajVinS… RT @UNICEF: These two 💙💙. From one Goodwill Ambassador to another. @shakira &amp; @muzoonrakan1 at @GlblCtzn festival. #ChildrenUprooted #AChil… Esta noche en los @PremiosJuventud en @Univision y Canal 5 de @Televisa podrán ver la espectacular actuación de @coldplay y Shak de hoy! SHQ https://t.co/h5aUTujPXx Awesome night with Chris Martin and @coldplay !!! / Una noche espectacular con Chris Martin y Coldplay!!! Shak #GlobalCitizenFestival https://t.co/HdlLSU1kwB RT @educommission: #Education on the world stage: @Shakira @OfficeGSBrown @Erna_Solberg &amp; others work to make kids a priority. https://t.co… RT @educommission: “[IFFEd] could mean $10b annually for education. That could change the game for millions of kids around the world.” –@Sh… Check out our Story live from #GlobalCitizenFestival Hamburg, over on Shak's Instagram! ShakHQ https://t.co/GiNzPJhpOU RT @educommission: @JuliaGillardGPE @GlblCtzn @GPforEducation @JuliaGillard @GlblCtznImpact @UNICEFEducation @shakira \"We are not going to… RT @educommission: @JuliaGillardGPE @GlblCtzn @GPforEducation @JuliaGillard @GlblCtznImpact @UNICEFEducation \"Over 145,00 of you told #G20… RT @despiertamerica: .@shakira y @coldplay se unen a #PremiosJuventud desde Hamburgo, Alemania. No te puedes perder este gran momento en @U… RT @theirworld: Together, we've got education on the agenda for the #G20 Summit. Now let's make sure world leaders #FundEducation: https://… Sintonicen con la transmisión en vivo del @GlblCtzn. Shak hablará pronto sobre la importancia de la educación. SHQ https://t.co/57Lrlsz6nL Tune into the #globalcitizen live stream, where Shak will soon be talking about the importance of education ShakHQ  https://t.co/57Lrlsz6nL RT @coldplay: #GlobalCitizen \nR42 https://t.co/yzRuO6sqjM RT @educommission: Join @Shakira &amp; tell #G20 world leaders to fund global education so we can get every child in school by 2030: https://t.… Showtime! https://t.co/GA26Y8GRTH RT @educommission: This could be education's big moment. Watch the @GlblCtzn Festival LIVE NOW on the eve of this year's #G20: https://t.co… RT @GlblCtzn: The pre-show has started – Tune in at 1 p.m. ET to see @Coldplay and @Shakira open the show! https://t.co/wfC72yW5ST @YouTube… RT @OfficeGSBrown: Ahead of #G20 , I'm joining @Shakira &amp; @JuliaGillard at @GlblCtzn Festival to ask world leaders to fund #education. http… La transmisión en vivo del festival #GlobalCitizen está a punto de empezar! La actuación de Shak empezará pronto https://t.co/57Lrlsz6nL SHQ The #globalcitizen festival live broadcast is go! Shak’s very special performance begins soon. Tune in now! ShakHQ https://t.co/57Lrlsz6nL RT @GlblCtzn: #GlobalCitizen Festival Hamburg is TODAY! Wherever you are, you can watch thanks to @ebay_KA &amp; @youtube https://t.co/wfC72yW5… With Chris Martin, just arrived in Hamburg, performing later tonight with @Coldplay! #globalcitizen https://t.co/6a8jGMsOqJ RT @fpiesdescalzos: Asegurémonos todos de darle a los niños y niñas la educación que merecen. #G20 Firma con @shakira --&gt; https://t.co/SHHH… Here’s why we’re asking you to sign our petition to G20 leaders for education: \nhttps://t.co/lhly5dCTAr @theirworld @educommission https://t.co/wCxVSzTaiR RT @GlblCtzn: We're only days away from our #GlobalCitizen Festival Hamburg! Don't forget your printed ticket! https://t.co/8fUZGIMkEM  #Tu… Gracias a Antonella y Leo y a la gente de Rosario por su hospitalidad! Shak https://t.co/AsyTpGhyvx With some fans in Argentina today / Con mis fans en Argentina hoy! Shak https://t.co/OuotikajTr RT @Jive_Epic: Les places pour les concerts de @shakira en #France sont en vente ! 😍\n➡https://t.co/vWeoc6CVzF https://t.co/C5DTugVTqo RT @TSRarena: Don't miss @shakira when she comes to #tsrarena on Saturday Feb. 3rd! 🎟️on sale now! Link: https://t.co/xH6wGUvd1w https://t.… RT @fnacspectacles: 😍 Whenever, Wherever ... tes places pour @shakira c'est par là &gt; https://t.co/ltYn6bS3U7 https://t.co/MKk4yE6kr0 RT @BEC_Bilbao: Ya están a la venta las entradas para @shakira para su concierto en @BizkaiaArena #BEC el 17 de Noviembre https://t.co/UwTC… RT @AACenter: ON SALE NOW! Tickets are now available to see @shakira in Dallas on January 28! 🎟 https://t.co/VTH5fwFxmd https://t.co/3dMbdO… RT @ZiggoDome: Tickets | Shakira - El Dorado World Tour 14-11-2017 | Ziggo Dome, Amsterdam https://t.co/PhwnloqvFl RT @LiveNationES: ¡Las entradas para ver a @Shakira en España en noviembre ya están a la venta en https://t.co/Q9PRyJw9n8, @TicketmasterES… RT @HondaCenter: Tickets to see @shakira on February 6, 2018 are ON SALE NOW: (https://t.co/WbbVr9UKBz) #ShakiraWeek #ElDoradoWorldTour htt… The #ElDoradoWorldTour is on sale NOW! Los boletos para El Dorado World Tour YA están disponibles! https://t.co/OpPFnOGiPJ ShakHQ https://t.co/cBoNHw9EDj RT @LiveNationFL: On sale now! Find tickets to @shakira #ElDoradoWorldTour at @AmwayCenter 1/9, @thebbtcenter 1/11 &amp; @AAarena 1/12: https:/… RT @TicketmasterES: Comienza la venta general de entradas  para ✨El Dorado World Tour✨ de @shakira! Consíguelas aquí 🎫👉 https://t.co/0ukksK… RT @BellCentre: IT'S TIME!💃\nYou can now buy your tickets for @shakira 's EL DORADO WORLD TOUR at the Bell Centre on January 19, 2018\nhttps:… RT @TheGarden: Can't Remember to Forget that @Shakira is coming to MSG on Jan 17! Tickets are ON SALE NOW! Don't miss it! #Shakira https://… RT @ToyotaCenter: REMINDER: Tickets to see @Shakira in Houston on January 26 go on sale at 10am! https://t.co/fiAdpHWidk https://t.co/nAgxN… RT @AAarena: It's time! ⏰ \n\nTickets to see @shakira live are on sale now ➡️ https://t.co/sldkklRnK3 https://t.co/D5EIz1p6Ha European #ElDoradoWorldTour dates on sale NOW!\nLas fechas para #ElDoradoWorldTour en Europa ya están a la venta! SHQ\nhttps://t.co/57opxBpcq9 https://t.co/YsK08kU5zR Can't wait to be onstage singing along with all of you! Shak #ElDoradoWorldTour https://t.co/1D5Zvgr6cx Tengo muchísimas ganas de estar ya en el escenario cantando con ustedes. Shak #ElDoradoWorldTour https://t.co/H2HktWictU Nos encanta esta ilustración realizada por @gabhoespinosa de #ElDoradoWorldTour (La venta general empieza mañana!) ShakHQ https://t.co/AgJZikmqWV Amazing illustration of the #ElDoradoWorldTour artwork by @GabhoEspinosa! (Tickets on sale tomorrow…) \nShakHQ https://t.co/W3nSGs5mXl RT @RakutenToday: .@Shakira’s #ElDorado world tour, presented by Rakuten, kicks off Nov 8 in Cologne. We are officially pumped! https://t.c… RT @theforum: PRESALE for @shakira at the Forum on February 1 starts TOMORROW, June 29 at 10am! Use code FABULOUS: https://t.co/RB2OWBEAQ9… RT @Los40_Spain: .@shakira viene a España en concierto con @Los40_Spain, y las entradas ya están en pre-venta. Corre! https://t.co/mc6UHkcl… RT @LiveNationES: ¡Vuelve @shakira! ¿Tienes ya tu entrada? Consíguela ya en https://t.co/caEIv3StsI https://t.co/vHG7N0SdIq RT @educommission: We are at risk of losing a generation of #refugee children. Join @Shakira to ask #G20 leaders to #FundEducation: https:/… RT @TicketmasterES: ¡Comienza la preventa @Viber para @shakira! Descarga la app 📲, consigue tu código y hazte con tus entradas 👉 https://t.… .@Viber is the Official Messaging App of the #ElDoradoWorldTour! Get Viber pre-sale tickets TODAY -&gt; https://t.co/voY8Ibs7bv ShakHQ https://t.co/n53YNQUMRW .@viber es la Aplicación de Mensajería Oficial de #ElDoradoWorldTour. Consigan sus boletos de pre-venta aquí: https://t.co/voY8Ibs7bv ShakHQ https://t.co/OSoP7uEcnG RT @40Andaya: .@Los40_Spain te traemos a @Shakira con su gira #ElDoradoWorldTour por España! https://t.co/AMivpgKkw8 #AndaYaQueOrgullo http… RT @Viber: We are the Official Messaging App of @shakira's World Tour! Tomorrow ONLY: Get Viber-exclusive pre-sale tickets 👉 https://t.co/I… Latin American dates coming soon… / Anunciaremos fechas para América Latina próximamente… ShakHQ It’s time / Llegó la hora! Shak\nhttps://t.co/jeBxLMu3Ck\n#ElDoradoWorldTour\n🇩🇪🇫🇷🇧🇪🇪🇸🇵🇹🇨🇭🇮🇹🇳🇱🇱🇺\n🇺🇸🇨🇦🇲🇽🇨🇴🇪🇨🇵🇪🇨🇱🇦🇷🇧🇷 https://t.co/BbYe9G1Ac8 \"Me Enamoré\" is #1 in the Latin Pop chart in the US! / \"Me Enamoré\" es número 1 de la Radio Latina Pop en los Estados Unidos! ShakHQ https://t.co/PPAEz9o6y2 RT @educommission: Sign with @Shakira: Ahead of next week's summit in Germany, let's compel #G20 leaders make children a priority. ✍️ https… Let’s make sure every child in the world is learning. RT to show #G20 leaders you back this #education innovation: https://t.co/v1HCtXqAw2 https://t.co/04bfixYwvj Shakira: \"En la música impera la ley de la selva\" https://t.co/CUM63j3ggz via @Papel_EM y @elmundoes RT @Papel_EM: Cantautora, bailarina, empresaria, la mujer más popular de Facebook y madre de dos hijos con @3gerardpique\n@shakira \nhttps://… Stay tuned / Estén atentos …\n🇩🇪🇫🇷🇧🇪🇪🇸🇵🇹🇨🇭🇮🇹🇳🇱🇱🇺\n🇺🇸🇨🇦🇲🇽🇨🇴🇪🇨🇵🇪🇨🇱🇦🇷🇧🇷\n➡https://t.co/46RwaNSQFa ⬅ ShakHQ Querido Ale (@AlejandroSanz), muchísima suerte, es tu noche, disfrútala, te quiero! Shak https://t.co/mEJTWG7mxt #Refugee children deserve to return to school. Let’s call on #G20 leaders for more and better #education financing: https://t.co/v1HCtXqAw2 https://t.co/k3r5JtIBDn El Dorado is @Billboard's #1 Latin Album! El Dorado es número #1 en Billboard Álbum Latinos! https://t.co/UrOmHlGAyK ShakHQ https://t.co/dCA8kfsxRk #Education is a human right, and world leaders must commit to funding it. Ask #G20 to make children a priority: https://t.co/v1HCtXqAw2 https://t.co/JZArjcIcSj RT @Papel_EM: #93. @shakira, la reina madre. https://t.co/9qL0w6Mugp Ya han visitado la tienda oficial de Shakira? Ahora ya está disponible en español! La encontrarán aquí -&gt; https://t.co/UE7aL3DOpc ShakHQ https://t.co/QPXZJbojUV Check out the new El Dorado merch and album bundles! https://t.co/C7nrxSwiXR ShakHQ https://t.co/9PcR3t1s3H No se pierdan el nuevo merchandise y los packs de El Dorado en la Tienda Oficial de Shak! https://t.co/C7nrxSwiXR ShakHQ https://t.co/JdBeq8Et51 Another studio #TBT video from the first day of recording for #ElDorado! Otro video del primer día de grabaciones de El Dorado!  ShakHQ https://t.co/t3UX8hVYsQ RT @MovimientoALAS: Niñ@s de Cerro Batea, Panamá, pronto disfrutarán de nuevo Centro de Atención Integral gracias a alianza #ALAS @Fundacio… RT @cosmopolitanmx: ¿Ya tienes nuestra nueva edición con @shakira en portada? ¡No te puedes perder todas las confesiones que nos hizo! #Sha… RT @theirworld: Have you signed with @shakira?\nWe're joining her in asking world leaders to back education. Will you...? ✍️  https://t.co/B… Here’s Shak performing Chantaje in Barcelona at the El Dorado launch party! ShakHQ https://t.co/QJDWiHLfJ6 Aquí está Shak interpretando la canción Chantaje en la fiesta de presentación de El Dorado en Barcelona! ShakHQ https://t.co/hysOsz8ho3 Shak's the cover star of the new Cosmopolitan Russia! Shak en la portada de @CosmopolitanRus de este mes! ShakHQ https://t.co/WbTlCtJrh9 Awesome that they're playing Perro Fiel on the radio in Paris already! Increíble que Perro Fiel esté sonando ya en una radio en París! SHQ https://t.co/FS9JWh2KDe RT @cosmopolitanmx: ¡Te revelamos nuestra nueva portada con la guapa @shakira ! ✨ ¡Corre por la tuya a partir de hoy! #ShakiraXCosmo https:… RT @NRJhitmusiconly: Trop de love par ici ♥ \nAvec #NRJ, rencontrez vos superstars préférées !!! La preuve avec @Shakira 😏#ShakiraChezCauetS… RT @cauetofficiel: Fan de @shakira  !! Elle chante avec son idole👌🏻 \n▶️ https://t.co/p6YhMhNlH3 https://t.co/TCTNr7Qf2Z Shak en la tapa de la revista Cosmopolitan en América Latina! #ShakiraXCosmo ShakHQ https://t.co/yg7PrhDu3w Shak's on the cover of the new issue of Cosmopolitan in Latin America! #ShakiraXCosmo ShakHQ https://t.co/7vY5EjzcxE RT @NRJhitmusiconly: ON Y EST ⏰ !! Installez-vous confortablement, @cauetofficiel, son équipe, et la belle @shakira prennent le contrôle d'… No se pierdan este video de Shak interpretando la canción Nada en la fiesta de presentación de El Dorado en Barcelona! ShakHQ https://t.co/sFa5gx55o8 Watch Shak perform Nada at the El Dorado launch party in Barcelona! ShakHQ https://t.co/S9cmdvZpHk Music to my ears - everyone singing Me Enamoré in Spanish in France! I had so much fun! Don't miss it, tune in to NRJ at 9pm tomorrow! Shak https://t.co/WptGSmtCc3 Super fun sharing the stage with @Bmesrimes tonight on the Voice! Shak https://t.co/dLhl0Dokr9 About to perform on The Voice France! Tune in to TF1 now and don't miss it! Shak https://t.co/GXHAjAQJIH RT @Bmesrimes: Rdv ce soir... #THEVOICE @TheVoice_TF1 #SURPRISE 👀👀👀cc @shakira https://t.co/Pj7IWSs8y3 🇫🇷😍🇫🇷😍🇫🇷 https://t.co/LRvkUHNApe Jamming to Me Enamoré while they stitch my pants up! Shak https://t.co/D72Q8upt28 RT @TheVoice_TF1: #TheVoice \n🔥 CE SOIR à 21h sur TF1​ 🔥\nC'est le soir de... la grande finale de la saison 6 de The Voice ! https://t.co/i9Z… No se pierdan este video de Shak cantando Toneladas durante la presentación del álbum El Dorado de anoche.  ShakHQ https://t.co/2BHglmeNgt Watch Shak perform Toneladas at last night’s El Dorado album launch in Barcelona! ShakHQ https://t.co/p8ox5V9e3j Gracias por tanto cariño anoche en la presentación de El Dorado! En Europa! Fui feliz improvisando y cantando canciones nuevas! Quiero más! https://t.co/DP4o6eaMvr RT @NRJhitmusiconly: La belle @Shakira​ va-t-elle craquer pour @cauetofficiel​ ?!! Pour avoir la réponse, RDV lundi dès 19h, sur #NRJ 😜😜 #S… No se pierdan nuestra LIVE Story En vivo desde el lanzamiento del álbum de Shakira, El Dorado, en BCN https://t.co/ah99eaIwzF ShakHQ https://t.co/5cE7tOqLaJ Follow our Insta Story LIVE from Shak's El Dorado album launch party in Barcelona!  \nhttps://t.co/ah99eaIwzF ShakHQ #ElDoradoBCN https://t.co/lKoC0BLhoW #ElDoradoBCN https://t.co/3KSeQmm6Y7 100 Million Views! 100 Millones de Reproducciones! ShakHQ #MeEnamoré https://t.co/Fe9Y6YAGat RT @NRJhitmusiconly: Lundi 12 juin, dès 19h, sur #NRJ ➡️ émission spéciale avec la superstar @Shakira chez @cauetofficiel !!!!!!! ❤️🎉😎 #Sha… \"Shakira's 'El Dorado' Scores Biggest Sales Week for a Latin Album in More Than Two Years\" (via @billboard) https://t.co/Ec5e4M1jPK ShakHQ https://t.co/Q6a9lDKOtU RT @GlblCtzn: Thrilled to announce @shakira, @Pharrell &amp; @bourani will join @coldplay, @elliegoulding &amp; @groenemeyer in #Hamburg on July 6t… Hahaha! Chris eres lo más! Nos vemos en Hamburgo el 6 de Julio para cantar juntos en @GlblCtzn! Que ganas! Shak https://t.co/6iCx2VZ40W You crack me up Chris! You’re the best. I’ll see you in Hamburg to sing together at @GlblCtzn on July 6. Can’t wait! Shak https://t.co/6iCx2VZ40W Check out Shak on the cover of the new issue of @VanityFairIt! Shakira, en la portada de Vanity Fair Italia de este mes! ShakHQ https://t.co/hXGmcrXs2p RT @TF1Pro: Samedi 10/06🗓️\n#TheVoice6 🎤\nDes invités exceptionnels pour la finale! @shakira, @Nolwennleroyoff, @calogerofficiel, @Sopranopsy… Listen to the full El Dorado album on @YouTube! / Ya pueden escuchar El Dorado en Youtube! ShakHQ https://t.co/4268edZbOi RT @UNICEF: Join us! Share your super dad moment in a photo using #EarlyMomentsMatter to celebrate good parenting → https://t.co/HVD5Mdv8Pr… “Shakira Finds Liberation, One Song at a Time” (via @nytimes) ShakHQ https://t.co/1AGW731Xsf https://t.co/V4RfDNUv0W \"Canción por canción: la nueva forma de componer de Shakira\" (via @nytimes ) https://t.co/x6dcgxsPLN ShakHQ https://t.co/Eu3FPopNTh No se pierdan este increíble making of del video de Me Enamoré!\nWatch the “making of” for the Me Enamoré video! SHQ https://t.co/7OWuHzEVu8 #TBT to the first day of recording for El Dorado! #TBT del primer día de grabaciones de El Dorado! ShakHQ https://t.co/7aMWAkQgo2 RT @LoMas_40: Disfruta también #realShakira en Full HD! Con @xavimartinez y @shakira En algo épico. YA disponible en Youtube! ▶️ https://t.… RT @amazonmusic: Prepare to shake your hips. The new album 'El Dorado' by @shakira is here! #NP https://t.co/toaCFfXeJq https://t.co/0aLVr1… No se pierdan el #RealShakira de @Los40_Spain: @xavimartinez entrevistó a Shak. El programa entero está aquí https://t.co/JCyvh8AfBl ShakHQ RT @ournameisMAGIC: new song called #WhatWeSaid in there, ya like it? https://t.co/K3SR4kSlhM No se pierdan este video resumen del lanzamiento de El Dorado en Miami (con el audio de When a Woman del álbum)\nShakHQ https://t.co/l19iTGNfOB Relive Shak’s #ElDorado release celebrations in Miami (soundtracked by When A Woman from the album)! ShakHQ https://t.co/WfoULoxpVZ RT @antena3com: ¡Comienza @El_Hormiguero y tenemos un 'deja vu'! Hoy viene a divertirse @Shakira. Comentamos con #ShakiraEH https://t.co/2H… RT @TonyAguilarOfi: Gracias querida amiga @shakira por la llamada del sábado en @Del40al1_es para celebrar juntos el #1 de @Los40_Spain htt… RT @El_Hormiguero: Hoy viene a divertirse a El Hormiguero la cantante latina que más triunfa en todo el mundo, moveremos las caderas al rit… Check out Shak's performance of Me Enamoré from Friday night's surprise Miami show! https://t.co/csZsDlV486  ShakHQ No se pierdan este nuevo video de la actuación sorpresa de Shak en Miami. Llega el momento de \"Me Enamoré\"! https://t.co/csZsDlV486 ShakHQ RT @Del40al1_es: Momentazo!!! Le hemos dado a @shakira en directo la noticia de que ME ENAMORÉ es el nuevo número 1 de @Los40_Spain !!! htt… Un nuevo video de la actuación al aire libre en Miami! Les compartimos el video de Toneladas! \nShakHQ https://t.co/gaGsEQvnlq ShakHQ Here's another video from Shak's amazing popup show in Miami on Friday night - this one's of Toneladas! https://t.co/gaGsEQvnlq ShakHQ RT @Los40_Spain: EL HYPE. Best teaser ever. Best #real ever? Mañana gran estreno de #realShakira con @xavimartinez y @shakira en un mano a… Ya han escuchado el último álbum de Shakira, El Dorado? También está disponible en @Spotify! Escúchenlo aquí https://t.co/sMI1hlCHfH ShakHQ Listened to Shak's new album El Dorado yet? Hear it on @Spotify now! ShakHQ https://t.co/sMI1hlCHfH Shak, El Dorado  # 1 mundial en el chart global. Felicidades! Disfruta de un merecido masaje! Paga tu equipo! ShakHQ https://t.co/DWlrmutCZw Shak, El Dorado at #1 on the worldwide chart! Congrats! After so much work enjoy a well deserved spa treatment on us! ShakHQ https://t.co/TRefLSfQ4v Congrats to the champion!!  Felicidades al campeón!!\nShak Si se perdieron el estreno del álbum de Shak #ElDorado en @Beats1, lo pueden escuchar ahora en @AppleMusicES https://t.co/Pp2Jcu9xWs ShakHQ https://t.co/JjlL5mtEwH If you missed the world premiere of Shak's album #ElDorado on @Beats1, you can listen to it now on @AppleMusic https://t.co/Pp2Jcu9xWs SHQ https://t.co/tJgGXTXFBd Still feeling emotional from last night!!! IT WAS EPIC!!!!!!!!!!!!!! Shak https://t.co/uqV6dgOxmo Tonight's surprise performance in Miami. The energy was incredible, you left me wanting more!! Shak https://t.co/QbdmxxmQM8 Esta noche actuación sorpresa en Miami. Increíble la energía, me han dejado con ganas de más!! \nShak https://t.co/EOhLHnXLw4 A little sampling of last night's performances at the El Dorado launch party! Resumen de las actuaciones de ayer en la fiesta El Dorado! SHQ https://t.co/ul0nUoN0Nv Good things come to those who wait. Maybe even a song coming your way ;) Shak EL DORADO\nOUT NOW / YA DISPONIBLE\niTunes: https://t.co/P1tE1k4a6R\nSpotify: https://t.co/3VsICJkNSi\nGoogle Play: https://t.co/xIAUNkzzTj\nSHQ https://t.co/PH3FbazFXA Ok Miami, another surprise from me to you today. Wynwood Yard...stay tuned for more info! Shak Ok Miami, otra sorpresa de mi parte para Uds hoy en Wynwood Yard. Estén atentos! Shak RT @AguilaHalcon_FC: Celebrando #ElDorado 🎉 \n\n@shakira @SonyMusicArg @LiveNation #ShakiraAr https://t.co/RY5DW9SRuz RT @luisiitho90: Más que felices tus fans en Argentina!  @Shakira @musimundo @SonyMusicArg #ElDorado #EldoradoShakira https://t.co/yA9T2cKe… Woohoo! Shak https://t.co/bJqgb5N9V7 Hey Miami, would you like to celebrate #ElDorado's release with me? Hola Miami! Quieren celebrar el lanzamiento de El Dorado conmigo? Shak RT @Shazam: We are giving @shakira's new album #ElDorado a big 👍 up! Listen to her new album on @AppleMusic here: https://t.co/qTgAXDYXVw h… RT @SonyMusicArg: ¡Hoy a las 18hs!\n😍 ¡Celebramos el lanzamiento del nuevo álbum de @shakira! 😍\n#ElDorado https://t.co/yYYDeRSJLN Me la pasé genial en el escenario con @NickyJamPR y @PrinceRoyce anoche en el lanzamiento de El Dorado. Qué honor! Shak https://t.co/uvLvz5Fz6E Had a great time onstage with @NickyJamPR and @PrinceRoyce last night at the El Dorado launch. What an honor! Shak https://t.co/uK8T10E6ui En la Laguna de Guatavita donde está el tesoro sumergido mis fans encontraron a las 6pm antes que todos mi nuevo álbum El Dorado!Felicidades https://t.co/uh8zufF6Fw Yesterday evening at the Guatavita lake - where a sacred treasure lies - my fans discovered (before everyone else) my new album: El Dorado! https://t.co/Cg8UY0vm55 Número 1 en 34 países con El Dorado!!! Cómo puedo darles las gracias por todo lo que me dan?? Shak https://t.co/6C235pEtRQ Number 1 in 34 countries with El Dorado!!! How can I thank you all for giving me so much?? Shak https://t.co/lIBmr2lEDi Wow, #ElDorado has reached #1 in 27 countries in a couple of hours! Incredible! You guys are the best! Shak https://t.co/MObkj9XqMt Wow, En pocas horas #ElDorado ya es #1 en 27 países! Increíble! Ustedes son los mejores! Shak https://t.co/paGFGTB8pH ¡Número uno! Number one! #ElDorado 🙌 \nhttps://t.co/P1tE1k4a6R\nShakHQ https://t.co/lXKkicdWOq @NickyJamPR Enjoying @NickyJamPR on stage tonight at the \"el Dorado\" party! Shak https://t.co/qFOjcPb48I Disfrutando con @NickyJamPR sobre el escenario hoy en la fiesta de \"El Dorado\"! Shak https://t.co/LzyXPtkhTL En menos de 30mins #ElDorado ya es #1! Gracias por ésto, los quiero! Shak https://t.co/cT4OV9XOT0 RT @AppleMusic: This is not a drill. \nNew @Shakira! Listen to her new album, #ElDorado.\nhttps://t.co/z6LpRvN1Sj https://t.co/PtxMxjFbj8 En la Laguna de Guatavita donde está el tesoro sumergido mis fans encontraron a las 6pm antes que todos mi nuevo álbum El Dorado!Felicidades https://t.co/vDaNLSFHIo Finishing up the red carpet at the release party for my new album #ElDorado. Shak https://t.co/UsbW3P1lRI En el camerino a 1 hora y media de presentar mi album! Shak #ElDorado https://t.co/E0dNCYd7KU I'm about to present my new album #ElDorado! We're an hour and a half away from release! Shak https://t.co/Zrg2D4b9Zn Ya estoy a punto de salir para presentarles mi álbum #ElDorado! Estamos a 1hora y media de salir! Shak https://t.co/CzpWwsoLkt Hola Miami! Quieren venir a la presentación de #ElDorado? Vengan AHORA a 1415 Euclid Ave y digan \"oro\"! 50 primeros entrarán (mayores 21) *** note: you need to be 21 or older to enter *** ShakHQ Hola Miami! Want to attend the listening party of #ElDorado? Come NOW at 1415 Euclid Ave and say \"oro\" in the entrance. The first 50 get in! RT @Beats1: Loving #ElDorado!\nGet @shakira's new album on @AppleMusic in a matter of hours! https://t.co/B4LnWhaHQx https://t.co/SB1qHjVg4F RT @juank5607: Después de #Toneladas a dormir! Brillante! Gracias @AppleMusic por convertir el estreno de #ElDorado en un evento en la red!… RT @Beats1: All of us listening to @Shakira's #ElDorado right now...\n\nWho's tapped in? https://t.co/rAPwDbKt1V https://t.co/rPymSBXNiu RT @jess_garcia27: I'm getting to listen to @shakira whole new album on @Beats1 before it's released tomorrow and it's so good! 😭 RT @AppleMusicES: 🚨 Estreno mundial 🚨\n¡Escucha ya #ElDorado de @shakira en @beats1!\nhttps://t.co/5qnTbRS5ex https://t.co/gOshZ4fuHb RT @AppleMusic: 🚨🚨 Listen to @Shakira's #ElDorado for the first time right now only on @Beats1. https://t.co/0nRk2iOW5Q https://t.co/z8bjYK… RT @Beats1: Hear @Shakira's #ElDorado from top to bottom right now! Press ▶️ on @AppleMusic. It's happening: https://t.co/rAPwDbKt1V https:… RT @Beats1: \"I said, 'I'm just going to make the kind of music that I know how to make and I'm gonna do it for me.'\" @Shakira https://t.co/… Ahora! Escuchen mi nuevo álbum #ElDorado en @Beats1 / Listen now! My new album #ElDorado on @beats1 now! https://t.co/dA19STw3Jr Shak https://t.co/mshm3R2pqn 🚨  Don't miss Shak playing #ElDorado for the first time on @beats1 today! Tune-in at 5 p.m. PST / 8 p.m. EST https://t.co/dA19STw3Jr  ShakHQ https://t.co/kuSo0JEGQf 🚨 No se pierdan a Shak en @beats1 donde podrán escuchar #ElDorado por primera vez! Hoy 5p.m. PST / 8p.m. EST https://t.co/dA19STw3Jr SHQ https://t.co/PG7n5pUyRd TOMORROW! / MAÑANA! #ElDoradoCountdown ShakHQ  ✏️ @angel_art98 #ElDorado https://t.co/T5LOT7DrxG RT @Geoprof005: @shakira @AppleMusic Aquí en la Laguna de Guatavita donde inició la leyenda de  #eldorado #shakiraeldorado #ElDoradoShakira… RT @Luised_Villa: @shakira Inspirado en ti! #ElDoradoShakira #ElDorado #ElDoradoCountdown #ShakiraElDorado #ShakiraGold Gran Lanzamiento Ma… Find the El Dorado 💿 at the sacred lake of the Muisca where the myth began &amp; you can win Shak's 🎤 too! Go! ShakHQ https://t.co/vDCrxkWTyO 🇨🇴 Encuentren El Dorado 💿 en el lago Muisca donde empezó la leyenda y consigan el 🎤 de Shak! ShakHQ https://t.co/vDCrxkWTyO 🇨🇴 #ShakiraElDorado RT @angel_art98: \"El Dorado\" @shakira #ElDorado #ElDoradoShakira #ElDoradoCountdown #ShakiraElDorado #ShakiraGold Ya solo un día!! https://… RT @lasermebarak: Un tesoro más y estamos a 2 días de descubrir #ElDorado de @shakira #ShakiraElDorado @ShakiraElDorado #Shakifans https://… @Spotify @ryswinney 2 Días! Guarden el nuevo álbum en @Spotify y sean los primeros en escucharlo! https://t.co/WIlgNNDhYm SHQ #ElDoradoCountdown ✏️ @ryswinney https://t.co/zBb9pe5SVZ Two days! Pre-save the new album on @Spotify now ahead of Friday's release at https://t.co/WIlgNNDhYm SHQ #ElDoradoCountdown ✏️ @ryswinney https://t.co/pe815lvhlY RT @yasiNARSist: Hey @shakira I have already hit road 🏃 and finally I have just found your treasure! 🏆✨ #ShakiraEldorado https://t.co/g5t8D… RT @SonyMusicArg: 🎉 ¡Por el lanzamiento del álbum de @shakira, este viernes nos juntamos a celebrar en @musimundo (Av. Cabildo 1873)! 🎉\n💛💿… RT @SonyMusicChile: Este viernes 26 lanzamos el nuevo álbum de @shakira #ElDorado y tenemos una sorpresa muy especial! Nos vemos en @Puntom… RT @laundryluis: @shakira este es un regalo muy especial para ti. Gracias @dxerojas por esta obra de arte. #ShakiraGold #ElDorado #ElDorado… RT @EdisonTiempo: 2 days to go and we will be partying at the club with #ElDorado album @shakira #ElDoradoCountdown #ShakiraElDorado https:… Les compartimos nuevo vídeo de Shak cantando Nada tal como se estrenó en https://t.co/vDCrxkWTyO (hoy, un nuevo tesoro exclusivo) ShakHQ https://t.co/MQ87iY53kU Here's Shak singing Nada in the studio, as premiered in the https://t.co/vDCrxkWTyO goldspots (another exclusive treasure today..!) ShakHQ https://t.co/tLZQUKOzje RT @educommission: .@Shakira is asking #G20 leaders to support better financing for global education. 📝 Sign the petition: https://t.co/swj… RT @EdisonTiempo: 4days to go @shakira  #ElDorado #ElDoradoCountdown #ShakiraElDorado are you guys ready? #ShakiraenBeats1 https://t.co/3N6… RT @alcantaramanuel: En 4 días... dans 4 jours! #ElDoradoCountdown @shakira @Bmesrimes @carlosvives @maluma https://t.co/k8Wd2bZo6j RT @AppleMusicES: .@shakira estrena #ElDorado en @Beats1 + entrevista con @oldmanebro.\n25/5\n7PM MEX / COL \nhttps://t.co/5qnTbRS5ex https://… RT @AppleMusic: .@shakira premieres #ElDorado on @Beats1 + interview with @oldmanebro.\nMay 25\n5PM LA\n8PM NYC\nhttps://t.co/0nRk2j6wXo https:… 🎵La vida me empezó a cambiar\nLa noche que te conocí\nTenía poco que perder\nY la cosa siguió así🎵 \nhttps://t.co/4KsXOVTrw2 ShakHQ https://t.co/nQ6VrfqrCC RT @Beats1: .@Shakira Presents: #ElDorado\n She talks about the new album and plays songs from artists that inspire her! Tap in: https://t.c… RT @AppleMusicES: .@radiohead, @Nirvana... no te quieres perder los favoritos de @shakira en @Beats1. En vivo AHORA: https://t.co/5qnTbRS5e… Tune in to @Beats1 now. Shak will play some of her favorite songs in English! https://t.co/gQmGEk7JJe ShakHQ https://t.co/ihvcjQMBA3 Sintonicen @Beats1 en 30min para escuchar el programa de Shakira! Compartirá sus canciones favoritas en inglés! https://t.co/gQmGEk7JJe SHQ https://t.co/UfC2Bzr673 RT @GabhoEspinosa: #ElDoradoCountdown X #GabhoEspinosa\n\nEn Barcelona, ya faltan 5 días✨ https://t.co/1NVke8MHtO RT @aworldatschool: Education campaigner and singer @shakira asks world leaders at #G20 summit to put education at top of the agenda. https… RT @Beats1: ¿Te perdiste #ElDorado de @shakira en @Beats1? Aquí lo puedes escuchar. 👉 https://t.co/JW7KUjTJj1 https://t.co/8zkyYF2blC The other day some el dorado hunters caught me singing Chantaje in a NY goldspot @ Washington Sq Park! https://t.co/yr9DrYqzd5 Shak El otro día me encontraron cantando Chantaje en Washington Sq Park en el goldspot de NY! Shak https://t.co/yr9DrYqzd5 RT @Shakira_fact: #Eldoradocountdown 5 days to El dorado https://t.co/f6EKr4fDA2 RT @AppleMusicES: Descubre la música que inspiró a @shakira. \n#ElDorado empieza AHORA en @Beats1. https://t.co/5qnTbRS5ex https://t.co/rBNc… RT @Beats1: Press ▶️ on @AppleMusic!\n@Shakira is on #Beats1 with 🎶 from artists she collabed with on #ElDorado &amp; her influences. https://t.… Sintonicen @beats1 en 30 min donde estaré presentando un programa con la música de algunos de mis artistas latinos favoritos! Shak https://t.co/9rfZcps0TL Tune in to @beats1 in 30 min! I'm hosting a show and playing songs from some of the Latin artists that I like! https://t.co/dA19STeskR Shak https://t.co/PvPexxJVXm RT @theirworld: Join @shakira in pushing education to the top of the agenda at the #G20 summit in July. Sign the petition today ✏️ https://… RT @PepilloPM: @shakira . #ElDoradoCountdown 6 Días para ver el brillo de El Dorado ⚜️🔱 https://t.co/cOeAraluV0 Suban sus dibujos/ilustraciones con el hashtag #ElDoradoCountdown! Muchas gracias! ShakHQ SEIS días para el lanzamiento de El Dorado! Vamos a hacer RT de los gráficos que más nos gusten para la cuenta atrás (1-6) Se animan? ShakHQ https://t.co/m81GA488SR SIX days until El Dorado! Please make countdown graphics we can RT each day (6 to 1). Tweet yours to #ElDoradoCountdown - thanks! ShakHQ https://t.co/u87DgSfQDe Apoya este proyecto de @AlejandroSanz y @SavetheChildren! #YSiFueraElla #MásÉsMás #SaveTheChildren https://t.co/pTq5QML0lM Shak Gracias por tu apoyo Carlos! Un beso! Shak https://t.co/mM63smoDji RT @AppleMusicES: .@shakira estará mañana en @Beats1 compartiendo su música favorita.🎙Sintoniza a las 1 PM México para #ElDorado en: https:… Four Premios Juventud nominations! 4 nominaciones en los @PremiosJuventud! ShakHQ https://t.co/ax0isICORu RT @Beats1: 💥 @shakira + #Beats1.\n🎙2 programas este fin de semana.\nPremiere de #ElDorado 25/5.\nDetalles en https://t.co/Mb2YQmljlO https://… Ahora ya pueden teñir de dorado sus selfies en  https://t.co/zfND4Uwb1m! No se olviden de compartirlos con nosotros! ShakHQ https://t.co/JfcHTfxmrT You can now take your very own gold selfie at the https://t.co/vDCrxleuqm goldspots! Make sure you share yours with us! ShakHQ https://t.co/c9OOTRk3ph Shak está tan feliz que les gustó el adelanto de Nada que decidió lanzarla una semana antes del álbum! https://t.co/qGUUtRxVl3 ShakHQ https://t.co/kALinrPMZl Shak's so happy you guys liked the Nada preview, she released it a week ahead of the album! Stream/download-&gt; https://t.co/qGUUtRxVl3 ShakHQ https://t.co/GGhDDOJ66a RT @edgarshakiresco: Buscando tesoros me encontré con esto. Saludos desde El parque del Cármen en Puebla @shakira @ShakiraElDorado https://… RT @PepilloPM: @shakira La encontré en tu Zócalo querido!  #ShakiraElDorado https://t.co/n80Y5P8908 RT @SonyMusicLatin: ¡Guarda anticipadamente el nuevo álbum de @shakira , #ElDorado, en @Spotify! Haz clic en 👉 https://t.co/vxEfc6mC3J http… La búsqueda de El Dorado sigue en https://t.co/zfND4UNMpW! Hoy encontrarán un video exclusivo de Shak cantando una nueva canción! ShakHQ Have you guys checked out the exclusive video of Shak singing a new song in the global goldspots today? https://t.co/zfND4UNMpW ShakHQ @AppleMusic El Dorado (26 de Mayo) - el nuevo álbum de Shak. Reservan su copia ahora @AppleMusicES y descarguen 5 canciones! https://t.co/P1tE1k4a6R SHQ https://t.co/q4oyteSxFt Shakira's new album El Dorado is out May 26. Pre-order it today on @AppleMusic and get 5 songs now! https://t.co/P1tE1k4a6R ShakHQ https://t.co/JmRESPHGD9 RT @educommission: The world’s children are at risk. Join @Shakira and ask #G20 leaders to make education financing a top priority. https:/… Here's Shak on the red carpet at the 2014 @BBMAs #TBT / Shak en la alfombra roja de los Premios @billboard! ShakHQ #throwbackthursday #bbmas https://t.co/0na6nJqD4y @ThePerezHilton You can still catch me in another part of the world very soon if you follow the map of Finding El Dorado! Shak RT @SeHablaRob: Estoy completamente #dead por haber visto a @Shakira en el parque. #ShakiraElDorado https://t.co/oTM7U16l2m About to surprise the hunters of El Dorado in NY! Shak #ShakiraElDorado https://t.co/pebTltCTNt A punto de sorprender en Nueva York a los buscadores de El Dorado! Shak #ShakiraElDorado https://t.co/bYOaEqm3eZ RT @VladyPop: OMG!!! Estoy apunto de descubrir que hay en este Tesoro @shakira @ShakiraElDorado #ElDorado https://t.co/7JnT3pOMEl NYC revisen sus puntos de acceso dorados, el más dorado de todos. Los veo pronto ;) https://t.co/zfND4UNMpW Shak https://t.co/9ROrdOTroF NYC check your goldspots, the goldest of them all. See you soon ;) https://t.co/zfND4UNMpW Shak https://t.co/vsf7c27llo RT @theirworld: Tomorrow, a crucial meeting will decide the agenda for the #G20 summit. We're joining @shakira in backing #IFFEd https://t.… RT @AppleMusic: Brand new @shakira is everything ❤️ #MEENAMORÉ\nhttps://t.co/8p6r3SrzjP Video exclusivo de Shak grabando Toneladas de El Dorado, video compartido en los goldspots esta semana  (-&gt; https://t.co/vDCrxkWTyO) ShakHQ https://t.co/D0hN17NCym Exclusive clip of Toneladas from El Dorado, as revealed in the goldspots earlier this week (-&gt; https://t.co/vDCrxkWTyO) ShakHQ https://t.co/5QmAHsIjTS RT @mitito_98: @shakira, omg 😍😍😍 esto me eriso la piel, ancioso por escucharla completa, esta hermosa...\n\n#ShakiraElDorado #Shakira #Nada h… @Beats1 @AppleMusic Este Sábado Shak estará en https://t.co/gQmGEkpl7O y compartirá las canciones de artistas latinos que la inspiran! SHQ @Beats1 @AppleMusic https://t.co/nCCMLLHqrr This Saturday Shak’s hosting a show on @Beats1 @AppleMusic-playing songs from the Latin artists who inspire her! https://t.co/gQmGEkpl7O SHQ https://t.co/YSCOjEUojQ RT @educommission: 📝 Join the petition: @Shakira is asking #G20 leaders to support better financing for global education. https://t.co/HjXC… Growing at light speed in 3 days 20 million! Incredible https://t.co/4KsXOVTrw2 Shak Este vídeo está yendo a la velocidad de la luz! En 3 días 20 millones - increíble! https://t.co/4KsXOVTrw2 Shak RT @aworldatschool: Join @shakira in standing up for education around the world. Send world leaders a message to back #IFFEd at the G20: ht… RT @Beats1: 💥 @Shakira Presents #ElDorado:\n🎙 She hosts 2 shows this weekend\n🎶 Album debut\n&amp; @oldmanebro interview 5/25\nDetails: https://t.c… RT @AppleMusicES: 💥 @shakira + @Beats1.\n🎙2 programas este fin de semana.\nPremiere de #ElDorado 25/5.\nDetalles en https://t.co/iI7eZ1wqPz ht… RT @Holaris27: @shakira #Milano and #Moscow #ShakiraElDorado treasures are unlocked https://t.co/BIx6vY03IG RT @ielosmeloss: @shakira En un parque que se llama los caimanes y he encontrado un make of y la letra de toneladas! https://t.co/BJ4DetKoL5 RT @arqmex: @shakira en #Cuernavaca #Morelos hay Un #GoldsPots de @ShakiraElDorado https://t.co/NxY1K4IMP1 RT @IIsDaviShak: @shakira Encontré dos 😎 #ShakiraElDorado https://t.co/VIGceGNxRf Ya han estado buscando El Dorado en https://t.co/smiNkcEgmW? Nos indican dónde están y qué tesoro encontraron? ShakHQ #ShakiraElDorado https://t.co/Wc1V6UJUsi So, who's been hunting for El Dorado at https://t.co/smiNkcEgmW? Let us know where you are and what treasure you've found!\nShakHQ https://t.co/oImS1V3Vts RT @theirworld: Have you signed with @shakira yet ✏️? Make a change this #MondayMorning - ask the G20 to back education: https://t.co/B5XDG… There's a new idea that could unlock $12bn to get kids into school. Join me and tell the G20 to back education: https://t.co/uHKAR82ceS Shak RT @IIsDaviShak: @shakira Encontré la letra de #toneladas #ShakiraElDorado 😲👏 https://t.co/PpCon5l8Zr Happy Mother's Day! Feliz día a todas las madres! Shak https://t.co/S6lm2tRIeJ 15m plays! 15 millones de reproducciones! https://t.co/4KsXOVTrw2 ShakHQ #MeEnamoréVideo La búsqueda de El Dorado sigue en https://t.co/zfND4UNMpW... Hoy encontrarán un tesoro muy especial: la letra de una canción del álbum! SHQ If you're hunting for El Dorado treasure today, look out for Shak's handwritten lyrics from the album... ShakHQ https://t.co/zfND4UNMpW Quieres ser una mosca en la pared durante el rodaje de \"Me Enamoré\"? Adelante...  https://t.co/4KsXOVTrw2 Shak https://t.co/rcBE3CPItV Do you want to be a fly on the wall during the \"Me Enamoré\" shoot? Go ahead... https://t.co/4KsXOVTrw2 Shak https://t.co/NmvAV21yez RT @SHAKITINILOCA: I discovered behind the scenes in @ShakiraElDorado @shakira #ShakiraElDorado #MeEnamoreVideo https://t.co/nqh6fPcWzH .@Spotify Ya pueden guardar el nuevo álbum de Shak, El Dorado en @spotify y lo tendrán en Su Biblioteca el 26 de Mayo! https://t.co/LEo3U2PQGY ShakHQ Pre-save Shak's new album, El Dorado, on @Spotify - and it'll be there in Your Library on May 26! https://t.co/LEo3U2PQGY ShakHQ RT @laundryluis: @shakiraeldorado @shakira #ShakiraElDorado #GoldsSpot descubri un video!! https://t.co/kdEMcpmHbQ 10m views! 10 millones de reproducciones! #MeEnamoréVideo ShakHQ https://t.co/4KsXOVTrw2 No se olviden de visitar los goldspots de #ShakiraElDorado ya que hoy encontrarán otro tesoro! Visiten -&gt; https://t.co/zfND4UNMpW ShakiraHQ https://t.co/cItEOccV2F New treasures added each day to Shak’s virtual goldspots. Tell us what you find on your hunt for El Dorado! ShakHQ https://t.co/7EtsVYVdpa Thank God someone caught my stellar basketball moment on film during the shoot of \"Me Enamoré\"! Shak https://t.co/595CUtb1ol #MeEnamoréVideo https://t.co/keD4Vtt1tH Gracias a Dios que alguien captó mi momento super estelar durante el rodaje de \"Me Enamoré\" Shak #MeEnamoréVideo https://t.co/595CUtb1ol https://t.co/o9ZaMtgCfj RT @fpiesdescalzos: Les animamos a que junten su firma a la de @shakira aquí -&gt; https://t.co/A9qL6mStMF &lt;- para que la educación sea una pr… RT @Shakira_Brasil: Have you heard about me and @Shakira? Come join us and back the #IFFEd plan to get millions of kids into school: https:… Millions of children don't get to go to school.But we have the chance to change that. Tell the G20 to back education https://t.co/v1HCtXqAw2 https://t.co/FXSeTEfuW7 5m views! 5 millones de reproducciones! #MeEnamoréVideo ShakHQ https://t.co/4KsXOVTrw2 https://t.co/wHf2e6wpd9 Aquí está mi nuevo video \"Me Enamoré\" con mi invitado favorito! Shak https://t.co/4KsXOVTrw2 Here’s my new video for \"Me Enamoré\" with my favorite guest star! Shak\nhttps://t.co/4KsXOVTrw2 Look what I do to my favorite cameraman! In 90 minutes ... / Miren lo que hago con mi cámara favorito! En 90 minutos ... Shak https://t.co/uok9mYisy8 Pre-order Shak’s new album, El Dorado (out 26 May) on @applemusic now and download five songs from it today ShakHQ https://t.co/P1tE1k4a6R Reserven el nuevo álbum de Shakira, El Dorado (disponible 26 Mayo) en @applemusic y descarguen 5 canciones hoy! SHQ https://t.co/P1tE1k4a6R Muy buen trabajo! Ya descubrieron el listado de las canciones de #ShakiraElDorado. Mañana más tesoros! ShakHQ https://t.co/IlWdp7zxAI Good work! You unlocked the full \"El Dorado\" tracklisting. More treasures coming tomorrow... ShakHQ #ShakiraElDorado https://t.co/wdAppLzAXC RT @shakira: Quieren conocer la lista de canciones de El Dorado? Escondí los títulos en varios goldspots. La búsqueda empieza ya. https://t… Quieren conocer la lista de canciones de El Dorado? Escondí los títulos en varios goldspots. La búsqueda empieza ya. https://t.co/vDCrxkWTyO https://t.co/nD9srMBIhC Want to know the tracklisting for 'El Dorado'? I've hidden the song titles in goldspots all over the world. Go hunt! https://t.co/7EtsVYVdpa https://t.co/huNZVtaG36 Feliz de anunciar el lanzamiento el 26 de Mayo de mi nuevo álbum \"El Dorado\" Shak #ShakiraElDorado https://t.co/2hSGDAVKgN So happy to announce my new album \"El Dorado\"- out 26th of May! Shak #ShakiraElDorado https://t.co/PiiHCMKcrp 64 pieces sent! 64 piezas mandadas! Good luck! Mucha suerte! ShakHQ #ShakiraElDorado RT @Philip_cur: CADA VEZ MÁS CERCA #ShakiraElDorado @ShakiraElDorado @shakira Sencillamente hermosa! Un tesoro único envuelto en oro &lt;3 &lt;3… RT @MarkoShak: I AM DOING A MESS, TOO EXCITED @shakira @ShakiraElDorado #ShakiraElDorado https://t.co/2xbi1zv24c .@ShakiraElDorado Acompáñenme en la búsqueda de #ShakiraElDorado! Envíen tweet @shakiraeldorado para recibir una parte de la portada de mi nuevo álbum! Shak Join me on the search for El Dorado! Tweet @Shakiraeldorado using #ShakiraElDorado to discover a piece of my new album art! Shak Humo rojo durante el rodaje de mi video \"Me Enamoré\", muy pronto! / Getting fired up for the \"Me Enamoré\" video! Coming soon… Shak https://t.co/JZUblAJ68o RT @despiertamerica: ¿Quieres conocer a @shakira? Sube una foto con el amor de tu vida en #Twitter, usando #MeEnamoreEnDA y cuéntanos tu hi… Jamming out to “Me Enamoré” on the radio! / Me gusta cómo suena “Me enamoré” en la radio! Shak https://t.co/9T7m7k1w48 Shakira conoció ayer a la ganadora del concurso de Chantaje durante un partido del FCBarcelona! Aquí el video https://t.co/B2U2lbiQfz ShakHQ Watch our amazing #ChantajeChallengeContest winner meet Shak at yesterday's FC Barcelona game! ShakHQ https://t.co/B2U2lbiQfz Anoche en el partido con Charlotte, la ganadora del concurso de Chantaje! Shak #ChantajeChallengeContest https://t.co/a6AZJSZlhu Last night at the match with Charlotte, the winner of the Chantaje contest! Shak #ChantajeChallengeContest https://t.co/gPV6nX1FmF RT @FundlaCaixa: Algunos de los participantes de #DesafíoEmprende han podido conocer a @shakira. Increíble experiencia para finalizar estos… Editando el video de \"Me Enamoré\"! Shak. #MeEnamoréVideo https://t.co/27Nna21jnw Visitor on set! #MeEnamoréVideo https://t.co/SUOmEE0k8m 🎶Un mojito, dos mojitos… 🎶 \n#MeEnamoréVideo https://t.co/WUVOPbzBvS Están viendo correctamente! \"Mariposas en el estómago\" y en los brazos! Shak https://t.co/txXPCeXeN7 Yes, you are seeing right. Those are real butterflies on my stomach and on my arms! Shak #MeEnamoréVideo https://t.co/h5CKuMqYyZ Me encanta la historia de esta pareja! Shak https://t.co/8k8pileUZO En el set rodando mi nuevo video “Me enamoré” / On set filming my new video for “Me enamoré” Shak https://t.co/wnRUdPRvwz 😍 #ShakiraMeEnamoré ShakHQ https://t.co/9eAgLnkB23 Having my Khaleesi moment in my new video for \"Me Enamoré\" / Momento Khaleesi en  el rodaje de mi nuevo vídeo \"Me Enamoré\"!! Shak https://t.co/vxukT2MW6v Qué viva el amor! Shak https://t.co/MS824iinTl El video con la letra de \"Me Enamoré\" tiene 20 millones de reproducciones en 20 días! ShakHQ https://t.co/zJnYvTGe5g The lyric video for \"Me Enamoré\" has had 20 million views in 20 days! ShakHQ https://t.co/zJnYvTGe5g ... So cute! Shak https://t.co/8r8qlHYM04 Loving this acoustic #MeEnamore cover by Yuleima! Nos encanta esta versión en acústico de #ShakiraMeEnamoré realizada por Yuleima! ShakHQ https://t.co/36mXRKyzAp No se pierdan la entrevista que Shak dio a @Telemundo en la que habló de Me Enamoré, su próximo álbum y gira https://t.co/0xURamcfXq ShakHQ RT @elianashak: @shakira #MeEnamore #shakirameenamore #FeLi https://t.co/04dWx2TpvF #ShakiraMeEnamoré @Flipagram https://t.co/v01MZAF2Gp #ShakiraMeEnamoré https://t.co/fApCaw9aGt I'm so moved by all these love stories! Me emocionan todas estas historias de amor! Qué viva el amor! Shak https://t.co/D2QONTx8I5 Yo también soy fan de Sara y de Iker! https://t.co/mPMzbM1KMx Shak RT @luis__lozada: Me enamoré, me ena-na-moré ❤\nLo ví solito y me lancé 😍❤\n#ShakiraMeEnamore #ShakiraMeEnamoré #Shakira @shakira #LoveHistor… RT @arqmex: Asi mi historia #ShakiraMeEnamoré #MeEnamoré @shakira  #Shakira  #Flipagram creado usando @flipagram https://t.co/Xgkrvehrvs RT @OzkarGeovani: #MeEnamoré de #TommyGeovani el es mi gran alegría de toda mi vida. #IAmRockMX #IAmRock @shakira #ShakiraMeEnamoré 💙🐶☺💙 ht… Love this cute couple's video! Send me yours! Shak #ShakiraMeEnamoré https://t.co/1apGxcCVY8 Me encanta el vídeo de esta pareja! Envíenme los suyos! Feliz Sant Jordi! Shak #ShakiraMeEnamoré https://t.co/xj6u1MNQCJ #ShakiraMeEnamoré 👬 https://t.co/Ve1NLsViXT RT @Flipagram: Create a video with @shakira's new single &amp; tag #shakirameenamore on Flipagram for the chance to be featured! 🎶 #newmusicfri… No se pierdan hoy el especial de @Telemundo: Detrás de la Fama con una entrevista exclusiva a Shak. Será a las 10pm/ 9 Centro! ShakHQ https://t.co/cpAyuzQJcc .@Flipagram @FChristos Nos encantan los videos que están subiendo contando sus historias de amor! Suban sus vídeos con #ShakiraMeEnamoré  ShakHQ https://t.co/ZabycPEwLa We're loving your #ShakiraMeEnamore love story videos - keep your tales of romance coming! @Flipagram by @fchristos ShakHQ https://t.co/ULwbD1M7nc RT @Bmesrimes: Le making of du clip \" Comme moi \" avec @shakira 💃💃💃💪🏿💪🏿💪🏿 #Bonweekend #ETERNELINSATISFAIT https://t.co/0LJ3q0WGTM https://t… Here’s Shaks new @musicallyapp of \"Me Enamoré\"! Aquí les compartimos el último @musicallyapp de Shak con #MeEnamoré! ShakHQ https://t.co/ZKPHYq4Geu RT @Bmesrimes: Le making of du clip \" COMME MOI \" avec @shakira est disponible sur ma chaine youtube https://t.co/0LJ3q0WGTM 🔥 https://t.co… .@Vevo y Shak es el quinto artista con más reproducciones en @Vevo! ShakHQ https://t.co/po6zcDfJDw .@Vevo El video de La La La (versión en español) es el 16o video que llega a los 100 millones de reproducciones! https://t.co/5lHlIY9zfA  ShakHQ La La La (Spanish version) is Shak’s 16th video to hit 100m views (&amp; she’s @Vevo's 5th most-viewed artist ever!) https://t.co/6JhsB8ucD0 SHQ RT @FundlaCaixa: Recordamos el compromiso por la educación con @Shakira y @FundacioFCB. ¡La nueva escuela @fpiesdescalzos será pronto una r… RT @Flipagram: Welcome to Flipagram, @shakira! #WCW 💃🏻#flipagram #flipagramcreator #flipagrammer #flipnmove #featuremyflip #flipalove https… Shak tiene un nuevo perfil en @flipagram! Visiten la aplicación y compartan sus historias de cómo se enamoraron usando \"Me Enamoré\" ShakHQ https://t.co/3jdKrxBp9V Shak has a new @flipagram profile - head over there to share your photos and videos with a #ShakiraMeEnamore soundtrack! ShakHQ https://t.co/aqMdgdPdFE I love seeing how you guys are having fun with \"Me Enamoré\"! / Me encanta ver cómo se divierten con \"Me Enamoré\"! Shak https://t.co/L4rjvpy4RN Pintando huevos de Pascua! Felices Pascuas!! / Painting Easter eggs! Happy Easter!! Shak https://t.co/7iEIQZ4u4U RT @AhmedJr: @shakira Pasa en la vida real , pasa en el Video Lyric 😅 https://t.co/S3npAusVmt 10 million plays for the Me Enamoré lyric video! 10 millones de reproducciones! https://t.co/zJnYvTGe5g \nShakHQ https://t.co/m4eCZwIVao .@jesuskp25 La ilustración de un fan (@jesuskp25) para mi nueva canción \"Me Enamoré\"  recordando una época en la que abrazaba árboles! Shak https://t.co/aevTVcl7xo Cute fan illustration of my new single Me Enamoré portraying a time when I was hugging every tree! Shak https://t.co/v2fcU1MLe3 RT @MovimientoALAS: Imágenes de las primeras #cunasconamor que enviamos a #Mocoa, gran colaboración con @camilacooper86 @PatrullaAerea por… RT @Deezer: .@shakira’s ‘Me Enamoré’ is our #TrackOfTheDay 💃 \nCheck out her new single ▶️ https://t.co/Hc53g5oSwa #MeEnamoré https://t.co/c… .@Spotify Ya pueden escuchar el nuevo sencillo de Shak, Me Enamoré, en la playlist New Music Friday Latin de @Spotify! ShakHQ https://t.co/Ijoq16WKUl Check out Shak’s new single, Me Enamoré, on @Spotify’s New Music Friday Latin playlist! ShakHQ  https://t.co/Ijoq16WKUl RT @univisionent: .@shakira le contó a @chiqui_delgado sobre el trabajo más difícil de su vida y cómo nació la canción #MeEnamoré. https://… RT @PrinceRoyce: Más de 50 millones de views en 2 semanas - ¡GRACIAS! Keep watching 😉 https://t.co/4yg9NBpgnM #DejavuVideo @shakira https:/… RT @HITRADIOMA: \"Me Enamoré\" &lt;3 Le nouveau Hit de @shakira qui nous donne envie de danser ! Tu l'as écouté ?\nhttps://t.co/paMoNAKNZX .@billboard @BBMAs Thank you @billboard for these two nominations in the same category for Chantaje &amp; La Bicicleta! #BBMAs Shak https://t.co/r5vhc1Dk92 Gracias @billboard por estas dos nominaciones en la misma categoría para Chantaje y La Bicicleta! #BBMAs Shak https://t.co/oP7uRFR4ph No se pierdan esta entrevista de Shak con @univision en la que habla de su nuevo sencillo, Me Enamoré. ShakHQ https://t.co/idtgTPDUAD RT @Vevo: Shak is back! Watch the lyric video for @Shakira's new track #MeEnamoré now: https://t.co/8I2s6qTEO3 https://t.co/odEXaxZUel Por si no lo vieron, el video con la letra de Me Enamoré fue lanzado ayer. Lo tienen aquí: https://t.co/zJnYvTGe5g ShakHQ https://t.co/0xdWmcgO2e In case you missed it, Shakira's new song Me Enamoré came out yesterday! Watch the lyric video  now. ShakHQ https://t.co/zJnYvTGe5g https://t.co/SbHhq9b2nj RT @Spotify: .@Shakira's new single is here! We know what we'll be playing on repeat this weekend. https://t.co/Yf2XLMWYk9 RT @Vevo: Shak is back! Watch the lyric video for @Shakira's new track #MeEnamoré now: https://t.co/8I2s6qC3Wv https://t.co/gzlPSOeHlr Mil millones de reproducciones con Chantaje el día del estreno de Me Enamoré! Mil gracias a todos. Los quiero! Shak https://t.co/cuSS50DOpM RT @LoMas_40: Sonando #MeEnamore lo nuevo de la reina!!! Bravo @shakira!!👏🏼👏🏼😍😍😍 Te la acaba de poner @xavimartinez en #FuegoEnLoMas40 Ya pueden escuchar / descargar la nueva canción de Shak, #MeEnamoré aquí -&gt; https://t.co/AKqmrZYw4f ShakHQ https://t.co/EUoREnwmpE Stream / download Shak’s brand new single, #MeEnamoré, now! -&gt; https://t.co/oqr2qX5bkd ShakHQ https://t.co/EUoREnwmpE RT @RubenRengifo208: #MeEnamoré ya disponible @shakira iTunes//Apple Apoyando esta hermosa canción 😍\nhttps://t.co/54Vst0xAfC https://t.co/i… RT @selenagomezalg: I Just bought @Shakira New single. #MeEnamoré is out now on iTunes/AppleMusic (link: https://t.co/yR6xbFsunL) https://t… Here it is! My new single \"Me Enamoré! \"/ Aquí está! Mi nueva canción \"Me Enamoré!\" Shak #MeEnamoré https://t.co/zJnYvTGe5g Tomorrow / Mañana #MeEnamoré https://t.co/mlbEQ7vroj RT @romii_days: Cuando sos grosa y @shakira te manda una postal avisandote de su nuevo tema 🙄😍😘😘 GRACIAS!!!!… https://t.co/bVeIDM2cQZ Les gustó mi sorpresa?  Mañana más! Muah!!! \nDid you like my surprise? Tomorrow more! Muah!!! \n#MeEnamoré Shak https://t.co/cNPh59dJhB RT @Jouzeffer: @Shakira recebi seu presente e #MeEnamoré!\nTenho certeza que vai ser um sucesso!\n\n🇧🇷 Volta logo que nós do Brasil já estamos… \"Shakira envía varias postales a sus fans de todo el mundo para anunciar su nuevo single\" https://t.co/KrFkh68EnL ShakHQ #MeEnamoré RT @fabgoba: #MeEnamoré de @Shakira desde el 96... por su forma de ser, de trabajar, de soñar... sigue soñando y sigue trabajando por tus s… RT @JonhaShase: #MeEnamoré de @shakira desde que por ella entendí que la musica no solo se escuchaba sino también se sentía, se lloraba y s… RT @elGorisVillacis: #MeEnamore de @shakira hace 20 años cuando me enseñó q puedo quitarle al tiempo los segundos Y pateando las piedras si… RT @Dams5: #MeEnamore de @shakira en el 96' cuando vi por 1ra vez el vídeo de #EstoyAquí, desde ahí, cada vez q la veo o escucho me enamoro… RT @rEsEnDiZMX: OMG! #MeEnamoré ¡Gracias a @shakira x este detallazo! Ya llegó a mis manos la portada del nuevo single, no puedo esperar pa… RT @miguelgalindo01: #MeEnamoré de @shakira cuando me enseñó que todo lo que no se quiere se mata y qué basta mandarle flores para obtener… RT @shakpulines: ¡¡¡Mireeeeen lo que nos llegó!!! @Shakira se acordó de nosotros &lt;3 @shakpulines  @sonymusicmexico  @shakma1983 #Shakpuline… RT @maricelahhhh: #MeEnamoré when I was 10 yrs old, little did I know that the ECD field would become my passion cause of her influence. Gr… RT @aleenajera: #MeEnamore de @shakira a los 7 años ya tengo 25 y me convertí en  maestra bajo la influencia de mi Shak! Por siempre mi fav… RT @SHAKITINILOCA: @ShakiraMedia @shakira @shakira Yo  #MeEnamoré 💞 en  1995 cuando la mire tenia algo especial la forma de cantar me encan… RT @ClubShakSpain: Gracias @shakira por acordarte siempre de todos tus fans y del club oficial de España. https://t.co/vjpVR3AErw RT @GabAntunez: 🇦🇷¡Qué lindo llegar a la oficina y recibir este hermoso regalo de @Shakira! Gracias por este lindo gesto ❤️\nAnsioso por esc… RT @GabAntunez: ¿Se puede ser tan tierna? Gracias @Shakira por este regalito. Estos pequeños detalles hacen un mundo de felicidad para noso… RT @Nicholas_Zarate: Escalando árboles! @shakira  #meenamoré https://t.co/dzQImZDj4r RT @Nicholas_Zarate: ¡Qué sorpresa! Recibí un sobre de @shakira  Muchas gracias por el lindo gesto! Ansioso por escuchar #meenamoré 😘 https… RT @Anita_Soria: Escalando árboles. Feliz por recibir tu carta @shakira Te extrañamos en Argentina!! #MeEnamore https://t.co/78pEopfDbW RT @LautBarrientos: Hola @shakira, ya recibí lo que me mandaste. Con cara de dormido y todo acá va mi selfie 🤳 GRACIAS POR ESTE HERMOSO MEN… Avez vous vu le nouveau clip #CommeMoi avec Shak et @Bmesrimes? https://t.co/B7HECQmpoH ShakHQ https://t.co/JDKfOUMsTL \"Do you remember how u used to get lost in my eyes?...I remember\" @Bmesrimes #CommeMoiVideo -&gt; https://t.co/B7HECQmpoH https://t.co/U74xbEfbb6 .@Bmesrimes Ya han visto el nuevo video de Comme Moi con @Bmesrimes? https://t.co/B7HECQmpoH ShakHQ https://t.co/rVjnRiLsvq Have you watched Shak's vibrant new video for Comme Moi with @Bmesrimes? ShakHQ https://t.co/B7HECQmpoH https://t.co/Tfftymi0CH RT @NRJhitmusiconly: Et si on se matait le clip #CommeMoi de @Bmesrimes et @Shakira ? Ça, c'est un puuuuur hit #NRJ ! ➡️ https://t.co/FoncM… Mi bebito deportista! My little athlete! Shak https://t.co/kTiQ6JITl4 RT @uniceflac: La protección y asistencia a niñas y niños debe de ser una prioridad en #Putumayo. #TodosConMocoa Dona ahora! -&gt; https://t.c… RT @JuanManSantos: Para las personas que quieran hacer aportes se habilitó la cuenta de ahorros 021 666 888 del banco Davivienda #TodosConM… RT @unicef_es: Consternados por la tragedia en #Mocoa #Colombia. Los niños siempre los más vulnerables. Atentos a las noticias y a la neces… RT @uniceflac: [URGENTE] ¡Los niños y niñas de Putumayo necesitan tu ayuda! #TodosConMocoa Dona ahora -&gt; https://t.co/ktxJuOtGDO (2/2) Hago una llamada a toda la ayuda humanitaria posible para los afectados. Shak https://t.co/0ip8jiZ75F Acompaño con mis oraciones a las víctimas de esta tragedia ocurrida en mi país (1/2) RT @Shakira_Brasil: 🇧🇷 Assista Comme Moi, novo clipe de Shakira e Black M.\n🇫🇷 Regarder Comme Moi, le nouveau clip de Shakira et Black M.\nht… RT @VevoFrance: C'est le duo surprise de la semaine, @Bmesrimes et @shakira​ font la paire dans le clip \"Comme moi\"! #Commemoivideo →https:… .@Bmesrimes Trabajar en este video fue tan diferente y divertido! Gracias @Bmesrimes fue un placer! Shak https://t.co/mZTwg67d87 https://t.co/WVBzW9NclR This video was so different and cool to work on, thank you @Bmesrimes it was a pleasure! Shak https://t.co/mZTwg67d87 https://t.co/i4THhUvsx5 @ThePerezHilton Muahhhh!😘😘😘 Shak #CommeMoiVideo @Bmesrimes --&gt;&gt;https://t.co/B7HECQmpoH https://t.co/HhBNuHE0OP RT @ThePerezHilton: We finally got a video!! @Shakira keeps slaying the game internationally! https://t.co/lYoncl8oYz RT @Bmesrimes: #COMMEMOIVIDEO feat. @shakira enfin disponible  #Eternelinsatisfait \n\nhttps://t.co/36Nvsdnb7o https://t.co/413Zz80t8z .@Bmesrimes Ya está aquí - mi nuevo video para Comme Moi con @Bmesrimes! #CommeMoiVideo Shak https://t.co/x7QNEbi2xI .@Bmesrimes It’s finally here - my new video for Comme Moi with @Bmesrimes! #CommeMoiVideo Shak https://t.co/B7HECQmpoH Le voilà enfin - mon nouveau clip vidéo de Comme Moi avec @Bmesrimes ! Shak https://t.co/B7HECQmpoH In one hour / En una hora / Dans une heure … #CommeMoiVideo @Bmesrimes ShakHQ https://t.co/0zOO4qyO5z Tomorrow / Mañana /Demain ... 6pm Paris / 12pm EST #CommeMoiVideo @Bmesrimes ShakHQ https://t.co/fHZtZOksNv Feeling yellow! Shak https://t.co/8dyPtC9Tf1 RT @FundlaCaixa: Comprometidos con la educación en Colombia cc @fpiesdescalzos @shakira y @FundacioFCB #EscuelasPorElFuturo https://t.co/SE… RT @TenorioStephani: No lo hago como @Shakira y @PrinceRoyce pero hago el intento y sin pareja😂 lo importante es disfrutarlo #DejaVuBachata… Shak and @PrinceRoyce want to see your #DejavuBachata videos! Shak y Prince Royce quieren ver sus videos bailando #DejavuBachata! ShakHQ https://t.co/SMxT65xzt8 RT @FCBarcelona_es: 🔊 @shakira: “El FC Barcelona es un verdadero ejemplo de filantropía” https://t.co/amJ8i5BHXN https://t.co/P0TmWymyZL RT @FCBarcelona: 🎥 @shakira: FC Barcelona sets a great example as a philanthropic institution https://t.co/V3pOA4CQQ3 https://t.co/g4bW0YGs… Nuestro tutorial para bailar bachata! / Our tutorial on how to dance bachata! \n#DejavuBachata Shak @PrinceRoyce https://t.co/XGTApKXZtW RT @YouTube: Stop us if you’ve heard this one before … \n\n@PrinceRoyce and @shakira team up for “Deja Vu” → https://t.co/LkS7cXd970 https://… El ‘Deja Vu’ de Shakira y @PrinceRoyce, casi 20 millones de visitas en cuatro días https://t.co/y7j1RXni74 ShakHQ via @mundodeportivo RT @fpiesdescalzos: Cuando logramos unirnos suceden grandes cosas. ¡Soñamos nuevo Bosque! @FundacioFCB @FundlaCaixa @Mineducacion @alcaldia… La @fpiesdescalzos, @FundacioFCB y @FundlaCaixa se unen para construir una nueva escuela en Barranquilla! https://t.co/YrwfRbmvnO ShakHQ https://t.co/6SaUZEuZY1 Shakira’s foundation, @fpiesdescalzos, unites with @FundlaCaixa &amp; @FCBarcelona to build a school in Colombia! https://t.co/sBwxe7oPRS ShakHQ https://t.co/yfK8R6ZQZ9 RT @AlejandroChar: Agradecemos a @shakira por su decidido compromiso de hacer equipo con nosotros para ofrecer la mejor educación a los niñ… RT @FundlaCaixa: Impulsamos Institución Educativa Fundación Pies Descalzos Nuevo Bosque en Barranquilla, con @FundacioFCB y @shakira #Escue… RT @FundlaCaixa: Presentamos Institución Nuevo Bosque, 7ª escuela de @fpiesdescalzos en Barranquilla, con @FCBarcelona_es y @shakira #Escue… RT @FundacioFCB: Presentamos, con @FundlaCaixa y @shakira, la 7ª escuela de @fpiesdescalzos en Barranquilla #EscuelasPorElFuturo https://t.… Desde el Camp Nou con Jordi Cardoner de FCB y Xavi Bertolin de @FundlaCaixa anunciando el nuevo colegio @fpiesdescalzos en Barranquilla https://t.co/Y6RTfUsC9Z RT @PrinceRoyce: Impresionante todo su apoyo ¡GRACIAS! #DejaVuVideo @shakira - https://t.co/4yg9NBpgnM https://t.co/I383E9sKJ0 \"Shakira’s Bachata Moves Are Fire In ‘Deja Vu’ Music Video\" (via @HuffingtonPost) ShakHQ https://t.co/aQtDxgQNtD RT @PrinceRoyce: #DejaVuVideo https://t.co/m6UwgwmCK7 https://t.co/xQzLGXl1vD 15 Million / 15 Millones! ShakHQ  #DejaVuVideo @princeroyce  https://t.co/n6WqGYmLHv https://t.co/5UEBQuyWTO \"Shakira arrasa con el lanzamiento de su nuevo videoclip 'Deja Vu' junto a @PrinceRoyce\" vía @antena3com ShakHQ https://t.co/p6PXL9s8Fe RT @PrinceRoyce: Feliz y agradecido con todos ustedes! Over 8 MILLION views in 1 day 💥 #DejaVuVideo @shakira https://t.co/m1V41RcyfQ RT @PrinceRoyce: #DejaVuVideo https://t.co/4yg9NBpgnM https://t.co/tJfAose5VQ Amazing, more than 6 million views in the first day! I think I'm having Deja Vu! Shak https://t.co/x01Cr81L6u Increíble, más de 6MM de visitas en un día! Creo que estoy teniendo un dejavu! Shak https://t.co/mSzM2k3E3R RT @Vevo: .@PrinceRoyce &amp; @Shakira's dance moves in #DejaVu are going to make you want to take bachata classes ASAP. Watch now https://t.co… RT @PrinceRoyce: Agradecido por todo el apoyo! Sigan viendo mi nuevo video junto a @shakira #DejaVuVideo aquí: https://t.co/4yg9NBpgnM http… RT @FundacioFCB: El martes presentaremos un nuevo proyecto con @fpiesdescalzos y @FundlaCaixa. ¡Por una educación innovadora! @shakira #Esc… RT @PrinceRoyce: Check out the #DejaVuVideo @shakira 🔥🚀😎https://t.co/4yg9NBpgnM https://t.co/iZldaG0f1D RT @nyesy02: DO YOU HEAR ME SCREAMING #DejaVuVideo HAS 3.1 MILLION VIEWS &amp; #1 TRENDING 💕💕😭😻🎶 @PrinceRoyce @shakira https://t.co/fhyQCzBWN6 Ya han visto el nuevo video de Shak y @PrinceRoyce , Deja Vu? Lo encontrarán aquí https://t.co/n6WqGYmLHv ShakHQ https://t.co/jsAbet0iCg In case you missed it, check out Shak's new video for Deja Vu with @PrinceRoyce! https://t.co/n6WqGYmLHv\nShakHQ https://t.co/pUBdw9qTaD RT @univisionent: @Shakira​ y @PrinceRoyce​ nos deleitan con esta bachata. ¿Ya viste el video? Aquí está completo https://t.co/YUfgvcGLj3 h… RT @PrinceRoyce: #DejaVuVideo DISPONIBLE YA! https://t.co/Owe25EPbtc @shakira @vevo It’s finally here — my new video for Deja Vu with @PrinceRoyce! #DejaVuVideo https://t.co/lpYPYRZdh5 Shak Ya esta aquí — mi nuevo video para Deja Vu con @PrinceRoyce!  Shak  https://t.co/lpYPYRZdh5 #DejaVuVideo En una hora... In one hour #DejaVuVideo @princeroyce https://t.co/pPAjvUddnZ RT @despiertamerica: @PrinceRoyce escogió a #DespiertaAmerica para presentar su video #DejaVu a dueto con  @shakira ... ¿Qué le preguntaría… RT @PrinceRoyce: Nuevo video #DejaVu MAÑANA! / New video #DejaVu TOMORROW! @shakira https://t.co/N2a3hzjRfB Mañana / Tomorrow ... #DejaVuVideo estreno / premiere. ShakHQ @princeroyce https://t.co/4JVx0rAAfm Check out Shak's latest @musicallyapp video! No se pierdan el último musical.ly de Shak! ShakHQ https://t.co/t3r3mw2I7e #DreamTeam! Shak https://t.co/oBi2h4tE2T 🎵Tú me abriste las heridas \nQue ya daba por curadas\nCon limón, tequila y sal🎵 #DejaVu con @PrinceRoyce https://t.co/rOydtMr3wO Gracias a todos por participar en el #chantajechallengecontest Fue muy difícil decidir. @charlottediek, buenas noticias, vienes a Barcelona! https://t.co/cZ9Pwqm5kn Thanks to all who took part in the #chantajechallengecontest-it was tough to decide but @charlottediek good news you're coming to Barcelona! https://t.co/cZ9Pwqm5kn My favorite Bachata dancer! Mi parejo favorito de Bachata! Shak https://t.co/bQoFkZq2tw Coming soon ... / Próximamente... ShakHQ https://t.co/CP8RtosKSQ Seguimos practicando bachata para nuestro video Deja Vu! Shak @princeroyce https://t.co/aAD71ZwBiW So happy about how my new album is coming together... celebrating in the studio with my 'Afro Puffs'! Shak https://t.co/gctJ92ycFm Feliz de como está quedando mi nuevo álbum. Celebrándolo en el estudio!  Shak https://t.co/dKrM6PW3q6 Aprobando la mezcla de \"When a woman\" para mi nuevo álbum. Me encanta esta canción! Shak https://t.co/90Ox52Xj8e Just approved an awesome mix of \"When a woman\" for my new album! Can't get enough of this song! Shak https://t.co/1sQSqBbdiT Here is Shak's Deja vu musical.ly! / Aquí está  Shak con el @musicallyapp de #Dejavu con @princeroyce! ShakHQ https://t.co/SNZZSFGftb Me encantan los dibujos que me envían!! / I love the drawings you guys send me! Shak https://t.co/fMTPChutId RT @RIAA: + the most recently released RIAA Diamante song! Congratulations @shakira! @SonyMusicLatin https://t.co/IrO3GeWstZ Chantaje, certificado Diamante  (10x Platino!) por @RIAA en los EUA - siendo una de las 9 canciones que logran esta certificación! ShakHQ https://t.co/r6jcyRPCfL Chantaje has been certified Diamante (10x Platinum!) in the U.S. by the @RIAA - one of only 9 songs ever to achieve that! ShakHQ https://t.co/EUKcKAmM88 Practicando mi bachata en el set de nuestro video! Estará listo muy pronto... Deja Vu! @PrinceRoyce Shak https://t.co/k1QNcahSl8 Practicing my bachata on the video set! Get ready for it…coming soon Deja Vu the video! @PrinceRoyce Shak https://t.co/l03H7JWL74 Qué momento!!! Y qué bonito es el fútbol!!! https://t.co/GOkWyEjUdS Un momento para los anales de la historia!!! Shak https://t.co/I4HSJeKLCm RT @fpiesdescalzos: ¡Por ellas y el reconocimiento de sus derechos todos los días! #DíaInternacionalDeLaMujer https://t.co/rBuNG8NHAK RT @FundlaCaixa: A las mujeres que, como @shakira, luchan por la educación de los jóvenes: GRACIAS #DíaInternacionalDeLaMujer #womensday @f… 3 of the most amazing women I know! Congrats to all the super girls on our team &amp; all of us around the world on this #InternationalWomensDay https://t.co/bdxAM8bZAp 3 de las mujeres más extraordinarias que conozco! Felicidades a todas nosotras alrededor del mundo en este Día Internacional de la Mujer! https://t.co/4WQjDesEhJ RT @PrinceRoyce: Join the #DejaVuChallenge on @musicallyapp. Let me see what you got 😜 @shakira #PrinceRoyceFIVE https://t.co/pKkJHPjAoz On the set of the Deja vu video with @PrinceRoyce / Durante el rodaje de Deja vu con Prince Royce. Shak https://t.co/mRWtxpvzVq #Chantaje, 800m views! Chantaje, 800 millones de reproducciones! ShakHQ https://t.co/hF1MESxQUR https://t.co/7KGlhcZsDd RT @ByronPHoward: On its 1-year release anniversary, a huge personal thank-you to all the fans everywhere for their support of #Zootopia ov… Two hours playing today with Mikitani. \n(I know, a tad too much pink!) Shak https://t.co/6KvNpw109D RT @Spotify: Thank you to our 50 million subscribers. #Spotify50 https://t.co/eXkOV71bwu No se pierdan el video con letra de la nueva canción de Shak con @PrinceRoyce: Dejavu - que podrán ver aquí https://t.co/mtarxkR4t3\nShakHQ https://t.co/0bQnQpsw0X Check out the lyric video for Deja Vu, Shak's new song with @PrinceRoyce - and watch the full thing at https://t.co/mtarxkR4t3 ShakHQ https://t.co/SEB9Pl3e1v #Zootopia con la participación estelar de Gazelle ganó un Oscar anoche: Mejor Film de Animación! Felicitaciones en tu premio Gazelle! ShakHQ https://t.co/3WqwMzhcEh .@DisneyZootopia - which features Shakira as Gazelle - won the Academy Award for Best Animated Film! Congrats on your Oscar, Gazelle! ShakHQ https://t.co/dKlvzI2YJE Con el equipo cuando Gazelle nació! Celebrando el Oscar de anoche y muy orgullosa de formar parte del equipo de @DisneyZootopia ! Shak https://t.co/cAnOpnbsM4 With the team when Gazelle was being born. Celebrating the Oscar and proud to be a part of the @DisneyZootopia team! Shak https://t.co/qW3Mytsf6k Actitud de viernes con La Bicicleta! https://t.co/yMULRBFhWF RT @fpiesdescalzos: Hace tres años inauguramos un sueño  🎁🎈🎊 Ellos son los niños que el 24 de febrero del 2014 iniciaron con nosotros este… No se pierdan el video con la letra de Deja Vu, la nueva canción de Shak con @PrinceRoyce ShakHQ https://t.co/DDGUNqqeM0 Check out the official lyric video for Deja Vu, Shak’s new song with @PrinceRoyce! ShakHQ https://t.co/DDGUNq8Dnq Que alegría poder compartir con mi compatriota @CarlosVives nuestro triunfo de anoche @premiolonuestro. Gracias a todos por hacerlo posible! https://t.co/TsoQVmyiuq @ThePerezHilton Yes! Both very soon! RT @SDG_Academy: Bettering #EarlyChildhoodDevelopment globally is a target for 2030. Be part of the solution: https://t.co/7KlZNlEeOX #SDGs… Getting ready to shoot with @Bmesrimes  / Je m'apprête à tourner avec Black M / Preparándome para rodar con Black M \nShak https://t.co/EwpvFko2qB RT @PrinceRoyce: New single #DejaVu with @shakira available now on @AppleMusic! https://t.co/gpJWzlJNpg #PrinceRoyceFIVE https://t.co/AxXIQ… RT @SofiaVergara: #countryclubdebarranquilla #readyforcarnaval2017💃💃💃🎉🎉🎉 https://t.co/LrOISiwVt9 Están listos para un poco de bachata con @PrinceRoyce? #Dejavu ya está disponible! Shak https://t.co/WJ91xprrFM Ready for some bachata with @princeroyce? #Dejavu, out today! Shak https://t.co/5JyQek7IuG Ya disponible! Deja Vu, la nueva canción de Shak con @PrinceRoyce! Escúchenla en  @Spotify aquí -&gt; https://t.co/Qb6ziMlPrm ShakHQ https://t.co/Kbc4lvBQU5 Out today! Deja Vu, Shak’s new track with @PrinceRoyce! Listen to the song on @Spotify -&gt; https://t.co/Qb6ziMlPrm ShakHQ https://t.co/EFnpphkLEZ RT @PrinceRoyce: ¿Están listos? Nuevo sencillo mañana --&gt; #DejaVu junto a @shakira #PrinceRoyceFIVE https://t.co/Ohb6Lnfbde RT @juegaterapia: Siente la energía positiva de nuestro spot #Resistiré ¡Vamos a ganar al cáncer por KO! #CancerInfantil https://t.co/fZCfC… RT @AlejandroSanz: Hoy celebramos que son héroes y que, entre todos, vamos a ganar al #CáncerInfantil . Súmate al #Resistiré de @Juegaterap… Para celebrar el lanzamiento del perfume #DanceShakira les invitamos a que nos compartieran sus mejores movimientos! Aquí una selección! SHQ https://t.co/JDuLfMpiTI To celebrate the launch of Shak's latest fragrance, we asked you to submit your #DanceShakira boomerangs. Here's a video compilation! ShakHQ https://t.co/fwsN0GskRl 80 years apart, these two refugees have more in common than you’d think. #RefugeesWelcome @UNICEF https://t.co/gL4ohqYmNC “Shakira: America Must Protect All Our People” @TIME\nhttps://t.co/n0Z24ONQ25 \n#resist https://t.co/0k9GuEnxH6 RT @fpiesdescalzos: Más buenas noticias! Este año, según clasificación del @Mineducacion subimos de la categoría B a la categoría A! https:… Wow, 9 nominations! Thank you @latinbillboards and congrats to all the other artists nominated! Shak https://t.co/qrivrZzqVy 9 nominaciones! Muchas gracias @LatinBillboards y mis felicitaciones a todos los otros artistas nominados! Shak https://t.co/bvyDbe8BXf No se olviden de subir sus videos para participar en el #ChantajeChallengeContest y ganar un viaje a BCN! https://t.co/pgFHBTlacv ShakHQ #ChantajeChallengeContest dance videos by Wed and you could win a trip to Barcelona to meet Shak! https://t.co/Vl0UTg5dhY ShakHQ Get Shak's new salsa version of Chantaje from @AmazonMusic now! Chantaje versión salsa tamién está en Amazon https://t.co/1jr4z4r4Vh ShakHQ Gracias Carlos por llevarnos contigo! Shak https://t.co/LFdOFC3E1b Check out the new salsa version of Chantaje on @Spotify! No se pierdan la versión salsa de Chantaje en Spotify! SHQ https://t.co/YiDUIVjYqU My super team doing the waka for me and @3gerardpique on our bday!! Shak https://t.co/Zv98tWvR1i RT @Deezer: Wishing a happy birthday to @shakira! Here are 8 things you probably didn't know about her 🎉 https://t.co/tGaGy5Y3re #HappyBirt… RT @Colombia: Celebramos el cumpleaños de @shakira Gracias por representar #LoMejorDeCOlombia. #FelizCumpleañosShakira https://t.co/w4Kdkj2… RT @Shazam: Happy Birthday, @shakira!! We love you ❤️❤️❤️❤️ https://t.co/ZoLtFPzOdX RT @UNICEF: Happy #birthday to our Goodwill Ambassador @shakira! Thank you for shining a light on why #EarlyMomentsMatter for children arou… RT @Vevo: It's @shakira's bday and we get a gift? Watch her &amp; @maluma show off their salsa moves in #Chantaje (Versión Salsa) https://t.co/… Hope you guys enjoy Chantaje Salsa with Chelito De Castro on the piano! \"Pura salsa brava!\" #chantajesalsa Shak https://t.co/4oAAwPNKYc Espero que disfruten Chantaje Salsa y del piano de @ChelitoDeCastro. Pura salsa brava! #chantajesalsa Shak https://t.co/4oAAwPNKYc Gracias por los videos del #ChantajeChallengeContest! Sigan publicando en twitter e insta y podrán conocer a Shak! https://t.co/pgFHBTlacv https://t.co/V4vQVQtkmr So many great #ChantajeChallengeContest videos already! Post your dance to Twitter/Insta &amp; win a trip to meet Shak https://t.co/Vl0UTg5dhY https://t.co/Duq6QFtb2s #ChantajeChallengeContest -&gt; https://t.co/5MUfWwhNbh https://t.co/NYS9Ga86pt You guys are really impressing me with your moves to Chantaje! Wonder if you can match mine… Shak https://t.co/SaYgRVBilE Muy impresionada con sus movimientos bailando Chantaje, a ver si pueden hacer los míos!! Shak https://t.co/0ZsfKTYGmC Listen to the new @JohnBlake_Music remix of Chantaje on @Spotify / Escuchen el nuevo remix de Chantaje! ShakHQ https://t.co/ZwYTv43Owv #Chantaje https://t.co/hF1MESxQUR https://t.co/JBWMD4h2FZ Pongan un poco de ritmo a su lunes con el nuevo remix de Chantaje realizado por John-Blake!  https://t.co/5ay8mWKyRK ShakHQ Put some pep in your Monday with John-Blake’s pulsing new remix of Chantaje… https://t.co/5ay8mWKyRK ShakHQ Éste sí que es un lavado de cabeza!! Y él es el mejor del mundo!! / Now this is a proper shampoo--and he's the best in the world! Shak https://t.co/Kz20qyyxXF Beauty salon day! (Part 1) / Día cualquiera en la peluquería (Parte 1) Shak https://t.co/svV1Vt1h2j RT @wef: Investing in your child's development is even more valuable than you might think. Read more: https://t.co/0wuZa5eLc1 @shakira #wef… “Today's babies will solve tomorrow's problems” –watch Shak chatting to @Reuters in Davos https://t.co/FdgUkldl9S ShakHQ #EarlyMomentsMatter Aquí les dejamos con un resumen gráfico de la visita de Shak al Foro Económico Mundial de Davos @WEF_ES @UNICEFenEspanol ShakHQ #wef17 https://t.co/cPGqQZ9GaM Here are some photo highlights from Shak’s visit to the World Economic Forum in Davos #wef17 @wef @unicef ShakHQ https://t.co/TudaEPowon Watch Shak chatting #FacetoFace with @ariannahuff for @CNBC at #wef17 in Davos, at https://t.co/YMDbcIf06c ShakHQ https://t.co/ErxPLuJhN1 With Gordon Brown discussing the next steps to secure new major financing for Education. Shak #LearningGeneration @educommission https://t.co/Zr4vFJoBCD RT @fpiesdescalzos: via @nytimes: \"Shakira Calls for More Early Childhood Education\" https://t.co/imDbEXQm0v CC: @UNICEF @MovimientoALAS @w… RT @UNICEFenEspanol: Mira el discurso completo de nuestra Embajadora de Buena Voluntad @shakira al recibir el Premio Cristal, en Davos, en… RT @Womens_Forum: ‘Complacency is the worst enemy of progress’ @shakira #wef17 #wef @PrannoyRoyNDTV RT @Womens_Forum: 'You don’t have to be a politician or celebrity to raise awareness about early childhood education.' @shakira #wef17 #wef… RT @MovimientoALAS: \"If we give equal opportunities to the poor we are building a more prosperous and peaceful world\" @Shakira at @wef talk… Tienen preguntas para Shak y @ariannahuff? Pueden mandarlas aquí -&gt; https://t.co/hv7KaoSb7t ShakHQ RT @CNBC: Have questions for @shakira and @ariannahuff? Submit them here and they may answer » https://t.co/LlrGiRChBp #FacetoFace #Davos #… RT @fpiesdescalzos: \"Quiero que mis hijos sean agentes de cambio / I want my children to be agents of change\" @shakira @wef #wef17  https:/… RT @WEF_ES: Sigue en directo a @Shakira sobre cómo cambiar la vida de un niño mediante el acceso a la educación primaria https://t.co/2WUVm… RT @wef: Live now: @shakira on changing lives through early childhood education https://t.co/2jWzsFIabL #wef17 #shakira @PrannoyRoyNDTV With fellow SDG advocate @ForestWhitaker at the world economic forum (@wef) -education for peace! Shak https://t.co/3fiorucE9x \"No podemos hacer una pausa y pedirle a estos niños que nos esperen\" Vean/lean el discurso de Shak en #wef17 https://t.co/kn6Qp6vUYn ShakHQ “There isn’t a moment to lose.” Watch / read Shak's speech at #wef17 about early childhood development. https://t.co/eCcRIMUL3T ShakHQ RT @UNICEF: Congrats to our Goodwill Ambassador @shakira on receiving the Crystal Award at #WEF17! Thanks for shining a light on why #Early… RT @WEF_ES: .@shakira recoge su crystal award y enfatiza la relevancia de invertir en desarrollo infantil temprano #wef17 https://t.co/C6b7… RT @fpiesdescalzos: .@shakira @UNICEF No podemos hacer una pausa y pedirle a estos niños que nos esperen hasta que lo tengamos todo resuelt… RT @fpiesdescalzos: .@shakira @UNICEF Necesitamos invertir en los seres humanos: es lo más inteligente que podemos hacer, es estratégico y… RT @fpiesdescalzos: .@shakira @UNICEF \"We can’t press pause and ask those kids to wait to grow up until we’ve got it all figured out. There… RT @fpiesdescalzos: Nuestra fundadora, @shakira recibirá el Premio Cristal en Davos @WEF_ES. Pueden ver su discurso en vivo aquí https://t.… RT @wef: Live now: The 23rd Annual Crystal Awards https://t.co/ZAqkzbFJ0b @HildeSchwab @shakira #wef17 Shak se encuentra en el #wef17 donde hablará sobre Desarrollo Infantil Temprano y recibirá el premio Cristal. https://t.co/ZZp0XK58FC ShakHQ Shak's at #wef17 to speak about Early Childhood Development &amp; get the Cristal Award for her work. Watch at https://t.co/jTn7a3E913 ShakHQ RT @WEF_ES: No te pierdas en 15 min. el anuncio oficial de los ganadores de la 23ª edición de los Premios Cristal con @shakira &amp; @HildeSchw… RT @UNICEF: We’re at #WEF17 in Davos w/ @Shakira to call on world leaders to invest in early childhood development. #EarlyMomentsMatter 💙 h…"}