{"username": "whindersson", "words": {"show": 65, "ser": 48, "ma": 44, "bom": 37, "rio": 35, "galera": 34, "boa": 26, "pica": 26, "sou": 26, "do": 24, "agora": 24, "man": 20, "para": 20, "tempo": 15, "bora": 14, "era": 13, "dele": 13, "hora": 13, "ria": 12, "mim": 12, "goi": 11, "sabe": 10, "da": 10, "ante": 10, "rie": 9, "hist": 9, "tag": 9, "sair": 9, "dar": 9, "dessa": 8, "fico": 8, "come": 8, "twitter": 7, "favor": 7, "pais": 7, "amor": 7, "campo": 7, "saber": 7, "pega": 7, "fez": 6, "sai": 6, "porto": 6, "pau": 6, "lindo": 6, "mil": 6, "conte": 6, "tweet": 6, "fique": 6, "video": 5, "terror": 5, "massa": 5, "par": 5, "meio": 5, "calor": 5, "sol": 5, "chamar": 5, "forte": 5, "claro": 5, "mas": 4, "mar": 4, "junto": 4, "whats": 4, "passo": 4, "time": 4, "vale": 4, "estado": 4, "pandora": 4, "amar": 3, "quarto": 3, "fogo": 3, "min": 3, "barra": 3, "tiver": 3, "mero": 3, "canal": 3, "nova": 3, "sil": 3, "valor": 3, "dan": 3, "gio": 3, "alto": 3, "achar": 3, "gra": 3, "tua": 3, "peteca": 3, "lan": 3, "sess": 3, "fazenda": 3, "thread": 3, "capital": 3, "ama": 3, "fam": 3, "chip": 3, "natal": 3, "bob": 3, "chocolate": 3, "mudar": 3, "top": 2, "brazil": 2, "planeta": 2, "nome": 2, "brown": 2, "gelada": 2, "comer": 2, "serra": 2, "delta": 2, "pop": 2, "cora": 2, "professor": 2, "dinheiro": 2, "monte": 2, "marque": 2, "link": 2, "mal": 2, "manter": 2, "news": 2, "humor": 2, "gabi": 2, "understand": 2, "thanks": 2, "post": 2, "stand": 2, "porta": 2, "inclusive": 2, "web": 2, "mat": 2, "mail": 2, "data": 2, "propaganda": 2, "drama": 2, "turn": 2, "frase": 2, "banner": 2, "hack": 2, "harry": 2, "potter": 2, "jerry": 2, "whin": 2, "especial": 2, "tai": 2, "presidente": 2, "bate": 2, "rea": 2, "mau": 2, "bot": 2, "boy": 2, "cantar": 1, "bed": 1, "hit": 1, "cor": 1, "lata": 1, "animal": 1, "caracter": 1, "summer": 1, "casal": 1, "samba": 1, "soccer": 1, "manga": 1, "mano": 1, "resolve": 1, "insist": 1, "action": 1, "monster": 1, "high": 1, "urubu": 1, "buriti": 1, "pedro": 1, "mangue": 1, "mila": 1, "coroa": 1, "tri": 1, "bah": 1, "hacker": 1, "alem": 1, "passado": 1, "smith": 1, "travis": 1, "guardo": 1, "vim": 1, "pro": 1, "tic": 1, "aula": 1, "agenda": 1, "rel": 1, "basta": 1, "polis": 1, "site": 1, "vision": 1, "levo": 1, "rock": 1, "dow": 1, "troca": 1, "pastel": 1, "gin": 1, "dom": 1, "taa": 1, "faze": 1, "bra": 1, "pique": 1, "make": 1, "wer": 1, "forum": 1, "voe": 1, "marina": 1, "flores": 1, "want": 1, "food": 1, "know": 1, "bit": 1, "compositor": 1, "big": 1, "bang": 1, "ikat": 1, "piaba": 1, "mora": 1, "lamber": 1, "platina": 1, "cinema": 1, "nam": 1, "noa": 1, "legal": 1, "ponto": 1, "role": 1, "junta": 1, "curioso": 1, "che": 1, "express": 1, "energy": 1, "car": 1, "dola": 1, "hart": 1, "hip": 1, "ras": 1, "bel": 1, "pare": 1, "sinal": 1, "prod": 1, "mad": 1, "chuck": 1, "bola": 1, "men": 1, "serum": 1, "sen": 1, "bater": 1, "ave": 1, "maria": 1, "hamster": 1, "mem": 1, "eyn": 1, "final": 1, "banca": 1, "chute": 1, "play": 1, "os": 1, "lama": 1, "pat": 1, "today": 1, "das": 1, "dog": 1, "mao": 1, "ion": 1, "ram": 1, "fandom": 1, "divide": 1, "rep": 1, "meeting": 1, "comedic": 1, "brother": 1, "fan": 1, "work": 1, "friend": 1, "person": 1, "great": 1, "guy": 1, "excuse": 1, "reporter": 1, "teste": 1, "duro": 1, "please": 1, "break": 1, "heart": 1, "song": 1, "name": 1, "cat": 1, "material": 1, "brave": 1, "voar": 1, "record": 1, "escape": 1, "artist": 1, "back": 1, "mover": 1, "coach": 1, "street": 1, "mana": 1, "polo": 1, "cento": 1, "coca": 1, "peso": 1, "bal": 1, "add": 1, "visto": 1, "conto": 1, "dor": 1, "miss": 1, "passe": 1, "gaj": 1, "designer": 1, "swim": 1, "week": 1, "anna": 1, "belle": 1, "refer": 1, "exist": 1, "oii": 1, "silva": 1, "pen": 1, "pend": 1, "bota": 1, "alma": 1, "hep": 1, "cart": 1, "pintado": 1, "discovery": 1, "channel": 1, "magic": 1, "fant": 1, "auto": 1, "pizza": 1, "lance": 1, "trio": 1, "dali": 1, "bolo": 1, "tube": 1, "fosse": 1, "sele": 1, "dado": 1, "blitz": 1, "dada": 1, "hater": 1, "algum": 1, "toy": 1, "story": 1, "cruise": 1, "tome": 1, "tux": 1, "lava": 1, "cantor": 1, "band": 1, "salve": 1, "precise": 1, "pablo": 1, "prepare": 1, "jato": 1, "golpe": 1, "tire": 1, "curr": 1, "sao": 1, "tor": 1, "auge": 1, "real": 1, "dura": 1, "ora": 1, "halo": 1, "card": 1, "vei": 1, "reverter": 1, "rede": 1, "cheerleader": 1, "cause": 1, "coco": 1, "wind": 1, "justo": 1, "super": 1, "rip": 1, "cite": 1, "responde": 1, "fail": 1, "po": 1}, "tweets": "As vezes queremos fugir de nós mesmos, mas sempre onde vamos, nós estamos. Boa tarde 🙏🏼 https://t.co/hRXEdYxSeG ❗️❗️❗️ https://t.co/9GFX8MSbGP Caralho CURITIBA, sério, valeu mesmo pelos dois shows de hoje!!!\nSem palavras pra isso 😱 https://t.co/b7SbBjkpLt Eu to besta que o melim sabe cantar a música deles ao contrário 😱 https://t.co/BED57PobYY Larissa Manoela no sbt Larissa Manoela na globo\nEu abro o insta: https://t.co/GNkK4vDlZZ Galera o cara do “caneta azul” tá vindo com o novo hit “caneta de três cor” fiquem ligados! @DearHannaah @AlissonTatto @HavocMiranda Own 😍 RT @juniorfisher: @whindersson Um vira lata caramelo dirigindo no meu país NE ..Como ainda não temos esse animal tão sagrado e característi… A alegria dos dono achando que tão indo passear kkkkkk tão indo tomar vacina otarios https://t.co/2aEFzrZ8aX @vitao Top meu pica RT @HavocMiranda: Ja percebeu que artista sempre chamamos pelo nome completo pra não ter engano?\n\n- Encontrei o Luan ontem na rua!\n- Qual L… https://t.co/KbZSNZmPqg Wtf @luisasonza https://t.co/IJvY0n2sln 🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️7🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️de🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️dezembro🧘🏻‍♂️🧘🏻‍♂️show🧘🏻‍♂️🧘🏻‍♂️em🧘🏻‍♂️🧘🏻‍♂️Maceió🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️video🧘🏻‍♂️🧘🏻‍♂️novo🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️no🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️canal🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️https://t.co/lkTsitRvM3🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️🧘🏻‍♂️ https://t.co/CfU15fF8A8 @Raiane73009899 https://t.co/cSFPSte2fM @Daniaraujoaa Que massaaaaa, obrigado!!! @marcosvin10 Fechado meu pica @Fagnereditor Foda pacero Essas merdas dessas séries com personagens que você odeia mas passa a amar com o decorrer das 300 temporadas aí morre, a disgraça do personagem morre, acabam com o psicológico da gente, nem dormir eu consigo Meu deus eu https://t.co/qU9DmOAITi Saiu o QUARTO EPISÓDIO!!!\nSe tiver acompanhando a série deixa uma curtida aí bb!\n\nhttps://t.co/eC8G6fpEAK https://t.co/PD6GZF5uol RT @whindersson: Ser feliz é pra hoje, né pra amanhã não. RT @recifeordinario: Mais uma bancadas de corais atingida pelo óleo. Dessa vez nos corais da Reserva do Paiva. Todos os ambientes já foram… @DUALIPA Summer Eletrohits Eu to aqui https://t.co/82nvayNG13 Um casal de fãs fez uma caminhada na praia que estamos em Alagoas ontem de tardezinha, encontraram a gente e mostraram o pé pra nós. É isso galera, mesmo depois de limpar a praia, ainda é assim que fica. Caralho man, que merda. Disgraça. https://t.co/mb8siMywjC Foi mal floripa o show é depois de amanhã, e não amanhã, esses copo de alumínio engana a gente https://t.co/rJWN3A16UB To tão bebado que achei q amanhã era 26, tenho mais um dia de férias fodase hehehehhe ITABAIANA-SE PORRA KKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKK carai quase não sai\nhttps://t.co/Fqh6KGIlav https://t.co/dPfq3E7PXy 1 se for de um conhecido \n2 se for de um amigo \nSe for de um melhor amigo dobro até o 1 encostar no 3 e como a metade https://t.co/MVgMR4vxoo https://t.co/Fqh6KGIlav bó? https://t.co/0C5zyoJ3Bk Acho que quando morre vem pra cá https://t.co/COgOyp1czL Rapaz mais que coisa mais linda de ler cara chega eu fiquei assim sem palavras meu coração encheu tanto de amor que deu vontade de ligar pra minha mãe 🥰🥰🥰🥰🥰 https://t.co/UY9w3cc5Pq Quando eu acordo muito cedo o dia passa tão devagar que eu fico pensado caralho não vou ter paciência pra esse dia inteiro não RT @Tatawerneck: Ela é linda 😍❤️❤️ RT @eaiguh: O único erro desse video é que ele só tem 15 seg https://t.co/andJBU7lHs Maceió, sempre lindo demais o Nordeste https://t.co/rqkwUlYqIR Bundinhas 🥰 https://t.co/pdHFvpF4m2 @dorythefixe Qual óculos? represents Brazil more than samba and soccer https://t.co/ZyFDuzzcwv @mczaac Ah tá, simmmm, Luísa não gosta de terror :( @izabelleleite25 Vou baixar @mczaac Que isso Esse horário em 2012 eu tava chegando na escola dizendo GALERA BORA GRAVA UM RALEM CHEIQ KKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKCralho https://t.co/Uvq3TckKo6 Galera eu descobri que tem praticamente um planeta de pessoas que achava mesmo que o nome do Chorão era Charlie Brown, eu to impactado https://t.co/0nW2c2ZEvL Galera eu e Luísa queremos começar um série agora, qual séries vocês indicam? “Meus filhos não tomaram vacina e estão ótimos”\n\nOs filhos: https://t.co/JSNJZTPgWn Será que as pessoas que confundem o Mc Gui com o Mc Guimê são os mesmo que achavam que o nome do Chorão era Charlie Brown? Na briga eu sou a menina que chupa manga RT @Dioudlol: Slc mano https://t.co/2qBAtCkdy3 Ser feliz é pra hoje, né pra amanhã não. ATENÇÃO TROPAS https://t.co/1rmg9pBVKK Um dia vcs vão descobrir que água com gás é bom demais RT @gabriellgbio: @whindersson @nilmoretto @CdNLeon  nos ajudem! RT para que mais pessoas tenham acesso aos nossos contatos! Agradeço desde… BRASÍLIA, sem palavras pra moral que vocês me dão toda vez que venho aqui. \nO mais legal é que não é só no show, nas ruas, nas rádios, nos restaurantes, sempre é um carinho muito grande!\nMuita gratidão por isso!\nUm beijão!! \nE namastê 🙏🏼😂\n.\nPróximo fds tem FLORIPA E CURITIBA! https://t.co/lYq7vQUC5z - pai deixa eu sair?\n- fale com sua mãe \n\nMãe: https://t.co/kDJP3WM2Zv RT @calabresadani: AHAHAHAHA 🐯🙃 https://t.co/hyIjF9b16d RT @eurenesilva: Oi, @whindersson! Seu amigo empreendedor abriu negócio muito legal de hambúrguer artesanal! recomenda aí para seus seguido… Eu já vi esse vídeo umas 500 vezes de uns 6 meses pra cá e toda vez que eu vejo eu assisto no mínimo umas 50 vezes https://t.co/JVp1xtYHHM Bom dia bebezoes Tem pequenas regrinhas que se vc faz, nem precisa ser bem precisa, mas já resolve logo um problema, que coisa Sempre que o assunto é o óleo nas praias do Nordeste ficam tentando apontar o culpado em vez de mobilizar a urgência pra ajudar. É como se num incêndio você ficasse procurando quem ateou fogo ao invés de apagar. Por que essa insistência em querer desafiar a lógica? Saiu o live action de Monster High https://t.co/roUc6Bcp5B “Vou só cochilar uns 15 min pra não ficar com cara de sono” \n\nEu acordando 5 horas depois: https://t.co/yt1kSdxjlU Será que o dono do reddit sabe que tudo que ele vê no Twitter dele vem do negócio que ele criou? https://t.co/s5LtFHP1IH RT @VascodaGama: MUITA GARRA!\nMUITA LUTA!\nISSO É VASCO! @larrydouglas__ Eu sei irmao, eu sei mto bem esse sentimento Fernando Miguel muito meu ídolo Será que as pessoas que mostram coisas engraçadas pra gente no insta sabem que a gente já viu aquilo uma semana antes aqui no twitter? @LucasFl19 Irmao vai na cozinha e da uma goleada escuta o q to te escrevendo @heartbreakprin ????????? Água gelada pisa Rapaz uma água gelada de madrugada é melhor que refrigerante É isso aí beberes, caso gostem, Tamo de braços abertos! \nTem baião de dois e feijão tropeiro pra nois comer!!\nIrrullll!! ❤️🙏🏼 PARQUE ECOLÓGICO DA CACHOEIRA SO URUBU-PI\n\nMuita queda d’água e muita água linda!!\nDa pra acampar e os carai!\nIndo pela cidade de Esperantina-PI são apenas 21 km!\nÉ um espetáculo!! https://t.co/UxD8Z9j1NG CÂNIONS DO RIO POTI-PI\n\nEsse tá na minha lista pra conhecer ainda esse ano!!\nAo longo do tempo o Rio fez esculpiu!\nQuem gosta de rapel é o lugar!\nSe quiser conhecer da pra ir pelas cidades de Buriti dos Lopes, Juazeiro do Piauí e Castelo do Piauí!\nGalera da canoagem vai pirar!! https://t.co/fF5F3Di7nE PEDRO II-PI\n\nMeu amigo, paisagem é o que não falta! \nQuer cachoeira carai? Tem também porra!\nAté frio faz, tem festival o de inverno!! \nSem falar que você ainda leva umas pedra preciosa de presente pros amigos e parentes!! https://t.co/3mUoGrtikf SETE CIDADES-PI\n\nAs formações rochosas mais tops, uma rocha de 190 milhões de anos dividida em 7, por isso o nome sete cidades!!\nMuito top pra quem como eu gosta de caminhar igual é, é o lugar!!\nE ainda tem cachoeira pra se refrescar!! https://t.co/FIF5hgxQjY SERRA DA CAPIVARA-PI\n\nFica na cidade de São Raimundo Nonato, tem maior e mais antiga concentração de sítios pré históricos da Américas!\nTem artefato de 50 000 anos man, sério, é pica, eu já fui 4 vezes!\nPra quem gosta de história, é o lugar!! https://t.co/I6rhUfaZvw BARRA GRANDE-PI!\n\nFica fica na cidade de Cajueiro da Praia, 65 km de Parnaíba, num instante tá lá papai!\nÉ um paraíso, carro não pode ir na praia, por as tartaruguinha faz neném la!\nQuem gosta de kitsurf pira nessas águas, sério, vou repetir, é um paraíso! https://t.co/0VHOeEHuN9 DELTA DO PARNAÍBA-PI!\n\nTambém tem nome de Delta Das Américas, tem 73 ilhas fluviais, tem duna, tem mangue, tem tudo que você quiser meu amigo!\nMeu amigo, é beleza que não acaba mais!! https://t.co/Z4azJ3mpBh Hoje é dia do Piauí!!\n\nE eu queria te mostrar 7 motivos pra você visitar lá em suas férias!!!\nEu espero que você coloque esses nomes numa listinha pra um dia você conhecer!!\n\nSe liga na thread!! RT @geffersonlins: Os VERDADEIROS HERÓIS lá em Tamandaré. ❤\nhttps://t.co/JddkEgQmFp Galera que vai pro show de Brasília hoje que tiver criança de colo, não esqueçam de levar abafador pro barulho não incomodar os pequenos, beijaaaao RT @arcanjo_mila: @kissswti @whindersson Em Salvador na praia da Boca do Rio vai ter mutirão no Domingo https://t.co/dh3YrQ5G5o RT @kissswti: @whindersson Whindersson se tiver algum mutirão de limpeza de praias vcs poderia compartilhar por favor? Eu estou queremdo mu… Só digo uma coisa, quando vcs assistirem o que eu gravei esses dias kkkkkkkkk putaria viu, lá no YouTube Vc para https://t.co/C3k1psaaOl Tempos estranhos @leobonesso Vou falar com o pessoal aqui, perdao amigo! Eu falei esses dias aqui que mais de 40 praias do Nordeste tavam com óleo, pois agora são 52 o número de praias!\nOlha o tamanho da disgraça de óleo que apareceu em São José da Coroa grande em Pernambuco 😔\nQue merda man, olha o tamanho dessa disgraça https://t.co/YqR9lR9FKP @leobonesso Não tava sabendo irmao, era ao vivo? @leobonesso Comigo? Tri legal Bah cheguei em Porto Alegre dai RT @marcelmerguizo: Whindersson Nunes x Acelino Popó Freitas 🥊👊 Quer entender esse encontro? 😂😎 A gente mostra neste domingo, no Esporte Es… Rapaz eu tive uma ideia esses dias e falei fodase vou cancelar tudo e fazer logo. Sério tá muito massa 😂😂\nE SAIU EPISÓDIO NOVO LÁ NO CANAL, corre!!!! RT @KaykyySpliff: Caralho galera na moral, é minha irmã, ajudem por favor ! https://t.co/vWkgneAjng To sumido pq to gravando uma parada pra vcs kkkkkkkkkkkkkkkk dessa vez vocês vão pensar “tá confirmado, é doido mesmo” 😂 RT @YouTubeBrasil: Embarque nessa viagem com #YouTubeOriginals. Vem assistir agora ao terceiro episódio da nova série do @whindersson - #Pr… O menino estranho ☝🏻 https://t.co/gV2P0oVz8Y Bom dia Eu li irmao, obrigado pela mensagem, eu sei que são muitas mensagens mas sempre tenho em meu coração pessoa como você, que vê algo além naquilo que eu faço, obrigado man, manda um abraço carinhoso aos seus aluninhos ❤️🙏🏼 https://t.co/eqg8PZZePX Quando o professor de física tá falando e entra uma abelha na sala https://t.co/d8M3ybhOwe Quando a música tá boa e para do nada chega o silêncio dói Só o que eu quero quarta é isso aqui! 💢 https://t.co/QuenJbjZgh RT @VascodaGama: Bom Vasco! Que você tenha uma semana tão boa quanto este vídeo. ♥️💢\n⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀\n#VASxFOR | #Va… Pq séries de tv fazem “barulho de hacker” quando alguém mexe no computador? Seu maior tesouro é o tempo Na maior parte do tempo eu to tentando me convencer de que eu mereço Quando meus amigos me perguntam como é ser eu eu sempre respondo que é legal quando você sabe que pessoas gostam daquilo você que é Mais de 5 mil ingressos vendidos em Brasília e o show é só sábado man  \nVivendo um sonho e não quero acordar Queria morar na praia Que fofa 🙏🏼❤️ https://t.co/x4fLqxJzjM RT @LilWhind: Como é o esqueleto do centauro RT @benozzatiarthur: Nem o coringah escapah da masculynah 🤡 https://t.co/5BX9BKhy7J Já to inscrito! 🙏🏼❤️ https://t.co/nVDYk6gpjg https://t.co/889VUWRqMW Gente como assim tem alguns de vocês que não sabem que esse show é de 2015??????\nhttps://t.co/V2q9mrTK9J @DaviFon80339095 É irmao, é o show completo 😂\nhttps://t.co/V2q9mrTK9J Da pra ver pelo teto que ele não acerta todas as vezes 😂 https://t.co/7Ncn4IEgDM RT @eurenesilva: Imagens da gente distribuindo livros pra criançada no Complexo do Alemão ano passado! Quer nos ajudar a distribuir ainda m… @luanediaas Vamooooos!! Você vai adorar!! FELIZ DIA DAS CRIANÇAS 😂\n\n(Marminino, 2015, disponível no YouTube) https://t.co/hkQY2CPR2Z RIO DE JANEIRO, BELO HORIZONTE, SALVADOR!!\nBó? https://t.co/odcZeC8PDd RT @dougraz: confirmado\nPlaystation 5 chama Playstation 5 https://t.co/5nix8rcVRS Eu sou esse gente, como assim https://t.co/VBrWlS5DTR https://t.co/zCaqMYtlt6 Eu e meus irmãos no tempo que as crianças ainda não tiravam suas próprias fotos https://t.co/3KKw8yZiDT @LwithP Will smith 15k na paródia do Travis tão querendo msm é? Ele teve uma queda por ela https://t.co/JFb1vkxrgq PAULIIIIIIIIIIIIIIINHA\n\nME DIZ O QUE É QUE EU FAÇUUUUUU https://t.co/LVSmQVcTYH Paródia sobre arrancar o siso 🦷😂\nEu faço toda???? https://t.co/1L4jzmBQ4O Eu guardo meus carregadores antigo de celular na esperança de que um dia eles voltem a funcionar @cellbit @CanellaMatheus @RisadaWorld Que foda! RT @thrashermag: The One and Only FELIPE NUNES 🇧🇷 https://t.co/ZhyEMxONf2 RT @multishow: ''O rico quando ele tem dinheiro, ele tem banheira'' eu morro de rir com vocês, @Tirullipa @whindersson 😂 Logo mais, às 22h,… E logo logo volto com mais histórias dessas minhas andanças pelo mundo beleza, a putaria vai continuar em todo lugar tá? Só vou parar de viajar mesmo pq é tanta viagem que eu posso dizer que estou agora na Bulgária e voce vai acreditar pq pode ser que eu esteja mesmo Por isso meus cumpades e cumades, anuncio q vou rodar mais um ano com esse show “A Volta do que nao foi” e vou parar, vou me aquietar em casa, ir pra praia, ver minha mãe na hora q eu quiser, me dedicar mais a vocês aqui pela internet, focar no canal! E eu dou mó valor uma praia, num vô mentir, bom demais, eu acho q eu vim da praia man, mas eu já sei que não era surfista pq eu já tentei surfar e fiquei uma semana com o pescoço torto Muito bom ganhar dinheiro, pica demais, só o filézin viajar, mas eu não quero ter tempo pra curtir só com 60 e rola véa murcha Ano passando eu fiquei um mês dentro de um avião, isso aí mesmo, somando todas as horas de voo eu passei quase um mês no ar, eu fui na casa dos meus pais umas 4 vezes, é mais uma vez chega o final do ano e eu falo “caralho lá acabou?” O tempo é a única coisa que não da pra lutar contra. E você precisa dele pra lutar contra todo o resto. Hoje tem episódio novo lá no canal!! Dessa vez tem JAPAOOOOO! RT @YouTubeBrasil: Embarque nessa viagem com #YouTubeOriginals. Vem assistir agora ao segundo episódio da nova série do @Whindersson - #Pro… 1. Vai ficar aí chorando??\n2. A vida é assim a gente perde hoje pra ganhar amanhã bora levanta\n3. Puta merda matei o fi alei \n4. Gente um médico no local???? https://t.co/1z4tiC7hDD @maisa Fala na minha cara Aula de defesa pessoal 😂 https://t.co/pRCJVV9DpG RT @multishow: \"Um brasileiro sem dívida é um brasileiro sem história\" - eu ouvi isso enquanto comprava mais uma brusinha 😜😅 Às 22h estreia… RT @multishow: Tava com saudade? 😍 Às 22h estreia a nova temporada de #OsRoni, e confusão não falta com esses meninos! 😂O primeiro episódio… RT @MussumAlive: Lasanha x Lasanha de berinjela https://t.co/erbTD8kCJE Hoje eu vo assistir bacural Mesmo com a agenda corrida a gente arranja um tempo pra dançar um seresta 😂\nOuça “Bomba Relógio” no Spotify! https://t.co/mKFST3V34m Hoje as 22 horas tem nova temporada de Os Roni no Multishow ❤️ Os Roni são algo que eu indico aos amigos dos meus pais, entendem? É bom 😂 Os Roni foi um programa de tv que eu criei pensando em meus pais. Meus pais não entendem Friends, eles não entendem um monte de jovens morando juntos com problemas de jovens. Mas dos Roni minha mãe manda áudios gargalhando alto. Basta pra mim. 😂❤️ Já coisas tipo “Os Roni não tem graça” e tá tudo bem. Você não precisa achar graça em tudo. E engraçado não é só aquilo que você acha graça, outras pessoas podem gostar 😂 Quando mais eu ando pelo Brasil mais eu vejo o quanto Os Roni são amados, muita gente apaixonada pela Voinha!! E é uma grande honra pra mim trabalhar com dona Ilva Niño! ❤️ Hoje tem segunda temporada de “Os Roni” no multishow!! @victoroliveira Faz do trabalho liando bb Whindersson Nunes - ADULTO!\nDisponível na @netflixbrasil \nMarque uma amigo que vai assistir com você 😂 https://t.co/gKrXIHMqI2 Beberes, já imaginou você ganhar, com algo que você já faz de graça?\nA Wibx é uma plataforma de relacionamentos onde você compartilha dicas e serviços com os seus amigos, e ainda ganha pra isso. Se liga! Clica no link e ABRE TUA CARTEIRA WiBX: https://t.co/tnJsFUh1iV RT @YouTubeBrasil: Embarque nessa viagem com #YouTubeOriginals. Vem assistir agora ao primeiro episódio da nova série do @whindersson - #Pr… Me reunindo com o Whindersson a-126, da realidade alternativa AlphaEstelar, para uma conferência intergalática de Whinderssons, onde reunimos todos os Whinderssons existentes, nos sentamos comemos cuscuz e discutimos o rumo de nossa espécie. https://t.co/ys0jAoAxDT RT @akapoeta: o facebook me lembrou que já se passaram 3 anos desde o dia em que eu escrevi esse texto sobre o @whindersson no @mediumbrasi… Bom dia meus pica Porto Alegre RS foi mal https://t.co/8bobcTAPG1 Mta gente “quando volta pro Rio? Quando vem pra Brasília?”\ngente esse mês \nDia 12 Santos-SP\nDia 18 Porto Alegre-SP\nDia 19 Brasília-DF\nDia 26 Florianópolis-SC\nDia 27 Curitiba-PR \nTem mais cidade no meu site vê lá meu pica Essa semana tive algumas reuniões e fiquei muito feliz com alguns projetos antigos andando, nos próximos anos vocês vão ter muita coisa irada minha pra ver, que massa! Cheguei em Macapá!\nRapaz ultimamente todo lugar que to chegando to me emocionando com o tanto de vezes que venho no lugar e o público só aumenta Quando eu era criança não me disseram que uma das coisas mais difíceis da vida adulta era manter a paciência RT @NetflixBrasil: É aquilo que eu sempre digo: TU-DUMMMMM Quero ver vcs dizer que eu só ando largado nos programa de tv, eu sempre fui visionário https://t.co/bLZ2YrZv58 Olha essas imagens...\nNem preciso dizer nada!\nValeu Rio Branco-AC! 😍 https://t.co/F6tfmb4Pd9 RT @kaiquebritor: quem quer ir ver @whindersson aq em salvador cmg ein RT @portadosfundos: - Agora eu tenho que andar sem camisa pra sempre, se eu vestir uma camisa eu levo multa.\n\nVÍDEO NOVO | WHINDERSSON: htt… Dia 19 desse mês minha considerada https://t.co/TSyNRfyxpm Eu queria morar nesse vídeo https://t.co/arR7rEVXW0 É O ROCK IN RIO BRANCO 🎸🎸🎸😂😂😂\nMuito obrigado Rio Branco!!\nEu posso dizer que sou muito feliz por vir aqui a 5 anos! É sempre ser recebido com esse carinho!\nUm beijo carinhoso! \nNamastê 🙏🏼😂 https://t.co/ygJj7vVS7z Amanhã irmao! 🙏🏼 https://t.co/jF4auBUMoc Muito feliz de estar de volta a essa cidade que sempre me acolheu tão bem, obrigado Rio Branco!! \nHoje vai ser foda! Meu amigo cheguei em Rio Branco com um pau d’água tão grande! Aaaaaaagua major @FeCastanhari Peteca tbm. Assim como a palavra casa por ser usada tanto pra falar de casamento quanto para falar de um imóvel. Nos sabemos de qual peteca estamos falando 😂 @FeCastanhari Peteca Peça seu filho ou sobrinho pra desenhar um mapa e me manda aqui pra me ajudar num vídeo 😂 RT @YouTubeBrasil: Quer o mundo, @? O @whindersson te dá! No Youtube Originals Próxima Parada, que estreia hoje, o criador desbrava cultura… VÍDEO NOVOOOOOOOOOO!!!\nEspero muito que vocês gostem!!\nAssim como me diverti nas viagens!!\nDeixa um RT aí que toda quinta tem um novo!\nhttps://t.co/XbduGL8WPm É HOJE VIU Enquanto vocês têm medo de dois caras numa moto, os dois caras da moto têm medo disso aqui ó https://t.co/b7LyIPnJsu RT @IAmSteveHarvey: Caso você esteja se perguntando o que está acontecendo aqui, \n@Whindersson não fala inglês e todos sabem bem e bem, eu… RT @bkttlapa: Vasco @VascodaGama AEEEEEEEEEEEEEEEEEEEEEEE RT @VascodaGama: Virada do #VascoDaGama em Minas. VASCO! 1-2 #CAMxVAS https://t.co/c4iEr45FaF @Gabriel05057936 https://t.co/bubtcs0Tb7 Se você nunca comeu Cuscuz você está vivendo errado Como assim existem seres humanos que ainda não provaram a comida dos deuses? https://t.co/Vd3Dow8FO2 Que hora sao Mais uma fake news, dessa vez dizendo que virei torcedor do flamengo, não acreditem, esse rapaz não sou eu 😡😡😡😡 https://t.co/jxHnXTHED1 Quando for pra casa de alguém que você goste muito, leve algo pra essa pessoa. É muito bom pro seu ciclo de amizade saber que você não está ali só quando tem algo em troca. Pode apostar que o olho dele irá brilhar se você chegar com um pastel e suco. É top pra saúde mental 🧠 Lapa de anel viu 😱 https://t.co/HFeBfHKDMv RT @aikinhou: @whindersson @luisasonza O vídeo aqui meu pai https://t.co/WNU4VtpOSh Desta vez não é por minha conta https://t.co/qEFXRCyjRt https://t.co/ygrSI7JiIF Eu fui pedido em casamento de novo no meio do show em Cuiabá 😭😭😭😭\nTe amo amor @luisasonza ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ https://t.co/e8EtjwYF6l 🥊🥊🥊🥊 https://t.co/W0VxK6ZGwd “Ah mas tu num é do Piauí? Tá reclamando de calor pq?”\n\nMeu broder eu sou piauiense eu não sou um camelo vlw blz flw Antes do show de hoje em Cuiabá um banhozin de piscina bem protegido do sol 😎 https://t.co/FP1MHZWcpp @VascodaGama https://t.co/fySwUcgMJw RT @leticiaestigara: poderia salvar o membro através de uma cirurgia inovadora de congelamento do osso, só que essa cirurgia o plano não co… RT @leticiaestigara: gente esse é meu amigo Alex, desde junho ele vem lutando contra um câncer no fêmur, nessa segunda estava marcado sua a… Hoje fiz minha primeira luta de boxe!!\nDeu vitória pra nois 🥇 \nE agora to indo pra Campo Grande-MS fazer show hahahahah!\nSimbora carai fodase https://t.co/x8K66GPYnU RT @ParisFilmes: Chega de saudade, eles estão voltando! Com @whindersson, @Tirullipa, @TomCavalcante1  e @brunodeluca. #OsParças2 chega em… RT @ParisFilmes: Eles estavam por cima da carne seca... só que não. Os abestados estão de volta! #OsParças2: @whindersson, @Tirullipa, @Tom… @luisasonza Perdao, acho que não fui muito específico em minha pergunta 🤗\nIrmões, quais igrejas estarão abertas amanhã em Campo Grande? 🧐 O show é amanhã às 21 horas no Ginásio Dom Bosco taa Amanhã queria fazer alguma coisa em Campo Grande, antes ou depois do show não sei, tem o que pra fazer aí? Galera de Campo Grande ainda tem mta capivara por aí? Queria levar umas abóbora pras bichinha amanhã Vo faze um vídeo respondendo algumas pergunta, usa a tag #WhinderssonResponde mas pergunta ao que preste meu pica DORALES Da uns 2 dolar isso aí https://t.co/UQwsQ1Bz01 Não galera mas sério msm apareceram muito óleo em 43 praias do Nordeste olha aí a putaria https://t.co/TjT3JKNlQD RT @PatrickMaia: Minha mulher tá brava porque eu deixei uma cama molhada em cima da toalha de novo. Eu queria falar sobre as manchas de ÓLEO que apareceram em 43 praias do Nordeste mas tão descendo o pau numa menina que falou numa menina ai que até vou deixar quieto 😂 @renankbf @Thaylaortega Tem meia entrada de 30 man Bora meus pica https://t.co/cKIhjfvOQX O que mia fia, eu to em sp nos praticamente nos braço da frozen https://t.co/g0jTKgun9O Saindo do treino naquele pique https://t.co/VQHehhZemx https://t.co/66wPNg5N3u RT @CopaDoNordeste: @whindersson E aí, Whindersson. Hoje tem o Sorteio da #CopaDoNordeste2020, hein! A partir das 19h estaremos ao vivo no… @rafaelkjls Como está esse belo dia E aí meus consagrado RT @whindersson: Domingo agora tem show em CUIABÁ, quero ver se é mais quente que Picos! RT @claudiiaoficial: URGENTE 😭\nPor favor ajudem a compartilhar! O litoral nordestino tá banhado em óleo e ninguém faz absolutamente NADA! h… RT @meioemensagem: Na quinta-feira, 3, o @YouTubeBrasil lança sua primeira produção original no Brasil pelo canal de @whindersson. Além del… RT @meioemensagem: @YouTubeBrasil @whindersson @portadosfundos @nathaliaarcuri @desimpedidos @manualdomundo @karenjonz A plataforma também… Esse vídeo é uma confirmação de que por mais fechado que seja o nicho que você trabalha (make/humor/culinária/esportes/etc), sempre há uma forma criativa de promover seu trabalho!\nQue massa! https://t.co/Np7T1hDnEY Quantas pessoas mais são necessárias pra vocês entenderem que a dica da gabi brandt não funciona? Domingo agora tem show em CUIABÁ, quero ver se é mais quente que Picos! RT @luisasonza: Assistam MUITOOOO https://t.co/4fddivgWif Um jeeeeito assim, devaaaaagimmm #BombaRelógio Essa é uma das coisas mais nojentas que vi alguém fazer por like. https://t.co/mXKnv7tx9S To muito feliz e emocionado! Eu conheci o mar com 18 anos, e com 24 conheci o mundo! E tá tudo gravado, e é de graça, toda quinta um episódio de 30 minutos pelo em algum país dessa terra!\nTamo junto, e de novo, muito obrigado por isso, vocês são foda! 🙏🏼 VÍDEO NOVO!!\nÉ com muito prazer que anúncio o primeiro YouTube Originals do Brasil!!\nDia 03 tem o primeiro episódio!!\nDO PIAUÍ PARA O MUNDO! 🌎 \nhttps://t.co/L6pDV5xXeV As vezes eu gosto de sair com pessoas babacas pra saber se elas estão melhores ou piores do que da última vez @PriAlcantara Parabéns!!!!! Que irado!!! RT @LeandroHassum: Meu povooo. Hoje tem mais um #TaPagoTNT!!! Com @Tirullipa, @whindersson, Falcão e @gessicakayane!!! É 22h30 na @TNTbr! h… Amanhã tem uma SURPRESA lá no canal 🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊🙊 QUAL É A SENHA DO UAIFAAAAAAAAAI 😂 https://t.co/yef6Wer0vC @livia_medeiros @aurisson 😭😭😭😭😭 Eu: odeio criança mimada aff\n\nRegina: A\n\nEu: https://t.co/OjJab5ZKvn RT @tatagibra: Dois motoqueiros de trilha indo pra bacurau https://t.co/O72mKkYPO2 RECIFE!!!!!!!\nRapaz kkkkkkk foi massa demais!\nTrês sessões iguais a essa!! \nÉ sempre incrível vir nesse país! \nPróximo fim de semana tem CAMPO GRANDE E CUIABÁ 🙏🏼\nSimbora! https://t.co/Qh4CQHdvyG RT @luisasonza: Eu sou a com língua pra fora @whindersson https://t.co/eZgkBOqbdm Eu conheço pessoas adultas que não conseguem fazer um diálogo assim https://t.co/bt7Kui6nvM Encontrando meus amigos do ensino médio https://t.co/oH8pUtgJGb RT @gabesimas: Expectativa: 24 horas de sexo na lua de mel\n\nRealidade: @whindersson na @NetflixBrasil 😂😂😂 https://t.co/t40pXJvk7U Recife, só posso dizer: QUE FODA os shows de hoje! 🙏🏼 https://t.co/YTfqcAbecI RT @Itspedrito: “amiga vai simplesinha, vai ser só um bolinho, não precisa ir arrumada não”\n“ok” https://t.co/I43Rq7iyUK TEM PORTO ALEGRE DIA 18/10\nEsqueci foi mal aí man https://t.co/UBHXWAVLCg Voe alto! 🛩\nMOSSORÓ-RN (20/09) HOJE\nRECIFE-PE (21/09)\nRECIFE-PE (22/09)\nCAMPO GRANDE-MS (28/09)\nCUIABÁ-MT (29/09)\nRIO BRANCO-AC (04/10)\nPORTO VELHO-RO (05/10)\nMACAPÁ-AP (06/10)\nSANTOS-SP (12/10)\nBRASÍLIA-DF (19/10)\nSÃO JOSÉ-SC (26/10)\nCURITIBA-PR (27/10)\nhttps://t.co/Fqh6KGIlav https://t.co/feXilyHYAA Chegando em Mossoró, tá quente ai? Estudou e tem moraaaaaal!!\nUma honra Tio Marcio ❤️ https://t.co/4AfjnxRs5Q Gildo lanches (aqui em Recife) depois de trabalhar o dia todo disse que ia finalizar o expediente 5 da manhã e ia depois disso distribuir comida pra uma galera necessitada até as 8, mto meu ídolo, eu escolhi uma pessoa certa pra admirar!! Galera de RECIFE abriu terceira sessão no Domingo aí viu cuida Marina Ruy Barbosa pq ta chorando?? https://t.co/GY3OvhF7vG Eu to com vontade de fazer paródia de música antiga, qual vcs me indicam? 5 pão desse aqui // 5 desse oto https://t.co/UhGpnb5uBA Pão doce // pão salgado https://t.co/UhGpnb5uBA E essa caneca que tu vai bebendo o café e vai aparecendo a cabeça pennywice 🎈 https://t.co/FaiVvosoFG Pode passar, morde não 😂 https://t.co/kLXl3iiBDU Ainda ficou rindo de mim 😂😂😂\nMeus fã são puro deboche https://t.co/YhImAOIz2F Um dia desse eu tava mandando um áudio no whats muito distraído e uma menina chegou por trás de mim e disse “NÃO ACREDITO” \nMeus órgãos ficaram tudo desorganizado do susto Eu muito aterrorizado quando alguém me persegue na rua sem saber me reconheceu de algum lugar ou vai me assaltar https://t.co/JMhBaLFbUa Goiânia! 👊🏻\n2015 / 2019 https://t.co/URBYBRHbVu - sua cachorrinha morde?\n- não, piorrrr\n- o que? \n- ela julga https://t.co/G79Oc48Ebn Felicidades meu amigo, desejo a vocês muita paz, tranquilidade, um filmezin volta e meia, uma viagem aqui acolá, almoços de família confortáveis kkkkk\nE cuidado com as FLORES 💐💐💐\n😂😂😂😂 https://t.co/oriTEuqnDz RT @_TheBestDogs: I definitely 100% do not want any of your food, Dave. https://t.co/wGGjfpmZgf @firewaster Porra irmao sei como é @Thirissatto Obrigadooooooo ❤️ GOIÂNIA 😎\nEu só posso dizer que sou abençoado por voltar pela quinta vez nessa cidade! \nE ser recebido assim!\nÉ de se emocionar!!\nMuito obrigado!\nNamastê 🙏🏼😂 https://t.co/6YWG2DI0Gg TAAAAAAAALLES @FeCastanhari To acostumado 😂 RT @AlicePA: Brazilian-portuguese speakers knowing they can understand a bit of spanish, Italian and french... But they can't understand us… RT @FeCastanhari: - É filho de quem mesmo? \n- Do Bruno e Marrone... https://t.co/FocLRIHUCN Eu olho essa foto e só consigo pensar que você é alguém que eu deveria procurar em todas as outras vidas.\nAmo você demais bicho tem condição não! https://t.co/VEilwWC0FO Valeu PALMAS-TO!!\nQue moral do carai vcs me deram!! \n❤️ https://t.co/Lu3XNUX1tV Rapaz não aguento mais receber codorna no meu whats Pessoal de Cuiabá tá dizendo que o calor de lá é o de Teresina com Palmas juntos!! Tem show lá dia 29 de setembro, aí vou saber! Invocando o frio ❄️ https://t.co/IORbPKcU0J Ah, pra quem não conhece o Dorgival, ele é compositor das músicas mais legais que você conhece ex “você não vale nada mas eu gosto de vc” é dele!! Gente boa demais esse cara, toda vez que passo no insta dele já sei que vou me divertir!! \nE toooome xooote! O omi é bruto, só foge quando não da msm 😂😂😂 https://t.co/12RM8Ucx2H A teoria do Big Bang foi desenvolvida na fazenda dele https://t.co/JjbtxJ3ZHd Amigo dos animais https://t.co/Cb5nqedxCe Amigo de Jesus https://t.co/HqE4cDNfCq Gente boa demais já parou pra conversar comigo uma vez na estrada https://t.co/gUMgDRETwi Sempre muito prestativo com seus filho https://t.co/B1xBdYpQ3i Já capturou um TIGRE! https://t.co/KnVl3faDjO A fazenda dele faz divisa com a Islândia https://t.co/o3tO6z6QYg Depois do almoço a lua já tá é alta meu amigo!! https://t.co/IkaT9dbXna O pôr da lua na fazenda dele é lindo!! https://t.co/eWaI39EQMc Amigo dos leao! https://t.co/XIag4NGump Ele já alimentou uma piaba até virar uma orca! https://t.co/yy5UJUWcMi Se você não conhece o Instagram do Dorgival Dantas... você não sabe o que tá perdendo!\n\nVou te mostrar nessa thread 😂 https://t.co/te2fgkK0VI Deitar no chão gelado de cidade quente é um cochila sem volta. Cochilando depois do almoço em Palmas 🌞🌞🌞🌞 https://t.co/u60RcbyfBd @maisa Mucei Cheguei em Palmas... Não a piadas para descrever o calor que estou sentindo. Hoje eu ouvi “Piauí é capital do que msm, Pernambuco?”\n\nEu não consigo entender a cabeça de alguém que consegue decorar a letra de uma música e não consegue decorar as capitais dos estados do país que mora. Eu indo tomar água de madrugada https://t.co/OsWjn0ihvp Eu acordei e um dos maiores comediantes do mundo postou um stories assistindo meu show na Netflix 😭😭😭😭\nThanks @fluffyguy ❤️🙏🏼 O mundo de acabando e o Twitter “fodase meu irmao vamo curtir esse apocalipse” https://t.co/dOgPGctIew Bom dia meu pica Dormir pq afinal de contas alguém tem que lamber a cara do whindersson as 5 da manhã   ninguém é de ferro né meu consagrado https://t.co/5ju5YLe1wp O ano tá passando tão rápido que na minha terapia ainda eu ainda to debatendo os acontecimentos de março Carai Teresina vai deixar?????????? https://t.co/Kqjw2wQ7UR Se um estranho me oferece um cachorro quente eu aceito fodase é bom demais pqp @bobdaslabaredas Rapaz eu nem ligo mais 160 mil cópias vendidas no país, vem disco platina duplo!! \nVocê é incrível @luisasonza gostosa do caralho https://t.co/S7qyUXpnw5 RT @luisasonza: Ouça #FazendoAssim no @SpotifyBR \n\nhttps://t.co/BRqLZ6WQyN As vezes eu tenho vontade de te trancar num quarto e ficar repetindo por horas o quanto tu é foda!! Eu sou feliz por ser seu amigo! https://t.co/Ieu7NnJGFe @ladygaga Eu queria ser seu amigo @henriq_arq @Shibbo @simeumsm Eu bebia água mto rápido agoniado com Jesus me olhando Covarde 😂😂😂😂😂😂😂😂 https://t.co/cTI98dQUpm Agora sim E que estranho vai ser parar de falar “capinha” e falar “capona” aff https://t.co/GrqqqcnPTE RT @hiperbolar: Impacto cultural nas calouradas da UFPI:\n\n         █          　　\n         █　       \n         █　       \n         █… @Sangerine Olha sério, sinceramente fiquei tentando raciocinar isso aí Eu acho que fui muito na intenção de evitar suicidio, vacilei em não ter procurado a autora, mas eu pago pelo post https://t.co/G0sTRyaEK6 Vou te chamar da dm e você me passa seus dados pelo post https://t.co/2HQf9vbjHk Perdao eu só recebi no whats e postei na intenção de ajudar, desculpe 🙏🏼 https://t.co/jFazqASDwZ Eu desconfio que algumas marcas realmente fazem algumas embalagens pra gente não conseguir abrir Criticando o iPhone 11 aqui pros meus amigos e já indo atrás do meu Estamos juntos nessa vida bb! 💛 https://t.co/xR9cjGHItX @VascodaGama O tanto que nois sofre é o tanto que nois ama Da não man 😂 https://t.co/Yc7U0WP5yx @Dani_LSoares @NetflixBrasil Ei @NetflixBrasil vamos tornar meu mais acessível? Todo mundo tem o direito de sorrir!! 🙏🏼 Fiz um vidinho sincero pra agradecer vocês por assistir meu show na Netflix, muito grato por vocês até hoje me acompanharem, vou postar no insta ❤️ RT @ElisaLinss: @whindersson Vi no netflix winderson Nunes para adulto, fiz uma sessão de cinema aqui em casa pra toda família ver juntos e… PICOS-PI!!\nObrigado pelo seu tempo! Foi um prazer rir com vocês nessa noite quente 😂😂😂\nUm abraço carinhoso!\nPróximo fds tem Palmas e Goiânia!!\nVlwwww! \nNamastê 🙏🏼😂 https://t.co/zaaM1CntgW Thanks 😂 https://t.co/9U7jcdP5f3 Peidaru..\n\nNAM PEIDARU Nois nasce sem aprender andar, depois que da o primeiro passo fodase meu patrão agora o negócio é correr https://t.co/mVT3miMjxk FAZ O KENNY G 🎺🎺🎺 https://t.co/NOA1lvpaRG @damadevermelh0 Oxe o show é bom lá tbm mermã Uri cumpade https://t.co/Sjlw8uNHdY Hoje tem PICOS-PI\nDia 13 tem PALMAS-TO\nDia 14 tem GOIÂNIA-GO\nDia 20 tem MOSSORÓ-RN\nDia 21 tem RECIFE-PE\nDo 28 tem CAMPO GRANDE-MS\nDia 29 tem CUIABÁ-MT\nBora bb!\nhttps://t.co/Fqh6KGIlav https://t.co/wMaybyvZQQ @maiconkusterkkk Foto dos prato feito nos cardápio pq eu faço parte do grupo de pessoas que só sabe se a comida presta pela foto Pq ela é gente boa demais https://t.co/DFw63712fV Se eu tiro uma foto dessa fica parecendo uma pista de motocross https://t.co/2AaarmvWTD Cheguei em Picos, ainda bem que eu fiz estágio em Teresina! \nCalor do cão! Cuuuuida meu fi! @ricocomvc #publi \n https://t.co/zFIQCJWSvt https://t.co/hxDUmpku2L Ajuda meu time aí meu pica pedido de amigo \n\nhttps://t.co/OgPIgtw3e4 RT @rxfaelacampos: o stand up do whindersson da netflix é mto bom kkkkk RT @IgorFranciscoB2: O baguio do Whindersson na Netflix é muito bom namoral JKKKKKKKKKKKKKKK RT @JuSantosm: Ontem vi o show do Whindersson Nunes no Netflix e chorei de rir!!! Pqp, MUITO bommmm Vcs tem q ver é o novo, a putaria tá mais forte do que nunca 😂😂😂 https://t.co/g8XJ6LOlx4 RT @sfandresa: o tanto que eu ri com esse show do whindersson nunes na Netflix kkkkkkkkkkk RT @Bahiano_o: O especial do @whindersson na Netflix tá foda dms pqp KKKKKKKKKKKKKK RT @yuribigsimoes: To no ônibus olhando pela janela e rindo sozinho lembrando do show do @whindersson na Netflix 😂😂😂😂😂😂😂😂 aí é foda né meu… RT @AyresNathalia: Estou piramidando o show “adulto” do @whindersson na Netflix. Todo mundo que eu converso, pergunto: você já assistiu? RT @Glaeeyes: show do whindersson na netflix é mt bom vsf RT @rvianna814: @whindersson Sim filho da puta @malumwcrvg Mas eu nem jogo lá moço @malumwcrvg Calma Sérgio Ramos to brincando @efizer0 JAMAIS Além de tudo isso o Vasco ainda perdeu hoje, é esse time q vcs querem q eu compre Sem tempo Juliana. https://t.co/ajmgPqtpDK Minha amiga tem a expectativa de vida de 35 anos, isso martela minha cabeça toda vez que vejo aquela pessoa TÃO LEGAL, tão incrível talentosa e gente boa. Não consigo entender isso. Minha amiga, almoça cmg, sorri cmg, me abraça como uma irmã, 35 anos, por que? Como pode as pessoas que só querem andar de mãos dadas na rua, tomar um sorvete, trabalhar normalmente, ter uma vida comum igual a de qualquer um, serem tão perseguidas a ponto de não poderem ter seus próprios livros? Quando eu estava perdendo a minha fé, uma pessoa me falou sobre Jesus de uma forma tão bonita que me apeguei mais na minha fé do que nunca. Essa pessoa era uma mulher trans, toda vez que eu lembro que a expectativa de vida dela é de 35 anos meu coração dói... Quando vejo o Galvão Bueno só lembro que eu conheci ele enquanto ele tocando bateria na casa do Felipe Massa, esse sim foi um role aleatório de respeito Bó? https://t.co/2oyNJ0AugI Cachorrin de capacete passando na sua timeline 😍 https://t.co/yJN6Kft0Kp Carai será se eu tranquei a porta da colmeia https://t.co/kUJpS3lh3s Agora ficou sério RT @n_arashiro: Moooh 🥰 \nTe amo pra sempreehhh ❤ @whindersson https://t.co/8RiSczxRYa Pq que rico finge que champanhe é bom ein “Será que aquela moto vai passar de novo amanhã pra eu correr atrás dela?” https://t.co/fkniBTKtEQ É que eu paro pra abastecer aí vem um pra foto, aí vem oto, e oto e oto, junta mta gente com celular perto de coisa inflamável, eu consigo o posto dizendo “amigo a natureza vai ter que agir e eliminar vocês tá, vai ser rápido” @alencarweverto1 Eu todo rechonchudo Gente eu não me importo de me pararem pra foto, de interromperem meu almoço, vc pode pedir foto a qualquer momento, eu amo, só me incomodo com foto enquanto to abastecendo, não é nem pela foto é mais pela explosão, é meio chato matar todo mundo. Vamo evitar foto perto da bomba 🙏🏼 RT @gessicakayane: Não sei pq as pessoas se ofendem quando vc da a resposta “pq eu quero” o mundo precisa entender que a resposta “pq eu qu… Não sério agora fiquei curioso E o cachorro quente Tá e o sanduíche Quando vc vai se alimentar tu é de qual time A vida de quem não aguenta mais ver os outros comendo enquanto você tira as cebolas https://t.co/a0QC474Y2f Inclusive eu fui lá apresentar um filme, o Euclides kkkkkk eles riram mto enquanto eu contava as putaria, tomara! Eu queria agradecer a Jesus pela forma como ele falou quando disse “Pois em verdade vos digo que, se tiverdes fé como um grão de mostarda, direis a este monte: Passa daqui para acolá, e ele passará. Nada vos será impossível\", todos os dias eu repito isso a mim mesmo! cabei de chegar da Netflix com a notícia de que nosso “Adulto” lá, é um dos conteúdos de comédia mais assistidos, já querem um próximo show lá, nossa eu não tenho como agradecer RT @LeandroHassum: Quando você faz compra na Ali Express 😅 https://t.co/738CSPv0cW Galera de Recife obrigado ao pelo carinho cara, quase 4 mil ingressos vendidos e ainda tá lonjao do show, que foda! Same energy https://t.co/8VZGovt2qV Medo https://t.co/UE3cnZdwEy Quando você compra uma versão sua na deep web https://t.co/YRtpLiZjV3 RT @programadamaisa: A gente não está sabendo lidar com esse encontro entre a @maisa e a Maisa, digo, @whindersson! E pra melhorar ainda ma… Gente de boa tem que ajudar gente de boa Quando pense q não @nascitrouxa_ @mary_maryr7933 @matiaseduardo72 @juhiddenperson @jonnatasgomes @Off_Limitss Não entendi eu tenho que jogar café na pica e chupar? Me expliquem de novo RT @matue30: Clipe novo | Kenny G | 18h \nhttps://t.co/TknDqI54nv https://t.co/rWwndEqxOm Esse açúcar mascavo você tem que botar 58 colheres pra adoçar o café aí tu me quebra né meu pica Whindersson nunes quebra o silêncio e diz: prefiro manter o silêncio. Não se importar com quem não se importa com você é se importar consigo mesmo. Essa semana tem show em Petrolina Pernambuco e Picos Piauí bora bb @gabesimas Caralho Quebra o silêncio é o melhor https://t.co/eUBQjcXrtg RT @juaopauIo: eu to com o controle da situasão mas ele tah sem pilha @marilhera Atenção Roselandia tem um menino chorando aqui ao lado das caixas de som 🔈🔈 Aí gabi, só sabe quem viveu no interior https://t.co/fuw5tbjuyN Um dia eu to morto, no outro to preso, no outro to namorando com o Gabigol, eu não tenho um dia de paz Mais uma vez fui atacado por uma fake news, não acreditem, eu não estou namorando o Gabigol Quanto mais demorar pra sair a temporada 2 mais a dívida do Jottape com o aquele véi agiota pilantra aumenta, pense nisso Netflix https://t.co/gS8edApZvH Você passa duas hora chorando de raiva pq não não encontra o controle da tv aí quando percebe ele tá dentro do seu cu Nem acredito que dia 14 de setembro to em Goiânia fazendo show em Goiânia pq eu adoro Goiânia ainda mais em Goiânia com o povo de Goiânia em Goiânia 🙏🏼 Dinah Moraes minha ídola intocável RT @modices: não repasse um conteúdo que você acha ruim\nnão repasse um conteúdo que você acha ruim\nnão repasse um conteúdo que você acha ru… MISERICÓRDIA PAÇOCA https://t.co/0cAuUCFO7p @luisasonza @GlamourBR A coisa mais linda da terra To muito triste, o @KevinHart4real é meu ídolo na comédia, Deus olhe por ele!\nEle tá internado :( Meu Deus do céu o Kevin Hart sofreu um acidente de carro 😭😭😭😭 RT @jynthia: To lutando pra não fazer um tweet especifico por que não vale a pena me meter nem de longe com o que não presta. Mas que a hip… KKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKK tem q ser mto meu amigo pra aguentar ser meu amigo https://t.co/uE0yDRhoVU Meus filhos gêmeos não tomam vacina e estão ótimos \n\nOs filhos: https://t.co/vZYFwjbVZT No calor de Teresina só o barulho do ventilador tremendo amarrado numa cadeira me mantém consciente Muito ruim quando tem frases massa numa música mas tem outras que caga aí não da pra tu mandar pra pessoa que tu gosta @CarneMoidaTV Puta que pariu q arte foda Boooraa @ricocomvc \nTinha esquecido o link kkkkk tá aqui https://t.co/zFIQCJWSvt\n#publi https://t.co/dsXz4JcM3l Cumpanhêras 🐶 https://t.co/yLGucYxXva O carinho de Parnaíba-PI ❤️🙏🏼 https://t.co/QVXmwhkR5x @filipecoutinho @NetflixBrasil Obrigado man 🙏🏼🙏🏼🙏🏼🙏🏼 @Jujuca1987 Amora trás seus próprios cremes pra pentear @gessicakayane CARAI Q SUSTO Barra Grande, Piauí 🙏🏼❤️ https://t.co/JrnvmyVDc6 Whind Kley 🌞 https://t.co/tI8e0LXk75 RT @NetflixBrasil: - meu humor é muito peculiar, você não entenderia. \n- me mostre\n@whindersson: https://t.co/ZBL2Joq2h8 Duvido quem consegue escrever nos comentário o estado das cidades que eu falei 🧐 https://t.co/AQ8Xh6AAjs A matéria // o motivo https://t.co/Br6imKDyFT Bom dia galera kkkk dormi muitao https://t.co/si27n1UZw7 @Isa_queiroz_bel Mande meus sentimentos! Fica bem 🙏🏼 To chegando Parnaiba-PI bora bora bora meu fi cuida RT @DiarioPE: Por que não pensamos nisso antes, hein @whindersson ? 🌺🌻🌼 https://t.co/LPXOl2zNzL @DiarioPE Droga Essa foto é na FRENTE DE CASA Pare tudo que está fazendo e veja o céu aqui no interior do Piauí ⭐️⭐️⭐️⭐️ https://t.co/Q09PcJFE3D @prxncx_cmps Abraço pra você e seu país!! ❤️🙏🏼 Primeiro sinal de que você não é mais criança 😂 https://t.co/kSryG0O8uY @sheviii2k Um anjo 👼🏼 @benozzatiarthur Gargalhadah @Pocah Só posso lhe dar um conselho. Acostume-se, só aumenta 😂 @Clah48717857 @cabeca Tooooop A intenção é fazer a galera conhecer esse lugar que é muito lindo, o céu a noite é simplesmente INCRÍVEL, hoje de noite mostro pra vcs Meus amigos que gostam de umas montanhas como eu, galera da trilha, da bicicleta, do caralho a 4, to montando uma expedição aqui pelo Vale do Gurgueia no Piauí, quem interessar fique atento que vou jogar um e-mail aqui pra nois conversar blz? Vai ser pica Quem já assistiu meu show no Netflix curte aqui só pra eu ver um negócio RT @maiconkusterkkk: O álbum do LIL' LIXO com o LUCAS HYPE está disponível em todas as plataformas digitais.\n\no álbum foi inteiramente prod… Sabe onde gravaram Mad Max????? Exatamente. Em Hollywood 😂\nMas poderia ser aqui no Vale do Gurguéia, em Bom Jesus, é lindo demais!! ❤️ https://t.co/hxDkE0pwW7 Piauí ❤️🙏🏼 https://t.co/z45roESl3F RT @whindersson: Como vocês adoram meus vídeos sobre filmes de terror.. Por que não fazer nosso próprio filme terror com comédia?\nVem aí, E… Na Placa de Rubi deu quase 200 pau por 35 min de filme, o Euclides vai ter 1 hora e meia de putaria, então vamos precisar de grana, bora empresas queridas vamos conversar Se tiver alguém de universidade que mexa com animatronic entra em contato pra nois fazer uma parada inédita no brasa O Euclides deita o Chuck na porrada fácil Como vocês adoram meus vídeos sobre filmes de terror.. Por que não fazer nosso próprio filme terror com comédia?\nVem aí, EUCLIDES, o mal em forma de boneco!\nAguardem no meu canal! \nArte do @vagazoide https://t.co/NtGvZrQiI2 Posso revelar uma notícia boa pra galera da madrugada? Atenção aí próximo tweet Tem uns rato jogando bola no telhado aqui de casa Hoje eu visitei uns lugar irado aqui em Bom Jesus com o @LucianoHuck, uns cânion pica OLHA PO OCLIN Eu venho pro interior desfrutar alguns dias daquilo que eu tinha todos os dias, oh vida vea doida viu Pega pega pegaaaa RT @whindersson: As data dos show desse ano bb, qual sua cidade pra a gente ir no próximo ano? 🙏🏼\nIngressos: https://t.co/nJuGgfdY4b https:… RT @ParisFilmes: Eles estavam por cima da carne seca... só que não. Os abestados estão de volta! #OsParças2: @whindersson, @TomCavalcante1,… RT @ParisFilmes: Chega de saudade, eles estão voltando! Com @whindersson , @TomCavalcante1, @brunodeluca  e @Tirullipa , #OsParças2 chega e… RT @maiconkusterkkk: faltam apenas 2 dias para o\n\nLIL' LIXO x LUCAS HYPE - MAIS QUE UM PERSONAGEM\n\no maior e melhor álbum de trap esquizofr… Toda vez que chega visita na minha casa meu cérebro automaticamente diz “ah pronto agora vou ter que me vestir aff” Minha participação na fila de Piadas dos 4 Amigos 😂😂😂 https://t.co/w5hN4Ak93W @juzao Nossa que vontade de voltar aí! As data dos show desse ano bb, qual sua cidade pra a gente ir no próximo ano? 🙏🏼\nIngressos: https://t.co/nJuGgfdY4b https://t.co/oCzAtl3Men NUM GORDIDOCE 🙄🙄🙄🙄 @dadacoelho UEEEEWWWWWWW 🐈 E eu que de ontem pra hoje morri duas vezes https://t.co/Jhn0dqRllH RT @kaabelmiro: Sera que É SÓ EU? Kkkk So quem ja assistiu o \"Show Adulto\" do @whindersson ou ja viu a propaganda da @NetflixBrasil vai ent… Eu sei meu irmao, to frescando 😂😂😂😂 https://t.co/PCmawQ206W E não posso fazer uma doação normal não, tem que dar meio milhão 😂😂😂 https://t.co/N5YMPZn0AV Meu drama de torcedor do Vasco é esse, sofro e passo raiva igual vocês, mas ainda tenho que dar dinheiro pro time senão eu que sou ruim 😂 https://t.co/Lt3GygsdjL To agooora vendendo chip da oi na rua 3 de dezembro, numa banquinha em frente ao número 34 no centro de São Paulo, quem quiser aparecer pra bater um retrato e comprar um chip pode aparecer 😂 Me tornei quem eu mais criticava: a pessoa que toma café de 5 em 5 min Eu tenho 24 anos e esse já é o meu quarto show, 3 dvd especial de comédia sei lá como é que chama essa porra, ave maria, fazer esse e me aquietar Acho que vou colocar música no meu show, vou fazer umas musica engraçada Mais um dia se passou e eu ainda não adquiri o Vasco Que toda a arte do @will_demetrioo 😍 https://t.co/GsoWwBn9KJ Gente sério mesmo onde eu ando o povo falando que amou o show na Netflix, porra brigado msm galera, to mto feliz que vocês gostaram, amo vocês que assistiram quem não assistiu eu só gosto. Brincadeira man kkkkkk frescando Claro que não, pq é só meu cabelo desidratado msm https://t.co/HAnImdDQfG https://t.co/Wm5yULhmNA Você consegue encontrar o hamster nessa imagem? https://t.co/25GztCe8fS Parte 3 😂 https://t.co/22RhnAyopO Parte dois https://t.co/2WUeatb4hG QUANDO PENSO QUE NÃO KKKKKKKKKKKKKKK\nby: @witxchs https://t.co/RbwvmoftTM @joaofelipe_8 Obrigado meu irmao 🙏🏼🙏🏼 @DalmauGerson Se suicidou irmao, triste demais Espero entender todas essas coisas um dia.. Fiz meu primeiro show em Natal-RN esse ano, o primeiro sem Madalena, minha fiel fã que todos os anos nesta cidade, desde adolescente, até que um dia veio com um filhinho, lindo demais. Dessa vez não tive Madalena na hora da foto, senti demais.. esse show foi em sua memória. 🙏🏼 @IanSBF @carolzoccoli é topper demais RT @eonlinebrasil: ELE VOLTOU! Tudo o que você precisa saber sobre a nova turnê de Whindersson Nunes! VEJA --&gt; https://t.co/EYN67hBoou http… Pra trabalhar cmg tem que pagar o pedagio https://t.co/qNV5101YuW RT @witxchs: Whindersson narrando/comentando a Batalha Final de Ultimato PARTE 1 https://t.co/dksrQ5TZE7 Perguntei quem assistiu o show na Netflix todo mundo levantou a mão e gritou, que foda cara Feira de Santana como sempre receptiva demais pivete! Vocês são barril dobrado! 😜 Tamo chegando FEIRA DE SANTANA-BA é HOJE!!\nÉ amanhã tem NATAL-RN! 🙏🏼\nVOLTAAAAAAMO! \nIngressos: https://t.co/Fqh6KGIlav https://t.co/ukMZqaeN32 @BruMarquezine Sei não mas sei lá 10 mil RT’s aqui e eu digo onde vou gravar meu próximo showwww\nTaca o pau\n#AssistaAdultoNaNetflix AVENGERS....\n\nTACA O PAAAAAU DOIDO!!!\n\n#AssistaAdultoNaNetflix VÍDEO NOVOOOOO!!!\nCada RT aqui ajuda a subir a tag #AssistaAdultoNaNetflix \nBora caraii !!!\nhttps://t.co/o7NBiDrWpv Vocês vão pirar nos defeitos especiais que fiz na hora do Doutor Estranho 😂😂😂 Quase meia hora de vídeo hoje viu É oficial, galera, eu vou voltar pra banca. Quem adivinha onde vou aparecer? Comenta aqui que eu quero ver se vocês são bons de chute. \n#ToNaBancaOi https://t.co/rTIVL78KmY Ansioso pra gravar o vídeo “O DIA EM QUE EU COMPREI O VASCO” Aí que parece hoje teremos vídeo novo meu pica Se gravar isso aí é girar ao contrário sai uma mensagem de satanás certeza https://t.co/QNJL45lFgu RT @NetflixBrasil: Aprenda a economizar com @whindersson Nunes. Módulo 1: convite de casamento. https://t.co/skYdSKYHv4 mto massa whatsapp de gente velha com as letra grande, cada frase é um banner @FabioAlves_PC Quem é q tá falando de presidente aqui meu consagrado A @oi_oficial lançou um desafio pra mim: passar um dia vendendo chip. Quer saber o resultado? Dá o play aí pra conferir. Ah, aproveita e me diz o que faria se me encontrasse por aí? Fique ligado que eu posso aparecer de novo. #ToNaBancaOi https://t.co/AsKvqJTJ7w @OJonathanF @TwitterBrasil Entendi, sobre o que eu tava falando no vídeo? Tuitei de novo, cortou de novo :( \n@TwitterBrasil #PraTodosVerem: O vídeo mostra um senhor deficiente visual, sem camisa em uma sala de cores vermelho escuro e amarelo, sentado em um sofá ao lado de uma senhora, ventilador preto em frente ao hack ventila o ambiente, ele ri do show ADULTO disponível na Netflix! ❤️ https://t.co/MsxYqez22z Fiz um tweet acessível para deficientes visuais e o Twitter cortou o alcance apenas desse tweet 🧐🤔 Boa noite RT @whindersson: #PraCegoVer #PraTodosVerem: O vídeo mostra um senhor deficiente visual, sem camisa em uma sala de cores vermelho escuro e… #PraCegoVer #PraTodosVerem: O vídeo mostra um senhor deficiente visual, sem camisa em uma sala de cores vermelho escuro e amarelo, sentado em um sofá ao lado de uma senhora, ventilador preto em frente ao hack ventila o ambiente, ele ri do show ADULTO disponível na Netflix! ❤️ https://t.co/MsxYqez22z Como diz minha sabia mãe: eu num digo é nada... Ora porra se eu fico preocupado quando subo uma escada e fico ofegante por que diabos eu não ficaria preocupado com o que produz o ar que eu respiro???????????????????? “AgOra toDo MuNdo DeScOBriU qUe ExiSte A Amazônia”\n\nRapaz tem gente que se faz de doido mesmo viu. A Amazônia sempre esteve lá, fazendo o trabalho dela, produzir 20% do oxigênio do PLANETA. Mas se ela QUEIMA é lógico q qualquer um que tenha amor a própria vida fica preocupado. Bom dia meus chegado Um dia é lama, outro dia é fogo, to vendo dia que vão começar é tacar bosta na gente \n#PrayforAmazonas RT @fiadabionce: Ei, @whindersson quase morri aqui com o @brenolcm Kkkkkk teve uma hora que ele riu que eu achei que ia morrer https://t.co… @planetafablita @hainararibeiro @gacta @Tatawerneck Boa @hainararibeiro 🙏🏼 RT @FabioPorchat: ALOOOOOO\nHoje tem live com @whindersson e @othiagoventura no YouTube do @canalgnt! Vamo fazer um esquenta pro Que Históri… “Gente só eu que..” \n\nSim meu jovem \n\nSó vc\n\nDe todas as pessoas do mundo só vc tem uma opinião diferente \n\nOlha como vc é especial \n\nVocê é simplesmente um gênio incompreendido, um sábio, praticamente o maior cristal da consciência transcendental \n\nIncrível @maiconkusterkkk Macacos me mordam ora ora se não é o bom e velho Bob o Arranca tripas Querida, encolhi eu mesmo 😂 https://t.co/pTFigoy5aV @HelosaSantanaS1 Trabalha pa compra os patê https://t.co/BWIHe6TZak @betosilva Valeu Irmao!!!! @lelleoficial Parabensssssssssssss 🙏🏼🙏🏼🙏🏼 Próximo final de semana tô em Feira de Santana na Bahia e Natal no Rio Grande do Norte, bora mah https://t.co/C3275jKZMK @STaddiction @DivaDepressao Elas enfeitavam os bolos de antigamente. @DivaDepressao Nunca se engasgou com uma boneca dessa pensando que era de comer nem fala cmg Ninguém: \n\nAbsolutamente ninguém:\n\nVento:\n\neu: galera assiste meu show adulto na Netflix dá essa moral meu pica Esse é o gato sorridente da madrugada pra abençoar quem já assistiu meu show na Netflix https://t.co/otvjciOmNE Voltemo 😂 https://t.co/OySbXZZSx3 @marcelmacedo Entendi irmao, eu aprendi com vc e você cmg, tamo junto. 🙏🏼 Vamo viver a vida mais de boa Não existe sotaque nordestino, são 9 estados, cada estado teu seu sotaque. Não tem problema aprender o sotaque, tem problema usar isso pra diminuir alguém, de resto tá tudo certo. Seja uma pessoa legal e você nunca será ofensivo. 🙏🏼 https://t.co/2yDyvUSjK8 Hoje gravei a fila de piadas com os 4 amigos 😂 Tacaram duas pedrada no meu carro hoje pra tentarem me assaltar, eles quebram o vídeo pra vc pra vc sair do carro e eles roubarem, mas o meu é blindado, NOT TODAY PILANTRA Eu e @marlonwayans fazendo o passinho na sua timeline pra te lembrar de assistir meu show “ADULTO” e o filme dele “SEXTUPLETS” na @netflixbrasil 😂🙏🏼 https://t.co/VlnPZA5NPD RT @otaviano: Quando você acha que o @whindersson já te fez rir o bastante, ele vem e solta um especial no Netflix. Tá de bobeira agora, as… Qual cidade você queria que eu fizessem show? Amanhã faço o primeiro aqui em São Paulo no espaço das Américas, vamo lá carai “Imagina se nos tivesse batido os pênalti pai, nois só treina pênalti...” https://t.co/joeaJTkXqU A regra é clara: o dog botou a barriguinha pra cima tem que passar a mao https://t.co/UUpaCswLgt Hoje não vou fazer propaganda do meu show Adulto que saiu ontem no Netflix pra não saturar né RT @Baliguti: @whindersson Meu vo disse pra vc postar vídeo novo no canal em 😂😂amanhã vou mostrar pra ele seu show na Netflix ele vai amar… A mãe disse pra você assistir meu show que saiu na Netflix https://t.co/urj6MOgzpj RT @whindersson: FINALMENTE SAIU 😭😭😭\nMeio quilo de dente na foto kkkkkkkkkkkkkkkkk\nEstá disponível na NETFLIX o meu show completo!\nObrigado… RT @BRKsSapeca: Eu e o @BRKsEDU assistimos aqui no Canadá, muito divertido! Parabéns, @whindersson!!! Voa, menininho!!!!!! https://t.co/BqF… Adivinhem quais palavras o @MarlonWayans aprendeu comigo 😂😂😂\nAssista meu show “ADULTO” e o filme dele “SEXTUPLETS” na @NetflixBrasil ❤️ https://t.co/sdDceVEn3S O Luan Santana é mto gente boa RT @NetflixBrasil: Uma 🚗Carona 🚗Muito 🚗Louca 🚗, com os consagrados \n@whindersson Nunes e @MarlonWayans\n\nSim, eu chamei o Marlon pra vir no… Melhor uber kkkkkkkk\n#WhinderssonAdultoNaNetflix https://t.co/TiTvgRQoJs Parece que vou acordar a qualquer momento desse sonho!\n#WhinderssonAdultoNaNetflix https://t.co/kI0wNgWbwt RT @IsabelaRaposo9: Assistindo #WhinderssonAdultoNaNetflix 💙, namoral, whind, EU TE AMO, CARA, TU É FODA https://t.co/x23wfBRt7M Tivemos que cortar por conta do tempo de show aff desculpa \n#WhinderssonAdultoNaNetflix https://t.co/xezV5ujIBp RT @taliamslvrr: Assistam o #WhinderssonAdultoNaNetflix  chapados kkkkkkkkkkkkkkkk recomendo muito gargalhadas confirmadissímas 🤣 RT @Marcia20mms: #WhinderssonAdultoNaNetflix    ele não para de rir 😂🤣🤣 e nem eu 🤦😂😂 https://t.co/72IoN6U7lV Acredita que nesse dia foram quase duas horas de show? Mas eles têm um tempo limite, aí algumas histórias saíram :( \n#WhinderssonAdultoNaNetflix https://t.co/i9BHPYbj6J O tipo de pais que eu gosto\n#WhinderssonAdultoNaNetflix https://t.co/Az0mJhNK6d PEGA PEGA PEGAAA\n\n#WhinderssonAdultoNaNetflix Passando pra avisar que saiu meu show “ADULTO” na @NetflixBrasil e lembrar que ainda não tem Harry Potter...\n#WhinderssonAdultoNaNetflix As próximas histórias estão ótimas kkkkkkkk\nEnquanto isso assistam o do Netflix tá \n#WhinderssonAdultoNaNetflix https://t.co/OD94AK8LQF RT @marcoscastro: Enquanto isso, vc já viu o amigo @whindersson com o show dele na Netflix? #WhinderssonAdultoNaNetflix Bom parece que não funcionou \n#WhinderssonAdultoNaNetflix https://t.co/r5bXGt4y1u Tive uma ideia, se você for assistir com alguém filma ela sorrindo e posta pra eu repostar!!!\n#WhinderssonAdultoNaNetflix @fabiorabin Valeu man!!!! Boa sorte no seu bb! Bora galera do K-pop vcs que são bom de tag me ajuda aqui com RT pfvr me dá essa moral \n#WhinderssonAdultoNaNetflix Então da RT aqui https://t.co/Sh7RnBTmT2 Vamo fazer aqueles negocio que eu vejo os fandom fazendo de comentar mil vezes aqui com a tag bora meu pica\n#WhinderssonAdultoNaNetflix Amigo, este show está disponível apenas na Netflix, mas eu to preparando uma grande surpresa pra vocês lá no canal, caaaalma\n#WhinderssonAdultoNaNetflix https://t.co/jCMvH1QfQD RT @_wesleyalvs: #WhinderssonAdultoNaNetflix\n\n*jerry encontra uma migalha\n\nstuart e mickey: divide com nois?\njerry: não \n\n*mickey encontra… RT @ddanicaldeira: Whindersson escovando os dentes em  Fernando de Noronha #WhinderssonAdultoNaNetflix https://t.co/aZj8OnPo3W RT @whinunes_jp: \"Todo mundo ama cagar em casa\"\nSabe o por quê?\nVai lá no app da @NetflixBrasil, pesquisa Adulto. \n#WhinderssonAdultoNaNetf… Boas influências 😂😂😂\n#WhinderssonAdultoNaNetflix https://t.co/4w11YFgU5A Que período do ano é melhor pra eu ir?\n#WhinderssonAdultoNaNetflix https://t.co/REP748KCOD As coisa que eu passo \n#WhinderssonAdultoNaNetflix https://t.co/s8JKXe3qjC Cada um tem uma coisa que amo, o primeiro tem o “de brinco né Obama”, o segundo tem a história da xícara, esse último tem do meu casamento!\nCada um tem um que amo!\n#WhinderssonAdultoNaNetflix https://t.co/TbOFLtHTQs Kkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkk eu demais\n#WhinderssonAdultoNaNetflix https://t.co/4u2YPIbv3y não pq eu conheço a galera kkkk\n#WhinderssonAdultoNaNetflix https://t.co/SOmom7TGl4 Doido pra começar logo, não aguento mais ficar em casa \n#WhinderssonAdultoNaNetflix https://t.co/1zK5c7ZFUw Vamo lá, perguntas e resposta, só respondo quem usar a tag #WhinderssonAdultoNaNetflix valendooooo\nRT aqui tbm ajuda a subir a tag viu #WhinderssonAdultoNaNetflix https://t.co/JFhCxrZiDO RT @NetflixBrasil: em pt: HAHAHA\nem espanhol: JAJAJA\nem inglês: LMAO\n\nAgora mais de 190 países já podem rir com o stand-up Adulto, do @whin… FILHO DO SOL DO EQUADOR ☀️ \n#WhinderssonAdultoNaNetflix https://t.co/Upk5in25RL RT @whinunes_jp: #WhinderssonAdultoNaNetflix\nPega,pega,pega,pega no meu pau.\nKkkkkkkkkkkkkkk https://t.co/gMRXS7qzOW RT @llucasvm: Stuart little quando encontrou a fatia de queijo #WhinderssonAdultoNaNetflix https://t.co/UpzBiUla3p RT @MomentsBrasil: ⚡️ #Adulto, do @whindersson, chegou na @NetflixBrasil: https://t.co/8z4lyW5dZ5 Ok essa é a tag 1 2 3 VALENDO\n#WhinderssonAdultoNaNetflix Saiu novo banner de divulgação do meu show já @NetflixBrasil https://t.co/dbHQbHcQnN @alvxaro Tem essa https://t.co/Pxpum7RNlU FINALMENTE SAIU 😭😭😭\nMeio quilo de dente na foto kkkkkkkkkkkkkkkkk\nEstá disponível na NETFLIX o meu show completo!\nObrigado por esse momento!! Ainda parece um sonho ❤️ https://t.co/dgv6aslGET MEU DEUS É AMANHÃ MEU SHOW “ADULTO” na @NetflixBrasil 😍😍😍😍 Simplesmente inacreditável. \n@MarlonWayans https://t.co/tNclQX5OU0 https://t.co/HeS9czAtAZ FALTAM SÓ 3 DIAS!!😭😭😭\nForam 12 PAÍSES!\nQuase 300 MIL INGRESSOS VENDIDOS!\nMarque alguém que vai assistir com você!! 🙏🏼❤️\nMúsica: Cuscuz - @LilWhind https://t.co/rZb8nJJPMo Não acredito quando falta 4 dias pro meu show na @NetflixBrasil 😭😭😭😭 RT @MarlonWayans: So great meeting this Brazilian comedic brother @whindersson I’m a fan of his work and a friend of his person. Great guy.… SEGURA MEU PÚDU 🐩 https://t.co/8sNkSXD2kR Testando umas piada com meus brode do Piauí 🙏🏼\n@BrunoLimaReal #RobsonSousa https://t.co/wDKBbhRYtE *seguidores Pedi pros meus fã clubes mandar direct pra seguidores aleatórias pra eu fazer show de graça, putaria viu kkkkkkkkkkk \nDia 18 é nois São Paulo https://t.co/AhobDyhQST @FeCastanhari Excuse me https://t.co/BaLHTytVRn Bom dia meu pica https://t.co/EyrKYe6EyX https://t.co/jGcOIDlbPH RT @Tatawerneck: Gente, agora sou mãe. Vcs tão levando casaco? @Ruanzito25 @pedroabg @kleyton996 @Gabriel26954127 É direitos, mas é sobre a música do começo bb, tem nada contar o filme não 😂😂😂😂 fodase tbm essa porra https://t.co/60PdosK25R Esse vídeo é mto eu e @luisasonza \nEla se assustando e eu do lado pensando “meu deus já é a décima vez que ela se assusta hoje” 😂😂😂 https://t.co/jf6d11F00j É assim que a cárie fica no seu dente quando você dorme sem escovar https://t.co/sVgqzDwjvh @fiadabionce Não precisa se justificar amiga, eu te aconselho a lembrar de alguma atividade que você gooooste de fazer, a gente faz o que gostamos por HORAS, faz o possível pra vc se sentir ATIVA, da gás pro dia inteiro e coloca a saúde em dia, o resto é um detalhe. Descansar depois de comer a ponta da cadeira pq ninguém é de ferro né meu pacero https://t.co/l4nUQAcVM2 Desmarcando todos os meus compromissos pois não posso me mexer pra não incomodar as nenens https://t.co/gZs4KSLrUw Dia 15 DE AGOSTO, ADULTO, na @netflixbrasil 😍 https://t.co/JA996nDssc Esse cara me ama mesmo, valeu man 🙏🏼😂❤️ https://t.co/ZZxkk5EjV6 @_flaviablm É outro cumade 🙏🏼 Que isso meu pica valeu pela moral https://t.co/kEvBIBdSqj Queria ser amigo desse cara 😂 https://t.co/bBxf2htkrq RT @maiconkusterkkk: lucas hype x lil' whind https://t.co/ppkbGi1H4p @viihtube Por favor!!! 🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼 Por favor @viihtube deixa eu dirigir uma série sua por favor 🙏🏼🙏🏼🙏🏼 Eu acordo cedo pra passar raiva Eu fiz uma piada em meu vídeo novo, aí olha o título da matéria que os cara faz kkkkk Esse reporter tinha que escrever um drama 😂 https://t.co/rqLsYFGVbr Esse Instagram inventou DO NADA, que eu postei um teste de gravidez em meu Twitter. https://t.co/D755hfNgJI RT @whindersson: Quem foi que fez isso aqui 😡😡😡 https://t.co/qHZwESjI4k Quem viu, viu, quem não viu, agora só na surpresa 😂 @Neymarkusterkkk @maiconkusterkkk Vc nem sabe quem vai estar aqui amanhã 🙊 RT @LilWhind: Eu não me importo bro eu saio do mackeinze todo dia direto pro estúdio bro eu trabalho duro 💰💰 RT @LilWhind: Eles dizem que não posso fazer meu som bro mas minha mae me deu dinheiro pra fazer meu ep e patrocinar bro #CuscuzGANG https://t.co/Fqh6KGIlav https://t.co/yHjLIZQyXz https://t.co/Fqh6KGIlav https://t.co/eJseNiNMuy RT @FabioPorchat: Amanhã tem Altas Horas!!!! Eu, @whindersson e @oserginho esperamos você!!!! https://t.co/u6rrk6IYgu @marigraciolli Dois cachorro sentado https://t.co/vLl7xnU7ej Carai olha meu cabelo https://t.co/n6P0RsB2JM @Blowtex Mas eu não transo com o celular.. tem como? 🤔 Sabe que dia é hoje? Exatamente! Dia 2 sexta feira, e amanhã é dia 3, depois é dia 4, logo após ora ora se não é o dia 5, depois 6, depois 7, depois 8, depois 9, 10, aí vem 11, finalmente o 12, pq depois dele é 13, aí 14 e vem o DIA 15 QUE SAI MEU SHOW NA NETFLIX BB @luisasonza Calunia 😭😭😭😭😭 RT @aligatie: “Please don’t break my heart “ 😩😩          \n\nSong Name // It’s You by Ali Gatie https://t.co/06P8JXZ9Um RT @fortalordinaria: “ aí eu tô de boa numa parada de ônibus aqui em fortaleza e do nada me deparo com essa cena!” https://t.co/W0pCTEIHQ7 Quem foi que fez isso aqui 😡😡😡 https://t.co/qHZwESjI4k @alilimasss Vamo tirar um fotinho É lindo demais um celular sem capinha Bom dia beberes https://t.co/URP7axGVRv Um #tbt bem ensolarado e gostosin ☀️ \n@maxmilhas https://t.co/STktNLYyNS RT @HugoGloss: .@Whindersson #Adulto, #EsquadrãoSuicida, #Mindhunter, #AsTelefonistas e #AtividadeParanormal4: confira a lista completa de… RT @NetflixBrasil: Em agosto tem o especial do @whindersson, Sintonia, Mindhunter e Cara Gente Branca e já fiz logo uma listona com outras… RT se você chorou 😢\n👉🏻 @LilWhind https://t.co/Scl6uvbp7i https://t.co/fbsByNrQcs Eu só quero chegar aos 103 anos nessa animação 😍 https://t.co/k0NQ43NVxB RT @othiagoventura: MEU PRIMEIRO ESPECIAL DE COMEDIA BATEU UM MILHÃO DE VIEWS EM 20 HORAS QUE ALEGRIA MONSTRA 🥳 https://t.co/QcJSuWsJjF RT @Dani_LSoares: Olá, querida @NetflixBrasil \n\nN é sobre HP, juro. XD\n\nNavegando por seu catálogo, vi que tem muito material com áudio des… 😂😂😂😂😂😂😂😂😂😂 @jaoromania https://t.co/PlPLXDLe58 EU TO COM MEU CLÃ\nTÔ COM FÃ \nEU TO CHEI DE HYPE D E B R I N C O N É O B A M A ? Escrevendo a melhor série que vocês já viram no meu canal, ou seja a primeira o Robson Sousa e o @Vagazoide https://t.co/lCPptEzhUD RT @whindersson: VÍDEO NOVOOOO!!!\nNem eu acredito kkkkkkk\nQuem não der RT a annabelle vai puxar o pé hoje!!\nhttps://t.co/svChrsgwIf RT @VascodaGama: #ApoiaOPojeto https://t.co/lJcUXAzAzz https://t.co/svChrsgwIf https://t.co/0ydZnctm6F @LucasRanngel Foto tóxica @LucasRanngel Cachorro Bom dia meu pica já viu o vídeo novo https://t.co/XWXijFDWaz @ataidekaroline1 Tentando aprender a cada dia pra fazer melhor, mas o vocabulário é grande pra disgraça @ana_zerves_2 é esse ó https://t.co/Fqh6KGIlav Toda pessoa que eu conheço em Salvador é uma pessoa mto incrível Salvador é cidade que mais me deixa feliz quando eu vou pqp que cidade incrível do carai @priscilaevelynn Vc tá num after com a Ariana Grande? https://t.co/QySOqw9yKX Cara eu não acredito que um vídeo meu vai sair até ele sair msm VÍDEO NOVOOOO!!!\nNem eu acredito kkkkkkk\nQuem não der RT a annabelle vai puxar o pé hoje!!\nhttps://t.co/svChrsgwIf Hoje tem VÍDEO NOVO no canal ein! Parece mentira mas é verdade!\nOito da noite lá no canal viu meu pica Eu 1 ano atrás:\n- muito triste quem fala “zap”\n\nEu hoje:\n- fala cmg no zap bb, chama no zap que é sucesso! Qual teu zap? Passa o zap ai bb! Só no grupo do zap ein? Hehehe\nAqui é o rei do zap zap meu pica @elonmusk Me dá um man 15 de Agosto, ADULTO, na @NetflixBrasil 🙏🏼 https://t.co/e1JTXWINmn @matue30 https://t.co/cAEmC9iAaE 😎 @mcguime https://t.co/7jFLmBucfn RT @laizeecomz: @whindersson Vai fazer exame de fezes? RT @leticiaasccp: @whindersson inspiração: agostinho carrara I’m a classic man 😎 #Brave24 https://t.co/RwGWNaf6U2 @troypess Que q aconteceu meu amigo @Eliana Vc não tava ontem com a Angélica e a Xuxa? Oxe Um vídeo do tokinho literalmente se cagando de rir caso caso você esteja tendo um dia ruim 😘😘 https://t.co/Gzqj9wqSh9 MEU MUNDO ACABOU DE CAIR https://t.co/4AGtF0gKn2 @princessdolr Aqui em Londres já tá mei dia o sol truando @RamonSa65856458 Estressado essa hora irmao, precisa não 🙏🏼 CHEGUEI DISGRAAAAÇA! @BrunoFabil Artes marciais mudaram a minha vida @matue30 Ei man é tu msm é RT @MaxMilhas: Nosso perfil no Instagram também buga pra você voar mais. &lt;3 Fique ligado e chame todo mundo, até o dia 28/07/2019, vamos di… Eu indiquei a @MaxMilhas no insta e tem gente comprando passagem por 50 reais em promoção surpresa 🤷🏻‍♂️ Tai uma mulher moral viu, me carregou nas costas quando eu pensei que não tinha saída, são só me mostrou a saída como me levou até ela!\nVocê é uma cumade rocheda!\nSuficiente é pouco, você é mais que o dobro! \nTe amo sua desgraçada gostosa do carai ❤️ https://t.co/mwuq7SejNb Se passar na frente da record a galera puxa achando que é ator dos 10 mandamentos https://t.co/KcvfL9lkIx https://t.co/YH0Dqg36E5 @ThomazOuMenoos Fodase tudo quem manda é a 30 man RT @FinalCutKing: The Greatest Escape Artist https://t.co/cBpNjbzu56 I’M BACK CARAI!!\nVocês doido pra saber e eu doido pra contar!\nComente qual cidade eu deveria ir! 🙏🏼\nhttps://t.co/Fqh6KGqJLV https://t.co/Ir1Z7mdl20 Olha não sei não viu mas tomara q sim 😂 https://t.co/29icSrWAMp Fechou papai https://t.co/lTngFMkzMZ Não galera mas sério eu já gravei o da annabelle mas viajei e esqueci o carregador do notebook em casa, mas amanhã eu vou mover o céu e a terra pra enviar esse vídeo carai Já faz quatro meses que não tem um vídeo no meu canal, aff YouTube tóxico do caralho Calma vcs tbm quer tu na mão aff https://t.co/gzJGqo0fqq Lembrando que dia 15 tem meu show completo na Netflix ein, se chama Adulto, me dê uma moral lá meu pica Ah tem isso tbm kkkkkk eu me esqueço https://t.co/4lCHMyoFPE Eu to sendo obrigado a ser coach pq todo lugar que eu vou as pessoas querem ouvir eu contar o que elas já sabem “Açai tem gosto de terra” https://t.co/SzInajJ3iV Voa barbuleta 🦋 https://t.co/CoVBNPtman RT @gaab__ofc: \"back street nóias\" segundo @whindersson kkkkk https://t.co/UaxfvnqBPn @LucasRanngel https://t.co/0dj2ptXXDF Meu pai eterno https://t.co/Bq8PquWloA @cordmarrte Fofa Caralho funciona mesmo https://t.co/xcGY3j57Ps https://t.co/GuReajwhLb https://t.co/oawjIUBafB Scoo by doo mana https://t.co/Bj9Vwmfjkq @Kefera Tudo demais faz mal RT @becamarthello: As bactérias chegando depois de 5 segundos pra contaminar a comida no chão \n\n https://t.co/gpxQOnsuuC Maisersson e Whinsa https://t.co/RTQHgWlr7E Eu não sei se sou estranho mas eu adoro um dia nublado @imHaruyuki @luisasonza ❤️ @mcguime Kkkkkkkkkkkkkkkkkkk pqp @vitorvilelon Eu não entendi nada do q vc disse amigo To pensando em fazer polo aquático só pra usar esse emoji gente boa demais 🤽🏻‍♂️ Chega covers meus espalhadas por aí https://t.co/UpLVeoVOok PASSANDO MAIS UMA MARCHAAAAA @maisa Luan Santana RT @ThaynaraOG: A Paraíba, o Maranhão e os outros 7 estados nordestinos são maiores que qualquer  preconceito e  ignorância. Desrespeitar o… RT @ThaynaraOG: E que entendam que a missão de governar para todos os brasileiros exige seriedade e impessoalidade no trato com a coisa púb… RT @ThaynaraOG: ...e merece representantes q entendam o valor da nossa pluralidade e a urgência do nosso povo por cuidado, saúde, educação,… RT @ThaynaraOG: O Nordeste merece respeito. É inadmissível que o Presidente se dirija a nós, povo nordestino e maranhense, de forma discrim… Xenofobia em 2019 é putaria viu RT @aurisson: ATENÇÃO: SORTEIO DE UM CENTO DE SALGADO E UMA COCA 2 LITROS, É SÓ DAR RT E VC ESTARÁ CONCORRENDO. SORTEIO ACONTECERÁ SEGUNDA… @rosana MENTIRA Q TU VAI PRA LÁ 😍😍😍 RT @esquivafalcao: Tudo certo pra hoje ! \nEsquiva Falcão bate o peso e confirma luta contra o mexicano Jesus Gutierrez | boxe | Globoesport… Bom dia meu pica @malmalcds Que legal man 😂😂😂 Ligaram o fogo do balão e eu nem tava sabendo, perdão pelo vacilo https://t.co/D4KyklEYhx Ontem no primeiro show da sua turnê eu só constatei o óbvio, qualidade! Você fez o que disse que ia fazer. Vi toda a sua criação, todo o estudo do conceito, todo o empenho e dedicação, e eu só consigui me tornar mais fã, tu é foda, amo vc! https://t.co/vHTJUKgZ0p Fechou meu pica https://t.co/wdX1Ts1p45 Galera q gosta de acompanhar as viagem que eu faço, to indo pra um lugar irado agora, amanhã quando eu chegar vcs vê lá no insta blz meu pica RT @HavocMiranda: A única forma de salvar o Brasil é investir em interpretação de texto Luísa sempre lia as cartinhas dos meus fãs comigo, hoje eu leio as cartinhas dos fãs dela ❤️ Deus é bom o tempo todo! https://t.co/s9OLa15xYE @Jujuca1987 @legadaodamassa e o biel escamoso @fiadabionce Eu não acho normal tipo a pessoa achar q precisa ser magra pra ser bonita, mas só querer ser magra por opção msm acho válido @fiadabionce O que @indiathayna @talidixx As marcas pedem relatório antes de qualquer ação publicitária. O número de seguidores não influencia em nada mesmo na hora de fechar um negócio. Só add com scrap Tem que sumir os likes e voltar com essa barrinha aqui https://t.co/BhrqOe0rst RT @whindersson: A @NetflixBrasil perdeu e sou eu que decido: Whindersson Nunes: Adulto estreia em 15 de agosto! 😂 https://t.co/VajMr0ltBr RT @NetflixBrasil: O @whindersson decidiu, tá decidido! O especial de comédia Adulto estreia 15 de agosto. https://t.co/GQZd917K1o A @NetflixBrasil perdeu e sou eu que decido: Whindersson Nunes: Adulto estreia em 15 de agosto! 😂 https://t.co/VajMr0ltBr @NetflixBrasil NÃO PERA EU NÃO TINHA VISTO @NetflixBrasil PAPEL 🧻 @NetflixBrasil Tá, vou fazer estilo piauiense, eu conto até JÁ e a gente manda na mesma hora!\nDOR, TRÊR, MEA E....\nJÁ! @NetflixBrasil Então vamo pedra, papel e tesoura. Se vc perder, eu decido! @NetflixBrasil QUANDO VAI ENTRAR???? Gente, eu preciso decidir que dia o meu show entra na Netflix, o que eu faço? RT @biahonom: https://t.co/kxoAAYqUfa RT @biahonom: gente! meu irmão de 13 anos precisa de um transplante de coração... \nminha mãe tá desempregada e precisa se mudar pra SP (pró… RT @miss_ursinho: Gente, minha amg contando que quando tinha 8 anos chegou em casa falando pra mãe que tinha que ir pro carnaval de freira,… @miss_ursinho Esse tipo de história sempre chega até mim 😂😂😂😂😂 Toda vez que leio na conversa do whats “digitando...” eu travo uma batalha pra terminar de digitar a mensagem  antes que a pessoa envie a dela, é mais forte que eu, eu tenho q parar com isso PRAZER SHEVCHENKO E ELLOCO\nEU TO SÓ CALAAAADO @FabioPorchat Não aguentava ver tu com esse cabelinho de adolescente https://t.co/DCHpxrrakM Netflix: tem alguém assistindo?\n\nAlguém: https://t.co/teXsDwrt8Q RT @oidesculpa: eu: poxa ninguém me chama pra sair\n\nalguém: vamos sair hoje??\n\neu: https://t.co/cGACM00jXy Ela foi se aciar 😴 https://t.co/hDkI1U26ZW CORRE LUÍSA Q O NEGÓCIO SUBIU https://t.co/AmeTHGSLZ7 Eu tenho fé que em alguma realidade alternativa o torcedor vascaino nao passe por isso VOR https://t.co/S1PIryp4iw VAR toma no cu Te amo https://t.co/U4yqjmYqDy @tixinhadois Compra esse https://t.co/qlDjR1UIcJ @lostinthedarksh Não acredito q vc percebeu isso Porra tiru cagou a foto 😡 https://t.co/1PuCzkuGAx Queria ser amigo da mili bob brau Nos chegando pra pedir desculpas por sempre jogar na cara das outras redes sociais que o Twitter nunca cai // as outras redes sociais https://t.co/EsHqnQ9gaJ RT @infosluisasonza: É designer e empreendedora que chama? Luísa debutou com desfile na Miami Swim Week com sua segunda coleção de biquínis… Bom parece que vocês querem muito o dia em que assisti os vingadores também certo? Seus pedidos es umas ordens RT @FamiliaWhind: @whindersson Certo, e os VINGADORES BB? 🤨 RT @MemeiroOnline: @whindersson Era pra ter gravado vingadores ultimato!!!! 😭 RT @VMGamedroid: @whindersson Até hoje espero o vídeo O DIA QUE ASSISTI VINGADORES ULTIMATO RT @YuriiDS: @whindersson Faz o\"O dia que fui assistir...anna belle, vingadores, homem aranha, etc.\" RT @mcedulol99: @whindersson E o de vingadores Ultimato? RT @Cris_Fiaux: @whindersson Tô esperando dos vingadores até hj @whindersson RT @luanpotter: @whindersson tô esperando o de ultimato ainda https://t.co/xn3pWKIrs8 RT @sonzaqueen: @whindersson e vingadores ultimato, vai sair? hmmmm? Insuperável https://t.co/QYCesG8SrM O canal chegou a 36 MILHÕES DE INSCRITOS, e to a meses sem postar, mas nós vamos comemorar juntos de um jeito que vocês amam! \nTO INDO ASSISTIR ANNABELLE 3 😂 https://t.co/9Hvb2CDk3F https://t.co/uYq5Za5VXD Eu entendi a referência 🐛 https://t.co/nrqfzPixAt Nós estamos aqui pra fazer a pena nossa existência, e hoje vai ser melhor que ontem, e amanhã muito melhor que hoje!\nTenha um bom dia!! 🙏🏼 @LuccasCarlos Que sorrisao bb RT @campos_ezek: @whindersson Oii, to fazendo to fazendo ensaios fotográficos pra ajudar a me manter na faculdade, sou do RJ, ajudem a divu… @evaristocosta Você vai escrever um livro? Eu leria!🙏🏼🙏🏼🙏🏼🙏🏼 Ontem eu e minha irmã fomos deixar umas roupas de frio pra uma família perto aqui de casa, aí o menino disse “posso chamar minha mãe?”\nEu disse “claro!”\nAí ele OH MÃE O ANDERSON SILVA KKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKK De primeira e de olhos vendados 😎 https://t.co/JMVU3KufTp RT @whindersson: Agora uma thread enaltecendo meu Nordeste!!\n\nAcredite ou não, as imagens não são meramente ilustrativas, fique a vontade p… Meu penúltimo neurônio se retirando pra eu dormir enquanto meu último ainda está resolvendo algumas pendências https://t.co/dBZWFefX0l RT @degustevo: bota https://t.co/psmD70jJP4 RT @LilWhind: Está próximo bro, está próximo #Cuscuz Meu pai trabalhava pro pai da minha mãe, um dia ele chamou meu avô e disse que queria casar com uma filha dele, ele perguntou qual, ele respondeu “ah mais linda”\nEra minha mãe, diz ela, pq as tias desmentem, quando toca nessa assunto a confusão é certa https://t.co/jcWVV8ImIg Vocês já tão dormindo já? Não sei pq a Bahia não tá aparecendo mas o tweet tá aqui gente \nhttps://t.co/vnow5oEqVc Não sei pq não tá aparecendo mas tai o da Bahia gente!! https://t.co/cD8MnixjSK @monark Tente ser uma versão melhor de você todos os dias, chega um dia que você precisa se esforçar muito pra muito pra ser melhor que ontem, aí que a brincadeira da vida fica interessante, no fim de tudo é isso que preenche nossa alma. Um abraço amigo 🙏🏼 Mulher to todo embrulhado com minha leoa https://t.co/casmxZZd0Y https://t.co/P0CDKpby2C É o que deveríamos chamar de Kleissoangelo https://t.co/1rdRVa0Hep Eu espero ter te mostrado bem o lugar onde nasci! Você vai amar a receptividade, a comida, a dança, as musicas, o sotaque, tudo!!\nSe eu pudesse escolher onde nascer, eu nasceria nordestino de novo!!!!\nTamo junto galera 🙏🏼❤️ PERNAMBUCO\n\nO Recife antigo é o cartão de visita, Olinda é ali do lado, tem sua própria Ilha de Páscoa 🗿 \nPorto De Galinhas foi eleita 10 vezes a melhor praia do Brasil!\nE já que uma imagem vale mais que mil palavras, pois tome logo essas quatro!! https://t.co/3gMhV30o5m PARAÍBA \n\nGosta de uma água morninha? Pois toma Coqueirinho nos teus peito, pisa nas Maldivas de um jeito diferentes, pq as pessoas falam tua língua!\nE veja bem, só 35 KM da capital!! \nNão deixe provar os frutos do mar se você não for alérgico! https://t.co/DGwleJZO3q SERGIPE\n\nO Cânion do Xingó é a cara um quadro pintado por um artista famoso!!\nA 3 horas de Aracaju, você pode curtir as praias da capital e tirar um dia pra conhecer esse paraíso!! https://t.co/YLsOAFNQn3 RIO GRANDE DO NORTE\n\nSó pra começo de conversa lá está o MAIOR CAJUEIRO DO MUNDO!! (Toda essa área verde) Plantado em 1888!!\nO pescador que plantou faleceu às 93 anos na sombra da árvore!!\nE as praias nem preciso comentar né? https://t.co/SCi1XIcdwq MARANHÃO \n\nVocê já deve ter ouvido muito falar sobre os Lençóis Maranhenses, hoje quero te apresentar o Riachão, você não vai acreditar quando ver o Poço Azul, parece que a qualquer momento a Isis valverde vai aparecer de sereia kkkk\nA primeira foto tirei lá a 4 anos atrás https://t.co/ks7W8THnTF CEARÁ\n\nO Ceará tem muitas praias famosas como Canoa Quebrada, Jericoacoara, mas você precisa conhecer Icaraizinho de Amontada!!!\nÉ a paz em forma de praia, o som do mar e crianças brincando é a única coisa que você vai escutar, o som lá é o da nossa consciência 🧘🏻‍♂️ https://t.co/AZ6blaU1GT BAHIA\n\nSe você curte uma boa trilha e no fim deitar olhando pro céu escutando o som de cachoeira, a Chapada Diamantina é o lugar, tem uma cachoeira de c metros, é simplesmente um belo trabalho do arquiteto do universo 🙏🏼\nNa última foto sou eu laaaa https://t.co/7Mj7CuIqWT ALAGOAS \n\nTem Maragogi, considerada O CARIBE BRASILEIRO, um sol que a Cássia Eller não ia aguentar dois, é de tirar o fôlego!! Se você gosta daquelas água azul de filme, se programe, pq vai te impressionar!!\nDa vontade né Grécia? https://t.co/qfBXcWzSEv PIAUÍ \n\nMeu estado tem a Serra Da Capivara, em São Raimundo Nonato! Tem o museu do Homem Americano! Se você é todo discovery channel como eu vai adorar as pinturas rupestres, uma das únicas espécies de macaco que é usa uma ferramentaaa!!!!!!!!! https://t.co/XVujzDHnyo Agora uma thread enaltecendo meu Nordeste!!\n\nAcredite ou não, as imagens não são meramente ilustrativas, fique a vontade pra dar RT no seu estado ou em qualquer outro!! Vamos mostrar o Nordestão pro mundoooo!! RT @yasm111n: @whindersson O @Calango, eu admiro dms o trabalho dele e a pessoa q ele é, em momentos q eu tava triste eu via a live dele e… RT @falsofenty: @whindersson fã da rihanna por múltiplos motivos... mulher batalhadora que conquistou cada coisinha que sonhou com esforço… É bacana entender as pessoas https://t.co/V5viHwc1cG RT @RonnyKliver: @whindersson De Dorgival Dantas porque eu conheço a grande pessoa que ele é além do artista, e pq é meu conterrâneo daqui… RT @Yuriaclive: @whindersson Humberto Gessinger( ex engenheiros do Hawaii) grande músico, toca tudo, além de ser dos melhores e mais cultos… RT @kikolang: @whindersson Eu sou fã do @bolapresa , primeiro pq eu considero a melhor cobertura nacional da NBA, segundo pela inteligência… RT @agmes_: @whindersson Sou muito fã de Bob Marley, ele, a história dele, as letras e o gênero em que ele pertence são responsáveis de alg… RT @MarianaBelem: @whindersson Magic Johnson pelo jogador, mas principalmente pelo que passou se expondo nos anos 90, em um esporte super p… RT @gildetecamargo: @whindersson Sou fã da minha mãe , ela é fantástica é baiana arretada e forte sempre me protegeu feito uma leoa, com el… RT @geeisaa_: @whindersson Sou fã do @BTS_twt eles me ajudam todos os dias a lutar por mim mesma entender que por mais que agora esteja dif… RT @xheloiza: @whindersson sou fã do luan santana. minha vó era muito fã dele mas ela chegou a falecer, e sempre q eu escutava o luan, me d… RT @_gomesdc: @whindersson @djongadorge Ele ajuda na auto estima que todos os pretos precisam de resto a negada faz isso é muito importante! RT @smgiaw: @whindersson selena gomez\nsou fã dela desde 2008. ela tem uma influência sobre mim já q eu sou fã dela mais da metade da minha… Na vida profissional que você quer seguir, quem te inspira? E por que? Eu to pensando aqui em uma parada legal pra fazer, como não sei ainda quero conhecer vcs um pouco, me conte quem e por que 🙏🏼🙏🏼 De quem vocês são fãs ou admiram muito, e o quanto essa pessoa te ajuda na sua vida? Me conte o por que, pode fazer seu textinho, quero ler!!!!! @BurgerKingBR ÉGUA MCDONIS VAI DEIXAR???????????? https://t.co/AxY5jJ8HWq David Latterman no final de uma conversa com Seinfield, desejou a sua plateia “Dirijam com cuidado, pessoal! E que todas as suas bandas favoritas fiquem juntas” eu acho que isso é uma das coisas mais bonitas que se pode desejar a alguém que você ama Fofinhos 🥰🥰🥰🥰🥰🥰 https://t.co/AsvD4eAJv7 A regra é clara, pizza de chocolate nada mais é que pão com chocolate, lance normal, segue o jogo https://t.co/ViSDXsmHdo Quando eu era criança eu achava que a bosta ficava nas nadegas, foi fácil me fazer acreditar nisso aí https://t.co/8Z0SehjvNu Minha mãe me ligava no carnaval o cara do trio pedia pra eu atender logo ou sair dali que tava atrapalhando https://t.co/lDyhgGB8py @maisa To feliz que acabei de ler isso na sala de espera do psiquiatra, não sei como tu aguenta Carai 5 da manhã já Bolo de cenoura com calda de chocolate: a\n\nEu: https://t.co/VdYY5CaTkK Fóscro Vou é assistir nova webserie da viih tube que eu ganho mais Adoro esses viral que começa de manhã e de noite a galera já tá puta que não aguenta mais ver kkkkk Eu se fosse homem kkkkk https://t.co/tomoaeIMyK Boa noite garela Quando a soneca foi boa https://t.co/hfs18jjd5n @mariruybarbosa Ao vivooooo É um papachorro ou um cachogaio? https://t.co/LvHDYI6eF1 @maisa Kkkkkk vc tem barbicha Eu sou o de cabelo solto https://t.co/5FnpJ9gEjK Se seu amigo não te avisa que você tá com mau hálito ele é só um conhecido Atendeu https://t.co/IGBg6oPv40 Cara eu paro pra assistir um jogo da seleção e o Tiago Iorc já sumiu de novo meu deus Minha filha ore por mim tbm kkkk oração forte viu https://t.co/EGRaUtMECO Meu Deus a mãe do Gabriel Jesus já tava com a mão no telefone pra atender a ligação Eu ganhei um prêmio ontem né, aí umas pessoas nos comentários me detonando como se eu tivesse criado o prêmio e me dado kkkkk oh putaria viu 😂😂 @fiadabionce Morro de medo, mas são tão lindinhos @LuccasCarlos Gisele disse que uma amiga dela perguntou se ele tem namorada https://t.co/dfZuBXycMs @maisa Que horas q eu vai pq toda vez que eu saio tu posta @MhelMarrer Fui lá em LA essa semana e falei mto de vc viu Em agosto sai meu show na Netflix, vamo fazer barulho Galera, hoje vou gravar vídeo pro YouTube, vou colocar show só sábado e domingo pra ter tempo pra gravar vídeo, pq eu gosto msm Agosto vou voltar pros palcos viu bb “Um amigo próximo contou ao jornalista que” um amigo próximo não conta nada a jornalista, jornalista tem que parar de tentar adivinhar a vida dos outros, qualquer um que me conheça e conta algo da minha vida a jornalista com certeza não é meu amigo. Boa tarde meus amigos 🙏🏼 https://t.co/gkQcVzWB35 @RoKiferr Vc é um gênio Galera que for sair na lua cheia cuidado que tá tendo blitz https://t.co/CazpqeMBQZ Que notícia triste, fica com Deus man ❤️🙏🏼 https://t.co/nphjkx4LJ7 @kaliel @nollywoodroll tem tudo nesse perfil aqui! Dancinha do fim de treino 🏋🏼‍♀️😂 https://t.co/w1aFnhRq6K Quando bate o pré treino e ainda falta 15 min pra chegar na academia https://t.co/1IyhKdiq0J @zehneto Cara tu vai pirar quando for em Icarai de amontada Maísa se revolta com jornalista sobre entrevista dada a jornalista e whindersson dispara: Maisa diz que se revolta após ver jornalista dizendo que ela se revolta sobre entrevista https://t.co/7ItRCIyS5H - vamo ali comigo?\n- vamo\n- fulano vai com a gente\n\nEu: https://t.co/izPvKFLKcG Quando a mãe queria fazer vitamina de abacate na hora do dragonball https://t.co/DSE9pDD0IP Único susto que eu queria tomar https://t.co/QQJ04X7vKw @OGatoGalactico Vc da mto moral pra hater Gente tem algum lugar tipo paradisíaco no seu estado que ninguém conhece? Manda alguma foto ou o nome pra eu pesquisar aqui O cara que apresenta as ideias e o cara que tem as ideias https://t.co/j332ohJu4m Com licença eu queria saber se já chegou Harry Potter https://t.co/DSZVc5dySZ Queria ser amigo da Emília Clarke Boa noite 😘 https://t.co/2IPNfI0HDN menino o Malfoy é a cara do Paulo Gustavo com cabelo agora q eu percebi https://t.co/bdWy1jzxlg @Fiuk Mim mastubano Rapaz meu vizinho volta e meia recebe visita de algum artista agora o pica pau eu me impressionei viu, moral https://t.co/VtBad6JGOe Eu ia botar “late mais alto que daqui eu não te escuto” de legenda mas como é que não escuta com uma urêa dessas https://t.co/2aOFO1BSIr @chicoliru https://t.co/1gz5cR9QmM Meus pais tbm achavam https://t.co/I8edIgZFJ2 RT @marcoscastro: Meu filho brincando com os dubladores originais do Toy Story é o vídeo mais fofo que vc verá hoje (eu tb virei criança) h… Fagner é assim que se toca Garupa https://t.co/fuXgL7zqDL Mais um dos meus rolês aleatórios https://t.co/dz3CTFmIn7 LARGA TOM CRUISE @justinbieber BORA 5 MINUTO SEM PERDER A AMIZADE https://t.co/8VPvCmZeMG Por riba sai do mei tome tome sai do meu taça o pau por riba abaxa sobe e tome queima quengaral iiiiiiiiieeeeyyyyhhhh https://t.co/MluHZFU4LI A PARÓDIA DE GARUPA VEM Bom dia 🌞 Já acordei com essa maravilha hehehehehe \nhttps://t.co/D5tT1pni57 RT @luisasonza: SAIUUU! Vem assistir GARUPA 🏍️ ft. @pabllovittar \n\nhttps://t.co/NveM2hqDlr https://t.co/GGe2qkp5NP @luisasonza Bom dia minha fia tome pelomeno um café ☕️ Eu tava num momento difícil quando Luísa apareceu com a música “Apenas eu” eu CHOREI TANTO TANTO TANTO que a música deveria se chamar Bezetazil \nTu é foda @luisasonza \n#PANDORA SAIUUUUU!!!!\n#PANDORA \nhttps://t.co/TuX2FW8t9T RT @luisasonza: Disponível agora! #PANDORA 🗝\n\nhttps://t.co/xzEDvAbEII https://t.co/tyedk7heqA @luisasonza Eu gostei daquela todas @mariruybarbosa Eu gostei da 6º série, chega no ensino médio começa a ficar mto difícil a matemática e física RT @luisasonza: TÁ CHEGANDOOOO #Pandora @luisasonza Tá atenta nas pergunta viu Feliz dia dos namorados pra vocês meus amigos, que Deus abençoe o relacionamento de vocês, que a gente aprenda o valor da nossa parceira(o) a cada dia, ser compreensivo, paciente, e aguentar a barra que serão muitas. Onde tem amor tem tudo! ❤️ https://t.co/G3P60ub0gU @gracekrodrigues @pulamuralha Você tem o contato dela? @peegakat Tá falando sério? @phamyllabreenda Sério? Se não corre risco e não tem mais perigo eu já vou montar meu repertório de piada com faca pro grupo da família https://t.co/hl614S4VuY https://t.co/R8zGKMZ1h2 Diabo esses assaltante num lava nem os instrumento de trabalho a faca veia puro macarrão Eu fico indignado que ele disse que pedia ajuda e ninguém fazia nada, olha sei lá eu não sei eu nem vou falar nada Deus me perdoe pelos meus pensamento Meu irmao tá bem galera, já fez tudo que tinha que fazer, fiquem tranquilo, não foi fundo, não tem risco, só desespero mesmo, obrigado aí pelo apoio Acabaram de esfaquear meu irmao, por causa de uma merda de um celular que ele ENTREGOU e mesmo assim fizeram isso, ninguém tem um dia de paz nessa desgraça Hoje eu tô tão filosófico que um amigo perguntou que horas podia vir aqui amanhã eu disse antes do sol se pôr kkkkkkkkkkk O cão assistindo o outro cão lkkkkkkkk https://t.co/ijAmmZAn0N Amo esses olharem me julgando, me sinto até no tempo da escola https://t.co/JlXLP323jD Tem tempo pra tudo rapaz, tenha calma, quer tudo de uma vez é 😂😂 abraço meu amigo https://t.co/USx2tOuWck Alerta né? Eles latem a gente fica puto, só tão tentando ajudar, alertar, se preocupando com a gente eles se preocupam com eles mesmo, se estamos bem eles estão bem, tem comida, tá tudo certo, como é o nome dela(e) https://t.co/AhMYCGAoWt Ela gosta de ficar perto, da pra entender que não é só por que eu dou comida, é como se ela fizesse parte de mim, sei lá. Acho que deveria ser, talvez algum dia a gente entenda que somos parte um do outro. https://t.co/1dgdflh9Bq Que pergunta bonita, eu acordei brinquei com meus cachorros, me exercitei, fiz uns exames, trabalhei um pouco, agora to curtindo uma música boa, com meus cachorrinhos perto. E o seu? https://t.co/XkyOSKnR7V Nos definitivamente deveríamos confiar nossa vida aos cachorros Quando Luísa vai chegar em casa os cachorros descem uns 40 minutos antes e ficam olhando pra porta, é incrível Tu é doido é eu tenho amor a minha vida irmao 😂😂😂😂 https://t.co/9f5sCYd2aa Meu deus eu to parecendo o cantor da calcinha preta https://t.co/8jMT6iF4v6 Chegamos, e fiquei tão feliz que até meu suvaco brilhou 😂 https://t.co/TxotKWhfWZ Galera nunca peguem carona com o @Fiuk nois tava a 5 minutos do lugar ele erra o retorno agora tamo a 45 minutos fica aí o alerta https://t.co/QSCoVndjhp @lucasfresno Estranho né Fico triste pelo meu pai, nem imagino como deve ser não ter mais mãe ☹️ Foi simbora mais uma avó, agora tô sem avó nenhuma, nem avô, meus pais sem pais. Eu visitei ela faz umas duas semanas e prometi que voltaria pra fazer massagem nas pernas dela, a proposta tá de pé pra quando a gente se encontrar. Te amo vó! ❤️ @Kefera Vê na band, ex zagueira da seleção de comentarista, mto melhor RT @otprurr: cristiane e a namorada tá passando por sua timeline pra dar sorte https://t.co/MObvCvaA36 @kaliel Parece q tá com fome Cristiane quinta tem Vasco x Ceará assim se tu tiver sem fazer nada e puder dar essa força pra a gente @caxxxxxtro Sério isso???? Que lixo Fui assistir minha irma lutar, ela tá lutando pela federação paulista já que o presidente da federação piauiense de karatê botou tanto ela pra baixo. O esporte piauiense como sempre incentivando seus atletas 🤷🏻‍♂️ Bom dia cumpades, bom dia cumades 🙏🏼❤️ Que classe para assistir uma luta https://t.co/FmqXEFWTqS @Dudu Mto treino, mta dedicação, acreditar em si mesmo, e baixar o app certo 😂 Um olho no combate outro no Twitter \n#MarlonMoraesNoCombate https://t.co/8yggufQnZn A coisa que eu mais tenho raiva no avanço da tecnologia é que as televisão não tem mais um botão pra quando a gente perde o controle pqp Com quantos anos você descobriu o o capuz do moletom é feito na verdade pra colocar cachorrinhos fofos? https://t.co/kebfX5K4A9 RT @lucasinutilismo: @whindersson pois eh se puder dar uma olhada no meu trampo ae https://t.co/nydBxQgGPG tmj manda salve Diante as circunstâncias dos últimos dias parece que nós estamos vivendo em uma realidade alternativa @maisa Comecei aos 19 Ah não de roupinha não da pra mim https://t.co/iYmm38svKB O pessoal só pode achar que eu sou pertubado só pode, mas é lógico que tudo tem que estar nos conformes pra lançar um app de saúde! 🤷🏻‍♂️\nO pessoal agoura as coisas antes de começar aff https://t.co/3PGF6EeGxR Só se o cupido tava ruim de pontaria e desceu pra aplicar o amor pela injeção mesmo https://t.co/gfemsBr9Md Treinando pra caso algum dia eu precise puxar algo de 180kg que no caso vai ser nunca https://t.co/9jCfyVMvRj @ThaynaraOG Eu não disse que não iria 🙊 @LubaTV Parabéns constatou o óbvio https://t.co/Wf2xZA4clE RT @xuliozeira: @whindersson Vai ter internacionalização do são João SIM https://t.co/QSGY0fsOKn Crocs é um caminho sem volta NORDESTE ❤️ https://t.co/w13EzcWkJ1 RT @pronomeneutro: a prática de exercício físico é essencial para uma vida saudável  https://t.co/tewYvohys8 RT @oieusoupablo: oi, eu sou Pablo e faço Cactos de Tricô. 🌵\n\nSão lindos, não precisam de água e ainda deixam seu ambiente com cheirinho de… @majutrindade @lucasfresno O que mudou artisticamente nele depois de ter a filha? Ficou mais sensível? Foi mais inspirador? Boa noite cumpade, boa noite cumade 😴 Voltando devagarin, cuidado pra não rasgar o anel\nPra quem gostou da Placa de Rubi, se prepare que a chibata vai ser perversa viu https://t.co/kHmOGYSMyc @pedromarciobjj @Minotauromma Eu ainda to com o cu pôdi mah 😂😂😂😂 Respeite professor viu meu amigo!! Que honra @Minotauromma 🙏🏼\nMta descontração no treino de hoje!!\nO Shaolin do Piauí vai voltar hehheeheh https://t.co/KXeL0lf0p5 Eu vi o vídeo aqui do Neymar, mas não vou falar nada pq o amigo do Neymar tá pelas áreas...... @filipecoutinho @SporTV To malhando bb 🏋🏻‍♂️ https://t.co/vDnMksI3or @bicmuller Você enche a banheira, aí quando entra os dois têm que secar um pouco pra não transbordar, aí quando levanta os dois o nível da água baixa de mais e a banheira joga um jato de água no olho da gente, um lixo Boa noite cumpade, boa noite cumade @saalesisabelaa 4 agora 😂 @ThaynaraOG Atenta Descansar depois de comer a ponta da almofada pq ninguém é de ferro né https://t.co/gs96QAa7FH Agora é muito difícil fazer música com o Alok pq ele canta ruim demais, meu Deus, sério mesmo, um parabéns pra vc tu conhece pq tu sabe a letra Fizemos uma música juntos, e o motivo é claro, dar esperança pra pessoas viverem, e todo o lucra com os diretos autorais da musica deram doados. Por que vocês acham que eu to todo animadinho ultimamente? O cara simplesmente sempre que tenho um problema e me encontro com ele, eu saio querendo passar aquele conhecimento adiante e tentar mudar algo no mundo É incrível como algumas pessoas conseguem mudar o pensamento de algumas pessoas. O Alok foi uma pessoa que eu agradeço demais a Deus por ter me colocado no caminho dele. É que vc criou o caminho pro sono, toda vez que tentar vai dormir, vc precisa fazer uma nova forma de meditar, é bom viu https://t.co/xTyXHSDMWG Melhorou 95%, já to começando a treinar de novo, eu que tenho medo de dar um golpe e rasgar https://t.co/NiNorFijae Cumade, demaaaaaais mermã, mta energia boa de vcs, mta terapia, meditação, oração, tudo que tinha pra fazer!!! https://t.co/X5SypNa8o2 Vou passar a chamar vocês de cumades e cumpades No mais tá tudo certo né Tem umas página de fofoca que antes de eu postar o negócio já aparece lá Eu estou de cabeça nesse app, eu recebi tanto carinho nas ruas, tanto apoio, tantas palavras bonitas, nenhum mal que já me fizeram chega tão perto do carinho que recebi! Eu realmente só tenho agradecer, esse aplicativo é a minha forma de agradecer! Espero que esse app ajude muita gente como muita gente me ajudou. Não vamos mudar o mundo mas talvez a gente mude o mundo de algumas pessoas! 🙌🏼 Quando o app tiver pronto irei fazer um vídeo sobre tudo que passei nos meus momentos ruins e como usar e indicar o app corretamente. Que fique claro que não queremos que o profissional formado trabalhe de graça, e sim VOLUNTARIAMENTE tire uma hora do seu dia para uma consulta de graça em nosso app Daqui uns dias eu posto um e-mail aqui para os profissionais da área mandarem seus currículos pro email Estamos resolvendo problemas como: pessoas que tem grana mas querem usar de graça, a certificação de que as pessoas ajudando no app sao realmente profissionais (vemos que a uber faz toda essa pesquisa mas não adianta, então temos que ser bem atentos) LEIA OS TWEETS ABAIXO:\nNosso app que ajuda conectar pessoas com problemas psicológicos a terapeutas e piscologo DE GRAÇA está em andamento!!\nMas preciso da ajuda de todos vocês! O pessoal me colocando como se eu tivesse elaborado uma grande piada sobre o assunto. Eu só postei uma frase que todo mundo postou, oxe https://t.co/bCcwyGQWN6 Eu disse que estava certo?\nSo disse que todo mundo postou, Maísa, Ludmilla, aí eu posto igual e da merda pra mim.\nSo foi isso que eu disse. \nEu ein. https://t.co/M20SaAe8FP Todo mundo postou brincadeira sobre as cantadas na conversa do Neymar, todo mundo, mas o amigo do Neymar veio reclamar no meu kkkkk eu só me fodo mesmo, mas eu to acostumado, eu torço pro Vasco. Bom dia!! \nHoje vai ser melhor que ontem, e amanhã melhor que hoje!! 🙏🏼❤️ O auge 😂 https://t.co/YmekFgEzuO O que vocês gostam de fazer no domingo além de nada? Kkkkkk vocês adoram tentar adivinhar a vida dos outros, realmente não conseguiu absorver nada do tweet que leu https://t.co/Ff6ZHLOwRc @OBrunoBrun0 Meu JeItiínHo CoOmpliícahDo Felicidade é inversamente proporcional ao quanto você toma conta da vida dos outros 🙏🏼 galera de Teresina!! https://t.co/Kco28AIUry RT @dudaamarzuca: E minha amiga que foi pagar pra conhecer o estádio do Real Madrid e virou sócia pq não sabia falar espanhol https://t.co/… São 10 episódios, cada um com MEIA HORA DE DURAÇÃO, ora ora pra vcs que reclamavam q não tinha vindo, agora vai ter é demais. \nParece que o jogo virou não é mesmo? Acabei de assistir o episódio que gravamos em Oslo, na Noruega, pro Youtube, vcs vão pirar!! Todo mundo precisa ver a Ludmilla cantando Halo!! https://t.co/jv2ECXy3Mp A Ludmilla é foda viu Caralho @Ludmilla parabéns por essas coreografia no seu novo dvd to tonto aqui bicho top viu @MariliaMReal MARÍLIA MENDONÇA DESABAFA NA WEB Boa tarde rapaziada bora soldar os mordedor https://t.co/gijBzREdCz VillaKids Goiânia 🤠🤠🤠 https://t.co/4KDH7BYW7o Tá amarrado queima senhor assustar o cão demonho https://t.co/fJHV7y4htB @MauroNakada 3M ✋🏻✋🏻ATENÇÃO✋🏻✋🏻\n🦔⛑PORCO ESPINHO DE CAPACETE🦔⛑ \nPASSANDO NA SUA TIMELINE 💨💨 https://t.co/oju6NFgHEK Sograo chegou galera, tá entregue sã e salva e com os batimentos cardíacos em dia @kccustic Que lindo!! Muito obrigado!! ❤️ Adoro fazer comida pra criança pq ela nunca come todo e eu fico com o resto RT @Yuko_Lange: @whindersson Desculpa whinder mas eu reparei na sua bunda sem querer e vc está de cueca mano?? ?? ?? ? Luísa foi no médico e pediu pra eu cuidar da irmã dela https://t.co/py9cf3T1gv Rapaz, acho que tá na hora de “o dia em que eu assisti os vingadores ultimato” Boa noite beberes Rapaz pense num sorriso de orelha a orelha que este piauiense vei deu aqui agora!!!\nQue essa nova menininha se torne uma mulher forte como a mãe!! 🙌🏼🙌🏼🙌🏼 https://t.co/P1VFhPbAOO @Nitrooww Parabéns, é dia de festa!! 🙏🏼 https://t.co/Y7yPfiFiVV Não compartilhem fotos ou vídeos das vítimas, se alguém lhe mandar nem baixe, apague logo, e diga a quem mandou que apague tbm, é muita crueldade ter fotos de algo que entristesse outras pessoas Meu deus do céu @Anderso66989434 Claro meu amigo, vou te seguir e você me chama no direct 🙏🏼 Se toda vez que meu pedido demorar for por que o motoboy parou pra dançar com um trenzinho da alegria nunca mais eu reclamo https://t.co/mnwdJn1YE6 https://t.co/w7IfdVB5Hm @oldarthbastarde @LilWhind Eu? Esse aí é o Lil Whind 😂 RT @LilWhind: CUSCUZZZZZ 💸💸💸💸💸💸💸\n#LilWhindTeDetonaMano https://t.co/cdxax1qdqI No avião ontem tava cheio de fãs indo pro show do BTS, inclusive elas me mostraram algumas musicas e eu mostrei as minhas novas musicas, elas foram mto legais, bom show hoje galerinha 🙏🏼 RT @LilWhind: Cuscuzzzzzzzzzz 💎💰💸 E por favor não vá atacar ninguém não, deixe cada um seguir sua vida e ser feliz. O momento é de festejar, é de felicidade. Deseje felicidade aos noivos, e que Deus esteja sempre olhando por todos nós! Só eu sei o que passei com você nesse últimos meses gravando, e não tô afim de falar nada disso aqui pq vc esta em um momento único da vida, então me deixe Eu disse a ele que não fui pq não me sentia bem em ser padrinho de casamento do cara por causa do jeito que ele me tratava, como eu vou ser padrinho de quem eu mal conheço, o cara me bloqueia, não me da o direito de conversar e me difama na tv Não venha querer reverter na rede social não, vem brincar com meu problema, curta sua lua de mel e deixe eu em paz https://t.co/8ysNMvsLPr É só vc clicar no botão que bloqueia o celular e ir curtir, e não ficar falar besteira na tv https://t.co/TFYgxc14Vf Então me desbloqueia do zap bb https://t.co/ep8PFo86T5 Você será o primeiro quando entender o que é ser um. https://t.co/pWkzupLRAA Kkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkk RT @LilWhind: Shit RT @craiskc: eu com 10 anos \nde idade indo \nfalar pra minha mãe\n11 da noite que \nprecisava de cartolina\npra levar no outro\ndia pra escola… Juntos e shallow now https://t.co/MNjVCnjU7h RT @tylerthecreator: again, trust your ideas ,be your biggest cheerleader and be smart about it cause fuck em RT @outlawstogether: @whindersson COME TO BRAZIL RT @nostrendsbrasil: ASSISTA LARGA MEU BOY - Twitteiros comentam e divulgam Larga meu Boy; novo vídeo do @whindersson. #NosTrendsBrasil htt… RT @NosTrendsBrasil: #Whindersson10Milhões - O canal do @whindersson no YouTube ultrapassou 10 milhões de inscritos. Fãs comemoram. https:/… RT @NosTrendsBrasil: #Whindersson6Milhoes - A conta do @whindersson no Youtube está prestes a ultrapassar 6M de inscritos. Fãs divulgam. ht… RT @NosTrendsBrasil: #ParodiaWhinderssonAdele - Twitteiros comentam o novo vídeo do @whindersson. #NosTrendsBrasil \nhttps://t.co/8Fy51SGWvn RT @NosTrendsBrasil: #WhinderssonNaEliana - Youtuber, @whindersson, um dos mais conhecidos, estará na @Eliana, no SBT. http://t.co/vsnuFDfe… RT @pirockstar: pipiu xoxota coco xixi pum RT @zzmuller: me emocionei com um video do whindersson RT @de__longe: whindersson é foda RT @JMCaastro_: Tão linda- Whindersson 🎶🎶 RT @NosTrendsBrasil: Desde agosto de 2013, que esta criança está desaparecida. http://t.co/zGbdPLdeCl RT @DiegoLuiggi: #McGardenToSuave Mc Jardim ta soft junto com o filho do vento wind son nunes RT @kethelenvitoria: Conhecer o @whindersson *0* #DezCoisasQueQueroFazerAntesDeMorrer RT @NosTrendsBrasil: #QueremosWhinderssonNoTheNoite - Fãs querem o vlogueiro @whindersson no \"The Noite' Com @DaniloGentili, e fazem campan… RT @NosTrendsBrasil: #WesleySafadãoOWhinderssonTeAma -O @whindersson demonstram todo seu amor por @WesleySafadao, e sobem a tag. RT @NosTrendsBrasil: #WhinderssonResponde -O @whindersson está respondendo alguns fãs com a tag. #NosTrendsBrasil RT @NosTrendsBrasil: #WhinderssonNoPremioJovemBrasileiro - Fãs do @whindersson, indicam e votam nele no @premiojovem. #NosTrendsBrasil RT @NosTrendsBrasil: #SeuSorrisoNosMotivaWhindersson - Fãs do Vlogueiro @whindersson, demonstram todo amor por ele e, o homenageiam com a t… RT @NosTrendsBrasil: Whindersson - Fãs divulgam o canal do @whindersson no Youtube, o Vlogueiro também respondia seus fãs com a tag. RT @CarinaCrvg: @whindersson Mossoró #WhinderssonRumoA1MilhaoDeInscritos RT @NosTrendsBrasil: #WhinderssonRumoA1MilhãoDeInscritos - O @whindersson está com quase 1 milhão de inscritos em sua conta oficial no yout… RT @bruramoss_: #WhinderssonNoPanico Dá-lhe ô doido @whindersson RT @CarinaCrvg: Justo! @whindersson\n#WhinderssonNoPanico RT @ranierydpm: @whindersson xvinista, a crença do xvideos. RT @iambiabrito: @whindersson Maracanaú -CE õ/ kkkkkkkkk RT @josielabrahao: @whindersson http://t.co/HMXsvE9F8Z me ajuda ae fera RT @_vishingrid: então o nome das suas fãs é Whin' Cats? É isso mesmo produção ? @whindersson RT @_vishingrid: Zé Roberto ! @whindersson RT @duardobraga: hiper foda o último vídeo do @whindersson :'/ independente da sua idade, vc nn consegue nn se emocionar *-* PARABÉNS RT @_vishingrid: @whindersson oi oi whindersson RT @_vishingrid: @whindersson Colatina-ES :/ RT @GiselleRods: - queremos @whindersson no #esqueeeeeenta cara sou tua fã te apoio pra caralho tu é muito fera no que faz :) RT @_vishingrid: @whindersson Zé Roberto ! RT @_vishingrid: SUPER FODA O VIDEO NOVO DO @whindersson , RIP MOSCA ! RT @_vishingrid: amo quando o @whindersson  me dá RT , sérião &lt;33 RT @_vishingrid: amando a nova paródia do @whindersson , parabéns Whindersson,tu é foda ! RT @_vishingrid: cara,os vídeos do @whindersson são fodas,sem mais! RT @15NAYRE: Adoro quando alguem faz uma afirmação tão descompromisada sobre mim, mesmo sendo mentira ou uma forma d puxar assunto RT @_vishingrid: super foda o vídeo novo @whindersson , \"ENFIA ESSA MOTO NO CÚ,RAPARIGA\" HAHAHA , Compartilhei o vídeo no fb RT @_vishingrid: @rodrigovesgo você podia ir conhecer o @whindersson ! RT @_vishingrid: #Cite5PessoasFofas @whindersson *----* &lt;33 RT @marcoos_rocha: O @whindersson voltou galera !! Se increvam ! RT @_vishingrid: o @whindersson é foda man , sem mais , http://t.co/d2KqCm30 RT @_vishingrid: @Kefera olha a paródia do @whindersson http://t.co/d2KqCm30 RT @_vishingrid: @whindersson parabéns pelo vídeo novo haha muito bom ! http://t.co/d2KqCm30 RT @MillyFellevack: @whindersson #10PessoasMaisLindas  &gt;&lt; cooncerteza voce ta classificado sz ' Liindeza demais RT @_vishingrid: @whindersson Bom Dia *-* &lt;3 RT @_vishingrid: menina pergunta:@whindersson por que você é taão fofo? ele responde:deve ser por causa da cara de bebê:::::: cagado , K ... RT @_vishingrid: morrendo de rir com o vídeo novo do @whindersson http://t.co/7VLoxVxd RT @_vishingrid: aaaaamo os vídeos do @whindersson haha são mt fodas RT @marcoos_rocha: Todo mundo ligado que vai ter vídeo novo do @whindersson RT @15NAYRE: @whinintendo #WTF #CadeVc Tipo senti sual falta na minha residencia #Fail #lacking RT @15NAYRE: http://t.co/Gizruk7a divulgando pro meus 19 seguidores... ajuda??? kk @whinintendo RT @15NAYRE: @whinintendo oi... vi seu video, ficou muito bom, vc argumenta bem...\nparabens... Eu so ñ entendi o q é MrDikunForca... RT @15NAYRE: Reflita sobre tudo q aconteceu esse ano:Geyse arruda,fiuk,pelanza,Tico Santa cruz,Bieber,Serginho malandro e etc...mau poss ... RT @15NAYRE: Twitando no natal...", "emojis": {}, "interests": {"show": 65, "ma": 48, "ser": 48, "bom": 37, "rio": 35, "galera": 34, "boa": 26, "pica": 26, "sou": 26, "do": 24, "agora": 24, "man": 20, "para": 20, "tempo": 15, "bora": 14, "era": 13, "dele": 13, "hora": 13, "ria": 12, "mim": 12, "da": 11, "goi": 11, "sabe": 10, "ante": 10, "rie": 9, "hist": 9, "tag": 9, "sair": 9, "dar": 9, "dessa": 8, "fico": 8, "come": 8, "twitter": 7, "favor": 7, "pais": 7, "amor": 7, "campo": 7, "saber": 7, "pega": 7, "fez": 6, "sai": 6, "porto": 6, "pau": 6, "lindo": 6, "mil": 6, "conte": 6, "tweet": 6, "fique": 6, "video": 5, "terror": 5, "massa": 5, "par": 5, "meio": 5, "calor": 5, "sol": 5, "chamar": 5, "forte": 5, "claro": 5, "mar": 4, "junto": 4, "whats": 4, "passo": 4, "time": 4, "vale": 4, "estado": 4, "pandora": 4, "amar": 3, "quarto": 3, "fogo": 3, "min": 3, "barra": 3, "tiver": 3, "mero": 3, "canal": 3, "nova": 3, "sil": 3, "valor": 3, "dan": 3, "gio": 3, "alto": 3, "achar": 3, "gra": 3, "tua": 3, "peteca": 3, "lan": 3, "sess": 3, "fazenda": 3, "thread": 3, "capital": 3, "ama": 3, "fam": 3, "chip": 3, "natal": 3, "bob": 3, "chocolate": 3, "mudar": 3, "top": 2, "brazil": 2, "planeta": 2, "nome": 2, "brown": 2, "gelada": 2, "comer": 2, "serra": 2, "delta": 2, "pop": 2, "cora": 2, "professor": 2, "dinheiro": 2, "monte": 2, "marque": 2, "link": 2, "mal": 2, "manter": 2, "news": 2, "humor": 2, "gabi": 2, "understand": 2, "thanks": 2, "post": 2, "stand": 2, "porta": 2, "inclusive": 2, "web": 2, "mat": 2, "mail": 2, "data": 2, "propaganda": 2, "drama": 2, "turn": 2, "frase": 2, "banner": 2, "hack": 2, "os": 2, "harry": 2, "potter": 2, "jerry": 2, "whin": 2, "especial": 2, "tai": 2, "presidente": 2, "bate": 2, "rea": 2, "mau": 2, "bot": 2, "boy": 2, "cantar": 1, "bed": 1, "hit": 1, "cor": 1, "lata": 1, "animal": 1, "caracter": 1, "summer": 1, "casal": 1, "samba": 1, "soccer": 1, "manga": 1, "mano": 1, "resolve": 1, "insist": 1, "action": 1, "monster": 1, "high": 1, "urubu": 1, "buriti": 1, "pedro": 1, "mangue": 1, "mila": 1, "coroa": 1, "tri": 1, "bah": 1, "hacker": 1, "alem": 1, "passado": 1, "smith": 1, "travis": 1, "guardo": 1, "vim": 1, "pro": 1, "tic": 1, "aula": 1, "agenda": 1, "rel": 1, "basta": 1, "polis": 1, "site": 1, "vision": 1, "levo": 1, "rock": 1, "dow": 1, "troca": 1, "pastel": 1, "gin": 1, "dom": 1, "taa": 1, "faze": 1, "bra": 1, "pique": 1, "make": 1, "wer": 1, "forum": 1, "voe": 1, "marina": 1, "flores": 1, "want": 1, "food": 1, "knowing": 1, "bit": 1, "compositor": 1, "big": 1, "bang": 1, "ikat": 1, "piaba": 1, "mora": 1, "lamber": 1, "platina": 1, "cinema": 1, "nam": 1, "noa": 1, "legal": 1, "ponto": 1, "role": 1, "junta": 1, "curioso": 1, "che": 1, "express": 1, "energy": 1, "car": 1, "dola": 1, "hart": 1, "hip": 1, "ra": 1, "bel": 1, "pare": 1, "sinal": 1, "prod": 1, "mad": 1, "chuck": 1, "bola": 1, "men": 1, "serum": 1, "sen": 1, "bater": 1, "ave": 1, "maria": 1, "hamster": 1, "mem": 1, "eyn": 1, "final": 1, "banca": 1, "chute": 1, "play": 1, "lama": 1, "pat": 1, "today": 1, "dog": 1, "mao": 1, "ion": 1, "ram": 1, "fandom": 1, "divide": 1, "rep": 1, "meeting": 1, "comedic": 1, "brother": 1, "fan": 1, "work": 1, "friend": 1, "person": 1, "great": 1, "guy": 1, "excuse": 1, "reporter": 1, "teste": 1, "duro": 1, "please": 1, "break": 1, "heart": 1, "song": 1, "name": 1, "cat": 1, "material": 1, "brave": 1, "voar": 1, "record": 1, "escape": 1, "artist": 1, "back": 1, "mover": 1, "coach": 1, "street": 1, "mana": 1, "polo": 1, "cento": 1, "coca": 1, "peso": 1, "bal": 1, "add": 1, "visto": 1, "conto": 1, "dor": 1, "miss": 1, "passe": 1, "gaj": 1, "designer": 1, "swim": 1, "week": 1, "anna": 1, "belle": 1, "refer": 1, "exist": 1, "oii": 1, "silva": 1, "pen": 1, "pend": 1, "bota": 1, "alma": 1, "hep": 1, "cart": 1, "pintado": 1, "discovery": 1, "channel": 1, "magic": 1, "fant": 1, "auto": 1, "pizza": 1, "lance": 1, "trio": 1, "dali": 1, "bolo": 1, "tube": 1, "fosse": 1, "sele": 1, "dado": 1, "blitz": 1, "dada": 1, "hater": 1, "algum": 1, "toy": 1, "story": 1, "cruise": 1, "tome": 1, "tux": 1, "lava": 1, "cantor": 1, "band": 1, "salve": 1, "precise": 1, "pablo": 1, "prepare": 1, "jato": 1, "golpe": 1, "tire": 1, "curr": 1, "sao": 1, "tor": 1, "auge": 1, "real": 1, "dura": 1, "halo": 1, "card": 1, "vei": 1, "reverter": 1, "rede": 1, "cheerleader": 1, "cause": 1, "coco": 1, "wind": 1, "justo": 1, "super": 1, "rip": 1, "cite": 1, "responde": 1, "fail": 1, "po": 1}}