{"tweets": "Lock in! #DubNation All eyes #lockedin on year 11, but my passion for growing the game of golf never stops. Hyped to officially announce my partnership with @CallawayGolf to bring the game to underserved and underrepresented youth! #RuinTheGame https://t.co/FNQVLnRLuZ When it comes to empowering girls, Oakland HS is getting it done. @chase and I are launching the “It’s Our Game” ticket platform, spotlighting local organizations that are making a difference in girls’ lives and surprising them with @Warriors tickets every game! #RuinTheGame https://t.co/ddEY5SIYWq @nicekicks @Lakers @KingJames @warriors @NBAonTNT My farmer's tan (aka golf is life) is undefeated. And yeah my kicks are 🔥🔥 #ua #curry7 So uhhhhh I guess....it's that time again. Lock in! #DubNation @ComplexSports @Brice_Butler I’ve watched this 25x. That last play is hilarious to me. Wow I love it. Taking the #Learn in @eatlearnplay to another level. Proud to invest in @GuildEducation and @RachelRCarlson as they #ruinthegame in education! Check them out! https://t.co/Kx9qs8IjMP @ZachLowe_NBA They might have to change the 50/40/90 accomplishment 🤦🏽‍♂️. This journey on and off the court has been amazing so far. I'm ready for the new season, ready for year 11, ready for what's to come. And ready to share every step of the way with you. #RuinTheGame https://t.co/KNhCXSMI32 Full circle moment right here with \n@scottyglf. We connected over the phone last year while he supported his wife @jharrington81 and her courageous Battle with cancer. Finally got to meet in person today and the bond was real! All the best and good luck on the tour this year 🙏🏽💪🏽 https://t.co/mVHHxtqPRj @PhilMickelson @sean_cochran @SafewayOpen Belt game 🙌🏽. Looking forward to Wednesday bro T minus 1 week until year 11 begins 👀 New year, new look, new city, new arena....and oh yeah the the kicks are 🔥🔥🔥🔥 too! #Curry7 #UnderratedSZN @UAbasketball https://t.co/FuEu7SU250 Done! Can't wait for next week! https://t.co/EVknvWQ135 @PhilMickelson @SafewayOpen You mean like these 💣💣💣? https://t.co/r8TaIUhzaT @PhilMickelson Training camp isn't for 2 weeks.....I'm in! Calf raises and 18 at the @SafewayOpen in Napa?🙏🏽 RT @PhilMickelson: Hmm, almost @Stephencurry30. It’s a very technical move, best if I show you in person. I’ll be in Napa next week if you… Hey @PhilMickelson, am I doing these right? #CalvesLikeAdonis https://t.co/Q88FUeWncM Check me out on set of my new @rakuten commercial, featuring my new @UnderArmour golf line. Get all your UA gear with Rakuten and earn Cash Back. Shop now and you’ll also be supporting @eatlearnplay and helping kids in need. #eatlearnplay Get started: https://t.co/c7N6YlI7NX https://t.co/DdTW3ejECK RT @eatlearnplay: Watch @StephenCurry30 and his friends compete in a drive, chip and putt challenge to impact lives through golf in the Bay… It's finally here! Look good, feel good, play good...MY new @underarmour golf Line is officially launched. See y'all on the links #RangeUnlimited https://t.co/mnxOpWjmii #TBT to last week when 250 Bay Area ladies brought it at #Sweatworking with @jpmorgan @Chase. We got active with @justtrain and @shapewithangela, meaningful discussion about the importance of financial health. Keep it going! #RuinTheGame https://t.co/rID4WtI9aJ Much appreciated @UnderArmour 🙏🏽🙏🏽 #townbiz https://t.co/iEWR5IqXpm Big time Accomplishment @De11eDonne! Congrats. https://t.co/oswhgX2tqZ RT @Chase: LIVE from @ChaseCenter: @shapewithangela and @justtrain gear up for some friendly competition as they coach their teams through… Can you win your own tournament? Asking for a friend. https://t.co/u1hhBGi1Q9 I'm just a nobody trying to tell everybody about somebody who can save anybody🙏🏽 @cclunie40 @DavidsonWildcat @DavidsonMBB Appreciate it Clunie! More work to do That's my dawg 😎. 320yd down the center https://t.co/G7LFw4vwpm We’re stronger together. Please join @ayeshacurry and me to help kids in America. It’s just 3 steps: Sign up for @rakuten, spend $25 on your shopping, and $25 will be donated to @eatlearnplay. To help, check out this link: https://t.co/1AEHu7YHdZ https://t.co/hE2RzBbBdq RT @eatlearnplay: Today marks the end of our summer partnership with Oakland's Town Camps, where we provided 25,517 healthy breakfasts and… RT @SC30inc: Ballers. #RuinTheGame https://t.co/5P1plU2kQi My Dog!! https://t.co/FTyxYyIj0k Had to do it! All time Prank on my guy @COSeezy. It's ok if I apologized right?? #ad @INFINITIUSA https://t.co/PqahK1If0h https://t.co/kIcUT24vNb The final episode 👀 https://t.co/2iXrIDSgTE https://t.co/DM1a7euUFe RT @CNNnewsroom: President Trump tweeted that Rep. Elijah Cummings’ district is a “rodent infested mess” where “no human being would want t… @CNNnewsroom @VictorBlackwell It's this kind of boldness that our country needs! Keep calling him out. I'm not from Baltimore- but I know countless people who are. Teammates, family, hardworking employees. All People that represent the best qualities of what it means to be American! &amp; who want to live there! Get your mini golf clap ready 👏🏽 tune into @holeymoleyabc tonight 8/7c https://t.co/TIQ8pkKIOz All the PXG's and Callaways we got bro I asked sneaker customizer @Mache275 to create a pair of Curry 6’s from the materials in the Infiniti QX50. He killed it. https://t.co/6DClbEXKhi #ad @INFINITIUSA https://t.co/XatUbicGA2 Join forces with @ayeshacurry and me to help kids in America. We just launched @eatlearnplay, and we’re partnering with @RakutenUS to raise funds. Join us now: https://t.co/1AEHu7YHdZ My two beautiful daughters, ice cream and Ham Fam, it doesn’t get any better than this. @INFINITIUSA #ad #QX60 https://t.co/vIHhH715Xw https://t.co/p0yaGeNq04 Introducing @eatlearnplay! Aiming to develop the whole child through nutrition, education, and active lifestyles. Today we started w/ 966 Oakland kids. Tomorrow the work continues. Thank you to everyone on our team &amp; all our partners that helped make this a reality! #eatlearnplay https://t.co/dlpk7oHvDT So proud of the work being done! It's all about IMPACT and this is just the beginning. Lets get it! https://t.co/CJenlqKX20 Congrats @kelleymohara and the #USWNT. World domination. Thank you for inspiring EVERYbody. Real life superheroes 🏆🇺🇸 https://t.co/t4v13v5adi My dog 😎 https://t.co/vZP1Wc068Q One for the books. UA Asia Tour 2019! https://t.co/SMt9gOVeIL it’s all fun and games on the pj\n\n@holeymoleyabc #HoleyMoley @ayeshacurry @FoodFightABC #FamilyFoodFight https://t.co/CDnsbksH9u @ComplexSports @SC30inc Not correct!!! I said \"my team\" as in my family and my friends that were with me at the game. I want everybody to check out my new series, Holey Moley, tonight on ABC 8/7 cst.  It’s mini-golf like you’ve never seen it before! @holeymoleyabc #HoleyMoley https://t.co/JNOnKBN1Ef On June 17th, 2015 a man walked into a South Carolina church and killed 9 people. Today, 4 years later, we’ll tell the story of  the victims and survivors in theaters for the first time. Visit https://t.co/BJAeJGEzrb to find a theater near you. https://t.co/G0P6wqyhiT Episode 5 of #StephenvsTheGame is here! Stream now on Facebook Watch https://t.co/zfMROKcqmh https://t.co/px1hFUDkgx All-Star Weekend in my hometown Charlotte was one I'll never forget. Episode 4 of #StephenvsTheGame is live now on Facebook Watch https://t.co/XZ6RDnNoQm https://t.co/DPOch3SW4X Family is everything. Episode 3 of #StephenvsTheGame is now available on Facebook Watch | https://t.co/ppkKZ0W2gS https://t.co/oyEL8hJyFA Episode 2 of my show #StephenvsTheGame is live now on Facebook Watch! 🔥https://t.co/ppkKZ0W2gS https://t.co/NsdhF39W3Z Grab your 🍿🍿🍿... episode 1 of #StephenvsTheGame is now available on Facebook Watch https://t.co/Lmm9tT7BdA https://t.co/DHU78lVbKi I couldn’t be more humbled to be a part of bringing this film to life. It’s been an incredible journey from first reading the script to release day finally being here. This film is truly inspirational. Grab your 🍿 Breakthrough is in theaters today!! https://t.co/lIsUSOc4Kn Greatest comeback story in sports! Congrats @TigerWoods Let me hold one of those 5 jackets one time! tune in 5/2 👀 https://t.co/zfMROKcqmh https://t.co/Ncg7jtsdmH @INFINITIUSA back at it with another 🔥 concept, the QS Inspiration. Thoughts? #QSInspiration #ad https://t.co/B6r2FajC6N New @RakutenUS spot drops today with an appearance by yours truly 👀. When you shop, they pay you 💰. #ad #Rakutenus https://t.co/iOOE3jlAJ3 @Ballislife @NBAonTNT Mad respect @russwest44 🙏🏽. Wow! God please cover and restore @NipseyHussle right now!!! 🙏🏽🙏🏽 Lock in! #DubNation The documentary #Emanuel produced by @UnanimousMedia will be in theaters for two nights only: June 17 &amp; 19. I’m honored to help tell the poignant, untold story of the victims and survivors of the Charleston church shooting. Tickets and info at https://t.co/Yq25ZpXCyK This is real life!!!! 🙏🏽 https://t.co/EO6IwA58UN Lock in! #DubNation Lock in! #DubNation ALL NEW SEASON of my YouTube series #5MinutesFromHome is live! My first guest in the backseat is none other than Charlie Hustle aka Forty Fonzarelli aka @E40. Watch now at https://t.co/CRc6QDn9Wm https://t.co/rgb6JjNXdf Lock in! #DubNation @nbastats @NBA @LAClippers @NBAHistory Hold up! Pops has that record????? Learn something new every day. That’s dope! Lock in! #DubNation straight powerful 💪 https://t.co/ErqCEiWLFA Proud to support these talented young women at the third stop of the Underrated Tour Powered by Rakuten! Catch the full version of this and more on @RakutenArena #internationalwomensday #IWD https://t.co/5JUfjC4Mws @ChrisBHaynes @LetsGoWarriors @boogiecousins Bigger than basketball! 🙏🏽 #StephonClarke Okay @sdotcurry I see you 🐰🐰🐰 Lock in! #DubNation Lock in! #DubNation Lock in! #DubNation #mood all day! https://t.co/LnKNORCtBU Lock in! #DubNation “Wham Bam Can of Ham” 😂🤷🏽‍♂️ https://t.co/GfdobXYNXO The Koi Incident RT @DavidDTSS: a decade ago me and Stephen Curry were friends at Davidson with dreams. I dreamed of writing about MVPs for ESPN. He dreamed… TCC...See you tmw fellas! https://t.co/FzGHjPUJsb Lock in! #DubNation Lock in! #DubNation Versus. Coming soon 👀 https://t.co/Tn1flmq6eI 🙏🏽 All love! Finish strong bro #icon https://t.co/9cIzij0Y3b Lock in! #DubNation Pumped to join @AlexMorgan13 as a @PGAJrLeague ambassador. You get to wear a jersey, play with your friends, and have some fun! Player Registration is open NOW, so go find a golf course near you. #gamechanger\n\nhttps://t.co/BMMW18GmbV https://t.co/dndF7jlixo @PaulRabil I gave it my best. Footwork sliders all the way up. That’s all I got! “I’m bless!” Working on Excellence #WOE Lock in! #DubNation So much Respect for this @MooreMaya. God Bless 🙏🏽 https://t.co/Bt4amUFuGl ⭐️⭐️⭐️ Lock in! #DubNation Lock in! #DubNation Lock in! #DubNation @nowthisnews @SydelCurryLee hello! Lock in! #DubNation Blessed to have spent last night screening our film Emanuel, executive produced by Unanimous Media and in theaters June 17th (the anniversary of the tragic shooting). Huge thank you to my partner @Chase for helping bring this to life. https://t.co/ttzobB34Pj RT @nytimes: We're live with @laurettaland, race-related editor for the New York Times, and @StephenCurry30, discussing “Emanuel,\" a docume… RT @latelateshow: Big #LateLateShow tonight with @StephenCurry30 @ReginaKing @RonFunches and music from @LaurenJauregui! https://t.co/FbZR2… You see what had happened was... https://t.co/i6oflFzl9I Stop 1 of the #UnderRatedTour is a wrap! Loved the energy LA brought. Let’s see if D.C. can match it @RakutenUS https://t.co/wJzNLLEYnV RT @Underratedtour: First stop complete! Thank you Los Angeles! https://t.co/bKq4TpCLJo This is what it's all about! 👏🏽👏🏽👏🏽 https://t.co/3BsC2Nxv1L @ayeshacurry @GoDaddy I see you baby 😎 @DeVonFranklin @SeeBreakthrough @TheNBPA What he said!!! ❤️❤️❤️ RT @HowardU: Join @StephenCurry30 for the debut screening of 'Emanuel' on Jan. 23rd. The documentary tells the story of #DylannRoof walking… 👏🏽👏🏽👏🏽 https://t.co/N8MLPmOH5p Lock in! #DubNation 😍 https://t.co/Pb5zqTJqUS Lock in! #DubNation Lock in! #DubNation @Suns @NBATV @DevinBook 🙏🏽 2.5 million times!!! RT @brmckillop1: I LOVE DAVIDSON BASKETBALL #TCC #CATSWIN RT @JackGibbs_12: That’s how you grind out a win! Let’s go @DavidsonMBB ! BIG TIME W! #TCC RT @AJ_McCord: Not sure if @sdotcurry is wishing @realdellcurry luck on the broadcast, or if Dell is wishing Seth luck on his game...either… Much love Jet 🙏🏽 https://t.co/XwgUn3emJ7 Much respect my man! This right here was dreams back in the day! #millertime https://t.co/9XQVN8vgLF Lock in! #DubNation My home since ‘09. Got my heart too. “❤️ of the town!” https://t.co/LUkkS3qbCY @BleacherReport No. Nope. Na. Hell no! Man this OKC Spurs game...basketball is very good! s/o to @INFINITIUSA for letting me check out the QX inspiration ahead of its debut at the 2019 North American International Auto Show #ad #QXInspiration #NAIAS https://t.co/7x26cGYYki @COSeezy Yessir. Headband @sdotcurry has arrived Like a boss... https://t.co/egw55Fboj5 @ThomasDavisSDTM Thank you for representing the city the way you did bro! Nothing but respect for you and your family! Know you have a lot left in the tank so don’t stop. #KEEPPOUNDING #UnderRatedTour coming soon https://t.co/FtJ01aJHhs The Underrated Tour powered by @RakutenUS coming soon. Check out my Underrated story below @ThompsonScribe Mama don’t get no money tonight 🙏🏽 RT @UAbasketball: .@stephencurry30 surprised 250+ Oakland area high school teams with pairs of the “Fox Theater” #Curry6 and then invited a… The Moon Landing shoes are officially live for auction! All proceeds are going to STEM education initiatives in the Bay Area through @DonorsChoose Check them out at https://t.co/GIuzmdZs8Q https://t.co/lpU9BsQ0a1 The Town showed out last night! Appreciate the love and lets keep the celebration rolling #RuinTheGame https://t.co/RjavPNRV3l Curry 6 “Fox Theater” is live 👀👀👀 Lock in! #DubNation Wow. Y’all wild for this one! How about telling people when to come by instead of the click bait! Tickets available This Thursday between 12pm-7pm. Limited, but Tickets are free.  Don’t have to buy anything! I will be at the Fox Theater Friday. https://t.co/2gzsMXwqPR Much love to the next generation on the field! #RuinTheGame https://t.co/DBR2ei65aG Lock in! #DubNation S/o to @BritaUSA for enabling me to be a part of the Filter for the Future program! Now 100 Brita Hydration Stations are on their way to schools across the country, saving the equivalent of 3.6 million single use bottles of water from being used in a year. Pretty good end to 2018 https://t.co/R8Iq91hH5W Lock in! #DubNation Lock in! #DubNation 👀 https://t.co/FWMYRDI5zp SC30 x Oakland 472 9th St. https://t.co/YqJqUIedq5 Lock in! #DubNation Thanks for all the great questions. Will be back to do another Q&amp;A soon #Curry6 #AskSteph Q: #asksteph what will make the curry 6 different from all the other shoes you have made ?\n- @evelintrejoo\n\nA: https://t.co/VpZxWBhu1d Q: What’s an achievement that you’ve yet to accomplish on or off the court that you want to pursue next? #AskSteph\n- @thisisjeremyzap\n\nA: https://t.co/zbbZWCJgAo Q: What was the thought process while designing the Curry 6? #AskSteph\n- @IMG_98\n\nA: https://t.co/WJYmRejAwa Q: Do you still play poker on the plane and if so did @KlayThompson miss his flush draw....again...... #AskSteph @StephenCurry30 ???\n- @andrewbogut\n\nA: https://t.co/SieZ7atsRN Celebrating my 10 years playing in “The Town” https://t.co/t1cNCntlfe 2 surgeries and some doubt about if I would be the same player again. But pushed through with faith and patience. https://t.co/8Ydov70vC8 What’s up guys, I'm doing a Q&amp;A in 30 minutes to talk Curry 6.  Hit me with your questions using #AskSteph https://t.co/HQ2lZ7VNpn 😎 https://t.co/9RrIzk1Kp4 I love the excitement Pops! But just asked coach Kerr is he remembered this game....he did! Y’all tied the series 1-1 this game- but ended up losing in 5. That’s a crazy reaction. And if it’s 2018, let me hold $25k fine for the kick 😂🤷🏽‍♂️ https://t.co/K2MyCDabwW So dope Loon! Congrats bro https://t.co/XO3OIIdNKq Learn something new every day..#nailedit RT @JonasJerebko: Another W in Cleveland tn. Now ✈️ to Milwaukee for last game on this roadtrip. #dubnation #NBAse🇸🇪 @ Cleveland, Ohio http… #BreakthroughMovie trailer is here!  Don’t forget your tissues when you @SeeBreakthrough this Easter. https://t.co/yfIjS49zon Conversational commerce is the future. For @SnapTravel, it’s already here. Hyped to invest in a company disrupting the travel industry. #RuinTheGame \nhttps://t.co/1Ayfm2vAod Lock in! #DubNation Lock in! #DubNation Appreciate you helping us get better Riley! We got you. #MoreToCome https://t.co/UBoTklvwhg One last run in Oakland #LockIn 🔒 also peep the kicks 👀 https://t.co/LlLeBDtte8 Don’t need any reminders but All the Time God is Great and God is Great all the time! Appreciate all the texts. Somebody had to learn the hard way - don't break any international laws on my watch! \n\nhttps://t.co/cP8vgQcdco RT @UAnews: This colorway of the #Curry5 is now available on https://t.co/JfPrGPSn3v and is inspired by the passion and hard work of someon… I’m bringing the wallet as long as you’re giving up strokes. Invite @PhilMickelson too! https://t.co/q7BQiOp8Jx ✊🏽 https://t.co/P3eOKj2ve6 Great question! Can’t be that big a difference…Besides killing my tunnel shot at home games! https://t.co/fsII9SuTO6 RT @warriors: Quinn was cookin' tonight 💪 https://t.co/KlerCluTXj Lock in! #DubNation Had a blast clowning with @BritaUSA &amp; @Anwar and meeting his “family”... that looks an awful lot like him 🤔 🤔🤔 Watch the rest here 👇https://t.co/P4VIc1dmOM s/o to @FullSwingGolf for helping me get the swing right 🏌️‍♂️ #fullswing #fullswinggolf #fullswinggolfsimulator https://t.co/0Ajuc8lcHc Lock in! #DubNation RT @PodSaveAmerica: Voting is easy. You barely have to threaten anyone.\n\nMake sure you vote: https://t.co/nVq2paZVin #votesaveamerica #pods… Take the time to get to know measure AA and support it tmw at the polls for Oakland! https://t.co/DxiTTMuKj9 Lock in! #DubNation .@Palm is out today. Let's get it baby!!  🙌🏽 🙌🏽 🙌🏽 https://t.co/XDT84EOrSr Humbled to be part of the process to tell this amazing story https://t.co/zFAWSpzCgB This is so dope Man! Can’t imagine the down days, weeks, months and years he went through. 50 ball!! So much respect bro 🙏🏽🙏🏽 https://t.co/s42i7Zp63I Lock in! #DubNation The moment I knew basketball was going to be forever. https://t.co/hY5zgknogl Lock in! #DubNation From 30k feet in the air I’m screaming congrats to my @RedSox baby!!!!!!!! World Series Champs! Turn up one time for the one time 🎉🏆 Lock in! #DubNation Lock in! #DubNation RT @GoDaddy: A bold and authentic #mompreneur is just the kind of mover and shaker we love to support. We’re thrilled to announce our partn… Lock in! #DubNation Lock in! #DubNation Not starting any conspiracy theories over here but that was an interesting overturn. Get out of there with that W anyway though 🙏🏽 #KeepPounding #weak That’s a pic baby. Definitely a pic. Hand was under it the whole time man! Come on @Panthers Lock in! #DubNation First project EP in theaters April 2019 👀 @DeVonFranklin \nhttps://t.co/IxtK6r4F1W @J_LoPriore Factual RT @warriors: “Each one of us affects change, but it starts with us, right?” 💪 Shaun is ready to #RockTheVote, are you? https://t.co/2tSTC0… Lock in! #DubNation #10 Hyped to bring @Palm back and share everything we’ve been working on since day 1! #LetsGo #LiveInTheMoment https://t.co/SvVQZxJifT @ESPNCaddie Hahaha A for effort Louder!!!!!! https://t.co/4skTOz1T4O Prayers up for @DejounteMurray! Long career ahead of you- stay positive, stay strong and focused on your rehab. Love @corwinatorx And you know it Happy Bday Rex! From Strawberry Hill to now…happy to see you living life your way. https://t.co/YOHTmvbM0h Lock in! #DubNation Let’s get it big Fella! https://t.co/AaLpCQPtqc Check out Episode 2 of my #WiredDifferent series where I sit down with director Justin Tipping https://t.co/J8H6uM1Vgd https://t.co/89V0bq6Sc4 And still!…congrats to my guy @anthonyfjoshua on the W tonight. #sqUAd @UnderArmour .@TigerWoods I want whatever you had for breakfast this morning! This is insane Please join myself, @CP3 and @JohnWall  supporting our home state of North Carolina and the surrounding area in #HurricaneFlorence recovery efforts! A lot of work to do and any amount helps those in the area get back on their feet quickly. \nhttps://t.co/RRdmxWFiJu But wait…that’s my whole workout routine for real https://t.co/V7kK0gav7a Ok ok ok! That’s what I’m talking about right there. Didn’t know if anyone could step up and take on “I love Commons” but there it is 😂😂😂. https://t.co/qXzTE5N3hA Wembley x @UnderArmour 👀 https://t.co/SZM2ywcGQh RT @NBA: An all-access look as the @SeattleStorm are crowned the 2018 @WNBA Champions after defeating the Mystics 98-82. \n\n#WNBAFinals MVP… Praying for my home state NC and all the surrounding areas. Stay safe and take every precaution you can! Merci beaucoup pour votre accueil Paris! https://t.co/SysJF7fQPw Wuhan it’s been real. Appreciate the hospitality #SC30AsiaTour https://t.co/GlWLqSktNG Salamat sa Manila! #SC30AsiaTour https://t.co/ueYwbvKcXC A little late but congrats to all the 2018 @Hoophall inductees. Took the game to another place &amp; we are all better for it. @SteveNash , Ray Allen, @realgranthill33 @RealJasonKidd, @RickWelts - looked up to you, played against you, worked with you…enjoy your moment and thank you! Got my eyes locked on @TSM today as they compete to get to the #NALCS Finals at @OracleArena next weekend. Nothing like that Finals atmosphere at Oracle! 🙌🏽 #TSMWIN Congrats on an amazing career @manuginobili. You embody how basketball is meant to be played. With Passion, joy, and obviously a Champion through and through. Inspiration many sir. https://t.co/Z86WgYFVMk This is personal. https://t.co/PbJlSk95R3 Ready to hear the Word tonight! #myRedemption https://t.co/yUevLLyuWQ New Overtime ep!⏱ Watch a bonus video from our #5MinutesFromHome shoot where I talk family with some of my favorites guests – @NipseyHussle, @LibbySchaaf, and the high school kids: https://t.co/iC1usC3H9a RT @PlayersTribune: With the @WNBA playoffs tipping off tonight, @alliequigley breaks down which 7 players could “pull a @StephenCurry30” —… Y’all are the best! But I’m bout to block you https://t.co/GuK5rwST9v Legit! https://t.co/iRYaz1qLi6 https://t.co/HtMdQwtQCH It’s preseason but me likey me likey! #KeepPounding https://t.co/TjE6PnaFcR Headed to Overtime!⏱ Watch a bonus video from our #5MinutesFromHome shoot where I talk about creativity with @Jessewelle, @NipseyHussle and @rudymancuso: https://t.co/WBIlo26KXA https://t.co/mCLZNwWCCf Love it! #basketballisbasketball https://t.co/3Fzhx2esSu @markbaldwin1 Amazing. Just leave a little note on how the greens break for me @redapples @Ballislife Love it #basketballisbasketball I'm happy to be able to livestream the All Star Game from the SC30 Select Camp, coached by myself and @sdotcurry, in honor of Nia Wilson.  All donations will benefit Nia's family via the National Basketball Player's Association Foundation.\n\nhttps://t.co/z9c4sgWycW RT @24Bazemore: Man, anyone that has been following me over the past seven years knows that this picture is super Iconic! Looking back and… Come thru 👀 https://t.co/BuHeQnF75A Keep doing you @KingJames! 💪🏽 https://t.co/LOFVdQgyYr In my 30’s still holding on 🤦🏽‍♂️ https://t.co/uRF9h0odkq …..B. Davis, Gill, Rice, Newman, Chapman Easy. Curry, Bogues, Johnson, Mourning, Walker! https://t.co/7azf4wrqIU Lmao!!! https://t.co/YNuEbuWamW Brand new episode of my #5MinutesFromHome series is now up ft. the director and YouTube legend @Jessewelle . Watch now at https://t.co/NCv1YyjCye and tell me – who should be my next guest? https://t.co/YtD1dUYeUL RT @MichelleObama: In my family, voting was a sacred responsibility, one which we never took for granted. I’m excited to be a part of @When… Freaking amazing! 👏🏽👏🏽 https://t.co/s82hufUHZA RT @JaValeMcGee: HAD TO DO THE #INMYFEELINGSCHALLENGE IN THE MOTHER LAND!\n@juglifewater @drake\nInspired by: Will Smith https://t.co/lBWiIh7… RT @rap_WAVE: NEW MUSIC: @DevonteeWOE - Real Rudebwoy (Feat. @KardinalO) https://t.co/FU2dWSUqly #rapWAVE https://t.co/MT8zEt7LvK RT @common: #SayHerName: Nia Wilson. May GOD Bless her Soul. Sending love and light to her family and friends today. https://t.co/IIlRa62DWs @TSM_Myth Yessir. Let’s get it! @WillLoweryGolf @whitelobstah24 Probably laughing at how I hit a 35’ putt about 75’ On 11! Not enough “hehhh” Hyped to be part of what @TSMReginald is building with @TSM. #letsgetit \n\nhttps://t.co/H31fPha2uX Oakland stand up! New episode of #5MinutesFromHome is up featuring Oakland Mayor @LibbySchaaf. I ask her all the tough questions, like E-40 vs. Too $hort. Check it out on my YouTube channel. https://t.co/j1q06KUD9P https://t.co/Y3PGWv678A Excited to take to the court as your\ncoach and teacher in my first-ever\n@MasterClass. Sign up at\nhttps://t.co/oFy9w7Y2dI https://t.co/pJ9Q3HyeHt The fact that I’m sitting here debating on whether to go to sleep or watch wall to wall coverage of @TheOpen is incredible. Fresh new episode of my #5MinutesFromHome series is now live on YouTube! @KDTrey5 dropped in to help me surprise three high school basketball players from Oakland. Check it out. https://t.co/K98A7e6sjJ https://t.co/JPoWKWTytX New episode of #5MinutesFromHome with Crenshaw’s Finest @NipseyHussle is live on my YouTube channel. Tag someone who can use motivation for their grind. https://t.co/4y2ztmw3Bv https://t.co/7AQFQD3H2p RT @kevineastman: Great goal as you are at work today.  Bring some energy and  positivity to each room you walk into. Will make that room a… RT @DeionSanders: I double dare u to be extremely Positive for the rest of the day. NO NEGATIVITY AT ALL. No negative thinking,speaking or… #5MinutesFromHome is taking the 🇺🇸 holiday off, but we’ll be back next Tuesday with a new episode and a new guest. Who do you think it is ? 👀 https://t.co/LZuSHV68qm Bada Bing Bada Booom. Bada Bing Bada Boom!!! This about to be a big time comeback right here too! Don’t sleep! https://t.co/R8tFwTsLe1 The 3rd splash Brother 😂😂😂😂😂😂😂. Let’s go @boogiecousins First episode of my #5MinutesFromHome series is now live on YouTube. @RudyMancuso and I record a fire track in the back of a sprinter van! Watch now at  https://t.co/kNdqtfjV1k RT @NickSwagyPYoung: Why y’all so mad enjoy life RT @sydelcurry: Tonight. 8/7C familyfeudabc @abcnetwork!! So excited for y’all to see it. So much funnnn! •\n•\n•\nSeth was injured the weeken… @LeVelleMoton Woah I see you coach! It’s Officially golf season you know I’m ready whenever It’s going down tonight on @FamilyFeudABC with my family. Thanks @IAmSteveHarvey for having us. Comes on 8/7C! https://t.co/SJodiLhPsO @crgilbert @ayeshacurry @EatAtSmoke Wow! Who am I? 2 orders of that Hey @ayeshacurry. Guess I’ll have @EatAtSmoke in Houston 2 Myself twice next year 🤷🏽‍♂️. More Ribs and Shellfish and Burratta and Duck Wings And Instant Bacon And Salmon And Brussels Sprouts and fried Rice and Mac&amp;Cheese and Cornbread and (did I say Ribs) for me! #5StarReview 6 days to go! #5MinutesFromHome dropping June 26. https://t.co/K9c4XJZ0L9 @L_Smith_23 Louder than the silence - quieter than the noise bro! I don’t understand this nonsense. Sending supplies to immigrant children who need them! RT @DevonteeWOE: my first single #BLESS out everywhere now! LINK… https://t.co/FFykfp4a40 I can’t imagine what Coach Popovich is going through, but I am lifting up prayers you and your family. 🙏🏽 https://t.co/PMezvqWlcL That time again! . #dubnation https://t.co/j5AgmELk5c 🚨 Restock alert 🚨 https://t.co/jk45wzhKFU RT @stockx: Today is your last chance to enter! Don't miss out on your chance at game-worn, signed sneakers from @StephenCurry30  for just… I’m partnering with @StockX to give you all a shot at owning the 1-of-1 @MBK_Alliance Curry 4’s I wore against the Wizards this year. Check out https://t.co/3x1Fq3ENbF to learn more. RT @SportsCenter: From 10 years in the G League to 19 points and MVP chants as a Laker https://t.co/j1e8gv6B3H 😎 #DubNation Please send up prayers thoughts love to my guy @PMcCaw0! God please heal his body and keep him strong! Psalm 27:13-14 I remain confident of this: I will see the goodness of the LORD in the land of the living. Wait for the LORD; be strong and take heart and wait for the LORD. Lock in! #DubNation Running drills and having fun tonight with @Chase customers during the 🏀 clinic @ULTFieldhouse! Thanks to my partners @Chase for making it all happen! https://t.co/zekGtl5EFL @babyboypoverty 😎 @DavidDTSS I was in the mood too! https://t.co/Hmz70bH4Zz @KAzubuike7 Boooooo that Tough one down the stretch but that fight is what makes @DavidsonMBB special. Congrats to Coach McKillop on his 29th year leading the Wildcats and congrats the boys on a helluva year. @atlantic10 Champs!! #TCC @Money23Green #ruiningthegame The world is an incredible place. We blew past $30K so why not triple it? Can we hit $90K?! 👉🏼 https://t.co/BdZXvomtnT👈🏼 https://t.co/lc31pGUmBv It’s a big birthday so let’s make a big impact. Can we hit $30K for @nothingbutnets?! 👉🏼https://t.co/BdZXvomtnT👈🏼 https://t.co/zeTNKCrieI #DubNation You get uglier every year 😂😂😆. Happy birthday! Yannnnn! https://t.co/eallYrmfMa It’s a Great Day to Be a Wildcat! https://t.co/4boShlYNp3 Lock in! #DubNation Lock in! #DubNation @andrewbogut Can we start the #BogutBookClub?? What book is that? He’s working on getting his Win % up to NBA average FG%. Congrats bro! https://t.co/a8eWNXCkcj Lock in! #DubNation RT @VanJones68: TONIGHT!!! 7pm ET &amp; 4pm PT west coast on @cnn. @NBA champion @StephenCurry30 on the #VanJonesShow ... SET YOUR DVR NOW! ...… Lock in! #DubNation 1/2 of @ayeshacurry is so mad right now that we just beat Canada on the ICE! 😂😂😂😂😂😂😂😂😂😂😂😂😂😂 RT @JForsett: Let’s Go!!! #USA https://t.co/v0yZ5nuKxa USA!! USA!!! 🇺🇸 🏒 Get that gooseneck wrist pointed down and you got it! Need you to return the favor on the lacrosse field sometime https://t.co/gTX1IovreG RT @MuscleMilk: Enter our #YearOfYou Sweepstakes for a chance to win the gear you need to make your 2018 goals a reality. \nhttps://t.co/2AZ… Hey @MalcolmJenkins, they should have given you some glasses with that 🎤. I rep the @RedhawksAD. But appreciate the S/O and congrats on the ring bro! Philly looks crazy today! Tell @TorreySmithWR I said what up too Lock in! #DubNation RT @MichaelRapaport: New episode of PLC ep-8 with @JaValeMcGee @StephenCurry30 @imanitrishawn_ and some dope cameos! GO WATCH! https://t.co… Stay strong @boogiecousins and Andre Roberson! Prayers your way for a strong recovery 🙏🏽 Yeah I’d have to say that was legit! #nextyear https://t.co/fj4flo8lgq Today is something else. @TigerWoods is back on the course, @NBAAllStar draft with #30K @KingJames, and it’s a game day tonight at Oracle too! check please https://t.co/ZdMjRklkja Captain huh? Really Appreciate all the votes from the fans, media and players! Honored to be an All-Star. TGBTG! https://t.co/rOpLsUx47T @gavmanj Uhhh. 0.1 seconds on the clock. Pretty smart way to end the Quarter if you ask me. But what do I know? I’d tell the kids to do the same thing. Introducing a new segment called “Never Seen it!” https://t.co/OLhRk6C59q Solid year fellas! Loved the fight. #KeepPounding forever First time I’m like yo! He didn’t catch that interception. No give it back! I can’t believe this Season pretty much down to this possession. Need 7 right now If we got any chance today- Brees is scary Cam is locked in right now. Need the hands to wake up though. Lets go @Panthers #KeepPounding https://t.co/lwHQlnvJ9H Filtering out water bottles and showing my man @rudymancuso the right way to start the New Year. Thanks to @BritaUSA. #ad \nCheck out the full video here: https://t.co/pQHnKWQKQn https://t.co/g3GZ4eCOpP RT @warriors: Retweets = Votes\n\n🌟 Stephen Curry #NBAVote 🌟 https://t.co/1JzDHIDhsI RT @warriors: Retweets = Votes\n\n🌟 Draymond Green #NBAVote 🌟 https://t.co/saRBN0OxLY RT @warriors: Retweets = Votes 👐🏽\n\nKevin Durant ⭐️ #NBAVote https://t.co/ihUAwWJ01J RT @warriors: Retweets = Votes 👌🏽\n\nKlay Thompson ⭐️ #NBAVote https://t.co/dSRZQQ05j7 Lock in! #DubNation Lock in! #DubNation The NEW @UnderArmour #Curry4 Low benefits @nothingbutnets. Each pair sold sends a life-saving bed net. Don't miss it. https://t.co/zYqpzIiBvL Lock in! #DubNation The comeback is always stronger than the setback.  S/o @DegreeMen #AD https://t.co/TzL16Tf7LR #WeAreTheOnes...Learn how to help young people fulfill their potential, regardless of circumstance at https://t.co/YptEspcjoW #TheKeepersCode https://t.co/mM0Xg9nNbE Yeaahhhhhhhhhh Boy! Found a way today baby. We are going to be dangerous in the post season. And I’m all here for it! #KeepPounding RT @warriors: Good to have you back on the court @money23green 💪🏽 #DubNation https://t.co/D9vxjq2nLE Somebody is having a great game! https://t.co/0RiWEzgwyQ End this......! I️ concur https://t.co/RynrCCoTWK Thanks @uograd66 https://t.co/ITBS8UHWuA Wish I could be there tonight. Congrats @kobebryant. #Ko8e24 https://t.co/a98uiRpP8k RT @MySportsUpdate: Clay Matthews: It's that wheel route, it's that wheel route \n\nCam Newton: You been watching film, huh?\n\nMatthews: Yeah… I️ want in! https://t.co/XvvC1vo7xI Get buckets!!! 👌🏽 https://t.co/ho9uThnA6h 💪🏽💪🏽💪🏽 https://t.co/KQ6Nspjfv3 Keep up the good work! 👏🏽👏🏽👏🏽 https://t.co/f78uS7xsq6 🎄🏀 https://t.co/5e5o3c7SZR Well said bro! Finding the purpose and plan in everything. All things work together...ROM 8:28 #respect https://t.co/dhCJVxzCEH Trucking around the Bay looking for gyms to drop into. Got some goodies for #DubNation and looking to hear from you! #SCAmbush https://t.co/kmk6hfIvMM These boys playing some basketball!!! Big Mo going to the 4th 👀 @KDTrey5 Traveling back to the Bay haven’t been able to see the show yet but heard @ayeshacurry killed the #AmericanBakingShow premiere tonight! Make sure you check her and @spiceadams out @GABakingShow on @ABCNetwork This year I’m participating in the #HourOfCode challenge! Tweet your @codeorg creation and a class photo. Tag me &amp; I’m going to video chat w/the winning class! Visit https://t.co/p3igUqPCxB for details. The wait is over. The wait is over. @TigerWoods RT @sdotcurry: I appreciate all your support as you all motivate me to get back ASAP. I do want to do my part on (cont) https://t.co/thRCvK… Appreciate the #DubNation love from Florida. I’ve got something in store for you when you come to the game, can’t wait! https://t.co/UzrLFcgrL3 @JaValeMcGee34 Soon.....! https://t.co/cyfWQcXViu No days off with @DegreeMen Deordorant. The more you move, the more it works. #ad https://t.co/RqZtaxQgDT Appreciate the love tonight! @jimmyfallon vibez. Tune in! https://t.co/9WFZMp8e2h #DubNation in NYC 🤓 https://t.co/lmMkErBdhW RT @cloud_surferrr: When you were born and raised in the South and somebody says “oh you don’t have to say yes ma’am/no ma’am to me” https:… As we celebrate Veterans today, let us be louder than all of this silence — and quieter than all of this noise.\n\nhttps://t.co/xUMtcf8Tbm #SC30 x @Xbox collab alert! 🚨🚨 https://t.co/NXHWioFwwS Let’s gooooooo https://t.co/ZnKAV6Aym2 So much love!!!! https://t.co/0zQqgoq5AS Cam out there dunking on people now? I’ll have to ask him what that feeling is like later #iplaybelowtherim RT @ayeshacurry: Well! Here we go! international goes to Houston! coming 2018 https://t.co/AAUg0a4bZX Lock in! #DubNation I wonder if Steve’s Bike shop is hiring... Please help me understand this madness.... https://t.co/lds3DE9ujf @juliephayer “Game Over” RT @MarcJSpearsESPN: The story of how and why Warriors star @KlayThompson used his scoring to aid the Bay Area's firestorm victims. https:/… Lock in! #DubNation Hello, I want to play a game. #Jigsaw #DubNation https://t.co/cvl6F3cIQc Lock in! #DubNation Shoutout to my man #kortneumann on killing the design of the #Curry4. It was great collaborating with you my man. Respect. https://t.co/IEtdn0Lelv Lock in! #DubNation No excuse for that! Gotta remember who I am playing for... @Richie_Lombardi @UAbasketball Yeah I might have to cut copy and paste those into my closet! 🔥 Lock in! #DubNation @JOHNNYSWIM #INeedMeSomeHome https://t.co/fZxK61YWtG At least the first part of the night we were smiling! 💍💍. On to the next! https://t.co/MXvepDxI29 🙏🏽🙏🏽 For @gordonhayward. Come back stronger! Lock in! #DubNation 💍 Getting off to a FRESH start this season with @DegreeMen Deodorant #AD. https://t.co/8fduOcdEwo Finally got to see the @Chase #GoldenVictoryBall in action today during the court refurb at Bushrod Park! Check it out on Opening Night! https://t.co/1roC1UueGN There’s more to me than my numbers. It's why I choose @INFINITIUSA. Life's an experience not a stat sheet. #BeyondTheNumbers #ad https://t.co/6DDWrbKpr3 My partners @Chase are sending the #GoldenVictoryBall your way tomorrow!! Stop by and take a pic. https://t.co/dbw1HFKxyj I could get used to this! (📸 @cassyathena) https://t.co/z6O5Wos33v RT @Essence: .@ayeshacurry's debut cookware line has arrived. Here's what we're buying from it: https://t.co/7jxh8SPycG https://t.co/ELr2cN… Lock in! #DubNation 9️⃣ RT @30for30: He sacrificed his life to save others.\n\nOur latest ESPN Film, #24Strong - the story of Zaevion Dobson, airs Thurs. at 7:30 ET… RT @DavidDTSS: .@StephenCurry30 still repping. Go Season Some Food. Get familiar. https://t.co/Asq7xMH6BA https://t.co/g5pOjBirMx @Lanny_Smith We should Keep a running scoreboard! Ones with Steven count as double @DJRadar24 @ayeshacurry Louder RT @lecrae: My new album 'All Things Work Together' is out now everywhere 🙏🏾 #ATWT https://t.co/gnWRS6pPFU https://t.co/pss5pKmwtV Salute to @andreward on checking off everything he ever wanted to do in the ring. #missionaccomplished https://t.co/9W674kzRlu @aef83 @UnderArmour That’s about the same face I make  when I open my own pair! That sunshine expensive #blessings RT @DavidDTSS: AND. WE. ARE. LIVE. \n\nhttps://t.co/aqzqrFUOgP RT @MrAnthonyMorrow: Our Defense is looking Top 1 or 2 in the league again the past two weeks @Panthers ✊🏾✊🏾🙌🏾🙌🏾 I'm nice with the right foot though...thanks to @chelseafc for having me at Stamford Bridge today. ⚽️ https://t.co/BtIZTmt5Xz The UA Family welcomes another champ 🏆 to the sqUAd. Congrats @SloaneStephens. It was a victory #UnlikeAny. #TeamUA https://t.co/UR1B14tGD4 This was fun! Me vs. My Daughter on the track. @infinitiusa Q50 for the win. \n#RoadOfHerDreams #ad https://t.co/xBp7QFGwru RT @SoleCollector: See what @StephenCurry30 fans are creating on the UA Icon platform: https://t.co/s3gxl6e6KQ https://t.co/EDpw3gLYs3 New vibez w/ @lawrencetheband thank me later! https://t.co/YmfJ2Upqq0 https://t.co/YmfJ2Upqq0 RT @CNN: Here are a few ways you can help the people affected by Hurricane Harvey https://t.co/8A08k10kvN https://t.co/26cfSvjwdP Prayers up for Houston! Many fam and friends living there. Don’t really know what to say in times like these but hope we can help somehow! Thanks to @PSG_inside for having me out to see the win! What a wild, crazy environment to be part of. #oracleofsoccer https://t.co/4IHEUOXp1c @LetsGoWarriors DM me the group code! Let’s Go! Work! https://t.co/0nNKU4qrqj Hyped The Players Technology Summit is finally here - thanks to @Bloomberg and everyone that made it happen. https://t.co/sZJKaUAYKN 👏🏽👏🏽💪🏽✌🏽 .@Dennis1SmithJr welcome to the sqUAd, bro. Let's get it!! #TeamUA https://t.co/ofc8YFw5Eb RT @JordanMcCabe5: Special thanks to @stephencurry30 and @UAassociation for the great event this week, best experience so far. #SCSelect #B… @MaallyMall @UnderArmour These are 🔥 #BayArea come 👀 the Top H.S. players in the 🌏at Kezar Pavilion tmrw at 6PM. The Showcase airs live @9PM EST #ESPNU. #SC30Select https://t.co/kpH1pBh4i9 @andre 75 BPM is da gawd! @wheatiePGA @notthefakeSVP Hell hath frozen over 😂 @24Bazemore We’ve all been doubted before ya heard me! #499 @webbsimpson1 Thanks my man! You guys have an extremely tough day job. RT @ayeshacurry: Word of the day! A person should never be subjected to being just one thing! #noceilings live your dreams! Believe in YOUR… I remember 2011 in Winston playing with you! We both got wayyyy better https://t.co/ir0NVS7f4j Nothing quite like the sound of the ball on the asphalt, or the engine revving on the road ahead.  S/O to #INFINITI and the new #Q50 #ad https://t.co/4wtJ8RlPqv When you've got the range, you gotta have the right kicks. #SC30AsiaTour @uabasketball https://t.co/qQ1olgWeDq Chengdu sqUAd. #SC30AsiaTour https://t.co/xr4M7aa4Gb Made my \"acting\" debut on @BallersHBO Season 3.  Check me out Sunday, July 23 at 10pm ET on @HBO. https://t.co/h88SQo8Jxz It's my first time in Chengdu and it's already an unforgettable experience. #SC30AsiaTour https://t.co/R7ID8H7Mq2 Just putt it and turn around and walk to the next hole next time sheesh Jordan! Issa Eagle!!!!! Issa 🦅 “Are you not entertained???” @JordanSpieth No days off in Beijing. #SC30AsiaTour https://t.co/sGLSrYCYAL Getting shots up, even at my #INFINITI #Q50 commercial shoot! More to come. https://t.co/wtNl1ys5Hw 🏌🏽in Tahoe! @jtimberlake @tonyromo 📷:: Jeff Bayer https://t.co/RNgvKMrrus RT @NBASummerLeague: Wait for it... @1jordanbell!!! #NBASummer https://t.co/mBmfsepJlL That time of year for @SDotcurry! https://t.co/x93DLgbybk https://t.co/dA1nYVqqNl @CamGo_Ham @Cal_Baseball 👀 can do something about that! Nothing easyyyyyyyyyy!!!! Talk about him! Shakespeare says there’s sermons in stones @KDTrey5. @bryantabarr @ACChampionship Yes We will have a performance review after Tahoe! Lights will be really bright gotta see how we respond obviously want to play well &amp; see how I handle tournament golf. No expectations except keep ball out of the gallery and not go Happy Gilmore Supporting great cause &amp; want all of the Bay Area comes out 2 watch these guys go low all week! @GSWfoundation does Great work for the Bay! People asking why I’m playing. Unexpected invite &amp; Always a dream 2 play golf w/ the pros. @WebDotComTour has so much talent it’s unreal. Honored to play in the @elliemaeclassic to support the \n@gswfoundation! 1st experience inside the ropes! Come on out\n@webdotcomtour\n@pgatour Shout out to @Money23Green for that DPOY award! Well deserved bro! https://t.co/UUUGwu61dX Game! Blouses! @JordanSpieth with the hole-out from the bunker to win it! Congrats bro Welcome to the @UABasketball family Josh! Excited to have you on the squad. You don't need it but, good luck tomorrow!  #IWILL #TeamUA https://t.co/E1JCwGiloJ \"We gon be Shampionship!\" https://t.co/nHQgI4rfyP Week old but man, still everything! #dubnation https://t.co/Gq926MMitx .@andre + I just announced the launch of the first The Players Technology Summit, presented by Bloomberg. https://t.co/wYzLh2ZEMS https://t.co/yeHvoW9JRc Lost art! Don’t rush the development https://t.co/HIKWc6kArb RT @bryantabarr: Mood. #WardKovalev2 #TeamSOG https://t.co/5c1HYk3l4P And we Back! https://t.co/HQjjumvJb2 #DubNation  https://t.co/tY0eZODep5 RT @andre: Shot out to P McCaw... man that ninja nice!!!! Glory to God! https://t.co/5nlTXUObqp Lock in! #DubNation Lock in! #DubNation Lock in! #DubNation RT @scott_fowler: If you're @DavidsonWildcat fan, congrats -- you're having a heckuva moment/week/month! @dcbaseball_ @StephenCurry30 https… Lock in! #DubNation Celebrating the Champ, congrats @anthonyfjoshua! #IWILL https://t.co/KtL1K6ASr5 Lock in! #DubNation Lock in! #DubNation Lock in! #DubNation Lock in! #DubNation #Thankful https://t.co/TO79WNP6Be #DubNation, y’all know what time it is. 🔐 in. \n\nStare Down Destiny. #IWILL https://t.co/jDfR0CBcmF This #WorldMalariaDay, I need you on my team to #defeatmalaria with @nothingbutnets. Join me at https://t.co/7GVZHbFMDr https://t.co/W489frPFIo I say good, good! Let’s keep this match going. #Masters Gotta Love @TheMasters! “Vamos” RT @JBLaudio: Hop over to https://t.co/kw9C4pTvBq to enter you and your crew for a chance to party with @ddlovato, @DNCE, and more at #JBLF… Make the internet happier. Join me &amp; @BritaUSA at https://t.co/A80TbiXIBH to help scrub your bad tweets &amp; spread some good like this GIF #Ad https://t.co/ZPod3dtmGd Lock in! #DubNation Thanks for playing my playlist on the ride! https://t.co/ssw8GIYoY1 RT @UAGolf: Step onto golf's biggest stage.\n⠀\nWhen April rolls around @JordanSpieth counts on the #SpiethOne. Shop now: https://t.co/4QQ5Av… Lock in! #DubNation Caption this... https://t.co/9vz8IkM9CH Coming soon: I'm bringing my shot to @serenawilliams in an epic ping-pong match by @Chase. Tap to join my team. #ad https://t.co/0NFrqbkgnd Lock in! #DubNation Lock in! #DubNation RT @bryantabarr: When you get that post game text from your best friend...😂😂😂 https://t.co/fyZN7KnlDh .@serenawilliams Bring that backhand in April. @Chase has the table. I’ll see you there. #TeamStephen #ad https://t.co/QN55tc8Iek Lock in! #DubNation Lock in! #DubNation Lock in! #DubNation Lock in! #DubNation #PiDay s/o @DegreeMen on the 360 video camera work https://t.co/vlOnoh1Sdd #ad https://t.co/y8ujGZnQ6t Got my new favorite track on repeat starring my man @KingBach with the assist from @BritaUSA. #StreamTeam #Ad https://t.co/HduNxr4B0i https://t.co/shjEb4ojpR RT @jacohen15: Guess what, it's still a great freakin day to be a Wildcat! Very proud of the seniors for their success and integrity That’s dope!!! https://t.co/w2i15Im0Wh Lock in! #DubNation It's a great day to be a wildcat! #JackGibbs Hats off to @swish41 on 30K tonight. Glad to know I contributed to a few of those buckets 😂 https://t.co/XfYC9Uma5A #NYC today was fun.Thank you to all the fans for making the exclusive @footlocker release of the LTD Gold #CURRY3Zer0 golden! https://t.co/zdV8rYjpRq CLUE No.3: I first became a 3-point champion in the County of Kings. #CURRY3Zer0 https://t.co/EzEiXaSjzA CLUE No.2: In 2015, I launched the CURRY ONE w/ @UABasketball at this legendary #NYC nightclub. #CURRY3Zer0 https://t.co/2qZ8AE4OnZ CLUE No.1: In the West Village, many 3s have ☔️  down on this court south of West 4th. GO! #CURRY3Zer0 https://t.co/81rKoet3gP Rise &amp; shine. #NYC, here’s your first clue to win a signed pair of the LTD Gold #CURRY3Zer0 #UAContest… https://t.co/PXjeEBHl09 [6/6] Check back in tmrw morning at 10AM EST for the first clue. This is your chance to earn your place in history. #CURRY3Zer0 [5/6] First 10 contestants to each location will win. Contest ends at 1PM EST tmrw. Full contests rules: https://t.co/4RS007Gnqq #CURRY3Zer0 [4/6] At 10AM EST tmrw, I'll drop 3 clues to give you a shot to win 1 of the 30 signed pairs of the LTD Gold #CURRY3Zer0 @FootLocker 34th St [3/6] I’ve teamed up w/ @FootLocker to host a scavenger hunt across 3 locations in #NYC. #CURRY3Zer0\n\nhttps://t.co/4RS007Gnqq [2/6] On Saturday, @UABasketball will drop 30 signed pairs of my new LTD Gold #CURRY3Zer0 @FootLocker 34th St. Tmrw's your opp to win a pair https://t.co/yKvI0xIxLB [1/6] #NYC, @FootLocker has a special surprise for you tomorrow… #UAContest Lock in! #DubNation Great to see the @NothingButNets team last night. Proud to be on their team to #defeatmalaria. Join us at https://t.co/7GVZHbobLT https://t.co/4SWHODTW9L Heal up my Man...we will hold it down til your back on the court with us. Prayers up! https://t.co/R6CVJD9tZo Family growing! #blessup @JazMakesFilms RT @Kenny_Mayne: Warren didn't want to take the shot. Dumped the ball off to Faye. She just fired up any kind of mess. Should have called a… 💪🏽 #DubNation https://t.co/KlMnzbNFyI Lock in! #DubNation Much respect @boogiecousins. This is what it's about right here!  https://t.co/kTriRs84aa #NOLA2017 https://t.co/8V7qrwdWfK All-Star weekend starts now! Who's excited?? #JBLxNBA #NBAAllstar #sponsored https://t.co/xvjNrR07Bx https://t.co/YDR9RyXPtN #christianmingle 🔥 Guilty! Also know someone with   a 🔥cookbook for added inspiration. https://t.co/YflStoHmKO Lock in! #DubNation Mood all day 2day in honor of my guy @chancetherapper amazing accomplishments, not just last night but all year! https://t.co/lcVU5gMZRS @chancetherapper @StephenCurry30 Lock in! #DubNation Oh yeah @KlayThompson you're a pretty good basketballer too Now that my friends. That is an unbelievable night at the office! @Money23Green showed us a little something tonight. Big time! Hey guys, I'll be live chatting with groups on Bubble—get your friends in a group, let's hang. https://t.co/ncPYDI7pPH https://t.co/JyI8En8pSv RT @DevonteeWOE: Listen to #TemperamentalLove by Bridgit Mendler &amp; I https://t.co/IX45611dco RT @TheRock: #CommittedToThePeople https://t.co/karjUr53GT Lock in! #DubNation Haha I see you! https://t.co/BXEecgcO2p Feel your pain Hideki!!!! #onemoreroll. Unfortunately you have my guy  @webbsimpson1 and chance to win it! #playoff @JulesEnoch @ayeshacurry please don't blame us for any and all dentist bills. But, in my experience, it's worth it💯 Something powerful happens when you filter. Join us and filter out the online hate. Choose The #FilteredLife @BritaUSA https://t.co/rPhaOPvVLd Y'all mind if I just take out a 9iron in Oracle one time just too see what it'd be like playing #16 @tpcscottsdale. Looks so crazy on TV Pops: \"you see they already posted that video of me hitting that 30ft bomb with this 🔥 tailored suit on?\" https://t.co/pVmCcsnODv Lock in! #DubNation 👌🏽1️⃣1️⃣ #mood https://t.co/QqYYXngp6l Yessir boys!!!!! Never change Klay!!!! Happy Year of the Rooster! https://t.co/Az6HXH1OQ0 NOLA bound. #squad #dubnation https://t.co/lFP8G5Ehw8 Yessir. Congrats to my guys @KlayThompson and @Money23Green getting that much deserved All-Star spot! #reservationfor4 Lock in! #DubNation Thank to my Charlotte Christian family retiring #20! Will always be a Knight! https://t.co/dNlQV8p4GK Yeah. I love my Wildcats! https://t.co/Q6vxD53PBR Nice W for breakfast this morning! #DubNation was out in full force. Keep it rolling https://t.co/LxuQ2HHLDW @ESPNNBA why pree? Let @ayeshacurry live Thanks to #dubnation for making me a starter in NOLA. Looking forward to reppin the West w/ @KDTrey5 &amp; a few other teammates! https://t.co/AMWM5i1pGd Lock in! #DubNation Honoring our President Barack Obama today on court! He embodies the inspiration, faith &amp; hope Dr. King stood for! We R Forever Grateful! #44 https://t.co/TYc24JaWEu RT @DavidsonCollege: Ready to welcome @StephenCurry30 to campus Jan. 24 for dedication of Section 30 in Belk Arena! #CatsAreWild - https://… @SethDavisHoops I sincerely apologize for all the times I've let you down Seth! But can't promise it won't happen again! 👌🏽 Lock in! #DubNation Lock in! #DubNation Still time to bid on my custom #OaklandStrong &amp; #GhostShip shoes to raise money for Oakland Fire Relief. Visit https://t.co/nSbRxJHJS5 https://t.co/RoH4Tlv6PE Keep getting better! https://t.co/FeMBhaQtJo Lock in! #DubNation Happy holidays! I’m celebrating by TRIPLING my challenge w/@nothingbutnets. Join my team to #endmalaria: https://t.co/7GVZHbFMDr https://t.co/aDCxlUH1uC What happened when @JBLAudio let me step right up and try my luck? Watch now. #JBLxNBA #ad https://t.co/1z57GJoJiC Lock in! #DubNation Lock in! #DubNation Great 2nd half fellas! And congrats to my guy #23. Proud Papa! #DubNation https://t.co/YuY4O0uUaL Lock in! #DubNation Lock in! #DubNation I am auctioning my custom #OaklandStrong and #GhostShip shoes to raise money for Oakland Fire Relief. https://t.co/JeH3UVb1pz https://t.co/jqiSDetttB Won't be smiling after the game tonight @KDTrey5! #KeepPounding https://t.co/pi0liB62kJ Lock in! #DubNation I need you guys to support my man @TorreySmithWR. RT this and help him continue changing lives! Man of the Year!#TSmithWPMOYChallenge What keeps me motivated. Excited to share my UA Sport Wireless Stephen Curry headphones with @JBLAudio. #UAxJBL https://t.co/l1WWFdH51U https://t.co/jmp0Ao3tjE Lock in! #DubNation Tonight's shoes to honor #GhostShip victims. Auctioning off for Oakland Fire Relief. Together we're #OaklandStrong https://t.co/UkVziP5jK6 https://t.co/rwuTlooi5J Thank you for being you! Brought the best out of everyone you met. #sagerstrong https://t.co/ixPco9SVr2 Lock in! #DubNation Lock in! #DubNation Lock in! #DubNation @24_cwaters Looks like that's something I can do! How 'bout a signed jersey instead? DM @JBLAudio for details. #GiftGoodVibes Lock in! #DubNation We Support Oakland as much as Oakland has supported us. We all can help in some way. #OaklandFire #GhostShip https://t.co/HBxvDtpVzv https://t.co/MwWzTHftnw A Little Keepsake from this guy! Unreal Night! https://t.co/IOEtSx89JB Lock in! #DubNation Yeah. Y'all are gonna have to explain that one to me ASAP Lock in! #DubNation It’s go time! Thanks @DegreeMen for moving with me. #ad https://t.co/L948BC8hI8 Lock in! #DubNation Enjoyed this one, thanks @jasongay. Check it out in @wsjmag. https://t.co/cwFqoPSRG9 https://t.co/J0f62ZauY9 It’s #GivingTuesday! Join me and @nothingbutnets - send nets and save lives at https://t.co/1t0a2JA0Wr https://t.co/VMmeeeEzty Lock in! #DubNation Never a doubt I'm riding with my @Panthers 4eva. #KeepPounding in my blood! But A bet is a bet! #RaiderNation y'all know how to do it right! Lock in! #DubNation RT @DavidsonMBB: #CatsWin!! The Hornets' Nest Trophy remains in Davidson's possession after an smooth 79-57 victory Saturday! https://t.co/… When the Thanksgiving Meal was too good the night before #BelowTheRim https://t.co/hJy3PVOg3o Lock in! #DubNation Don't worry @bryantabarr I'll leave you some! @ayeshacurry cooks feast #AyeshasHomeade @FoodNetwork 11/26 12pm https://t.co/UI5BTLFYsW A lot to be thankful for. Happy Thanksgiving #DubNation style https://t.co/U8zBx3o4x4 Excited for another shot at taking it all. Glad to have @DegreeMen on my side. #ad https://t.co/EUI4c0reEu Solid RoadTrip. Back to Cali we go #DubNation https://t.co/NDU3UGCcrs Lock in! #DubNation Shoutout to my guy @andreward for getting it done tonight!!! God is good! https://t.co/VcTtHmVm2U Lock in! #DubNation #RoadWarriors https://t.co/hSEtLM9mFI Lock in! #DubNation RT @reachrecords: #TheWaitingRoom by @TripLee - pre-order it now on @Merchline &amp; get an instant download of #TooCold:\nhttps://t.co/Xyk1SE3D… RT @MrAnthonyMorrow: Great win for my boys 💪🏾💪🏾💪🏾 @Panthers Keep your head up #59! Nobody plays the game harder than you my man. Heal up Quick! #KeepPounding Teamed up with @BritaUSA and contest winner Eloise to spread the word that water is the best drink. #H2Ofcourse https://t.co/yDZ6xTtDte This is so good! Need some recovery after holding my arms up so long... #strongereveryday https://t.co/FJfpDMKhb7 And after further review- @CharChristAD Basketball won that game handily despite the show! Way to hold down home court fellas. yooo! And that's against my Own dang HS too! https://t.co/KMovMqbvCg Lock in! #DubNation Lock in! #DubNation New season, new team, same goal. Excited to have @DegreeMen on my side. #ad https://t.co/GG5gOxOLRk Double the family, double the turkey means double the fun on #AyeshasHomemade  @FoodNetwork Sat 11/12 at 12pm https://t.co/gjC4AVqBzR Lock in! #DubNation Stories to tell the GrandKids! #FOE @sdotcurry https://t.co/HxBk75xsT2 Lock in! #DubNation Playing multiple sports helped me become the athlete I am! Learn how @nba &amp; @usabasketball are improving the game at https://t.co/ynyQ6whQrQ https://t.co/64E8MSVeUO Van Jones….nothing but respect! Lock in! #DubNation She's back at it! This time for Date Night with the crew. Check out #AyeshasHomemade Saturday at 12/11c on @FoodNetwork https://t.co/dABSGS2fwV Lock in! #DubNation @Matarieh21B I appreciate that my man I see you now @sydelcurry! https://t.co/H6xZExUIDc Lock in! #DubNation Big congrats to @greenRAYn20, the greatest shooter to play the game, on an impressive career! #shuttlesworth https://t.co/Oa89HSAPcP Lock in! #DubNation Halloween treats are tempting but #NoDaysOff #JoinTeamCurry and take the Total Health Pledge with @kppbh #promotion https://t.co/g4f0Hu3gB1 Lock In! #DubNation RT @ATolliver44: New season+new year for my @nothingbutnets challenge to #endmalaria!Join me:https://t.co/ENCDBkyNiw https://t.co/3irRqILjod Lock in! #DubNation Year 8!! Blessed and Highly Favored. Can't wait to see how #DubNation shows up Tonight to start the season! https://t.co/kfU42Rg6Ik We all know the story! \n\nThat’s last season. Make That Old. #IWILL https://t.co/1JKVe3LcKV It’s my job to stay active, but it’s a choice to stay healthy. #JoinTeamCurry and take the Total Health Pledge with @kppbh #promotion https://t.co/sR9J3Yynx1 I know some really cool people. And they made an amazing Album. No matter your taste in music, #GeorgicaPon... https://t.co/nSwb65x2W2 Great win in Vegas tonight! And even better that @notthefakeSVP can help us celebrate in style! #whereintheworldisntSVP https://t.co/M86yv83cRp Guess you can call that a solid game by @PMcCaw0 hitting shots to send us to OT AND win the game! #dubnation all good fellas. #KeepPounding still applies. We have a long way to go! @Panthers S/O to #DubNation showing up strong for the preseason game tonight! Crazy atmosphere. Always Good to see my guy @Mospeights16 on the court! Lock in! #DubNation Felt great to lace em up with the guys again and get back at it. Excited for the new Journey! #DubNation https://t.co/y73p1QVGPR Welp! Might as well......\n\nLock in! #DubNation @_ Excited to partner with @8760Experience and these guys. S/O to @AlPalagonia @KennyDichter @DeanGiasi @StephenJory for a great morning. #8760 https://t.co/6mYyDpKSoP Don't forget to get a copy of my baby @ayeshacurry #TheSeasonedLife. You'll be inspired by her passion for ... https://t.co/dMxABAq7gl @OffsprngofAwsum happy birthday big Fella! To one of the best to ever play the game. Salute to KG! https://t.co/Dt9ctMmIex Praying for my city! We deserve better than this...#704 #KeithLamontScott Always good to be home with my @UnderArmour Family! #IWILL https://t.co/gIelbqL8oK 1 month ago, Ayesha got 2 see her hard work come to life! Tmw it launches! So proud of her. Check it out &amp; preorder! https://t.co/zRT73swLcS Suited up today w/ @ayeshacurry &amp; @MarioAndretti in Sonoma for the IndyCar Race! @racesonoma https://t.co/zxr1tN3uNL .@uas is finally here. Good luck to the team tomorrow at #NYFW. #BeyondAmbitious https://t.co/Bd3j258Kyb Talking golf and my @BritaUSA partnership with @FLOTUS and @TheEllenShow. Pretty cool day. #H2Ofcourse https://t.co/KepMSXAVRE One net at a time, we're savinlg lives! S/O to my @nothingbutnets family for an impactful night at #TCDisrupt https://t.co/pl7ewqFJm4 Welp...... #KeepPounding .@CameronNewton keeps breaking through and changing the game. #ItComesFromBelow #IWILL https://t.co/p2tJAzFBGe In the presence of Greatness. Jet Li and KP in Hong Kong https://t.co/EchI2fImhR @HCole_30 Happy Birthday Big Fella Guangzhou showed up strong! #SC30AsiaTour https://t.co/etGekd0Td1 Passion. Drive. Hard work. #SC30AsiaTour https://t.co/C8ITNTBVdw Learning how to make some Dim Sum and Spring Rolls in Guangzhou, China 🍽 https://t.co/HvIE3l5jCw Tipped off #SC30AsiaTour in Shenyang. All the highlights on uahoops Snapchat 👻.\n\nGuangzhou is next. See you soon. https://t.co/ocLLaOTVuG I'm bringing my love for the game to Asia again.\n\nFollow uahoops on @Snapchat 👻for updates. #SC30AsiaTour https://t.co/UvJNsTaRPK Cycatf Yessir! Way to work https://t.co/yFvQEkyZas @stpaulpeterson had a blast my man! Happy 26th Birthday SDot! Keep Working on Excellence....love you bro! https://t.co/tilCdbB95v And well said @carmeloanthony Congrats 2 @usabasketball  taking care of business &amp; getting the Gold! Go down the line, they all put in the sacrifice &amp; work 2 get it done! Studying for culinary excellence. Tune in live as we attempt a #SeasonedLife recipe... https://t.co/IqXFLgVqhy https://t.co/hemHTr2kir #TBT to 3 yrs ago when I met Obama w/@NothingButNets. Happy to see he’s healthy, happy &amp; a part of #dubnation! https://t.co/A0CuwpSTgN 😂😂 https://t.co/ZfgBUq3Aj0 https://t.co/K3nVghj4m5 Hahahaha @DWRIGHTWAY1 defending the art of the pump fake was my favorite part of the day so far Today is an amazing day to be on #TeamUA. Congrats @MichaelPhelps #RuleYourself #IWILL https://t.co/GDla9BoaVx 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🏊🏽🏊🏽🏊🏽🏊🏽🏊🏽🏊🏽🏊🏽🏊🏽🏊🏽🏊🏽🏊🏽 🏅🏅🏅🏅🏅🏅🏅🏅🏅🏅🏅 RT @warriors: #USABMNT takes on China in their first game at #Rio2016 🏀\n\n🇺🇸 vs. 🇨🇳 ⏰ 3 PM (PT)  📺 @NBCSN https://t.co/zQ7CwuU0VR If you’re in NYC today, hit up @ConceptsNYC to check out the exclusive release of the #CurryLux. https://t.co/OEFMuwvnXh @SharksAntibes i missed you guys this time but we will be back! Beautiful City Celebrating one of my only good shots today with a little Jones BBQ...! Good times. Gonna do it all again tmw. https://t.co/eUYVXfGyTs @thenbpa #NBPATechSummit https://t.co/8LbMcKCagA Great time talking about how Tech has impacted my life on and off the court! Impressive group of guys doing... https://t.co/YG5lVXZa3q Your turn @festus …. https://t.co/Du42B2ipZn Unbelievable this little girl is already 4!!!! Daddy's little girl. Keep shining and bringing joy to everyo... https://t.co/30HG7pNIz9 RIP Big Fella. Legend on the court! Amazing man off! Was a pleasure to see you around the organization sinc... https://t.co/MLS1kvIuGV So Proud of this guy @sdotcurry. Always grinding and showing what he's made of. Congrats on ✍🏾. Dallas, yo... https://t.co/F6d5pbpiu4 RT @esquire: .@Chancetherapper's Muhammad Ali Tribute at the ESPYs Was Stunning https://t.co/kV6JeL8qgm https://t.co/wFjX1pyCfE The end of an era. Thanks 4 everything you did for the game! A Winner, and you Did it your way. Congrats, Tim! https://t.co/wzuINz0aLO Shout out to my UA fam for bringing home another trophy. Congrats, @Andy_Murray! #TeamUA https://t.co/v2ygMP1Lx0 If you're in the greater LA area, check out @sdotcurry at Ventura College. Won't cost you 2K and… https://t.co/lFX2C6Xeyv “God is better than the world’s best thingHe is Love!” Violence isn’t going to fix it! Praying for All My Brothers &amp; Sisters! WE NEED CHANGE Congrats to the newest member of #DubNation @KDTrey5…new journey, same goal! #JustUS I'm not the only one picking water. Fans made 4 ads on H2O. Vote your #1 and we'll make it. https://t.co/724cz6DdD9 https://t.co/EljzdcCJyJ RT @ayeshacurry: https://t.co/e7bXFopFLp sign up now for updates on my meal-kit delivery! Let's GATHER together and cook! #gather https://t… RT @Jarrettjack03: Congrats to everybody man getting an opportunity to take care of your family is feeling like no other #499 @24Bazemore God is Great!!!!!! RT @sdotcurry: Proud to announce my first Basketball Camp in Ventura, CA on July 30th. Instructed by… https://t.co/TQiEXK0VYd The Future. #SC30Select https://t.co/0tSINsUMjZ Lock in! #DubNation Lock In! #DubNation Lock In! #DubNation Lock In! #DubNation Lock In! #DubNation Lock In! #DubNation Lock In! #DubNation Download my official @StephMoji #emoji app for #iOS and #Android NOW!!!! #StephMoji #Sc30 \nhttps://t.co/8EZcnbIjN9 https://t.co/JEUnseggZs Lock In! #DubNation Lock In! #DubNation Lock In! #DubNation Lock in! #DubNation Lock in! #DubNation Lock in! #DubNation Happy bday @cassyathena! Appreciate all the moments you’ve captured for me and hope you enjoyed today to the fullest Lock in! #DubNation My button is cooler than yours!RT- help @Money23Green cont 2 help the community #DraymondGreen #NBACommunityAssist https://t.co/eahN1ntu2u Lock in! #DubNation Happy Mother's Day to my beautiful wife @ayeshacurry. I marvel every day at how much you do for our family ... https://t.co/x8MLmO2bRj Y'all boys up to something! Big time win tonight. @KlayThompson @hbarnes @Money23Green @andrewbogut @ShaunLivingston @andre @TheBlurBarbo... RT @warriors: The gratifying thing about tonight was EVERYbody chipped in. https://t.co/MHeXQ6wEUw RT @Mospeights16: Strength in numbers!!!! #dubnation great way to handle business tonight... @OracleArena so much love!! #history #justwatc… Thanks 4 all the prayers &amp; messages. Can feel all the positive energy. God is Great! All things considered I’m Gonna be alright! #DubNation Lock in! #DubNation #DubNation @sdotcurry @lecrae @TheJetonTNT @SHAQ @NBAonTNT  – you’re up next! https://t.co/Vdpf4Jm6qd #CallYourShot https://t.co/mMHzI9AbNt .@POTUS called his shot to end malaria-now I'm calling mine. See who's next: https://t.co/Vdpf4Jm6qd #CallYourShot https://t.co/cVeGsL35Xa This Squad is determined man! One down, next man up! #DubNation Lock in! #DubNation Tonight was special. #73. We did something thats never been done in the History of the league. Together. So... https://t.co/UuQkVL4RoR First let me say congrats to Kobe on an unbelievable career. 20 years! You set he bar on the court for our ... https://t.co/NLAtvmeo4s Lock in! #DubNation https://t.co/EOdN9pFitA I see you @sdotcurry Happy National Sibling Day! We \"growed\" up real nice @sdotcurry and @sydelcurry. Love y'all. https://t.co/abLvkJV0oR @LeVelleMoton thanks Coach! Lock in! #DubNation Lock in! #DubNation You ain’t never lied! https://t.co/rNktxQpjPW Lock in! #DubNation Ready for this weekend down at Augusta National. All the best to my guy @JordanSpeith going for Jacket #2 #... https://t.co/kspqWa3ljZ Lock in! #DubNation RT @NBAcom: From crossovers to game-winners, this highlight mixtape of A.I. is insane\n\nWATCH: https://t.co/3MQMvOIRsB https://t.co/byY8csjA… Go preorder @ayeshacurry new book NOW! The Seasoned Life: Food, Family, Faith, &amp; the Joy of Eating Well by Ayesha … https://t.co/T2L4Jl8IU4 Lock in! #DubNation Lock in! #DubNation #CollegeSLAM #Barham10 Think you can match some of my plays? #PlaylikeCurry #Contest @JBLAudio Rules https://t.co/dOdXCTeOLB https://t.co/FXvDVSyZTI About time water gets a commercial. Make yours here: https://t.co/jRZieNXuQo. You could win a chance to see me play. https://t.co/RY22wzWskg .@zamst_us Thanks for the support throughout the years. https://t.co/8x2uQf01vO Lock in! #DubNation Lock in! #DubNation No Game today = popcorn time. #NoShameInGuiltyPleasures #ThatPopcornLife #CoachCurry https://t.co/6lZfeo6b3Q https://t.co/EptfpYteft 💯💯💯💯💯💯 respect @boogiecousins @sdotcurry  https://t.co/GaxD3UAXbq Lock in! #DubNation Andre Ward show baby! https://t.co/hLCSk0wIxG S/o to @realtuffjuice for blessing me with his new book today. Had to let him know I already bought 3 copie... https://t.co/gXP6KU1MTW Sacramento, go kick it with my brother @sdotcurry and my boy @coseezy as they give back to the community to... https://t.co/aMssmX3w9t Lock in! #DubNation Lock in! #DubNation Happy birthday to my beautiful Wife! I mean, how lucky am I? Enjoy your day shawty. Love youuuuuuuu #Focuse... https://t.co/Kzs7CvMRUZ Lock in! #DubNation I don’t know about y’all, but I thought I played my best game of the year 😂. Live and Learn. On to the next! Lock in! #DubNation Solid win tonight in Dallas. Finally got to chop it up with my #UA family @JordanSpieth. Inspiring guy! We ... https://t.co/FE8YbTt32u Lock in! #DubNation Check @ayeshacurry &amp; I as coaches for Kaiser Permanente. Matching jackets &amp; all. #CoachCurry https://t.co/2sn3tWmk3g https://t.co/j5wUVscLh9 @9thwonder 🙏🏽🙏🏽🙏🏽🙏🏽🙏🏽🙏🏽 He’s back! Lock in! #DubNation \n\n#33forever @LHS_Tigers On set shooting my upcoming commercial with @Chase. Excited to be part of the #ChaseMasters team! https://t.co/4VqktNLgRp Lock in! #DubNation And yes. Still haven’t learned how to spell “Pi” in 28 yrs Sincerely appreciate all the bday love today! Blessed to see another year and continue to get better on and... https://t.co/YTztdlvvgw #Veintiocho Sweatsuit gang for the bday! No other way.... https://t.co/xVw4cFOOTU Excited to announce we're gonna coach our own team. Any questions? #CoachCurry https://t.co/O136evPJI9 RT @Mospeights16: RT @festus: Good win! Great game by my shooter @Mospeights16. Came ready for em tonight  #MoBuckets!!! Lock in! #DubNation Lock in! #DubNation This is a rule I live by. What's yours? Share with #RuleYourself and tag @UnderArmour for a chance to win UA gear. https://t.co/2rLxUvO2NV #CoachCurry has a nice ring to it, right? Stay tuned... Lock in! #DubNation Lock in! #DubNation RT @MichaelPhelps: My @underarmour commercial drops tomorrow. The emotional reaction from @MissNicoleJ &amp; me the first time we saw it. https… Join me on #Slyce for a live Q&amp;A on What a day....... #TeamSlyce https://t.co/SdLj8yStza https://t.co/Y6jqC9dTc7 Lock in! #DubNation Check out the story of where it all begins with @TeamSlyce https://t.co/y7EfNFvVhe Think they were expecting someone special tonight at @OracleArena????? #PurpleRain https://t.co/AvjZ36wHii Lock in! #DubNation Lock in! #DubNation Join me on #Slyce for a live Q&amp;A on Anything  #TeamSlyce https://t.co/SdLj8yStza https://t.co/QDY8foAyKP Cmon man! Call fat jimmy up &amp; tell him im looking for him https://t.co/tKKkjP16J2 Lock in! #DubNation RT @Money23Green: Good win tonight!! That man @andrewbogut dominated that second half!!!! 🔒🔒🔒🔒 Lock in! #DubNation Lock in! #DubNation Lock in! #DubNation Back to work tonight in Portland! 30 games left to get ready for the real run!#Dubnation https://t.co/Mq29AKbIKN What a great weekend here for #NBAllStarTO. Thanks to the fans, always grateful to be here because of you. #JBLAllStar #StephenCurry Join me on #Slyce for a live Q&amp;A on All Star Game #TeamSlyce https://t.co/SdLj8yStza https://t.co/tEhZVWSnPK Laced up in the \"Energy\" Curry 2 low for the @Footlocker 3pt Shootout tonight. #UA https://t.co/VcbCXSxEaK Jyoti and Akshay- much respect to you guys! #teamslyce #ASW2016 https://t.co/2mYNhXaGev Appreciate all the love from #dubnation in Toronto! Thx @UnderArmour &amp; @FootlockerCanada for making it happen💯 https://t.co/hQMv6OmIBo On my way! #ASW2016 #UA #sc30 https://t.co/Ghtep39RQk Choppa Style! #watchyahead https://t.co/s333WK5c82 When in Rome.....and/or Toronto https://t.co/ud8rSLlPko Aiming for the back to back. Lacing up in the new #CurryTwo Energy. #PlayForMore. https://t.co/Gx2Wm2en7J RT @FLOTUS: As members of @TeamFNV — @StephenCurry30, @AyeshaCurry &amp; the First Lady go…BANANAS!\nhttps://t.co/xvnKluBj19 S/O to @JBLAudio for keeping me focused all weekend in the TO. Time to talk to the media. Let's goooooo #JBLAllStar https://t.co/buW41exlS7 We have a winner! Props to Jyoti, who will be joining me at a handful of events during ASW. #slyceallaccess https://t.co/mP97vonFlT Location 3: From the sky I get my power, meet #teamslyce at the... #slyceallaccess https://t.co/tpWs3QKVrY Location 2: This bird left the nest and flew south in 2004. His nickname was... #slyceallaccess https://t.co/MBek9UF70P Location 1: We need some really big rings. I got a really big team. #slyceallaccess https://t.co/NomofHb9jG T-2 hrs...to participate in today's #slyceallaccess in Toronto, you MUST agree to the rules https://t.co/zrUyTptkCU by 11am ET #dontmissout @ATolliver44 got an extra #UA Jaxket for ya bro Please keep Coach Monty Williams and his family in your prayers. Unimaginable tragedy he’s going through right now! Trust in Him always! 🙏🏽 It's 5:40am and I'm on team no sleep. #ASW2016 #Toronto #416 https://t.co/GRyAUtEPib Lock in! #DubNation Lock in! #DubNation Toronto, join me for #slyceallaccess at All-Star Weekend. Enter for a chance to win: https://t.co/vUnW1VS68N https://t.co/kTlPW3otWQ Join me on #Slyce for a live Q&amp;A on Panthers #TeamSlyce https://t.co/SdLj8yStza https://t.co/VwfqFSu3qz Proud to be back in Toronto for NBA All-Star Weekend. Lacing up the new #CurryTwo All-Star on Sunday. https://t.co/VJ4OQ2Uf5l all heart, nothing else! sheesh https://t.co/sd4dJNYSNq Much respect 2 my guys @Jonathanstewar1 @CameronNewton @ThomasDavisSDTM! y’all fought hard till the end! Can’t wait 4 next yr #KeepPounding A Look into my soul right now...but it's all good we will be back! https://t.co/fKbDjGx0on RT @MrAnthonyMorrow: Still ride or die for the home team @panthers ✊🏾✊🏾✊🏾 @stephencurry30 https://t.co/bY1ukeRwSx 💀 I love it! Never out of it! We just gotta wake up a little bit. #KeepPounding @sydelcurry https://t.co/UoYjj0YP8E Man. Can't thank the @Panthers enough! #keeppounding https://t.co/V99jAKNloj RT @ayeshacurry: Cooking today at the #michaelminatailgate for #SB50 !!! Everyone is loving my Caroline inspire… https://t.co/6xTS9lhpVG \"clowning\" with my squad https://t.co/6Om2GZcLM8 When you run into the man, the myth, the legend @KAKA it must be a great night https://t.co/GcQNcTvSkT Lock in! #DubNation Join me on Slyce this weekend for a live Q&amp;A. Download at https://t.co/tNwuAJrSKS with code “chefcurry”. #teamslyce https://t.co/cCFTSEjR8Z Honored to be at the @WhiteHouse today. Thank you, @POTUS, for supporting me and @nothingbutnets in the fig... https://t.co/dL3xS2H5dl Abe Lincoln wondering who we are https://t.co/nnFVLD3FKJ 1 of 1 #Potus https://t.co/iVl8hNe47U Lock in! #DubNation Practice at St Johns today. #UA school. Coached by @Warriors Legend Chris Mullin https://t.co/553nxo5Zcv Teamed with @DegreeMen to measure my moves on the court. #EveryMoveCounts https://t.co/mlRKTElsvM Here you go @dpshow #TheClaw https://t.co/BabXZeQpYk Lock in! #DubNation Let's do this MSG! https://t.co/TI5ifCfu3d Lock in! #DubNation Congrats to my teammates @money23green and @klaythompson stamping passports to Toronto. So well… https://t.co/S0TSeVB8el Are you ready, #DubNation? Check out @warriors new home at the #ChaseCenter: https://t.co/FiqAnNJTCT https://t.co/a7dPcQ3A4s Congrats to the Rook @loon_rebel5 getting his first bucket tonight!  Many more to come for the… https://t.co/dEySNOx2e6 Lock in! #DubNation Lock in! #DubNation North Carolina! Come on and raise up.......#mood @sdotcurry @mranthonymorrow @mchalmers15 and… https://t.co/wmuP7YiVOw RT @Panthers: See you in Santa Clara! \n\n#PantherNation #KeepPounding https://t.co/crFr5Z6utJ We going to the ‘ship what??? We going to the ’ship what?? We going to the freaking ship baby! @Panthers I love you! #KeepPounding Cam with the…… https://t.co/zUJp7jzl3h RT @NFL: #KeepPounding https://t.co/31WWNeBeVM Letssssssssssssssssssssss Gooooooooooooooooooo! Boys look really good right now! #KeepPounding RT @warriors: Great to have you back on the sidelines, Coach Kerr! #DubNation https://t.co/ASjiWsWCFh Lock in! #DubNation Thank you to everyone who voted! Know we will have some more good news next week #DG23 #KT11… https://t.co/2Q4cqlKBpo Lock in! #DubNation Hey @Kenny_Mayne. Well done. My @Panthers appreciate you’re support going 4ward! Sizzler is fine. Come 2 Napa &amp; we will stomp some grapes! Lock in! #DubNation Thank you Dr. King! Inspired equality and taught all of humanity invaluable lessons to live by!… https://t.co/qWxRYae7tV Klay Thompson #NBAVOTE Draymond Green #NBAVOTE #readthewholequote Live Q&amp;A on Jan. 17 at 8:20PM EST on #anything https://t.co/SIb9GPtksI Thank you @ThomasDavisSDTM! See y’all next week Had to know @DangeRussWilson was gonna make a couple plays to get the back in the game! Now we go win the game one more time on this drive! 💯💯💯💯💯  https://t.co/VQyhKXTtPM That's how you play football fellas. Gotta finish it and keep the momentum for next week https://t.co/Z2MQ5JQ5qa Absolutely!  https://t.co/pPgGJRxmOO Ehhhhh https://t.co/q9vJTDimk1 Phone was dead the whole first quarter. What did I miss? 😎#KeepPounding #LetsGoPanthers 😂😂😂 https://t.co/0omj4A9QBo But @AaronRodgers12. You sir are a gamer! Nothing but the ultimate respect for you This… https://t.co/pu0rTAeklp Lock in! #DubNation RT @DavidsonMBB: #CatsWin! Davidson downs UMass, 86-74. Gibbs paces the offense with a career-high 43 points #catsarewild https://t.co/0PX2… RT @UAbasketball: For the crew.\n\nThe #CurryOne 'Friends &amp; Family\" is out now: https://t.co/8vAAsHtkYx https://t.co/Gk1tD867fv Lock in! #DubNation Lock in! #DubNation #WCW Focused and Driven https://t.co/8ortkU4k6l Great to see my guys @amirkingkhan and @andresogward last night at oracle. We are up to something big #teamslyce https://t.co/sOanWTC9a7 Lock in! #DubNation Lock in! #DubNation Lock in! #DubNation Klay Thompson #NBAVOTE Lock in! #DubNation Happy Birthday Woe! 23!  https://t.co/NjZpIXdt8r My bad. Draymond Green #NBAVote Nice win tonight! The Squad is almost  back to 100%. And man, @Money23Green…….I see you. #NBAVOTE Lock in! #DubNation Lock in! #DubNation RT @MyNameIsBizzle: One last #Selfie for 2015 with the homie @StephenCurry30....HAPPY NEW YEAR!!! https://t.co/SFTcOxzUWh Big time win tonight by the fellas! Short handed, back to back, on the road! Happy New Year everybody! 🙏🏻🎊🎉🎊🎉💥#JustUs RT @CBSEveningNews: ThanksUSA is responsible for raising scholarship money for service members families: girls:https://t.co/lJpmkkqucv http… Lock in! #DubNation 😂😂😂😂😂 https://t.co/aqWqpsW30c Wish we coulda ran the table but if @Panthers nation is upset about 14-1 or concerned about the next part of the journey……miss me with that! Check out my latest project with @JBLAudio  #ListenInColor w/ @Dame_Lillard https://t.co/3tdr3NoAgh https://t.co/wjO3oJzFji Lock in! #DubNation Not just game day. #StrongerEveryDay with @MuscleMilk. https://t.co/UMbt0ZwajS Lock in! #DubNation Great to see you back on the court @thinkiminthe90s! Participate in #PlayStationHEROES and you could win a 20th Anniversary PS4! Click here for details: https://t.co/mhDy8DlTkn #sponsored Lock in! #DubNation What’s my favorite drink?  #H2Ofcourse. Excited to start working with @BritaUSA to get more people to #DrinkH20. Drink Up. Lock in! #DubNation RT @KidsFootLocker: Like @StephenCurry30 says, \"There's no substitute for hard work!\"\n\n#GOBIG\nhttps://t.co/M731T2oJe7 Ankle problems? @Zamst_us has you covered. Checkout their A2-DX here https://t.co/Y7KMWBHf9v Lock in! #DubNation Lock in! #DubNation Being a pro is hard work - especially film study. WATCH my new @KidsFootLocker commercial: https://t.co/hlq67Qj9aX Partnering w/@RightToPlayUSA to donate in support of Girls Empowerment with the #GiftofPlay https://t.co/UUj26n9C3i https://t.co/bnHl4rcOLp Lock in! #DubNation Going to stay fresh on-and-off the court in ‘16 thanks to @DegreeMen. Proud to be part of such a great brand. So. Did the Panhers win? Yep. Cam show why he is an MVP? Yep. 12-0? Yep. #KeepPounding Yep Lock in! #DubNation Lock in! #DubNation RT @ayeshacurry: Tune into @CookingChannel at 6:30pm tonight to see a glimpse of our kitchen!!! I'm cooking up Spanish rubbed chicken with … Our family holiday tradition: #GiftANet with @nothingbutnets in honor of your friends &amp; loved ones: https://t.co/9N2XqZLsMs Lock in! #DubNation Who wants to be my tunnel shot wingman? Fight AIDS with @RED today to enter:  https://t.co/FmQY0aFRzi\n #SHOPATHON Home Sweet Home Blessings!  https://t.co/Qv94ZV8muQ Never step onto the court without my @Zamst_us A2-DX, Find out why here: https://t.co/Y7KMWBHf9v #Zamst Hey @Ben_Dowsett….that’s a personal foul………..“REACHING” https://t.co/eM8FbOL4Mr Lock in! #DubNation Proud to announce my first signature headphone with @JBLaudio ! Get them here: https://t.co/jaFuyliPcu #TeamJBL https://t.co/DlNAXci5kO Yeah that other Curry guy played well too. Had to stop myself from clapping! Needs some more ⏱ but what do I know 😴 https://t.co/gUKCjqa5mw Forgot to say this last night but S/O to @BRush_25 stepping in and showing out last night! He stays ready and it shows👌🏽#nextmanup Lock in! #DubNation Congrats Coach! Proud to be a part of a few of those wins! More to come!  #silverfox #tcc #greatdaytobeawildcat  https://t.co/UzXOsQ0SNF Lock in! #DubNation “Come on baby….lets do the twist! Come on babaaaayyyyyyyyyyyy….lets do the twist!” Happy thanksgiving everbody!!!!! https://t.co/d6628vzXeq My man! Ps Jackson 😂 https://t.co/ayHdtfe4zX Checkout @Zamst_us for premium athletic bracing https://t.co/cAHFDXlE63 These doodles are super cool. I want to see more!  If you know a K-12 artist, have them enter a Doodle 4 Google: https://t.co/YeWITmXQi6 Lock in! #DubNation RT @roaringriot: There's a maroon landslide in BoA right now #hittheroad RT @debrooks_XXIV: Salute to the homie for the Dub #WildcatNation #TCC #catsarewild @evencio_flores l🚼📖 It’s a great day to be a wildcat! #GameDayBaby https://t.co/70U4ROCyK2 RT @UAbasketball: The fastest, most accurate marksman in the game. \n\nThe #CurryTwo 'Long Shot' launches 11.25. https://t.co/2IFqMDs0i9 RT @UAbasketball: Where @StephenCurry30 fell in love with the game. \n\nThe #CurryTwo 'Providence Road' drops 11.25. https://t.co/6wSHW9gade Catorce! Lock in! #DubNation Can’t say enough to about this squad!! Resilient to the end 💯! Back at it tomorrow night. #DubNation gonna need you at Oracle loud. ✈️✈️✈️✈️ Lock in! #DubNation RT @nothingbutnets: #TBT to this awesome moment when @NothingButNets met w/athlete champions of #malaria, @StephenCurry30 &amp; @ATolliver44 ht… WATCH my new @KidsFootLocker commercial for some tips on how to handle those tough questions https://t.co/3o1xl7e3mo https://t.co/XH5Ry8mjdk Lock in! #DubNation Lock in! #DubNation Lock in! #DubNation So, my Wife bought me a new toilet for our house. You know, one of those automatic ones. And i’m Hype!!! Yep That’s it, Goodnight! #blessed Lock in! #DubNation Checkout my video with @Zamst_us on injury recovery https://t.co/Pqsjp45osb Lock in! #DubNation @Thaddshade appreciate love! #IWILL Lock in! #DubNation Lock in! #DubNation Appreciate the help getting me ready for tonight!  https://t.co/ccucXkOBdD RT @UAbasketball: From one generation to the next.\n\nThe #CurryTwo ‘Father To Son’ is available now: https://t.co/UcAVx9Wd49\nhttps://t.co/aq… RT @UAbasketball: The #CurryTwo ‘Floor General' was made for leaders. #LightTheGameUp\n\nAvailable Now: https://t.co/AYwTVrMsE2 https://t.co/… Lock in! #DubNation Zamst has you covered this basketball season, checkout their A2-DX Brace here https://t.co/vDEBHmlY5U #Zamst https://t.co/j9s85MC62v Humbled to be on the cover of @GolfDigest's \"Golfers Who Give Back\" issue. Watch: https://t.co/I7cMwio8w5 https://t.co/SbGFIrXPmI RT @warriors: Shout-out to @festus on picking up his first dbl-dbl of his career (11pts/10rebs/3blks). Ezeli was a +37 tonight. https://t.c… And go @Panthers. 2 wins tonight? Lock in! #DubNation Lock in! #DubNation The boys in New Orleans always take care of me. https://t.co/WYlUX5uXaD Fresh  https://t.co/0AUxRdG5et Lock in! #DubNation The Bible says to \"Judge not lest ye be judged\" but I think there's an exception for you… https://t.co/67bXfYqeLV Been moving all offseason to prep for ‘15-16. 1 game down, 81 more to go! #AlwaysMoving https://t.co/XfROA8TMRp Shout-out to the @MuscleMilk team for supporting me from the start. We're in this together. Let's goooooo! https://t.co/Gk8G9UrdYm RT @festus: #SQUAAAAAAD Amazing feeling putting the rings on our fingers - Euphoric almost. The perfect… https://t.co/BHCc5NAVrF RT @KlayThompson: It's not about the numbers or the individual accolades. It's about these moments u share with your… https://t.co/ssG2AXHV… Lock in! #DubNation 💍 One long journey ahead of us! #RallyDubNation https://t.co/8U96DJdAuD iPhone 6s. Three pointers. Slo-mo. #triplethreat https://t.co/VPDRBwEgNt #DubNation, you wanna star in a music video? Show me what you’ve got! @guitarhero #GuitarHeroTVStar\n https://t.co/Di15qbbvvi #DubNation, this #CurryTwo is for you.\n \n#RallyDubNation 10.27 https://t.co/OCnLgTBixf #DubNation Time to get loud. Show us your passion this season. Tag your photos @UABasketball #RallyDubNation https://t.co/ocPSUTj1MC It’s time to #LightTheGameUp\n\nThe #CurryTwo is on the way 10.24\n\nWatch Now: https://t.co/EPvd275Wdj https://t.co/7VoczXr71m I’m a judge for Doodle 4 Google. You guys should enter the competition! https://t.co/2GSbJhphUR RT @Jonathanstewar1: Great team win today #5-0 #KeepPounding Appreciate everyone coming out. Gave y’all what we had!  https://t.co/SRurVPu3DL 😂😂😂😂😂😂😂😂 https://t.co/vx146BrJBF Confirmed!  https://t.co/k6IR5hzzJu RT @LetsGoWarriors: Jarrell Eddie with easily the best performance. Who knows the song? #LetsGoWarriorsLive http://t.co/PI2mHonZ4l RT @JustinThomas34: Fun group with @andre @StephenCurry30 tomorrow for the @frysopengolf pro am. Come on out and heckle the champs! @Silver… RT @COSeezy: Go listen to this fire my Woe (the original Woe) worked so hard on hard on these past 6 months @DevonteeWOE http://t.co/m0zPrk… RT @HotNewHipHop: 🔥PREMIERE🔥\n\nDownload @DevonteeWOE's #DistrictVibe mixtape\n\nhttp://t.co/uoufIqBu7T http://t.co/WPMszlhe1P RT @Money23Green: Man @BarackObama is the MAN!!!! Swag is crazy, super smart and just a joy to listen speak!!! Wow what a blessing!!! #SF RT @ayeshacurry: Exciting things ahead! I love my @FlutieEntertain team!!! http://t.co/zEelHGQkAO Our prisons lock up too many people + ruin lives. We can’t afford that. Join me + demand #JusticeReformNOW #cut50: http://t.co/W1tpMKPumG RT @bryantabarr: Big things on the horizon. Only missing @jaymay_chicity. #comingsoon @ SAP Center https://t.co/RoMwbTYtUB Thanks to #DubNation showing up strong tonight in San Jose. Crazy preseason game! Hope I didn’t foul anyone on the way in or out the arena! Lock in! #DubNation RT @ayeshacurry: Here is the lin to my appearance on Rachael Ray Show https://t.co/TnHSzzhFS3 via @RachaelRayShow RT @acceleratebball: Get insight to @stephencurry30 off-season training with @acceleratebball Brandon Payne in this… https://t.co/RLXBqSBNZN 🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽 https://t.co/QkydP6tmTj RT @SportsCenter: Winner! Jordan Spieth finishes 1st at Tour Championship and captures $10 million FedEx Cup title. http://t.co/a9FUOLlA1k “&amp; whatever you do, whether in word or deed, do it all in the name of the Lord Jesus, giving thanks 2 God the Father, through Him” Col 3:17 JUST 1 day left before #NBA2K16 drops if you pre-order. Check out the new @NBA2K trailer  https://t.co/0BkmzlhK1C 5 days……. 😂😂😂😂😂 https://t.co/kG0v75gQHQ RT @ayeshacurry: Be sure to tune in tomorrow to @rachaelrayshow !!! I'm whipping up something delicious. If you're not… https://t.co/mN7UCr… Actions speak louder than words. Check out my new @CoachUp video. #ImproveYourGame http://t.co/DpFq3ofz8v RT @MrAnthonyMorrow: Great win for my @Panthers http://t.co/y5gPqM3qpS 2-0 @Panthers Appreciate the hospitality today! Pounding that drum was fun #keeppounding @JaimeJame2 i got a pretty good view of the game right? RT @franfraschilla: Congrats to Coach Bob McKillop. He's been inducted into the New York City basketball Hall of Fame. He's in serious comp… .@roaringriot y’all ready for Sunday???? Great Day to be a Wildcat! The Silver Fox, the Wildcat and Larry on campus today. #tcc #exit30 https://t.co/43zQPr2WlI RT @dmar: Pretty cool to see on TV this morn. Of course @Money23Green went Sparty with his guest pick. http://t.co/ZqFshGj3um Go #BeyondTheConsole with PlayStation Life &amp; watch my #PlayStationHEROES https://t.co/eoWrGx0udu #Sponsored What’s going on Manila??????????? The #UARoadshow is finally here. Can’t wait to see you guys and have some fun today. Loving Tokyo! 📷: @bydvnlln #UARoadshow https://t.co/EqAaNV6fFO Can't wait to launch the #CurryTwo! We're dropping limited pairs in China on Sept 6 for the #UARoadshow. http://t.co/FYf6y4BAeJ RT @theobserver: Elon’s Sydel Curry furthers family legacy as leader .@sydelcurry .@StephenCurry30 .@sdotcurry\n\nhttp://t.co/SAUUMExHSo http… Build your game from the ground up. #RuleYourself #IWILL ​\nhttp://t.co/0gJAUVxmMT RT @JordanSpieth: Had so much fun working with #TeamUA on this, check it out! #RuleYourself #IWIll https://t.co/6OIfDPhMCE \"To know your wife like nobody else knows her is an amazing thing and something you should desire\" -somebody smart RT @SoleCollector: .@BradHall_Shoes got his hands on the Under Armour Curry One: http://t.co/25jkNBBFbs http://t.co/YZ7fUuXdJP Pretty legit video Bomb by Draymond in this new @NBA2K trailer! #Champs http://t.co/VOwcWoqLHV https://t.co/bql5vXqXSv Find a @CoachUp coach before 8/31. Use code AUGUSTGO to enter to win a free season of sessions http://t.co/Fs5YDq0j3B http://t.co/lsBVR2iTRw Chat with @JBLaudio and me today at 11 AM ET with Facebook Live! Don’t miss it!  http://t.co/puZNpqZUVX #FBLive . @UnderArmour @mistyonpointe &amp; @JordanSpieth we are just getting started. #RuleYourself #IWILL http://t.co/c3RMepYyNv Happy born day to my brother from the same mother @sdotcurry. So proud and happy for all you've… https://t.co/69LvuvPTIG Once again, @UnderArmour doing it again showcasing major talent in NYC w/ the #elite24. Basketball is in good hands On ESPNU..check it out. RT @Ballislife: Josh Jackson (@j_josh11) Wins EPIC Under Armour Elite 24 Dunk Contest! CRAZY Dunks! http://t.co/5sq31bdNmt http://t.co/apHL… RT @ayeshacurry: So excited!!!!! Thank you to all of my YouTube subscribers for helping me reach this milestone. Let's… https://t.co/dM7f00… PSA. Noticeably following my family’s car on the road for nearly 30 miles &amp; tailing me the whole way is not the best way to get an autograph Congrats to my guy @andrewbogut clinching that spot in the 2016 Olymipcs! Hope to see you there next year in Rio. Big time Bogey Yep! Always a student of the game bro.  https://t.co/XAeoHJn3cf I’m bringing my passion for the game to Asia this Sep w/@UnderArmour. Get ready! #UARoadshow\n\nhttps://t.co/27hdBI2R5F #BeTheStory: Introducing @NBA2K Beyond the Shadows w/ my story in #NBA2K16 https://t.co/KTBi28Snn9 Pick it up https://t.co/L7AfkQh34J First ever #NBA2K16 gameplay of me! Check it out @NBA2K https://t.co/3PybTdKMYP Watch me play #PlayStationHEROES winner @thedavis510 in @NBA2K here: https://t.co/sLXhTWnMIy #GreatnessAwaits #sponsored RT @ABOTraining: A special moment for Brandon Payne, holding the #larryobrientrophy with @StephenCurry30 #hardworkpaysoff http://t.co/L8Yvp… \"I don't normally wear hats during my workouts. But when I do, I wear #mobuckets hats.\" Happy… https://t.co/yJcmvvfDUu RT @bwright34: “For the word of the Lord is right and true; he is faithful in all he does.”\n\nPsalm 33:4 RT @JCrossover: Open court.. RT @ayeshacurry: Beginnings of my pepper steak stir fry. #newrecipealert  #hometestkitchen http://t.co/4PuAarh0a9 Peep the headband though! https://t.co/aIs13V50Wh @LENNYLENZZZ my man! Hope you’re well Happy 10th Birthday to my man Taliq. Keep fighting, keep believing. We are all praying &amp; rooting for you! #TeamTaliq http://t.co/4wBy3PF9kb Let’s goooooo! He’s been patient and worked so hard to get here. @sdotcurry got his Foot in the door now it’s time to go! Love you bro! RT @SportsCenter: Seth Curry, younger brother of Steph Curry, finalizing 2-year deal with Kings. (via @ESPNSteinLine &amp; @YahooSports) http:/… This is the only award show made for us! Don't miss @TheNBPA #PlayersAwardsBET on TUES JULY 21@ 8P|7c… https://t.co/QTwBcnkgdV RT @BETSports: .@StephenCurry30 @CP3 @KingJames &amp; more will be at the 1st ever @TheNBPA #PlayersAwardsBET this TUES 8P/7c http://t.co/0VOFQ… RT @carynrweiss: The tribute to #LaurenHill on the #ESPYS gave me chills. Get off the bench, don't stop fighting &amp; never give up! http://t.… Not full squad but dang close. Congrats to the The U.S. Women's Soccer team but #dubnation knows how… https://t.co/G8pJE7owXo Man what?? Thanks 2 everyone who voted. Amazing honor. S/o to @KingJames @AaronRodgers12 @JJWatt that’s some incredible company! #ESPYAwards I'm giving away a signed jersey! Book a @CoachUp coach using my code STEPHEN by 7/20 to enter. http://t.co/yHD00M98SQ http://t.co/nX2XB7DTnM My wife is a champ! @sdotcurry building blocks! RT @NBAcom: Seth Curry scores 30 pts (9-17 FG) as @PelicansNBA drop @Bucks at @NBASummerLeague: http://t.co/hpDrPb0Y29 #NBASummer http://t.… Playing #NBA2K16 with #PlayStationHEROES winner @TheDavis510 #GreatnessAwaits http://t.co/lPqdWVAYOb @ayeshacurry I’m singing that D’Angelo all the way home! In honor of my boy @Dlee042 taking the next step in his career, this is how we started our relationship! Love you bro http://t.co/25UqWFtSJj RT @COSeezy: I was blessed with the opportunity to Kick it with @stephencurry30 and the nations top 20 high school… https://t.co/cPttl2Tiwe The hot sign is on… Happy 4th of July America! Thanks to all the men &amp; women who have sacrificed &amp; those that make it possible for us to celebrate today! #USA So dope! Congrats to the whole Wright Family! @delonwright @DWRIGHTWAY1  https://t.co/BYK0ZgeRlV #dubnation is proud to call you a #Warrior, @Loon_Rebel5. Welcome to the squad. @JBLAudio #NBADraft http://t.co/BwOCFAvlrt RT @NBA2K: Behind the scenes @StephenCurry30 doing #NBA2K16 motion capture dribbling two basketballs pregame ritual https://t.co/gB2X4iAk1s RT @BleacherReport: VIDEO: Muggsy Bogues gives a young @StephenCurry30 an airplane ride back in 1992 http://t.co/3kQVgpUq7B http://t.co/2Ud… Hard work paid off, thanks to my private coaches!! You can train with one of my @CoachUp coaches here. #AnotherLevel http://t.co/DMGbYUmfdr Our new 6th man!  #Dubnation, meet Bob. #Minions\nhttp://t.co/fye6qSh1W1 My boy @JordanSpieth is at it again! U.S. Open Champ! Congrats….Proud to be with you representing @UnderArmour on the biggest stages! #IWILL Congrats to my guy @andreward dominating tonight! Humbled to carry tour belts as you represented Christ and the Town like you did! #respect On the way to Oracle to catch my man @andreward's fight. Catch it on BET in a few. Should be a good one. https://t.co/8KpBG5hnbk Dubnation!!!!!!!! Thank you for today. Will remember it for the rest of my life! #oakland #warriors… https://t.co/zFE4GbDWD2 @Alec_Will_I_Am please let him off work for the parade. -sc @TGurley81 my man! Unreal experience. God is Great! #TCC https://t.co/QH7i8WrJMK @KevinHart4real thanks bro. Dream come true @DavidDTSS talk to em!!!! Hit up Chester for some du jour maybe. .@RealSkipBayless Love you too Skip! RT @WayTooFresh: Thank you @ayeshacurry for helping @StephenCurry30 do everything it took to help him to win this! #DubNation “We going to Augusta” - MVP @andre 🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆 RT @andrewbogut: No MATTER what.... The ups and downs.....Frustrations and Adulations... @NBA CHAMPION will be for ALWAYS!!!!!! #nbachampio… RT @andre: We gone be championship!!!! Lock in! #dubnation Lock in! #dubnation Lock in! #dubnation RT @PopCulture27: |LIVE NOW| Daily Pop Culture News with Trailers #meerkat http://t.co/H7qsyng3WG Lock in! #dubnation Lock in! #dubnation Lock in! #dubnation RT @JBLaudio: Proud to be on #TeamCurry! Good luck, @StephenCurry30 in the Finals! #DubNation http://t.co/jKn39ImLGa RT @ATolliver44: Today is my 30th birthday! Im honored to donate it 2 @nothingbutnets . Help me fight malaria with them by donating! http:/… Lock in! #dubnation Lock in! #dubnation Lock in! #dubnation Lock in! #dubnation RT @PlayStation: Get a chance to play NBA 2K15 with @StephenCurry30. Enter by buying the new PS Heroes theme in support of charity. https:/… Lock in! #dubnation Lock in! #dubnation Lock in! #dubnation Lock in! #dubnation Lock in! #DubNation RT @MuscleMilk: We are so proud to honor our #MVP @StephenCurry30 with a $10K donation to @nothingbutnets to help fight malaria. http://t.c… Lock in! #DubNation Thanks to my family at @UnderArmour for supporting the journey! #IWILL\n\nhttp://t.co/8Ay7MA7s6o @eefrehkeh yo that picture is classic man! Brian Johnsohn shoutout too hahaha @ClintSmithIII classic bro! Appreciate the love. Wildcats doing big things all around baby. Help me write a speech?  #greatdaytobeawildcat @DavidDTSS thanks bro!!!!!!!!! What Id do for that water bottle right now Lock in! #DubNation I mean this is straight comedy right now. Kimmel bouncing like its his fight. Hallelujah!!!! 😂😂😂😂🔥😂🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥😂😂😂😂😂😂😂😂😂😂😂 I love basketball @JenniferKeene !!!!!!!!!!!!!! Know my way home but just had @TheBlurBarbosa voice talk me home on the @waze app. Yall gotta check this out! “In one mile…keep it right!” @rdahlstrom prayers up! Looks like he has all the support and love Over there! Hope everything turns out great. #DubNation RT @DLeagueWarriors: FINAL BUZZER SOUNDS....WE ARE THE CHAMPIONS!!!! http://t.co/3RMXzHptP4 RT @ayeshacurry: Aprons launch tomorrow! Here is a fun simple lemonade video to share the aprons with you! http://t.co/LtJQV4Syyu Step 1 accomplished! Had to fight every night but proud of the way we stepped up. God is Great! Let’s go home and regroup. S/O to AD. Beast! Lock in! #DubNation Help support my splash brother @KlayThompson to win the season long #NBACommunityAssist Award.  RT to vote.\n#KlayThompson Lock in! #DubNation Lock in! #DubNation Lock in! #DubNation RT @TheBlurBarbosa: We still haven’t really done anything, we’re a team that not only want to get to the playoffs, but be a real force http… Lock in! #DubNation @brmckillop1 @bryantabarr I mean seriously? Major S/O to my man @MyNameIsBizzle. Released his #Not4Sale project. Gotta check it out and get the message out! http://t.co/Hs0bgmXlhH Congrats to my @underarmour Family Jordan Speith getting the Green Jacket at the Masters. Rewriting… https://t.co/r1PqqsdZT6 RT @foodandwine: Lifestyle blogger @Ayeshacurry on food, beauty &amp; olive oil. http://t.co/qspsHUfkox @StephenCurry30 @nba #FWx http://t.co/G… Lock in! #DubNation RT @UAGolf: 18 holes from history. \n\nClubhouse Leader: @JordanSpieth #TheMasters http://t.co/lsf2GZArNi @juliephayer thanks Lock in! #DubNation The Golden Bear really just hit a Hole-in-One down at the Masters par 3! Thats a dope moment right there #Legend Lock in! #DubNation Great to see @Yg_Trece back on the court! #WelcomeBackPG Happy Resurrection Sunday! He is Risen! Time to get to work and use the stage He's given for His glory! \nLock in! #DubNation @Englishscope24 come on man thats just a gentle fade with the driver there! no problem Lock in! #DubNation \"That ball didn't check at all. Just rolled up there like it was a Top Flite!\" -Johnny Miller 😂. I'm a golf junkie, thought that was funny remembering the work that was finished today! And the promise of the Resurection. Happy Good Friday to everyone. 1 Corinthians 1:18 RT @champssports: The @StephenCurry30 @UAbasketball Curry One \"Underdog\" is here: http://t.co/3mULMS3jii http://t.co/KuGqAMjnDY RT @champssports: The @StephenCurry30 @UAbasketball Curry One \"Away\" is here- http://t.co/yRe5kkKQkx http://t.co/w80YWVNTrv Lock in! #DubNation RT @ErieBayHawks: My names Seth Curry .. And I get buckets!\nCurry with 17 of the teams first 24 points. Wow. Lock in! #DubNation And in case you missed the March #SC30 announcement: @ExpressLife gift cards up for grabs http://t.co/7ixsJ6NEBM From earlier: \nI’ve teamed w/@CoachUp http://t.co/x9oWvvOLfZ \nMy story @TheCauldron https://t.co/2xIU3EccGX RT @nbacares: .@NBA players hit 992 3-pointers during #NBAGreen Week = 2,976 trees planted! @StephenCurry30 led the way with 24 3s! http://… Got style? Prove it in the new #SC30 contest. On the line: #ExpressMen @ExpressLife gift cards http://t.co/7ixsJ6NEBM http://t.co/iumOdIREwa I’m pumped to join @CoachUp to help athletes reach #AnotherLevel! http://t.co/x9oWvvOLfZ My story @TheCauldron https://t.co/2xIU3EccGX Lock in! #DubNation Lock in! #DubNation RT @AdamPDonaldson: A 3 month process but couldn't be more proud to release short doc on @StephenCurry30 &amp; @DavidsonMBB 2008 NCAA Run http:… Trying to do some special things this year and this is a great checkpoint along the way! Love this… https://t.co/wuotOPfMzD Lock in! #DubNation Each 3-pointer I hit during #NBAGreen Week = 3 trees planted! You can plant a tree just by using #NBAGreen thanks to @ArborDay! Lock in! #DubNation Earn style points this spring in new looks by @expresslife. I’m digging this limited edition #1MX… https://t.co/eWJOKmgfSE RT @andrewbogut: Sharing towels is nasty! RT @Sonny_k86: @andrewbogut haha too funny! #WarriorNation http://t.co/nSCvP13uRb Lock in! #DubNation S/o to @SteveNash hanging it up for good! Inspired me to play the way I do and paved the way. Congrats on all your success and enjoy life! Ps come on @DavidsonMBB Lock in! #DubNation RT @ATolliver44: Father, thank You for Your promises. Help me to be faithful, help me to be diligent to keep you first in everything I do. … @9thWonderMusic missed these tweets 😂😂😂 RT @SoleCollector: #NCAATournament #SoleWatch: @D_Jay24 wearing the 'Candy Reign' Under Armour Curry One. http://t.co/gTSwS3ipKA Lock in! #DubNation Lock in! #DubNation S/O to everyone that came out in Pleasenton to @champssports for the signing. If You didn't make it through the line I apologize. #DubNation Congrats to these guys for battling all year, accomplishing new heights and making it back to the… https://t.co/fIIm5mE0IB |LIVE NOW| #meerkat http://t.co/zhYK9wEPtv |LIVE NOW| #meerkat http://t.co/mnMlFoVg69 Lock in! #DubNation Sincerely appreciate all the Bday love and messages today! Whoever ordered this heat in the Bay for the bday I appreciate that too! #nice Happy birthday to all my fellow Pi Day people out there. Let's celebrate! 3.14! This could be @bryantabarr favorite day ever! #27 #sheesh Happy birthday to all my fellow Pie Day people out there. Let's celebrate! 3.14! This could be @bryantabarr favorite day ever! #27 #sheesh RT @JustHolla7: The Lord continues to step up for me. #alltheglorytoGod #blessed Watching this guy Delon Wright put on a show in Las Vegas! @DWRIGHTWAY1 look like that HS vid Coach Smart played #tbt #CurryOne #Underdog My wife @ayeshacurry *does* deserve a crown. #tbt to the #ExpressMen launch party that @expresslife… https://t.co/SPx7wgJ6Eb Lock in! #DubNation It's go time for @sdotcurry!!! Hype to see him back on the court. Hope the Suns let him rock and give him a chance to shine RT @nbadleague: Congrats to @sdotcurry on his Call-Up to the @Suns via @ErieBayhawks! \n\nSeason Highlights: https://t.co/j77njgJv5X | http:/… Lock in! #DubNation Lock in! #DubNation So hype right now. They picked us 12thbin the @atlantic10 preseason poll and now @DavidsonMBB are Reg Season camps. Ha! #TCC #MCKILLOP baby! Lock in! #DubNation I lean in to support my family. In for equality? Pass it on – #LeanInTogether\nhttp://t.co/C4ByRRqDUG Lock in! #DubNation Hey @hbarnes….”Who is he?” #AskHB RT @sydelcurry: Finding your wallet after it's been MIA for over 3 weeks is top 5 best feelings ever!! Lock in! #DubNation Lock in! #DubNation #CATSWIN staying atop the @atlantic10 RT @PlayStation: #PlayStationHEROES app now live on PS4: http://t.co/Pe9vHhwjCs Download &amp; find out how you could play w/ celebrities\nhttps… #RIPAnthonyMason played with my pops in Charlotte &amp; always treated me like his son when I was around. Prayers up for the family! Lock in! #DubNation Lock in! #DubNation Lock in! #DubNation Wait, the @Panthers released @DeAngeloRB????? .@JamesHahnPGA congrats my man! Awesome to watch you yesterday #clutch. Know that beer on the podium tasted extra good! RT @JamesHahnPGA: Wrote this inside my glove before I teed off yesterday. Got the idea from @StephenCurry30 @UnderArmour #begreat http://t.… 3pt MEGA DUNK like me in the NBA Backyard Sports mobile game! iOS http://t.co/D0JejOQKke DROID http://t.co/sGtP5MDnFI http://t.co/vPmNgQZIXQ @andrewbogut let me finish my meatballs bro Appreciate all the questions. Got to as many as I could. Off to Indy for this 6 game Road trip. #dubnation  And hey Chick-FIl-A, on my way!! @sml_23 this summer. Worth the wait! Got On stage with Kriss Kross hahaha “@danieelaa__: @StephenCurry30 favorite childhood memory? #AskSc30” @BeauBlakey The Count of Monte Cristo @westontow 67 .@IrisCurry30 The “Father to Son” and the “MI30” @karadanielle22 work an Iphone like she had one in the womb @rojus19 Phillipians 4:13 @Twitt3rSwift816 I have 0 Bars .@sthomas141 2nd String Punter @legit__prodigy Mostly 2 Ball Handling stuff. Got to be creative @sekctaco Crustacean for sure @addie_ohhh getting my first All-Star game win, and the lob to @swish41 @Nvmilit @Dlee042 @LatinAsian_ Shootaround, Lunch, Nap, and then head to the Game.  Simplicity is best @ASVP_Ryyy What else are we playing for? @lordflacko94 Highly Doubt it but I want to be involved in Basketball after I am done @i_am_mac17 Say I Won’t @Keron9Reed 37 lol  #PassFirstPG @sthomas141 @KlayThompson Gamer @OkayyTB Love it. Cant wait for next week.  Get to see family, old stomping grounds, and pick up some Maynard Candy @Rj151515 Freshman year at Davidson @lelz818 #AdrenalineRush @Trav20k not really. when i changed my shot in HS that was the hardest thing Ive done but never doubted the process @hillythree SPALDING! @kayla_kynard23 Never have a bad day! Ask @ayeshacurry its a lot of work especially for her with my schedule but its all worth it! .@dimes20012 Love them…of course lol! such a cool experience designing them not only for myself on the court but all kick lovers out there. @CTNxGaming “Are you Afraid of the Dark?” @jameschelseafc EITHER @TheBlurBarbosa or @andrewbogut @Raman_Dallas hang with the family, play golf, play golf, andddddd play golf .@XDOT30 Write on my shoes, Eat some fruit, No music really, play Lets go! Haven’t done a Q&amp;A in a while, so why not now? Send in any questions you have but make sure you use #AskSC30. Kick it off at 1230 PST #TCC http://t.co/fzyorrm6UV Happy Chinese New Year....................Lock in! #DubNation So much go through my head looking at this picture! RT@sallycc35: @StephenCurry30 First shoes arrival at Alma Mater http://t.co/8Lts98XFr8 #concernedCarolinaFan @hbarnes http://t.co/6ggo45AtMv Love playing @NBA2K on go. All-Star packs now in #MyNBA2K15 mobile app, get it &amp; cop my card: http://t.co/to6E5ng86e RT @ayeshacurry: New video is LIVE my fave go to salad featuring the avocado(my pregnancy craving) http://t.co/gJiaSnpEQT Me + @ludacris = Thanks for a really fun night, @expresslife! Visit http://t.co/0JmB7lcV8P for more pics… http://t.co/G3FdBcj5Le RT @iamjamiefoxx: Onto the stage enters the baby-faced assassin. Check out  @StephenCurry30's new @UnderArmour spot. #ChargedByBelief http:… Some pics from what was a great weekend http://t.co/ynFQjxIDdh Thank you to everyone involved! http://t.co/KofVPz4tp9 4th time's the charm. S/o to @klaythompson helping represent #dubnation! Grew up watching 3PT so this means a lot! http://t.co/6o7dvBUZcm Thanks for passing the torch Pops! Cool moment with him in the Hornet Uni #FathertoSon http://t.co/kSBhxhYSNK The professor is in the building. #SebastianCurry is checked in and ready to assist. #AllStarAssist http://t.co/FRRj3cKdG0 RT @AppStore: .@StephenCurry30: what's the longest shot you've hit? We're working on ours with @UnderArmour. http://t.co/QcgLRaIMLf http://… Attend my @ExpressRunway #ExpressMen launch party without snapping a pic w/the VIP entertainment? That's @ludacris http://t.co/Tw6MG9lfpY I can’t wait for #StateFarmSaturday Night! I’ll be shooting while #SebastianCurry hits NYC with an #AllStarAssist #ad Redemption time! The @footlocker 3-Point contest is tonight. Thanks to everyone who helped me train. #FootLockerThree http://t.co/aDqTtYhXYN Watch me take on @JohnWall for the  title of #GameChanger in The Battle of the Game Changers live 2/14 at 11AM on @NBATV #ad Excited to join @PlayStation to help raise money for charity through their new #PlayStationHEROES program #Sponsored https://t.co/E1gfy26nN9 Hope you fellas are doing something special for your lady not only tmw but everyday! Proud of my wife @ayeshacurry http://t.co/wXEm37Vkyn It's been a crazy, but fun day. This is the NBA Fit event http://t.co/MvJyza7P3y Thanks to @RobinRoberts &amp; @GMA for letting me stop by this AM! http://t.co/lcq4qMb4vN Watch Papa Bear @DC__for3 try to take me on during @footlocker 3-Point training. #FootLockerThree http://t.co/NPh666Nrul RT @UAbasketball: The #ChefCurry truck is about to roll out #NYC! Join us + @StephenCurry30 at the 34th St. @FootLocker tmrw, 9AM! #RIP to my fan and from what I hear a great human being @arabprodigy30, his wife &amp; sister-in-law. Horrible tragedy &amp; prayers to his family! Had a great time at @UnderArmour's \"The Book of Will\" campaign launch w/@iamjamiefoxx &amp; Kevin Plank http://t.co/E8arJpjznh Check out my Backyard Sports Mega Morph Super Hoop. The motorized rim expands/contracts! Watch http://t.co/TRmZQ63lXB http://t.co/ITPWQA7Tup Fresh cut with @themarcusharvey first thing in NYC getting ready for this weekend! More to come #blessed http://t.co/sm52AFW5uT My twin #SebastianCurry is heading to All-Star Weekend! He and the @SFNBA will be hitting NYC with an #AllStarAssist all week. #ad Gotta get my confidence back up after @Jaden_newman01 schooled me. Back at it. @footlocker 3-Point redemption. http://t.co/NZdPVfPulI RT @ayeshacurry: I cant believe it!!! #Littlelightsofmine is ONE today!!! It's been an entire year! https://t.co/y44kqwSGt2 Lock in! #DubNation RT @ErieBayHawks: .@sdotcurry has been selected to participate in the @nbadleague 3-point competition this weekend! http://t.co/pqCpPpF4Ql RT @DevonteeWOE: [NEW MUSIC] 'Bare Tings' my first single off of #DistrictVibe VIA @HotNewHipHop #BareTings http://t.co/h4oSCT0GRz • http:/… .@JohnWall Will the fan shot decide who will be named #GameChanger? #ad http://t.co/uh72rGZ89l \"Practice\" today..... http://t.co/BCEQPb31dE RT @Active_Faith: Why does NBA star @StephenCurry30 always point up? See his TESTIMONY episode http://t.co/AbfAdR1Zu5\n#InJesusNameIPlay htt… #GlutesActivated Lock in! #DubNation All of my Woe's they got Bare Tings @DevonteeWOE RT @KlayThompson: Thanks for all the birthday love. I'm thankful to be 25 years young doing what I love with great people around me! #feeli… I'm excited for this week &amp; amazing things coming from @UnderArmour w/the launch of my 1st signature shoe. #CurryOne http://t.co/X97KB5pQ0A Great time in NYC last night with my @underarmour family. Bowery Meat Company. @kgstoney, Kevin Plank,… http://t.co/vlde5IoiXW Today's the day. Get on the court, show your skill, and win some autographed Curry I's from @finishline http://t.co/1KrcNe3Fe4 #ChefCurry Lock in! #DubNation Lock in! #DubNation My @footlocker 3-Point Contest redemption starts now! @Kenny_Mayne thanks for the help! #FootLockerThree http://t.co/aDqTtYhXYN I'm seeing a lot of #TeamCurry out there for the Battle of the Game Changers. You ready to be a #GameChanger @JohnWall? Lock in! #DubNation Lock in! #DubNation Thanks to those who sent in videos for January’s contest. Even though February doesn’t have 30 days, we’ll do an #SC30, as always! January's #SC30 contest winners:\n1) @hp3_5 http://t.co/dUbwWqSlZ0\n2) @amoisant http://t.co/v904aNdJhJ S/O to @ThompsonScribe for helping me tell a little bit of My story, but most importantly my Savior's story.  http://t.co/njtCfvr5cU RT @LetsGoWarriors: By @DeAntae... Video: How I recreated @StephenCurry30's training with Accelerate Basketball Online  http://t.co/hM71gAS… 👀 unreal Before the Super Bowl, final\ncall for #SC30 entries http://t.co/XAk00VcYnD Lock in! #DubNation Reminder about this month's #SC30 contest http://t.co/XAk00VcYnD Lock in! #DubNation RT @ABOTraining: Winners of this months #SC30 contest will win an autographed photo of Stephen Curry! http://t.co/U6tUA8Gi08 Let's GOOOOOOOOOO! Congrats @KlayThompson making the All-Star team! Big time accomplishment my man. Going to be fun in NYC #splashbrothers .@JohnWall -   Can't wait to take you on at @DegreeMen's Battle of the Game Changers in NYC at NBA All-Star #TeamCurry Time for this month's #SC30 contest, ft. one of my drills on @ABOTraining http://t.co/Xmeistzo4u I'm teaming up with @MuscleMilk to host the #Beat30 nationwide 3-pt challenge. Support your city's participants at http://t.co/lUYpBycsUb \"Rise\" by @TripLee .... buy it here http://t.co/akYsEMZop1\n#116 #triplee Everybody needs to check out my man @triplee new inspired book \"RISE\"  uplifting and empowering for… http://t.co/nkLsjY6QG7 Lock in! #DubNation Ok @JohnWall, @DegreeMen, let's settle this - Curry vs. Wall - Battle of the Game Changers at NBA All-Star #ad http://t.co/HEslQ8ZSGn Not a surprise but Coach McKillop has our @DavidsonMBB boys primed for another great year, even in the A10...TCC http://t.co/TRirveg45o Congrats to Coach K, reaching that crazy 1k wins milestone yesterday. Learned a lot from you during team USA! Hoops Legend. #1KforCoachK RT @JustHolla7: All the glory to God! #DubNation thank you for being the best fans in the NBA Lock in! #DubNation TCC It’s a Great Day to be a #DavidsonWildcat @DavidsonMBB with a bigtime road win at George Mason! Thank you @DegreeMen for the NBA #GameChanger love – I always push myself and go out there every night for the fans. http://t.co/KUf3Z52peL RT @hbarnes: Had to hit him with the shower!! Geeez @KlayThompson #NBABallot\nhttps://t.co/cpE9cFB6b8 Still in shock! This guy @klaythompson was unreal tonight! 37! 37! 37! If he's not an All-Star next… http://t.co/UbyDRB00Fg Lock in! #DubNation When you look your best, you feel your best! \nCheck out the fresh new suits @ExpressLife just dropped. #Back2Business http://t.co/oHpRtBLiT8 Have to Thank my teammates and coaches for setting the stage and letting me be who I am and who God made me to be! More work to do…. Truly honored … again. Thanks everyone, especially #dubnation http://t.co/3nvwtM1UjU Congrats to my bro @Dlee042 reaching 10k points tonight! Big time accomplishment! Lock in! #DubNation RT @ayeshacurry: New video is LIVE! Pancetta and cheese waffles. http://t.co/FagRGpZHox RT @DavidsonWildcat: Davidson Knocks Off No. 22 Dayton, 77-60 http://t.co/jK6cZwU9DX @laurenbiggers the D Block energy is piping through the TV too Davidson Bros Take Icing FT Shooter to New Level (via http://t.co/ewa4VnMsOO)......yep that's my school right there! http://t.co/UH4SrMNaLY 👊👊👆…🙏 Lock in! #DubNation Remembering Dr Martin Luthr King Jr. Today &amp; everyday for his vision, passion &amp; commitment to change or society for the better. Thank you! Lock in #DubNation @Englishscope24 play it as it lies Kim! Lock in! #DubNation Lock in! #DubNation Still on cloud 9! #Feb13th #IWILL #CurryOne #4:13 #whydotheycallitcloud9? http://t.co/8qSSz0CODQ Lock in! #DubNation Proud of these boys so far….right where we want to be. Defense stays solid and Cam will give us a big play and we win this #KEEPPOUNDING True! RT@AaronCurry51: Right now in that stadium you cannot hear the person next to you w/o screaming at a whispers distance Big time answer TD right there by the @Panthers! We are here to play baby. I’m gonna lose my mind by the end of this! http://t.co/XnfmUjXqKP and for the next 24 hours...Lets Go Panthers 😂😂 I do really like the chicken though RT@stanverrett: @StephenCurry30 @UnderArmour chicken curry in the cafeteria tomorrow! Again! Great win tonight #DubNation! Thanks to everyone involved for supporting me, @UnderArmour &amp; the #CurryOne. Made this a very special night! 🙌🙌 RT@MarkJackson13: Thank U for all the Love tonight!!! Lock in! #DubNation S/O to @markcurry for hosting my shoe launch today! Keeping it in the family lol. http://t.co/mYdpQ0om74 On my way to unveil my 1st signature shoe with @UABasketball! #CurryOne http://t.co/NNJ9qESn6W Lock in! #DubNation Lock in! #DubNation Always loved the feeling turning on SportsCenter and seeing @StuartScott as the anchor. Always Inspired passion and paved a new way! #RIP Jack Gibbs putting on a show for the A10. @DavidsonMBB showing out for the new conference. And….not tweeting anymore after that one smh These boys are on one right now! Go time @panthers. Lets Take care of our business. Know BofA Stadium is rocking right now. #KeepPounding http://t.co/20HBitAyON Lock in! #DubNation RT @nbadleague: Step-backs galore...Watch @sdotcurry's Top Plays of December: http://t.co/gvBaaZhIKZ http://t.co/NdMi7QoSUG Happy New Year everybody! Hope it was a safe 1 last night…eyes forward on getting better in every aspect of life in 2015. Ephesians 4:22-24 Ready to ring in the New Year in style in my @expresslife #1MX Can't go wrong w that! Have fun &amp; be safe out there everyone. Happy New Year! Have been meaning to get to this - \nThis month's #SC30 contest winners: @keilamahaha &amp; @SEM_Expert. \nCongrats &amp; thanks to all who submitted! Last time in 2014. Lock in! #DubNation RT @nbadleague: Seth Curry with the shot\n\n@Sdotcurry's season shot chart for @ErieBayHawks (52.8% FG, 52.9% 3PT) http://t.co/rhLLAbq3uq I can do all things… #MotivationMonday http://t.co/Wh5calZAXm That's all!  #KeepPounding http://t.co/TvU0eFocIt ICYMI: December's #SC30 contest http://t.co/jEjra8libg Lock in! #DubNation RT @ABOTraining: What are you doing to improve your game?  #TrainLikeAPro with @StephenCurry30 http://t.co/W0hWxQkML1 Introducing: December’s #SC30 contest http://t.co/LxaTwDR5Fb Excited for my twin Sebastian to be teaming up with @CliffPaul in the National Bureau of Assists. #SFNBA http://t.co/G31q6l3mLp Lock in! #DubNation Merry Christmas to everyone! Hope you enjoyed yourself and remember the Birth of our Lord and Savior! Tell me what motivates you and tag @Eastbay for a chance to win these items, signed by me #ClutchLikeCurry http://t.co/ybFU9h87kh Proud 2 announce I’m the new brand ambassador 4 @ExpressLife! Let’s get #Back2Business http://t.co/glnfvwKta7 EW! Lock in! #DubNation Lock in! #DubNation Check me out on the upcoming @Eastbay cover! Stay tuned for the #ClutchLikeCurry sweeps to win gear signed by me. http://t.co/Sig3syu5ik Lock in! #DubNation @byronjr23 pulling into arena…let me get some peanut butter balls my man Lock in! #DubNation RT @ABOTraining: Find new ways to challenge yourself.  Your improvement is measured by the length of time you can perform in challenging si… Let’s Go Jay! RT@GrahamGano: So is it safe to say that all @Panthers fans are @ChicagoBears fans tonight? @andrewbogut @DayneTrosclair ✊ Respect Lock in! #DubNation Lock in! #DubNation RT @NoiseyMusic: Whether producing for @StephenCurry30 or rapping alongside @KDTrey5, @DevonteeWOE is working. http://t.co/CvQsBG1pxU http:… S/O to my bro jgtradition and his shop @jgtradition for the new gear. 🔥🔥 yall peep that ugly mug on… http://t.co/locSZIPwz7 Need some help from you guys. If you live in the Bay and have UX/UI app development experience, fill out this survey: http://t.co/P8LmfOr02g Look who’s the cover athlete for Backyard Sports NBA ‘15!  Played as a kid, psyched its back! https://t.co/RSL6hTM4tv http://t.co/FKkdVXfcrm Lock in! #DubNation #ICANTBREATHE What we know about autism is not enough. Support @autismspeaks #MSSNG by removing letters from your handle http://t.co/OuhbqWFWq9 Lock in! #DubNation Practice in Chicago before we head to Minnesota....caption this lol @money23green and @klaythompson http://t.co/OWT173LgJk Lock in! #DubNation Lock in! #DubNation RT @DavidsonMBB: We're keeping the #HornetsNest Trophy! #Davidson 92, #Charlotte 86 #catswin #catsarewild Gotta win them all sorts of way. S/O #DubNation for bringing the energy tonight. We needed it! .@dmar @Mospeights16 not a bad idea thee Dmar Lock in! #DubNation Stay tuned for \"Chef Curry\" remix. She is about to spit Hot 🔥 #lastshmoneydanceforme http://t.co/GKragesGiY #NBA2K15 is basketball goodness! Have you picked up @NBA2K yet? #YourTimeHasCome on #CyberMonday In honor of #GivingTuesday, I will #GiftANet through @NothingButNets to each of my @Warriors teammates. http://t.co/ySScJGpkJN @DavidDTSS 😂 RT @Active_Faith: NBA Superstar @StephenCurry30 talks about what wearing the #InJesusNameIPlay band means to him. Check out video here: htt… HOME!!! Lock in! #DubNation “Look! I am sending my messenger, and he will prepare the way before me. Then the Lord you are seeking will suddenly… http://t.co/tWpyk0eaBu Try one, of my many drills, http://t.co/k72CCLa4Qg from http://t.co/xtL3LHrN2E #ABOTraining #TrainLikeAPro Picking #SC30 contest winners now. Thanks for all who entered — it’s great getting these contests going again .@tphillss way to hoop today my man! Congrats on the win #NBA2K15, family, friends, food and basketball goodness! Have you picked up 2K yet? #YourTimeHasCome http://t.co/LYkPhKdW9z Just a shot out to @Mospeights16….Buckets!! RT @ABOTraining: Great to see @StephenCurry30 tonight and all his hard work paying off!  #EarnedIt http://t.co/FOM9qOOcc0 Coach Riley: \"Daddy, why did you miss 9 3s?\" http://t.co/dhyazZof1Z Lock in! #DubNation #dubnation make sure you wish a Happy birthday to @TheBlurBarbosa and @andrewbogut!!!! #SC30 contests are back -------&gt; http://t.co/lMZ0zxb9dD Checkout my man @COSeezy and his new show @KicknIt_ http://t.co/KG9xEp4HnI First episode 🔥🔥Talking UA ClutchFit and I Hit the shmoney! Happy Thanksgiving to everyone and their families! Be thankful for what you have. In everything give thanks to God for all of His blessings! @DudePerfect lets do it! This crew is wild! Good times on the way to the Queen City Charlotte theblurbarbosa @dlee042… http://t.co/RKMWFs3g3F Congrats to @DavidsonMBB getting the win at UCF! Heard Gibbs went off! That’s an Orlando sweep and back to Charlotte for thanksgiving! #TCC RT @ayeshacurry: An early happy thanksgiving from Little Lights Of Mine                                 https://t.co/0fHP4x7nqa Lock in! #dubnation Lock in! #DubNation RT @Baron_Davis: We should be sending all our energy and love to the Brown family!!!! \n\ndo something positive and selfless rt now \n#lovetoT… \"Chef Curry with the Pot\" aka  ishiboolovesyou has a new Olive Oil now For Sale on http://t.co/K8tVYRXgqV ...… http://t.co/69pRAQEjiT @thenivenulls good to see you guys. Thanks for coming out! RT @Mitchbballin24: Good to catch up with @StephenCurry30 after the game tonight! 10-2 start for a franchise record! #Splashbro http://t.co… @COSeezy 😂😂😂😂😂😂 Lock in! #DubNation Lets go @DavidsonMBB. Time to take care of business so I can talk soooo much trash to @hbarnes this year. Great Day to be a Wildcat! Lock in! #DubNation #HTGAWM wow RT @UAbasketball: Elevate your game.\n\n@StephenCurry30's #ClutchFit Drive PE drops on 11/22. http://t.co/iuFtKWqPZf Real Life #AskBogey RT@andrewbogut: Catching Bart home from SF with my PG @StephenCurry30 #rushhour #packed http://t.co/goY26yvRvZ Quick Bart ride back to The Town with @money23green andre @klaythompson and the rest of the fellas… http://t.co/uwH0ukhip2 Unbelievable Day shooting with iamjamiefoxx and uabasketball for the Curry 1 Signature Shoe coming… http://t.co/8ARb9HtB0y @CoachCT22 Happy Bday bro RT @GolfDigest: NBA star @StephenCurry30 makes the classic good-player mistake – his timing is off. The fix: http://t.co/JNMaxiYmLf Great night in LA with some great people! #blessed ishiboolovesyou kicknitcoseezy @kgstoney tricia002… http://t.co/ekVdkq1wP2 Lock in! #DubNation Lock in! #DubNation @WoodlandJK8 very nice! Lock in! #DubNation Happy 21st birthday to the now big cousin @LexusSafford! Hope you enjoyed the day! Proud of you and love you! Lock in! #Dubnation Thanks to all the men &amp; women serving &amp; protecting our country. Happy Veterans Day. Support @ThanksUSA 2 honor their families all year long! Lock in! #DubNation Big win in Houston tonight! Quick turnaround, have Phoenix tmw and try  and keep this train rolling! Lock in! #DubNation Thanks for coming out to the #OWNNOW cycling event, Bay Area! Follow @KPOwnNow for more great events &amp; healthy tips. http://t.co/3RajQ59728 Lock In! #DubNation Big time win on the road tonight. Could name each guy individually &amp; how they helped win that game. But @KlayThompson…wow! Lock in! RT @BleacherReport: VIDEO: Watch terminally ill cancer patient Lauren Hill score in her college basketball game http://t.co/ZQjn1g8lhD http… Join @CP3 and I to #OWNNOW at the @KPOwnNow cycling event with @Flywheel on November 4th. See you there! http://t.co/wI00lV6LCu Yessir! Home opener. Lock In! #DubNation S/O @KlayThompson getting that extension! Happy for you bro. Well deserved. Splash bros continue My Home &amp; Away @UAbasketball #ClutchFit Drive PEs are dropping Saturday at @FootLocker &amp; on http://t.co/RrmIsIiQ9t http://t.co/eoEVcDliFU @TripLee #risenow http://t.co/rXLdACOQT5 Checkout my man @triplee and his new album \"Rise\". Powerful call for our generation to Rise up and… http://t.co/3qu3ioTVEF Pumpkin Patch kind of Day with my ladies! I got a nice workout in following baby girl through the… http://t.co/nbX2seb0hM A lot of fun in the Bay Area tonight. We got the win in Sac and the @SFGiants make it 3 rings in 5 years. Congrats! Lock in! #DubNation Praying for the best and a speedy recovery for Julius Randle! Never want to see that happen to anybody…. Galatians 5:1 It is for freedom that Christ has set us free. Stand firm, then, and do not let yourselves be burdened again by a yoke of slavery. Lock in! Parents up in Blacksburg supporting their alma mater Virginia Tech and #hokienation ... Idk what the… http://t.co/IX6729nOZz S/O to #DubNation again for the great atmosphere for a preseason game. Heard it was a sellout. We appreciate it…Keep the streak going RT @warriors: Great to have you back out there, @fezzyfel! #FestusBDay #DubNation http://t.co/Gc4kxCX3Dg So hype to get back to the best fans in the league #DubNation  Lock in! Happy 20th Bday to this cool kid right here @sydelcurry. Baby sis all grown up. Enjoy yourself today… http://t.co/0DwKQLUUSS My daughter loves yelling out \"Mommy's car?\" \"Daddy's Car?\" every time we leave the house to go… http://t.co/0quXJbH3qS Cool to see a State behind one of their own @hbarnes #BlackFalcon http://t.co/moALaBzRJM Lock in! Des Moines, IA style The process leading up to The Moment is just as important as the shot. #UAClutchFit #IWILL\nhttp://t.co/YR5eA8rArn http://t.co/utJNDMLfxb Lock in! Wow!! Over here cheering for a tie like soccer but we’ll take it. You have to catch that! Ahhh Gotta go gotta go gotta go Oh! Just setting up the dramatic scene for Cam once again… Kelvin…. Yessir #RiverboatRon. Big time 4th down conversion. Kevin Benjamin is beast too Hype for the season to start. #EverybodyUp http://t.co/EMGaa3hMah Lock in! Starting our new journey tonight. 6th year in and feeling blessed to lace em up for #DubNation. Let’s go…… LOCK IN! Today is the day #NBA2K15 drops. Pick it up today and start crushing w/ my Warriors! @NBA2K #YourTimeHasCome http://t.co/cDIlhPSFug Today is the day, #TrainLikeAPro with me at Accelerate Basketball Online, @abotraining, http://t.co/RMbUqbAr6Y http://t.co/O2ahTRSQDw @MitchAherne6 glad you like it man. Myself &amp; @acceleratebball have put a lot of work into it. Share the word and keep working! @ABOTraining Accelerate Basketball Online launches tomorrow! #TrainLikeAPro with me @abotraining http://t.co/gp9WiWBluM Any @SFGiants fans watched every single pitch of this game? Me as I’m typing…HR!!!!! To be a fly on @Dlee042 wall right now #Cardinals Day 2 of Camp... keep working #TrainLikeAPro with Accelerate Basketball Online @abotraining http://t.co/VFAp30cQRq Good way to end the summer and recharge w/ ishiboolovesyou  #vacation #the50thState http://t.co/QWqlxdB2sf Thanks to everyone that made the 4th @thanksusa Golf Tournament a huge success. Continuing to support the active military and their families Just finished another great year of procamps in the bay area. The energy was great all day. Parents… http://t.co/fb4fRZv24g #firesidechats with ishiboolovesyou http://t.co/MUZ0BqrzO5 RT @lecrae: It's a lot to take in. I haven't had time to download it all. I am so grateful for the support. I know… http://t.co/RL3L77Gdx3 Had a blast! RT @stanverrett: The star of our latest \"this is sportscenter\" commercial. @StephenCurry30 coming soon! http://t.co/Bkww9yJ6SQ Lacing up the UAs to get a workout in w/@abotraining http://t.co/itZDhmi9s1 #TrainLikeAPro \nhttp://t.co/beHinFgmoh is coming October 2014 RT @ayeshacurry: New video is LIVE! If you missed my @KPSCALnews event you can catch a snippet on video here! http://t.co/Dn4uyibIJX Welcome to the @underarmour &amp; @uabasketball squad @emudiay7!! Know you have big things on the horizon… http://t.co/fGpgpnFIW8 Man that was fun #finallyhome #memories http://t.co/CtZbfW4J0o RT @TheBlurBarbosa: Congratulations @StephenCurry30 and @KlayThompson for the @fiba Basketball World Title! I'm very motivated #DubNation h… Hilarious Team USA #ShmoneyDance https://t.co/1UJ1Jtpvv3 And the @Panthers got a win today and 2-0.... Yessir #todaywasagoodday Crazy as it sounds. This crew is the First ever 2 time Back to Back USA World Champions. #history w/… http://t.co/nxvwJkDPq3 Lock in! @beallison thanks boss. Haha great to see we've grown up a little bit from that picture @debrooks_XXIV lol that's so true bro. I keep checking the bottle every time I drink powerade trying to figure it out Had a blast with ishiboolovesyou tonight watching Real Madrid play.  They lost to Atletico Madrid 2-1… http://t.co/6jagHAo7Ov Yall aren't ready for the \"HELICOPTER\" lol RT @nedovic1624: Better be ready for tomorrow fellas 👀😂 @KlayThompson @StephenCurry30 RT @sdotcurry: Congrats to my bro @MrAnthonyMorrow on his induction to the CLS Hall of Fame! Used to be tuned in as a young 7th grader watc… Remembering all the families that were impacted that day. We are playing for you guys tonight… http://t.co/mZBclFkyKz RT @DavidsonMBB: Article by @davidscott14 on @DavidsonMBB alums playing professionally overseas! \n\nhttp://t.co/b9koS0OhA3 Lock in! Jet Ski boys in Barcelona on the off day! #wedidnotfollowtheguide #myengineoverheated #myarmsareonfirenow http://t.co/TepMhZbkdu S/O to VT Hokies Football for taking care of business last night. Great way to start the season. Now @Panthers to your turn. #KeepPounding Lock in! RT @ABOTraining: #TrainLikeAPro with @StephenCurry30 #Coming October 2014 Sign-Up for our mailing list at http://t.co/30dVRaegck Lock in whenever you have an opportunity to improve! #TrainLikeAPro @abotraining http://t.co/dCRCeElNG7 #comingsoon http://t.co/bOYNN8sjin Lock in! Lock in! On to the next one! http://t.co/qeSWCkkxTS Lock in! RT @CelebIntelUSA: Former basketball star @DC__for3 launches @jumpshotgenie app and website to help players become better shooters - http:/… @RealNTurner @bomani_jones not into Twitter \"beef\"  but had to say something. Carry on @bomani_jones haha respect @bomani_jones yeah the KD mention about my shoes. saw u just RT'd a line but didn't like the slander of my kicks like we're non factors Not always pretty but we got the job done tonight. Good test to deal w/ adversity &amp; stick w/ the program. Gotta start better next game #USA @bomani_jones dang man why you have to come at me like that? Don't hate on what you don't know about Lock in! Lock in! #NBA2K15 is going to be FIRE. Just like my jumper. Watch the new #YAKKEM trailer http://t.co/39uOn0vqEq @NBA2K http://t.co/pNglZJ2weC Lock in! Morning Grand Canaria! #God'sCreation http://t.co/zhwrmML3Ea Sending love to my wife @ayeshacurry sharing healthy cooking and lifestyle tips today in the Bay Area with @kpthrive http://t.co/m3XYTsjI5D Great time making this #UAClutchFit video! Preparing for the moment when everything hangs in the balance. #IWILL http://t.co/4oIzluHkdV Honored to be apart of this group. On a mission #USA #alltheway http://t.co/667jU0xB67 @MarkJackson13 Thanks Coach. Happy birthday to the bro sdotcurry. Been pushing other forever to be better and its Amazing to see… http://t.co/dyET9RvRQm Lock in! The top HS talent are competing this weekend in Brooklyn. Check out the #Elite24 Aug 22 &amp; 23! @UABasketball http://t.co/kJUQL3XBRI Lock in! people. I Truly appreciate the love and support. #IWILL (3/3) there. Sry if you were left waiting outside. Hate that people were upset and caused some damage, but there were just too many (2/3) Thanks to everyone that came out to UA Brand store today. Tried to see and meet as many ppl that we could in the 2 hours I was (1/3) Heading out to the @UnderArmour Brand House. Come by from 6-7pm! 583 Broadway in NYC. http://t.co/RWsDTduAkX Had a great day with the Cadets of the US Military Academy at West Point. We saw survival swimming,… http://t.co/sLvP8t9T3K My away #TeamUSA ClutchFit Drives are launching tomorrow too! http://t.co/JUlbPWR0ur This exclusive colorway of my #TeamUSA ClutchFit Drive launches tomorrow! http://t.co/YquJVusgNS 2 days until I see you all at the @UnderArmour Brand House in SoHo! 583 Broadway from 6-7pm http://t.co/b8AVu3pDY4 Lock in! GAME DAY! http://t.co/qeqelbxDtM #alsicebucketchallenge with husky4lyfe22 @jharden13 @demar_derozan @boogiecousins @kennethfaried35...… http://t.co/SjxlQ53Je5 Team USA #alsicebucketchallenge... We all were challenged by somebody so we did it together.… http://t.co/Z2iyCaYFUs Check it out RT @sn_nba: How to train like Stephen Curry and @acceleratebball: http://t.co/VoU1AKwebR / http://t.co/cuwYfriVuB Come join me next Tuesday in NYC at the @underarmour Brand House in SOHO. I'll be hanging out with… http://t.co/fQZOfvaUYW Hey @jimmyfallon...snuck into your studio for our interview but you stood me up. That's messed up man!… http://t.co/sY52zUMrNx That's funny. Anything is news these days lol All dressed up celebrating a great couple tying the knot today. Congrats to @DWRIGHTWAY1 and @mio_mayo… http://t.co/Y5IqOHqlHU The grind never stops. I'm constantly finding ways to improve my game. Now you can too. Checkout http://t.co/RMbUqbjo4Y  #TrainLikeAPro RT @ayeshacurry: Inspired by this movement of WILL. Proud to support @UAWomen and @mistyonpointe on the launch of #IWILLWHATIWANT.   http:/… Get behind @MyNameIsBizzle &amp; the #WellWishes project!! Get your copy now or Donate Directly at http://t.co/X0NWpgCikb Pray for PG and his family! Pray for the Doctors overseeing his recovery and that he comes back stronger than before. #USA Magic Man! Great show @D_Copperfield http://t.co/gLx31DXwXl @tdwags13 haha That pic Is hilarious Great night in Vegas with @ayeshacurry getting some legit Italian cuisine. Thanks to \n@giadaVegas for… http://t.co/5Bunty25xk Check out the new video. #smellgood RT @ayeshacurry: New Video is LIVE on my channel now!          http://t.co/ourOvIJ30J RT @ayeshacurry: New Video is LIVE on my channel now!          http://t.co/hcNkFJVfwL RT @ayeshacurry: Hey guys do you realize that I really am \"chef Curry with the pot\"? Haaaaaa! @StephenCurry30 Major S/O to @uabasketball for the kicks representing #TeamUSA. Clutch Fit Drive series and the red… http://t.co/l47GceJWlx Had a great time this weekend at @palazzovegas! Check out @topspincharity to find out more about the kids they help in NYC! #TopSpinLV Good way to end the 2014 summer golf tour in Vegas w/ @kgstoney Time to hoop with Team USA. #golow http://t.co/g0k8cGNLA7 Had a great time this weekend at @palazzovegas! Check out @topspincharity to find out more about what they do! #TopSpinLV Ready for @TopSpinCharity. @Vegas is my spot! Who’s coming to see me @PalazzoVegas @LagassesStadium? http://t.co/1ty0ugmyo6 #TopSpinLV All-Star Steph Curry Goes 1v1 in Film Room with Nation's Top SG Malik Newman via @bleacherreport http://t.co/GxlTiQd9mP I'm helping an awesome charity this weekend. If I were you, I’d go like their Facebook page –  https://t.co/Z7Xb83fzXV #TopSpinLV I'm helping an awesome charity this weekend. Go follow them and like their Facebook page @topspincharity! Let's play ping pong! Come see me at @TopSpinCharity @PalazzoVegas http://t.co/lYRC2lwpaO #TopSpinLV RT @NBATV: .@NStauskas11 watching the game. #NBASummer http://t.co/FQz63B2ueL Happy Birthday to my beautiful daughter! She's blessed us with so many laughs and memories so far and… http://t.co/0KyDPj21zo Had a blast with @BOOMco_official and @RudyGay22 the night of #KidsChoiceSports! This challenge was insane: http://t.co/0GHv646AJq #ad Practicing to become #BOOMco Blaster Champions. Sorry @RudyGay22! Tonight - #KidsChoiceSports : It’s going down! http://t.co/HyKlJiYsgK #ad You know just getting a swing tip from Hank Haney getting ready for the @acchampionship in Tahoe.… http://t.co/IJTNYfC7j4 Who will be crowned #BOOMco Blaster Champion? Tune in to watch me &amp; @RudyGay22 battle it out the night of #KidsChoiceSports! #ad #RedWhiteandBlue http://t.co/CuaIpNWU5D Happy Independence Day! Love this country. Thanks to all those that serve and protect for our freedom.… http://t.co/INk1IV1HO2 @Bones_Official we definitely did my man. Appreciate the hospitality at the Fairmont. Hope to come back and play the Course soon. Take care Had a great time playing with SF City at the Pro-Am tonight. Crowd was crazy. Appreciate the love… http://t.co/zxF8bdt61e First UA SC30 Select Camp in the books. These boys grounded and competed all week. #IWILL http://t.co/ouN6ojrKgi Prepare like it’s the last time you’ll play this game. @UAbasketball #SC30SELECT #IWILL http://t.co/20q9R97UnY And thanks to chipotle for sponsoring the event and feeding the crowd! http://t.co/51mB1DO9pT So honored to cut the Ribbon to the new UA SC30 court in Alameda,CA. Had my select campers there to… http://t.co/yUJehSJCus Almost that time for my first UA SC30 Select Camp. Can't wait to see how these campers work and get… http://t.co/rdjlNWmytZ Back in the States after a great trip to Scotland to celebrate my Dad's 50th birthday. Unbelievable… http://t.co/hOXz8L43rB This Sunday, I'm showing 20 of the top young guards what hard work means at my 1st #SC30select Camp w/ @UAbasketball http://t.co/lydSTx1btb Taking Pops to the official home of golf! http://t.co/TqoMEZDeiI TBT hilarious pic of @whitelobstah24 and I on the first day of college back at Davidson. #Jorts http://t.co/QL1ME3NwiU AMERICA! Sorry to blow up your feeds. Last one for a bit - group shot from the @curryclassic http://t.co/Et3duLELrH Great belt on pops. @underarmour #curryclassic http://t.co/rfSdsBuMxA One of my favorite signatures every year. #curryclassic http://t.co/sLHO0eJaHN Gear's ready for the @curryclassic http://t.co/9EifHJBYnl How's the swing look? http://t.co/lcJeHdZbEl Celebrating Father's Day and my pops 50th birthday in Charlotte. This man taught me everything I know… http://t.co/D99PgfuBWx Bogut Talks Up Sterling-Inspired 🗽🏫🚁Protest (via http://t.co/jfIZEY1p1V🚁) http://t.co/RC8xTJWMmO Summer is here and time time to #Outworkeveryone #UAbasketball\nhttps://t.co/1ttv2qDbYf RT @ATolliver44: Man this school shooting stuff is getting out of hand! Kids cant even go to school and feel safe anymore SMH. #Godwatchove… Quick Halftime beatdown!1-0 against @nedovic1624 #fifachamp #chelsea http://t.co/3yoOZ07kyN #Anomaly http://t.co/H175ViktWo My kind of breakfast. Beignets, French Toast, sausage and Egg Pizza. #bringontheitis http://t.co/6uy2EOKHiX Tune in to @jimmykimmel  tonight after the game and watch us play one on one. Lots of surprises in store. #westcoast Good to see my man @fezzyfel in the Office today. Said I need to step my instagram game up. #stophating http://t.co/VvtplhOhbp #AllinforDavidson @Dlee042 thanks bro. .@MarkJackson13 thanks coach. Been too good! Still some spots open for my #CLT-area camp w/@acceleratebball later this month http://t.co/Y8S2bamBsb We're still accepting signups for my Charlotte-area camp on June 18. Interested? http://t.co/1XRB4nb0fb Just want to thank those that voted for me and #KiaCommunityAssist award. Blessed with a platform and great ppl to work with along the way! RT @IJDP: Come tee it for @AdaJenkinsNC June 16th with @StephenCurry30 in the 2014 @curryclassic at River Run. Foursomes almost sold out. New experience. Kitchen has turned into a Honey Harvesting site. Had about 30,000 honeybees in a hive… http://t.co/4GHhzVtw45 @Mooresbarber thank you. Taking time 2 thank all men and women that paid the sacrifice 4 our freedom. Heroes in my book and proud to support them and their families My annual #CLT-area basketball camp is June 18. Info, signup, etc: http://t.co/9haGMWoc0M ———&gt;  RT @IvesterJackson: Excited for 2014 Curry Celebrity Classic! Great sponsors! @AdaJenkinsNC @curryclassic http://t.co/6VW0XzFGfP We're just under a month away from my camp w/@acceleratebball. Interested? http://t.co/ZVjXWt0laB #gonefishing for about 2 weeks already but this makes it official http://t.co/7yXX9uZvRb Quick little #40yarddash vs @ayeshacurry at the @underarmour headquarters in Baltimore. She ran… http://t.co/cBTeZZQ6Kr @calisportsguy lol na. Same jacket. Switched the shirt and the tie. Threw on some slacks. But I'm def Not the one &amp; done type with wardrobe Great time with @ayeshacurry @kgstoney at our first Preakness. California Chrome was moving! So cool… http://t.co/UTXaBAR15J Just went through the @underarmour Brand Store to see the UA family. #IWill http://t.co/TWpS9so86V The Hoops Whisperer by @idanwan will inspire u 2 find your own amazing. A great book about faith, love &amp; d... http://t.co/vX8Y1BKDU9 RT @acceleratebball: Want information on @StephenCurry30 @SC30SkillsCamp this June?  #constantcontact http://t.co/eB8LDrsEZO Best 2 Mom's I know. THANK YOU for all you do every single day! http://t.co/4QEBhEDJrL Happy Mother's Day to all the beautiful mothers! So blessed to have been raised by such a strong &amp; wise woman! #Love http://t.co/FVqEwuYRdm Following the stream and the countdown to the Cowboys picks has been hilarious!!! \"Do it for the vine, Jerry!\"  Hahaha @gordon770 yessssssss. Can I use that? @SLDSNK32 unfortunately it's officially the offseason @gordon770 never .@SJEarthquakes thanks for the hospitality. Had a great time. BTW @ClintIrwin you're a beast http://t.co/EnoEMRK2BB .@mattchillbreezy that's a staple of the Davidson experience. Only used it for 3 semesters but hate to see it go! Get 2 work students #Downy Happy 65th birthday to my amazing Grandma Candy. Strong and beautiful. She holds it down for me and the family http://t.co/qJEfkyNW5I Rough day out her but have to congratulate @KDTrey5 on his well-deserved MVP! Seen him work in offseason &amp; that Amazing year is no surprise Hate leaving my family when I’m on the road but at least I have @Netflix to keep up on my shows. Check out my faves @ESPNMag avail now Lock in! #dubnation Thanks #dubnation. One more! Lock in! #dubnation She's back at it...Check it out ppl! 👍 RT @ayeshacurry: New video is live on my channel featuring @TheOrangeChefCo ! http://t.co/VX25VRj4R2 Lock in! #dubnation Happy birthday S/O to the old man @Dlee042. Keep pushing that Rock! 'Standing ovation' for Commissioner Silver. Big time decision standing up for the league and it's players. Now, Gotta see it through Lock in! #dubnation Lock in! #dubnation Lock in! #dubnation Lock in! #Dubnation RT @acceleratebball: Registration for @SC30SkillsCamp will be open this Saturday (4/19/2014). Register online at http://t.co/ktnhXJRusc RT @ayeshacurry: New Fitness Friday up now!  I'm sharing a super quick and easy lunch recipe! https://t.co/J1zzwR7lnI Amazing narrative by My fellow #DavidsonWIldcat @ClintSmithIII as he talks abt his kids and the potential they have http://t.co/JleH4wm8DR Check out my man @mjjenk doing his thing this year out there http://t.co/YiQiyRRluf RT @AmericanExpress: Brothers @sdotcurry and @StephenCurry30 chat about the road to success in basketball. http://t.co/o9oWY2w5Q9 #AmexNBA Thanks to everyone going out &amp; supporting the @UAbasketball movement today. \"Blue Splash\" at http://t.co/D9mWULoFHU and just the beginning! Congrats bro RT @DevonteeWOE : Hold That, http://t.co/CblF8VP4Z5\n\n|| Devontée By Devontée EP ||\n\n#DevontéeByDevontée” RT @footlocker: EXCLUSIVE! The @UABasketball @StephenCurry30 \"Blue Splash\" PE drops this Wednesday! DETAILS: http://t.co/fVOOjqTLnW http://… Need to head over to the @StateFarm office soon to see some friends. I have someone to introduce them to. S/O to #dubnation @MarkJackson13 and all my teammates. 50 wins is special &amp; can't wait to start this playoff journey. One more game to win! Lock in! #dubnation Lock in! #dubnation @Mospeights16 playing that aggressive music on the bus! This weather is nice! S/o to @UnderArmour own @JordanSpieth holding a share of the lead at the #masters. Get that Green Jacket tmw! #IWill Just landed in Portland. Who y'all taking in the fight tonight? Hey @CP3, can you ask @CliffPaul for those glasses he promised me All-Star Weekend? A bet is a bet and I made that parking lot shot fairly. RT @Mospeights16: Yessir!! 2014 playoffs!!! S/o to coach @MarkJackson13 for leading us  threw all the bs that's been around us all year!!! … Lock in! #dubnation Little bro @sdotcurry went off down in Santa Cruz tonight too. 44 and 7!! #datboygood @MrAnthonyMorrow thanks bro. #704 S/o to my Siblings @sdotcurry and @sydelcurry. Love y'all. Unbelievably Proud of Both of you. That's all. #nationalsiblingday Lock in! #dubnation RT @ReggieMillerTNT: Coming to Inside Stuff, my sit down with @StephenCurry30, but more importantly our Cricket Dart Challenge. Who won?? h… My last Anatomix Spawn PEs of the season. \"Blue Splash\"! Follow @UAbasketball for release info http://t.co/BxWSdO9m2J @laurenbiggers @billvoth @CoachJimFox talk about a gem! #this Happy bday s/o @chris_jackson13. Enjoy it my man Congrats to my man @CoachJimFox taking over at Appalachian St. Great coach, great person, below average golfer. Well deserved RT @DavidsonWildcat: Jim Fox Named Head Coach at Appalachian State http://t.co/tR2Jx4Zi8e Big congrats to “branch muppet” for winning the #SC30bracket. “Uconnt stop shabazz” turned out to be prophetic http://t.co/jIgWcxhMn5 Missed this last night but JR shot 22 3's last night? That's downright amazing Check out how I overcame all of my physical criticism and learned to get an edge in college: http://t.co/DiubMP7aoz (ad) #MarchMadness Lock in! # dubnation http://t.co/wJYnjduBpE Check @ayeshacurry blog for her new video! Cameo by yours truly as we go down memory road a little. A lot of fun supporting her #HusbandTag Lock in! #dubnation Happy bday to @MarkJackson13 and great #RoadWarriors win! Lock in! #dubnation Lock in! #dubnation @TBogues04 happy bday bro. Little late on the west coast but hope you enjoyed it bro They said we’d never beat #2 –they were wrong. Watch my @DavidsonWildcat improvement story w/ @DegreeMen: http://t.co/fu8Ghwjf4y (ad) @billvoth and the fact you get 2 for $5 Lock in! #Dubnation Come meet me at @Walmart (8400 Edgewater Dr.) in Oakland today at 7pm. See you there! #NBAFIT Run of Show on TV tonight. Cavaliers game, NIT, Frozen, Revenge, Teen Mom 2. Safe to say I lost the remote at a certain point You guys think you’re ready for that? I remember your game, Cliff. @Cp3 @CliffPaul Seeing the bond between @CP3 and @CliffPaul reminds me of me and my brother. #FamilyFirst   Come meet me at @Walmart (8400 Edgewater Dr.) in Oakland tomorrow at 7pm. See you there! #NBAFIT My #MarchMadness run wasn’t a Cinderella story. We improved our game, and found our moment: http://t.co/twr6obuVd0 – from @DegreeMen (ad) Lock in! #dubnation Watch my @DavidsonWildcat #NCAAMarchMadness improvement story in this short film by @DegreeMen:http://t.co/fu8Ghwjf4y (ad) RT @cavs: ROSTER UPDATE: #Cavs sign guard Seth Curry to a 10-Day contract. Curry Highlights and [MORE]: http://t.co/EOmQXuZNVY #AllForOne Part of living #healthy is having the right coverage. Live each day to the fullest. Visit http://t.co/9qZmftsMnn &amp; #GetCovered #OwnNow Lock in! #dubnation Last chance to get in!\nGroup: SC30Bracket http://t.co/oqb5n8qi7l\nSigned pair of my @UnderArmour bday shoes 2 winner http://t.co/oFwFtoSQad Reminder: #SC30 brackets\nGroup: SC30Bracket http://t.co/oqb5n8qi7l\nSigned pair of my @UnderArmour bday shoes 2 winner http://t.co/oFwFtoSQad Lock in! #dubnation March #SC30 contest time\nGroup is SC30Bracket http://t.co/oqb5n8qi7l\n@UnderArmour bday shoes to whoever gets most pts http://t.co/oFwFtoSQad .@Englishscope24 sounds good lets do it... RT @NBA: Happy Birthday, Brian @Scalabrine! #WhiteMambaDay http://t.co/aAqv9mfST8 .@Englishscope24 we putting something on this game tonight bro? Last month I lived out a dream of mine thanks to your votes! Go behind the scenes at my first NBA All-Star Weekend:http://t.co/ieyeNnu8x9 GSW Official March Madness. Shootout style. 16 man tournament. Coaches and Players. 5 spots. Single elimin... http://t.co/oV8KM7KUYK Lock in! #dubnation Lock in! #dubnation Thanks for all the bday wishes! You guys are the best. Blessed to see another year! Let's get this win tonight. #pieday #3.14 Big thanks to @UnderArmour for the bday wishes http://t.co/UmcdebzAZt A little late on this but Sick my @Panthers decided to let Smitty go. Preciate all #89 did in panther blue. \"Ice Up Son!\" Lock in! #dubnation @andre #Rehab Lock in! #dubnation . @UAbasketball PEs to release in The Bay! Out now at the Westfield @ChampsSports in Union Square http://t.co/0XCKrxvU47 RT @UAbasketball: Bay Area! @StephenCurry30's new \"The Bay\" PEs are out NOW at the Westfield Mall @ChampsSports in Union Square: http://t.c… Also SUBSCRIBE. I've seen the list of videos to come and you don't want to miss it. http://t.co/xuNPBGJ0cI @ayeshacurry Another cool video up on @ayeshacurry YouTube page. Plz check it out and let her know what you think.  http://t.co/xuNPBGJ0cI @whitelobstah24 @Joey_Beeler hahaha bbarr came to play too Let's go @DavidsonMBB. Game one of the SOCON tourney Lock in! #dubnation Want to win an @NBA or @WNBA appearance? Visit http://t.co/myPDKZF92A and register your school for @LetsMove #ActiveSchools! Lock in! #dubnation Lock in! \"Dubnation\" So Proud of @ayeshacurry sharing her interests &amp; passions on her YouTube channel. Show her some love &amp; Subscribe!!!!  http://t.co/xuNPBGJ0cI @PetersLuck1 http://t.co/XVpAGyi0dT Lock in! #dubnation RT @DavidsonWildcat: #seniors #dblock #catswin http://t.co/LINwlCINGf RT @Athletics: Looks like @StephenCurry30 believes in #NerdPower. RT to vote #EricSogard for #FaceOfMLB http://t.co/d0wkXnRIAC RT @Athletics: RETWEET if you’ve ever felt like a nerd. You have #NERDPOWER. #EricSogard #FaceOfMLB http://t.co/K7v7mJv9H6 My new PEs from UA go on sale tomorrow! Follow @UABasketball for info on where to buy. #DubNation https://t.co/LMyVBl6Koe #IWILL Being in The Zone is about how much hard work you put in. My new UA PEs celebrate my game at MSG last year. #IWILL http://t.co/ZDXToiFi6V Lock in! #dubnation RT @GQMagazine: 4 Ways to Break the Rules of Black Tie: http://t.co/i6HLlAFH6S @StephenCurry30 @JHarden13 @JoakimNoah @KennethFaried35 @NBA RT @CSNWarriors: New Warriors Central at 4:00pm! We're with @StephenCurry30 at All-Star weekend, and @ayeshacurry has a new NOLA-inspired r… Lock in! #dubnation Another grind it out win! S/O @Money23Green and @jermaineoneal coming up big tonight! #Gamers. Road trip time. Y'all pray for @Dlee042 Lock in! #dubnation RT @ESPNNBA: New Lakers @KentBazemore20, @Marshon2 lead LA to comeback win over Celtics.\nBOX SCORE: http://t.co/0DtiDI5NWS http://t.co/CPgS… Lock in! #dubnation No doubt a Tough day seeing @KentBazemore20 go. Gave everything 2 this team and true Warrior. I'm his Biggest fan! Big things ahead. #IWILL Lock in! #dubnation Make sure you guys keep checking @ayeshacurry YouTube channel. Posting great videos regularly. and SUBSCRIBE!!!! ... http://t.co/j7ums9Foh2 Mickey Mouse Clubhouse ـ Goofy On Mars / Goofy's Bird (Full Episodes)f http://t.co/SQNXrnCDx9 Thanks again for all the votes. My PE’s for tonight. “Purple Voodoo” Anatomix Spawn. Available on http://t.co/RrmIsIiQ9t! #IWILL Testing the #nbaallstar rims http://t.co/YxUQt1HlrV #west http://t.co/62HL9ZHK0l Some more behind the scenes - rehearsing our #nbaallstar intros http://t.co/ccrMtx7pdX #nbaallstar behind the scenes http://t.co/ziL5PdRHn9 First All-Star game. Thank my Lord and Savior for this blessing and opportunity. https://t.co/nWcxkvTt3Z It's nearly showtime http://t.co/plEfToCRwE The 3-pt crew. Who are you taking? http://t.co/15UUWthDBI #shootingstars http://t.co/D7RwKDtaUa And one of my teammates tonight. Heard he's a decent shooter http://t.co/BJpmqO77M9 My @UnderArmour shoes for tonight's Shooting Stars http://t.co/RHqSipw9YL All-Star Saturday attire http://t.co/Vs2YETHI6D Thanks @JohnLegend it was great to work with you and @DegreeMen on these short films! http://t.co/WEQbbp1LsW (ad) Getting ready for the Skills Competition and 3-Point contest in “Green Voodoo” Anatomix Spawn. Inspired by New Orleans! So great to coach our next generation of assisters alongside my dad, the great Dell Curry. Thanks @StateFarm! http://t.co/uCNF7hj7OT Good luck to my man @HBarnes tonight in the #RisingStars game. #BlackFalcon RT @FinishLine: .@StephenCurry30 went 10 for 10 from 3! Just a preview of tomorrow night! http://t.co/sWT4H7CpQO Always great running into the Paul Brothers @CP3 and @CliffPaul this weekend down in New Orleans. Another pair of Anatomix Spawn PE’s by @UABasketball. Representing for my Davidson family! Crazy day down in NOLA. But have to pause and wish my wife @ayeshacurry Happy Valentine's Day! I Love you much. #Respect #100% RT @ayeshacurry: New video is up on my channel! http://t.co/H9ZgJyz2jJ   Come and make homemade bread with me! Check it out! RT @ayeshacurry: New video is up on my YouTube channel! Make some homemade bread with me! Super easy.:) http://t.co/9IFXQyWmP8 RT @ayeshacurry: New video is up on my YouTube channel! Come and make some homemade bread with me! Super easy. :) link… http://t.co/kBZCiWA… Good work today! RT @wxfdash: I had a great time @StephenCurry30 camp , we had a great knockout game , THANKS BRO http://t.co/tb8uLWH3A1 Honored to be 1st time #AllStar, sharing &lt;3 with fans, D/L David's Miracle 4 free till weekend, (code #KeepDreaming) http://t.co/MLVzreZgK2 S/O to @UABasketball for telling my story from 5-Star Basketball Camp to Davidson, now enjoying All-Star w... http://t.co/pQ77WfdUBE Heading to Oakwood Mall TODAY @ 5PM to ball, give away @UABasketball gear @FinishLine, and see YOU, Nola! #TeamUA Heading to @NBAAllStar with my custom @MoGoSport mouthguard...Can't wait for the competition! http://t.co/UARrKRs41c http://t.co/wJeEaB79xr Who's coming out to the Oakwood Center @Champs store at 6:30pm?? Can't wait to meet everyone tonight! Lock in! #dubnation Join my Google Hangout with @FinishLine &amp; @UABasketball Friday for a live look at ASW. Get the details here  http://t.co/HDoizjdUBp Honored to be 1st time #AllStar, sharing &lt;3 with fans, D/L David's Miracle 4 free till weekend, (code #KeepDreaming) http://t.co/MLVzreZgK2 Lock in! #dubnation RT @nbacares: The @NBA &amp; @Kia will make a $10,000 donation on @StephenCurry30's behalf to @MakeAWish Greater Bay Area. http://t.co/Lfa22VCY… .@ayeshacurry just launched her new and amazing YouTube channel. Check it out and make sure you Subscribe! Go! http://t.co/9zpcAdlALf Need to announce the winner of my impromptu contest the other night. Congrats to —&gt; RT @melliii10: #DC30 http://t.co/NyfYfVqKzU Happy Birthday to my backcourt mate and member of the Splash Brothers. Let's get this win. Lock in! #dubna... http://t.co/FXrENhCRAS I see you @MrAnthonyMorrow You can send pics/draw pics, whatever. I'll take entries till 8pm PT. The funniest entry wins. Make sure to use the #DC30 hashtag! GO! (3/3) This looks nothing like Pops http://t.co/af8YnR00Ku \nSo who do you think it looks like? Tweet me a name, a combo of names, etc. (2/3) #DC30 Impromptu contest: Winner gets two tickets to a @Warriors game closest to where they live (1/3) #DC30 Great to see the #Bobcats honoring my pops Dell Curry tonight at their game. But one question....who is that? http://t.co/6HZEbMnfTV RT @MarkJackson13: 100 Wins!! Proud of my guys! I Thank GOD!!\n#Warriors Lock in! #Dubnation Facebook Q&amp;A is underway ---&gt; http://t.co/FLGG5ADer2 Rough night sleep. About to head into practice to get things back on track. \nreminder - doing a Q&amp;A on http://t.co/QoN2XgfLEA after practice Celebrating Coach Mckillop's 25th Anniversary at #davidson. Impacted so many people along the way &amp; I'm so... http://t.co/pQ2Bj7hiWi Lock in! #dubnation Lock in! #dubnation And in case you aren't following, this is my real Facebook page https://t.co/xs05sX8Cme Quick FYI: Since it’s gameday, let’s shift this month’s #SC30 to next Wed. Going to do something special on my Facebook page, so stay tuned Gameday. Thanks to @RecoverPump for giving me fresh legs every game. Check them out! http://t.co/aibXzictKC RT @ChrisCcz: Come support us tonight at 7pm vs. conference leaders Chattanooga..it should be a good one so we need all the help we can get! @blvckardashian happy birthday Myah. Hope you enjoyed your day and know the Curry on the West Coast love you. 15 though?? RT @HBarnes: Head up Let's get this win for @andre birthday. Lock in! #dubnation RT @LaurenceScott: Warriors forward David Lee's impact -- Warriors TV: http://t.co/aclBIix7j9 -- @Dlee042 with another All-Star caliber sea… @Table24Orinda French toast and egg sandwich was on point. Thanks. RT @MuscleMilkSF: Money Ball for this afternoon's #BallWithStephen 3-Point Shootout with @stephencurry30 http://t.co/MgByGJgp0G RT @acceleratebball: It's important to be critical of yourself. Only you know if you're giving your all. Self evaluation is an absolute for… RT @Dlee042: Great team effort tonight and a much needed home win !!!! Also happy birthday to @Marshon2 !!!! #fullsquad #GSW Big win #dubnation. Heard people liked these #Grammy kicks me and @kentbazemore20 wore tonight by @underar... http://t.co/Gmmib9gJ5Z Lock in! #dubnation RT @MuscleMilk: We're on Team @StephenCurry30 ! 2014 #AllStar #TeamCurry #GivemeStrength http://t.co/eToPknhfjk RT @ayeshacurry: Tune into Warriors Central tonight at 6:30 before the game on @CSNAuthentic I'll be making Easy steaks on \"Cookin with the… Lock in! @StephenCurry30: Get Familiar with my cuzzo @DevonteeWOE     https://t.co/CgoYP9fN7m. #Talented And a quick video: Again - thank you  http://t.co/213WiQgbpD Wow. Thanks 2 everyone that supported and that voted for me. Amazing feeling and can't wait to represent my teammates down in NO. #dubnation We will soon. Stay tuned RT @itcrashed: @StephenCurry30 @UnderArmour How come they don't release any of your colorways to the public? .@underarmour did it again with these Davidson inspired Anatomix Spawns. Brings back some good memories http://t.co/gxqmN6clS6 Fitness plays a huge role to my on-court success. I'll be giving tips on health tomorrow at Southland Mall (5-7pm PST) come out and #OwnNow. Check out the homie @jonathanstewar1 with his music http://t.co/hsfjQh9LSc retweet it if u like it! @HeartGrabMusic .@Joey_Beeler anytime Jerry RT @Joey_Beeler: Congrats to Davidson's De'Mon Brooks for earning SoCon POTW. Hard to believe this is the 1st-ever for Brooks, who is just … Get to take baby girl to school this am. Don't get to do it very often. #LittleThings http://t.co/wPLpICbUFD Tough one tonight.  Can't spot them 20 pts.  We'll learn and get better Get to celebrate and represent the life of MLK tonight on the floor. Lock in! Finest woman picking up the dogs poop lol http://t.co/VYHdXUtrtM Got to do late breakfast outside with @ayeshacurry today. Thanking The Lord for all His blessings &amp; for an... http://t.co/iTI5rxIth4 0 @Auxodria hilarious. You're right I should. What kind of font though? Lock in! Lock in! they are clowning on TNT I love it! Cmon Chuck get in the game #DrumLine Next bad play I'm blaming my busted shoelace and asking for a redo lol Just heard about the heartbreak @DavidsonMBB finish against Elon. Seems like a crazy ending everytime. #tbt @steverossiter23 Tough loss. That's on me. Gotta make a play. Stay even keel! Lock in! Welcome to #dubnation  @jcraw55 and @Marshon2 #DubNation! Black Falcon! RT @warriors: Check out the new #WeAreWarriors commercial featuring @HBarnes &amp; Dubs fan Romel Marquez: http://t.co/2NKJnRLQkX @rjrcpa10 thought it was dumb. We all could feel how hype the stadium was. no need to get SF mad. They've been here before, we haven't. Dang. @DavidDTSS coalition is strong here We still have time we hold em to a FG. Cmon Defense Cam will be hearing from league offices. flop warning hahahaha @M_DiMaggio30 probably. Worth it to see Panthers win today @woodstock950 hahaha my man 89 questionable to play today! Dang gotta punch a TD in there. That Niners line is nice. So hype right now. RT @warriors: With all due respect to @StephenCurry30 &amp; @KentBazemore20 (&amp; their NC roots) we're pulling for the @49ers today. #BeatThePant… RT @nbadleague: For more on Pierre &amp; Shabazz's BIG #DLeagueShowcase debuts + @sdotcurry's impressive return, head to the Blog! http://t.co/… solid work by the @panthers http://t.co/HfgJ94sx2Q @Rankinvt10 thanks bro Translation? Haha you won't  RT @nedovic1624: @StephenCurry30 pickin dim Big win coming off that crazy road trip! Nice to now get some rest and watch some football this weekend. #DubNation strikes again Hype to get back to Oracle. Lock in! #DubNation Get excited Charlotte! @UAbasketball hosts the #UASHOWCASE on Jan. 11 at Phillip O. Berry. Stream the action here: http://t.co/aCs3RISPaa Lock in! RT @Dlee042: 10 straight! So proud of our #FullSquad for takin care of business on the road! Big game tomorrow in Bk, let's get it!!! #Full… Lock in! How much that cost Fes? RT @Money23Green: In other news nobody's ever safe @fezzyfel smh Oh and nice book btw HA!!! http://t.co/sMbYLZn7br RT @Money23Green: Respect to the Packers and the 49ers!!! I don't know how they played football in this Wisconsin weather ❄️❄️❄️❄️❄️⛄️⛄️⛄️… S/O to @Dlee042 for the Player of the Week award. #surfboard It’s #NBAFIT Live Healthy Week! Follow @NBACares &amp; #NBAFIT and tell us how you’re being active this week for the chance to win @NBA prizes Lock In! So congrats to @joeusher &amp; @juliasamar_ and thanks to everyone who sent in videos! Before the 2nd NFL game starts, announcing the #SC30 winners:\nFor the @49ers http://t.co/x1WCnBQiqc\nFor the @Panthers http://t.co/eDVneO11VE alrighty then…NFL Playoffs you are amazing right now Some @Warriors tickets up for grabs -- You have a few hours left to enter this month's #SC30 contest http://t.co/EpZ9KQBt4F Proud member of the #NBAFIT Team! It' so important to me to help our youth Be Active, Eat Healthy &amp; Play Together! http://t.co/OQkCHelP69 Lock in! Just passed the nicest Waffle House I've ever seen in Atlanta. I mean the nicest RT @ccs_hoops: S/o to @StephenCurry30 and @UnderArmour for hooking the team up with some sick gear!! #TeamUnderArmour #CCSNation http://t.c… Lock in! ICYMI: This month's #SC30 contest centers around the @Panthers, @49ers &amp; NFL Playoffs http://t.co/YnH5aiylc6 ¡Feliz Año Nuevo! Shout out to 2013 &amp; all the blessings and the experiences . Ready to bring in the New Year w/ my rock @ayeshacu... http://t.co/aivsUmlfSi RT @andrewbogut: Make 2014 better than 2013. Happy New Year!! #enjoy #besafe One more time for 2013...Lock in! RT @PFF: Lavonte David and Thomas Davis both grading at +14.4 in coverage this year, highest regular season marks among linebackers since 2… #SC30 contest time and since the @Panthers and @49ers are both headed to the playoffs, let's center this (cont) http://t.co/rjPO3C5O7m Lock in! #KeepPounding Sheesh Tolbert WOW the @Panthers are just playing with our emotions right now! Lets go get this 1st round bye Anybody see @ayeshacurry video bomb the post game interview? I missed it RT @warriors: #SplashBrothers combined line tonight: 35 points, 17 rebounds, 18 assists on 14-28 shooting. http://t.co/o5mDfKGDQV Lock in! Excited about the Feed The Children event today in Oakland. The whole Curry Crew will be out serving 400 families food &amp; personal care items Merry Christmas and Goodnight #DubNation. Lock in! Merry Chrismas from the #UAbasketball LaFamilia, my Xmas Day #AnatomixSpawn PE's  #IWILL http://t.co/WVNl7yBKih Christmas Dinner! http://t.co/1DCrsvLp43 RT @Mospeights16: RT @KentBazemore20: Great effort by every Dub tonight! Good win! #DubNation RT @UAbasketball: Watch @StephenCurry30 transform on Christmas Day in this 2-shoe Anatomix Spawn Pack: http://t.co/099NvknnMp Lock in! Yeah boi! Cats are playoff bound. Big win in NC. Cam making plays. Luke setting records. Love it. Win the division next week. #keeppounding RT @Panthers: The #CardiacCats are back! #KeepPounding Let's go @Panthers #keeppounding http://t.co/PYq8VoIlPN My buddies @Kaepernick7, @malkin71_  and I are giving away signed @mogosport swag! Enter for your chance to win: http://t.co/6dK1a3Y4qk @The_ChrisWatson anatomix spawns. Coming out in the colorway soon Also. Tweets will be limited as this is my new profile for a minute. #wildcats. Yall got lucky @HBarnes Good win. Great to see @sdotcurry Before he heads off to Memphis to start a new journey. Gonna do his thing @dmar Hahahahahaha Still a great day to be a Wildcat! Lock in! Omg! Getting ready for tonight....@DavidsonMBB playing their style right now! Lets go @HBarnes RT @Active_Faith: Check out the latest episode of our TESTIMONY series with NBA Star @StephenCurry30 http://t.co/gJiQ1YzexE Check out the latest video about my trip to Tanzania with @nothingbutnets: http://t.co/fsW8BCCXDr Bad bad bad Lock In! Wearing this tonight for my man Emilio a true #warrior http://t.co/0wzBxhrx7G Headed to Hilltop Mall tonight. Meeting everyone looking to #OwnNow. If you’re not covered, come through. See you at 5pm! And a big thanks to @Warriors, @UnderArmour @Playstation, @menswearhouse, @MuscleMilk, @KraftFoods, @JAApparel &amp; CapriSun for their help! It was an honor to host Anthony during @MakeAWish Week! http://t.co/jU2dpRVCwX RT @kpownnow: Meet @stephencurry30 at @hilltopmall tomorrow at 5PM. Bring a canned-food donation &amp; get a picture w/him #ownnow Your kids can take me on in a free throw free for all game thanks to Capri Sun. Check it out here: http://t.co/KP5tGUySIT #KidsVsPros RT @SportsCenter: Southern Illinois coach Barry Hinson went on an all-time EPIC rant after his team lost to Murray State last night » http:… @JenniferKeene wow thanks Jennifer. @AlyssaRomano thanks Alyssa @AthleteTax thanks man Alrighty. Time to get back in track. LOCK IN! @COSeezy you tripping bro. Know y I ure hype for Anchorman 2 @mrichnesss @Zamst_us Lock In! RT @MuscleMilk: Honored to be a part of Anthony's @MakeAWish experience with @StephenCurry30 last night.  #TeamCurry http://t.co/TtaPOlSevo RT @menswearhouse: Happy we could help make Anthony's experience special! Thnx, @StephenCurry30, @warriors &amp; @MakeAWish. #WarriorsGround ht… Lock in #DubNation RT @jermaineoneal: Surgery went great today now I'm putting my healing in god hands! Now yall know the things he can do! http://t.co/Ea2rwN… Bid on my game worn shoes + jersey to support my boy @DavidOrtiz &amp; his online auction benefitting @DavidOrtizFund http://t.co/Y0FyRKCpw3 RT @UAbasketball: #AnatomixSpawn -- the shoe that becomes your foot. As worn by @StephenCurry30 last night for his first game winner. http:… RT @ayeshacurry: Post game snacks for my love. Grilled cheese on homemade bread, popcorn (his fave) and homemade sugar cookies. http://t.co… Great night #DubNation! Thanks for the energy. God is great! Lock in #DubNation Good to be back in the Bay, but check out this video from my @UnderArmour visit at @FootLocker while I was in #CLT http://t.co/mQQxlIEak5 Big thanks to the @Panthers for sending this jersey as an early Christmas present. Can't wait for their pl... http://t.co/In151YqEwi Tough way to end the road trip, but nice to see family and friends http://t.co/9xSRhGwukU Tough night at the office. Finish this game strong and remember this one for the next 2 weeks when we see them again at BofA Gametime! #keeppounding @PANTHERS http://t.co/VbJS3q1Nhv Bunch of pics from today's @UnderArmour event at @FootLocker w/@KembaWalker http://t.co/dfkAt7Awge #IWill #APPROVED Thanks to all who came out to @FootLocker for my @UnderArmour event w/@KembaWalker #iwill #approved http://t.co/yjY6RqkFpX QC Bound! Lock in! RT @FLIPOUT_Tees: Order a @StephenCurry30 shirt today and you'll have it by Christmas!  Every purchase supports @nothingbutnets http://t.co… But my favorite entry was @jackie_arcos with this http://t.co/Sn1O8LWP8u I hope even if you didn't win, you'll follow through w/your #IWill This month's #SC30 contest was even harder to judge than most. So many inspiring entries. Thanks to all who submitted an #IWill for 2014... Big time win for @DavidsonMBB taking back the Hornets nest! Great day to be a wildcat #DUBNATION Psalm 103:1-5 Charlotte: Me &amp; @KembaWalker are running point at Carolina Place Mall @Footlocker on Dec 8 at 4. #TeamUA #APPROVED http://t.co/CoBjC5ioRh After a big win, I'm thankful for my fans and the @mogosport team! What's your favorite flavor? I love the lemonade! http://t.co/PSDQx8CXln ICYMI: This month's #SC30 contest is looking for what you're willing to say #IWill to in 2014 http://t.co/M43o2DB7OM Haha \"the were no athletes on the field. There were all fat guys\" Woooow! Still stinging after that game last night, but since it’s the 30th, need to do an #SC30 contest, so here (cont) http://t.co/21QgMxdzqr Oh well Tough tough tough. His foot on the line tho? Lock in! Thanksgiving setup http://t.co/k19Ygd3LU3 RT @DLeagueWarriors: Warriors win 121-101! @sdotcurry had a game-high 23 points and 10 assists, Hilton Armstrong and William Buford each sc… @MrAnthonyMorrow same bro sorry I missed you and lil man after the game. This month’s #SC30 contest coming up soon RT @juliasamar_: @StephenCurry30 can you do another contest on twitter? All right, the two @SINow cover  random winners are @ajreems (nominated by (@NOVMBERSVRY_OWN) &amp; @IsaiahF23 (nominated by @BRANDYbrowning) RT @nedovic1624: @StephenCurry30 @dedmon_21 On our way! http://t.co/45tSP2xGDI Thanks to @playstation for getting set up with #ps4 to get through these road trips. #clutch http://t.co/ywgfu4UmWx Just got to New Orleans. Have room service and Cafe du Monde beignets on deck. Thanks @nedovic1624 @dedmon_21 @PetersLuck1 hahahaha. Gonna turn the world onto our hidden gem of a drink! More thank yous: I have two signed @SINow covers. Give me a handle of someone you think would want one &amp; I’ll pick random winners at 11ET. Also wanted to give something to @alondrameoww, my 1 millionth follower. I worked w/@UnderArmour to come up w/these http://t.co/Noe4EJ7HjB ICYMI: Made a 'Twitter highlight' video to thank you guys for getting me to 1 million followers http://t.co/uybCYR48Ih In case you don't know, keep checking out @ayeshacurry blog at http://t.co/606TYd9cfb. Pics, recipes, inspiration and family. Nothing but net! Have your kids checked out my free throw throwdown from Capri Sun yet? http://t.co/KP5tGUySIT #KidsVsPros Hit 1 million followers last night. Thank you all! \nMade a special \"Twitter highlights\" video, check it out http://t.co/gzTWUBZmR8 This @KevinHart4real voice on the @waze app is hilarious. Once again #KeepPounding Big momentum play going into the half for the Panthers. Next play mentality #dubnation Lock in! RT @Dlee042: Steph Curry sporting his anti-concussion helmet for tonight's pregame activities #GSW #FreeSC30 http://t.co/6LpYt7YKz4 Hoping My man @andre is back ASAP. #JustUs @benswagga http://t.co/OaHCFYrvm2 So unlike him. RT @Joey_Beeler: @StephenCurry30 don't you find it disappointing @whitelobstah24 hasn't tweeted a lot lately? \"How we do it in Serbia\" @nedovic1624\n#Video http://t.co/KxbSvDNg8H @ClintIrwin if there's a deal for buying two keep me in mind! Classic Checkout my family's background in the Montessori experience. So lucky to go to my mom's school! http://t.co/BWGIwERUc7 Nothing cures a mean headache like a @Warriors and @Panthers win. Happy for those guys they made the QC proud tonight. #KeepPounding Anyways back to basketball.............................Lock In! But Gotta love the fact that @UnderArmour is represented on both sides. Cam vs Brady. #IWill Good luck to Panthers Nation tonight. Expect BofA to be rocking and we get this win. #keeppounding He looks like a nice puppet but he will pull pranks on you! Watch #Pranksgiving every Monday in Nov. on Disney XD! http://t.co/eeSUIBBl8v Seriously hype about this new tunnel. #caldecotttunnel #4 http://t.co/JtyE9HxDqY Keeping up with the feed of the #SFBatKid story. that's great stuff right there I see @sdotcurry healthy and hype to be back on the court. 28pts and the W in his first D-league experience. Just the beginning Morning people. Great win last night! @andre clutch gene. Headed to practice to get better. RT @acceleratebball: Accelerate Basketball on NBA TV this Saturday #constantcontact http://t.co/SWIb29lOk4"}