{"tweets": "What a moment! Great energy in that room. Thank you @tim_cook  and @zanelowe. You guys are amazing.  I’m glad you got to hear a few beats of what I’m working on.  @Beats1 @applemusic! https://t.co/1q9vD7XBDO Mi gente, las entradas para el show el 8 de febrero en Puerto Rico ya están a la venta: https://t.co/flmlUXhHxS\n#MovimientoTour https://t.co/GHwzxuHDEF #Argentina #MovimientoTour https://t.co/Xc8PxliVtc Ricky Martin anuncia una segunda función de su concierto en el Choliseo @ElNuevoDia https://t.co/MRXXKBRYaw GRACIAS PUERTO RICO!!!! ☀️☀️☀️ The show takes place at MGM Grand in Las Vegas on November 14\nIt will air live on @Univision in the U.S. and 80 countries around the world. \n@latingrammys #20añosdeexcelencia #LatinGrammy Hey hey! Sleepy face here! ☀️\nSuper exited to let you guys know I will be hosting this year’s @latingrammys  alongside @roselyn_sanchez and @pazvegaofficial This year we’re celebrating the 20th anniversary of the Latin Grammy Awards. https://t.co/7MFkMcbRbt Boletos a la venta ya. #MovimientoTour \nhttps://t.co/flmlUXhHxS https://t.co/q3f2dCOuFt Mi gente, #MovimientoTour empieza en Puerto Rico  el 7 de febrero. \nTickets a la venta el 24 de octubre.\nCan’t wait to see you! https://t.co/r5fFaVtbU9 “If you can’t do great things, do small things in a great way” Si te caes, pues te levantas. No quiero excusas. #kerryskarbakka https://t.co/gn9jUT1YOj 📸: @gregswalesart https://t.co/RPFKc1F0Za Puerto Rico te veo en Febrero! https://t.co/Ex5rn68QaF Night dive! 💫\n.\n📸: @rob_hoffman https://t.co/VeYN9nMOf9 What's your favorite #MusicMonday? https://t.co/tDZlWBE9b8 #Chile finalmente puedo confirmar que estaré ustedes con nueva música y nuevo espectáculo en el  #festivaldeviña #VIÑA2020 https://t.co/4Ezq71pKtk Human rights, human rights and more human right. SIMPLE! https://t.co/Y4FWeepa4W Great things are coming! .\nAwesome shoot with @rob_hoffman https://t.co/toCEVRCMT2 Lamentamos los inconvenientes que esta cancelación, completamente ajena al artista internacional, pueda ocasionar. Nos permitimos comunicarles que el concierto de Ricky Martin previsto a realizarse el día de hoy, 23 de septiembre de 2019 en la Feria Nacional de Zacatecas, ha sido cancelado debido únicamente al incumplimiento de contrato por parte del empresario. World Summit of Nobel Peace Laureates. #YucatanForPeace https://t.co/NvwD78TgXl From my bed to this. https://t.co/qbawiwMwN7 #CoverStory for @bhlmagazine .\n📸: @maxwellpoth https://t.co/ztkrOGC4FY #MEXICO Amigos, estoy muy emocionado por la invitación de la Cumbre Mundial de Laureados de Nobel de la paz para cantar con todos ustedes en Yucatán ¡Paseo Montejo nos recibirá este 21 de septiembre para celebrar la solidaridad y la unión! ¡¡¡NOS VEMOS YA!!! #YucatanforPeace. https://t.co/D3i4sowR3t #StudioTime . \nViene buena música y voy a montar una clase de concierto que no olvidarás! Ya mismo te visito. Te parece? 🎶🎵\nReleasing great music this fall, I will put together a hell of a concert and then I’ll go visit you! Cool? \n#Tour #NewMusic https://t.co/C3473wkWsf RT @youtubemusic: Spend today on the beach with @maluma + @ricky_martin 🏝 #NoSeMeQuita → https://t.co/BF2Ak77PyY https://t.co/q49mJ1XXA5 Dale play y descubre la fuerza de la unión para lograr un #UnMundoSuave. https://t.co/2vvw1v0jo2 “Tu abusas, me usas, lo sabes, me gusta...” 🎶🏝 #NoSeMeQuita https://t.co/13YzdnbGTJ https://t.co/16x9AqF6Vy #MOOD https://t.co/QAS0Vfjn4Y Click on video. ⁦@maluma⁩  https://t.co/13YzdmU5v9 ¡Continuamos trabajando día a día para brindar esperanza a nuestro pueblo! 🇵🇷❤ La valentía, resiliencia, compromiso, empoderamiento y sonrisas en los rostros de los loiceños al recibir su nuevo hogar, ha sido bienestar colectivo. @RM_Foundation https://t.co/WaE4WnjGyv Ya sale mi gente. Caminamos. #NoSeMeQuita https://t.co/2t8Akdrjhi In studio. https://t.co/gAnZQNzyHm #Repost @maluma\n・・・\nFALTAN 2 DÍAS!! #NoSeMeQuita @ricky_martin 🌎🌍🌏 WORLDWIDE!!! https://t.co/F1JcrLFmLL Funds raised will help three amazing charities support the Dreamers education &amp; future. Together we can let them know that their dreams matter - to us. Thank you! @AlejandroSanz I'm joining my friend @AlejandroSanz on this great initiative to support the #Dreamers in the US. By purchasing this t-shirt👕 👉🏽 https://t.co/3lnfYcRmfX you can be part of our #DreamerTeam too. Because #WeAllDream. We all belong. We are all one. And EVERYONE matters. https://t.co/s35NFwLGrJ Mi gente, los espero el 21 de septiembre en Yucatán For Peace. Tickets: https://t.co/98gs0iS0Df https://t.co/78HCOubYjZ La luz de mis ojos #Lucia https://t.co/3esxQfTccb Esto está difícil hermano. https://t.co/jYvjYZQi78 @Tommy_Torres Jajajajajajajajajajajaaj. No es fácil. Let’s hit the sun ☀️ https://t.co/bGy56vCNZL En el mundo civilizado..........\n.\nManifestantes abrazan a policías luego de la renuncia de @ricardorossello #puertorico https://t.co/N2qNxHHChZ Sin armas. #RickyRenunció https://t.co/E7xSybdgfn Puerto Rico. No te dejes engañar. Seguimos unidos. https://t.co/fODjHr3es9 Que siga la presión. Puerto Rico no te quites. Ricardo Roselló te tienes que sentar con miembros de la prensa puertorriqueña. #RICKYRENUNCIA https://t.co/QaM4yhRRU5 For you to have an idea, this is what we are dealing with #RickyRenuncia https://t.co/88eT5GT3Aj PAINFUL TAKE A SECOND AND PLEASE WATCH THIS PLEASE #rickyrenuncia #PuertoRico  https://t.co/88eT5GT3Aj Qué orgulloso me siento de ser puertorriqueño. Qué fuerza sentí de parte de mi gente. Seguimos en la lucha hasta que @ricardorossello no gobierne mas. #resistencia 📷: @worldjunkies , @usamahamid https://t.co/xZLAtL2snV #rickyrenuncia #residenciamientoYA https://t.co/IsRTsXfDs9 #RenunciaRicky https://t.co/Ie76MDfF3J . @ricardorossello BASTA DE TANTA SOBERBIA. El pueblo te lo pide, escucha. #rickyrenuncia https://t.co/SxgTISMtIt Puerto Rico: Protests over homophobic text messages https://t.co/HMcWCkGfkM RT @lilialuciano: If you've finally noticed the #RickyRenuncia #RickyVeteYa - -here's what you need to know: https://t.co/2U4iqZwvaQ #RickyRenuncia \n\nhttps://t.co/l52ViyIYaT #PuertoRico nos vemos mañana en el la marcha a ls 5pm frente al Capitolio https://t.co/4cZM1KF3Kn https://t.co/8AssYkG3EE \n\nPor favor firma petición. #RickyRenunciaYa “Esta combinación no falla parceros....” @maluma \nSOON 🎬 🇨🇴 🇵🇷 https://t.co/iMP1iAAraJ Blurry my💀\n.\n#alexandermcqueen https://t.co/jYM7fPBiMX Haga  un  acto de verdadera generosidad,  valía y amor por Puerto Rico y ceda su cargo a otra persona con la sabiduria y liderazgo de dirigir nuesto destino como pueblo. Reconozca que carece de las compentencias de un verdadero lider, que inspire, estimule  y guie con el ejemplo  a que nuestra gente logre  alcanzar  niveles superiores de vida. La juventud  no está reñida con la responsabilidad. Su conducta no es producto de un error o inexperiencia. Ha sido un acto consciente y deliberado,  totalmente irresponsable y que atenta contra los derechos humanos de las personas que habitan el pueblo que dirije y representa. Precisamente porque sus comentarios fueron hechos en la intimidad  queda demostrado de que esta hecho. Es en la intimidad donde se vive con la verdad e integridad que nos define y la suya esta lejos de ser una vertical y admirable. Este NO es el gobierno que nos prometieron en la campaña politica que  llevó a Roselló a la gobernación.  \n\nNo  estar a la altura de nuestras expectativas, esa es la mas grande decepción . \n\nGobernador sus insultos y sus burlas nos muestran quien es usted realmente. Es vergonzoso e inaceptable y no se resuelve con un perdón. \n\nEste NO es el Gobierno que necesitamos. Este NO es el Puerto Rico que nuestros abuelos y padres construyeron y mucho menos el que queremos dejarle a nuestros hijos. es completamente repudiable y denotan el carácter y personalidad intolerante, arrogante, prepotente,  homofóbica, machista y violenta de cada uno. \n\nNO podemos permitir que nuestro Puerto Rico esté en manos de tales “líderes” Las expresiones compartidas en un chat por parte del Gobernador de Puerto Rico @ricardorosello y coreadas por otros funcionarios públicos en lo que a todas luces era una discusión de sus ejecutorias en el Gobierno y no de asuntos privados como se intenta dejar ver, Another day, another set. .\n#secretproject https://t.co/YgGZAzZX30 Hours of flow 🎶 https://t.co/gu6Y7Mp4xi It’s happening. 🎶 📸 🎥 https://t.co/RaN3KB6DXO El orgullo gay no nació de la necesidad de celebrar el hecho de ser gay, sino de nuestro derecho a existir libres de persecución/discrimen.  Así que, en lugar de preguntarte por qué no hay un movimiento de orgullo heterosexual, agradece que no necesitas uno #loveislove #pride2019 https://t.co/utAHxj7HaM 🌾🌾🌾\n.\n#behindthescenes https://t.co/XKv7M7R1lM The making of.... https://t.co/nKYhw3khbt 😎😁@Berluti https://t.co/ITVmURoKAx . @berluti\n.\n#Repost @joejonas https://t.co/hRwvdzqYQZ ☀️🙌🏼☀️ https://t.co/ufUSjEnGVY Nous sommes arrivés @berluti 🇫🇷 https://t.co/OE83lPESxU Un café con mi gente es todo lo que necesito para seguir adelante. https://t.co/DGd8oCp6dj 🤳 https://t.co/QTySrEVHFt The clock is ticking, and the LGBTQ  community needs to let the @NYSA_Majority know we won’t forget if the surrogacy ban isn’t overturned.  @CarlHeastie @DeborahJGlick @HeleneWeinstein @assemblymanjoe @JeffreyDinowitz @MarcosCrespo85 why are you against our community on this? WE WON / GANAMOS!  https://t.co/W8YfxxFPAu que los logros positivos para la justicia social no son inmunes a las represalias.  \n\nDebemos estar atentos a los asaltos a los derechos ganados con esfuerzo y beneficios sociales. La auténtica libertad religiosa tiene como objetivo unir comunidades de diferentes orígenes.\nSi bien hemos sido testigos de cambios en la mayor parte del mundo que han llevado a una mayor visibilidad de las personas LGBTT, estos recientes eventos sirven como un recordatorio de... Como orgulloso miembro de la comunidad LGBTT, también deseo reafirmar que nuestras personas LGBTT merecen el mismo nivel de dignidad que todos los demás.  Nunca seremos cómplices de las políticas que alienan a nuestra comunidad y violan nuestros derechos. en medio de la creciente oposición popular.  Quiero agradecer a todos los activistas, defensores sociales, funcionarios electos y miembros de la sociedad civil que hicieron una campaña activa para derrotar este proyecto de ley. con una vida de servicio público.\n\nAfortunadamente, el llamado \"Proyecto de Ley de Libertad Religiosa\", que pisoteó los derechos constitucionales que protegen a los puertorriqueños contra todas las formas de discriminación, fue retirado ayer... Al otorgar a los empleados del gobierno el poder de actuar de acuerdo con sus convicciones religiosas, valores personales y principios, esta legislación regresiva habría sancionado la práctica de discriminación institucional por parte de quienes se comprometieron... Estos avances fueron amenazados recientemente en Puerto Rico, donde la Cámara de Representantes aprobó una legislación que puso en peligro el progreso logrado en la última década y se arriesgó a alimentar la división, los prejuicios y las tensiones entre las comunidades. GANAMOS!\n\nEn los últimos años, los países de Occidente han logrado avances significativos en la garantía de la igualdad de derechos para la comunidad LGBTT. Mi gente, los espero en la Feria Nacional de Zacatecas! 🇲🇽  @feriazac https://t.co/Oq9TvjmGjX PUERTO RICO’S HATE BILL https://t.co/MB2vJ9atdC Este proyecto no es representativo del Puerto Rico que todos amamos, defendemos y al que aspiramos. \n\nHacemos un llamado al Senado y al Gobernador Ricardo Rosselló para que no aprueben este proyecto que es una puerta abierta al odio y al discrimen. Como defensor de los derechos humanos y miembro de la comunidad LGBTT, me opongo vehementemente al proyecto de libertad religiosa, el cual nos atrasa como sociedad y nos proyecta ante el mundo como un país retrógrado, e incapaz de guardar el derecho básico a la individualidad. o que incluso no sea del mismo color de piel, entre tantas otras manifestaciones discriminatorias.\n\nLa libertad religiosa implica respetar al otro de la misma manera que respetamos  a los demás. El Proyecto de la Cámara 2069, radicado por petición del Gobernador Ricardo Rosselló e impulsado por la Representante Charbonier, no es otra cosa que abrirle la puerta al odio hacia todo aquel o aquella que no comparta una misma ideología, que pertenezca a la comunidad LGBTT, a las convicciones religiosas de los empleados del Gobierno. \n\nDe hecho, como miembro de la comunidad LGBTT me uno al coro de voces que afirman que nunca ha habido un consenso entre nuestra gente LGBTT para validar o legalizar el discrimen en contra nuestra. consentir la separación, el prejuicio, el odio y la falta de respeto a la individualidad. Lo hace bajo una premisa que tergiversa el derecho constitucional a no discriminar por raza, sexo o creencia, y en su lugar, justificar una protección irracional... Mientras el mundo llama a la equidad, al respeto a la diversidad y a la defensa de los derechos humanos, la Cámara de Representantes y el Gobernador de Puerto Rico impulsan una medida que revierte todo lo anterior para... ✝️👖 https://t.co/PirmHo06y6 Puerto Rican day parade with #Belelé #Loiza #Pride 🇵🇷🏳️‍🌈 https://t.co/wLA7vAd7tf #Encapuchao https://t.co/KxBgXk6vs6 #tb\n.\n.\n📷: @marianovivanco https://t.co/OO53ZMHRqY Un café con mi gente es todo lo que necesito para seguir con mi día. https://t.co/ttywSHSqFS Por aquí. 🙋🏻‍♂️ https://t.co/DyKLed4BVx RT @RM_Foundation: ¡Seguimos brindando esperanza y seguridad a los loiceños! Entregamos cuatro viviendas en los sectores Piñones, Melilla y… RT @PRparadeNYC: We proudly announce this year’s Grand Marshal @ricky_martin! Get ready for an amazing time celebrating our culture &amp; pride… “No se me quita” @maluma #OutNow https://t.co/aU5wNDe4pJ #weekendvibes #MocaBenefit https://t.co/uLEJD82jZF La nena. https://t.co/xofN3353TV 🍋 🍯 https://t.co/hw1R8ygt4c 📸: @jwanyosef https://t.co/pqZ6hN7V8m 🥊’s out. https://t.co/PSywIHk3IP RT @RM_Foundation: Nuestro Presidente Fundador, Junta de Directores y Equipo agradece nuevamente a todos los abolicionistas modernos que ac… Aquí con el grupo folklórico BELELÉ, @EvaLongoria y @ReikMx en una gran noche donde celebramos las vidas que hemos salvado de las garras la trata humana con @RM_Foundation #Libertdad #PuertoRico https://t.co/oeO4T93tTE Almost home. ✈️ https://t.co/71Ar9J9Rzj You are more beautiful than you think. RT @TheEllenShow: There’s something we can all do about the horrible situation in Brunei. Please take action. #EyesOnBrunei https://t.co/UC… Help me in celebrating @MACcosmetics 25th anniversary of #VIVAGLAM! Honored to have been part of a campaign that is working to end HIV/AIDS https://t.co/Ce0lg4V4cg Siamo arrivati a Roma, la mia casa per le prossime 7 settimane 🇮🇹 HEY!!! 🔷🔵🔷 https://t.co/vB7Z7BTMIV #FuturaMujerRadical #Lucia #InternationalWomenDay 💁🏻‍♀️ https://t.co/WOqy9IVqOg Snowing in west Hollywood. #ClimateChange . @VenezuelaAid es la oportunidad para donar y ayudar a nuestros hermanos venezolanos. #AidVenezuela #AyudaVenezuela https://t.co/Xuo2CpFNed Mi gente, estoy feliz de compartirles mi colaboración con la fundación @juegaterapia para diseñar pañuelos #BabyPelonesJT. Juntos podemos darle alegría a los niños con cáncer y ayudar a las investigaciones. \nVisita https://t.co/iQZt27acCI https://t.co/FOukRddS3Y Junto a Elite compartimos nuestra historia, la fortaleza de todos los que estuvieron ahí. Mi gente, no hay nada que no se pueda arreglar sigamos más unidos que nunca. Conoce la historia completa aquí #UnMundoSuave #Elite https://t.co/xuLhJMDLlp Ya estamos listos para contar nuestras historias y hacer que el mundo sea más suave. #MáximaSuavidad #UnMundoSuave https://t.co/JvjnA66CHH Sleepy daddy here 🙋🏻‍♂️ https://t.co/ylJjMnLqvw RT @MTVNEWS: The #GRAMMYs kicked off with @Camila_Cabello, @ricky_martin, @JBALVIN, and a lot of  💃💃🕺🕺 https://t.co/aDkK1JHgLE Cool cat for a date at The Grammys!!! 👨‍👦🙌🏼⚡️\n.\n@RecordingAcad https://t.co/Jw1n6ecy8i RT @RecordingAcad: We are turning up the heat tonight on the #GRAMMYs stage with GRAMMY winner  @ricky_martin! He will join @Camila_Cabello… Ricky Martin Comes Full Circle at the Grammys, 20 Years After His Historic Breakthrough Performance: 'We Are Here to Stay' https://t.co/YoXDfRVoUf via @billboard RT @RecordingAcad: GRAMMY nominees @JBALVIN, @youngthug, and GRAMMY winners @Ricky_Martin and @sandovalarturo1, will join @Camila_Cabello f… See you at the GRAMMYS next Sunday!!! @RecordingAcad https://t.co/E08tdJNmLX #Venezuela. El mundo observa. No más dolor. Justicia y paz YA. LEVANTA LA VOZ. ESTAMOS CONTIGO. 🇻🇪 https://t.co/63caK7UcM5 RT @etnow: Lady Gaga and Ricky Martin on the silver carpet together is ALMOST too much for us to handle. #SAGawards https://t.co/QI6P00pDtb RT @netflix: Watch “The Assassination of Gianni Versace: American Crime Story” for a career-defining performance from @DarrenCriss, the eme… . @jimmyfallon Thank you so much for the amazing show you filmed in Puerto Rico. You captured the essence of both my island and my people. Please come back soon, you are an honorary Puerto Rican. 🇵🇷@FallonTonight Live better, love better. Well deserved @ladygaga. Such a stunning performance #BRAVA 👏🏼👏🏼👏🏼 #AStarIsBorn #Shallow https://t.co/Z4PKf7LH0v RT @ACSFX: Critics agree. Congratulations to the cast and crew of The Assassination of Gianni Versace: American Crime Story for winning the… Gracias mi gente! Comenzamos el año con estas tres nominaciones en @premiolonuestro #premiolonuestro #ColaboraciónDelAñoPopRock #CanciónDelAñoPopRock #ArtistaDelAñoPopRock https://t.co/TGMBD96Ttr Oh what a night. #GoldenGlobes\n@edgarramirez25 @DarrenCriss #SpikeLee #PenélopeCruz https://t.co/HOuPcJxBVs RT @RM_Foundation: Apoyen a @denisebidot quién se encuentra participando en @miraquienbaila por #RMF ❤️🇵🇷🙌🏻 En Ricky Martin Foundation nos… @KashaJacqueline Come on everyone, let’s support our #LGBT friends in #Uganda RT @KashaJacqueline: Hi friends, happy new year. Pls https://t.co/DuSA5cmkM8 pls help share n support. Always your support is appreciated. Tnx #NowWatching #movie LIFE ITSELF 👍🏼 Cuando un Capricorniano pasa la hoja, no voltea a mirar lo que quedó atrás. #esodicen RT @RM_Foundation: ¡Continuamos entregando hogares y brindando esperanza a las familias loiceñas! #RMF #AllIn4PR\n\nWe continue delivering ho… On this #GivingTuesday our family is so grateful for all who have worn our 🇵🇷 over your ❤'s in support of the people of Puerto Rico. Please, get your #Allin4PR shirt before they're all gone this Friday. https://t.co/KSkFecwwQs https://t.co/mnuwNgsF82 Mi gente quedan pocos días para que puedas comprar tu camisa #ALLIN4PR! Gracias por aportar para reconstruir nuestra isla. 🇵🇷 https://t.co/gTUeBBxOlX Muchas gracias hermano mío. Pronto tienes que volver a la isla para que veas lo que nos estás ayudando a reconstruir https://t.co/Bm9vkGe6ZD Gracias hermano!!! Seguimos en la batalla. Ojalá vuelvas pronto a la isla para que puedas ver lo que Nos estás ayudando a reconstruir https://t.co/Bm9vkGe6ZD RT @RM_Foundation: Get your t-shirt today and help us rebuild Puerto Rico! Buy one now 👉 https://t.co/duhnHuoTRp https://t.co/PL9ollYwOD Esooooo essss!!! Muchas gracias @lin_manuel and @vegalteno for being #ALLin4PR.\nTo get your T-shirt visit https://t.co/Fg7q0ynkA0\nA great gift for the holidays!!! https://t.co/eXVLZS4Wla I’m in!!! ☀️🙌🏼☀️ https://t.co/yE8lMtEqeL Noche llena de energía en #Cuenca. Gracias por un show increíble. #Ecuador 🇪🇨 Gracias por su energía. https://t.co/rAUiJv1gUd Ya está todo listo #Cuenca, te veo esta noche! 🇪🇨 https://t.co/Ghza3b4vvN #Cuenca #Ecuador ya no falta nada. No vemos el sábado 3 de noviembre en el estadio Alejandro Serrano. 🙌🏼 🇪🇨 🙌🏼 https://t.co/9C4Geb0JzB https://t.co/rNEoXyS4oR Nadie como nuestra @dayanarapr Gracias chica. https://t.co/8wHqXaVgzN My friend @TheEllenShow is still 100% #Allin4PR &amp; we are so grateful! Thank you my love. Get the shirt we're wearing to help @RM_Foundation help the people of Puerto Rico 👉🏽 https://t.co/Ef9xdUrDU7 https://t.co/mb6RamjIs7 Yessss! Thank you so much @billiejoe big hug to you and your family. 🙏🏽 https://t.co/tWgwlbUYr2 RT @carrieunderwood: So proud of my friend @Ricky_Martin and all of the work he is doing to help support Puerto Rico! Get your shirt to joi… RT @LeoDicaprio @DicaprioFdn Mi amigo, thank u 4 ur constant support for #PuertoRico RT @ricky_martin: To get t-shirt go to https://t.co/Ef9xdUrDU7 #Allin4PR https://t.co/pL0w7mn0Ed RT @ricky_martin: To get t-shirt go to https://t.co/Ef9xdUrDU7 #Allin4PR https://t.co/pL0w7mn0Ed Thank you all! ☀️🇵🇷☀️ https://t.co/a6OT0i2BGb RT @VirginHolidays: Congratulations to @ricky_martin for winning the @VirginHolidays Legend Award at the #AttitudeAwards 🌈 https://t.co/Y2A… #London bound! https://t.co/OYv6AU7d4U RT @LuisFonsi: Me uno con mucho orgullo a esta iniciativa de mi hermano @ricky_martin para seguir ayudando a nuestra isla querida. Sigamos… RT @AlejandroSanz: Aunque pase el tiempo, no nos olvidamos de nuestr@s herman@s de Puerto Rico. \nMi querido @ricky_martin y su iniciativa p… El 3 de OCT estaré con mi querida amiga @EvaLongoria donde nos aliaremos una vez más en el evento filantrópico The Global Gift Gala - CDMX a beneficio de @RM_Foundation #EvaLongoriaFoundation @GlobalGiftUSA y @FundacionDT Más info: https://t.co/xEnxCK6OnJ #GGGCDMX18 https://t.co/f71oi4RwjE #PuertoRico nos vemos el 5 de octubre en el #kqlive2018\n@KQ105 🇵🇷 #uforia https://t.co/BUdFimoRzs To get t-shirt go to https://t.co/Ef9xdUrDU7 #Allin4PR https://t.co/pL0w7mn0Ed RT @TheEmmys: Congratulations to #ACSVersace on your #Emmys win f https://t.co/k3bJhxjZGg RT @TheAdvocateMag: Ricky Martin adds some spice to the #Emmys diversity musical opener! https://t.co/zYyAHjF0MX RT @Variety: Ricky Martin: \"Something very special is still happening when it comes to the Latino community, not only in music but also in… This was stronger than me. Even though yesterday I said next week, I couldn't wait another day. It's one year later &amp; we are STILL #AllIn4PR. From my family to yours, a beautiful symbol of hope.🇵🇷 Join us as we reshape hearts &amp; transform lives &gt; https://t.co/Ef9xdUrDU7 https://t.co/q4aNmq2LF3 My heart is heavy. To deny the deaths of nearly 3000 is mindblowing. Experts disagree. And thankfully, TOGETHER we are powerful. Next week we’ll let you now how you can join us once again to continue to help Puerto Rico.  We’re STILL #AllIn4PR\n\nhttps://t.co/dGp6FegE6E @biswadeeptamang ☀️🙏🏼☀️ RT @HRC: .@HRC celebrates the historic decision of the Supreme Court of India to overturn parts of #Section377 of the Indian Penal Code --… India decriminalises gay sex in landmark verdict #LGBTQ https://t.co/mJMLCbgZdR ~Imagine a country where a shoe ad is more controversial than a school shooting.~ #justdoit ~Don’t ask if your dreams are crazy. Ask if you’re crazy enough ~  #justdoit @LaloGonzalezM @Mon_Mtzs Siempre me gustó Budapest. Gracias por venir al show! See you in Prague! https://t.co/9i6nnznkWJ #TB To when I found out I was nominated. I went crazy. And I think about it now, and I go crazy again. Super excited and thankful . Thank you, thank you, thank you!!! #Emmys  #Emmys https://t.co/Oupz3Y8cDA Me emociona unirme a mi querida amiga @EvaLongoria el 3 de OCT para la 4° #GlobalGiftGala Ciudad de México. Nuestra meta es recaudar fondos para causas que significan tanto para nosotros: @rm_foundation #evalongoriafoundation y @GlobalGiftUSA.  #BetterTomorrows\n #GGGCDMX18 https://t.co/ATrbiFvkaU Únete a @RM_Foundation y ayúdanos a erradicar la trata humana. https://t.co/Oy9otRrXrc RT @etnow: See who's joining the #EmmyFirstTimers club! #Emmys2018 https://t.co/Z65b2WlV37 RT @etnow: .@ricky_martin has come a long way from shaking his bon-bon. #Emmys https://t.co/6Zr9GIDccl Via @Variety * Posted by @RMwebteam https://t.co/nEFFH3YOoX ¿Nos vemos en Praga? Haciendo una donación a RMF podrías ganarte DOS entradas VIP para \"Ricky Martin Live\", DOS boletos  ida y vuelta + estadía en Praga, Haz tu donación: https://t.co/pm7J0GcjwH Todos muy valientes hasta que la cucaracha vuela. 😂 Gracias #Tarragona por tanta adrenalina! España no se pierdan los próximos conciertos! Santiago de Compostela te veo hoy. 🎟 https://t.co/fEpVDYIqUe https://t.co/HoGwNT8H3G Santiago de Compostela, nos vemos mañana en el concierto! \n#RickyMartinEnConcierto https://t.co/1l9Cj6cZPq No one like her. So important to music, culture, civil rights. THE QUEEN OF SOUL. Today we have lost one of the greatest. She will always be remembered and admired. Aretha Franklin, rest in peace. We love you. Santiago de Compostela ya quiero verlos, faltan sólo 3 días! Consigue tus entradas aquí: https://t.co/1l9Cj6cZPq #Tarragona llegó la fiesta. Ya estamos listos para esta noche! 🇪🇸#RickyMartinEnConcierto https://t.co/LllLnKQmLu Anoche en los ensayos de lo que sé será una gran gira europea. Esta noche #Tarragona. Listo para la fiesta. https://t.co/kuq2cKncMU Via @BuzzFeed * Posted by @RMwebteam https://t.co/Q6vJm2xpS1 Ya voy camino a #Tarragona  Comienza mi gira Europea!!!! Quiero fiesta. Estoy listo! Poland, are you ready? #RickyMartinLive Get your tickets here &gt; https://t.co/t13I4GwUNz España, sólo faltan 5 días para que empiece la gira! Compra ya tu entrada aquí: https://t.co/MOlvuo5FLR y no olvides que puedes conseguir también el VIP Meet And Greet upgrade aquí: https://t.co/BYbdmgaxEf Tarragona, los espero en el concierto! https://t.co/sfc2z4YyRF\nYa puedes hacer upgrade a la entrada y tener VIP Meet &amp; Greet 👉 https://t.co/BYbdmgaxEf #RickyMartinEnConcierto Mi gente de España, ya están disponibles los VIP MEET AND GREET UPGRADES! Consíguelos aquí: https://t.co/BYbdmgs8vN Mi gente, falta muy poco para empezar la fiesta! #RickyMartinEnConcierto \nConsigue tus entradas aquí: https://t.co/pX3V1hz8im RT @RM_Foundation: Join the fight against #modernslavery! Go to https://t.co/lLknvSEDb5 and make your donation. You could be the lucky pers… RT @RM_Foundation: ¡Únete a la lucha contra la esclavitud moderna! Entra a https://t.co/VKqZjcHOmJ y haz tu donación. Podrías ser el afortu… #AmazingAbolitionist Princess Eugenie hosts UN meeting on ending modern slavery - https://t.co/5lIbvEKAFj @RM_Foundation Jwan Yosef and the Art of Belonging https://t.co/IIssodoDbc # Budapest! Are you ready to dance? #RICKYMARTINLIVE https://t.co/61v4Sl4uva RT @sagaftraFOUND: Follow along with us when we live tweet our #Conversations with actor/singer @ricky_martin joining us to talk about @ACS… Prague, get ready! #RickyMartinLive https://t.co/JPQiAkjXVP @ialejandritoo Felicidades Alejandro. Eres muy valiente. Que suerte de tener unos padres tan maravillosos.  Con este vídeo has ayudado a much@s. Bendiciones. No, no, no. 🤦🏻‍♂️ https://t.co/siIFSjCiNy Mi gente de España, nos vemos pronto en los conciertos 🇪🇸 #RickyMartinEnConcierto\nhttps://t.co/UmdeVbzGnL 🇫🇷🎉🇫🇷 Félicitations les Bleus! Champions du monde!!!! \n🇫🇷🎉🇫🇷 #worldcup @jrosaly0113 Gracias Johanna. Aquí celebrando. Estoy tan agradecido. Para mi, el mejor premio fue poder contar una historia tan difícil. La industria entendió lo necesario q era hablar d la pérdida d el genio Gianni y las injusticias X las q paso. Esta nominación es pa mi isla, mi P.R. 🇵🇷 \"Milestone Moment\": @GLAAD Praises #LGBTQ-Inclusive Emmy Nominations https://t.co/noA9nXr7Ji https://t.co/AbXmioQgLz #EMMY #acsversace Yes yes yes!!!!!! I’m so happy and humbled about this nomination. I think  my head is about to explode. Joy joy joy THIS IS CRAZY!!! Thank you @MrRPMurphy https://t.co/GZvYKlVQ2l #Racism The level of hate against people of color is getting worse by the minute. #Woman harassed for wearing shirt with #PuertoRican flag 🇵🇷 https://t.co/RLMRY7yZto Tonight’s the night! Don’t miss my #MacysFireworks performance on @nbc! 🎇 Prague, can’t wait to see you! https://t.co/JPQiAkjXVP Hungary, get ready to dance! #RickyMartinLive Get your tickets here: https://t.co/efB5OXCkxw Felicidades #Argentina #worldcup 🇦🇷 \n\nVamos!!!!!!! Poland, are you ready?!#RickyMartinLive 🎶 \nGet your tickets now 👉 https://t.co/t13I4GwUNz Mi gente de España, nos vemos pronto en los conciertos! 🇪🇸 #RickyMartinEnConcierto \nEntradas 👉 https://t.co/h1aRTBf2mI https://t.co/1CNDsT16OB PLEASE Read Statement below #AchildisaChild #ProtectFamilies @RM_Foundation https://t.co/osYgf2RpZT Poland, get ready for the show!!! See you on Sept 7th! Tickets available now 👉 https://t.co/ruGctTV8KF https://t.co/DG6zn54kbJ I’m fighting to stop the United States government abuse of immigrant children. Will you join me? Please sign this petition https://t.co/o32pBIwUGr ¡VIVA MEXICO! 🇲🇽 #worldcup Prague, can’t wait to see you! Show tickets available now 👉https://t.co/D77dd1WxqX https://t.co/NJ0B5u6BVs RT @THR: #ACSVersace's @ricky_martin on life after Gianni Versace's death: “Unfortunately, nowadays, we still deal with homophobia and I th… Get ready #Budapest I can’t wait! https://t.co/wYu7o3gUV5 Budapest, get ready for the show!  Tickets on sale now https://t.co/61v4Sl4uva https://t.co/EyA3VFuZHy Mi gente de España, nos vemos pronto! Entradas 👉🏼 https://t.co/pX3V1hz8im https://t.co/aydaxVsbr9 RT @RM_Foundation: Ricky Martin Foundation y sus aliados en el Proyecto Humanitario #IndesoviPR, @FComunitaria y #MunicipioDeLoiza hacen en… #Fiebre disco de platino 💿 en USA! Gracias mi gente 🎶🔥 @WisinOficial @yandeloficial https://t.co/xXF73jOLpl Ahí vamos!!!! https://t.co/46czOGnJLi Thank you to all the fans and everyone who visited my Residency in #LasVegas it was an amazing experience. To all the team and crew thank you for all those unforgettable shows. #RICKYALLIN https://t.co/7XSPPrEzcX RT @RM_Foundation: .@ricky_martin and @NYCFirstLady at the Gracie Mansion. The Office of the Mayor proclaimed June 7th as\n“Ricky Martin Day… RT @RM_Foundation: .@ricky_martin y @NYCFirstLady ayer previo a recibir su proclama. La Oficina del Alcalde de Nueva York proclamó el 7 de… Sentenced to death at 19 years old: #NouraHussein killed her rapist in self-defence and may be executed : #JusticeforNoura :#Sudan  https://t.co/lDeqwK7ncc #FamiliesBelongTogether #WhereAreTheChildren \n\nplease Re-Tweet Thank you #LasVegas Don’t miss the final shows. @ParkTheaterLV  #RICKYALLIN https://t.co/CcKWkwGJwP RT @ParkTheaterLV: It's your last chance to Shake Your Bon-Bon with @ricky_martin! Don't miss out on his performances June 2 &amp; 3. https://t… ¡Estoy celebrando el orgullo con @Spotify, enviando mucho amor a mi comunidad LGBTQ+! ¡Escucha el playlist Latin Pride: https://t.co/Cbf6oSJ6S0 I'm celebrating #Pride with @Spotify, sending love to all the LGBTQ+ community! Check out the Latin Pride playlist: https://t.co/Cbf6oSJ6S0 #Vegas see you tonight! #ALLin @ParkTheaterLV https://t.co/07vV84XIZY #JoinUs #ALLin @ParkTheaterLV https://t.co/drMAm7xERd Great rehearsal! Ready for tonight! #RICKYALLIN @ParkTheaterLV and the entire run until June 3rd https://t.co/tXoj22gMVF Vegas, get ready! See you tomorrow at @ParkTheaterLV #RICKYALLIN https://t.co/hFjkbhLFXT #RICKYALLIN https://t.co/s7PS9lIDIi @ParkTheaterLV https://t.co/MGE6BUYFMz With my brotha from anotha motha. @edgarramirez25 https://t.co/O3FCya4Iyx Lets talk about #ALLin in #LasVegas. RT if you want to go, already saw my show or if you are going to show up for my next season starting next week??? May 23rd until June 3rd. Let's make some noise!!!! May 23rd until June 3rd RT @TelevisionAcad: Glimpse a behind-the-scenes chat with @EdgarRamirez25, @DarrenCriss, @Ricky_Martin, and Penélope Cruz of THE ASSASSINAT… RT @billboard: .@ricky_martin scores his 17th No. 1 on the Latin Airplay chart with \"Fiebre\" https://t.co/Qss4MdVAjx https://t.co/llZwSha5xM #Fiebre #1 Latin Airplay @billboard 🔥 + Disco de Oro en USA 👏 @WisinOficial @yandeloficial \nGracias mi gente!🎉🎉🎉 https://t.co/LseTvXU3DI RT @Prizeo: Help @Ricky_Martin raise $$$ to fight against human trafficking! Donate now to the @RM_Foundation AND enter for a chance to see… Así o más claro? https://t.co/vHacRugBlL #Fiebre 🔥 https://t.co/h2qmBbS5by https://t.co/jn7mZnNCJk RT @rondenepr: It’s #May and you know what this means, @ricky_martin’s residency #AllIn is… https://t.co/YwIjvUDunn . @Ricky_Martin celebra la primera gala de su Fundación por la erradicación de la trata humana https://t.co/I2Ou3kNkHr RT @RM_Foundation: Gracias a todos por unirse a la causa y ser abolicionistas modernos. #RMFLibertad #NoALaTrata https://t.co/sD3wb5P5DP #Fiebre 🔥 @WisinOficial @yandeloficial vía @billboard  \nhttps://t.co/O6JuxRVv7R https://t.co/za2536TRf4 “Plato in L.A.” Opens at the Getty Villa https://t.co/LLR48raodN Esta noche hay #Fiebre en los @LatinBillboards. Get ready!! 🔥 https://t.co/9AzsdPNO0P 👏🏼👏🏼👏🏼❤️ https://t.co/3RJBqvMaoh One beautiful evening in NYC!! Can’t wait. Such an honor! https://t.co/eBDDLUDelr @Lin_Manuel Nos vemos más tarde hermano! Bendiciones! ¡Que honor! https://t.co/z380jNL4ar RT @glaad: You know what they say... what happens at the #GLAADawards STAYS at the #GLAADawards 👀\n\n(JUST KIDDING, see what this moment is a… #FiebreEnArgentina 🔥🎶 https://t.co/HWILN1g6Vn ~Appreciate the struggle and be grateful~ RT @RM_Foundation: RMF lanza en el @IFFPanama el cortometraje animado I am Little Red en alianza con @marymazzio. Seguido de la película Si… What a great crowd in LA last night. @maluma mucho éxito pa ti siempre parce. https://t.co/idFdkWgT4h (vía @PerezHilton) 🎶 Dime cómo hacer pa' quitar mis penas, que mi corazón no aguanta tanta presión 🎶 #Fiebre https://t.co/HWILN1g6Vn Mi gente, nos vemos en los @LatinBillboards por @Telemundo #Billboards2018 #Fiebre https://t.co/FcKOB7vU9v Las personas transgénero ahora podrán modificar sus actas de nacimiento en #PuertoRico  https://t.co/OKTBcPYF0P 🎉🇵🇷🎉🇵🇷🎉🇵🇷🎉 https://t.co/X8p7qdPMTO #Fiebre @Spotify #VivaLatino https://t.co/v5rfyToZXA https://t.co/mfuJhHtucD Thank you for watching the video and posting your questions! Keep watching #Fiebre https://t.co/HWILN1g6Vn Ready to log in and answer your questions! #Fiebre https://t.co/HWILN1g6Vn https://t.co/aC1gNEFu92 RT @extratv: Exclusive! Go behind the scenes of @ricky_martin's \"Fiebre\" music video! https://t.co/rn7e2eWcGN https://t.co/OoMezFa29A Estaré respondiendo preguntas en los comentarios de mi video \"Fiebre\". Así que ve ahora, mira el video y deja tus preguntas en la sección de comentarios. Mañana a las 11am PST / 2pm EST las estaré respondiendo.\nhttps://t.co/HWILN1g6Vn https://t.co/Jp8prEgCns I will be answering questions on the comments section of my video \"Fiebre\". So head there now, watch the video and leave your questions in the comments section. Tomorrow at 11am PST / 2pm EST I will be answering them there. https://t.co/HWILN1g6Vn https://t.co/CAjTeeGuHv No te pierdas mi entrevista con @Spotify y escucha #Fiebre en el playlist de #VivaLatino.\nhttps://t.co/pvehZ9ZIsr Escucha #Fiebre en el playlist #VivaLatino de @Spotify @SpotifyLatino \nhttps://t.co/eYR4kmQp16 #Fiebre @Spotify #VivaLatino https://t.co/8RIdoUtqkD https://t.co/XZVA06HZnH Mi gente, los invito a ver mi entrevista en el playlist #VivaLatino de @spotify. #Fiebre https://t.co/8RIdoUtqkD https://t.co/l4gjxUF1k7 Vegas, Get ready for tonight #Allin at @ParkTheaterLV https://t.co/Ld9626SpL5 Proud to see these pictures. Kids are the present of our future and we must stand with them. #ENOUGH #MarchForOurLives https://t.co/vazJ6Htuaz Mi gente, la próxima semana podrás ver mi entrevista con @Spotify en el Playlist “Viva Latino” #ArtistOfTheWeek #Fiebre\n\nhttps://t.co/7jxeyuDw9m Parabens @cncomusic #Mamita junto a @LuanSantana #2 en @itunes Brasil 🇧🇷 Vegas, Get ready for tonight! #RICKYALLIN #Fiebre 🔥 @ParkTheaterLV https://t.co/gAbN1fWWjZ #Fiebre pierdo el sentido, me va bajando despacito por el cuello hasta el ombligo y sabes, no tiene cura...🎵 https://t.co/HWILN1g6Vn via @BBCTwo  * Posted by @RMwebteam \nhttps://t.co/yEryfCCLF3 Desde esta noche! #Allin #LasVegas https://t.co/sk0uLzCOav RT @ParkTheaterLV: You heard it from @Ricky_Martin himself! Don't miss his March performances. https://t.co/vAJlBYFR1M https://t.co/iI1qZEU… #THISWEEK @ParkTheaterLV https://t.co/D7GzU8OuG6 https://t.co/gReOJB84xu Ricky Martin's 'Fiebre' Performance Rules Top Facebook Live Videos Chart https://t.co/ZtUzigtr1K 3 DAYS LEFT! #RICKYALLIN @ParkTheaterLV https://t.co/D7GzU8OuG6 https://t.co/Tt4VeJHEH1 #RICKYALLIN 🔥 🔥 🔥 @ParkTheaterLV https://t.co/lk00QWziDl RT @GDLA: Guess what?! @ricky_martin is on Good Day LA tomorrow talking his Vegas residency and @FXNetworks “The Assassination of Gianni Ve… RT @GDLA: Guess what?! @ricky_martin is on Good Day LA tomorrow talking his Vegas residency and @FXNetworks “The Assassination of Gianni Ve… Happy #InternationalWomensDay \nKEEP SHINING 💫 Get ready! #RICKYALLIN @ParkTheaterLV https://t.co/D7GzU8OuG6 España, no te pierdas mi entrevista hoy en @El_Hormiguero a las 21:45h  #Fiebre #Fiebre #PuertoVallarta 🔥 https://t.co/HWILN1g6Vn https://t.co/1qhnhoGAOr RT @TheTalkCBS: Tomorrow… we're live w/ international sensation @ricky_martin! What's your favorite Ricky song? #EverybodyTalks https://t.c… 20 Million Views! #Fiebre 🔥🔥 @WisinOficial @yandeloficial https://t.co/HWILN1g6Vn https://t.co/Zow58C7rFA Mi gente de España, hoy a partir de las 19:00h sintoniza mi entrevista con @Los40 #Fiebre Yo me la paso cada día, pensando en ti! 🎶 Descarga #Fiebre en tu plataforma digital favorita. https://t.co/bUZAySpUCh #Fiebre 🎥 🔥 #PuertoVallarta  https://t.co/HWILN1g6Vn https://t.co/sYnaUAJ4kU #Fiebre 🎥 🔥 #PuertoVallarta  https://t.co/HWILN1g6Vn https://t.co/QkozgbCP3Z via @DailyMailCeleb * Posted by @RMwebteam \nhttps://t.co/KP1wCYpY8V #Fiebre 10 Million Views 💥🎥 https://t.co/HWILN1g6Vn https://t.co/IiGJdLJDF2 https://t.co/HlotJxQ9HO #Fiebre ft. @WisinOficial &amp; @yandeloficial está en la primera posición del playlist “Latino Vibes” en @AppleMusic. Dale play aquí https://t.co/Z9n6NmAysM RT @RM_Foundation: Bibiana Ferraiuoli, Directora Ejecutiva de la Fundación Ricky Martin y la Honorable Maite Oronoz, Jueza Presidenta firma… Sube la #Fiebre en el playlist “Latino Caliente” de @Spotify. \n\nhttps://t.co/ZGABcP63su Hoy a las 18:30h hablaremos de #Fiebre con @europapress @epmusica Mi gente de España, hoy a partir de las  \n20:30h no se pierdan mi entrevista en el Informativo por @antena3com #Fiebre Yo me la paso cada día.....🎶 Congrats  @CNCOmusic you guys killed it out there tonight. The audience loved ur performance.  #ViñaDelMarMusicFestival #Chile was on fire. 2 gold and silver awards and also Most Popular Artist this year #Viña2018 💥💥💥BRAVO💥💥💥 @simoncowell Felicidades a los guerreros de @CNCOmusic por domar al monstruo de la quinta Vergara en Viña Del Mar Chile. 2 gaviotas de oro y de plata. Que sigan los éxitos. Yo me la paso cada día pensando en ti... 🎶 #Fiebre Ft. @WisinOficial @yandeloficial https://t.co/HWILN1g6Vn https://t.co/efd5Z6BOUY #Fiebre está #1 en The A-List Pop Latino en @AppleMusic!  https://t.co/HrnZ03lEYA Te gusto? https://t.co/02czOwtdlL Check out my new single #Fiebre Ft. @WisinOficial and @yandeloficial now on @amazonmusic  https://t.co/LX3e51Fg94 https://t.co/LULLDevFf5 Mi nuevo video #Fiebre ya está disponible en @Vevo 🔥@WisinOficial @yandeloficial 🎥 https://t.co/HWILN1g6Vn #Fiebre featuring @WisinOficial &amp; @yandeloficial 🔥. #Fiebre ya está en @AppleMusicES  https://t.co/HrnZ03lEYA Mi gente no te pierdas mi nuevo video que estrena hoy en @Vevo #Fiebre #PuertoVallarta https://t.co/QletUunnAz #FIEBRE OUT NOW!!!! https://t.co/ZrefMDRfYd Mi gente, #Fiebre ya está disponible en @SpotifyLatino!!\nhttps://t.co/jc8hLNi5KC Join me on February 23rd via Facebook Live! I will be performing for the first time my new single #Fiebre live at the Emirates Airlines @dubaijazzfest \nhttps://t.co/mNB7QpaeQS https://t.co/QrDj9mhfJ3 You can’t miss my show at the @dubaijazzfest #Dubai #bahrain #abudhabi #saudiarabia #Muscat #Fiebre @sheerazhasan https://t.co/Yd69iP6Kas https://t.co/xaorowUnWR Join me on Friday at the @dubaijazzfest #Dubai #bahrain #abudhabi #saudiarabia #Muscat #Fiebre @sheerazhasan https://t.co/Yd69iP6Kas https://t.co/96kF4AWAtw Get ready!! #Fiebre 🎥 #Videos 🔥 FEB 23rd @WisinOficial @yandeloficial  #PuertoVallarta https://t.co/JN4pHGSyHf Ask Alexa to “Enable Today in Music”, then ask “What’s the News?” to hear a sneak peek of my new single “Fiebre”. @amazonmusic #Teaser #Fiebre Ft @WisinOficial &amp; @yandeloficial OUT FEB 23rd @dubaijazzfest @sheerazhasan @MeganPormer #Music #Dubai https://t.co/QfSndcOXX1 #Dubai #bahrain #abudhabi #saudiarabia #Muscat THE ENTIRE REGION, IM READY!!! 🇦🇪 @sheerazhasan https://t.co/s6pQ6VvnU7 See you on February 23rd at the @dubaijazzfest #DubaiJazzFest https://t.co/Yd69iP6Kas Congratulations to @itsricky305 see you in Dubai! Thank you everyone for participating remember you can still Pre-Save #Fiebre 👉https://t.co/EnmcFwbmix Hey sexy gang! One month left! Who’s coming to #Vegas? Quien viene a #LasVegas? #RICKYALLIN @ParkTheaterLV \n https://t.co/D7GzU8OuG6 RT @BBCTwo: 🆕 CONFIRMED 🆕\n\n‘The Assassination of Gianni Versace - American Crime Story’ starts Wednesday 28 February on @BBCTwo.\n\nMore info… My heart is with all the families of the victims in #Florida 🙏  #GunControl Mi gente, get ready! #Fiebre ft @WisinOficial &amp; @yandeloficial 🔥 Pre-save it now! 👉https://t.co/EnmcFwbmix https://t.co/TQ4ClXMzsr It's time to Pre-Save #Fiebre on your @Spotify! 👉https://t.co/EnmcFwbmix It’s your LAST DAY to watch the #ACSVersace finale with me and get lunch with Darren Criss! ENTER: https://t.co/NhuyKAjXhy https://t.co/spW6cDpVNZ Can't wait to see you in Vegas! #RICKYALLIN @ParkTheaterLV https://t.co/D7GzU8OuG6 Quick stop in #Marrakech!!! So beautiful! #Morocco ¡Mi gente, ya puedes pre-guardar #Fiebre en tu @Spotify! 👉🏼 https://t.co/KFvOStj3bb Less than 2 weeks away for my first ever concert in Dubai on Feb 23rd! It’s going to be crazy 😜 and I can’t wait to see you there 🙏🏻 Get your tickets @dubaijazzfest https://t.co/neZxnTtec9 @sheerazhasan #mydubai #rickymartin #dubaijazzfestival https://t.co/IyRfiU0DJb Inshallah 🙏🏻 I’m going to drown the UAE with so much Love ❤ Can’t Wait to See you all at Emirates Airline @dubaijazzfest on Feb 23rd. Let’s celebrate my first ever concert in Dubai! https://t.co/neZxnTbDkB @MeganPormer #mydubai #uae #rickymartin #dubaijazzfestival https://t.co/bkLtJlzO7c Pre-Save NOW #Fiebre on @Spotify! Enter NOW: https://t.co/EnmcFwsXa5 https://t.co/GWTQYPFOiy As-Salaam-Alaikum! Come &amp; join me at Emirates Airline @dubaijazzfest on Feb 23rd. Let’s celebrate my first ever concert in Dubai! Sending love, light &amp; blessings ❤🙏🏻💥https://t.co/0OtQ56a6nb  @sheerazhasan #mydubai #rickymartin #dubaijazzfestival https://t.co/JRf0nnlOqY I want to watch the American Crime Story finale with YOU. Don’t miss out! Support a great cause and ENTER: https://t.co/xGUtoo96wG https://t.co/sl7XJ4Oq9G Mi gente, nos vemos en #LasVegas! @ParkTheaterLV #RICKYALLIN https://t.co/D7GzU8OuG6 Mi gente, follow me on @Spotify!\n\nhttps://t.co/hkw2InxuQf RT @RM_Foundation: Each year, thousands of American children are sold online for sex. WATCH/SHARE new PSA with @ReshmaShetty &amp; others: http… #PuertoRico BrAvo 👏🏼👏🏼👏🏼👏🏼Parejas homosexuales y no casadas podrán adoptar - NOTICEL https://t.co/nH2W7iGNWB Nuevo vídeo #FIEBRE viene YA.  #PuertoVallarta @PuertoVallarta https://t.co/iZcIEG5jST In Puerto Rico, Artists Rebuild and Reach Out https://t.co/imMsMSCfj1 We’re only getting started with #ACSVersace &amp; YOU could watch the finale with me! ENTER now: https://t.co/UaNhxivffX https://t.co/QJTonqr8lQ On set 🎥 #Fiebre Coming soon! 🎶 #PuertoVallarta @PuertoVallarta https://t.co/JCcgRVBrWx See you on March 15th @parktheaterLV! #RICKYALLIN https://t.co/D7GzU8OuG6 See you on Jan 27th!! #CalibashLasVegas2018 https://t.co/iu0oh4iHdr Laughed so hard. https://t.co/hdLBgaKwUP Oi #Brasil. #ACSVersace começa ya por CanalFX_br!!! Espero voces gostem!!! America Latina #ACSVersace comienza YA  por @CanalFX_la. Espero la disfruten American Crime Story: O Assassinato de Gianni Versace! Estreia Quinta-feira, dia 18 às 23h no FX #ACSnoFX @CanalFX_br https://t.co/a78MS05CxQ Thank you Vanity Fair. https://t.co/HlotJxQ9HO #AmericanCrimeStory The Assassination of Gianni Versace. Dal 19 gennaio su FoxCrime @foxtvit https://t.co/0iXsGosuaJ You’ve seen how The Assassination of Gianni Versace begins, but you could watch the finale with me! ENTER: https://t.co/RSs0FoO4sW https://t.co/nw8ASR5oQP RT @jimmyfallon: Great show tonight: @jes_chastain, @ricky_martin, and music from @Franz_Ferdinand! Plus, your funniest #FitnessFail tweets… #ACSVersace trending worldwide! Thank you for your support!!!! Hay que vivir. Más vale decir “me acuerdo” que “me imagino” RT @playbill: .@DarrenCriss, @ricky_martin, and more star in ACS: The Assassination of Gianni Versace, beginning tonight! https://t.co/3872… RT @billboardlatin: .@Ricky_Martin Talks 'The Assassination of Gianni Versace' and Helping Puerto Rico on @TheDailyShow https://t.co/IaJIJN… RT @lgbtpr: Watch the moment that electricity returned to this school in Puerto Rico after 112 days. We celebrate with the children at Acad… RT @GMA: .@ricky_martin on ‘The Assassination of Gianni Versace': \"It's been amazing. Very dramatic, very powerful series.\" #ACSVersace htt… More #ACSVersace Premiere Dates: GERMANY: January 29th on Sky Atlantic HD ISRAEL: January 18th on Yes Edge (cont) https://t.co/fzKEgFV7Ri RT @CanalFX_la: 2 días para que, aún con el cuerpo de Gianni tibio, comience la guerra. #ACSVersaceEnFX https://t.co/CNFXf40Dmz Get ready! #RICKYALLIN @ParkTheaterLV https://t.co/D7GzU8OuG6 #ACSVersace Premier Dates:  USA: January 17th on @FXNetworks LATAM: January 18th only on @Canalfx_la (cont) https://t.co/NB5AkkjCgs RT @RM_Foundation: Advertising the trafficking of people online is NOT illegal. What are you going to do about it? #passSESTA #EndTrafficki… RT @ArchDigest: .@ricky_martin takes AD inside his blissful Beverly Hills home: https://t.co/1kdVIbL20t https://t.co/bhkMujKp8b Presenting in a minute. Presentando en un minuto. #GoldenGlobes Nicole Kidman Joins @ricky_martin at Gold Meets Golden Party https://t.co/k3d6EPiLRf via @JustJared #GoldenGlobes Solidario con los Derechos Humanos de Nuestros Menores. @RM_Foundation \nhttps://t.co/eioRs0DYsV 🙌🏼 https://t.co/WPsvhMA1HO We are back to Vegas! Get your tickets NOW 👉 https://t.co/D7GzU8OuG6 #RICKYALLIN @ParkTheaterLV https://t.co/XslzTJjuwj I love it when I’m there 🙌🏼☀️🙌🏼 https://t.co/WawQZJqZwL Queridos Amigos, Como Fundador y Presidente de la Fundación Ricky Martin, me siento honrado y agradecido por (cont) https://t.co/DQSKqfMRUN Dear Friends, As Founder and President of The Ricky Martin Foundation I am honored and grateful for your (cont) https://t.co/7w6zbOrBqO Golden Globes: Hugh Grant, Ricky Martin, Isabelle Huppert Among First Group of Presenters https://t.co/mmLkdPW3w8 via @thr Quien cumple años hoy???? 🙋🏻‍♂️🎈🎁🎉🎂🎊 😂 Can’t wait to see you in Vegas! Get your tickets NOW! https://t.co/D7GzU8OuG6 @ParkTheaterLV  #RICKYALLIN https://t.co/6V1J4OXDKm The show isn't over yet! We're back again at @ParkTheaterLV \nin 2018. Tickets go on sale Friday, 12/22 at 10am PST #RICKYALLIN https://t.co/aRZgdSu9d3 Manda um beijo #Brasil.  Faz barulho!!  🇧🇷 RT @DavidBegnaud: Wednesday in Puerto Rico\n84 days after Maria\nStatus.pr reports:\n*61% power generation \n(PREPA: “A kilowatt generated is 1… Thank you for an amazing year!  @Spotify https://t.co/LWZADigMlT Official Toll in Puerto Rico: 64. Actual Deaths May Be 1,052. https://t.co/DYbJ2fFEWg RT @RM_Foundation: What an amazing night at @NobuEdenRoc for The Global Gift Gala. Thanks to all that supported and @lyft for getting us th… RT @EvaLongoria: Tonight is the night!!! ✨So excited to once again share a special evening with my dear friend @ricky_martin for The Global… Well done #Austria. #LoveisLove! Human rights for all?🏳️‍🌈 #LGBT RT @DavidBegnaud: Monday in Puerto Rico\n75 days after Maria \nStatus.pr reports\n*68% power generation\n(PREPA: “A kilowatt generated is 1 kil… RT @RM_Foundation: ¡Con tu donación podemos reconstruir Puerto Rico!  🇵🇷 👉🏻 https://t.co/fz7lAh63EG #GivingTuesday #ALLin4PR #DisasterRelie… RT @RM_Foundation: ¡Feliz Día Internacional del Voluntario! Agradecemos a todos nuestros abolicionistas por su compromiso y dedicación dura… SO PROUD!!!!!!! \n\nAll Eyes On: Here's why Latino group CNCO should be your new obsession https://t.co/21NAGKkPpX @realmiguelcotto hermano gracias por todo. Aquí otro puertorriqueño feliz y orgulloso por todo lo q has hecho por nuestra bandera. Muchas bendiciones pa ti y los tuyos. Ahora a disfrutar tu hogar en familia. 🇵🇷🙌🏽🇵🇷 #PuertoRico is facing a humanitarian crisis, the need for continuous support is vital. Join me @EvaLongoria @BoseOfficial on Dec 7 for @GlobalGiftUSA‘s fundraiser, The Global Gift Gala in support of hurricane disaster relief. RSVP@globalgiftfoundationusa.org \n#allin4PR https://t.co/OfF4wYWMyG Gracias México https://t.co/60yAWfPgto Thank you to these amazing kids from Milford School who raised money to strengthen our humanitarian relief efforts @RM_Foundation #GivingTuesday #ALLin4PR https://t.co/vok6MKO856 We've raised $4M in #disasterrelief. Can we get to $5M for the people of #PuertoRico? Click here to donate this #GivingTuesday https://t.co/KxHupLM20u @RM_Foundation Mi gente de México, nos vemos este Sábado 25 de noviembre en el Zócalo. #CDMXPORMEXICO https://t.co/D2ewOgrUju We must sign this please. Debemos firmar esto por favor. https://t.co/vJIXhYpRar #LosAngeles, nos vemos esta noche en el #Uforia @iloveklove Mi gente, nos vemos el 19 de noviembre en el #Uforia @iloveklove https://t.co/XihwuQvgUC RT @RM_Foundation: Join us on Dec 7 for The Global Gift Gala Miami. Our founder @ricky_martin will be uniting forces w/ @EvaLongoria &amp; @Glo… I’m watching 🙋🏻‍♂️ https://t.co/UHDc80CIKL Today is a great day for human rights. #Australia says YES to marriage equality. BRAVO! This makes me so happy. https://t.co/pCLUOhvD06 Gracias @USAHOLA por este gran reconocimiento, al igual que a todas esas personas que han aportado su granito de arena para ayudar a #PuertoRico. Falta mucho por hacer, para donaciones: https://t.co/KxHupLM20u. #ALLin4PR https://t.co/AWKdONz0MY @louipachecofit Thank you so much. Wish you much success for your event! @tyleroakley OMG. really? 🤦🏻‍♂️ Sen. Chris Murphy On U.S. Treatment Of Puerto Rico https://t.co/HBG3tuH4FU via @YouTube RT @ShaunKing: Don't worry everybody. \n\nIt was a white man who slaughtered half of the church in Texas. \n\nThat means everything is just fin… A man just shot parishioners in a church in Texas. How long are we going to have to wait until we hear authorities call him a TERRORIST??? ¡Más escenas! Esto sigue. \n@ACSFX January 17th, 2018 DONT MISS IT. https://t.co/WZLrMSuj8K Stabilization? The mayority of the residents r still w/o electricity without food and some are still drinking water from contaminated rivers https://t.co/VcW9C2Y5CV PUERTO RICO - \"Who we are\" by Yael Deynes 👉🏼https://t.co/QmVgaPy4a6 👈🏼 WE MUST NOT FORGET. To help please go to https://t.co/KTHU0w42ic Mi gente, Gracias por ayudarme a reconstruir mi isla 🇵🇷 todavía pueden donar 👉🏼 https://t.co/qtwDWZy2Jn .@CNCOmusic estoy tan orgulloso de ustedes que sigan los éxitos! Se merecen todo lo que están viviendo. \n#LatinAMAs Join me tonight via Facebook Live at 6:30pm PT/ 9:30pm ET #ALLin4PR .@MonicaAce93 &amp; @MariaSharapova \nThank you for visiting Centro Tau #ALLin4PR 🇵🇷 @RM_Foundation Join me tomorrow on #FacebookLive at 6:30pm PT / 9:30pm ET 🇵🇷  #ALLin4PR https://t.co/VKCy8gB1ut Les apetece un FACEBOOK live? El Lunes a las 9:30pm hora del este de los EEUU 6:30pm hora del Pacifico? RT si te gusta la idea. https://t.co/Mzw3Mzs8Lb @Bethenny But of course. Count on it. Whatever you need. Let’s talk. ¡Vamos a compartir un #MomentoNESCAFE juntos! Visita https://t.co/qQywxhLWmA y participa hoy para hacerlo posible. #ViveConSabor https://t.co/0mf9uZcLXF Gracias a @rm_foundation y a su equipo de voluntarios por su trabajo de amor llevando alimento a… https://t.co/RIZWm5juhZ ¡La música sana mi tierra! Que bella noche. #SomosLive #SomosUnaVoz https://t.co/wDWeIPOT8G . @Bethenny Frankel you are an angel. THANK YOU SO MUCH. #Allin4PR Jennifer Aniston U R amazing Thanx 4 donating $500k for our #PuertoRico relief fund\nWe will never forget. U R saving lives Jenn #Allin4PR (Te amo Puerto Rico 🇵🇷) Ricky Martin llega con nuevo cargamento de ayuda  https://t.co/4oHKwfXDA1 RT @FedEx: Puerto Rico bound with @ricky_martin and 155K lbs of relief supplies. ✈️ 📦  @RM_Foundation #FedExCares Learn more: https://t.co/… 🎶🎶Soy de sangre borinqueña, soy hijo de las palmeras, de los campos y los ríos y del cantar del coqui 🎶🎶. #NowPlaying 🇵🇷☀️🇵🇷 For Puerto Ricans around the world @TheEllenShow is a true friend. THANK YOU! https://t.co/DnoM5FTJIy Thank you so much @TheEllenShow https://t.co/T5ycXNXobr ¡Puerto Rico se levanta! \nPlease, help me help. https://t.co/KxHupM3CS2 #allin4PR https://t.co/7UlTjSJrc7 Babies are starving in the mountains of #PuertoRico Please, help me help. Go to https://t.co/KxHupM3CS2 My thoughts and prayers to all of the people impacted by the horrific act in Las Vegas, and specifically to (cont) https://t.co/He6pzQOMcD Saldremos adelante. #PuertoRico se levanta. Con la frente en alto. Tenemos mucho que hacer pero con amor todo se puede. #AllIn4PR https://t.co/mCSWmXRVVV So sad. Love and light to everyone in #LasVegas. Please do not forget about #PuertoRico. We need your help to rebuild. Go to \nhttps://t.co/KxHupLM20u and please RETWEET RT @ABFalecbaldwin: My wife @hilariabaldwin and I have pledged $50,000 to support @ricky_martin + his efforts on behalf of Puerto Rico.\n\nht… @ABFalecbaldwin @DruckerRebecca @hilariabaldwin Thank you so much. #PuertoRico will not forget. Let's rebuild. 🇵🇷 Let US work hard instead. #AllIn4PR 🇵🇷 https://t.co/KxHupM3CS2 👈🏼 #ALLin4PR https://t.co/KxHupLM20u https://t.co/bACqR98hth Thank you so much @TheEllenShow https://t.co/1zQOiVFyfC Hay q levantar al q se ha caido. Hay q crecer. Hay q construir. Haga su donación aquí https://t.co/KxHupLM20u Thnk U so much @LeoDiCaprio @wecaresolar &amp; @MusicForRelief U R all amazing. My #PuertoRico will B 4ever grateful. U R now familia #Allin4PR https://t.co/DpCDpoNl0a There are no words 2express my gratitude. Thank u for donating to help #PuertoRico. Let's go 4more! https://t.co/KxHupM3CS2 #AllIn4PR https://t.co/tDcYGTvqlw Thank you @theellenshow for being #Allin4PR! Together we will bring love, light &amp; hope to #PuertoRico Join us: https://t.co/KxHupLM20u Puerto Rico urgently needs our help! DONATE NOW https://t.co/KxHupLM20u &amp; help provide immediate humanitarian relief #AllIn4PR https://t.co/lIS5SkAkLu @ShaneMasYMas thank u so much. 🙏🏼 THIS IS A NIGHTMARE. THIS IS CRUEL @uscongressdotgov US won't waive shipping restrictions for Puerto Rico relief https://t.co/io30gVtxFj RT @NickyJamPR: Es un gusto para mi anunciar los Nominados al @LatinGRAMMYs en la    categoría Canción del Año ¡Felicidades a todos! #Latin… RT @LatinGRAMMYs: Felicidades a todos los Nominados al #LatinGRAMMY en la categoría Grabación del Año ¡RT para felicitarlos! https://t.co/u… #PuertoRico ARRIBA! El mundo escucha. https://t.co/hJ9NzEXynK RT @ChelseaClinton: Mr. President? https://t.co/NyQbTsH15S RT @MikeDelMoro: Puerto Rico's Governor Ricardo Rossello pleads for help from the Trump admin and congress after \"unprecedented disaster\" h… THIS IS NOT RIGHT. WE ARE IN THE MIDDLE OF A HUMANITARIAN CRISIS. THERE SHOULD BE LAWS AGAINST THIS. https://t.co/tmG1CXPQAS Mi gente, Gracias a todas las personas que han donado. Seguimos necesitando de tu ayuda para reconstruir #PuertoRico https://t.co/KxHupLM20u @Rosefucsia @ElGordoyLaFlaca https://t.co/KxHupM3CS2 @carolin88485457 https://t.co/KxHupM3CS2 @Alex_Orue gracias WE NEED YOUR HELP. PLEASE DONATE. https://t.co/1vjiISj3af https://t.co/GXSZP7Gya7 My people are in need. Please help me\nhttps://t.co/KxHupLM20u https://t.co/r5WTpJCZnJ Mi gente necesita. Ayúdame https://t.co/KxHupLM20u https://t.co/Ho8RI26MVQ 3.4million people. Together we will rise. #PuertoRico 🇵🇷 No puedo dormir. Mi mente está  en Puerto Rico 🇵🇷 con mi gente. Somos fuerte. Reconstruiremos. Unidos. #CDMXporMEXICO #MEXICO 🇲🇽 https://t.co/dCXGjckIqU Mi gente de Puerto Rico, el Caribe y México mi corazón está con ustedes. Somos fuerte. Y unidos podemos con todo. Mucho amor 🙏 https://t.co/mRBCiZdKrx México mucha fuerza estoy con ustedes. 🇲🇽 An Inconvenient Sequel: Truth To Power (2017) - Official Trailer - Param... https://t.co/qc0MbchBnw In Puerto Rico, we welcome you this holiday season! https://t.co/o5sphZB7YG Mi gente, solo necesitan @NescafeLatino y contarme cómo viven con sabor para poder ganar un café conmigo. Visita https://t.co/qQywxhLWmA https://t.co/dn1y5aeYps RT @RM_Foundation: Solidarios con #PuertoRico! Conoce cómo apoyar luego del huracán Irma @serpuertorico @NuestraEscuela @iniciativaPR \nhttp… Gran noche en #FashionFest. Pensando en mi gente por el sismo vivido mucha fuerza México! @liverpoolmexico I'm #ALLIN to end human trafficking! Join @RM_Foundation today is the last day to participate https://t.co/xWP5FGpMAh Ya en México para presentarme en el #FashionFest @liverpoolmexico RT @liverpoolmexico: ¡Bienvenido a México! Te esperamos en #FashionFest Otoño-Invierno para disfrutar de @ricky_martin https://t.co/jTCYsJ6… . @fema watching the news, I only hear about budget allocation for Florida regarding #IRMA. Now tell us about Puerto Rico. Mi gente de Puerto Rico y el resto de las Antillas manténganse en contacto #IRMA https://t.co/9fFCJYs72L #NowPlaying #RickyMartinSpecial on @VH1 . @VH1  Behind The Vegas Residency Tonight at 10/9c 🎤🎰 #RickyMartinSpecial https://t.co/JdE9t4kCBQ RT @VH1: We KNOW you really want it💃 Go behind the @Ricky_Martin Vegas Residency TONIGHT at 10/9c on @VH1 🎶 #RickyMartinSpecial https://t.c… @yearsandyears big hug to you all! ✌🏼 Happy Father's Day #Australia #Repost steveaoki \n・・・\n#aokijump #816. The Aoki x @ricky_martin #livinlavidaloca Jump. The Rock… https://t.co/rU64vyDE0V RT @RM_Foundation: Gracias a todos los participantes de nuestro 9no Torneo de Golf! ⛳️#NoALaTrata #RMF RT @VH1: Do you know what it takes to impress @Ricky_Martin? Go behind the #RickyMartinSpecial with this sneak! https://t.co/E09F50xD7c #Gibraltar we have arrived. Ready for tomorrow's concert. @mtvGibCalling https://t.co/MFA4Kz89E8 Love loves love ❤️ Get ready! Go #ALLIN behind my Vegas Residency.  MON SEPT 4 10/9c on @VH1 #RickyMartinSpecial https://t.co/Sxhlhgm4S1 Felicidades chicos por ser ganadores de 3 #PremiosTuMundo @CNCOmusic RT @papermagazine: \"Every time I'm there, I just feel the energy in those walls...\" --@ricky_martin https://t.co/Oeohlz3avJ Well done #Boston. #TotsSomBarcelona https://t.co/d4r3I0OZVP RT @ricky_martin: Mi gente, apoyemos a @rm_foundation, únete a la causa y podrías ganar un viaje a ver mi show en #lasvegas #ALLIN https://… Mi gente, apoyemos a @rm_foundation, únete a la causa y podrías ganar un viaje a ver mi show en #lasvegas #ALLIN https://t.co/xWP5FGpMAh Que ganas tengo de llegar a #CostaRica 🇨🇷 🇨🇷 #CostaRica, ya casi llegamos. Q ganas d estar con ustedes. Prepárense para la fiesta en El Centro de Eventos Pedregal el 16 de agosto Ryan Murphy Spills Details About 'The Assassination of Gianni Versace' https://t.co/lAcz1EPKYT via @thr #NowPlaying  \"It ain't fair\" by @Bilal and @TheRoots from The \"Detroit\" Original Sound track. @fallontonight (THANK YOU GUYS) Sup? https://t.co/uhlrjzvaEE #AmericanCrimeStoryVERSACE https://t.co/F61AmlYHvD (KHALLAS ✋🏼Enough is enough)  First #LGBT fighting unit to fight ISIS is created in Syria https://t.co/usKvcnA9fA #Latinoamérica, te espero en Las Vegas! https://t.co/LLlEzZZQTZ WOW! Thank you #LasVegas Best New Resident: Ricky Martin. https://t.co/9P3jiDzwLf  #LasVegas via @LasVegasWeekly Primer latino en alcanzarlo! Que alegría! Gracias a todos los que me ayudan a cumplir mis sueños. ¡Seguimos! https://t.co/UnAY0bKEKM YESSSS!!! Thanks to everyone involved https://t.co/n93khDKmgD .@ElNuevoDia publica historia de trata humana. Unamos esfuerzos para que los responsable paguen por esta acción. https://t.co/FvY4NmaHaQ For millennials, parents of millennials and also for those NOT SO MILLENNIALS 🙋🏻‍♂️ https://t.co/IpZnFknL1l Be unique. Be remarkable. Be rare. This world needs it. @claudomi aquí estoy leyéndolo todo. Mi gente, esta noche cantare en México D.F. ¿Cuál de las baladas de todo mi repertorio debo cantar? 🎼🎤🎶 What a perfect way to wake up!So much #pride! Hab, vi saknar dig. \nHappy Pride everyone! #Pride2017 #gaypride #gaylove #gaylatino #🏳️‍🌈 https://t.co/CQt1t5v6GY Tonight at The Park Theater in #LasVegas. \nIt's going to be insane! I'm ready for a good time! See you there! https://t.co/Wk5fmvjyfM Watch: Trevor Noah grieves for Philando Castile, black lives, and American justice https://t.co/L4ndbcbQPu Mi gente, a través de #Delta llegarás a tiempo a #LasVegas para que puedas ir a ver el show #ALLIN! https://t.co/LLlEzZIg2r #AmericanCrimeStory https://t.co/ODuFbbzoFv Check this video out 👉🏼 https://t.co/TixPllCnZg  \"A Matter of Life and Death\" lgbtqt+ refugees RT @tyleroakley #WorldRefugeeDay .@Delta está #ALLIN, pronto viajarán sorpresas para Latinoamérica. Congratulations @CNCOmusic! Let’s vote by tagging their account and using these hashtags #TeenChoice #ChoiceLatinArtist! https://t.co/D7KZlLOajf Stretch. Don't forget. Stretch. #VentePaCa 1 Billion views!! @maluma https://t.co/NFdd8YKRyA #Portugal muito obrigado por todo. Eu tive uma noite maravilhosa em Lisboa. #MeoArena .@HRC has launched a great new Spanish resource center for the #LGBTQ &amp; allied #Latinx community. Check it out at https://t.co/9z8WROPOFy! .@HRC lanza nuevo centro de recursos en español para la comunidad #Latinx &amp; #LGBTQ y aliados. ¡Compruébalo en https://t.co/9z8WROPOFy! RT @RM_Foundation: Gracias a todos los participantes, auspiciadores y voluntarios por su apoyo al #TauBeachSoccerJam Nos vemos en el 2018!… Esta noche fiesta en Valladolid! ¡¡Te espero!!\n#España  #Spain #concierto Example of hate in #America https://t.co/TsPORNdopK #HalaMadrid @LuvIsADonut mil besos nena bonita. Se q todo estará bien. Eres luz. Cuando vuelva a la Argentina nos veremos y te daré 1abrazo apretado. 😘 Ricky Martin shows off banging body in tiny swim shorts https://t.co/GNu41AOau0 via @DailyMailCeleb RT @RM_Foundation: Education is Freedom. Watch @IamJaneDoeFilm on @iTunes @GooglePlay on 5/12 Join us #IamJaneDoe  #SpeakOutFightBack\n#rmf… Felicidades a los participantes de #RapellingDesafío y gracias a todos los valientes q participaron. @RM_Foundation https://t.co/JhLoAV6E0N A Trump Fan Just Got Caught Harassing A Muslim Woman On Camera - https://t.co/CGhGs4LDPp PLEASE RT who is this woman? Gracias a todos los q aceptaron el reto y hoy participan en #RappellingDesafío @RM_Foundation https://t.co/b1OLlvsO5e Watch Merkel pressure Putin to stop the purge of LGBTQ people in Chechnya https://t.co/LMIxdbf8Ju via @lgbtqnation WHAT IS GOING ON??? https://t.co/O5KMu7Zs4J RT @wilredd: As of 12:38PM 05/01/2017, @nytimes has yet to speak about the NATIONAL STRIKE in a US TERRITORY. STOP ignoring the #ParoNacion… RT @wilredd: As of 1:10PM 05/01/2017, @BostonGlobe has yet to cover the NATIONAL STRIKE in a US TERRITORY. STOP ignoring the #ParoNacional… #ParoNacional #PuertoRico,  Siempre, estoy contigo. Manténte de pie buscando la justicia para nuestra tierra. Mucha paz y mi abrazo... Un millón de views en menos de 12 horas. BRAVO @CNCOmusic https://t.co/rdPOuySr5k #Venezuela que triste ver estas imágenes.  Siento tu dolor. Estoy contigo. Te abrazo. Mucha LUZ.… https://t.co/ojbqpgUmVa Mi gente #PuertoRico no falten mañana al show q les tienen preparado @CNCOmusic. Les va a encantar.1 vez +, gracias X el apoyo d siempre. RT @RM_Foundation: @carlosdelgado21 se une al grupo de valientes de #RappellingDesafio Gracias Carlos! Apóyalo con tu donativo https://t.co… @djamieable @pusherlovegurl @NinaNainaNuna gracias 😊! What a cool night! Thank U @SpikeLSB @KateUpton, @LLCoolJ, @ChrissyTeigen,  #LipSyncBattle #CutFootloose https://t.co/AsWpZjJ5jA RT @SpikeLSB: .@Ricky_Martin vs. @KateUpton starts NOW on @Spike! Join the convo using #LipSyncBattle https://t.co/OBCJl6JgDq RT @SpikeLSB: .@Ricky_Martin channels @TomCruise on tonight's #LipSyncBattle! https://t.co/KAk9PcERdM . @Ricky_martin Dances in Tighty-Whities, Channels Tom Cruise for ‘Lip Sync Battle’ – Watch Now! https://t.co/5sGv7l8ukE via @JustJared . @Ricky_Martin channels Tom Cruise's tighty whities moment! https://t.co/DH8yuXAJzp via @DailyMailCeleb #LasVegas see you in #June https://t.co/M9hU3fz1ra @Eternal49825487 💥💥💥🙋🏻‍♂️ What an amazing 1st run in #LasVegas. Thank you all who came. I'll be back in June for more.  #ALLin https://t.co/uYgLxHgVks Over a hundred men suspected of being gay are being abducted, tortured and even killed Chechnya - act now! https://t.co/U2okz4YJJE RT @papermagazine: @Ricky_martin to star as Gianni Versace's lover in new season of @ACSFX: https://t.co/l9b0XL91xW https://t.co/Brzzq7OehM So ready! #Allin #LasVegas So proud of Nancy, she really shook her bon bon tonight. #dwts #mirrorballers https://t.co/jRY1tdOZ3F ALL IN #lasvegas #ALLin https://t.co/TDfH5Jeyco Back to life. So beautiful. https://t.co/JH3Dwqcfxg #TEAMRUBIO 🇵🇷💥🇵🇷 Que orgullo siento por #LosNuestros buenas vibras en el partido de esta noche @beisbolpr \nArriba boricuas 🇵🇷💥🇵🇷 How to piss off a #puertorican? https://t.co/F21MRJhzni 🇵🇷 .@CNCOmusic BRAVOOOOO! https://t.co/JBxxXlskxr Seguimos en esta batalla! https://t.co/K9cQhDPTvw TRANS EQUALITY NOW! Eres valiente @Moluskein, gracias por tu apoyo eres un guerrero!! #RappellingDesafío @RM_Foundation https://t.co/6u1Cqf0isN In just a month. See you there. https://t.co/s7PS9lr2jI https://t.co/pwTm6sBEbj RT @CNCOmusic: #VentePaCa @ricky_martin @maluma https://t.co/fIPIfYBygM RIP Srinivas Kuchibhotla. All my love to his family and the entire Indian-American community. #StopTheHATE #JusticeforSrinivas US Citizen born in #PuertoRico detained as illegal immigrant, what was DHS/ICE thinking? https://t.co/7R0Pk7kiPm .@RM_Foundation seguimos al pie del cañón. #NOMASTRATA https://t.co/351XKuEPQt Removing laws protecting fellow #Trans in the #USA? NO NO NO. THIS IS ALSO WRONG. SO WRONG. So sad #humansrights Vente Pa'Ca #PremiosLoNuestro https://t.co/77i7DoToxL Felicidades @CNCOmusic por su primer #PremioLoNuestro son los mejores!! #CNCO Check out my interview with  \n@HarryConnickJR #RickyALLIN https://t.co/7UFzYxJnRQ Great time at @DrOz . See you in #lasvegas! #RickyALLIN https://t.co/hjGuAfE00G April 5th in Las Vegas with my show called ALL IN  #residence #RickyALLIN #lasvegas https://t.co/D7GzU8OuG6 https://t.co/aNoHTVRyYJ @LuisFonsi hermano gracias. Seguimos trabajando duro.Felicidades por todo. Abrazos a la familia. Nos vemos en LV. RT @billboard: .@Ricky_Martin talks Las Vegas residency on #FallonTonight: \"I cannot wait\" https://t.co/zg0k7ShHiS https://t.co/H3BUzKuMNo https://t.co/s7PS9lr2jI Tonight on @fallontonight!!!! Don't miss it! #LasVegas #Allin @jimmyfallon WELL DONE!!!  @aplusk https://t.co/cxQXIuY51Q 💥❤️💥 https://t.co/9IhLioYoKI Grazie mille Italia!!!! Che bella serata, che bello pubblico! 🇮🇹 #SanRemo Happy Chinese New Year!!! 🇨🇳 I wish I was in Australia right now 🇦🇺 Ashley Judd speech. #Visceral. https://t.co/akWEUe34vs Con Oscar, mi isla respira #libertad\" https://t.co/uYcmbTqhtp  #OscarLopez .@Pudge_Rodriguez se convierte en el 4to boricua en ser exaltado al @baseballhall #HOF2017 felicidades hermano! Otro gran día para mí Isla ¡Hoy mi islita es la más feliz! Se hace justicia. Gracias @BarackObama por liberar a nuestro Oscar López RT @helgagarcia: Hoy todos somos más libres. Oscar regresa a casa, ¡Gracias! Aquí la mano @ricky_martin en solidaridad con Oscar @LatinGRAM… \"El mundo no será destruido por quienes hacen mal. Sino por aquellos que observan sin hacer nada\" A.E. https://t.co/8KfCmQfIKK 🎂🎉🎂🎉Celebro mi cumpleaños una semana antes y una semana después. 🎂🎉🎂🎉 Please sign petition For President Obama to free Oscar Lopez Rivera before he ends his term as President. https://t.co/HXcTdMCGPd RT @thelatintimes: . @ricky_martin is gonna be very busy next year! https://t.co/Mk00COgc6W Nunca hago play back. NUNCA. Mi voz siempre en vivo. Come on gang, Sign and RT for President Obama to free Oscar Lopez Rivera before he ends his term as President. https://t.co/HXcTdMCGPd Can’t wait to see you in Vegas! Get your tickets NOW! https://t.co/OHXjDYIC0x #SexySouls, can't wait to see you in Vegas! Get your tickets on presale NOW at https://t.co/OHXjDYIC0x For those asking how it went. https://t.co/z2WQUUln1E via @ellentube ❤️ Announcing my Las Vegas residency at Park Theater April- Sept 2017! All dates &amp; sale info here: https://t.co/OHXjDYIC0x RT @JustJared: .@ricky_martin just announced he is launching a Las Vegas residency! https://t.co/jgRMMsMzUO https://t.co/q1eC65EHka With @EvaLongoria celebration humanity in #MexicoCity for  @evalongoriafoundation @globalgiftusa y @rm_foundation #GGGMXC16 https://t.co/IslD6NjtCs Quiero agradecer a todos los que nos acompañaron anoche a nuestra Ga.... https://t.co/YxWWmatJuZ https://t.co/y4KP70NcKZ Come on peeps. Let's do this. He needs our help. https://t.co/35cBo7clwp Ricky Martin: Hoy hay más esclavos que nunca antes en la historia https://t.co/rUmiPgjxKv- 💥❤️💥 https://t.co/2GsU1zoHKc \"Never stop believing that fighting for what's right is worth it\" @HillaryClinton I insist, #LaPaz  is one of the most beautiful cities I have ever been to. #OneWorldTour #Bolivia #SantaCruz #Bolivia! Gracias por una noche inolvidable. Mañana #LaPaz nos vemos allá. #OneWorldTour 📸: @omarcruz https://t.co/T1A4WNsItH Ya llegue a #Bolivia! Contento d estar d vuelta. Ya me estoy comiendo 1 majadito y un zonzo. Que delicia. 🇧🇴Esta noche show en #SantaCruz Trump admitting sexual assault. Clinton emails. Trump charity fraud. Clinton emails. Trump calls for nuclear (cont) https://t.co/OJRKTxzsCi 😴 https://t.co/Ng4u7NFBT8 We have to show up everyone. Go out and #vote. #imwithher SO WITH HER! Aquí preparándome. Casi saliendo al aeropuerto. #Chile por ahí voy. 🇨🇱🇵🇷 Mi gente, sigan participando en https://t.co/4tmydYtwQY para hacer realidad el concierto privado. https://t.co/FXb1U1QGvw #VentePaCa y... vota!  https://t.co/hfUTGozF9Z  https://t.co/CxZVE9EnWt @zeljkobreathe can't wait to go! Next summer for sure! This video helped me a lot. Thank you @tyleroakley https://t.co/sVykKblrR1 #NationalComingOutDay #LGBTT ~Cuando madures, avísame. Estaré en los columpios. ~ Chicos ustedes son grande! @CNCOmusic felicidades por una gran noche en los #LatinAMAs Venga mi gente. Regístrate y vota en estas elecciones. La comunidad latina es muy poderosa. Hazte sentir https://t.co/11pTaFfDH0 I'm with her. So with her.  #imwithher RT @HillaryClinton:\n\nhttps://t.co/CxZVE9mMxT RT @instagram: Today on our story: Join @ricky_martin and @maluma for their gig in London #Ventepaca https://t.co/litgu8XbwM RT @instagram: Hola, @ricky_martin! Check out our story to go behind the scenes of his concert in London. https://t.co/kt0inRkgh7 Mi gente, muchas gracias por todo el cariño! #VentePaCa canción #5 en Most Playlisted Tracks de @Spotify en los últimos 7 días @maluma @BrendonVeevers Thank you for kind words. I look forward to returning to London soon. https://t.co/sboQUfudeM @noaamouyal Thank you for kind words. I look forward to returning to Tel Aviv soon.\nhttps://t.co/yu5XFixZwT Venga mi gente a votar por @CNCOmusic #Sisepuede https://t.co/8JXrvNR09a RT @InstagramES: ¡Vente pa’ Instagram, @ricky_martin! Recorre un día de su gira a través de las historias de @InstagramES  #ventepaca https… Que pasa mi gente? Aqui mi mas reciente sencillo #VentePaca Con @maluma. https://t.co/d7KqrrVW0L Mi gente, no te pierdas mañana el estreno de mi nuevo sencillo #VentePaCa a través de \"Facebook Live\" con @maluma https://t.co/mxNqXpmkWW ¿Están listos? #VentePaCa @maluma https://t.co/UuvtFRK48o Mi gente, don't forget to join my #OneWorldTour FB Live from #London on 9/23 to be part of #VentePaCa con @maluma https://t.co/FZhIBUc3Sm Tomorrow night #OneWorldTour in #TelAviv  lets do this. Cant wait. https://t.co/f43XPnD9NA #tangerinenightmareTrump https://t.co/hWMdiVjLvL Already in #Antalya! Ready to hit The stage tonight!!!!! #OWT #OneWorldTour #Turkey Hoy se acabó. Mañana en la noche a #Tenerife  #Spain 🇪🇸 https://t.co/G2eWYK0HzW Felicidades @cncomusic! Que orgulloso estoy de ustedes!!! #PrimeraCita #1 on Top Latin Albums 👏 Tenemos que apoyar el talento actoral de un grande como Edgar Ramírez es su pelicula \"Hands Of Stone\" esta semana https://t.co/8t9eBsvKTS Únete a nuestra fiesta, sube un selfie usando #VentePaCa y ¡prepárense que el 23 de Sept les tenemos una sorpresa! https://t.co/6dhvtoB4LB Q.e.p.d Juan Gabriel. Orgulloso de mis chicos @CNCOmusic felicidades por el lanzamiento de su primer álbum #PrimeraCita descárgalo https://t.co/Fs4wvmJmdp ❤️🇮🇹❤️ Get ready for what's coming @maluma #VentePaCa @ Miami Beach, Florida https://t.co/ndZe0PTVNL \"Why do we only rest in peace? Why don't we live in peace too?\" RT @PuertoRicoPUR: Great start for Puerto Rico's Rafael Quintero #Diving #Olympics #PUR #Rio2016 https://t.co/0p9ydqwlmV RT @RM_Foundation: Hoy es el día! Disfrutando del comienzo de nuestro tan esperado torneo de golf! https://t.co/DcNOAhmqEx .@JavierCulson hermano pa'lante. Eres luz para PR. No lo olvides. Se me infla el pecho d saber q hay boricuas como tú #GraciasCulson ¡Hoy voy por ahí vestido de oro! #PUR #PuertoRico 🇵🇷😉 @MonicaAce93 Hoy, sin duda alguna, mi Puerto Rico es la isla más feliz del mundo. #GRACIASMONICA  🏅💥👊🏼 @MonicaAce93 #PUR .@MonicaAce93  estamos contigo Boricua #PicaPower #PUR Relaciona Sunday #NowPlaying Rufus Wainwright \"Go or go ahead\" .@MonicaAce93 Felicidades campeona. Que orgullo para todos!!!! Una bendición para nuestra tierra! Te ... https://t.co/Z7cr2zc2OP Read @mmflint's open letter to Ivanka Trump https://t.co/n9ecDqvXlp Venga mi gente, voten por @cncomusic \nhttps://t.co/kxfxDrNn57 #Kenya #safari https://t.co/lVBld6y5GN #SexySouls the #OneWorldTour is back. See you soon!!! https://t.co/SXXkxBluc2 Aquí la portada de #CNCO, chicos Felicidades! Sigan con su enfoque. Éxito y más éxito. https://t.co/yZQhsusDxr Tickets are on sale NOW for my very special show in London. Can’t wait to see you there. https://t.co/7yfKCLr15p How did Hitler rise to power? - https://t.co/q6htovHsE2 Sounds familiar? @catiejb see u there! ✌🏼️ RT @BernieSanders: Trump is wrong. The real cause of instability in the Middle East was the Bush-Cheney invasion of Iraq. By the way, where… Super orgulloso de ustedes chicos!!! @cncomusic este es el comienzo de tanto esfuerzo y dedicación.  #PremiosJuventud Gracias mi gente! Ganamos TheSuperTour en #PremiosJuventud!!! Que siga el #OneWorldTour! #prayforIraq  heartbreaking. RT @UNICEF: Join @ricky_martin to #FightUnfair and ensure a better future #foreverychild https://t.co/Klnw9rXvPF https://t.co/1y1G9qrYK2 #FF @CNCOmusic. And on Facebook https://t.co/hddVQGTkH2 RT @Balmain: .@Ricky_Martin with @ORousteing at the men’s #BALMAINSS17 show #BALMAINARMY https://t.co/dy8B9bljEv RT @armani: .@ricky_martin​ shares his thoughts after taking in the #GiorgioArmani #ss17 show. #ArmaniStars #mfw\nhttps://t.co/92aDqNNDgG Grazie per tutto Milano. Ci vediamo la prossima volta. 🇮🇹 https://t.co/6uLchHrNrl Amico. #MFW https://t.co/Bp2QPbVLoF .@PedroJulio Que espíritu tan maravilloso. La comunidad #LGBTT del mundo está en deuda contigo. Gracias hermano. Gracias héroe. .@PedroJulio Eres un campeón.Qué manera tan hermosa de ayudar y motivar a nuestra comunidad en medio de tu luto. I will never cease to fight for love. https://t.co/qTKAShzl9N Nunca dejaré de luchar por el amor https://t.co/r2KnVInll9 https://t.co/G1jtF1J6cS Hospitals in #Orlando in desperate need of blood to save victims of the attack but as a gay man I can't donate. #FDAlifttheBLOODbanNOW Por aquellos que lo único que querían era ir a bailar. #PrayforOrlando https://t.co/mgHOeTQkHZ Please, please take a second to read and watch informative video. https://t.co/FSg9hZjQUK #PrayforOrlando El fácil acceso a las armas en los Estados Unidos promueve crímenes de odio e intolerancia. ES HORA DE QUE EL CONGRESO ACTÚE. I am gay and I am not afraid. Love conquers all.  #PrayforOrlando Today's plan for #studiomode, abruptly postponed. #CôteD'azur #France 😎 https://t.co/K0ilmEEJya Easy like Sunday morning. ✌🏼️ unicef \nI have new Syrian friends in Lebanon. I truly admire their perseverance and spirit in… https://t.co/6aEBpLPYPW Listening to their stories. #syrianrefugees #syrianrefugeechildren #Lebanon @ Kfar Zabad, Bekaa https://t.co/dlIxY88HME Just spent 3 days at the lebanese/syrian border working with unicef. This amazing organization… https://t.co/GuQaP26300 El brillo de los ojos no se opera. @victorg91 Felicidades. ¡Paz! Follow your gut. Activista denuncia violencia homofóbica de pastor... https://t.co/XFAiuW5UQ1 via @wordpressdotcom Happy mothers day familia. Gracias a todos los participantes del #RappellingDesafio por apoyar los esfuerzos de @RM_Foundation ¡Juntos por un mundo libre de trata! Back @ #ennisHouse. It's been a while. #VuelveVideo  #FranckLoydWright #music #architecture https://t.co/netnRhX7a7 Apoya a los valientes inscritos en #RappellingDesafio y ayudarás a @RM_Foundation en su lucha contra la trata Humana https://t.co/qjlPPm7XrE Todas mis oraciones y solidaridad para estos momentos difíciles. Fuerza #Ecuador .@Lin_Manuel caballero! Q orgullo! Eres luz para nuestra comunidad.Q siga la inspiración y q siempre sea de impacto para el mundo #pulitzer PM in #LA. https://t.co/X8H1M4aR7f #PuertoRico: Corte d Apelaciones d Boston revoca a Juez Pérez Giménez en el caso del matrimonio igualitario y ordena se asigne nuevo juez. El amor y la igualdad ganan, #Colombia dice SÍ al #MatrimonioIgualitario! #TeshimaArtMuseum https://t.co/P7euaU0o3W #Naoshima #Japan #ChichuArtMuseum https://t.co/34fy3zAC4c Rise And Live. \"coberto com toda poeira por mover uma montanha\" 💪🏼 .@NoahMamet Thank U 4 for inviting us to ur home.Great discussion about human trafficking. Let's keep fighting this horrible crime my friend RT @PedroJulio: P.R. no dará 1paso atrás en derechos LGBTT. Mi columna en @ElNuevoDia sobre decisión d Pérez Giménez https://t.co/5yd5Njq8Xc La decisión del Juez Pérez Giménez es incongruente con principios constitucionales de igualdad. La igualdad matrimonial es ley en EEUU y PR. #FelizDiaDeLaMujer\n#InternationalWomensDay #Magic in the air! #Cordoba #Argentina #OneWorldTour https://t.co/Lj82Z0NLmt HAPPY #MARDIGRAS #SydneyMardiGras #Australia! Would love to be there right now. Todavía estoy escribiendo mi historia. Estoy muy lejos del final. Just watched the GOP \"debate\". \"The family values party\". I'm disgusted. RT @wegiveadamn: NYC #StPatricksDay parade ends ban on #LGBT groups. MR @BilldeBlasio ends boycott of parade https://t.co/8VPcwIKScq https:… #ImWithHer @HillaryClinton @ForHillary #STOPHUMANTRAFFICKINGNOW https://t.co/B2vDcubspZ @RM_Foundation More intuition. @jpus_paraguay gracias por todo familia. Nos vemos pronto. @jpuspain Jajaajajjaaj no tengo por qué enojarme. On The road. #SouthAmerica #OneWorldTour https://t.co/49ppGYKanG \"give if you can, take if you have to\" #JacekTyliki #India https://t.co/2k4omQ53Vp Logic will take you from A to B. Imagination will take you everywhere~ RT @BetteMidler: Trump called Ted Cruz a \"pussy\"? Well, Trump's a dick so maybe they should get together and fuck off! Felicidades @Lin_Manuel @HamiltonMusical #grammys Congratulations! I'm still high from your performance. THANK YOU @kendricklamar! #GRAMMYs #Grammys2016 YES! Today we won the Grammy for Best Latin Pop Album. So thankful for everyone involved @thegrammys https://t.co/NOa1FNK1CR Cuando se hacen bien las cosas... When things are done right... Todo mi cariño para ti @kanygarcia. Celebro tu libertad. Gracias por tu honestidad. Que viva el amor! #lgbt Aquí les dejo mi nuevo video #Perdoname espero que lo disfruten. #AQQE https://t.co/8UeNlnlWsH https://t.co/a2KovE40DA Mi gente mañana world premiere de mi nuevo video #Perdoname no te lo pierdas a las 5pm EST por @PrimerImpacto #AQQE https://t.co/odWoAf7gsW distinguish sense from nonsense Antony Hegarty is the first trans person 2B nominated for an Oscar in 30 years #NowPlaying Manta Ray by J. Ralph ♫ https://t.co/5olEzVzFmm #NowPlaying Knockin' On Heaven's Door by Antony and the Johnsons ♫ https://t.co/zFlWjo0Rp5 Thank you American Way Magazine! https://t.co/t1jLQnc8dL  @americanair @inkglobal #Nexos @Julesinozz lol \"Even if nothing changes, if I change, everything changes.\" Ya llegue a la bella #RepúblicaDominicana! ¡Feliz! Altos de Chavón estoy listo! #OneWorldTour in #DominicanRepublic La arrogancia y la soberbia vienen del ego. Pero también la baja autoestima la timidez y el miedo El ego vive en ambos extremos del espectro Arrogance, cockiness &amp; a stubbornness are ego. But so is low self-esteem, shyness &amp; fear. Ego lives at both ends of the spectrum. I want 2thank every1 @glaad 4nominating me w my latest Spanish CD \"A Quien Quiera Escuchar\" 4outstanding music artist (Spanish language) 🎉 #Nowplaying Listen to Bleeding Wounds (feat. Sascha Kloeber) by Bassmelodie &amp; Maier-Hauff  https://t.co/8ggaywhEGl Lol Wepa!!!!  👍🏼 RT @Cristiano: Una mordidita en tu boquita‼️🎤😂🔝👌\nhttps://t.co/azyY6P8FxH https://t.co/VmRFou7EVc bravo! So my #TCT (#TeacherCrushTuesday) is @NicholasFerroni, thank you for all you do for students everywhere.  https://t.co/TEYTTHpjcE It's time we follow, celebrate and praise amazing teachers as we do athletes and celebrities. Happy Australia Day! I miss u AUSTRALIA. Back to work. #Promo #OneWorldTour I'm ready! https://t.co/wZsp6XFaFY i loved this!  https://t.co/yQhbOy8PA1 .@Lin_Manuel Thank u so much 4 an amazing performance last night @HamiltonMusical. Brilliant! You make me proud and give me hope! #Boricua @stewartthurlow 😂✌🏼️☀️😊 Feliz dia de Reyes familia! Merry Christmas to everyone celebrating it today! #Julian #Orthodox .@EvaLongoria @amaurynolasco @jencarlosmusic watching familia!!!! Abrazos a todos! #Telenovela #exito!! #Success @juliovnunez lol! Saludos Good morning gang!!!! Come on! Get up! #amworkout #2016 #goals https://t.co/znCoQKtVKE 🎶Yo me voy pa Puerto Rico vendiendo vaso en colores🎶 #classic #salsa \"I challenge you to find something to die for and live for it\" \"Aunque nada cambie, si yo cambio, todo cambia. Renuévate.\" Start by starting. Nacer Es bello, pero renacer...... \"Un minuto de silencio por todos esos besos destinados a los labios, que murieron en las mejillas\" https://t.co/IytDqj6vPx #HappyBirthdayRicky #thankful What would you attempt to do if you knew you could not fail? Buenas noches familia. Mañana dia largo. Filmación d video. Good night every1! Time2 ZzZz. 2morrow long day 4me #VideoShoot #Perdoname #AQQE Venga mi gente #Follow @Cncomusic Lots of emotions after watching this! Enjoy https://t.co/RoJbikK8V5 Qué alegría mi gente!!!! Tremenda notica Puerto Rico!!!  https://t.co/zytScELJdS Happy to announce that \"A Quien Quiera Escuchar\" is nominated for @TheGRAMMYs Best Latin Pop Album. Thank you all! #AQQE Hoy! Gran semifinal de @labanda, los chicos tendrán que dar todo para seguir en la competencia #LaBandaLIVE F#ck To Be Music Video By  The talented @Emily_Estefan (Wish you the best beautiful girl!) https://t.co/Q5ZzhNzIQd Hoy \nmiércoles, 2 de diciembre, Día Internacional de la Abolición de la Esclavitud, digo #yoquierounmundolibredetrata If you bring me coffee without having to ask, thats when I love you. On ne vit qu'une fois!! 😜 \"You are cute when you are confident. Less when you are not\" No one can tell you who to love. That's our birth right~ Making memories? Be careful those things can last a lifetime 😜 5.5 MM children are victims of labour and trafficking. Join me &amp; @UNICEF to #FightUnfair https://t.co/C6Nceqra9B https://t.co/SDpVVC50iJ Amor, love, amour, amore, عشق, 爱, אוהב, lieben, aşk, cinta, حب, प्यार, 사랑, любовь, ความรัก, älskar, upendo, սիրել, ליבע ❤️ I see you. I'm tired but I see you. Ready for my 10 hour flight. 😴 #London see you soon! Beso grande! https://t.co/bv0WBIDR9K #JeSuisParis #PrayforParis @transgirl_mom 😂😂😂😂 Rehearsing at #RoyalAlbertHall #London Hey gang voting for @TheAMAs closes TONIGHT at 11:59PM ET. For voting RT @ricky_martin Favorite Artist - Latin #AMAs https://t.co/HCZvVr9BWo @ShaneMasYMas will never forget! RT @marthapink_: @ricky_martin - Favorite Artist Latin - #AMAs Gang tomorrow is the last day to vote @TheAMAs + Favorite Artist - Latin + @ricky_martin RT #AMAs https://t.co/LG6xu7hoN8 Hey #Australia! Send you much love. Thoughts? https://t.co/dXYAgKSiSn #WEPA! It's Opening Night on #Broadway for @OnYourFeetBway. Un abrazo gigantesco @GloriaEstefan @EmilioEstefanJr! \n#onyourfeet #LaBandaLive LIVE on #Periscope: La Banda  https://t.co/NxpOMBFH6x RT @RM_Team: Hey #SexySouls don´t forget @Ricky_Martin is nominated for the @TheAMAs as Favorite Artist - Latin. Vote NOW: https://t.co/M2a… Today fans coast to coast will decide who will stay and who will go! Don´t miss #LaBandaLive @labanda https://t.co/yknTQP7nHs Thank you #USA And #CANADA https://t.co/UbWCsHVeZ0 Felicidades a todos Esos escorpiones que están  cumpliendo años o están por cumplir. #SaludaSiEresEscorpio 😂😂😂 https://t.co/n605KwgE3r LIVE on #Periscope: Gordo y flaca  https://t.co/dBEsYjvRRe Mi gente en Mendoza #Argentina, listos para #OneWorldTour? Nos vemos en Febrero https://t.co/IebGM5QMUN Amazing crowd in #Miami for the one and only @taylorswift13 Besos! Loved performing with you! ¡Besos! https://t.co/gkPypzobLi LIVE on #Periscope: Live with @TaylorSwift13!  https://t.co/yHCNbpt8JZ Hey gang. Stay tuned, in 10 minutes I'll be going live on Periscope ///// Atentos, en 10 minutos estaré en #Periscope EN VIVO DESDE #MIAMI RT @billboardlatin: .@ricky_martin's #OneWorldTour wraps in U.S. w/ mission \"to unite nations through music\" https://t.co/ojlpmHqN1C https:… #PuertoRico se abre Otra función en el Choliseo. Boletos a la venta YA! #OneWorldTour Esta noche 5 chicos tendrán que despedirse de la competencia en @LaBanda. Mucha suerte a todos! ~2016 is like 2 months away and I still think 2008 was like 2 years ago. Wtf~ Mañana los chicos tendrán que: grabar una canción, aprender una coreografía y hacer un video musical en 24 horas!! @LaBanda @Tinajas @labanda y se pone mejor! :0) .@PiccoloUniverse em #Portuguese  http://t.co/yH3PEh1fTw #Argentina preparate q voy con mi #OneWorldTour. Estadio Vélez el 11 de marzo. Dentro de poco anunciaremos mas fechas para el resto del país RT @TheAMAs: Livin' la Vida @ricky_martin! 💃 Here's how to VOTE for him for Favorite Artist - Latin at the #AMAs 👇👇 http://t.co/exPeqvzxru RT @HillaryClinton: To everyone who's ever been bullied for being who you are: You're perfect, and I'm proud of you. #SpiritDay -H Bullying is for cowards. Of course I'm wearing purple today. Any shade of purple. 💜 #spiritday http://t.co/WirZdv4KsG Basta YA!\nEl Bullying es de cobardes, yo me uno a esta iniciativa. #SPIRITDAY RT @RM_Team: Are you ready?\nVote NOW:👉 http://t.co/BaDkJa9KdP 👍😉 http://t.co/TzJrUJoain Que se sienta mi gente https://t.co/18hBvSLSAD @Juanlmorera Reflected. #Chicago #TheGiantBean http://t.co/5pRyh8pFrJ @Giselle_RM besos @ltkv13 go to the Mohegan Sun!!! Or Atlantic City ;0) @Annndre_a Besos @JustinLBC 😂 Dear friend: Never,under no circumstance call more than once.If he/she doesn't pick up the phone or calls back, the message is clear #Advice #Chicago Thank you! Gracias.  #OneWorldTour http://t.co/iyE34jvLT0 Out is the new IN. \n#NationalComingOutDay Front page of @nytimes Arts http://t.co/pfzbJOtn08 Pronto estaré en mi Isla Bella. Desde ya pueden comprar los boletos para mi concierto en Puerto Rico. http://t.co/cCLCF9CeGT #OneWorldTour Ganamos! Gracias a todos ustedes y a @LatinAMAs por este honor!! #LatinAMAs \"...Mátame a besos...\" http://t.co/FC5RMuLCXt #QSSEDVideo @Juanlmorera Yo la veo, me mareo\nSe me pega mas la deseo… http://t.co/FC5RMuLCXt @JuanLMorera #QSSEDVideo #PuertoRico listo para cantarte. Feliz de anunciar q llego con mi #OneWorldTour el 12 de febrero en el Coliseo José Miguel Agrelot!!! Que se prenda la noche, que se prenda\nDeja que brille tu piel por el sudor…  http://t.co/FC5RMuLCXt @JuanLMorera #QSSEDVideo \"Sabias q el ser humano sufre mas por lo que imagina que por lo que realmente sucede. No te hagas películas y disfruta mas la vida\" Monseñor Krysztof Olaf Charamsa, sacerdote polaco, se declaró gay: http://t.co/FQhpuTU2Ug via @infobaeamerica MEXICO QUIEN ESTA VIENDO @labanda ?RT @TelevisaTVmx: ¡No te pierdas el gran estreno de #LaBanda con ... http://t.co/qKnwpgZ0NQ Check out the official video for \"Que Se Sienta el Deseo.\" Available now on @VEVO! http://t.co/FC5RMuLCXt #QSSEDVideo RT @Juanlmorera: Ya llega #OneWorldTour de @ricky_martin, nos vemos en New York 10/8 y en Fairfax 10/9 https://t.co/E5SITG1txE https://t.co… I'm angry. Enough is enough.Who is going to B brave enough to do something about it. \"Our thoughts and prayers are not enough\" #UCCSHOOTING Nuestro video oficial, \"Que Se Sienta el Deseo”, sale mañana @Vevo! #QSSEDVideo. http://t.co/HrVQRBbdl4 .@Juanlmorera creo que lo están…Let's do it LIVE on #Periscope: Soundcheck Houston 3 https://t.co/KcrO8qRVUu LIVE on #Periscope: Soundcheck Houston 2 https://t.co/kyo8CQBiBe LIVE on #Periscope: Soundcheck Houston https://t.co/YVimSYbLkh LIVE on #Periscope: Soundcheck Houston https://t.co/DYJpgb5lO4 RT @GigsHouston: 🎤 @ricky_martin, Sep 30, Buy a ticket: 🎫 http://t.co/zG11x9c3Hs http://t.co/aqaUjXIfQS LIVE on #Periscope: El Paso, Texas #soundcheck #oneworldtour  https://t.co/Zi00XhEwiM LIVE on #Periscope: Sound check Phoenix, Arizona!  https://t.co/FDgJkzPTt2 RT @LatinGRAMMYs: Felicidades @ricky_martin por tus 3 nominaciones al #LatinGRAMMY ¡RT para felicitarlo! http://t.co/unANjdmhcH http://t.co… Nominated for song of the year @LatinGRAMMYs \"Disparo al Corazon\" VIDEO: http://t.co/0iKzmFszt0 Gracias a la academia por las nominaciones para los @LatinGRAMMYs. \"A Quien Quiera Escuchar\" es poesía (cont) http://t.co/QQpXgSJ6c5 Conocerte fue un #DisparoalCorazón Es un gusto para mí anunciar a los Nominados al #LatinGRAMMY en la categoría Álbum Del Año ¡Felicidades a todos!\nhttps://t.co/0wpX0gICE8 #NowPlaying Nara Leão \"Corcovado\" Thank you Marvin. http://t.co/YLLSxAtJz9 LIVE on #Periscope: One World Tour Opening LA show https://t.co/zh0I9F1Yp6 Mi gente! Esta noche tenemos una cita. Podrán ver en vivo la apertura de mi concierto en #LosÁngeles por #Pericospe. #OneWorldTour. Mi corazón está con ustedes, #Chile. Gracias por el cariño mi gente. Muchas Gracias por el cariño a @labanda. Me encanta leerte. RT @Juanlmorera: Con @Ricky_martin y @SimonCowell los mejores llegarán a la cima. ¡Éxitos! Ahora mismo se está #HaciendoHistoria http://t.c… RT @onedirection: .@LaBanda is here, join the adventure! Premieres Sunday 8PM/7C on @Univision Mi gente la búsqueda de @LaBanda comienza este domingo este domingo 8PM/7C por @Univision Time passes by real fast. Less than 5 days to hit the stage. #OneWorldTour. http://t.co/p8Ai4cI5w9 http://t.co/xZAsqM2NCy :0) #SeparationOfChurchAndState @tmteaches Thank you so much. I promise you'll have a great time! Besos. Where have all The teachers gone? https://t.co/5W0Kn1k9D2 #RespectForTEACHERS 9 more days to my #OneWorldTour. Can't wait. #UsaCanada. http://t.co/p8Ai4cI5w9 http://t.co/jtMbmMQRm2 LIVE on #Periscope: It's Alright Estadio Azteca  https://t.co/2T9nMv6pZD LIVE on #Periscope: Livin La vida Loca Part 3  https://t.co/k5dDZmNjNp LIVE on #Periscope: Living La Vida Loca Part 2  https://t.co/PDkd02ndZh LIVE on #Periscope: Livin La Vida Loca Estadio Azteca #OneWorldTour  https://t.co/i6OuBOhHu1 LIVE on #Periscope: En Vivo de Estadio Azteca México.  https://t.co/g8WyOTMLDx #USACanada: 10 days away from #OneWorldTour! Are you as excited as I am? See you all there: http://t.co/p8Ai4cI5w9 http://t.co/0n1STy9aL8 Thank you @NicholasFerroni For speaking up. We need more educators like you. Peace!  http://t.co/MxfJZqI65t Celebramos en alianza con @RM_Foundation @nuestraescuela @serpuertorico @iniciativaPR 1er año del #CentroTau #Loíza http://t.co/439zTE0FUv SAD reality.  http://t.co/3pasurvHOk RT @annamgirardi: Aussie fans, Vote, and keep on voting for @LiamMaihi #TeamRicky's #TheVoiceAu of 2015! #GrandFinale @ricky_martin ✌🏼️ htt… Our lives begin to end the day we become silent about things that matter.\nMartin Luther King, Jr @jorgeramosnews De nada caballero. \"Nuestras vidas empiezan a terminar el día que guardamos silencio sobre las cosas que importan\" M.L.King Enough is enough http://t.co/DkcZlWkrfj #LatinosUnidos No mas agresiones a los latinos. BASTA YA http://t.co/lSDo4EAEms Can't wait USA and Canada. It's going to be so much fun! #OneWorldTour. http://t.co/p8Ai4cI5w9 You go to church and when you go back home you judge, criticize and gossip about others. Don't be a HYPOCRITE De que vale ir à igreja se quando chega à sua casa (você) fofoca, julga e critica aos demais. Não seja HIPÓCRITA. De que vale ir a la iglesia si cuando llegas a tu casa chismeas, juzgas y críticas a los demás. No seas HIPÓCRITA @therealbeauryan thank u brotha! #TeamRicky @stefano_marika I'll give it to u here. 😚 Hey you! Yes you! Dont be afraid! Trust the vibes you get. Energies don't lie. @RICKY_LOOOVE i would LOVE to visit Somenday. Send you much loce Puerto Rico Queremos Justicia para José Iván Trinidad Cotto YA. USA and Canada are you ready for #OneWorldTour? Get your tickets here http://t.co/68Qj19PkZZ We cannot build our own future without helping others to build theirs~ Bill Clinton Taking steps towards equality. Raffi Freedman-Gurspan first openly transgender staff member at @WhiteHouse. Bravo! RT @jpuspain: 4 semanas para el arranque de One World @ricky_martin Tour USA - Canadá No te quedes sin tickets ➡️  http://t.co/26gEadPVPc Es muy fuerte ver la cara d mi madre(que esta conmigo en Australia estos días) llorando solo por ver 1video d la lluvia d hoy en #PuertoRico \"Este día no solo es especial. Este día es inmenso.\" Amor para tod@s en Puerto Rico #BodaMasiva #VencioElAmor http://t.co/GNPANxbDLv 🎶Yo no puedo ocultar el orgullo que siento de ser puertorriqueño y que mi pensamiento no importa donde voy me lleva hacia la islita.....🎶 Dream the impossible! http://t.co/XPDWxRVuim Just another #Selfie https://t.co/S1V6qhtG5S RT @JustJared: Neil Patrick Harris will have an epic sing along with THIS major music star on #BestTimeEver: http://t.co/LXBVUbYfjh http://… Rise your hand if your lefty! #lefthandersday http://t.co/A6P16Kl5rO @jillyd72 that's part of the intellect. Para q una relación íntima funcione hay 3 cosas q no son negociable 1.lo visual 2. El sabor 3. El intelecto. @LaurenImbrogno you are Beautiful!!! @TWorthigton thank you! @AlineKuhn true #Brasil feliz dia dos pais!!! @SecViviendaPR Felicidades caballero. A vivir en plenitud. Ese es el verdadero significado del éxito. ¡Paz! @therealbeauryan @DeltaGoodrem @JoelMadden @benjaminmadden @NRLFootyShow xD Watching!!! Looking great Everyone!! @Maquita_G @YouTube BESOS Marquita! Paz! I saw the video of the attack. I'M SO ANGRY RIGHT NOW.  #EvilHatesLove #JusticeForShira NOW @RealHughJackman you 2 my friend. All the best to you and your beautiful family!! See u soon. #FF #followFriday  @PiccoloUniverse Dont Forget to join us http://t.co/mWdeJsbJKI @PiccoloUniverse \"Please take responsibility for the energy you bring into this place\" #JusticeForCecilTheLion NOW. @ScotsRanger82 thank u. Hope u enjoy IT. RT @SonyMusicLatin: Déjate llevar por el remix de #LaMordidita la pieza que juntó a @ricky_martin con @zionylennoxpr  https://t.co/7eWOgTX0… RT @SonyMusicLatin: ¡Felicitaciones @ricky_martin por su disco de platino por #AQuienQuieraEscuchar! http://t.co/bYwUic5jIb http://t.co/K2O… RT @RM_Team: Familia, vamos a pedir #LaMordidita en todas las emisoras http://t.co/FpPg6zIwvj Here R my #Top4 finalists from #TeamRicky Next week LIVES ! 🎉🎥🎤💥 @ga.... http://t.co/AfgzD8eGhY http://t.co/AgOvorE1vb @adamlambert see you on Sunday Mr. Wish you mad success with this new production. @TheVoiceAU RT @lgbtpr: Watch: Preacher takes homophobes and anti-gay church leaders to church with fiery pro-LGBT sermon. #LGBT VIDEO: http://t.co/hqh… RT @lgbtpr: Predicador dio un sermón apasionado en contra de los líderes religiosos que son anti-LGBT  #LGBT VIDEO: http://t.co/hqhDkZ8nkN @PeoplesAnthony Thank You Anthony. Im Glad you enjoyed My book! :0) I'M BACK!!!!!! 🐨😀 Aquí hay mucho amor. Llámame loco. RT @labanda: Nuestro juez @Ricky_Martin en el GRAN ESTRENO de #LaBanda este 13 de Sept. &gt;&gt; http://t.co/Ml7LyiRa26 @Univision http://t.co/uB… VIDEO http://t.co/k3BqDKROAb \"Own who you are\" Gracias por todo el apoyo que siempre recibo de ustedes, mi gente. Qué bueno que estuvieran escuchando #LaMordidita. http://t.co/cIMAelynuA @iamdelafuente jajajaja eso tiene q cambiar. Abrazos a la familia. Q gusto verlos hoy. Lleno de energía y listo para subirme al escenario de #PremiosJuventud. LIVE on #Periscope: #premiosjuventud  https://t.co/4IPFH8KeqX LIVE on #Periscope: #premiosjuventud  https://t.co/GmKOXIcmyv LIVE on #Periscope: #premiosjuventud red carpet  https://t.co/CFlMhiQrLU Nos vemos esta noche a las 8pm por @Univision para #PremiosJuventud. Estaré cantando #LaMordidita. DressCode tonight: Black or white??? #PremiosJuventud http://t.co/kcqE91EpJ1 Sin amor en el corazón, nada. ;0) ~Life could be tough but you are tougher. ~ Miren cómo sorprendí a mis admiradores hoy. #MomentoNESCAFÉ http://t.co/DURnIqYSyM #NowPlaying Melody Gardot \"My One And Only Thrill\" The competition is getting better and #TeamRicky is getting stronger. #TheVoiceAu http://t.co/OrQgZWPir2 ONE WORLD TOUR!!! https://t.co/2MAVZ16bsJ 🎉🎉🎉🎉10/julio/1984 🎉🎉🎉🎉 #NowPlaying Perota Chingó \"Cancion para el Viento\" http://t.co/iOuE4bGQxf RT @MouraEnContacto: Circuito de Boston ratifica derecho de parejas del mismo sexo a casarse en PR http://t.co/x2fbah4F1q @PedroJulio http:… @ericyoak come on!!!!! You have to come!!!! It's a great show!!! 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸To everyone celebrating.......... HAPPY 4th Of July!!!!🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 Me......one Lucky man and my twins!!!! #Beach #Sunset http://t.co/qYixi9nePo Con mi hermano @cuervotinelli #Showmatch #RickyEnArgentina http://t.co/PX4wHKNVvI LIVE on #Periscope: Instore in Buenos Aires, Argentina. Firma de autógrafos  https://t.co/KrOsoWevj3 #Argentina ya voy a la firma. No tengo palabras para agradecerte por tanto cariño. Gracias por tu fuerza y pasión. Te adoro. Australia, @TheVoiceAu is back today at 7pm on Channel 9! Who’s on #TeamRicky? http://t.co/iWJ9eSNAlh I have goosebumps after seeing this video #ProudToLove -  Celebrating Marriage Equality and LGBT Pride Month VIDEO http://t.co/0dQEUNt4oJ #JusticeForAll Ahora en los EEUU no se llamara \"matrimonio igualitario\" se llamara MATRIMONIO y punto. RT @POTUS: Today is a big step in our march toward equality. Gay and lesbian couples now have the right to marry, just like anyone else. #L… RT @HillaryClinton: Proud to celebrate a historic victory for marriage equality—&amp; the courage &amp; determination of LGBT Americans who made it… La Corte Suprema de los EEUU acaba de anunciar q el amor es para todos! Igualdad matrimonial para toda la nación y sus territorios. BREAKING: #SCOTUS has just announced that love is equal across the nation!!! #MarriageEquality #LoveAlwaysWins #Loveislove A big thank you to all the Dj's spinning my song #MrPutItDown feat @Pitbull for making it number 1 in the clubs. Mucho odio e ignorancia en tu corazón @realDonaldTrump.  #LatinosUnidos A somber Jon Stewart delivered a scathing monologue about the Charleston shooting. http://t.co/D9sKz3QUWq 👈VIDEO Vía @Gawker #studiotime http://t.co/FiRkBlWhGd #Argentina ¡Llego a la #BuenosAires el 27 de junio! Como siempre, a pasarla bien! Firma d autógrafos el 28 d junio en Musimundo de #Cabildo \"That time you confuse a lesson for a soulmate\" 😂😂😂😂￼ RT @lgbtpr: With little fanfare, #Mexico Supreme Court legalizes same-sex marriage. #LoveIsLove #SCOTUS #AmorEsAmor #LGBT - Read: http://t.… Have a beautiful week everyone!!! Love from Mexico City!!!! Me gente, gracias por sus comentarios tan positivos referente al video de #LaMordidita http://t.co/zfb6sjmWlS 👈 gracias gracias gracias RT @Vevo: Get the weekend started right with a new one from @Ricky_Martin ft. Yotuel: http://t.co/yLTWQPDpGG Ricky Martin - La Mordidita (Official Video) ft. Yotuel https://t.co/v6hMOTE9at Familia, la espera terminó. Aquí está el video de #LaMordidita: http://t.co/w7Bs7QQ00D @JustJared I think the \"as a woman\" part was unnecessary. Right? \"Cómanse a besos esta noche\" LIVE on #Periscope: Monterrey Soundcheck 2 https://t.co/e2d2FFA4bU LIVE on #Periscope: Soundcheck Monterrey  https://t.co/hS6aYu8VO0 \"Si sabes hacer el amor no tienes necesidad de  celar tanto\" #cita #quote @luisitafernanda @KellyandMichael @enriquesantos LOVE and light beba!!! Saludos. Nos vemos pronto #MrPutItDown performance on @TonightFallon sum up: ENERGIZING. Thanks @jimmyfallon http://t.co/fzZt9Fgu48 @raymondarrieta Hermano no sabes el respeto q te tengo x todo lo q haces x nuestro pueblo y por los q lo necesitan. Eres luz! Mucha fuerza! Algumas coisas levam tempo. Outras, o tempo leva ~ #quote LIVE on #Periscope https://t.co/EGXCJrGYeh @GlobalGiftFound HEY!!!!! Miss You guys. happy to be here! I LOVE SPAIN. @AlejandroSanz gracias Alejandro. Me siento en casa siempre hermano. Abrazo de oso. Nos vemos ya. LIVE on #Periscope https://t.co/TjLZwOoIyN #VIDEO Britain's Got Talent #BGT #London https://t.co/IffLNJjzCQ 👈 (via @jpuspain) Minutes before walking on stage for Britan's Got Talent 👉https://t.co/lio9HCisCr @Tinchorgz Felicidades hombre valiente. Mucha Paz para ti. #uk on my way to @bgt rehearsals. #mrputitdown http://t.co/wu70gcPny2 #Italia siamo arrivati. Sono felice! #Roma #Ireland says YES to marriage equality making it the first country to pass the freedom to marry by popular vote! #LoveAlwaysWins Everyone needs that friend you can call and say \"hey you want to hear something gross?\" 😜😂 Mi gente, si aún no tienen #MrPutItDown la pueden conseguir aquí http://t.co/oulZ5ln5Yc Download my new single and 'you're gonna call me #MrPutItDown' http://t.co/oulZ5ln5Yc RT @DJNoodles: up next... premiering @Ricky_Martin @Pitbull #MrPutItDown @DJNoodles Remix! On Miami's @HITS973 in the #HITSmix ! http://t.c… Gang, thanks for your support to Mr Put It Down, remember to get the song here http://t.co/oulZ5ln5Yc Gang!!! Check out this new video that celebrates the contributions of #LGBT &amp; intersex people https://t.co/b0yw5vlpKJ #IDAHOT #faces 🎶I wanna see you be #FREE🎶 @RyanSeacrest hey hey! 👉https://t.co/j0wtlJ4opj RT @LiveNation: .@ricky_martin performs on the American Idol finale tonight at 8pm/7pm!  #OneWorldTour tix http://t.co/Bb9ThmaKt0 http://t.… RT @labanda: ¡Las chicas llegando al escenario de #LaBanda! https://t.co/XQWaDAwiJJ Hey Miami, come down to my new TV show @labanda tonight #MiamiBeach with @ApplauseStoreUS.  Register here http://t.co/Bypf7aSYqg #Miami! I ❤️N.Y. Slow progress........is progress. Feliz dia de las madres! En especial a esas 2 maravillosas mujeres que le dieron vida a mis gemelos!!!! Gracias gracias gracias!!! \"No te necesito para nada pero te quiero para todo\" Yessss! I'm going to be performing my new English Single #MrPutitDown on @AmericanIdol next week. Can't wait. Bienvenido a @LaBanda @AlejandroSanz Maestro,será 1honor para mí y los concursantes contar Ctu sabiduría/talento.Gracias Xser parte D esto @DarrenCriss much success on your show Darren!  peace buddy.  #LLVLrocks LIVE on #Periscope https://t.co/ioEw7f0mgA LIVE on #Periscope https://t.co/HLX7bJUYIr For you who is the winner?  #Paquiao or #Mayweather #PacquiaoMayweather Just finished my show in #Melbourne. I'm still high. Thank you for such an amazing energy #Australia gracias gracias gracias! LIVE on #Periscope: Melbourne leaving the arena  https://t.co/0DUsLXABZx Being nice and cool. ✌️ .@LauraPausini!Q bien trabajar contigo en 1proyecto musical tan importante como @labanda!Tu vibra llevará este show a otro nivel Te quiero! \"Dissipate your every mood\nI got nothing left to prove\nSomething, something I can't \nExplain ...\nAnd… https://t.co/alwm8sOQRt On periscope in 3 minutes guys!!!! Estate en periscope en 3 minutos Mi gente. Let's make history. Join me &amp; @HRC in support of #MarriageEquality! #SCOTUS #LoveCantWait http://t.co/6MQCwRj43Y http://t.co/yTUsyOeU5R Hey gang here is the lyric video for \"Mr. Put It Down\" http://t.co/Ha7Lox8j0V 👈 #LoveCantWait Hey everyone, @UNICEF is taking action to help children+families affected by the #NepalEarthquake To help http://t.co/VajHcqtU8o Thank you #BruceJenner. Your testimony will make this world a better place. RT @NicholasFerroni: American Students: I'd rather be working than going to school. \n\nChildren in Other Countries: Great, let's  trade. Go behind the scenes of my #OneWorldTour\nhttps://t.co/Yby7xU1HMQ VIDEO https://t.co/2MAVZ0OABb RT @RIAA: He’s earned his FIFTH Platino album! Congrats @ricky_martin @SonyMusicLatin on the new #AQuienQuieraEscuchar award! http://t.co/P… \"Mr. Put it Down\" lyric video👉 http://t.co/tyvWJp7rEh \"I want a relationship that is like super cool friendship with like kissing\" 👍🙌 VIDEO #OneWorldTour opening music   https://t.co/h0lr2XSB17 Sleepy. But I need food. Ready for my 3pm breakfast. Time to recharge. https://t.co/u9tIZw3GBy I whisper \"wtf\" to myself at least 20 times a day. 😂😂😂 Ella echó a su hijo por ser Gay y el abuelo le respondió con esta EPICA carta http://t.co/AwP003VYL7 #NewZealand! Thanks for everything  http://t.co/YHR1WnqDx6 Tomemos riesgos aventureros inclusive a nivel emocional. #zodiaco. 😳😜😜😜 Just landed in Wellington #NewZealand I'm ready for tonight's show! Let's do it!!! I'm glad u enjoyed. Peace.  https://t.co/5u9zf5rVwN @Julesinozz love our pic! RT @lukeckennedy: Just watched the opening of @ricky_martin 's Aus/NZ Tour 2015 via the @periscopetv app. So cool!! #OneWorldTour http://t.… @jpusmendoza no se desesperen. Yo también estoy loco por volver. Ya mismo. Besos. Mi gente!Compartiré c ustedes EN VIVO los primeros minutos d #OneWorldTour aquí en #Auckland a las 20:30NZST por 👉https://t.co/VtCjKXQxtL Hey gang, follow me on Periscope for a 1st look kickoff #OneWorldTour #Auckland #NewZealand https://t.co/VtCjKXQxtL At 20:30 NZSTime To Make me happy: Make me coffee, bring me coffee, BE Coffee, COFFEE. Photo by: My son 😜😄😄😄\n\nhttps://t.co/3PRgmscFzZ http://t.co/G861kjV5Pb Para atrás ni para tomar impulso. HEY HEY Go ahead and click 👉https://t.co/wMzCAbWAeU .@AlanCumming's \"Celibacy Challenge\" Takes On the FDA's Absurd Ban on Gay Blood Donation. @glaad \n http://t.co/pRlYfzocEZ #StupidLaws Mi gente!!! Los espero hoy en @NuestraBelleza!! Estaré cantando #DisparoAlCorazon. No se lo pierdan!!! #NBLGranFinal #WaysToEnjoyAGoodLife: Flow with the music http://t.co/Y6jHV5kcyK RT @kiis1065: EXCITING NEWS! Ricky Martin with Kyle and Jackie O tomorrow morning! Be listening from 740am #KJShow #KIIS1065 http://t.co/oB… ¿Cual es el amor del q nace todo tipo de amor? EL PROPIO. My life is a rehearsal. #OneWorldTour https://t.co/p4R95iuPy0 Music and more music! My band sounds f*cking amazing!  #Familia #OneWorldTour #Rehearsals PHOTO by… https://t.co/rIuKmd56o2 Different is good. Prepárense pa lo que viene en #OneWorldTour      English: 👉https://t.co/JCfU2nlX4K 👈 #Heyhey #OneWorldTour rehearsals with the band. 1st show April 17th #Auckland #NewZealand… https://t.co/Rsl2A7OEhQ #Heyhey Aquí #MrPutitDown The @JumpSmokers mix. LOVE IT https://t.co/h6PzrJfqDi Lets #RT Please help us @HRC https://t.co/1hVVluIYP8 The moment you start to wonder you deserve better, you do. To gym or not to gym? That is The question. ☁️☔️⚡️💪 https://t.co/z1oJiyJmIs The world will not be destroyed by those who do evil, but by those who watch them without doing anything ~Albert Einstein RT @fmosaka851: 08:54 『OSAKA MORNING VIEW ⑤』 ♪ MR PUT IT DOWN／Ricky Martin feat.Pitbull http://t.co/2ybncLXqjX #fmosaka New CD #RickyAQQE #AQuienQuieraEscuchar https://t.co/fK9c3vN5PC NEW COMMANDMENT:\nThou shalt not use the phrase 'religious liberty' to justify segregation and bigotry (via @TheGoodGodAbove) @joelygabs check this out. Just out 👉https://t.co/SlBztfvXiQ👈 @PerezHilton Paul McCartney didn't do that bad either. :0) M.A.S. Tour Video intro. Produced and Directed by @elasticpeople #freedom https://t.co/rKoTCRTsWI Some people are just weird. https://t.co/ku0ThR6NFN @SamDavani I'm so happy to hear that!  That's fantastic!!!! Big hug. \"Here's the truth about big life changes: some people won't come with you. And that's okay.\" it's a good week to have a good week!!! ;0) @jayfonsecapr @RM_Foundation jajjajaja a mi el vértigo me gana. Pero hay que hacerlo. Mis respetos Jay. @jayfonsecapr Gracias Jay. En nombre de @RM_Foundation  y #CentroTau! Fuerza en todo hermano y te esperamos el año que viene 😜Jejeje! 👍 👉https://t.co/SlBztfelUg 👈  on #ITUNES Hate = absence of love. What a beautiful/busy day in #Auckland. Thanx for all #NewZealand!!! See u in April. #VIDEO \"Disparo al corazón\" http://t.co/0iKzmFszt0 👈 Mi agradecimiento al Gobernador Alejandro García Padilla por demostrar que es un líder que no ... http://t.co/lTUtFY5tiw RT @DJDREW1027: About to be in the mix on @1027KIISFM with @OnAirWithRyan gonna drop that new @ricky_martin track \"mr. Put it down\" feat. @… Hello New Zealand! What's going on? I just got here. I'm happy to be back! #NewZealand #Auckland ... http://t.co/dDErEsesrf @ElviiVeroniica besos @EKimberley93 get well soon buddy. Peace. RT @ToyotaLatino: Aquí está @ricky_martin hace un rato, probando sonido para nuestro show privado. ¡RT si eres fan! #VayamosJuntos http://t… #PuertoRico: La sociedad evoluciona, el matrimonio igualitario es un asunto de derechos. Europa, EEUU y (cont) http://t.co/E2TrZfHaTE Around The World #Sydney #Dubai #Madrid #Bogotá #Cartagena #LosAngeles #AucklandNewZeland Sydney #THANKFUL #RickyAQQE http://t.co/l1dpJFqVlC \"I just wanna make you feel special... A little fun, little love, little dancin'...\" 🎵 #MrPutItDown http://t.co/V7lvsblBeO Once a #Capricorn's patience has worn thin, it's game over. #True #VideoShoot #LaMordidita #Cartagena #Colombia http://t.co/OxdurDQSNx .@dolcegabbana ur voices R 2powerfull 2B spreading so much h8 http://t.co/30Oe2hcxNt Wake up,Its 2015 Luv urselves guys #boycottdolcegabbana \"Find a way, not an excuse\" #PuertoRico llego el día!Estas listo para las audiciones de @labanda? La música cambiará tu vida!Estoy loco X ver brillar el talento boricua RT @SimonCowell Today is the day guys in #PuertoRico!Registration for @labanda is open 8 to 10am @ the Sheraton.Good Luck!#AudicionesLaBanda RT @Wild949: Listen all weekend for your tix to see @ricky_martin at @OracleArena Sept. 17th! #NowPlaying \"MR PUT IT DOWN\" w/@pitbull #TURN… RT @LiveNation: .@ricky_martin's new song featuring @pitbull is out now! Get your copy of #MrPutItDown here: http://t.co/jqDmP3kekG http://… #Colombia. Ya estoy aquí. A los medios y a l@s fans, gracias por el recibimiento en el aeropuerto. Linda sorpresa. @husinabdul thank you. I'm glad you are enjoying #AQQE. See you soon in Indonesia. Big hug. #Adios #Madrid gracias por todo tu Amor. Me encantas. Nos vemos pronto. Próxima parada #Bogotá #Colombia. Que ganas te tengo. #MrPutItDown Here you go Mr. Put It Down on ITUNES http://t.co/OXcQ8XQR0w Gang check out #MrPutItDown, my new song with the one and only @Pitbull here👉http://t.co/OXcQ8XzfBW👈 @Zeynep_KocerQ7 thank u. I'm glad you enjoyed it!!! See u soon! \"Don't be afraid to give up on the good to go for the great\" @CarlaIvey thank u Carla! @DRguy1 thank you buddy. I'm glad u like it. Peace! @Now929OKC thank u for spinning the track #MrPutItDown w @pitbull guys! #OklahomaCity @wild949 Yeahhhhh! thanks for spinning the track #MrPutItDown w @pitbull guys! #bayarea @1035KTU HEY HEY!!!! Thanx for spinning  the track #MrPutItDown with @pitbull guys! #NYC Muy divertido estar con mi amigo Pablo y el hombre negro de @El_Hormiguero pueden encontrar todas las canciones aquí http://t.co/QFw6tLkVLT \"Don't let good sex confuse your heart and make you think you're in love\" #advise In #Dubai for a couple of days. Next stop #Madrid https://t.co/URTPKawmRP Mi gente de Los Ángeles,  las #AudicionesLaBanda son hoy! Mucha suerte a todos, show us what you’ve got! @LaBanda http://t.co/sSjUCmyL4U @MickiD216 thank u. Besos. @CharlieKing85 I'm glad you enjoyed it! Thank u! If you think you can.......you can. @Nanncylicious gracias! I can. I will. End of story. It's not what happened, it's what will happen. @TheEllenShow in australia u see White and gold. @FrioBella @FrioBella thank u. Im Gladys you like it. Much love to #Hungary Don't say maybe if you want to say no. No te rindas @Susmita_Shahnaz thank you si much Susmita!!im glad you are enjoying it. @djafrojack Enjoy my island buddy! Peace! RT @EricXWest \nGreat album @ricky_martin! Currently embracing my Spanish heritage!// Thanx Eric!Wish u much success in all U do buddy!Peace For more info on concerts/events check out http://t.co/xIajCu3cRR @kwesterling yes. My USA tour starts in September!!!!! Excuse me Yes!!!! My tour in #Australia starts in #April  RT @elfy_eli: @ricky_martin Will you be touring Australia again this year? In Australia! Happy to be back! Want 2make history? Join me and @HRC &amp; sign People's Brief for #MarriageEquality #LoveCantWait https://t.co/bNgYtLvxZK ¿Quieres hacer historia? Firma aquí. El Tribunal Supremo de EEUU escuchará. #AmorEsAmor http://t.co/9QU88bFPpD You know what's beautiful? Read the first word. (VIDEO) Lets create @labanda https://t.co/Y8mdzIDyJM @Pequesantu gracias! #SexySouls have you enjoyed \"A quien quiera escuchar\"? Remember you can get it here  http://t.co/QFw6tLCwDr #RickyAQQE #Familia han disfrutado \"A quien quiera escuchar\"? Recuerda que aquí puedes encontrarlo http://t.co/QFw6tLkVLT #RickyAQQE Tod@s listos para cantar en @premiolonuestro? ya nos vemos familia! http://t.co/QFw6tLkVLT #RickyAQQE RT @OnAirWithRyan: MAÑANA! @SimonCowell &amp; @ricky_martin will be on after 7 with all the deets on their search for the next Latin boy band +… Thanks @SimonCowell , we are going to put together the next Latin supergroup! #SoyLaBanda Remember.....You are enough. You're so enough, it is unbelievable how enough you are!!!! Buenos días mi gente!Como están?Yo listo para @PremioLoNuestro esta noche. No te pierdas la alfombra roja. http://t.co/QFw6tLCwDr Yup! #música, #música y mas #música. #igers #instudio #instacool can't for you to hear! http://t.co/Qn3rZCb3N5 #gorgeousGirl @ellahenderson  rock in it on @theView. Congrats! Welcome to America!  @SimonCowell #EQUIDADAHORA  #EQUALITYNOW Por Favor hagan #RETWEET PLS Feliz día de san Valentin para tod@s, este es mi regalo de amor! \"A quien quiera escuchar\"\nhttp://t.co/QFw6tLkVLT http://t.co/AKkusXW4A5 Happy Valentine's Day to all of you, here's my gift of love! A Quien Quiera Escuchar! http://t.co/QFw6tLkVLT http://t.co/Pk0oBEgW3U Happy Valentine's Day everyone!!!! @Donnasonrisas Awesome!!! thank you love. I'm glad u are enjoying it. @VazCami Besos! 💙 #NY #NewMusic  #RickyAQQE #ReleaseWeek  #AQuienQuieraEscuchar http://t.co/n5DqToJz7e #sexysouls @TODAYshow was fun. C U all 2nite @HardRockCafeNYC #timessquare #RickyAQQE http://t.co/QFw6tLkVLT @SusanaSegura2 @Cadena_Dial \"Disparo al corazón\" ;0) @Mrs_Sippy_ @TODAYshow thank you! Last night I dreamt I could fly. Really. RT @TODAYshow: Today on TODAY... Latest on American Sniper trial, Amy Pascal speaks out, Uma Thurman stops by, &amp; @Ricky_Martin performs. RT @TheEllenShow: .@Ricky_Martin esta en mi casa hoy. Canta la canción, “Adios” y sacude su chimichangas. http://t.co/JVVbdhu4vI Friends, get @Shazam ready for @TheEllenShow for some extra goodies &amp; tune in to watch me perform Adiós! #RickyAQQE Hey gang!!! Today i'll be @TheEllenShow!!!! Don't forget to check it out. #RickyAQQE @DespiertaAmeric en mi caso, no es verdad. @tyleroakley Amigo. Thank u so much for stopping by. See u soon. It's a must. Big hug. #RickyAQQE #ReleaseDay #seTÚ #igers #instacool #ME #Music #musica #calma #aquienquieraescuchar #beYOU… http://t.co/QKKpi74UhJ @IsaJennie they are Cd comes out today! Tell me what you think! I'm reading! Besos!  #RickyAQQE http://t.co/3jKtg3MMsz RT @WilliamValdes: Mañana llega a @DespiertaAmeric @ricky_martin 👏👏👏 #RickyAQQE http://t.co/MOp089Mjga Crazy media day talking to u all. Loved it. Thanks everyone! Que cool hablar c ustedes por tantas… http://t.co/rcxpuuezkd Familia, gracias x sus preguntas, pero + importante gracias X la fuerza q me dan.Ahora me tengo q ir. THANK U 4 everything gang! #RickyAQQE .@liliachavez04 @VevoLatino #RickyAQQE Que difícil pregunta. Me quedo con \"isla Bella\" pero también me encanta \"mátame otra vez\" .@Alerociogon @NoeChavez84 #RickyAQQE Mucho trabajo en silencio. volver a casa, amigos, mis hijos! #RickyAQQE .@sonny_1117 @VevoLatino #RickyAQQE Espero estar en Peru y toda Latinoamerica a finales de año! Tengo muchas ganas! .@MARIA_MARTA @VevoLatino difrutar lo q hago.En el momento q no me brinde felicidad lo descarto.Rodearme d genT positiva ayuda #RickyAQQE .@MirianMb26 @Vevo_MX  @VevoLatino A la venta mañana! lo puedes conseguir aquí http://t.co/w2CZpATiqu #RickyAQQE .@dani_samaniego1 @VevoLatino No hay nada +poderoso q la musica! Agradecido Xtodo lo q esta pasando.Gracias x tu pregunta #UNION #RickyAQQE .@Vevo_MX @Vevo @VEVOLATINO Me encanta \"ADIOS\" Todos mis videos me gustan pero deja q veas \"Disparo al Corazon\" muy especial #RickyAQQE .@YanYanina @vevolatino #RickyAQQE Mis hijos me inspiran! Son parte del TODO #RickyAQQE .@jpusarg @vevolatino Fieles, intens@s, buen@s cantantes ;0), honest@s, entregada@s! Me pediste 1 palabra pero es imposible #RickyAQQE .@YanYanina @vevolatino Sentido comun que tan fácil se pierde. #RickyAQQE .@CD09 @Vevo yes i will! I'm working on an amazing concept for the new show! #RickyAQQE Bueno no gente, aqui Estoy para contestar sus preguntas. Vamos a pasar un buen ratito venga. http://t.co/OXui9CRVEH .@dimitrakanaki @Vevo I'm working on a few things in english I'm sure u'll enjoy! soon to b announced! #digitalMediaTakeOver happy to be able to chat w you all a day before the album release. So cool.… http://t.co/D7zoezhUnY RT @LiveNation: Unlock @ricky_martin's #OneWorldTour Date + ENTER for a chance to win tix! #RickyAQQE &gt; http://t.co/T3JbrXnBHT http://t.co/… #Sexysouls Find out here what cities I will be taking my one world tour to in North America http://t.co/uVHpqzqkvl #RickyAQQE #oneworldtour Gang!! You can't miss this// Familia, no se lo pueden perder http://t.co/3BVJ7Ljm0m @DerekBlasberg @Armani lol Bug hug Derek! Always good to see you buddy. Abrazos. Still a little 😳 after The party. I need to ZzzZzzz NOW. Buenas noches mi gente. http://t.co/ILbYCpWgcr RT @LiveNation: .@ricky_martin is joining us on 2/9 at 4:15pmET/ 1:15pmPT for a FB Q&amp;A! #RickyAQQE Follow here http://t.co/HAE1NDPH4E http:… 🎶🎶Si mañana es un error, quiero estar equivocado🎶🎶 #RickyAQQE RT @RM_Team: ¡Los esperamos este lunes 9 de Febrero! http://t.co/T0nLZH7htV Deseo del día....... Paz para tu vida. Thank for your visit mariolopezextra while I'm #giving #birth #to #my #new #baby 😂😂😂👶 #RickyAQQE… http://t.co/7G3flYoe5Q #VideoShoot Disparo al Corazón #RickyAQQE http://t.co/RtYikK2m3W RT @iTunes: Un mensaje especial de @Ricky_Martin! Escucha A Quien Quiera Escuchar primero en #iTunesRadio http://t.co/fXTsomyP7Z\nhttps://t.… International press day. #RickyAQQE.     \"A Quien Quiera Escuchar\" #Miami Next stop #LA #LosAngeles… http://t.co/3EJXQzSJoF RT @billboard: Mark your calendars! @Ricky_Martin will take over our Twitter feed for a Q&amp;A on Monday, 2/9 at 5:30pm ET #RickyAQQE http://t… Te gusto mi Nuevo CD? Que te parecio? Si no lo has escuchado completo, puedes hacerlo entrando aquí 👉 https://t.co/teHe9ilO7h👈 #RickyAQQE RT @iTunes: A Quien Quiera Escuchar from @ricky_martin is now streaming on #iTunesRadio!\nhttp://t.co/Df01V1Wkrt\nhttps://t.co/7tCjGFi5Wd RT @jpuspain: \"A Quien Quiera Escuchar\"  @ricky_martin is now streaming on #iTunesRadio #RickyAQQE http://t.co/KQPk4I9MQH  https://t.co/zSp… RT @Cadena_Dial: ¿Quieres hablar en directo con @ricky_martin ? #25AñosCadenaDial lo hace posible. Descubre cómo: http://t.co/b8WYKX9a7e LGBT Alabamians have the constitutional right to marry regardless of who they love.BRAVO! How lucky they are! VAMOS #PuertoRico Falta menos! 🎶🎶 Si mañana es un error, quiero estar equivocado 🎶🎶 #RickyAQQE RT @SonyMusicSpain: Escucha en exclusiva, y gratis, en iTunes el nuevo álbum de @ricky_martin, \"A quien quiera escuchar\"! http://t.co/O181Z… Hey!!! 👉https://t.co/uTtxh34gxC \"Escape the ordinary\" #Sol #vida #calma #relax #Music #Life #PuertoRico #Caribe #Caribbean #barefeet #Saltyhair at #peace… http://t.co/1jPVgKPzAe Taking a break between interviews. #happy http://t.co/wk957QRvx9 Gang! Preorder on @itunes NOW!! and get #adíos and #Disparoalcorazon instantly  http://t.co/Mw2Do3cbUa #RickyAQQE Mi gente! en @itunes pueden preordenar \"A quien quiera escuchar\" y tendrán #disparoalcorazon y #adiós al instante http://t.co/eDpC4kC8O6 :0) Preorder NOW on @amazonmusic  MP3 http://t.co/68vwNpoHkH #AQQE RT @perfpartnerspr: Puerto Rico avanza contra la trata http://t.co/ryPeRZHgpG MT @lgbtpr @LambdaLegal sometió  brief sobre matrimonio igualitario en Pto Rico.Gobierno tiene 30 días para contestar http://t.co/8FnWk3eOaS You can Preorder in @Walmart #AQQE http://t.co/LTrDRFCdKq ;0) RT @AMOR931FM: ¿Como te gustaría asistir una presentación especial de Ricky Martín? Sintoniza @OscarDj93 para tu oportunidad de ... http://… @LizzyChocs can't wait to go back. I love Perth @AlineKuhn beijos Aline. Obrigado por todo. #Colombia #MissUniverse https://t.co/rh1sNiFi8K 👈 👀👽🙈 have a great Sunday everyone 🌞☀️ http://t.co/ccndSOzsyZ RT @Ricky_MartinAus: Well guess what #Australia?..Only 3 months to go for @ricky_martin 's #OneWorldTour kicks off in Townsville! #April25 … \"tanto amor como un  __________ \" http://t.co/J2ei4aEdSM #DisparoAlCorazon @YoelHenriquez @billboard @pedrocapo @resparzaruiz @JulioReyesMusic Gracias Gracias Gracias por su arte mi gente! Vienen cosas buenas! @RodnerFigueroa gracias Rodner. Abrazos. When you don't know what to do, do nothing. Cuando no sepas que hacer, no hagas nada. @rubenandco acabo de ver reportaje referente a la trata humana en #PuertoRico.Gracias por gran trabajo ... http://t.co/xlXVbg1L37 RT @anghami: Congrats to @Ricky_Martin. His New song \"Disparo Al Corazon\" made it to number 1 on @Anghami http://t.co/NZI9i792pq http://t.c… PHOTO: A little bit WORK in great company. //Un poco de trabajo en buena compañía. 👉http://t.co/jgmzJKGHGm👈 🎶Conocerte fue un disparo al Corazon. Me _______ con un beso a sangre fría y yo sabia que era tan letal la herida que causo..... 🎶 @CheitO_Evans que bueno que lo disfrutaste! Saludos! Gracias! @EvaLongoria FUN! What's next!!! I'm ready! :0) @SarahConoch pues adelante, que pa luego es tarde! Suerte! #Colombia gracias X hacer #Adios numero 1 en la radio. Q mejor manera d empezar el año q c esta noticia. Prepárense q este año llevo ➕música RT @billboardlatin: .@Ricky_Martin lands a top spot on the #Trending140: http://t.co/t3v4h7OSzz http://t.co/yDIAg5Sntl Familia! Preordena #AQQE en iTunes y descarga de inmediato \"Adios\" y \"Disparo al Corazón\" http://t.co/Mw2Do3cbUa Hey Gang!! Preorder on iTunes to get Instant Grat track of Adios and Disparo Al Corazón http://t.co/Moo1fbhNCx :0) I'm on Instagram! http://t.co/XjtlVMRMNf \"Be you, the world will adjust.\" You are #amazing.......remember that. RT @SonyMusicSpain: #DisparoAlCorazon, el nuevo sencillo de @ricky_martin, disponible en todas las plataformas digitales! Escúchalo ya http… Thanks to all for today!! Hope you had fun! Remember “A Quien Quiera Escuchar” is available for pre-order tomorrow!! #RickyAQQE Gracias a todos, espero les haya gustado la actividad y recuerden que en horas pueden Pre-Ordenar “A Quien Quiera Escuchar”! #RickyAQQE #DisparoAlCorazon #rickyAQQE http://t.co/1jWEOTNNAe @pedrocapo gracias a ti hermano. Estoy bien contento. Ahora a TRABAJAR! #rickyAQQE Tweet #RickyAQQE to reveal the first piece of exclusive content from my new album “A Quien Quiera Escuchar” now! http://t.co/TwneKTFGiW Sexy Souls! Starting at 6pmEST I will be unveiling exclusive footage from my new album “A Quien Quiera Escuchar”. Stay tuned! #RickyAQQE Sexy Souls!  A las 6pm ESt estaré revelando material exclusivo de mi nuevo álbum \"A Quien Quiera Escuchar\"  estén atentos! #RickyAQQE Listen. Escuchame 👉 https://t.co/N94uWGxeCZ 👈 RT @SonyMusicLatin: Listos? El lunes 6pm ET @ricky_martin compartirá material  de #AQuienQuieraEscuchar con un Tweet To Unlock #RickyAQQE h… RT @SonyMusicLatin: Get ready! Next Monday 6pm ET @ricky_martin will share special material from #AQQE with a Tweet to Unlock #RickyAQQE ht… \"Disparo al corazón\" disponible en radios Enero 12 y en digital Enero 13 / available on radios Jan… http://t.co/kJYggLkwSW Aqui imitando a @Calle13Oficial 😜😜😜 http://t.co/ap8EzgAjAF 👈 #HeyHey Pre-Venta \"A Quien Quiera Escuchar\"  👉  http://t.co/V0mgbiVM34 #RickyAQQE #RickyAQQE Mi gente!Aquí las portadas d mi nuevo CD. Loco Xque escuches la música! CD covers!Cant wait 4u2 hear the🎶 http://t.co/meDJttd2jA Hello from #heaven. 😂😂🌴🌺🌊🏊🏄 http://t.co/3y1J9ZLGp7 👈 @EvaLongoria happy new year beba!!!! He believed he could, so he did. #HeyHey Happy New year gang!!!! 👉http://t.co/G9jzV4VCuN 👈 Australia, New Zeland how is 2015 looking so far? 🎉👏🌏 @claudomi si \"Bare feet, salty hair\" @SherylChavous felt beautiful TO read your words. Thank u! @JojoFierce_ @dreadfuldaisy hey hey! Besos. #shoutout. 2015, año de la buena suerte para #Capricornio. Haz limpieza espiritual de tu mente y de tu alma. Medita y ora diariamente @enriquesantos gracias tocayo! Felices fiestas! Te mando un abrazote apretao. Bendiciones para ti y los tuyos! Salud y Exito!!!! @PerezHilton Thank you chico! Hope you have an amazing year! Mucho amor y cariño para ti y toda tu familia! You are cute and all but I'm not sharing my coffee. I💚my☕️ Nada como reencontrarme con viejos amigos. Gente muy importante en mi vida. #NuevosCiclos #Amistad #transformación #ElQueSabeSabe Yeahhh! It's my birthday. Go ahead, send me some cariño! I'm reading and listening. 😂🎉👏😜🎶😴🎂🌴🏊  👉http://t.co/ncBPaYdm7W👈 :0) #RMalbumname English http://t.co/9ZJP8kVJtS #RMAlbumname Esp: https://t.co/hBNnDw9Tr6 #RMTrackReveal http://t.co/yyTxF7oSpu @GeriwithaG Its Perfect!!!!!!!!! In heaven! Besos. #RMTrackReveal http://t.co/SzLQe5Cbe3 #RMTrackReveal http://t.co/aDPQoc2V4I Gobernador @agarciapadilla convierte en Ley proyecto de Trata Humana http://t.co/kpWlfjq1gN #STOPHumanTraffickingNOW  #PuertoRico \"Get ready, things are shifting in your favor. Don't talk yourself out of it. Believe 2015 is your year of acceleration  \" Tomorrow, home sweet home!! I can hear the sounds 🎶🎵🎶🎄🎁🎂🎉👏👏👏 👉http://t.co/TnsbAMEyf5👈 @DanieLopez_01 saludos Dani. Paz. No eres ignorado!!! 😃 I woke up high!And I haven't had #coffee yet! Happy! #GoodThings! #GoodTimes! Wish u all the same!👉http://t.co/tBpBBIoyGL👈 Music is _________. #FF #FollowFriday me on #HeyHey 👉http://t.co/HTM6q36IUX 👈 Mi gente, estoy loco por que escuchen mi nuevo álbum. Vengo romántico. #YNoDigoMas ;0) Que viva la paz!!!! 👉http://t.co/i9KQOvz0gF👈 (Esto hay que verlo)President @BarackObama will deliver a statement on #Cuba from the Cabinet Room @ 12pm ET.  http://t.co/PzSiFleMfL #HeyHey 👉http://t.co/KHyTKKt7Q0 👈 #HeyHey in #english. On twitter YOU read me. On #HeyHey you hear me http://t.co/i42peWymgv 👈 follow me. Venga mi gente. En #HeyHey me escuchas http://t.co/lVM4GySAFw @Guido_Rochin FELICIDADES en tu exito Guido. Es el comienzo de cosas increíbles para ti! Fuerza! Tu placer es mi placer. @teddy60850 Bissous. ;0) \"Feelings are just visitors, let them come and go.\" Venga mi gente! Sigamos votando por @AginaMusic envía RICKY al 5512 ó Marca *5512 #HoyGanaLaVoz del #EquipoRicky siempre fue el mejor Todavía tenemos tiempo para votar por Agina!! Envía Ricky al 5512 ó marca *5512 #EquipoRicky Noche de @AginaMusic! Sigamos votando mi gente Envía Ricky al 5512 ó marca *5512 #EquipoRicky @laVozMexico \"Be somebody who makes everybody feel like a somebody\" Quien tiene magia, no necesita trucos  ;0) Coé galera? ¡Bora fazer barulho e Tira pé do chão Today I only have time for happy people. :0) @LuisLarrain que horrible acoso. Lo siento mucho. Mucha luz para ti siempre Luis. Igualdad para todos. Good vibes only! Si mis ojos pudieran tirar fotos. 😎 https://t.co/KZoDEl4kCQ MT @rondenepr: @Ricky_martin nominado a @premiolonuestro 2015 en 3 categorías #ArtistaMasculinoDelAño #VideoDelAño #ColaboraciónDelAñoUrbano Live show http://t.co/4lw5a2Of8b AIDS WILL LOSE. More education. Less stigma.  #WorldAIDSDay ~May your coffee be strong and your Monday be short. ~ @ShaneMasYMas send u a big hug and a kiss Shane!!! @Shayan_1971 I also love \"Tu Recuerdo\" with La Marie (Chambao) .@Dresreid @_tatianadelgado\n@Erikamarosi\n@Tyenyriamyers\n@alohakupono\n@Mattday_FTB so awesome 2work w such amazing dancers! Thank u gang! Next stop Mexicali https://t.co/TkvkVsKjQN @VicenteCastiyo jejeje felicidades Vicente. .@Juanjaramilloe felicidades caballero. Vi tu video. Q valiente eres. Aunque no t conozco personalmente, estoy muy orgulloso de ti. ~If we're not meant to have a midnight snack, why is there a light in the fridge?~😜 Bed head http://t.co/T9tcxfupOl #ThingsMentallyStrongPeopleDo Evaluate their core beliefs, and modify as needed. Hey, you! Don't give up, okay? On my way to @theforum for the @iheartradio fiesta latina...get there early Gang! I'm opening the party  http://t.co/pVlhaeUPA6 @BillyGilman Congratz Billy! We don't know each other but as a fellow musician all I have to say is..... I am so proud of you! #LoveIsLove PHOTO: http://t.co/HHyi8QEPjL Life in the road! https://t.co/XLnU4ACuSd @TyHerndoncom Congrats brave man! Very happy for you! #LoveIsLove ✌️💪👏👍 @EvaLongoria You are INCREIBLE. This is only the beginning!  @globalgiftgala MT@alinaperalta: Gr8 night w our Honorary Co-Chairs @ricky_martin @evalongoria @globalgiftgala  http://t.co/19TZ5JOzCd (Thanx 4 all Alina) RT @EvaLongoria: Thank U my beautiful friend @ricky_martin for co-chairing this amazing night at the ... http://t.co/IzrPfSUEts Otro dia mas, otra oportunidad pa' cambiar! Yo? En ensayos.  Ceremonia de apertura de los Juegos Centroamericanos y del Caribe #Veracruz2014  #EquipoPUR #TeamPUR Hasta la verdad cambia. Y esa es la verdad. ;0) http://t.co/DckTuWSUbn Do NOT turn your mind into a battlefield. #BestCourseOfActon. @Natucha_79 si @Natucha_79 jjeje claro @Luvly_Jubbly2 can't wait. Next year I'm there w lots of concerts!!! \"Kindness doesn't cost a damn thing. Sprinkle that sh*t everywhere!\" http://t.co/NXumZ3VSQ2 #Adios @LizzyChocs I'm very busy and I am having a great time on the road. But I ALWAYS MISS AUSTRALIA.  #ILoveOZ Une minute de silence pour tous ces baisers destinés aux lèvres et qui sont morts sur les joues. Gracias Morelia. Que gran publico! Thank you #Morelia.  What a BEAUTIFUL audience. #LiveinMexicoTour http://t.co/tsyjEScgUA @liyandrad mujer valiente!!! Felicidades! Besos! . #Adios to the weekend! Feliz fin de semana RT RT!!  http://t.co/1vEiUlbEhd @HugoDelgad0o ya casi salgo. Me? About to GO ON stage. #onFire. How are YOU? Yo a punto de entrar a escena! ¿Tu que haces? Will power and resilience. // fuerza de voluntad y resistencia. RT @EvaLongoria: Want to come with me, @Ricky_Martin &amp; @VictoriaBeckham to London? Donate $1 to million$race, get a chance to come! http://… RT @EvaLongoria: #million$race starts today! $1 can race you to the finish line in London with me and @Ricky_Martin. … http://t.co/zMYJDUay… You must unlearned what you have learned. You will know good from bad when you are calm, at peace. ~YODA Doing my best in trying to become a better version of myself. #ThingsAreFlowing @Yanetb 2awesome scorpios. \"Un minuto de silencio por todos esos besos destinados a los labios, que murieron en las mejillas\" MT @EvaLongoria \nCheck out the work that @RM_Foundation is doing 4children!So happy 2be benefitting @ricky_martin in @GlobalGiftGala London! Why it matters where — and when — @tim_cook spoke up about being gay http://t.co/81CXjJquiF #proudtobegay @PiccoloUniverse está buscando el mejor disfraz de Halloween de niños. ¡Envíanos las fotos de tus peques! http://t.co/anSCYSoZ92 @PiccoloUniverse is looking for the best kid's Halloween costume. Enter your picture now! Can't wait to see them! http://t.co/Gs5Q7hTkRv @mario_ramoon pues claro! :0) What would you tell your younger self? #QuestionOfTheDay @EvaLongoria @globalgiftgala @FSLondon CANT wait Eva! Lets do This. Mucho cariño! #London. If every where you go there is a problem..........guess what? Buenos Aires GRACIAS. http://t.co/DRFngw1g6a @ClaudinaRom igualmente. Nos vemos pronto. @javierfguerra tienes razón. Gracias #Chile 👍😊 Gracias #Chile. 48mil almas unidas por la musica. Thank you #Chile. 48k souls united for music! 🎶 http://t.co/LDeiNeBUsn @SparkyRadio2 @Radio2UAE it was great talking you buddy. PEACE! RT @dracorosa: Gratitude is the language of Love.\n🎩💀🌹 Going over my #photo album and found this.... http://t.co/mGzzoUScey Oscar de la Renta te recordaremos no solo por tu clase y elegancia que elevó el mundo de la moda, pero también por tu filantropía. Gracias. @ATestardUmhauer l'année prochaine 😄 Hey gang here is the Spanish/French version, enjoy #AdiosVideo / Familia aquí está la versión en Español! http://t.co/NXumZ3VSQ2 @danycastilo gracias. Saludos a tu mama. @sajahibi 😂😂😂hope u liked it. PEACE. @BabyyyJai love u 2 @miguel_alves yes I am. Next year. Can't wait. Muita saudade do Brasil. @thonyLoup right back at ya'. peace! @harrynlou_  be happy. B urself Ok gang! I'm glad you enjoyed #AdiosVideo I'm hopping on a plane to Chile now. Long flight. Stay in touch. I'm always here reading ur twts Mi gente, gracias por tanto cariño.Me estoy montando en 1avión a Chile.Q bueno q les gusto #AdiosVideo sigamos en contacto.Siempre los leo @28Harry je t'aime aussi!!! #AdiosVideoqa @amorsito_1 je t'aime mon amour. 😘 I will be posting the spanish/french version of the #AdiosVideo soon. I'll let you know when. Estén pendientes que próximamente estaré posteando la versión en español/francés de #AdiosVideo. #AdiosVideoqa La última! @marta817 El nuevo álbum sale en el primer trimestre de 2015, si Dios quiere. en pleno trafico d MexicoCity contestándoles.HERE in the middle of a massive traffic jam in MexicoCity answering ur? http://t.co/Q0eGEm2ouN #AdiosVideoQA @cath_sexysoul it definitely did. I miss Broadway like crazy. Can't wait to go back. #AdiosVideoqa @Jeanette_Guzman My mother tounge is spanish and so  proud of my language. But french WITHOUT a doubt is incredibly sexy. #AdiosVideoqa @luisina007 Fusión es mi fuerte. Influencias del tango mezclado con lo latino y sonidos de Europa del Este (los Balcanes). Mi gente, Les gusto???? Díganme. Gang, did you like the video??? Tell me. Ok gang!R U ready?HERE is #AdiosVideo HOPE u Enjoy! Bueno mi gente!Están listos para ver #AdiosVideo?Pues aquí esta!\nhttps://t.co/8OE5BzOnfn #AdiosVideoqa @Maquita_G Hay muchas baladas. Es un CD romántico. Pero sabes que es inevitable presentar un poco de fiesta. #AdiosVideoqa @lencsikeD Discrete. Discretion. #AdiosVideoqa @jpuspain Nunca fui purists. Hay varios géneros. Me encanta la fusión, pero con coherencia. #AdiosVideoqa @lencsiked i had a blast! I really enjoyed playing the bartender. #AdiosVideoqa @nickism3 Estando alerta y nunca tenerle miedo a los cambios. La honestidad es esencial. #AdiosVideoqa @snt_1967 The Song was written first which is usually how I WORK, but then again in the creative process anything can happen! #AdiosVideoQA @CarlosPaulC a las limitaciones. A todo lo q me quite la Paz. A los carbohidratos después de las 7:pm 😂 Ready for q&amp;a gang? Mi gente estamos listos para las preguntas y respuestas? #AdiosVideoqa So CLOSE!!! #AdiosVideo feeling crazy... http://t.co/PUSMVcyGYs Tune-in @etnow tonight to go behind-the-scenes of #AdiosVideo #etnow No quiero perder el control… #AdiosVideo\nhttps://t.co/Z7sFsMIy3E @Barbiemadrid4 el q&amp;ya es mañana. ;0) @florcita_rm es puro amor Flor. Besos. @VanEEduc Celos?????? pero si hay cariño para tod@s. ;0) @cristyray09 thank you so much for your love. Can't wait to go back to India. Besos. @SpaghettiKing THANK you so much. I'm glad you enjoyed the book. Much peace to ya'! @idkamoademetria mañana. 7:30pm hora del este. @angelostand gracias @GumeGramirezjr mañana! @M_Bella07 exactly!!!! 👍👏👏👏👏 @johncsneddon I like how you think!!! @CamSlamBam and that's exactly my point. :0) \"To avoid criticism, say nothing, do nothing, be nothing\" … me rindo a tus pies...\nestán listos? #AdiosVideo http://t.co/uI16iqYtYY @jaideepwadali thank you J. Clear your mind of CAN'T @FreakumBoy gracias!!! @flopylacalamar @yesicatobio hola! :0) Tengo una sorpresa para ustedes // I have a surprise for you !!\nhttps://t.co/7fI9Zz7NLf Interróguese diariamente ¿Soy honesto conmigo mismo? #life #vida Así suavecito… #AdiosVideo\nhttps://t.co/DU0mB7GsKI Everything happens for a reason, but if it doesn't happen, it's also for a reason. \"Todo pasa por algo, pero lo que no pasa, también es por algo\" \"Si sigues haciendo lo que estás haciendo, seguirás consiguiendo lo que estás consiguiendo.\" Stand against bullying! Wear purple and make your profile pic purple for #spiritday 10/16 at http://t.co/ef7jncbfJC #LGBT Australia!!! Just give me a chance…. #AdiosVideo http://t.co/oSSfp8eQeJ Gang!! Another teaser form the video, I just can't wait! #AdiosVideo http://t.co/MtOr9u8VWt @Umo_Reyes :0( Gang! Are u ready for the video? / Familia están listos para el video?  #AdiosVideo http://t.co/Kt2C70tQTZ Photo: http://t.co/I1hS4INKyU How are you feeling? Como te sientes? \"Normal is an illusion. What is normal for the spider, is chaos for the fly\" Define normal. Thanx 4 sharing Chris! :0) RT @CSalvatore: WATCH my personal #comingout story here! https://t.co/BAy0A0jO9l \"Al león no le importa como lo pintes......sigue siendo el rey.\" #cita #quote Happy National/international #ComingOutDay! ITS ALL about #selfLOVE #dignity #freedom #strength #power Eu quero voltar para o Brasil YA. Tenho muita saudade. #prontofalei #Photo http://t.co/KEOZdGbEkn Instagram? http://t.co/ZCiyk2j4jJ At Soundcheck #MonterreyMexico https://t.co/59zRpFGtth @zeljkobreathe can't wait to go back. #soon \"You are confined only by the walls you build yourself\" @syntekoficial @juanes @LatinGRAMMYs un fuerte abrazo a ambos desde Guadalajara!!!! 🎶Paso a paso, poco a poco llegas!🎶 #Igualdad legal en el amor! Pronto lo celebraremos en #PuertoRico también! http://t.co/ayu40K8LAW Great things happen in silence. @ItsNibriana thank you so much. Im glad you liked the show.  Have fun tonight. \"I disapprove of what you say, but I will defend to death your right to say it\" ~Voltaire #adios\n#nuevosingle \n#newsingle \n#adiosvideo http://t.co/W7NtdJfW5d \"La educación es como una erección; si la tienes, se nota.\" Siempre positivo, Nunca negativo!\nEl hijo que no limpia su cuarto y se la pasa viendo televisión, significa que...Está en casa! :0) Puedes encontrar #Adios aquí // #adios available now here:  Google Play: http://t.co/wgfl9nCnxT iTunes: http://t.co/D0zzfbUXhl Please RT #adios performed for the first time on TV today @vaporti http://t.co/o8eFM0ACI8 🎶\"Eh eh eh voy a combatir contra tu prisión, salvar tu corazón\" 🎶 Let it bloom. ...and those who were dancing were thought to be insane by those who could not hear the music. #Nietzsche Live now! / En vivo ahora! http://t.co/xKuhVaVwh3 Hey #sexysouls,Maintenant Vous pouvez m'aider en demandant à vos radios préférées de diffuser le titre #ADIÓS Cliquez\nhttp://t.co/5Qz2AmxR7Y Come on #sexysouls, now you can help me by asking your favorite radio station to play #ADIÓS clicking here👉http://t.co/5Qz2AmxR7Y👈 Venga mi gente. Pidamos #ADIÓS en tu estación de radio favorita. http://t.co/5Qz2AmxR7Y👈 Ensayos!!! Show Rehearsals!!! https://t.co/JMNUr3zYgY RT @RM_Team: Let's spread #Adios all over the world! #RickyMartinOnRadio Awesome prizes!! http://t.co/9uglhhPhGr @AMT_1970 in some cases \"Some men are more scared of educated woman than armies, because educated women are unstoppable\" I agree. (Via@NicholasFerroni) #Follow en instagram http://t.co/m95N3Cl9Je Aquí está #Adios! http://t.co/7yeqf0mhPd #NewSingle \"No hay malas palabras sino solo malos entendidos\"  #quote No hagas cosas buenas que parezcan malas. Puerto Rico ✈️ México https://t.co/5m4tYEiSAZ RT @SonyMusicItaly: Ecco la copertina del nuovo singolo di @ricky_martin, #Adios, in uscita in digitale il 23/09: http://t.co/tw7DHd95Jb Recording PSAs https://t.co/vcMH4Kwjqn RT @RM_Foundation: Ask the UN to make ending modern slavery a priority in the Sustainable Development Goals, sign the petition today http:/… RT @peaceloveworld: Introducing #PeaceLoveWorld for @ricky_martin! Shop for a cause &amp; support the @RM_Foundation  http://t.co/H0RD3obfjI ht… @pabloalboran Felicidades Pablo. No me cansare es escucharla. Puro sentimiento! Éxito, éxito y más éxito! http://t.co/XcMt64qHT9 #PorFin Agradecido. ARGENTINA. http://t.co/m4r55F28QV Take a break #instudio https://t.co/yL8P1bqBc5 T V O ~ I 👀U    PHOTO: http://t.co/HPzIAafxTX Hoy no me quiero levantar. #Photo http://t.co/srMR7myjo1 https://t.co/CHrXh09qGS #StudioTime studio time https://t.co/SPUuekVlYm If I got a dollar for every time I got distracted......🎶Throw up your hands if you love a big #booty🎶 😉😜😎 Make it simple but significant. #advise Ok gang. I'm on Vine. #Follow https://t.co/CHrXh09qGS You are experiencing the love experience. #inCreativeMode RT @peoplemag: Meet the 90-year-old newlyweds who began their relationship more than seven decades ago http://t.co/7C4xqmJ3mD http://t.co/q… Changes are scary. Regret? Even scarier. Beatería~Actitud d una persona q da grandes muestras d devoción y religiosidad, generalmente d manera exagerada y fingida #PalabradelDia RT @UNICEF: Violence against children hides in plain sight. Why it's in our hands to #ENDviolence: http://t.co/Sr8V3Ncuuh http://t.co/f437M… My body is here but my mind........... there. #ILike. RIP Gustavo Cerati. Shooting video for new single! Filmando video del nuevo sencillo, http://t.co/Kr3N2hPNBe @ #VideoShoot! Life doesn't have to be perfect to be wonderful. 🌊 RT @RM_Team: ¡¡¡¡¡CONFIRMADO @ricky_martin EN #ARGENTINA !!!!! http://t.co/p1zhtq6SOl No fear. No shame. Hey gang!! Did you see @SofiaVergara do her #IceBucketChallenge?  http://t.co/BFN9luImh6 #PHOTO http://t.co/HpErf8FgFh Dream do come true. @RM_Foundation hoy celebramos. RT @RM_Foundation: Río Sunglasses, gafas 100% en madera y lente polarizado. Cómodas, livianas y flotan! Con tu compra aportarás $2 a RMF ht… RT @juanes: Aceptando el reto de @ricky_martin https://t.co/tllRZHGHs0 #ALSIceBucketChallenge (eso campeon! Estaba fria! 😂😂😂) @pabloalboran eso es Pablete!!!!!! Todo por una noble causa? bravo tío! .@iamwill accepted my #alsicebucketchallenge? Wooohoooo! https://t.co/1V9Qa6bhqt 😂😂😂 @BohdiByles @RM_Foundation thank u!!! @EvaLongoria @MaiteOficial @agarciapadilla cumplí el reto. ;0)   #alsicebucketchallenge? http://t.co/wjreng2VQh .@kylieminogue @JoelMadden @pabloalboran @juanes @Calle13Oficial @Sofiavergara @iamwill  #alsicebucketchallenge? http://t.co/wjreng2VQh .@EvaLongoria @victoriabeckham @MelanieGriffith @agarciapadilla @MaiteOficial Ok challenge accepted.  Get ready 4my nominations 2morrow AM The person that NEEDS to fix everyone, needs some fixing too. @PaulGrossFansUN 😂 Claro que puedes. Tu si puedes ;0) 🎶🎶harmonies are in love 🎶🎶 #instudio \"Good people are like candles; they burn themselves up to give others light\" Tenemos que vivir sin miedos. Tenemos q amar sin miedo. Preséntate y Entrégate a todo tal como eres. #LAVIDAESCORTA. #advise. #RIPRobinWilliams shocked and saddened. #comedygenius @BlakeSkjellerup Congrats! Don't let anyone kill your kindness. Its bn a crazy week. Work work work.  But I'm here reading ur comments. Thanx for everything gang. Peace! Una semana intensa de trabajo pero aquí estoy. Leo sus comentarios. Gracias por todo familia. .@LaVozMexico http://t.co/s8HJ0eCxps #FollowMonday @PiccoloUniverse http://t.co/ESRhLzrUMg Check it out! When I say \"the other day\" it can mean anytime from yesterday to 365 days ago. @marcemjagb duh!!! ~Don't take anything personal. When you are immune to the opinion and actions of others, you won't be the victim of needless suffering~ Que atractiva es la congruencia. Love, kindness and common sense. Argentina! Te echo de menos. Nos vemos muy pronto!!!! RT @frankmugisha: Breaking news , I am officially legal . The constitutional court in Uganda has declared anti homosexuality law 2014 null … Today I worked on the concept of the new tour. Insane!!Can't wait to go to a city near U #newCD #newShow #creativemode #nuevoshow #nuevoCD Hoy trabajé en el concepto de la nueva gira de conciertos. Demencial!Loco por visitar tu ciudad! #newCD #newShow #creativemode #nuevoshow @AssemAlTawdi dont worry. RT @Cath_SexySoul: Today is the first World day against trafficking in persons.Thank you @ricky_martin+@RM_Foundation for their continuos w… @Coordinacion_mx gracias! Contento de estar de vuelta y tener su apoyo. Besos. @Dana_A02 hey!!! Can't wait to go back. PHOTO http://t.co/8i1lRVXY7j #SexySouls abrimos dos fechas nuevas en MÉXICO!! Están listos?? #México lindo y querido?Acabo de aterrizar. Listo para @LaVozMexico y con mucho entusiasmo. Será tremenda temporada. No se la pierdan As ferramentas que fazem de mim um pai melhor http://t.co/IyD7VRxAPZ The Tools That Help Me Be A Better Parent via @PiccoloUniverse http://t.co/LNcVVMX2cG Las herramientas que me ayudan a ser un mejor papá vía @PiccoloUniverse http://t.co/YSIBWvJOeP Rehearsals in #Latvia. Ensayos en #Letonia  http://t.co/UP2L5BsQwe PHOTO: http://t.co/ncJFIS0YyG día de verano en #Letonia. Beautiful summer day in #LATVIA #Latvia, we have arrived! #Letonia, hemos llegado! Tomorrow performing at #NewWave Sound Festival. #newwave2014 Y esta #noche #show en #Marbella, #España. #concert #Spain! 🎶😎☀️🎤🇪🇸🚢⛵️ @LauraPausini @OficialYuri @julionalvarez83 @LaVozMexico estoy listo para este nuevo ciclo. Muy entusiasmado!Y que bueno que es con ustedes! I love #Dubai. Sydney-Dubai-Madrid ✈️💺🚄🚅🇪🇸 .@TheVoiceAU What an amazing experience it always is. @anja_nissen Congratulations!u r so talented &amp;sweet! @jacksonwthomas mate u r the BOMB #Australia  SMS JACKSON to\n199 55 999\nSMS votes \nor call\n1902 55 95 15 Don' forget to vote for #teamRicky @jacksonwthomas is an amazing representation of Aussie  talent @thevoiceau http://t.co/jEbZO1AOLF RT @Ticketek_AU: MyTicketek presale about to start for @ricky_martin One World Tour! http://t.co/sw2JkIujJk #RickyMartin #OneWorldTour2015 @la100fm gracias! Feliz día del amigo #Argentina!!!! The best way to vote for @jacksonwthomas here: http://t.co/jEbZO1AOLF every song counts as 2 votes #teamRicky @TheVoiceAU Come on gang!! Lets vote for #teamRicky @jacksonwthomas is an amazing representation of Aussie  talent @thevoiceau http://t.co/OHuQunqlt3 @beaumaur yes i was! \"I meant to behave but there were too many other options\" .@therealbeauryan awesome interview brotha. #riseforalex Another Photo http://t.co/4wodKa0sie PHOTO: http://t.co/LURJo4dIuA Congrats to winner Madalena Rosario, who will be joining me @TheVoiceAU finale (pending approvals)! Hey #NewZealand I'm ready!!! Cant wait! http://t.co/J5g1b0Ryz3 Watch speech by the extraordinary @transgirl_mom discurso de EXTRAORDINARIA MADRE de hija trans http://t.co/Cwu3MpB8Mu  (RT  @PedroJulio) @AaronHarley56 thank you. In Adelaide next May! On tour for sure! Cant wait. On our way to the airport. #Melbourne here we come! Love the song &amp; video! The Madden Brothers! http://t.co/4B7GVaCTtU #NothingLikeItOutThere  @JoelMadden #Congrats  Show ur love #SexySouls Concert dates http://t.co/xIajCu3Ler @keithajk yes I am!!!!! Looking forward to it. Congrats @IanThorpe! Brave man! Happy for you! Millions appreciate what you've done! Proud of you!  #SelfLove Feliz cumpleaños @joansmalls! #bellezaBoricua #OrgulloBoricua Buon compleanno amico http://t.co/CYANYGKDNQ🎉🎂 @armani Mis besos te caerán como gotas de lluvia. #YO #RMFACT  http://t.co/cEI9R3M8at #RMFACT = nothing compares to my #SexySouls :0) #RMFACT the 1st time a walked on stage to perform professionally was on July 10th, 1984 🎉🎂🎈🎊🎁 #ArgentinaALaFinal VAMOS CARAJOOOOOOOO!!!!!!!!! Un continente por la albiceleste!!!! Felicidades! 🔵⚪️🔵 http://t.co/BNKefYlwMA 2 days left to donate,win a limited edition PLW tee &amp; enter contest to join me on @TheVoiceAU http://t.co/15x0gBk9Sr Força #Neymar!!!! Mi gente venga, a vivir con la convicción de que podemos hacer cosas EXTRAORDINARIAS!!! Check out this video  http://t.co/pQkJnkawxE @Freejay9 yes! hopefully early next year! See u there! \"El sabio es sabio porque ama. El loco es loco porque piensa que puede entender el amor.\" Paulo Coelho (pues yo soy loco y sabio) Sometimes not getting what you want could be a wonderful stroke of luck. \"Broken is it's own kind of beautiful\" Check out my NEW video! Here are all things we're going to do together when you join me backstage at @TheVoiceAU  http://t.co/EdUNsI5CnU \"La felicidad te mantiene dulce\" MT @Ricky_MartinAus  #New: @ricky_martin  - #VIDA (Afrojack Remix): http://t.co/AFGG5MvYo0 RT @jpuspain: GRAN ESTRENO!!! Lista la versión más dance de #VIDA @ricky_martin by @djafrojack Remix) http://t.co/ZZDXsQe8Rn I'm glad you like my book. Thanx @anita_bonitanz   #inthemoment  #ME  ❤️ http://t.co/gtFrYFUXN2 RT @kylieminogue  #thevoiceau w @ricky_martin ❤️ Are you all enjoying the live show?? http://t.co/yoqX2BIdUv #PuertoRico te echo MUCHO de menos. @WWLatinoMSN jajjaja hay veces q no se puede usar Google translate para saber que se dice en otro idioma. #LostinTranslation #oldtwit @astridinn gracias!! #vida https://t.co/QpGhajjagT @SonyMusicCol es @ricky_martin con guión bajo. :0) felicidades por el partido!!! Nos vemos pronto!!!! @SJoellireland thanx!!!! The one and only @djafrojack did a remix for #VIDA!!! Here is the teaser http://t.co/zmLHhgY2XO Enjoy it!!! @ElijahKingMusic send you a big hug brotha!!! Much PEACE to u! U r an awesome composer! Peace! Muy contento de poder compartir con ustedes...... http://t.co/4Gx1R0eDxi (via @elnuevodia) #VIDA #China Guys! Im happy 2announce that #VIDA is #1 in #CHINA.1st time ever that an international artist is #1on both international &amp;domestic charts! @LisaRBlackHorse i have! this is my instagram http://t.co/cVfv4lLzwI Come 2Australia and b my guest 4an evening of gr8 music!Entries support @RM_Foundation. Let's end child trafficking: http://t.co/p5QJPHs2W5 Si no te puedes reír de ti mismo, yo lo hago por ti. xD It's all about timing. And we’re live! I’m answering YOUR questions now. Join me on Facebook for a live Q&amp;A: http://t.co/v551gQxssO 🎶🎶\"Say what you wanna say and let the words fall out! Honestly, I wanna see you be brave\"!!!! 🎶🎶 Meet me in Australia! Win a VIP trip to @TheVoiceAU season finale and help the @RM_Foundation fight child (cont) http://t.co/yMgJkmFyf5 Mi gente, quiero conocerte en Australia! Gana un viaje VIP a la final de @TheVoiceAustralia y ayuda a (cont) http://t.co/be6UwUW6aA \"You are enough. You are so enough, it is unbelievable how enough you are\" ⚽️⚽️Parabéns ao Brasil pelo 4-1 com CMR⚽️⚽️ 🎉🎉México México México. 🎉🎉Felicidades! #PonteLaVerde con todo y q pararon balón con la mano. @ellyohmusic @CarlosCMajor @jacksonwthomas @SabrinaBatshon SUCH AN AMAZING TEAM!!! So proud of you guys! #TheAwesome4some If you're waiting for a sign, this is it. Pocoyo World Cup 2014: Dance the World Cup Song with Pocoyo! http://t.co/89IRiktOol #vida  😂(Vía @veikkofuhrmann) @JBabaloukas thank you! i'm glad you like my book! I can't wait to go back to Greece May the itch of a thousand crabs affect the one who ruins your day and may their arms be too short to scratch xD @AdailtonAbreu español You are a perishable item. Live  accordingly. 🎉🎉🎉 RT @SonyMusic Faça uma doação para @RM_Foundation e concorra a uma viagem para ver a final do The Voice na Austrália! http://t.co/LNu8kWitoy \"Every time you censor that inner awesome… U stop being real\"  #BeReal Life is uncertain, eat dessert first!!! ¿Pero qué paso corazón? - Nada, no contaba con su encanto. ​Celebrating power in numbers with #operationchange Here's 2nd clue Look closely Stay in the race @operationchange​​ http://t.co/1NsqNJZjbD @AlineKuhn não. Não e verdade. Gana un viaje para conocerme en Australia y estar en la final de @TheVoiceAU Tu aporte ayudará  @RM_Foundation   http://t.co/KJgLvC3M4Z Ponte La Verde  \n\nhttp://t.co/eQ1p8j7acR   http://t.co/NgJbVJxzCr BE YOU (tiful) 24 hours until the opening of the worldcup how does it affect your #vida? @FIFAWorldCup http://t.co/NgJbVJxzCr http://t.co/Ew4giwZtBA RT @RM_Foundation: Win a trip to meet @ricky_martin for the @TheVoiceAU finale! Enter to help us fight for children around the globe! http:… Whenever you're feeling down, remember, you're the sperm that won. (Vía @AlineKuhn) http://t.co/cLC1qGwmnU SAD RT @JuddLegum: Shooting in Oregon is the 74th school shooting since Newtown,which happened less than 18months ago http://t.co/0eXIFO3IAj PEACE everyone! Mucha paz mi gente! http://t.co/uH5S84ZxTN Gana un viaje para conocerme y estar en la final de @TheVoiceAU Tu aporte ayudará a la @RM_Foundation a (cont) http://t.co/KJgLvC3M4Z RT @RickyMartinCN: RT @ricky_martin 在你把传递负面情绪的人从生活中删除的话，你的生活会变得更加轻松。#advise. #VIDA #translation Win a trip 2meet me in Australia 4 @TheVoiceAU finale! Entries help the @RM_Foundation fight 2stop child trafficking! http://t.co/DRiEICMnpR Life becomes easier when you delete the negative people from it. #advise. #VIDA .@RealMiguelCotto felicidades mi hermano. Que orgullo! Pa'lante. #Congratulations #boricuaPride #Boxing PHOTO: http://t.co/GcX803pLbV #Maroc, merci pour votre amour. Thanx for so much luv #Morroco #mawazine2014  #Marruecos PHOTO: http://t.co/VAVYbbbcyc @FestMawazine Ready for @FestMawazine http://t.co/cbUVLIXBLk También quiero felicitar  @OscarDeLaHoya por su induccion al salon de la fama del boxeo, bien merecido! Congrats brother! Paz y fuerza! Felix \"Tito\" Trinidad will b inducted into the International Boxing Hall of Fame this weekend #OrgulloBoricua Que alegría TITO! Pa'lante!👏 Should I shave?  Me afeito o no? Tu dime? PHOTO: http://t.co/ol6nKZW5tL RT @alejodorowsky: Sepárate de la manada: vive con ella sin ser de ella. Marcha con pasos que son tuyos, los de la persona única que eres. Rumbo a #Marruecos para festival musical http://t.co/kdOHJ4GNFU Come on #SexySouls check out this awesome remix of #VIDA from @BrianCrossIbiza http://t.co/bkhRkHwxNo @SuperSong #PuertoRico:Gov @agarciapadilla nominates Maite Oronoz Rodríguez, (a proud member of the #lgbtt community)to Supreme Court #equality #pride RT @ElNuevoDia: Maite Oronoz es nominada al Supremo - http://t.co/IxWxW8n3PC SMILE! You don't have ALL the problems of the world. ¡¡¡ Sonríe, NO tienes todos los problemas del mundo!!! #Vida remix with Brian Cross is now available on itunes!/ Remix de #Vida con Brian Cross está disponible en itunes http://t.co/hzAgAeFAR0 VIDEO #ProudToPlay: Celebrating #equality for all athletes http://t.co/wTeVIOyFM4 Love it! U r awesome RT @JohnnyGWeir: What happens to me when @ricky_martin comes on my playlist shuffle. #wiggleaxel http://t.co/MeQwEfYfAZ RT @veikkofuhrmann: Great Night @lifeball #vienna #vida #austria @ricky_martin http://t.co/dLXvBO2KER Ya estamos en #Madrid!!!!! Contentos! http://t.co/jUes7TH0mp .@lifeball @lifeball @lifeball Aleady in #Austria!!! Ready and honored to b part of such a magnificent  http://t.co/sHv5PQp5E7 \"There is only one way to avoid criticism: Do nothing, Say nothing and Be nothing.\" #quoteoftheday @kintsugi225 aspetta 15 minuti. ritorno adesso sul palco. 🇮🇹🇮🇹🇮🇹🇮🇹Siamo arrivati Italia!!! Sono molto, molto felice. 🇮🇹🇮🇹🇮🇹🇮🇹 Vamos pa #LATVIA MT @RM_Team: Latvia! Get ready 4 @ricky_martin will be performing on July 27 @ the New Wave 2014! Mónaco http://t.co/WUV90y9sCC For those who served and still serve. Thank you.  #neverforget @kylieminogue @JoelMadden @iamwill big hug everyone! @OPTICALIA_ @VanityFairSpain que conste que la vida LOCA también fue muy BUENA!!! Y sería bueno q aclarar q mis hijos no son adoptados ;0) Que alegría! #PuertoRico te celebra @MonicaAce93 por ganar torneo de la #WTA en Estrasburgo.  #PicaPower #OrgulloBoricua Felicidades al Real #halaMadridCopa2014 #RealMadrid #HalaMadridAPorLADecima @nealeese hope to see you soon! Peace! \"Don't let anyone kill your vibe\" Ci vediamo presto Italia RT @THEVOICE_ITALY: Ospiti in studio durante la SEMIFINALE di #TVOI del 28 Maggio &gt;&gt;&gt; @ricky_martin e @Fedez! #Vida http://t.co/CLXkNTfpIn Had so much fun tonight on #kyls on @ProSieben check out my latest single #vida that I performed @valdezIvn  FELICIDADES! Te deseo lo mejor!!! Pa lante con frente en alto. Celebramos!!!! http://t.co/Qs2Tg1TXMk Guten morgen Deutschland. Super happy wieder hier zu sein. #KTLS on @prosieben #vida happy to be back! #germany. #Alemania Think out-of-the-box, ask a child for advice. Just 27 days left for #Brasil2014 let's enjoy #VIDA! http://t.co/NgJbVJxzCr @jpuspain la primera semana de junio. ;0) @PRINCEJORDANRAY thank u. .@Ricky_Martin supports #BringBackOurGirls at Billboard Music Awards 2014 red carpet http://t.co/6iHuoaHlii (vía @RachelLapp) RT @RM_Team: @ricky_martin pics from yesterday  via. JustJared http://t.co/U1P1SmyfeI Heyyyy THANK YOU. I had an amazing time RT @billboard: Huge ovation for Ricky Martin and his dancers! Definitely a highlight of the #BBMAs. RT @billboard: Huge ovation for Ricky Martin and his dancers! Definitely a highlight of the #BBMAs. #VIDA http://t.co/rXxpKtVJug Getting ready #Vida http://t.co/RCNFF0nahs Are you ready to party tonight with #Vida? You can't miss the @officialBBMAs Come on gang, lets RETWEET  THE HELL OUT OF THIS PICTURE. #BringBackOurGirl #STOPCHILDTRAFFICKINGNOW @RM_Foundation  http://t.co/zN52d5WaPP On my way to Las Vegas. Get ready for @OfficialBBMAs everyone. Its going to b insane. Cant wait to b in that stage. #BBMAs #VIDA My day begins! http://t.co/HS27CBaVx3 RT @perfpartnerspr: Alianza entre la Fundación Ricky Martin y la Universidad de Puerto Rico. @ricky_martin @RM_Foundation @helgagarcia http… @luisonOlympus big hug!PEACE!!!! #Caughtoffguard. #NYC http://t.co/T7ngZOrru7 @jano_biebs_ I'm glad you are enjoying it! Peace! New York, New York, I fucking LOVE YOU New York 💙👬👭👫😱🗽 #NowPlaying Nine inch Nails. La distancia entre tus sueños y la realidad se llama disciplina. ''The distance between your dreams and reality is called discipline.'' Please RT. #BringBackOurGirl  http://t.co/LG20FcZ6D5 RT @billboard: Guess what!? @MIleyCyrus &amp; @ricky_martin are performing for the #BBMAs: http://t.co/UYDg2WqR9y #BilboardMusicAwards #BringOurGirlsBack Boko Haram leader threatens to sell abducted schoolgirls  http://t.co/i3o4WNgRwI @RM_Foundation #STOPCHILDTRAFFICKINGNOW RT @qlshow: .@Ricky_Martin is here 2day! He's gotta be our #MCM! ;) We loved that new joint \"Vida\": http://t.co/B45yDlMv6L http://t.co/HkXF… \"Everyone has an annoying friend. If you don’t have one, it’s probably you. xD \" @Pria07priya im a seducer AND A PRODUCER. hehehe xD PHOTO: http://t.co/3mn0etBli9 chill out time. RT @RM_Team: Don't forget to vote for your city for @ricky_martin's next world tour http://t.co/W9ljbKQwe3 do it until May 16th! Hey Gang. Performing #Vida today @theellenshow  tune in! RT @RM_Foundation: In TIME 100 Most Influential People, our founder @ricky_martin wrote about Withelma, a human trafficking survivor http:/… You have to believe that in the end, all the dots are going to connect. Want to see more #VIDA?!?! Watch the @SuperSong behind-the-scenes TV special on @Crackle right now!http://t.co/8qp5vDzWfE. Enjoy! Thank u 4 the love - as always you are amazing mi gente! RT if u r going to watch #DWTS tonight - I'll be performing #Vida getting ready now .@GeraldineF26 many more! #AskRicky @andvidaurridice besos @marcela_1214 pues Ojala q algun Dia nos conozcamos. Saludos a Chile @BrunoTonioli @DancingABC see you tomorrow Mr! Looking forward to those amazing performances. It's going to be an incredible show. Just woke up after..... Me acabo de despertar luego de ......http://t.co/u6pRWUdUjt @GloriaEstefan @keepmemoryalive gracias a ti Gloria! What a beautiful evening! Unforgettable! Cant wait until Monday! Its going to be fun! @DancingABC \"Corrige al sabio y la haras mas sabio, corrige al necio y lo haras tu enemigo\" RT @RM_Foundation: Gracias @LuisAntoniomoda por unirte a nuestra causa y a todos los que apoyaron 'Très Chic' http://t.co/zPTiSsxRfj RT @fifacom_es: #Brasil2014 | Mira el vídeo oficial de 'Vida', canción ganadora de @ElijahKingMusic, interpretado por @ricky_martin: http:/… #Miami We have arrived! LLegamos! http://t.co/6VEcGMvy4B @jasnagora @tv_mauricio @24HorasTVN La grabamos en español inglés y portugués.3 versiones. Es la Copa Mundial la canción tiene Qser mundial RT @1027KIISFM: .@Ricky_Martin’s music video for FIFA World Cup 2014 song ‘Vida’ will make you want to get up &amp; dance right NOW http://t.co… With David @ China Music Awards. #Macau. http://t.co/YtKrd6Bljv #VIDA VIDEO http://t.co/MAGBmISTLu please RETWEET Here you go gang!!! #VIDA ON iTunes http://t.co/9e1pmNc9Xn Enjoy!\nAquí esta #VIDA mi gente! If u pay attention, you move ahead! #VIDA Mi Sunday. http://t.co/9cKRyMJJ8S Freedom to be or nothing http://t.co/njV2J7x5p0 @HombreIngenuo el sencillo sale el martes 22. Aquí una prueba  http://t.co/zwNpvkmkdO @sassarina awesome. I can't wait. Come on gang! I am going on a worldwide TOUR and need your help! Vote 4 your city at http://t.co/9o3Ya5279r …! #RickyMartinAroundTheWorld Venga mi gente, Me voy de GIRA MUNDIAL y necesito tu ayuda! Vota AHORA por tu ciudad http://t.co/9o3Ya5279r …! #RickyMartinAroundTheWorld Top Youtubers y celebs reaccionan al video de #VIDA https://t.co/RZq4aglUha #Argentina que ganas de visitarte! Te echo de menos. Nos vemos pronto. #VIDA http://t.co/I1lJxS4XnJ @Kader_Chikh je t'embrasse très fort mon amie. A la prochaine. !!! Descansa en Paz héroe boricua. Cheo te extrañaremos. Sydney, LA, Hong Kong, Macau, Miami!!!! Here I go! 👉http://t.co/ngctn1NvKa Mucho amor para mi gente en Valparaíso, Chile. Fuerza! Indonesia : Terima kasih Indonesia, suara @Judikajude , penyanyi dari Indonesia is so amazing. Thank you for your support. Much love RT @SonyMusicMY: “Vida” music video premiere is coming! Be prepared! #SuperSong #RickyMartin http://t.co/tWArZkSsOP @abolishslavery we agree @rm_foundation (SEE YOU ON #May31 IN #Vienna ) @Ricky_Martin actuará en gala benéfica contra el Sida http://t.co/ktglmVvd55 @LIFEBALL RT @lifeball: #lifeball 2014 is very pleased to welcome @ricky_martin on May 31, 2014 – for his first live appearance on Austrian soil! (I can't wait 2 go. Send u much luv) MT @marpasionbeso: @ricky_martin Ricky, come 2 #Sofia, #Bulgaria! I wnt 2 meet U so much. I luv U. RT @SonyMusicID: Untuk \"Vida\" the @SuperSong (Asian Version) @ricky_martin akan berkolaborasi dng @Judikajude dan 2 penyanyi Asia lainnya. … GRANDES NOTICIAS! Me voy de GIRA MUNDIAL y necesito tu ayuda! Vota AHORA por tu ciudad en http://t.co/RWyGaQ4KH6! #RickyMartinAroundTheWorld BIG ANNOUNCEMENT! I am going on a worldwide TOUR and need your help! Vote 4 your city at http://t.co/RWyGaQ4KH6! #RickyMartinAroundTheWorld RT @RM_Team: ¡GRANDES NOTICIAS! @ricky_martin se va de GIRA mundial, y quiere tu ayuda. Vota AHORA en http://t.co/HMYkuEWqLB! #RickyMartinA… RT @RM_Team: BIG ANNOUNCEMENT! @ricky_martin is going on TOUR and he needs your help! Vote NOW at http://t.co/HMYkuEWqLB! #RickyMartinAroun… I went to sleep and dreamed that I was sleeping. Then woke up in my dream. And finally woke up real life. 😜 coo coo #UnionCivilYa Perú el amor es amor. Igualdad para todos! Estoy con ustedes. RT @RM_Team: Don't forget to add us on snapchat! / ¡No olviden agregarnos a snapchat! username: rmwebteam I love you, but I love me too! #RepeatWithMe :0) http://t.co/EnEGE4rbUs ADRENALINA RT @SonyMusicID: Dalam waktu dekat @Judikajude akan melakukan project kolaborasi dengan superstar @ricky_martin untuk @SuperSong 's World C… RT @RM_Team: Ricky is confirmed to perform at the China Music Awards on April 23rd in Macau! / ¡@ricky_martin en ChinaMusicAwards! http://t… In studio. Things r flowing. http://t.co/Brrz2pglRa VIDA http://t.co/tsXkEjICEz \"Take a lover who looks at you like maybe you are magic.\" #advice Pre Order here. http://t.co/VXi7GbWydb Si no tuvieras miedo, que harías? ;0) If you weren't afraid, what would you do? ;0) Dancing with the stars!!! Cant wait! Ready to have an amazing time! It is going to be fun. #DWTS 🎶Prisioneros de la luna. Reinventando la locura. Entre gritos y dulzura.... TU Y YO 🎶 We asked 15 homophobic people to hug gay strangers - First Gay Hug Experiment by @GayWomenChannel - http://t.co/a1rGfEejli @RachelLapp RT @RM_Team: Familia, están listos para GRANDES noticias? regístrense en http://t.co/GeDijKaGAK RT @RM_Team: Gang, are you ready for BIG news? sing up on http://t.co/GeDijKaGAK Piden confiscar negocio acusado por tráfico sexual de menores: http://t.co/5b3Vo1fayT que se ... http://t.co/akzolKElDH @idkkidrauhlfore un cariñoso saludo a tu mami. Feliz cumpleaños de mi parte. Besos a Argentina. A mi familia chilena les envió todo mi cariño, mi energía positiva y mucha fuerza. Están en mis pensamientos #PrayforChile #PrayingforChile @perfpartnerspr happy birthday Helga! Eres la mejor mamiiiiiiii!!!! Que lo pases increíble! Te quiero un montón. RT @perfpartnerspr: Ricky Martin pone a vibrar a Arabia con “Adrenalina” http://t.co/E4j6KIbWlI IMAGINE success. HOLD the thought. STAY RIGHT THERE. Mi concierto en #Marruecos - http://t.co/63AVd6qiBw my concert in #Morocco here I come! Come on gang! U can follow me on IG! Mi gente, también me pueden seguir en IG http://t.co/cVfv4lLzwI #SPANGLISH  ADRENALIA https://t.co/e44ct3Sobl MT @FestMawazine: @ricky_martin in concert for the 13th Edition of the #Mawazine Festival,  #Rabat #Morocco  June 6, 2014 #Marruecos My sunset in Beirut, Lebanon. I'm glad to be back! Mi atardecer en Beirut Líbano. Contento de estar ... http://t.co/AIkuFvUhib https://t.co/RGxvTBN2t0  FELICIDADES!! (via @Fher_Ritof) Gracias Fher! Feliz aniversario @Ricky_Martin por muchos años más de paz y felicidad http://t.co/R032CkU9os (via @Spain_RM) #SPANGLISH  ADRENALIA https://t.co/e44ct3Sobl @titaatallah tomorrow night is going to be awesome!Happy 2 work w u! peace! RT @rondenepr: .@ricky_martin to perform on The Voice Arabia: http://t.co/5bGPH0XnUM Mi gente estaré con ustedes en los @LatinBillboards. ¡No se lo pierdan el 24 de Abril por @Telemundo #Billboards2014! *RMWT \"La atracción mental es más fuerte que la física. De una mente no te liberas ni cerrando los ojos\" \"The good thing about science is that it's true whether or not you believe in it.\" @Cadena_Dial @RafaCanoOficial un fuerte abrazo Rafa!!!! Saludos desde Puerto Rico. Love conquers #ALL.     #Fact El amor genera amor. Leo escribo leo escribo.   Read write read write  http://t.co/a3FkKZwQbP RT @RM_Foundation: Actualización de la Construcción del #CentroTau // Construction Update of the #TauCenter http://t.co/O0ze9SQqXM Smile and let the wonder why. #happinessday #FelizDiaDeLaFelicidad Día Internacional de la Felicidad http://t.co/UYmwASDlLc (via  @marthapink) Good morning Américas. Great PM Europe,Asia OZ and NZ! Love and light! RT @PiccoloUniverse: Still don't own your copy of Santiago the Dreamer? Order your copy today! http://t.co/3KT9qvb4FI @PANEPREZ mucho éxito en todo lo que hagas!!! you are #AWESOME! never forget. No me ves? Cierra los ojos, ahí estoy. Pa ti. Você nunca sabe pelo que os outros estão passando...seja gentil. You never know what others are going through.......Be kind. RT @rmelite: Familia! Aquí estamos arrancando este nuevo lunes, con alegría , con entusiasmo, con felicidad y con @ricky_martin! http://t.c… @JuanfraEscudero @JLo saludos a mi gente en España! Mucho cariño Paz! Amor Vincit Omnia With my eyes wide open. http://t.co/rOul9eJWvS I luh Ya @JLo! Your PaPi' Prepare-se para #Vida! http://t.co/nZ52L7Qq0Y http://t.co/6SIjot0pgd #video #Vida #baila #canta #ríe #goza #ipanema #Brazil Carcajadas. \"La mente es como el paracaídas, sólo funciona cuando se abre\" #retrotweet @JHANNAYENNAIV http://t.co/agpWx8f9J2 #RIO  http://t.co/3ZBO9CUFuU \"The two most important days of your life are the day you are born and the day you find out why\" @AmorOrganico @MarielaLizcano http://t.co/agpWx8f9J2 I cant wait!!! RT @TamerTakrouri: Omg @ricky_martin will be in @mbcthevoice it will be awesome RT @ronaldvillardo: NO BLOG: \"Em tempos de Putin, por que @ricky_martin  está mais importante do que nunca\". http://t.co/Mk50Q8RAZI RT @jpus_br: @ricky_martin desembarca no Rio pra gravar clipe da Copa do Mundo http://t.co/ma1HzYYzB5 @folha_com #RMAroundTheWorld #Vida  #… RT @jpuspain: Sorridente, @Ricky_Martin desembarca en Rio procedente de España para grabar el video #supersong \nhttp://t.co/C73gUhVSqQ E galera!!!! Cheguei no #Brazil. Vamos fazer barulho. Muito carinho. @nidiaperezv http://t.co/agpWx8f9J2 HAPPYYYY! RT @RM_Foundation: Actualización de la Construcción del #CentroTau // Construction Update of the #CentroTau http://t.co/NZoyMsIMqb @CarolinaRomer73 @anny_fantinny http://t.co/agpWx8f9J2 @anitamariaAn http://t.co/agpWx8f9J2 @mariamerph no es verdad. If there is someone in this world that deserves to be happy.......that would be you! Si hay alguien en este mundo que merece ser feliz, eres tu. ;0) Massive #Shoutout to @KashaJacqueline. Thank you for ALL you do!!!! @PerezHilton ;0) \"Change your thoughts and you change the world.\" #PositivoYPunto Hey Gang, check out my brother Wisin's Video @Juanlmorera. Cant wait to show you my version of it soon. http://t.co/COtjLCbB8F @TommySchroeter so happy you feel this way Tommy. Peace VIDEO #Adrenalina. \n@Juanlmorera @JLo @ricky_martin  http://t.co/ADxMzboyKe Well I bathed. 👅🙊😂 http://t.co/uMV8Lf4cP5 Imagine what you want and turn into a reality. #YouReallyCan. @kylieminogue @iamwill @JoelMadden ready for great music and great artists. Let the battles begin! Sábado de #Carnaval2014 no #Brasil!!! SAUDADEEEEE #TiraopédoChão ADRENALINA https://t.co/1SykSWTUbc Happy Mardi Gras #Sydney!!! My friend @BuikaMusic Will be performing In #Sydney (#Australia) March 5 @CityRecitalHall. You guys cant miss it. She is amazing!!! Quando você não sabe o que fazer, não faça NADA!!! ;0) #Português \"Cuidado con los miedos. Les encanta robar sueños\" RT @TheVoiceAU: #TheVoiceAu Coach @ricky_martin + @JLo = you have to hear this track!! #Adrenalina  http://t.co/zB8VnoTKFv http://t.co/CaZ6… #TeamRicky @TheVoiceAU. I can and I will! @caterina_torres I loved performing with you in Uruguay and Chile. You are so talented! You are a PRO! Mucho exito en todo! Que triste. Una gran pérdida. Se nos fue un genio de la música. Paco de Lucía descansa en paz. A vida é boa. ☀️ Sube la #Adrenalina  http://t.co/S86OZFoEoC \"...I'm so high on you baby\"  #Adrenalina http://t.co/N8XJmaSnAi Mucha gente te amará por lo que eres, y otros te odiarán por la misma razón. #retrotweet #SeTuMismo \"Llévame al cielo a volar...\" #Adrenalina  http://t.co/S86OZFoEoC \"You like to play me and tease me with your lips\" http://t.co/Su8kGwTLUs \"I'm on the edge I'm falling apart...\"  http://t.co/wDm5IH25ym \"Tu te apoderas de mis sentidos cuando me miras\"  http://t.co/ohwfj3ksl5 Gang #Adrenalina is here!! iTunes http://t.co/ohwfj3ksl5 Google Play http://t.co/wDm5IH25ym Spotify http://t.co/Dg6U8DWq8e RT @Juanlmorera: #adrenalina disponible en iTunes. @juanlmorera @jlo @ricky_martin… http://t.co/U5HRlNNVL5 #Australia, feliz to be back! Gracias mi gente por los mensajes luego de la presentación en Viña del Mar. Como siempre, el publico de La Quinta Vergara #adictivo! #Chile Hola soy Ricky Martin, nos vemos en Viña  por A&amp;E @canalaetv Contento de estar de vuelta en Viña del Mar! Gracias #Chile por el recibimiento. Listos pa' la fiesta? #QuintaVergara. RT @veikkofuhrmann: Check out this site http://t.co/I1tQBfeYo0 #rickyenviña via @ricky_martin Mi atardecer. My sunset. #PuntadelEste. #NoFilter http://t.co/by2Ig0rjLY @PedroJulio hermano, me acabo de enterar q estas hospitalizado. Te mando toda la fuerza y el AMOR del cosmos. Nos vemos pronto guerrero! @pabloalboran Pablo que gustazo y que bella musica tio. Loco por que el mundo la escuche! Saludos desde Uruguay! #India @jpuspain como me he reído. Muchos besos! RT @PiccoloUniverse: Solo en Piccolo, @ricky_martin nos cuenta qué es lo más importante, difícil y gratificante de la crianza de sus nenes … Con mucho trabajo pero mucha fuerza. Enfocao en mi meta y llegare. Q viva la MUSICA,q viva el AMOR y la PAZ. Vienen unos años increíbles. A big hug to my buddy @jimmyfallon and everyone @FallonTonight. Success, success and more success!!! Peace! ✌️ Mucha paz y mucho amor para todos mis hermanos y hermanas venezolan@s. #PrayforVenezuela #Venezuela Very beautiful Ellen Page!!! IM very happy for you!!! You are free! http://t.co/F3upFobC7g  ... http://t.co/uHep8tPTmO Family,enjoy this Valentine's playlist. Where words fail, music speaks Familia disfruten este playlist de SanValentin http://t.co/gTyeEmVLIo Hey hey hey, Happy Valentines sexy souls! I love you all.  A ti, si a ti Feliz Dia de San Valentin!!!!! Paz y amor! @ video shoot http://t.co/8N0UTS1wJr In studio for VIDA. http://t.co/14uf6TIZRK PHOTO: http://t.co/ppSA4BE6fq #PHOTO ADRENALINA http://t.co/hYGZMErXg2 #Adrenalina Video Shoot http://t.co/7jCDqeLrEo Hola mi gente! El momento más esperado de #SuperSong: Visita http://supersong y conoce al ganador! http://t.co/USvg8FvKJY E aí galera! O momento mais esperado do #SuperSong: Acesse http://t.co/WVjx8dBu4J e conheça o vencedor! http://t.co/x0fXpbB6oB Hey guys! The most anticipated moment of #SuperSong: Visit http://t.co/WVjx8dBu4J and meet the winner! http://t.co/nHhULEBTJ6 RT @fifacom_fr: Bonne chance aux finalistes du #SuperSong 2014. Le vainqueur sera annoncé par @ricky_martin plus tard dans la journée http:… RT @FIFAcom: Good luck to all finalists of #SuperSong 2014. Winner to be announced by @ricky_martin later today! http://t.co/upmTfXtRJZ Video Shoot #Adrenalina. http://t.co/XRIT7CMZLY Russia. http://t.co/nfOX0JudlT Video: http://t.co/1jpghnWv29 De lo que te cuenten, no creas nada y de lo que veas, cree la mitad. ;0) The secret of change is to focus your energy not on fighting the old, but building the new ~ Socrates Acepta lo q no puedas cambiar. :0) RT @UniNoticias: .@Ricky_Martin lanzó el #AuatralianTourApp para compartir conciertos de su gira en Australia http://t.co/eMLJRAkXgX #AuatralianTourApp Here you go gang. Enjoy my my New app. Aquí el app con el concierto de lo gira ... http://t.co/2w8xAPFcBE RT @peopleenespanol: .@ricky_martin, en un smartphone más cerca de sus fans que nunca. Detalles --&gt; http://t.co/2tCIfHaPDM http://t.co/YuyL… RT @SonyMusicItaly: .@ricky_martin ha lanciato con 3D-4U l'app “RICKY MARTIN CONCERT–4U”, per assistere virtualmente ai suoi concerti: http… #instudio. http://t.co/aLZkCx56ez Hey everyone! Few days left to discover who is the winner of #SuperSong! Are you ready? http://t.co/CKhLJtOeDy Hola amigos! Dentro de pocos días el ganador de #SuperSong será anunciado! Listos? http://t.co/bF6iSQydeY E ai pessoal! Últimos dias de espera para conhecer o grande vencedor do #SuperSong! Estão prontos?  http://t.co/TAxI6IJtz6 Hola mi gente! Pasando por aquí a saludar. Abrazos!!!! Whats up gang? Passing by to say hi! Familia, Cuál es el mejor show del entre tiempo del superbowl para ti? Aquí hay algunos http://t.co/ufK8Yxa9nj Gang! Which is the best superbowl halftime show for you? Here are some http://t.co/ufK8Yxa9nj Muy triste por la noticia. Muy triste. Luis Raúl, vuela alto hermano. Q.e.p.d. @LuisRaulParao No se me conoce por cobarde. Suuuuuuuuuuuper chill!!! http://t.co/aWQQrtHeXt Mi gente, mira el vídeo y descubre a los finalistas de #SuperSong! Yo grabaré la canción ganadora! http://t.co/4ChaXmCTCR E ai galera! Assista ao vídeo e conheça os finalistas do #SuperSong! Eu vou gravar a música ganhadora! http://t.co/xHtrxaQhzj Hello everyone! Watch the video and meet the finalists of #SuperSong! The winning song will be recorded by me http://t.co/EXtDywDVdt Mi gente! Entra a http://t.co/QKZA3RUjwM y conoce a los finalistas de #SuperSong! ¿Cuál canción quieres que yo grabe? http://t.co/4ChaXmCTCR Hey gang! Visit http://t.co/QKZA3RUjwM and meet the finalists of #SuperSong! Which song do you think I should record? http://t.co/EXtDywDVdt E ai galera! Visite http://t.co/QKZA3RUjwM e conheça os finalistas do #SuperSong! Qual música você quer que eu grave? http://t.co/xHtrxaQhzj My friend, it's all about learning, it's all about growing. Don't stop. #advice. @htv_hot yo lo que cantó @SuperSong de @FIFAcom \"Ni siquiera siete mil años de alegría pueden justificar siete días de represión\"  Hafez RT @Juanlmorera: El 17 de febrero sale el tema que revolucionara la musica latina \"Adrenalina\" Wisin feat @ricky_martin &amp; @JLo http://t.co/… In heaven! http://t.co/78dFCnQuXV RT @ABFRM: @Ricky_Martin, Pitbull, JLo e Claudia Leitte darão o ritmo à Copa do Mundo | http://t.co/qnM7bfAlYF http://t.co/Ce7kk4vW4Y .@kylieminogue you are beautiful. Love and light! http://t.co/X8z33Wrrlp Une vie ne suffit pas. Es increíble como la felicidad de unos puede incomodar tanto a otros. Photo shoot with my brother @JoelMadden for The Australian Women's Weekly Magazine.  http://t.co/nYrqE72bln \"Well, I like to eat, sleep, drink, and be in love. I like to work, read, learn, and understand life.\" #Simple \n#quote La vida es demasiado corta para hacer otra cosa que no sea ser feliz. Como cuando casi te mueres de la risa? Pues así. xD Well, I think I deserve something fantastic. And so do you. ;0) Muita saudade do #Brasil. Muita para caramba. @jayveehernandez wow that is really scary. Good thing I don't follow the laws of your book buddy. My God loves me as I am. Right now! Ahora mismo http://t.co/aFF1hWQrgL Buenos días. Sígueme en instagram. Follow me on 👉http://t.co/a99vgIDzxJ👈 @kylieminogue @JoelMadden @iamwill gang, I love working with you ALL. ~One small positive thought in the morning will change your day~ INK http://t.co/a99vgIDzxJ RT @RM_Team: ¡@ricky_martin presenta aplicación #RickyMartinConcert4U es una nueva forma de vivir sus conciertos! http://t.co/LKwEWEsPPe @M… MT @tallfriend2909: Ricky Martin Australian Concert-4U on the App Store on iTunes http://t.co/YLFdpAGuhY Aquí mi app donde podrás ver y manipular mi más reciente gira de conciertos en Australia.  http://t.co/air4rEQ0iw Finally I'm able to share my Concert App with you. My Show at your fingertips. Enjoy!! http://t.co/air4rEQ0iw Ya has votado por la canción que yo grabaré para el Mundial 2014? Mira el video para saber cómo votar.        http://t.co/3lxZwFFMh1 Have you already voted for the song that I will record for the @FifaWorldCup? See how easy it is to vote:http://t.co/0ojqhcikDK Já votou na musica que será gravada por mim para a #Copa2014? Assista ao vídeo e saiba como votar:        http://t.co/c9MxxigObc Ready to hear some great singing! Blind auditions for @TheVoiceAU   start today! Listo para escuchar grandes voces.Audiciones comienzan hoy! Corriendo cámaras!!!!  Rolling cameras!!! http://t.co/tFXelMvr7g Home away from home! Contento de ester de vuelta en Sydney! VIDEO:http://t.co/NlcLfaCQ9I Una tarde perfecta. A perfect PM! http://t.co/CUzZ5QSuxy \"Don't let people tell you who you are. You tell them.\" @dracorosa no fear, only love! abrazo hermano! VIDEO; http://t.co/46cKfZp3RD Voting open for @SuperSong! Meet the semifinalists and vote at http://t.co/WVjx8dBu4J! #VoteSuperSong http://t.co/xHlrYAYAVv Votación abierta para @SuperSong! Conozca a los semifinalistas y vota en http://t.co/WVjx8dBu4J! #VoteSuperSong @AriadnaDuque they've always bn my priority. and always will. ~Weird is a side-effect of awesome~ Passing by to say what's up!?!? Pasando a saludar! Q todos esten bien! @ LAX http://t.co/Ni2w9xG4T5 M.A.S Tour PHOTO: http://t.co/Lp9bgxIqDJ In-flight wifi! 👍✈️💺http://t.co/4rn0b35qPd http://t.co/2b2n5NNYHB Ya viene el mundial! :0) I'm wide-awake. Últimos dias para enviar sua música para o #SuperSong! Inspire-se com a paixão dos brasileiros: http://t.co/B332Hwn4j9 Últimos dias para participar en #SuperSong! Inscripciones hasta el 6/1. Inspírate por la pasión brasilera: http://t.co/XiEfxyNc4o Few days left to submit for #SuperSong! Submissions will be open until Jan 6th. Get inspired by brazilians passions:http://t.co/DRtjFOoICr It's COLD in #Nyc. Apparently it won't get any better. I Luv the city covered in snow though.Frio en #Nyc y aparentemente lo q viene es peor RT @SuperSong: Foto exclusiva de Ricky Martin a #SuperSong! Inscripciones hasta el 6/1. Si ganas, tu viajarás para conocerlo! http://t.co/D… RT @SuperSong: Exclusive photo of @ricky_martin for #SuperSong! Submissions will be open until Jan 6th! Win and meet him ;) http://t.co/Lw9… RT @RM_Team: Follow @ricky_martin on Instagram-&gt; http://t.co/VLbneS2wTd and like him on his official Facebook page-&gt;  https://t.co/340cIXE9… eat well, train hard, live passionately, sleep well, Repeat! #PUERTORICO Hoy en El Yunque. Today at El Yunque Rainforest. http://t.co/3SNh5ddCQj RT @Spain_RM: Esta noche desde las 12:15am especial de Navidad en TVE con @ricky_martin #wepaaaa a empezar genial el… http://t.co/fBGFSwniF5 When was the last time you had a first time? Cuando fue la última vez que hiciste algo por primera vez? --Si lo que estas esperando es \"estar listo\", ten cuidado que puedes estar esperando toda la vida.-- #HazloSinMiedo So, you are waiting to be ready??? Watch out, you can be waiting all your life. #GODoit ;0) RT @Spain_RM: ......y tu recuerdo sigue aquí @ricky_martin http://t.co/aEq8yZeJte @ #Cancún. Listo para el show. Ready for the show??? 🎤🎶🎶 Changes oh changes. Rt @PiccoloUniverse    3 Ways I Recharge To Be A Better Dad http://t.co/XyeQJOWOpV ... http://t.co/368ne4kzLu Beautiful morning walk! Caminata matutina! Hermosa! #Thankful. PHOTO: http://t.co/69A1iBLgRO No porque el consejo venga de alguien que te ama, quiere decir que sea el correcto. Just because the lesson comes from someone you love, does not mean it is correct Momento de renacer. Its ALL about rebirth. mi gente,estoy muy agradecido por todo su cariño recibido hoy! 1 día lindo/diferente. Thanx so much 4 all the love! I had an amazing Bday Miss u ALL.See Usoon! RT @Girl_2B Happy bday Ricky frm us @ Girl2B!Thanx 4 being a source of inspiration 2all of us http://t.co/pc6alzhVjn 🎶🎶Happy birthday to me!!!!! Feliz Cumpleaños a mi! 🎶🎶 #HappyBirthdayKiki http://t.co/fsQchDWvJS Mi primer vela este año. My first birthday candle this year! #HappyBirthdayKiki Dec/24. Time? Well it's all about what you do with it. \"Bésame cada noche y suéñame en la luna\" Look look http://t.co/pLlj2qQrmE #ThrowbackThursday Clausura Juegos Panamericanos Guadalajara:  VIDEO http://t.co/v1jhiRhQgR \"The essential is invisible to the eye\" Algumas dicas para vc criar sua #SuperSong: http://t.co/Gq6USyizkt Vou gravar a música vencedora e vou conhecer o ganhador! Pode ser VOCÊ! Some tips for you to create your #SuperSong: http://t.co/1oaVSS5pbg I'll record the winning song and also will meet the winner! Submit now! RT @RM_Foundation: @EdnitaNazario, Guerrera de Luz y Solidaria con la causa, nos visitó en el Pabellón 2013. NO MÁS TRATA @ricky_martin htt… @davidbisbal Hermano, ahi esta! Espero q les haya gustado! Que tengan una feliz navidad. Mucha fuerza y pa'lante! Si todas las cosas de la vida fueran fáciles, cualquiera las haría. Lo importante es saber que lo mejor de la vida no son \"cosas\". Airport airport airport. http://t.co/chq8nM9P8F Its 10:10. Make a wish! De lo que te digan, no creas nada. Y de lo que veas, cree la mitad."}