{"tweets": "When you’re 25% Mexican https://t.co/5qVgVpPAre RT &amp; SHARE; Help SPREAD Awareness &amp; Raise money for people that are in a battle with Addiction &amp; Can’t afford Treatment @RecoveryCycle https://t.co/UliUKtdSMK RT @_SJPeace_: China has placed 1.5 Million Muslims in concentration camps. Separating children from their parents, subjecting them to tort… Quick shoot Sunday’s https://t.co/A1azDilSUC RT @DDLECOURS: A killer first live performance from someone that is changing the world with his story and inspiration one day at a time...… First Live Video - Running from the Rain \nhttps://t.co/N10AxOsxqf Ask me anything about Addiction, or Rehab, or Recovery! #AskCam https://t.co/5sQ2qO8HgZ new song coming soon #helpless https://t.co/MsvBtIJRDJ 🎭 https://t.co/syf0AsM3ca ate a burger in bed instead of going to the club Kid super https://t.co/jWpfOBqr1m Here’s what I’ve been wanting to tell everyone - https://t.co/Sk1uCxeb0B RT @CatherinePaiz: IMPORTANT. Breaks my heart that i didn’t know until today.... the media has done a terrible job at covering this. https:… I got something super important to share tomorrow Bite the bullet https://t.co/3xkMlbxHdl Hello ✌🏽 https://t.co/7tfGpUTYcz I’ve been so much happier lately 📸 : @philshaw https://t.co/ynQ2AmhuXf #BottleCapChallange Fails 😩 https://t.co/Q2y6oNy6uB earthquake #BottleCapChallenge 😩 https://t.co/ad36nklyJF Cliff Jumping Gone Wrong https://t.co/UAOUKR8GWY 🃏 https://t.co/sWlCGBTCwY @andreww_ferrer smh don’t say that I haven’t seen the last 2 🤦🏽‍♂️ @Worth_The_CHASE Sxy mf I’m an inmate of the prison in my mind 😍 https://t.co/U6TPTZpx0x but i’ll be home, until then it’s adios Momma ❤️@TheGinaBina77 https://t.co/jfuWIjOYpf I’m spoiling her FOREVER https://t.co/4PmGfhhy5O Happy Mother’s Days/ Birthdays to @TheGinaBina77 @SierraDallas and Capri ☺️☺️ cut it off before my mom started crying 😂 love you all!!! https://t.co/KtRcNzDUSj everything’s going to start looking up for me, all I had to start doing was taking care of/ worrying about myself Do dogs think it’s disrespectful to pet them with your feet? @vansellia13 Appreciate it (: @HUmlaufova @SierraDallas @carbon350 I knowww!!! Thank you!!! @alwayysmagconn Ty (: ☺️❤️ https://t.co/KIVgNsMHvW IM AN UNCLE https://t.co/yOEsFxiv8n I just met baby Capri ❤️ HIIII EVERYONE! Excited to say my sister @sierradallas’s water broke last night and just got her epidural, she should be having little Capri, @allthingscapri VERY soon☺️ CANT WAIT TO MEET HER! Stay tuned 🎊☺️ @brentmallozzi lets gooooooo!!! https://t.co/jjLETTpjdi Bout to be a great night at the @BBMAs with @nbc  🙏 !! Today’s gonna be sick Thank u KISS ! https://t.co/zoS9HMKM3S RT @Mix1065FM: BACKSTAGE EXCLUSIVE: @thegreatkhalid, @iambeckyg, @camerondallas and MORE predict who will take home the most awards tonight… Khalid is gonna win all of them https://t.co/My3uxhERf7 ROCHESTER 🔥 https://t.co/Uh0Rb8mjlF Today’s gonna be sickkkk https://t.co/IORH9p6P2H Ayyyy!!! https://t.co/QNSptQ1m7X LETS HOPE IM RIGHT https://t.co/5BXxrYjfIN Appreciate u ! https://t.co/DdXO5yLfYO Thanks for having me (: https://t.co/U3YI5rPRuR RT @b97: BACKSTAGE EXCLUSIVE: @thegreatkhalid, @iambeckyg, @camerondallas and MORE predict who will take home the most awards tonight at th… Y’all are awesome !!! https://t.co/3gZsJ8Xj7P RT @MensHealthMag: \"If I eat this, I would be a legend.\" \n\n- @camerondallas preparing to chow down on a giant waterbug for the #Disgustingl… Watch me eat Disgustingly Healthy Foods w/ @MensHealthMag \nhttps://t.co/9gdatwrGlp finally got some sleep RT @KTmLayton: Please say a prayer for the love of life. @Tylercolemann he was involved in a very serious car accident. He is stable, and h… RT @amyythevegan: Imagine having this much of an impact on the planet, incredible 💛 https://t.co/y6vF1a2xWP if u go to the club n u don’t dance ur whack New music \nhttps://t.co/MTc41z5znN RT @Chrissgeovanni: ‼️‼️‼️ LOST DOG‼️‼️‼️‼️\nLost my dog taco. He was last seen by Van Nuys middle school in Sherman oaks. \nPleaseeeee RETWE… I find out the date for secrets today 🤘🏽 Praying for people that went to both Coachella’s &amp; now stagecoach this weekend trying to get this music out 🥴 💋 https://t.co/sipJsR2bzc @taylorcaniff Next time don’t try to kiss my underage brother ontas? RT @MatthewEspinosa: Ontas? Wo ahhh 😍 https://t.co/lTiiBujBL4 I basically got 2 albums done 😂🤣😭 US was gooooooood RT @rizzzy__: I don’t care if this wasn’t my granny, I would still slumped him before he got off that train... y’all pussy for letting him… US tonight is about to be fireeeeee RT @SierraDallas: I used only @DollarTree makeup for a full face and this is how it came out! \n\nRT if you love!! \n\nWatch the video here: ht… Decisions decisions... ep &amp; album... #triangledance Illuminati confirmed https://t.co/aydmkpApii #HelicopterChallenge 😭 https://t.co/SG8ueRBDwj Yo 😂🤣 #HelicopterChallenge https://t.co/RkYbDUazNq RT @WAVYYERICA: matching was unnecessary but cleaning up the beach wasn’t, it’s v necessary!! glad I got to spend such a beautiful day doin… #TrashChallenge #TrashTag https://t.co/OWiCdeM5WP always forget to breathe being in love doesn’t go away 4 me the butterfly’s are out, so sick RT @zianafazura: #TrashChallenge 👍 https://t.co/ViIvc55Bqh just woke up hysterically laughing 🤣 LETS CLEAN UP THE WORLD!! Love this, it’s called the #TrashChallenge and you take a before / after photo of cleaning up areas in the world big &amp; small https://t.co/9DPpS3mu90 I’d rather still be able to see you in my dreams even if they’re nightmares casual day https://t.co/eUXvpVctC8 take the pain from u https://t.co/eQ9x4HfZKK how do u expect me to love u if I can’t love myself Hii https://t.co/D0ASOznezi @andreww_ferrer We already got a bunch of cheese in the refrigerator? BLUEFACE BABYYY, YEAHH AIGHTT https://t.co/6ICdLIekel Secrets coming soon https://t.co/1zYEmxoMjK RT @SierraDallas: SURPRISE!! IT’S A BOY! 🙀 \n\nVIDEO HERE: https://t.co/ee8paGZJJ3 https://t.co/m6QC6UIJU2 I pray for you be there for me once self-destructive tendency’s Just recorded some fire 🔥 @Dzekomusic @3manfranco I feel good @Tylercolemann Always prove it goodnight RT @SierraDallas: Baby girl is 3lbs 😻 she likes to take photos smiling &amp; posing with her tongue out like mommy! \n\nRT if I should post the v… Bring back the steak sandwich @BWWings smh 🤦🏽‍♂️ Baby toys are so expensive tf Feeling my niece kick in my sister @sierradallas’s stomach for the first time w/ my brother in law @brentmallozzi filming 😊💕 what an amazing thing, she is in her final trimester of her pregnancy and we should be expecting middle of May 😇 https://t.co/sFQ4RFBGsX cardi bodied thotianna wow you push me away every time I try to love you Why haven’t I met you https://t.co/NfZiUPL5W4 happy, sleep all day, day worry about it I wish I had a brother @CameronRomania plssss and post it @fanboy_dallas a million reply’s and I’ll drop it fuck my songs are so good iwish ihated u *chris miles is the best artist in the world Chris Miles is the best writer in the world i hope it doesn’t last a lifetime what am I depressed about ? u should call my phone @MatthewEspinosa That would b crazy haha Stream ‘why haven’t I met you’ today ! RT @phocks: I can't believe it's 2019 and some people still don't know how the dairy industry works\n\nAnyway here it is explained in 5 minut… pulp fiction or catch me if you can Yo @AppleMusic my lyrics are ‘but then my bed grows colder like my empty shoulder’ not, ‘but then my back grows colder’ can u change it please 🙏🏽🙏🏽 RT @KaitlynRankin2: @camerondallas https://t.co/m5L4OcNaG5 would u? https://t.co/3QcXEORdlp nfl really trying to meme itself for views 2019 https://t.co/rnO9Ix4fWh @MatthewEspinosa @marshmellomusic @FortniteGame Hahahaha nothin wrong w being friends.... tomorrow, b ready @DamonBaker https://t.co/nYDD3BS6oa everyone asks what’s wrong because my hearts broken but I never tell them @AndreaRussett i’ll take it all comin soon @DamonBaker https://t.co/eootrxJpRt Shooting w @DamonBaker rn RT FOR GOOD LUCK https://t.co/0aLqLV0AP4 God knows my heart teach me how to love i’ll take the pain from u swear I lose everything she’s already gone this next song is gonna rock 1 MILLION MONTHLY LISTENERS https://t.co/2fQsqTCyHb I don’t want anything touching my heart I miss myself \nI miss what I used to be RT @JackAndJack: Our debut album, #AGFIN is OUT NOW! https://t.co/4n3aOjE35N https://t.co/IYpDBQWpcv I’m not too sure what love is Let’s go !!!!!! Proud of y’all https://t.co/i8qZW7bcib I want you to be happier RT @HouseofHerrera: The EXTRA touch to  every party: @CameronDallas #212CarolinaHerrera https://t.co/ImOr9Llkw9 why haven’t I met you? your friend was right about me idont like u but I’ll b here4 u in the nighttime My new song \"Why Haven’t I Met You?\" Is on the  @beats1 Chart with @BrookeReese 11pm LA | 7am LDN tune in here !!! https://t.co/v2jLFa2DgB all i can do is keep being myself 103k streams yesterday on @Spotify 😊😊😊 y’all rock !! Let people know about the song !!!! Ya baby!!!! https://t.co/bdEKUX2ZgS Sublime is the best album in history pull over there’s a reason why my souls unsound I’m getting 100k plays on whimy tomorrow I knowwww it people r fake RT @fanboy_dallas: Don't forget to Stream Why haven't I met you on Spotify today! If we all stream at least 5x we can break 100k easy! LETS… seeing you in my dreams affects me the same way &amp;now she’s starring back at me, I prolly said the right thing i know you’d shed a couple tears if my heart ever stop Almost at a million monthly listeners people !!!!! https://t.co/zDRhslwBVf she says she fine but I thinks she’s lying but i’ll tell you i’m feeling fine baby, i can’t help that i’m selfish RT @fanboy_dallas: Stream #WHIMY on Spotify or you'll receive 12 years of bad luck and shit your pants in front of your crush. You heard it… @MatthewEspinosa Is that a new spot ?!? I second this https://t.co/hU95ZtqsVK Almost at 100k streams in a day people !!!! 😍 have you streamed it today ?? https://t.co/pEMo1lcK9V wowtheworldisntreadyforemannuel wowtheworldisntreadyforchrismiles it’s so hard for me to let new people in Sleepy boy https://t.co/uxD1f4fzHP stay the night U crazyyyy RT @Kingdaddydallas: When your friends are spilling tea and you just there for it @camerondallas 😂☕️ https://t.co/CSMJuwO7jV @MatthewEspinosa Wait did u bake a pizza ? Haha @Nashgrier Lmao the last one got me weak RT @fanboy_dallas: Why haven't I met you is nearly getting 100k plays a day!!!! My boy is killing it big time!! So happy and proud of you C… RT for good luck https://t.co/mJMpB41oq9 👋🏽 from us https://t.co/iUYhOLXeEl sad day today :( Secrets 🔪🤫🔜 https://t.co/kxlt4ARoIW Ayyy 🔥🔥🔥 appreciate you Matt ❤️❤️❤️ u da best https://t.co/d9N7fYbTF8 Just Posted my next song “Secrets” on Instagram, go check it out ! https://t.co/OuDqLVOZeH ordered taco bell @Chrissgeovanni @Tylercolemann @andreww_ferrer @AndrewBarbosa_ @Worth_The_CHASE Hahaha Im watching this 4 sureeee haha https://t.co/FEnn623WJ3 u probably think im heartless fuckkkkkkkk bandits mad I’m staying in bed all day RT @HunterRowland: this month... meet River. (Trailer link in bio!) https://t.co/jT94ZqllvO @SierraDallas I woke up at 4 @SierraDallas I’ll Postmates u some should’ve went to Mexico instead 🤦🏽‍♂️ u just wanna 🖕🏽 me over u don’t wanna love me GET ME HOME kiss me then scaredy cat Craziessssssssss ur dangerous but it’s hard to stay away Why haven’t I met you got 88k plays yesterday 🤪😝😛 RT @RoronoaMoJo: Nobody:\n\nWhite people: https://t.co/8eCpYgrNlk good morning Unfortunately sometimes in life you find yourself in a situation where you have to protect yourself and the people you care about, have a safe and happy new year, 2019 is going to be an amazing one. https://t.co/VlYur8qyPU be safe tonight, have fun, and be ready for your 2019 goals Unbreak my heart RT @IMGmodels: #CameronDallas (@camerondallas) covers the latest #HarpersBazaarMen #China. https://t.co/6Ewn3yfGE6 RT @lucyvallin1008: @camerondallas your song was playing in the outlets🌝 https://t.co/1enDIHhrEz @Ninja @FortniteGame This is crazy, congrats !!!!!!! 11 kill k/d is insane people actually give the worst advice can barley listen to music that’s not me Chris or eman Meryy Christmas 🎄 MERRY CHRISTMAS YA FILTHY ANIMALS https://t.co/W7t3UHnZsi I can feel the happiness RT @thekianakay: My grandma’s breast cancer has came back, and this time it has spread to her lungs. My only holiday wish is for everyone t… still in bed IM GOING TO BE AN UNCLE AND ITS MY NIECE 😊😝❤️ https://t.co/C8WrLC0rYd NO NO NO NO glad to be back home last minute chrismtas shopping atm @jacobsartorius 🖤 @JackJ Crazy right ?! @Worth_The_CHASE Hahahaha Is my sister gaveling a boy or girl ?! 🙄 https://t.co/Yn6BzBd5w6 @Worth_The_CHASE Lolll ur laugh at the end, go offffff y am i up HELL YAA 🔥 https://t.co/L84F7VrLAa gnighttt RT @MarkNadyuk: I’m home alone, and jammin out to some music!!! Song is “why haven’t I met you”  by. @camerondallas https://t.co/ovAGNzmusv @Chrissgeovanni @Tylercolemann @andreww_ferrer Na freak all u!!!! ugly Christmas sweater party tomorrow @andreww_ferrer who’s winning ?? @andreww_ferrer 🤮 @jacobsartorius I’m thinkin some Asian food someone come cook 4 me RT @caelinoel: RETWEET FOR THE PEOPLE WHO DON’T THINK OCEAN POLLUTION IS A PROBLEM https://t.co/te40JxSb1A whateverr @SierraDallas being pregnant with twins is hard 🤷🏽‍♂️ 😴 https://t.co/OO7aau76Qf got uuuuuuu https://t.co/Ox2W3xaJ2C it’s so much easier when you don’t care @andreww_ferrer tf up Ferrer !!! how do u expect me to love you if I can’t love myself I wish you could be scared with me home is where my heart issssss me chris n eman about to b on charts want 2 hear my secrets all these memories end up in graves sometimes it’s better to not answer my momma hits the big 50 Friday 🖤 ur my friend when i’m in need What’s that? Faxxxx there’s something special about writing letters to people, it’s my favorite + add it to your playlist + https://t.co/ByzQ8BCNRZ secrets @ChueyMartinez @1027KIISFM Hellll yaaaaa @yasmildy My mind to me today 😬 @ughmaddie @WAVYYERICA 5450 Guardian Way, Chino, CA 91710 @WAVYYERICA Come cook 4 me YESSSSSS IM GONNA BE AN UNCLE! https://t.co/nHrVugxwbF pizza otw @Beckylynnwynn Was just watching that 2 days ago be positive be positive be positive sad hearing about the climate change decision CHRISTMAS Drake x Bruno Mars make it happen you can’t force people to change \nyou can’t force people to share rolling through the city like a young cam brick’d up help RT @SierraDallas: I’M PREGNANT!!!! \n\n💕💙💕: https://t.co/6fGN7RIywt \n\nBOY OR GIRL? #babysierraorbrent https://t.co/hBnetV1Wzt u deserve to be happy :( @AaronCarpenter 😍😍😍😍😍 it’s a good day 😊 that would be so crazy to hear ‘why haven’t i met you’ on the radio next year 🙄 LETS GOOOOOO!!! Thank you to everyone that’s streaming it and to the fans 🖤😊 https://t.co/4bd6HfEwTK 💄💀🔪 https://t.co/GO3WFu0O5N please, just don’t lie to yourself wish u could be scared with me if i don’t love anything i can’t get hurt #WHIMY was placed on the Today’s Hits playlist! Thank you @AppleMusic + @arjanwrites! I appreciate it! Tweet me your thoughts on the playlist! 🙏🏻\nhttps://t.co/njDEaTadyy https://t.co/xgUrMI8gul RT @Spotify: Join @camerondallas on the Teen Party playlist for great music, backflips and a dog called Bandit 🐶 https://t.co/52PSjCScKW ht… DM me if you get some merch ❤️🕷 \nhttps://t.co/Iuxkf36NbM https://t.co/lbNkPdRXFb RT @Beats1: .@arjanwrites has a Bop of the Week from @camerondallas! Tap in to #AListPop Live for \"Why Haven’t I Met You?\" https://t.co/3sJ… https://t.co/Zwnn61HDbQ https://t.co/N0pGqKziyy It’s nice to be important but important to be nice Just wanted to say I love you guys. Who's up? Thank you to my guys @ChadwickMak and @maxangles1 for making such dope merch 🙏\n\nhttps://t.co/ccW86qyvxw https://t.co/hKDmHihFaJ @laurdevils Should be! @Saki_Mahone .thats what i'm saying One of my favorites so far, my dudes killed it on the designs 🙌\n\nhttps://t.co/ccW86qyvxw https://t.co/la0tY8Kvxd @toxcdallas I'm rolling with both 🤷‍♂️ @smilexseb .you'll see! 😈 @idolxns_ Yup!! .Which one is your favorite so far? Which one did you pick up from the drop? 1, 2, 3 or all?\nhttps://t.co/ccW86qyvxw https://t.co/07YisvYcv5 Whats up?! 🙋‍♂️ https://t.co/1AbxDM009Y @camxvibez Thanks boo 🖤 I hope u guys like it! @mapscameron Ur gonna kill ittt in this hoodie 🔥 “Why Haven’t I Met You?” merch now available at https://t.co/orERVxDlb8! https://t.co/nnJewIIYvT hi. 👋🏽 Halloween time 🧛🏽‍♀️ Thank you @arjanwrites! #WHIMY is #BopOfTheWeek on @Beats1. 🙏 https://t.co/6r9Jc6m0SD #AListPop Cats or Dogs? 🐱🐶 / What’s your pets name ? 🐥 https://t.co/oe73hKDpW6 😳🕷 @amazonmusic \nhttps://t.co/ce1I7y4WAP https://t.co/EDHCiGMybK @ArathCopca This is sick!! Thank you 🙏🏻 Some of my favorite songs 🕷\nhttps://t.co/0bsQjxzR0P https://t.co/Y3Iy3G7vv6 🚭 https://t.co/TZvpkPV3mS @AppleMusic 🙌 RT @AppleMusic: Introducing @camerondallas' latest, #WhyHaventIMetYou.\nhttps://t.co/YYBK766zuC Leave you twitter names in your comments 🕷https://t.co/wMN1T7ij24 Im going through comments on the video if you guys want to hang on there with me @lightsonshaawn 🖤🇲🇽 LETS GOOOOOO #WHIMY @loxstyIinson It’s one of the first songs I wrote 🙄🖤 so thank you 😊 #WHIMY @_ariannestyles Thank u for tweeting it gorgeous 🖤 #whimy @m_merandaaa Thx so much 🖤🖤 we worked so hard on it #whimy @mendesintoodeep Ahhh thanks for tweeting my video boo 🖤 I appreciate u so much 🖤 #whimy @loxespinosw i see u 🙄😊 #whimy @MonkeyMcVey22 🖤🕷 thank you beautiful #WHIMY @magconzneagle ahhh thank u so much 🖤 it means a lot !! #whimy RT @billboard: .@camerondallas daydreams in tropical video for \"Why Haven't I Met You\" https://t.co/YYFtwHHBRr https://t.co/D4iyfOzD1z @robinswhiskey 😂 I didn’t forget @Delllyrio I see you 🕷 @Zuziixx 🎂 @Jayden_Clements Yup!!! @_cheyd2003_ Just trying to answer as many questions on here and YouTube rn 🖤 @stiffycoopman 🙏 Video is here and I'm gonna being answering comments🖤https://t.co/3CgJVLMJd6 Why Haven't I Met You? Out Now! 🖤🕷\nhttps://t.co/XVXOmozKZp https://t.co/FsIb0y5znj WHIMY starring Bandit. Out tonight 🖤🕷\nhttps://t.co/XVXOmozKZp https://t.co/qxrudcYdbM @Chrissgeovanni Bruhhh 😂😭 https://t.co/VSPVBP92vo https://t.co/qAZms54SYx WHIMY the film. Who wants to see the premiere? Let me know where I should meet you guys! https://t.co/MVSWKVafz4 https://t.co/0cshwLndRr https://t.co/ROHe1Sl65v @breath1LOX ...it will be worth the wait, i promise. https://t.co/fDfymrnEQU WHIMY https://t.co/qj4JPJVFGn :’( RT @hookienator: I nominate @camerondallas for the @TeenChoiceFOX Award\n#SocialMediaKing RT @tronnorftdallas: THANK U SO MUCH CAMERON OMG ASHSHDHDD @camerondallas RT @espinoskyegurl: OH MY GOD @camerondallas IS OPENING FAN MAIL😱 http://t.co/x8m9btsndk RT @makenasarah1: @camerondallas you're weird AF but I like that http://t.co/hrI6KhKUiL RT @DayumCashh: @camerondallas I better go see it RT @onedirection562: Haha one of my friends stuck this on me so I guess I belong to @camerondallas now ☺️😏 http://t.co/aqZHYh9FUd RT @elisasalernoxo: How were FaceTimeing @CameronDallas at @ShawnnMendes's concert😍 RT @blERINthemusic: @CameronDallas made me do some cardio at the mall today"}