{"tweets": "Esta mañana he tenido la oportunidad de compartir escenario con Ms. Homare Sawa, campeona del mundo y referente para todos! Hemos celebrado juntos el 360 aniversario de #Kikumasamune, sake tradicional japonés #LivingJapan🇯🇵 https://t.co/PX4PwaC99U A semis!! Vamos @visselkobe! https://t.co/nOwLJX8Kzm ❤️#ravapas💫 https://t.co/5jyWLsm6Rc 💪🏻 Vamos @visselkobe! https://t.co/e7NkK707iU ❤️👏 https://t.co/c5FqHLDGTY Esta mañana he podido pasar un rato con los niños y niñas de primaria del colegio Daichi. Muy contento de poder compartir experiencias con los más pequeños #visselkobe 🇯🇵 https://t.co/CVMZHuuvzJ RT @DavisCupFinals: 🎾 All to be Champions 🎾\n\nGet ready for the World Cup of Tennis 🌎🏆\n#DavisCupMadridFinals #byRakuten https://t.co/BF8x7RN… Disfrutar, divertirse y aprender. La fórmula de #iniestamethodology 😊⚽🎳 https://t.co/AbHv1U84so Paseo por Kobe con esta personajilla llamada Siena ❤❤❤ https://t.co/vagtHJnICs Ya tengo la @Sony OLEDTV en la pared de mi casa gracias a la Sony Store de Osaka. \nCalidad de imagen excelente 📺👌🏻\n\nhttps://t.co/eSJ9OonNbU https://t.co/FDdPRKoB1j ❤️😊 https://t.co/CaMIZL8FQ6 ⚽️8️⃣ @visselkobe https://t.co/P5WZOv52UH Fútbol ⚽️ https://t.co/UuUUBzyCya ❤#ravapas💫❤ https://t.co/n3c0mwd8zo Dura derrota para todos ayer, analizaremos lo que pasó y nos prepararemos para el siguiente partido en nuestro estadio! Gracias por el apoyo! Vamos @visselkobe! https://t.co/NIf0OxK5AA Vamos @visselkobe!! 💪🏻⚽️ https://t.co/MfQzu4ygBB ⚽ @visselkobe https://t.co/y65scJjRJf Disfruté viéndote jugar pero más aún compitiendo contra ti. Hoy el fútbol es un poco menos fútbol.\nGrazie di cuore per tutto @ClaMarchisio8 👏🏼👏🏼 https://t.co/gLxg7AxUqf Haber jugado en @LaLiga te deja grandes recuerdos 😊 https://t.co/i15hP6uxMX Trabajando en nuevos proyectos... @sportsandlf https://t.co/4uFmFPPe8e Paolo Andrea ⚽️ #iniestamethodology https://t.co/Twj7iYaPQF Con un tío que no para de meter goles. Grande @Guaje7Villa 🇪🇸🇯🇵\nVamos @visselkobe!! https://t.co/x0u1VFaLx1 Qué gran victoria!! Qué gran esfuerzo de todos! Seguimos. \n💪🏻✌🏼Vamos @visselkobe!! https://t.co/fRyp5saz71 ⚽️💪🏻Vamos @visselkobe! https://t.co/BxE2YeO0dY Desde Japón acordándome de la época de vendimia en Fuentealbilla... https://t.co/HQVMoBcBjw Disfrutando del día en @USJ_Official \n#ravapas💫🇯🇵 🎡 https://t.co/EiulUHWDVF Paolo Andrea disfrutando de un entrenamiento en #Iniestamethodology \n@AnnaOrtiz34 https://t.co/OgOIflQ3kk Paseando por Kobe 💑 https://t.co/2CH1nW790w Family time ❤️🇯🇵\n@AnnaOrtiz34 @mbyjm86 https://t.co/QMO3gUlv2w 😃👍🏻 https://t.co/6tX2swvexj 👌🏻@visselkobe https://t.co/KxWh4ga8hY Gran partido y a la siguiente ronda!! Vamos @visselkobe💪🏻 https://t.co/RhkIMthuS9 ⚽️💪🏻Vamos @visselkobe!! https://t.co/jDnxaNBGN0 Un día como hoy, hace 23 años, cambió mi vida @fcbarcelona #LaMasia https://t.co/gaEjSCqQPl Un paso más 💪🏻💪🏻\n@visselkobe https://t.co/Yk5vls0i8Y 🏆Felicidades CAMPEONES!! 🇪🇸✌🏼 https://t.co/7bBdfTY1Ii ➕3 Vamos @visselkobe 💪🏻💪🏻 https://t.co/p7VtoFZTr4 Vamos @Visselkobe ⚽️💪🏻 https://t.co/7qjGQQ5Ysb Reunión 😊⚽️\n@visselkobe https://t.co/kwTde7LeCa ⚽️ @visselkobe https://t.co/sE4y9SNJ8C 👍🏻 @visselkobe https://t.co/dHGXo04w8q 🎙📻👏🏼👏🏼 https://t.co/1nQW2vXc5h ❤❤❤❤❤❤💫 #ravapas https://t.co/48eTLwupTI Hermano, gracias por todo lo que me cuidaste desde el primer día. Sobran las palabras contigo, todo lo vivido... Pero sobre todo, todo mis respetos para ti! \n\nTodo lo mejor en el futuro! \nHoy y siempre, @setoo9! https://t.co/mDV1mExwhT Fue un placer compartir la tarde contigo en Japón, gracias por tu visita! Un número 1 como DJ y como persona! #pacoosuna #mikakus https://t.co/RO09ox4t0g DEP Blanca 🙏🏼🙏🏼🙏🏼 https://t.co/YNIeSzO6gM 💥@visselkobe https://t.co/RYawEkSCLN 😊 @visselkobe https://t.co/ZM8ALm1HOp Lástima perder estos puntos con el esfuerzo y las opciones de hoy. \n\nA recuperar estas semanas para volver más fuerte! \n\nVamos @visselkobe 💪🏻 https://t.co/kV9YfG1K5H Vamos @visselkobe 💪 https://t.co/sSOYAIzGIT No hay palabras que puedan consolar tanto dolor, míster. Lo siento muchísimo. Todo mi cariño para ti y tu familia. ⚽️ @visselkobe https://t.co/7CBo32Mv2l Qué mejor nombre para este nuevo estadio que el de un referente como @JohanCruyff. Un día muy especial para el barcelonismo y un campo para disfrutar del talento de La Masia @fcbarcelona https://t.co/xDRT4GVaK2 Muchas felicidades, hermana!! \nYa van 33 primaveras... Disfruta de tu vida! Desde muchísimos kilómetros, te echo de menos!! ♥️🎂 @mbyjm86 https://t.co/zuNDQD72VU ⚽️ @visselkobe https://t.co/1538KKsCqt ⚽️8️⃣❤️ https://t.co/EMt9e7acGo GRACIAS POR TANTO ❤ @Torres https://t.co/U6NLN3SBEm Qué orgullo estar al lado de estas dos personas y vivir un momento así! ❤️⚽️🇪🇸 https://t.co/QTefjBMTqa Partido especial y único!\nSeguimos mejorando y este es el camino! Felicidades a todos, gran victoria! Gracias por el apoyo, afición! \nVamos @visselkobe!! https://t.co/ysAIMuUgfv No será un partido más. El último contra un amigo. Vamos a jugarlo, a competirlo... A disfrutarlo como siempre, @Torres! https://t.co/a6JdsdS7Yu ❤️😥\n\n👏🏻👏🏻 https://t.co/lhFtyU9hIC ⚽️😊@visselkobe https://t.co/altTg0JjNY Orgulloso de poder compartir unas horas con los niños y las niñas del Campus de verano de #IniestaMethodology. Una gran experiencia también para mí. Aprender, divertirse y disfrutar del fútbol! Arigato!!\nhttps://t.co/FGk5kmNZJH https://t.co/j3u1oQFlhq Mucha fuerza a todos los que luchan contra el fuego y mi cariño a todos los afectados. \n\n#FuerzaGranCanaria @visselkobe 💪⚽️❤️ https://t.co/JkPbCErzDg ⚽@LaLigaJP is starting this weekend on @dazn_jpn 😍🔥 #DAZNフットボール https://t.co/n9d1sqaMIO Merecida victoria. Grandísimo trabajo de todos! \nEste debe ser el camino! Juntos! \n\nVamos @visselkobe 🙌🏻🙌🏻 https://t.co/eNCEq1xSYv Juntos! Equipo! 💪🏻💪🏻\n\nVamos @visselkobe!! https://t.co/F4FVCjNiRw Primer Campus de verano #Iniestamethodology en Japón. Bonita experiencia con los niños y niñas y con todo el grupo de trabajo💪🏻⚽️ https://t.co/7nyfE1IIud Victoria y seguimos! 💪 https://t.co/hrBvZ6e7rZ ⚽️ @visselkobe https://t.co/VPyPSpyCuF Con muchas ganas de disfrutar de una nueva temporada de @LaLiga. Mucha suerte a todos!! \n\n👋🏻 #HolaLaLigaSantander https://t.co/K57IVymanq ⚽️Hoy ha empezado la primera edición del Campus Andrés Iniesta Methodology en J-Green Sakai (Osaka). Espero que los niños y niñas disfruten, se diviertan y aprendan con los entrenadores de #Iniestamethodology https://t.co/IeagRQTU9L Nos vamos con un punto de Oita. Gran trabajo de todos! A nuestra afición, gracias por el esfuerzo. \n\nHaremos lo posible para conseguir los 3 puntos el sábado. \n\nArigato!\n\nVamos @visselkobe 💪🏻 https://t.co/z53NleR1nn Vamos @visselkobe 💪🏻⚽️ https://t.co/yFRKse5B6N Este año con los grandes jugadores que hay en @laliga, las cláusulas y toda la emoción de siempre, #LaLigaFantasy va a ser muy divertida con tus amigos. \n\n⚽️¿Cómo van vuestros equipos? \n\n📲 https://t.co/0HJzZQK1be https://t.co/mL8qYSztxR Hoy hace 10 años amigo... \nSiempre en nuestro recuerdo! ❤️ https://t.co/1l3Vl5SPs4 ⚽️ Relax tras entreno. EQUIPO @visselkobe https://t.co/PlLA858KLg Comienza la semana 🌞😃! https://t.co/zQIocZx3MT @visselkobe 👍🏻 https://t.co/fS4oZoRS6c Gran esfuerzo de todos para remontar y sumar un punto. Gracias afición por vuestra fuerza! Vamos @visselkobe! https://t.co/fGltW1qsbw ⚽️💪 @visselkobe https://t.co/vB5tj2l2RP ❤️ @FCBarcelona &amp; @visselkobe https://t.co/7Gnqo6VU2y Style ⚽️ https://t.co/UMQLqQrlZS Hermano, un placer verte y estar contigo. Tantos años juntos en esa banda izquierda, es imposible no echarte de menos! 😍😉@JordiAlba https://t.co/2h9RfkEaiU https://t.co/OtgahtHR2C Tomorrow. The one of the biggest match in my life. I’m gonna dance with #ULTREZZA #ASICS  @asics_japan https://t.co/CwgK2vjxxM Capitán @5sergiob!! Cuántos recuerdos al volver a verte. Un placer, hermano!! https://t.co/BFCqS2CeOx Hermano, qué grande eres!! Para mí, no hay dudas!!! Qué alegría volver a verte @ivanrakitic!! 😊😊 https://t.co/xQ7utNYtGP ♥️😃 https://t.co/rzdvenQAge Qué alegría volver a verte, hermano!! @setoo9 #LaLigaIcons https://t.co/RjFDtcn49m @IkerCasillas @LaLiga Grande @IkerCasillas!! Un placer compartir contigo mi “vuelta” a @LaLiga. Un fuerte abrazo!! Un honor y un privilegio ser nuevo #LaLigaICONS Muchas gracias por la confianza @LaLiga https://t.co/RwLXiEM4C6 Hoy hace un año de un día muy importante y especial en mi carrera! ❤😉🎱 @jleague @visselkobe @RakutenJP https://t.co/Qr9lHHti5K ⚽️@visselkobe https://t.co/9yDg92Nh3A TEAM 💪 Vamos @visselkobe! ⚽ https://t.co/nh7ROyExZK Visita a la Barça Store en Harajuku. Ha sido bonito encontrar productos del momento inolvidable que vivimos en 2009. Han pasado 10 años y continúo teniendo retos todos los días #BarcaStore #Harajuku #Kobe #Iniestazo #VisselKobe #FCBarcelona #CantWaitTheMatch #July27 #RakutenCup https://t.co/P4nvgchE5b ⚽️😃 https://t.co/Dpj6srMD3V Dinner with my friend @hmikitani 👍🏼 https://t.co/QgyXtRgvLJ Muy feliz de haber presentado mis nuevas #UltrezzaAI en Tokyo!! Muchas gracias @ASICS_JP por todo vuestro trabajo durante este último año. Con muchas ganas de disfrutar con ellas el próximo partido! #ASICS https://t.co/XDze0eyB15 Perdimos una buena oportunidad para avanzar. No hay otro camino que trabajar y mejorar. Vamos @visselkobe 💪🏻 https://t.co/AueSIrT8jY 💪🏻⚽️ https://t.co/boSR9M3sNl Nueve años de la felicidad eterna ⚽️❤️🇪🇸 https://t.co/S3kaoCJ3Dy Una derrota que nos debe servir para mejorar y saber que debemos estar a nuestro mejor nivel para seguir creciendo. Gracias por el apoyo! Seguimos juntos, equipo! Vamos @visselkobe! https://t.co/gFGknOOkBi ⚽️⚽️ @visselkobe https://t.co/vckUOaAdHU 💪🏻 Vamos @visselkobe!! https://t.co/jYAcOKM65B ⚽️❤️#Romeo #ravapas https://t.co/3tnflVsz54 Hace un año jugué en Rusia mi último partido con la Selección. Innumerables recuerdos ❤️❤️❤️ https://t.co/o6tqu7mIe3 Muy feliz por los 3 puntos!! Gran trabajo de todos! A seguir, Equipo. Vamos @visselkobe!!💪🏻💪🏻 https://t.co/WJL07s7bPt ⚽️💪🏻 @visselkobe https://t.co/HXLZWiSVvY Llegar a casa y que te reciban así...\n😊😍😊 @AnnaOrtiz34 https://t.co/sIvs4BFZNc 👏🏼👏🏼👏🏼💪🏻💪🏻💪🏻 https://t.co/sTkAYEqa7m Y 12 años después... La felicidad sigue intacta a tu lado! Te quiero Mam! 💘 https://t.co/TkY6oSa7Ri Lástima resultado final... Gran partido y buenas sensaciones. Ahora a preparar el siguiente! Vamos @visselkobe 💪🏻⚽️ https://t.co/r2i7MxPe7r Hermano, toda una vida deportiva paralela, momentos únicos e inolvidables, pero sobre todo tu persona. Eres muy grande en todos los sentidos! Todo lo mejor! @Torres https://t.co/B3buJmupGW Bienvenido Romeo! Día maravilloso! La mamá y él  están geniales! 😍❤ https://t.co/EVCdqEz3Bv 🔛🔥@visselkobe https://t.co/6cYDYpE97E ⚽️@visselkobe https://t.co/IirkRv0alS Grandísimo trabajo de todos!! Vamos @visselkobe 💪🏻💪🏻 https://t.co/bGavOOWZcL ⚽️⚽️💪🏻 @visselkobe https://t.co/bSin1WS4ez My vision, My method. Join the project now #Iniestamethodology\n \n私のビジョン、私の哲学。サッカースクール＜イニエスタ メソドロジー＞入会受付中\nhttps://t.co/M4j2yDMbwt https://t.co/sCQjbVSpyl 💪🏻💪🏻💪🏻 https://t.co/rC2KxO7QvV ⚽️⚽️⚽️@visselkobe https://t.co/iwDyJcSkyF Sin palabras... Muchas felicidades! Único, @RafaelNadal! https://t.co/G7Zuu51eFD 😃😃 @visselkobe https://t.co/Nakq11Rmby Todo lo mejor en este Mundial!! Vamos equipo!!\n\n @SeFutbolFem 💪🏻⚽️🇪🇸 https://t.co/AUxy9O4WOf 🏃🏻‍♂️🏃🏻‍♂️⚽️ @visselkobe https://t.co/Sg34qFCAtt Berlín 2015 ❤️❤️❤️ @FCBarcelona https://t.co/YVNZx5qdu0 TEAM💪🏻 #visselkobe https://t.co/ylUdkQXWRU ⚽️💪🏻 https://t.co/bpu7S3ZXjF Te echo de menos, Mam ♥️ #yaquedamenos #familia #ravapas https://t.co/STIu0X00uW Demasiado triste para ser verdad. Terrible. Descansa en paz compañero. Todo mi cariño y toda mi fuerza para la familia. Siempre estarás con nosotros. 🙏🏻 https://t.co/YWoKaFad9k Campeón, muchas felicidades por tus 4 añazos!! Disfruta!! Te quiero peke!! 😍 https://t.co/2zquETUV1v Para los niños que quieren ser el futuro del fútbol. Gracias, Japón! 🇯🇵\n\nFor the kids who own the future of football. Arigato, Japan! 🇯🇵 https://t.co/QOfxGXR0D0 Día muy especial. Hoy, junto a mi equipo, hemos inaugurado mi primera academia Iniesta Methodology en Osaka. Un nuevo paso para seguir creciendo. Muy feliz de poder compartir con los más pequeños lo que aprendo cada día. Arigato🇯🇵\n#rakuten #iniestamethodology https://t.co/68IjEfOOmX 27-5-09. Roma. Inolvidable 🔴🔵 https://t.co/OnIybs1qJ0 Vamos @visselkobe 💪🏻💪🏻 https://t.co/ICN5pzkrf4 ⚽️⚽️⚽️ https://t.co/2FYj3gZDTO RT @LaLiga: ¡Cómo no echar de menos los GOLAZOS de @andresiniesta8! 🤩 https://t.co/2UHx1wHVTG ❤️❤️❤️ https://t.co/TIT7finSxK Un año de mi último partido en el Camp Nou. Piel de gallina al recordarlo.\nGracias por tanto cariño!! 🔴🔵 @FCBarcelona https://t.co/O45cAOHykA 💪🏻💪🏻 @visselkobe https://t.co/ajnfZL4RHK 💪🏻💪🏻 Vamos @visselkobe!! https://t.co/L4wUwOrh19 Felices 2 añazos, preciosa ❤️ https://t.co/1kQKR9wiOz Preparando el próximo partido con el mejor apoyo, nuestra gente. Arigato! Vamos @visselkobe! https://t.co/W2n7QXqZHu Sobran las palabras. Solo queda trabajar duro para devolver el apoyo y la ilusión a nuestros seguidores y a nosotros mismos. \nVamos @visselkobe!! 💪🏻💪🏻 https://t.co/2D0QVMN041 Día especial y espectacular juntos. Un año más, que siga la magia y la felicidad de siempre! Os quiero mucho! ❤❤❤❤❤ #familia #avapas https://t.co/bJAOzWWdk0 Momentos irrepetibles con personas únicas!! Gracias a todos por las felicitaciones!! 💙❤️ https://t.co/pCa7htir0o Muchas gracias a todos: aficionados, compañeros, rivales, a todos los clubes... Un abrazo fuerte!! ❤️⚽️ https://t.co/JrXwzTzb1A Muchas gracias por este gran recuerdo!! Felicidad máxima 🙌🏻🙌🏻 https://t.co/KvPFXdnbJx @SeFutbol Muchas gracias amigos!! Un abrazo fuerte a entrenadores, compañeros, staff de la @rfef!! 💪🏻Vamos @visselkobe!! ♥️🙌🏼 https://t.co/sRSI8AVN65 Feliz de ver cómo la Bodega sigue creciendo! @BodegaIniesta 😊😊#corazonloco https://t.co/jbwgx6Nixx The key of the success is to focus on goals, not obstacles 🗯‼️@mikakus #MIKAKUS #ATTITUDE https://t.co/6iImtoiqJs 10 años después, sin palabras. \nQué momento!!! 🔴🔵 \n\n10 years after, without words.\nWhat a moment!!! 🔴🔵 https://t.co/eHi4TQ9MPb Feliz día de la madre a todas!!\nY para ti, MADRE, en especial!!! \nUn orgullo como hijo es lo que siento al verte y quererte! Gracias por todo!! 💘💘\n#FelizDiadeLaMadre #Familia https://t.co/67BiR4hEtU Te queremos, mami!! Feliz día!!😃😃😃❤️❤️❤️❤️ @annaortiz34 #felizdiadelamadre #familia 🇯🇵 https://t.co/bFR2u3tUb3 ⚽️💪 https://t.co/3XnTUYhW4A ⚽️💪🏻Vamos @visselkobe!! https://t.co/VVkWnVPru2 El mejor socio. Un privilegio crecer y compartir a tu lado toda mi carrera y los mejores momentos. Un ejemplo de profesional. Gracias por todo lo enseñado al mundo del fútbol. \nLa mejor de las suertes en esta nueva etapa, Xavi!! 😉 https://t.co/XjbOm4ucX9 Vaya susto nos has dado Iker... Recúperate pronto amigo!! 💪🏻💪🏻 https://t.co/XZRjeYtB9J Mirando siempre adelante 💪 https://t.co/lMFnyhwBXe Dinámica mala. Reacción positiva,  pero sin premio. No queda otro camino que seguir trabajando duro y pronto pasarán cosas positivas. Juntos siempre. Vamos @visselkobe!! https://t.co/Mw0HOwyLAx Muchas felicidades por la liga!!! Os lo merecéis!!! Los mejores una vez más!! Força Barça! 🔴🔵 @FCBarcelona https://t.co/ESSWOn2Skm Vamos @visselkobe 🔴⚫️ 💪🏻💪🏻 https://t.co/0WFm0WFuXm Cómo pasa el tiempo... Un año de la despedida! Imposible no seguir emocionándome... 💙❤ \nA seguir ganando @FCBarcelona y a seguir haciéndonos felices!! https://t.co/UtANMEFQ05 Ganas de fútbol⚽️\n@visselkobe https://t.co/ItQ73mmIqy Un orgullo ser el capitán de este equipo. Intentaré representar a mis compañeros, al club y a los aficionados de la mejor forma posible. Seguiremos trabajando duro para dar alegrías y cumplir nuestras metas. Siempre unidos. Arigato! \n⚽️💪🏻Vamos @visselkobe!! https://t.co/7bvLZCrwi8 Go for it. No matter how it ends, it was an experience⚡✔@mikakus  #ATTITUDE #MIKAKUS https://t.co/Ss2tePINlp Aquí os dejo un par de recomendaciones para celebrar mi primer Sant Jordi desde Japón 📚🌹 https://t.co/ZCQ75C2dEc Hace un año, mi última final... Inolvidable partido; inolvidable noche; inolvidables emociones.  \n\n#ForçaBarça \n\n🔵🔴 https://t.co/5JOkQjPJ4B Los resultados no están siendo positivos, pero debemos seguir nuestro camino y confiar en lo que hacemos porque llegarán. Merecéis alegrías! \nGracias por el apoyo incondicional. https://t.co/gHKsnSnOR3 Uno de los mejores goles que hemos visto!! 👏🏻👏🏻👏🏻 https://t.co/nXcLhi35Mn Gracias míster, un placer trabajar a tu lado. Mucha suerte! Arigato! \n\nThanks coach, a pleasure to work by your side. Good luck! https://t.co/51qypifvix No tengo dudas de este equipo y esta afición! 💪\n\nI don’t doubt at all of this team and it’s supporters! 💪 https://t.co/ZSTPYc50Dw Muy decepcionados por el resultado. Solo debemos seguir trabajando y preparándonos para el siguiente partido y poder dar alegrías a nuestra afición.\nEn momentos duros, más juntos que nunca!! \n\nVamos @visselkobe 💪🏻 💪🏻 https://t.co/KaMbMNWl0D ⚽️💪🏻Vamos @visselkobe!!! https://t.co/XCniFJV4Z8 Ready for sunday with my new boots 😁😁\n\nPreparado para el partido del domingo con mis nuevas botas 😁\n\n装いも新たにニューカラー登場。ASICS DS LIGHT X-FLY4 #ASICS #XFLY4 #IMoveMe  @ASICS_JP https://t.co/8lDyaSEhFv ⚽️TEAM!! @daigonishi22 @leoosaki14 @hotaru10crz @cbxptcc4pg #Dankler https://t.co/8lqhke3ZsO ✌🏼Victoria y líderes de grupo en la #LevainCup. Gran trabajo, vamos @visselkobe!! \nFeliz de volverte a ver en el campo, Asahi💪🏻 https://t.co/fGoRyNylEc ❤️❤️❤️ https://t.co/jde9PUqwOW Vamos @visselkobe! ⚽️💪 https://t.co/bT8zoUPQin ⚽️💪🏻@visselkobe https://t.co/KyyWr5SL59 Tough defeat, we couldn’t revert the result. We keep preparing for what’s coming. Thanks for the amazing support from our fans as always. Come on @visselkobe! https://t.co/kqVjWTVLSd Dura derrota, no pudimos darle la vuelta al resultado. Seguiremos preparando lo que viene. Gracias por el apoyo de nuestra afición, siempre increíble. Vamos @visselkobe! https://t.co/mR1CEme44d ⚽️💪 vamos @visselkobe! https://t.co/HQsFmpXjME 😌Partidos especiales contra el @Atleti! 🔝💪🏻 ⚽️ Desde Japón siempre pendiente de @laliga https://t.co/CSHHWcqgWN Strong alone. Unstoppable together 💪🏼💯 @mikakus #MIKAKUS #ATTITUDE https://t.co/9Sdm56KcIl Amigo, capitán, tu lucha, generosidad, amabilidad, altruismo, dedicación han sido y serán un ejemplo para todos. Un beso muy fuerte para la familia y amigos. Descansa en paz, Cepi. https://t.co/UP4sLznjKN Mañana de relax en Kobe ❤️ @AnnaOrtiz34 https://t.co/Z0qKt3j9Eb @Torres @mikakus @AnnaOrtiz34 Arigato!! Te quedan de lujo, hermano!! 😍😘 Gran victoria, equipo!! Remontando por dos veces! Felicidades equipo y gracias afición! Vamos @vissel_kobe! \n\nGreat team effort!! Coming back on the result twice! Congratulations to all and big thanks to the fans! Come on @vissel_kobe! https://t.co/RBHviA1MbS ⚽️💪🏻 Vamos @vissel_kobe!!! \n#VisselKobe #jleague https://t.co/SYSpzovvW8 ⚽️🇯🇵Japón-Bolivia🇧🇴 #NoevirStadium https://t.co/t4HsdCFLgb 😉@vissel_kobe https://t.co/UH1xb3I89c ⚽️💪🏻@SergiSamper @vissel_kobe https://t.co/IpKLSpMoD2 💪🏻@vissel_kobe https://t.co/EJ7LaoLpF4 #DiferenteComoTú @annetavives https://t.co/bTcsptjDd5 ⚽️ @vissel_kobe https://t.co/ZPJP9cuRDl The hard work puts you where the good luck can find you 💪🏻🍀| El trabajo duro te pone donde la buena suerte pueda encontrarte  💪🏻🍀 @mikakus #MIKAKUS #ATTITUDE https://t.co/LX7nudqFlv Hoy sumamos un punto contra un gran rival. Ahora toca descansar y volver más fuertes. Gracias por el apoyo!! 👏🏼👏🏼\n\nOne more point against a great rival. Now, time to rest and come back stronger. Thanks for the support!! 👏🏼👏🏼\n\nVamos @vissel_kobe!! 💪🏻💪🏻 https://t.co/mm59pmD4Lo ⚽️💪🏻Vamos @vissel_kobe!!  #jleague https://t.co/PCULztEY34 Preparando el partido del domingo ⚽️💪🏻 https://t.co/P1cOFybg2O Gracias Míster por darme la oportunidad! Te deseo lo mejor!! #VanGaal https://t.co/f3fv6rqlXg Un punto para seguir sumando. 2a jornada #Levaincup \nOne more point to keep adding. 2nd date of #Levaincup \n💪🏻💪🏻Vamos @vissel_kobe!! https://t.co/6yMoVZgrql ⚽️💪🏻@vissel_kobe #LevainCup https://t.co/5kZ2zqkaT0 @antoniorozco Muchas gracias por tus palabras, Maestro. Un abrazo fuerte Gran victoria en Sendai. Trabajo genial del equipo!!! \nMuy felices!!! A preparar el próximo. Vamos @vissel_kobe 💪🏻💪🏻\n\nGreat win in Sendai. Good job, team!!\nWe’re very happy! Let’s do it again. Come on @vissel_kobe 💪🏻💪🏻\n#WeAreKobe https://t.co/vvxiOkjAt5 ⚽️💪🏻Vamos @vissel_kobe!! #jleague https://t.co/r4WQottykD 💪🏻💪🏻Preparados para el próximo partido!! \n⚽️⚽️Ready for the next match!! #jleague #VisselKobe https://t.co/zMnHgmQwdx El trabajo en equipo nos ayuda a crear un mundo más igualitario #MárcateUnPod #Ariel3en1Pods https://t.co/jzZzM6zugh Buen punto equipo, gran trabajo @vissel_kobe 💪\n\nNice team effort, great job 💪#leviancup https://t.co/YGhYgwVFer ⚽️💪 https://t.co/VBW4bTC9qQ Un día muy especial en Tokyo inaugurando la Yotsugi Station junto a Yoichi Takahashi, el creador de Oliver y Benji. La estación está decorada con los dibujos de mi serie favorita cuando era niño #Captaintsubasa https://t.co/dggSiFtLYJ Siempre es un placer!! @Torres @Guaje7Villa 🔝😉 https://t.co/rcA484zQ5w ⚽️Fútbol https://t.co/xjM9D3xRLy 💪🏻💪🏻Primera victoria!! Buen trabajo EQUIPO!! A seguir! @visselkobe_official \n\n💪🏻💪🏻1st win!! Well done, TEAM!! Let’s go! #Jleague https://t.co/muDYB4HpON 💪🏻⚽️ @vissel_kobe #Jleague https://t.co/k5F8KurImo Konnichiwa. Con mi amor ❤️ @AnnaOrtiz34 https://t.co/GgCQWNS4Me 💪🏻⚽️Buen entreno para empezar la semana @vissel_kobe https://t.co/0UdXPxwgGU No fue el mejor inicio para nosotros, pero seguiremos trabajando fuerte para que llegue la victoria en el próximo partido. \nForça @vissel_kobe!! 💪🏻💪🏻 https://t.co/0jlYEZ46Fe Nueva temporada. Nuevos retos. Misma ilusión!! \nVuelve el fútbol⚽🇯🇵 \n\nNew season. New challenges. Same illusion!!\nFootball is back ⚽️🇯🇵 \n\n@vissel_kobe @jleague \n#wearekobe https://t.co/TpuwMYB301 ⚽️TEAM @vissel_kobe https://t.co/cr50upRItY ☔️🇯🇵❤️ https://t.co/MtiUkJIel9 📸😊@vissel_kobe https://t.co/pbOdqzlpVI ⚽️💪🏻EQUIPO!! @vissel_kobe https://t.co/4ipYSCRgz8 ⚽️⚽️Mucha ilusión por una nueva temporada! Con ganas de empezar!!\n\nExcited for a new season! I really want to start!\n@jleague 🇯🇵 @vissel_kobe https://t.co/Vw6PTqZsgU ¿Os gustaría viajar a mi nuevo hogar, Japón🇯🇵?\n\nAquí tenéis el link para el sorteo de unos billetes de avión. Apúntate!\n@visitjapanuk\n\nhttps://t.co/Uzl4dsg3iC A big part of my passion, @BodegaIniesta is introduced on GOETHE and GOETHE Web. Nice shooting with my beloved @annaortiz34 and exciting crew. \nGOETHE で私が情熱を傾けたワインを紹介いただきました。是非チェックしてく\n\nhttps://t.co/8RWLNTFshd\n\n@goethe_magazine @yanaginihon \n#幻冬舎 https://t.co/0L5ij2A3Sf 90 años de fútbol, de pasión y de ilusiones.  Fue un privilegio jugar en @LaLiga con tantos y tantos grandes jugadores y compañeros. Por muchos años más de fútbol. https://t.co/htBDa4r3P9 Okinawa 🇯🇵⚽️@vissel_kobe https://t.co/YDv5Q9VQZZ Descansa en paz, Emiliano Sala https://t.co/79vPl0XU3l Día libre de familias!! @Guaje7Villa ⚽️😃 #usj #osaka #conan #lupin https://t.co/EpoMKV4DQm Take control. Attitude is everything 💪🏽💥@mikakus #ATTITUDE by @andresiniesta8 https://t.co/u83Q7V3PtL Volvemos a Kobe después de 12 días de trabajo en California. Gran experiencia para el equipo! Nos espera la temporada!! 💪🏻💪🏻 \n\nComing back to Kobe after 12 days of training camp in California. Great experience for the team! Ready for a new season!! 💪🏻💪🏻 \n#VisselUSAtour https://t.co/XZyP0X2aKz Todo mi apoyo y cariño para la gente que lucha contra el cáncer. Mucha fuerza!💪🏻\n#DiaMundialContraElCáncer\n\nAll my support and affection for people who fight against cancer. Lots of strength!💪🏻\n#WorldCancerDay https://t.co/h4HKJPElJ5 ⚽️⚽️⚽️ https://t.co/Ph92Tr51Bt Bonita experiencia el partido contra @LAFC. Gracias por el cariño,  L.A.👏🏼👏🏼\n\nNice experience against @LAFC. Thanks for the support, L.A. 👏🏼👏🏼 https://t.co/QNPAqTHqwX ⚽️❤️ https://t.co/eVRpEQgj4i Siempre en el recuerdo, míster! https://t.co/fEqBev0MZo Debemos seguir mejorando y aprendiendo de todas las bonitas experiencias en este magnífico escenario. Vamos @vissel_kobe! \n\nWe must keep getting better and learning experiences that offers this great scenario. Let’s go @vissel_kobe! https://t.co/Ycsk1kaafa Entrenamiento 💪⚽️ https://t.co/G4ljC43Y38 Mucho ánimo! Volverás más fuerte! 💪 https://t.co/LecdNMFdei Nos vemos el jueves, Los Angeles.\nTenemos una cita con @LAFC y @LAFC3252 en @BancStadium. \n\nWe’re coming, Los Angeles. \n\nSee you Thursday night at @BancStadium when we take on @LAFC and @LAFC3252 \n\nhttps://t.co/HAedS9kkBi https://t.co/3kOplPWKo3 Primer partido de pretemporada completado con buenas sensaciones!!! El jueves más contra el @LAFC! 💪🏻💪🏻⚽⚽🇺🇸🇯🇵\n\nFirst game of the season completed! Next game on thursday against @LAFC 💪🏻💪🏻⚽⚽🇺🇸🇯🇵 https://t.co/SyvT6bNClA Ya se pueden ver online los videos donde presento Japón! @Visit_Japan \n\nI introduce Japan through these videos, check them out! @Visit_Japan \n\nこちら👇\n\n https://t.co/HDX7uyACN6…\n\n https://t.co/Uf8LBUQkR5 https://t.co/8lTrUule4H Tercer día de nuestra pretemporada en Orange County! Preparando los partidos. Muchas gracias por vuestro apoyo! @vissel_kobe \n \nThird day of our pre season in Orange County! Preparing our games. Thank you for your support! https://t.co/5a7KaVoVWC Dreams and dedication are a powerful combination 💯💪🏼💥| Los sueños y la dedicación són una poderosa combinación 💯💪🏼💥 @mikakus #ATTITUDE by #AndresIniesta #BOOM #sneakers #zapatillas #Japan https://t.co/fpykWuARtJ Empieza Vissel Kobe Tour 👏👏👏\n\nLAFC: https://t.co/2veEViZda0\n\nOCC: https://t.co/wFxUsHZaUg https://t.co/SuJyvQCuJx 🙏🏻🙏🏻🙏🏻 Emiliano Sala https://t.co/UQEBegNf7y Preseason 💪🏻💪🏻⚽⚽ @vissel_kobe https://t.co/syOJwLiC69 Madre!!! Muchas felicidades!! Aunque estemos lejos, nada cambia! Te quiero mucho!!!❤❤❤ https://t.co/Gz3P2XmqGI ⚽💪🏻 @vissel_kobe https://t.co/1tMUWW97Z0 Un orgullo ser recibido por el Primer Ministro Abe. Gracias Japón por todo vuestro cariño. \nProud to be received by Prime Minister Abe. Thanks Japan for all your love. \n🇯🇵 ⚽ @vissel_kobe @hmikitani Arigato!! https://t.co/IhnVehoLLn Lukas, es muy divertido jugar contigo en nuestro equipo. Además, creo decir por ambos que es muy bueno ser parte de la familia Rakuten. Deseo que tengas todo el éxito con tus planes de Rakuten Alemania y se vuelvan realidad! Te deseo lo mejor @Podolski10 https://t.co/fl5vCB8ZEH Lukas, it's a lot of fun playing with you on our team and I think I can say for both of us that it's exciting to be part of the Rakuten family. I am very much looking forward to seeing your joint plans with Rakuten Germany come to life, and I wish you all the best! @Podolski10 https://t.co/XBuDSSk2XS Comienza una nueva temporada 😀💪🇯🇵 @vissel_kobe \n\nA new season starts 😀💪🇯🇵 https://t.co/W2D9uBv8Wf Se retira uno de los grandes porteros del mundo... Siempre bonito enfrentarse a ti! Todo lo mejor, @PetrCech!! 🔝🔝🔝\n\nOne of the best goalkeepers in the world retires... Always challenging and good to play against you! All the best, @PetrCech!! 🔝🔝🔝 https://t.co/1hQlC4ihLN Referente para todos, por toda tu trayectoria, por tu calidad como deportista y persona. Un placer, @veroboquete https://t.co/EmarNQSk15 Qué alegría volverte a ver fenómeno!! Qué ejemplo eres, @19SCazorla!! Muchas gracias a la @RevistaPanenka por el reconocimiento! 😀💪 https://t.co/4EDJ6Uk6QG 🔵🔴 @FCBarcelona https://t.co/vMc3UPLL1F LOS MEJORES ❤️❤️❤️❤️ https://t.co/PeBZ5Qr9G1 Tarde de fotos con mis @mikakus, pronto veréis el resultado... ☺📸 #MIKAKUS #Attitude https://t.co/NrbVP5yKVt Adiós Navidad 😀😀😀😃😃😃 https://t.co/9RcNMQ0oQy 👑👑👑💫💫💫 https://t.co/RhCXAj1AqB Arigato @nasudaisuke02 👏👏👏 https://t.co/fZyHqgzbCO 💪💪💪🍷🍷🍷 https://t.co/wO5hCTfKNf Por un 2019 repleto de salud e ilusiones para todos!! #felizaño #mamitq #6❤️ https://t.co/Qn9NlvYB66 Despidiendo el año paseando con mucho amor ❤ #ByeBye2018 https://t.co/jsu5pvFS1D Día muy especial en mi pueblo, inaugurando el campo de fútbol de césped artificial, quién lo hubiese pillado!! Acompañado de Don Vicente Del Bosque, todavía más especial. #fuentealbilla #futbol #lasmoreras https://t.co/8jOuUBekwT Nos vemos pronto 🇺🇸!\nSee you soon 🇺🇸! https://t.co/SFgqUHVfwv Attitude is everything 🤟🏼😎 #MIKAKUS #ATTITUDE https://t.co/xLWrD3kM6V Family ❤️❤️❤️❤️❤️❤️ https://t.co/argPPKvqDD ¡ Feliz Navidad! 🎄🎁 ☃️🎅 https://t.co/rUCRbw7VRY Los equipos de @SaveChildrenEs están trabajando en la emergencia de Indonesia. Muchos niños y niñas se han quedado sin hogar o están heridos. Necesitan toda nuestra ayuda. \n\nhttps://t.co/N8H8PgW7k6 Desde otro lugar, pero con sensaciones muy bonitas al volver al Camp Nou! Força barça!!! 🔴🔵 https://t.co/7BNxTPxppO Training con mi cuñado💪🏻💪🏻💪🏻 https://t.co/4VJDsWO203 Nuevos retos en @mikakus 💪🏻💪🏻💪🏻👟👟!  #attitude #sneakers #boom https://t.co/YID3SmGQ4T ☃️⛄️❄️❤️❤️❤️❤️❤️❤️ https://t.co/31G1bKVoz1 Hace unos días pude visitar las oficinas de @ASICS_JP \nen Kobe y aprovechar para trabajar en las próximas novedades! ☺💪🏻💪🏻 #IMoveMe \n\nA few days ago I visited @ASICS_JP offices in Kobe to start working on the new projects ☺💪🏻💪🏻 #IMoveMe https://t.co/XI9pSzav3A Familia feliz!!! Día especial!!! Con la mejor!!! Felicidades, mi amor!!! Día único a tu lado y un placer compartirlo contigo!!! Te queremos!!! ❤️❤️❤️❤️❤️❤️ https://t.co/03xKRa00cx Ya en casa marcándonos un Pod. Entra en https://t.co/4k1F4fX9w9 @PG_Espana\n#MárcateUnPod\n#Ariel3en1Pods https://t.co/IiwAr3zrNy Día especial al ver a estos fenómenos 💪😃 @FCBarcelona \n\nSpecial day to be reunited with my former teammates 💪😃 https://t.co/EowNObDVE2 Volver a casa siempre es especial ❤️🔵🔴 @FCBarcelona  \n\nComing back home is always special ❤️🔵🔴 https://t.co/BuxYk7tkRW Mucha suerte a todos! Nos vemos pronto! https://t.co/6tvoqznAUF Mis primeros 6 meses en Kobe! Muchísimas gracias a todos por el cariño y por ayudarnos en todo!! Sois los mejores! @vissel_kobe #aficion #compañeros #rakuten\n\nMy first 6 months in Kobe! Thank you everyone for the support!! You are the best! @vissel_kobe https://t.co/6MtpVR0520 Todo mi cariño para familiares y amigos de Josep Lluís Nuñez, que fue nuestro presidente durante tantos años. Muy agradecido siempre por todo lo que viví en La Masia con él. DEP. @FCBarcelona https://t.co/wsy0CKmpdU Un orgullo para tod@s!! Muchisimas felicidades 🔝🔝🔝👏🏻👏🏻👏🏻” https://t.co/VzERMLkQkG Bienvenido a @vissel_kobe, Guaje! Feliz de volver a compartir vestuario contigo 😉😊 💪🏻 @Guaje7Villa \n\nWelcome to @vissel_kobe Guaje! Happy to play with you again 😉😊 💪🏻 @Guaje7Villa https://t.co/a8iBwE3z8U ⚽️⚽️⚽️ https://t.co/U1PUgWBqtE Mañana último partido en casa! Todo nuestros esfuerzo para daros una alegría! Vamos @vissel_kobe! 💪⚽️🔴⚫️\n\nLast game at home! All our efforts to give you a joy! Come on @vissel_kobe! 💪⚽️🔴⚫️ https://t.co/pPT7V1BBxw Preparando el último partido de la temporada en casa @vissel_kobe!! 💪⚽️\n\nPreparing last game of the season at home @vissel_kobe!! 💪⚽️ https://t.co/eCNtpqB6mj Gracias por todo @alo_oficial y felicidades por tu trayectoria 🔝🏎. Has hecho historia, campeón!! Mucha suerte en tus próximos retos 💪🏻💪🏻 \n\nThank you @alo_oficial and congratulations for your career 🔝🏎. You’ve done history!! https://t.co/duiPc0neBT Disfrutando Kobe ... ❤❤❤\n\nEnjoying Kobe ... ❤️❤️❤️ https://t.co/p11Im4CP4N Ésta noche en mi programa, @jordievole 🤣🤣! Un placer estar con vosotros... gracias por la visita @salvadostv! https://t.co/IjKmqMPQhy Muy orgulloso de mi primer clinic en Japón #iniestasmethodology @RakutenJP 💪⚽️\n\nProud of my first clinic in Japan 💪⚽️ https://t.co/oezil1FtEk Gran esfuerzo de todo el equipo! Partido duro hoy! Muchas cosas buenas y otras para mejorar. Gracias afición!!! Siempre juntos! 💪⚽\n\nGreat effort from all the team! Tough game today. We show good things with other to improve. Thank you fans! Always together 💪⚽️ https://t.co/6om0qZiISR ⚽️💪 https://t.co/YkPW7MFiED Agradecidos por la visita y la felicidad que significa!!! Días maravillosos!!! Un placer!! Los mejores!!! https://t.co/CdmlR9gp7c Love this game ❤❤ https://t.co/aQ5htbrz2z Bonito y frío día en familia ☺☺❤❤❤❤❤ @AnnaOrtiz34 #usj #harrypotter https://t.co/nm02ncFUM2 ⚽️⚽️😊😊8️⃣ https://t.co/SZRzwsu1Qx Hoy se estrena la primera película de Rakuten Cinema: Alegría Tristeza. Enhorabuena compañeros... porque encima os ha quedado un peliculón!! @RakutenTV_ES #peliculon #cineespañol #rakutencinema #Alegriatristeza https://t.co/NAlOIE7SuQ Muy contento de poder participar en este proyecto! Ya tengo mis @mikakusbrand 😊😊!! Házte con las tuyas en https://t.co/X6htg0AOOI 👟💥 #MIKAKUS #sneakers #zapatillas https://t.co/uSpfFRZFbs Con mi trupe ⚽️🔴🔵 #campnou #barça #trupe @FCBarcelona @AnnaOrtiz34 https://t.co/hD8xz7XdF8 Conociendo Japón en la mejor compañía!! ❤❤❤❤❤ ⛩⛩ https://t.co/7kotqaRs8o +1! We missed our chances but we keep improving. Thank you to the fans, you are amazing!! Happy to play against you my friend, @Torres https://t.co/56QuBaSZaz + 1! Nos faltó acierto pero seguimos mejorando. Muchisimas gracias afición, sois increíbles!! Bonito jugar contra ti amigo, @Torres. https://t.co/dh3TtXlFlc ⚽️💪 https://t.co/jcFFwCw3E5 Preparados para el importante partido de mañana contra @saganofficial17! Vamos @vissel_kobe!!! 💪⚽️🔴⚫️ \n\nPrepared for an important game against @saganofficial17! Come on @vissel_kobe!!!! https://t.co/qVPkNwDMFA ❤️😍 https://t.co/P5rE1kqw4V #X-FLY4 🙌🏻⚽😍 https://t.co/UpLVtnUAu2 🇪🇸 🇩🇪 ⚽️ https://t.co/yZyllGcmqU Felicidades a todo el equipo! Gran trabajo y tres puntazos! 💪⚽️\n\nCongratulations to all the team! Great job and three points! 💪⚽️ https://t.co/YBXOlpNW0s ⚽️💪 https://t.co/rSZdr59ghf 💪🏻💪🏻⚽⚽@vissel_kobe https://t.co/AubQcLh60v ⚽️💪 @vissel_kobe https://t.co/irfM3sIpcq 16 años del día que cumplí el sueño que tenía desde que llegue a la Masia! 🙌 🔴🔵 @FCBarcelona \n\n16 years ago of the day that I achieved the dream since I arrived to la Masía 🙌 🔴🔵 https://t.co/pVjglozSIH Desde la otra punta del mundo!! Vamos @FCBarcelona 🔴🔵\n\nFrom the other side of the world!!\nLet’s go @FCBarcelona 🔴🔵 https://t.co/B4twBSXoC5 💪💪⚽️⚽️ https://t.co/zsASouZJkD Tarde en Kobe con unos churritos de casa... @annaortiz34 ☕️ https://t.co/aFQrc33346 ⚽️⚽️⚽️ @vissel_kobe https://t.co/Xb2g1yWn50 Con mis nuevas botas 😁😁!!\n\nWith my new boots 😁😁!! #INIESTASICS #IMoveMe #ASICS @ASICS_JP https://t.co/KwTD4Od47c Día muy especial en esta nueva etapa. Feliz de formar parte de la familia Asics. #INIESTASICS #IMoveMe #ASICS @asics_jp \n\nVery special day in this new stage of my career. Happy to be part of Asics family. #INIESTASICS #IMoveMe #ASICS https://t.co/GhhXnSuajz 🖐🏼✌🏼Enhorabuena @MarcMarquez93 por tu quinto título de MotoGP y tu séptimo campeonato del mundo.\nVaya carrerón!! Estás haciendo Historia en el motociclismo. \nA disfutarlo!! https://t.co/UdJ7XEQjpX Tough against the leader, great team. Lots of good things and others to improve. Victory will come. Thanks for the support. Come on @vissel_kobe! https://t.co/fJLxmIqjms Difícil contra el líder, gran equipo. Cosas muy buenas y otras para mejorar. Confiado en que la victoria llegará. Gracias por el apoyo! Vamos @vissel_kobe! https://t.co/zi4Sc8G9ke ⚽️💪 https://t.co/s0pToRQeW1 Dia internacional Contra el Cáncer de Mama. Todo mi apoyo.\n\nInternational Day against breast cancer. All my support. https://t.co/qvH9sYYM8d ⚽⚽⚽💪 https://t.co/7tnGm69wwf From Japan, i thank @SportCulturaBCN for the recognition that they have granted me for my sporting career.\nAlso thank you very much to Guillermo Amor and @FCBarcelona for collecting the prize in my name.  \n\n📷Daniel Loewe https://t.co/Qy1N7Xcs8V Desde Japón, quiero agradecer a @SportCulturaBCN el reconocimiento que me han concedido por mi trayectoria deportiva. \nMuchas gracias también a Guillermo Amor y al @FCBarcelona por haber recogido el premio en mi nombre.\n\n📷Daniel Loewe https://t.co/8MBJ2mUWty Me he unido a la familia Ariel!\nA partir de hoy además de goles también me marco Pods con Ariel 3 en 1! ¿Te unes a nosotros? #MárcateUnPod #Ariel3en1Pods https://t.co/16IIqZ14ij 🇯🇵⚽🔝AI https://t.co/qxAS9wcbiO Me uno a @Guaje7Villa en esta inicitativa contra el uso abusivo del plástico y RETO A MIS AMIGOS @ivanrakitic y @JordiAlba.  TÚ, ¿TE UNES AL RETO?\n1️⃣ Coge una bolsa y póntela en la boca\n2️⃣ Sube tu foto con #YoElijoPlaneta  \n3️⃣ Reta a dos amigos \n#PlanetaOPlastico @NatGeoEsp https://t.co/I3WwNuX5Rd ⚽️ @vissel_kobe https://t.co/kbXvOHEm0v ⚽️💪 @vissel_kobe https://t.co/A1qU5vjuEi 👏👏👏👏👏 https://t.co/4gEnHjTjRP Pasando el día en familia! #usj#minionpark @universal_jp \n\nFamily day! https://t.co/O2SzWWH7i9 No pudimos conseguir los tres puntos, pero esta debe ser la línea a seguir!! Gran trabajo equipo! Espectacular afición! #wearekobe @vissel_kobe \n\nWe couldn’t win, but this must be the way to follow! Amazing fans! https://t.co/QcW8tEZwiY 💪⚽️ https://t.co/O3mYpsq9ho Vendimia time 🍇 @BodegaIniesta #Fuentealbilla https://t.co/mcYVttETKL En Japón los #NissanLEAF están por todas partes, ¡la movilidad eléctrica, inteligente y 0 emisiones es imparable! 💪💪 Aquí os dejo de nuevo el spot que rodé junto a los amigos de #NissanElectric. #SimplyAmazing https://t.co/YFDVQStKmT Qué suerte poder conocer a uno de los maestros más grandes del fútbol!  #GraciasZico\n\nHow lucky to meet one of the greatest of all times! Thanks #ThankYouZico https://t.co/5ARALfiMGq Empezamos la semana con toda la fuerza e ilusión. Muchas gracias por vuestro apoyo incondicional. Juntos más fuertes. Vamos @vissel_kobe! \n\nStarting the week with strength. Thank you for your unconditional support. Together we are stronger. Come on @vissel_kobe! https://t.co/joInMRMxw6 💪⚽️ https://t.co/wrVEH0y2NQ Un padre, una bike,  679 kilómetros sin parar,  serán más de 60 horas...Todo ello para recaudar fondos que ayuden a la Investigación del cáncer infantil, si queréis colaborar,  mirar en El Reto de Pablo...\n\nhttps://t.co/ywJvGpiZIV Hola a todos! Feliz de presentaros mi nuevo canal INIESTA TV en Rakuten \n@Viki . Es un canal de vídeos donde podréis ver contenido exclusivo sobre mi día a día en Kobe. \nhttps://t.co/tg4mpvv8Wi\n\n🇬🇧https://t.co/M6QeAbgXhh\n\n🇯🇵日本語版はこちらから: https://t.co/dWoOSUoww9 https://t.co/2Ir7rPDJ1C 🏀🙌🏼 Merecido homenaje a una leyenda del Barça. Un gran capitán. Un abrazo fuerte desde Kobe!!\n 🔵🔴#GràciesNavarro https://t.co/NUauhfkAAz 💪⚽️ https://t.co/Twujr0mS1W En momentos difíciles juntos siempre! Vamos Vissel! 💪⚽️ @vissel_kobe \n \nIn difficult moments, always together! Come on Vissel! 💪⚽️ https://t.co/rFOugMxKJK 💪⚽️ https://t.co/KH3YjrdCMG Solidarity day together with our fans to collect funds for those affected by the earthquake in Hokkaido. Team and fans together 🇯🇵 @vissel_kobe https://t.co/SAG6EsQCQs Jornada solidaria junto con nuestros aficionados para recoger fondos destinados a los afectados por el terremoto en Hokkaido. Equipo y afición juntos 🇯🇵 @vissel_kobe https://t.co/4CDnyCHcTH Contigo ❤❤❤ https://t.co/3UUzV0DqLy Semana tranquila. Trabajando para mejorar!! @vissel_kobe \n\nEasy week. Working hard to improve!! https://t.co/pGkfrYRXpJ Truly a shame after how we played. We need to continue preparing for next game... there’s a lot of the season to play. Come on @vissel_kobe! https://t.co/gsro3de4wx Una lástima el resultado después de como fue el partido. Preparamos el siguiente partido a tope... a seguir hasta el final. Queda mucha temporada. Vamos @vissel_kobe! https://t.co/ugnCOa9i2o ⚽️⚫️🔴 https://t.co/njDnGiOJQH Yesterday was a tough moment with the cup elimination, but we are ready to play the league together with our fans... let’s keep working 💪🏻💪🏻💪🏻 come on @vissel_kobe! https://t.co/pQfjUu2KRX Ayer momento difícil con la eliminación de la Copa pero estamos preparados para afrontar la liga junto a nuestra afición... a seguir trabajando 💪🏻💪🏻💪🏻 vamos @vissel_kobe! https://t.co/Gvz3aXcxR6 Today is a very special day, after all these years and so many great moments together we meet again in Japan. So happy to see you again, my friend, I wish you all the best, @Torres! https://t.co/VekHFQIzVw Hoy, día muy especial, después de tantos años y tantos momentos juntos, nos encontramos en Japón. Muy feliz de volver a verte amigo! Te deseo todo lo mejor, eres un fenómeno, @Torres! https://t.co/XwR25ikEk6 ⚽️⚽️💪💪 https://t.co/wpTIbjRrpV Gran victoria para acercamos al objetivo!! Gran trabajo del equipo!! 👍😀\n\nGreat win to achieve our goal!! Amazing teamwork!! 👍😀 https://t.co/HMcknqxfTQ ⚽️💪 https://t.co/wWkZBqGuVM Un referente como jugador y persona! Una auténtica pasada verte jugar al Baloncesto todos estos años. Siempre gracias, amigo! #foreverNavarro #LaBomba https://t.co/mhcF24PwJW Siempre en el recuerdo ❤\n\nAlways in our memory ❤️ https://t.co/cjIqzmKjOi Thank you so much for every times that you made us enjoy. You are a spanish and worldwide sports legend. An example of work, sacrifice, proffesionalism and dedication. Best for the future, @alo_oficial! https://t.co/oKvzGToi5g Muchas gracias por todas las veces que nos has hecho vibrar y disfrutar. Eres una leyenda del deporte español y mundial. Un ejemplo de trabajo, sacrificio, profesionalidad y dedicación. Un fuerte abrazo y lo mejor para el futuro, @alo_oficial! https://t.co/HPXya4QC4W No conseguimos la victoria pero seguimos sumando!!! Gran trabajo!!!\n\nWe didn’t win but we keep going!!! Great job!!! https://t.co/uP8UfzKF2D ⚽️⚽️💪💪 https://t.co/PQD7Hd8Ej8 Muchísimas felicidades! Qué sea el primero de muchos en esta temporada 👏🏻👏🏻👏🏻👏🏻! Abrazo desde Japón @FCBarcelona 🇯🇵\n\nCongratulations! Hope the team wins a lot of trophies during the season 👏🏻👏🏻👏🏻👏🏻 https://t.co/a8mLdJtfTl Muy contento por la victoria de hoy! Vamoooooos @vissel_kobe! Ahora a por el partido del miércoles. Seguimos!! \n\nVery happy for today’s victory! Come on @vissel_kobe! Now heading for Wednesday’s game https://t.co/tHM1Aow6uF 💪⚽️ https://t.co/MuMWaZoN6Q Último entreno antes del partido de mañana! Vamos @vissel_kobe 💪💪💪\n\nLast training before tomorrow’s game! Come on @vissel_kobe 💪💪💪 https://t.co/YjZv94ZocI 9 años sin ti pero siempre estarás con nosotros. Te echamos de menos, Dani.\n\n9 years without you, but you will always be with us. We miss you, Dani. https://t.co/Lki6eIVPXO Un empate para seguir en la pelea! Muy pronto de nuevo con vosotros, compañeros!! 💪\n\nA tie to continue on the fight! Very soon I’ll be with you, teammates!! 💪 https://t.co/woBMpZdzK5 Grande equipo!! Muy feliz por mi primera victoria!!! Buenas sensaciones y más minutos!! Gracias por el apoyo!!! 💪 \n\nGreat team!! Very happy for my first victory!!! Good sensations and having more minutes!! Thank you for your support!!! 💪 https://t.co/cvJUcF2eKu 💪⚽️ @vissel_kobe https://t.co/FvQfKwPh4Q Un nuevo capítulo 👏👏👏 https://t.co/JYVXEIjy9s Sumando entrenos! Preparando el partido del sábado. Gracias a todos por su apoyo! 💪🌞\n\nKeeping up! Preparing Saturday’s game. Thank you all for your support! 💪🌞 https://t.co/vD4n3EwLtu Hasta estando en Japón buscando una polémica sin sentido... 👏👏👏\n\nhttps://t.co/eE2Ege5RL6 Very happy for my debut....although today’s negative result. Now we will keep working and preparing for next game. Thankful with the fans and teammates! Come on Vissel Kobe! ⚽️💪 https://t.co/TiHD3mEwWS Muy feliz por el debut...aunque el resultado haya sido negativo. Ahora seguiremos trabajando y preparnos para el próximo partido. Muy agradecido con toda la afición y compañeros. Vamos Vissel Kobe! ⚽️💪 https://t.co/ta1aqPsta5 Tercer día de entrenamiento. Gracias por vuestro apoyo 💪💪💪\n\nThird day of training. Thanks for your support 💪💪💪 https://t.co/wNRA0vi6aI Gran victoria 👏🏻👏🏻👏🏻 +3!! Yo también @Podolski10... recupérate pronto 💪🏻💪🏻💪🏻☺☺☺\n\nGreat victory 👏🏻👏🏻👏🏻 +3!! Me too @Podolski10, recover soon 💪🏻💪🏻💪🏻☺️☺️☺️ https://t.co/3sstKW5LTz Empezando el día... 😍❤ https://t.co/v2ZuVtkeiS ¡Gracias @fm_cases por el regalo! \nUn momento muy especial lleno de recuerdos 🇪🇸 ⚽ Podeis buscar la suya en https://t.co/4F4SnzEQA7 https://t.co/e7fjDDFVcL Te deseo lo mejor en tu nueva etapa! He disfrutado muchísimo viéndote... campeón dentro y fuera. Un abrazo amigo @26_DaniPedrosa! #3vecescampeon #respect #crack #ejemplo https://t.co/ia4lCj9Z6W Cuando ese balón entró, convertimos el sueño en realidad! Momento único! ⚽️🇪🇸 #Mundial2010 #Sudafrica #FIFAWordCup #8años #DaniJarque https://t.co/1C5NCNdrhJ Hasta el infinito 💗 https://t.co/G6fSxkZWae Feliz 6 aniversario!! 💘 Infinito! https://t.co/wfjnC8gx4y ⚽️🇪🇸❤️ https://t.co/KPg6qllkfr Seguimos preparando el partido del domingo!! 💪⚽️ https://t.co/9PxsLFPs6Z Sufriendo pero objetivo cumplido!!! A recuperar y prepararnos para el siguiente!!! 🇪🇸🇪🇸💪⚽️ https://t.co/l6MuvaJd2J 🇪🇸⚽️ https://t.co/tE6piGYPQL ⚽ ⚽ 🇪🇸 🇪🇸 💪🏻💪🏻 https://t.co/XTov6jvEUM Todo preparado para mañana!! 💪⚽️🇪🇸 https://t.co/xKia9Fl7RQ 🙏🏻🙏🏻🙏🏻🙏🏻 Todos mis pensamientos y preocupación por todas las personas afectadas.  \n\n🙏🏻🙏🏻🙏🏻🙏🏻 All my thoughts and concern for all the affected people. https://t.co/Et4Adls5LM Gran trabajo!! Grandes sensaciones!!! Equipo!! 💪🏻⚽️🇪🇸 https://t.co/SdHOoFfKvH Mañana es el día!! Toca debutar!!! Todos unidos!! ⚽️🇪🇸 https://t.co/b1hvzNfv4p Rusia ✈️ 🇷🇺 💪🏻 @SeFutbol https://t.co/Cz168EGQC5 Muy bueno!! Tercer capítulo 👏🏻👏🏻 https://t.co/pLGUaTzhR3 Un orgullo recibir este reconocimiento. Muchas gracias a todos. https://t.co/uybt1FFw9v Casi 5 millones de corazones en el mundo, y más de 30.000 en España, se apagan cada año a causa de la muerte súbita... \n\n¡Ahora le sacamos la lengua! 👅💙\nhttps://t.co/zn1ibO6Ct1\n#SacaLaLengua #Pirulate https://t.co/IwIhFHdDVi Buen test de preparación!!! Vamos España! 💪🏻⚽ 🇪🇸 https://t.co/9lZSPG615e Muchas felicidades 👏🏻👏🏻👏🏻👏🏻👏🏻 https://t.co/0ARW657gKq Muchas felicidades por la permanencia @AlbaceteBPSAD 👏🏻👏🏻👏🏻 Qué campeón!!! 3 añitos!!! Cuánta felicidad!!! #avapas #family ❤️❤️❤️ https://t.co/cdzjkr0H1U Pasándolo increible ayer en el @ReyLeonMusical! #cracks #TOP https://t.co/Z4vlb6PfER Mira qué partido tan monstruosamente divertido hemos jugado con la pandilla de #HotelTransilvania3 @sonypictures_es https://t.co/kWxhT2Hdx7 Recién llegado a Barcelona después de 3 dias increíbles! Gracias a todos!!! @vissel_kobe @hmikitani \n\nJust landed in Barcelona after 3 amazing days! Thank you all!!! https://t.co/7t98D6ES3j Días especiales!!! Gran recibimiento!!! Muchas gracias a todos!! @vissel_kobe @hmikitani \n\nBig and special days!!! Thanks for the welcoming!!! Thank you very much!! https://t.co/XxXiVmlB6E Rumbo a mi nuevo hogar, con mi amigo @hmikitani...🇯🇵⚽ ✈️ 🌍\n\nHeading to my new home, with my friend  🇯🇵⚽ ✈️ 🌍 https://t.co/xeXBw4GYfc Muchas gracias a todos! Os quiero!! \n\nThank you everyone! Love you all!! https://t.co/JGH1z1CNfG https://t.co/12yjgJCBXf Mi último partido con mi gente. Muchas emociones pero orgulloso de vivir un momento así. Siempre Barça! 🔵🔴 Último entrenamiento con mis compañeros ❤️❤️❤️ https://t.co/l5YjFHP1Qj ⚽ 🔵🔴 🇿🇦 https://t.co/3IchV8sVaq De viaje!!! ✈️ ⚽ @mterstegen1 @Carlesale10 https://t.co/2dun95BlMg Después del susto que nos hemos llevado todos esta mañana, quiero enviar un mensaje de apoyo y ánimo a todos los que estábamos hoy allí y esperar que los heridos se recuperen lo antes posible. Un abrazo a todos. @Chester_cuatro Noche muy especial la de ayer...  y que admiración por esta persona!! Muchas gracias a todos! @ElTransistorOC #iniestaeneltransistor #joanmanuelserrat https://t.co/dLhGNoeyUI I #EatLikeAPro. Let’s work as a team to prevent childhood obesity. Follow @Beko to know more about their commitment to help prevent this problem with @UNICEF using #EatLikeAPro https://t.co/PXnqCS9IYC Yo como cómo un pro. I #EatLikeAPro. Trabajemos en equipo para prevenir la obesidad infantil. Sigue a @Beko para saber más sobre su compromiso para ayudar a prevenir este problema con @UNICEF usando #EatLikeAPro https://t.co/rB6rmQSnc5 Gran tarde con mis amigos de @TAGHeuer! Un placer conoceros @Max33Verstappen y @danielricciardo! https://t.co/QdufUvmUnC Bonito día!!! Las secciones campeonas!! Gran partido, gracias por el cariño!! Siempre Barça!! 🔵🔴 https://t.co/hAdsRm02le 🔵🔴⚽️ https://t.co/BO6hHWHKA5 Gran clásico!!! Felicidades al equipo por el esfuerzo y a la afición por su energía!!! Siempre Barça!! Força Barça 🔵🔴 https://t.co/tdjX9at674 Muchas felicidades, Mami!!! Un ejemplo para nosotros! Gracias por querernos como lo haces... Te queremos!! #avapas #diadelamadre #tequiero https://t.co/yeBmHAzlRD Día especial!! Orgullosos como hijos de tenerte, madre!!! Eres única!!! Te queremos! 💘 https://t.co/tz5r5oobUg Mañana clásico... Mi último!! Fútbol siempre ❤⚽💪🏻🔵🔴 https://t.co/CJw3ANxQmw Existen muchos tipos de magia. Ahora tú también puedes hacer la tuya con la tecnología inteligente del nuevo Nissan LEAF. No tiene truco, ¡es #SimplyAmazing! ⭐️ @NissanEV_ESP https://t.co/zXGxSSd7cH @Porterito13 Ese día ni dormí... vaya faena me hiciste jeje No nay nada mejor que poder compartir los éxitos con los más importantes, nuestra afición! Gracias por estar siempre!! 🏆🏆🔵🔴🔝 https://t.co/wMiN646dXK Felicidad 🔵🔴! https://t.co/oxhUlwu42X Campeones 🔵🔴!! https://t.co/4TR1DpjfsB Mañana otro paso más!!! Força Barça! https://t.co/ETS9eurPAL Hoy ha sido un día que estará marcado siempre en mi vida. Solo puedo dar las gracias a todos. Innumerables muestras de cariño y afecto que tendré siempre en mi corazón. A todos y cada uno de vosotros, GRACIAS. #siemprecule #micasa #quebonitoesestedeporte #agradecimientoeterno https://t.co/oLsNUDCXxd Felicidades 👏👏👏👏❤️❤️📺 https://t.co/TgcDXwUsVn Cuatro años sin ti.\nTe echamos de menos 💙❤️ https://t.co/KpzLwOCJI8 👏👏👏👏👏👏 https://t.co/4d6y9Ol7wH Muy pronto compartiré aquí el anuncio que rodé con el nuevo #Nissan #LEAF. ¡Os dejo un pequeño avance en exclusiva para vosotros! \n￼😉 #SimplyAmazing https://t.co/5VHSFc9jyg 🌹 🌹 🌹 📖 📖 📖 ❤❤❤ #santjordi #familia #orgullo #amor #gratitud #avapas https://t.co/ayJrxlub7C 🙌🏻🔵🔴🏆 https://t.co/t3zT2pFKa2 LA FINAL. Un título, ilusión y compromiso! Todos juntos! Força Barça! https://t.co/mpRZANT2Pp Esta noche de cine en casa con @RakutenTV_ES. Hoy veremos en familia  🎮 “Jumanji: Bienvenidos a la Jungla”🎮  https://t.co/9xC1UML6ug https://t.co/SDfBb7jdgc Hace unos días estuve rodando un anuncio del nuevo #Nissan #LEAF 100% eléctrico junto a mis amigos de @NissanEV_ESP. ¡Es Increíble la tecnología inteligente del coche! 👏#SimplyAmazing https://t.co/etRUoPjjGy Seguimos sumando hacia nuestro objetivo! 🔵🔴 https://t.co/2bDtz0thkv Qué personajes!!! Pero qué grandes!!! Fenómenos!!! 👏👏🔵🔴 https://t.co/drVoTdo7WP #recordando #inicios https://t.co/WWUjgQUePh Gran paso hacia nuestro objetivo!!! Felicidades a todos porque no era nada fácil!! Gracias afición siempre 🙌 🔵🔴 https://t.co/tVdoITUgf1 Difícil de asumir lo pasado pero nos quedan retos por conseguir y hay que ir a por ellos. Más juntos que nunca. Força Barça #orgullosodesercule https://t.co/lhqOfsaJG5 Un pasito más!!! Força Barça!!! https://t.co/AcJGoDLDJw ⚽️⚽️🔵🔴 https://t.co/OaojdvG85O We try different adventures in life but our passion ultimately chooses our destination. What counts is our determination. \nThere is a first time for everything. Join UFX today. https://t.co/NHKMu2EAe9 https://t.co/LnDWi6pfWe En la vida probamos diferentes experiencias, pero, en realidad, nuestra pasión marca nuestro destino. Lo que cuenta es la determinación.\nSiempre hay una primera vez para todo. Únete a UFX https://t.co/NHKMu2EAe9 https://t.co/5guCvvYtJA Recuperando el esfuerzo de ayer!!! Esto no para!!! Força Barça 💪🏻💪🏻 https://t.co/rZLlCjQjsA Muchas felicidades, reina de la casa!! 7 añazos!! Que felices nos haces y qué orgullo verte crecer como lo haces! Te quiero infinito!  💕 💕 https://t.co/EuCTuUErOT Feliz pascua junto a las mejores madrinas!! 🙌🙌 ❤❤ https://t.co/35LGxXgWyg ⚽️⚽️⚽️ https://t.co/Ksnrm7rddl Partido difícil! Seguimos sumando y restando jornadas! Força Barça! https://t.co/wAnP1qKbtJ Vuelve @LaLiga! Força Barça!💪⚽ https://t.co/EnrmaIZ6Qr Vuelta a los entrenamientos!! Preparando el próximo partido! Força Barça! https://t.co/0uttdXcWXX Mucha suerte 🔵🔴!!! https://t.co/o2ToYCX5Mg No podemos olvidarnos de una de las mayores crisis humanitarias, la de los Rohingya. 400.000 niños y niñas #TienenNombre y necesitan nuestra ayuda, entra en https://t.co/QsVyzhFTI4 @SaveChildrenEs https://t.co/xeOCnWgoce Gran partido y gran ambiente!!! Felicidades equipo!! 💪⚽️🇪🇸 https://t.co/jchkKDOV9d Mañana día de partido! ⚽️🇪🇸 https://t.co/0V6Fk4z3Rp Tu legado va más allá de todo lo que nos enseñaste en el campo... #cruyfflegacy @JCFoundation https://t.co/Pvul8FvUwA Buena prueba de cara al Mundial ⚽️💪 https://t.co/38p06PRE2z Rumbo a Alemania con unos fenómenos!! Vamos España 🇪🇸 https://t.co/L8kmIGISZZ Hermano, eres un crack!! Muchas felicidades! Un placer compartir cosas contigo siempre!!! https://t.co/nn28D7t8sY Mucha suerte @annetavives! Seguimos sumando!!! https://t.co/RSMlLvzst2 No se puede explicar con palabras! Nuestra vida! Avapas💕 https://t.co/eNG55nNJOa Feliz día, PADRE! Gracias por estar presente siempre! Agradecimiento eterno! Único! Tq https://t.co/nbwESplEVj Gran paso hacia el objetivo final! Empieza la cuenta atrás, 9 partidos!! Força Barça! https://t.co/YJuXt23eTU ⚽💪🏻 https://t.co/46Xq9aHyRN Gran eliminatoria por delante! Força Barça! 🔵🔴💪🏻 https://t.co/SqLVyiB6Lo 😄😄😄 https://t.co/1FHuUUCfVq Gran noche ayer 💪🔵🔴 https://t.co/5adgmyLweC Vamooooos! Equipo y afición enormes!!! Seguimos 💪🏻💪🏻💪🏻🔵🔴 https://t.co/YQoxc31xjn Todos preparados para mañana!! Força Barça 💪🏻💪🏻💪🏻🔵🔴⚽ https://t.co/grFhryttsl Espectacular 👏👏👏 @manuelcarrasco_ @MiguelPoveda https://t.co/0gAGOEnK6i Grande equipo +3 y seguimos sumando para el objetivo! 🔵🔴 https://t.co/G05MMrA9Ha Cada día más cerca 💪🏻💪🏻💪🏻⚽⚽⚽ https://t.co/0OCif7VQ1V Hoy toca noche de peli en familia con @RakutenTV_ES 🎬!! Hemos elegido 🔨 “Thor: Ragnarok” 🔨 https://t.co/e6p6qocDdy https://t.co/yPspk2DBcl ❤️ https://t.co/IYhiJSHZHr Mi vida 💑❤️❤️❤️ https://t.co/Px7NCxeXth RT @mbyjm86: APÚNTATE !!! #aixetes2018 https://t.co/NIINLifWJC Grandísimo esfuerzo ayer!!! Un paso más, un día menos... Força Barça!! 💪🏻💪🏻 https://t.co/QWd0fBJBof Golpeado por la noticia de la muerte de Davide Astori. Todo mi cariño para la familia, amigos y a todo el fútbol Italiano. DEP 🙏🏻\n\nVery surprised and hurt because of the passing away of Davide Astori. All my support to family, friends and italian football. RIP 🙏🏻 https://t.co/2MmsAnhcEy Recuperando fuerzas para el partido del domingo! Força Barça! 🔵🔴 https://t.co/E17nMvownu Dejamos de sumar dos puntos. Recuperar bien para el domingo! Seguimos! Força Barça 💪 https://t.co/zJKciXjqCi Último entreno antes de viajar hacia Las Palmas. Seguimos, que esto no para! ⚽🔵🔴✈️ https://t.co/wudkdXo52U Te echaremos de menos, Brujo. DEP. 🙏🏻 Mi pésame a la familia y amigos https://t.co/UuTNEH47T6 Hoy con un poco más de frío ⚽❄☃ https://t.co/FVcQ68EHRP Visita obligada a mi amigo @SesiMS81 y a su proyecto @smashpadelin! Por fin llegó el día 😬😬😜😜🙌🏻 https://t.co/UtMdgCJvqx 💪💪🔵🔴 https://t.co/w706LvWrMk 🔵🔴 https://t.co/960hzlsyDB Durísimo partido e intenso!!! Grandísimo trabajo del equipo!!! Esperando la vuelta con nuestra gente! Força Barça!!! https://t.co/HRTrOM9tDs Mañana toca Champions! Vamos equipo!!! Força Barça!!! https://t.co/WfxW8wXZxR Muchas felicidades @FCBbasket!! 👏🏻👏🏻👏🏻👏🏻👏🏻 https://t.co/4s5nz8Qt1i Tres puntos muy valiosos delante de un equipo que lo puso muy difícil. Grande Equipo!!! https://t.co/9VEfSo3pS4 Mucha fuerza para todos los valientes que luchan cada día contra esta enfermedad! https://t.co/kb0q3bHWT0 Disfrutando estos dos días libres en familia en la montaña 🙌🏻🙌🏻🙌🏻 https://t.co/JHfTTqn4Ae Nos dejamos dos puntos, una lástima. Ahora a recuperar esta semana y a seguir!!! Confianza siempre! 💪💪 https://t.co/qFzkWxN6r0 Entreno previo al partido de mañana!! Concentrados en seguir nuestro camino! Força Barça! https://t.co/tbbutyemhd Grande #YerryMina, me alegro por tu debut! Por muchos partidos y momentos buenos!! 💪🏻🔵🔴 https://t.co/ZazTg6FJUx A LA FINAL!! 💪🏻💪🏻🔵🔴 https://t.co/rvTWUKO5nd Todo preparado para mañana!!! A un paso de otra final! Vamos equipo! Força Barça! 💪🏻💪🏻 https://t.co/mKoJKtd00w Grande @plarrazabal! https://t.co/5AuI49vzE4 Recuperando bajo la lluvia!!! Equipo!!! 💪🏻💪🏻 https://t.co/Sfe4cCKjKU Derbi intenso! Gran esfuerzo equipo!!! Seguimos!! https://t.co/qN0UxfJzVR Artes marciales con el balón! 🤞🏻💪🏻🤫 https://t.co/MdujuNFAYo Recuperando fuerzas para el derbi del domingo https://t.co/2dAM0ntQ1U Primer paso hecho aunque nos quedan aún 90 minutos dificilísimos. A seguir!! 🔵🔴⚽⚽💪🏻💪🏻 https://t.co/duJKNEQT61 Mañana primeros 90 minutos de la eliminatoria! Força Barça! https://t.co/gTQ4TmLc01 Listo para ver el @salvadostv de ayer. Lección de vida. https://t.co/6a9mfY49R7 Partido duro y sufrido pero conseguimos el objetivo de los tres puntos!!! Gran esfuerzo!! Força Barça! https://t.co/nYmZaFCJjG Mañana nuevo partido de liga en casa! 💪🏻⚽🔵🔴 https://t.co/MEyXyoMs0y Ha sido un auténtico placer compartir vestuario estos últimos 8 años... has sido un ejemplo siempre de profesionalidad y compañerismo. Te mereces lo mejor. Un abrazo muy fuerte amigo... echaré de menos nuestras charlas, @Mascherano! https://t.co/1okx2Ou0To Grande equipo!!!!! A semis!! https://t.co/zZqhEThzEB Día de emociones intensas junto a @Mascherano. Mañana será muy especial. Esperemos poderlo hacer completo!!! #GraciasMasche #ForçaBarça https://t.co/6VzsdlMHJv Mucha suerte en vuestra nueva etapa, compañeros!!!! Os deseo lo mejor!!! 💪 https://t.co/OHGt2zj5qO Tres puntazos más! Grande equipo, grandísimo trabajo!!! Força Barça! https://t.co/hVzwwQ86v6 Felices 55 ❤❤❤! Orgullo como hijo. https://t.co/SLoo3hHmDt Magia en mayúsculas! Compartir vestuario contigo fue espectacular! Gracias por tu fútbol, @10Ronaldinho https://t.co/xkSYK1nQpE They say there’s a first time for everything, I don’t think american football is my best ☺️☺️ Enter @ufx and discover more #TheresAFirstTimeForEverything #commercial #onlinetrading https://t.co/IZmWGogQq8 Dicen que siempre hay una primera vez para todo, no creo que lo mío sea el fútbol americano ☺️☺️. Entra a @ufx y descubre más #SiempreHayUnaPrimeraVezParaTodo #comercial #onlinetrading https://t.co/MMCodGyTnA Hoy hemos visitado a los pequeños de @vallhebron y he conocido el proyecto “Contigo como en casa”. Es vital que las familias estén con sus hijos y puedan contar con el apoyo de profesionales. Creemos el nuevo Centro de Neonatología \nhttps://t.co/uw1KK2PNZj \n#BornToBeExtraordinary https://t.co/1BDqW2ZT8x Mucha suerte compañeros 💪💪🔵🔴 @FCBarcelona #CopaDelRey https://t.co/EbgaVEBBwW Grandeeeeeee! Terminamos la primera vuelta ganando en un campo que se nos resistia! A seguir! Força Barça 💪🏻💪🏻💪🏻🔵🔴 https://t.co/0L1UN2HoY8 ⚽⚽⚽💪🏻💪🏻💪🏻 https://t.co/HAX0lAKR4m Gran partido!! Objetivo cumplido!!! Ya estamos en cuartos 💪🏻💪🏻🔵🔴 https://t.co/jy6snFL6kA Vuelve la Copa 🔵🔴💪🏻⚽ https://t.co/pSiJHKIXuJ Bienvenido @Phil_Coutinho! Un placer tenerte en Can Barça, crack! https://t.co/fmQ7TZNrHt Seguimos sumando de tres en tres!!! Grande equipo!!! Bonita cifra!  💪🏻💪🏻🔵🔴 https://t.co/GBJ8dJLsBb Felicidades fenómeno!!! Te deseo todo lo mejor siempre, lo mereces!!! 🔝 @DenisSuarez6 https://t.co/KQPhlCfrwj La noche más mágica del año... qué sea muy especial para todos! ❤🤴🏻 https://t.co/yeTb1MHXvQ Buen resultado de cara a la vuelta en nuestro campo! Grande equipo! Força Barça https://t.co/66dKwsRRZ4 La mejor manera de empezar el año, con este equipazo y disfrutando!!! ❤ https://t.co/pHJZcenmrV Feliz 2018!!! Mucha salud para todos ❤❤#lomejor #felicidad #family https://t.co/uRpbaEKsTl Despidiendo el 2017 👋🏻 @AnnaOrtiz34 ❤❤❤❤❤ https://t.co/2oVJ8eykJr Último entrenamiento del año!!! https://t.co/RDMw8nstK2 Vuelta a los entrenamientos para despedir el año!! 💪🏻💪🏻⚽⚽ https://t.co/o6JDOoNtIC Muchas felicidades 👏🏻👏🏻👏🏻👏🏻👏🏻 https://t.co/TWmsRyWISs Esta Navidad @CocaCola_es nos recuerda que #EstamosMasCerca de lo que creemos, descubridlo! \n\nhttps://t.co/DZlSIJAD1O https://t.co/xXhY6FdgSJ Desafiando el frío manchego con los pekes!!! https://t.co/JMgE6ApxdA Para estas fiestas en @BodegaIniesta tenemos una sorpresa, ¿quieres jugar un partido conmigo? Participa! 👉🏽 https://t.co/tXT4hBPdcg https://t.co/cuKYPylMYP La mejor manera de terminar el año! Grande equipo! Seguimos!! Força Barça!!!\n\nThe best way to end the year! Great team work! Força Barça!!! https://t.co/TZKOPJZ5N7 15 años de un día mágico... debut en la @LaLiga!! #losañospasanparatodos https://t.co/miA06g5g3h El juego ha evolucionado. ¡@marcoasensio10, nos vemos en el #ElClásico! #JumanjiLaPelícula https://t.co/7OGvFohrRH Contento de organizar junto a @BodegaIniesta este sorteo. ¿Te animas a participar? Haz click aquí  👉🏼\nhttps://t.co/tXT4hBxCkI https://t.co/8ZAOM8rpha 🔝 https://t.co/KBUVb9rb7V +3 seguimos sumando! Força Barça! 💪🏻⚽ https://t.co/Me9RJglrPo Todo preparado para mañana!!! Força Barça!!! 🔵🔴 https://t.co/bZ0qDTN9j8 Con ganas de tu vuelta al equipo, @Dembouz!!!! https://t.co/kzaWcjbBfm Un orgullo poder presentar junto a los míos, el nuevo “Corazón Spumante Moscato”! Gracias a todos! @BodegaIniesta https://t.co/GtL1skHvpl Mi autobiografía sigue abriéndose paso por el mundo! Muchas gracias a todos! #lajugadademivida #theartist\n\nMy autobiography is still on its way to all the world! Thank you all very much! #theplayofmylife #theartist https://t.co/0q9dAolusU Día muy especial a tu lado!!! 31 años!!! Felicidadessss!!! Eres única! Felicidad total contigo!!! Avapas! ❤ @AnnaOrtiz34 https://t.co/F7owZLD4MZ Duro y apasionante enfrentamiento! Força Barça! https://t.co/o9t3XgU4N8 +3!! 💪🔵🔴 https://t.co/zoaGTd22cK 💪💪 https://t.co/5GmQcfftVn Un año más con mis amigos de @EstrellaDammCat...\nhttps://t.co/pEjlyBEDQP https://t.co/wcJZSMe3ZA Empezando el día con energía!!! #Elgorriaga 💪 https://t.co/PMvGNnCjcd Victoria✌️!! Esperando rival en el sorteo!! Força Barça! Lástima el resultado, lo intentamos hasta el final. Confianza! Seguimos! Força Barça https://t.co/miflkiv5RM Apasionante 🇪🇸 💪 https://t.co/5a4W68l2sp Esta Navidad voy a cambiar mi equipación por una buena causa. Súmate tú también al #ChristmasJumperDay de @SaveChildrenEs \nhttps://t.co/MQVDcECFRp https://t.co/7GTAkonRti Hace unos días visité a mis amigos de @Dormity_com para ver como trabajan, son unos cracks. ¡Yo ya tengo el mío en casa! 👌 https://t.co/tVqx6HX6uo Clasificados para la siguiente ronda, esperando rival en el sorteo! Força Barça 💪💪 https://t.co/DH4VZAxkAz Antes de cenar y descansar, aprovechando para jugar con los peques de casa... bueno y yo también ☺☺🤣🤣 https://t.co/xVTDijGSd5 Seguimos sumando, hoy en un campo muy difícil! Força Barça!!💪🏻💪🏻💪🏻 https://t.co/GPJJ0NhQu5 Visita complicada mañana en Mestalla. Força Barça!!! 💪 https://t.co/sXZxke81in Muchas felicidades, Juan Carlos. Un placer poder acompañarte en un día tan especial!! 🙌🏻🙌🏻🙌🏻 #20años #labomba #FCB https://t.co/l54WPsiBwR RT @SalvaVidasFacil: Salvar vidas es fácil, con 10 sencillos pasos cualquiera puede ayudar. ¡Comparte este hilo! #SalvarVidasEsFácil https:… Gran trabajo! Objetivo cumplido!!!! 👍 Força Barça https://t.co/gn6N6B438E Mañana Champions 💪🏻💪🏻💪🏻 https://t.co/Sep0OQLMyz Es fantástico haber rodado con el equipo de @ufx. Hay una primera vez para todo.\n\nGreat to be on set with @ufx. There’s always a first time for everything. https://t.co/JY6kTU6KWX Hace unos días pude conocer de cerca el trabajo de @SaveChildrenEs contra la pobreza infantil. En el #DíaDelNiño comparto las sonrisas que me regalaron https://t.co/Ksgw5nQq32 Nuevo challenge con @sonyxperiaes, ésta vez con @JuanArroita y va de regates ☺☺  #iniestaXZ1challenge https://t.co/YV0cJ9WDpX Grande equipo, seguimos,+3!! Ahora para casa y a recuperar. Força Barça 💪🏻💪🏻 https://t.co/CharlA0IYI Todo mi apoyo a la Asociación de Niños Prematuros y al Hospital MaternoInfantil @vallhebron que organizan este bonito acto para conmemorar el Día Internacional del niño prematuro #OrgulloDePadrino https://t.co/7GXqOwrJJ5 https://t.co/cqyXaxbPoT En casa, de vuelta al trabajo! Objetivo próximo partido!!! 👍 https://t.co/Mrd7KY0Qco Vuelta para casa después de los partidos amistosos con la @SeFutbol  🇪🇸🇪🇸. Con buenas sensaciones!!💪💪 https://t.co/DP1Dg2123x 💪🏻🇪🇸 @SeFutbol https://t.co/95ZCaVXked Enorme @marcmarquez93!! Muchas felicidades!!! 👑 https://t.co/oteUNrowLE Buena victoria✌🏻!!! Vamos @SeFutbol 🇪🇸🇪🇸 !! Con mi compi @Thiago6!! https://t.co/UhMeCqFOO1 Gracias por tanto fútbol, maestro!!!!🔝 👏👏👏 @Pirlo_official https://t.co/3mC5UdSlpW Comienza semana con la @SeFutbol para preparar estos dos amistosos 💪🏻💪🏻!! https://t.co/CF7hTh1lk8 Gran trabajo +3!!! Força Barça!! https://t.co/oPRvs5iIV9 Vuelve @LaLiga 💪🏻💪🏻!!! Força Barça!! https://t.co/CSIrHhv4NE #15 años de un día inolvidable y un sueño hecho realidad. Força Barça! @FCBarcelona https://t.co/rr7EeyXB3J +3! ✌ Grande equipo! Força Barça! https://t.co/2UxuBupuZs Orgulloso de todos vosotros @SeFutbol sub17! https://t.co/S0eqvtyEC2 Preparando a tope el partido de este sábado! Força Barça! https://t.co/NB4X6lzTaL Felicidades compañeros... eliminatoria encarrilada, queda la vuelta en el Camp Nou! 💪🏻💪🏻⚽ Orgullosos de ser padrinos del proyecto de @vallhebron para el nuevo centro de Neonatologia https://t.co/7GXqOwrJJ5 #BornToBeExtraordinary Un placer compartir este día contigo #LeoMessi https://t.co/9biSby6xXN Ready! #TheBestFIFA https://t.co/M7cQTbMc3a El camino es lo importante, y a vuestro lado, no puede ser mejor. ❤❤❤❤❤ @AnnaOrtiz34 https://t.co/DJt9ZlNqmM Buen esfuerzo. Seguimos!! https://t.co/d6SG2QVudn Esto no para, mañana @LaLiga contra el Málaga. A seguir nuestro camino! https://t.co/k6p7GFK5fi Mi apoyo, cariño y admiración para todas las que lucháis cada día. Hoy y siempre, mucha fuerza!!\n#DiaMundialDelCancerDeMama https://t.co/5kGnkuhOJO Tres puntos más que nos afianzan en el liderato! Buen trabajo!!! Gracias 👏👏👏 Força Barça https://t.co/OaqvpECAmv Último entreno antes del partido de @ChampionsLeague de mañana! Força Barça 👍🏻💪🏻 https://t.co/fkWht7eQ7J Mucho ánimo a todas las víctimas y afectados. #fuerzagalicia #fuerzaasturias  #fuerzacastillaleon #fuerzacantabria #fuerzaportugal https://t.co/fLU2I8JbDJ Encarando la @ChampionsLeague! https://t.co/Zaja7LNyyK Hasta el final lo intentamos en un campo complicado!! Gran trabajo!!! Seguimos. Força Barça! https://t.co/zgR1caUKje Vuelve la @LaLiga en un partido bonito y complicadísimo! Força Barça! https://t.co/v9OGAN9aN5 👏🏻👏🏻👏🏻 https://t.co/SIPlaXDeee Trabajando para tener buenas sensaciones de cara al partido del sábado https://t.co/GSDjCcR3pv Broche perfecto a la fase de clasificación para Rusia! Grande equipo! 🇪🇸 🇪🇸 🇪🇸 🇪🇸 Grande Sergio por esos 100!!!! https://t.co/DDBLct8d9B Grande compañeros clasificados para el Mundial #Rusia2018!!!! @SeFutbol 💪🏻💪🏻⚽⚽👏🏻👏🏻🇪🇸 https://t.co/25uEEoSht0 (3/3) Espero poder seguir aportando todo a estos colores y que os sigáis sintiendo orgullosos. https://t.co/U66P4hG7X9 (2/3) Es difícil explicar con palabras tantas emociones. Muchas gracias por tanto pero sobre todo por vuestro cariño, confianza y respeto. (1/3) Desde que llegué con 12 años a este club he vivido muchísimos momentos mágicos. Hoy a sido uno de ellos. Felicidades papi!!! Un año más celebrándolo y felices!!! Tq padre! #familia #felizcumpleaños #nietos https://t.co/Uw9fVwwZef Hoy 10 añazos!Impresionante pero más saber que a tu lado todo es mágico!10 años después mis sentimientos se siguen multiplicando@AnnaOrtiz34 https://t.co/3rhuKTPNij (3/3) Háganlo por todos nosotros. Merecemos vivir en paz. (2/3)... y una cosa tengo clara, antes de que nos hagamos más daño: Dialoguen, los responsables de todo, dialoguen. (1/3) Nunca he valorado públicamente situaciones tan complejas con sentimientos diversos pero esta situación que vivimos es excepcional... Entreno prepartido! Mañana en casa con nuestra gente! Força Barça!! https://t.co/ha3De4icu3 Contento de anunciar este sorteo con mi Bodega.¿Quieres asistir a un partido y que nos conozcamos?¡No te lo pierdas! https://t.co/pUEdEYcPEE https://t.co/YYeYRAOdJH Victoria durísima!! Gran trabajo!!! Volvemos felices a casa!!! Força Barça!!! 👍 https://t.co/kMcqUKJxcI Vuelta a los entrenamientos pensando en el miércoles!!! Força Barça https://t.co/sXNE2eoGdy Pocas palabras para describir tanta felicidad y orgullo. Juntos siempre! #Family #Avapas https://t.co/RUCgAzuhGP 🎂 ¡Feliz cumpleaños, #CampNou60! Por muchos más momentos mágicos juntos! @FCBarcelona https://t.co/afjqMv08Kx Seguimos sumando, grande equipo! De vuelta a casa y a pensar en la Champions! Gracias por el apoyo y cariño. 👍🏻💪🏻⚽ https://t.co/EqKWUSJF59 Bonito partido mañana!!!! Força Barça!!! @FCBarcelona @LaLiga @GironaFC https://t.co/oYkcVGhgvG Mucha fuerza a toda la gente que sigue ayudando y trabajando en las labores de búsqueda en México. Mis pensamientos siguen con vosotros. https://t.co/okBtY3jeCF Nueva victoria. Gran trabajo de todo el equipo💪 Seguimos! Força Barça! @gerardeulofeu #Busquets https://t.co/e1xVxHiOqG Entreno y mañana partido en casa contra el @SDEibar! Esto no para.  Força Barça!! @FCBarcelona @LaLiga 💪🏻💪🏻💪🏻 https://t.co/EuqRh8vPEv Parece que fue ayer y han pasado 21 años desde que llegué a la Masia, al mejor Club del mundo. Gracias por tanto! #todaunavida https://t.co/sBL3VGSDZQ Día de recuperación! Muchas felicidades @paulinhop8 por tu primer gol como blaugrana... que sean mucho más, crack! https://t.co/8yzHGwmyOy Complicadísima victoria ✌. Gran trabajo equipo! Seguimos! Força Barça. https://t.co/rAjqMvV3bf Entreno bajo lluvia para preparar el partido de mañana en Getafe! Força Barça! https://t.co/v5kI19KZPP Un orgullo como capitán y culé acompañar al club en este día tan especial. Primera piedra del nuevo estadio Johan Cruyff. https://t.co/MIRRNJYQov Gran comienzo de competición con un ambiente increíble!! Força Barça! Seguimos! 💪🏻💪🏻💪🏻 https://t.co/64220Yemqh Vuelve la @ChampionsLeague! Gran partido y con la ilusión de hacer una gran competición!! https://t.co/PP7xkrAMIz Feliz Diada! https://t.co/7JQgts37ma Siempre hacia delante! 💪🏻💪🏻 https://t.co/b5tKav4Es5 Gran partido! Siempre especial ganar el derbi!!! Seguimos! Força Barça! #Semedo https://t.co/2WiKDQVmfK Vuelve @LaLiga!! Força Barça!!!!! https://t.co/xGhMsBIQIK Vuelta a los entrenamientos! Preparando el derbi del sábado! 💪🔵🔴 https://t.co/0Ocbvgsqqj Gran victoria para cumplir nuestro objetivo!!! Grande equipo!!! https://t.co/WM0mofkZYV Grande equipo!!!! 3 puntos muy importantes y seguimos!! 💪🏻🇪🇸@SeFutbol https://t.co/08YnS6vzfg Esta tarde con mi amigo y paisano, Juanra. Mucha fuerza en la lucha contra la ELA, tenéis todo mi apoyo! #Adelante #laELAexiste https://t.co/4na5KjkzTj Muchas felicidades Paco!!!! Grande crack!!! @paco93alcacer 👏🏻🎉 https://t.co/JFV7vL5W8y Empezamos la semana!!! Grande Guaje! @Guaje7Villa @SeFutbol https://t.co/0FGMkHfbGn Felicidades hermanita!!! Un placer compartir un año más junto a ti!! La mejor!!! #hermanatop #familia #cumpleaños https://t.co/diPT2DN4DC Con mi compi Paco!!! Después de una buena victoria!!! 💪 Força Barça! @paco93alcacer https://t.co/Bb3DA48qNq Último entreno antes del partido de mañana! A tope! 💪🏻⚽⚽✈️ https://t.co/c6jozpt3qD Vamos Barça 💪🏻💪🏻💪🏻\n\nLet's go Barça 💪🏻💪🏻💪🏻 https://t.co/tWEBy4iVte Preparando próximo partido!!! Ready!! https://t.co/EzJVGXfkd7 Muchas felicidades compi! Pura dinamita #AleixVidal #28 https://t.co/QM8QHDuKzV El balón!\n\nThe ball! https://t.co/Q38JF0uogs Mañana empezará el reto de volver a conquistar @LaLiga!!! Todos juntos! Força Barca! #Barcelona ❤ https://t.co/jzB8AV1r9q Todos consternados por lo que ha pasado y las noticias que siguen saliendo desde nuestra ciudad. Todo mi cariño. https://t.co/CIhEKncx4A Preparados 👊 https://t.co/Csvc2IL1Rk Siempre nos iluminaras ❤ https://t.co/dkGjEbXxqq Buenas noches!!!\n\nhttps://t.co/1h3JbHLpVB Bonita cena la de ayer y grandes momentos juntos!! 👏🏻❤️ https://t.co/r7TkBWvgnn Siempre en el recuerdo, amigo https://t.co/ILGmGysXPP Presentación del equipo!!! Buenas sensaciones!!! https://t.co/sD679wL5dH Sesión de trabajo!!! 👊 https://t.co/52RnistZIp Nuestros caminos se separan pero nuestros sentimientos seguirán uniéndonos. Toda la suerte en esta nueva etapa.Eres grande! Un abrazo Ney 🤙🏻 https://t.co/YvjsHTFymd Siempre eterno, 12 + 1. Descansa en paz Angel Nieto. https://t.co/npVoVpBcw6 Mucha fuerza para todos los que estáis trabajando sin descanso en el incendio que está afectando Yeste y sus alrededores. #niunincendiomas Last game in the USA, thank you for your support! Tomorrow we head home preparing next season! https://t.co/aJdPnWLeRk Último partido en Estados Unidos, gracias por tanto cariño! Mañana en casa y a seguir preparando la temporada! https://t.co/ToQmawlIJL Seguimos sumando sensaciones y trabajando cada día! Vamos Barça!! https://t.co/geD6oFiTJr Esta mañana bajo la intensa lluvia! Buena sesión!!!! https://t.co/b55db8KSsc Happy to announce my new partnership w/ @UFX. Join me to achieve your goals w/ smart trading &amp; #MassInsights. https://t.co/a8A9v4x3Fq https://t.co/eOpvSeqxlW Feliz de anunciar mi colaboración con @UFX. Únete y alcanza tus metas con un comercio inteligente y #MassInsights https://t.co/a8A9v4x3Fq https://t.co/YrQgxDFkrK Día perfecto!!! De visita por New York disfrutando de la mejor compañía!!! #familia #losmejores #disfrutarcadamomento https://t.co/Ps2tSeWqTX Después del primer partido de pretemporada disfrutando de unas vistas 🔝! Con mi compi @ivanrakitic https://t.co/b6fpzCho2y Primer entreno de la gira!! Seguimos la preparación!!! 👌 https://t.co/RaW3ptASCo Entrenamiento y viaje a New York!!! Con el gran Aleix https://t.co/FQt57GfAOe Empieza la última semana!!! Que lo disfruteis!!! https://t.co/H7IKCVCSrQ Muchas felicidades amigo! Compi!! Un placer compartir tantas cosas a tu lado!!! Grande! https://t.co/j0OwcBlB2a 💪🏻💪🏻💪🏻⚽⚽⚽ https://t.co/KPiOMqcv8K Primer entrenamiento de esta nueva pretemporada finalizado! Força Barça!! https://t.co/YHC2TeH6r2 Muy contento de haber podido disfrutar esta mañana con los niños y niñas de mi campus! https://t.co/smnMoKA8qo Gran noche, con las mejores personas!!!! #familia #fuentealbilla #vacaciones https://t.co/4XLpBcSuGc El 11 de Julio siempre estará grabado en nuestros corazones. @SeFutbol #campeonesdelmundo #sudafrica2010 https://t.co/OSjQQ0Q8IZ Feliz de poder inaugurar el campo de fútbol que me vio crecer gracias a la @FundacionCruyff @FundlaCaixa y @FundacioFCB #CruyffLegacy https://t.co/WmCIgDOV3Q Hoy hace 5 años del momento más especial y espectacular que he vivido!!! Gracias por todo!!! Te quiero!! https://t.co/I2KTjx1J54 Matinal por el pueblo con estas dos liebres!!! https://t.co/40HZyYUIck #paoloandrea #amordepadre #8 https://t.co/rTksKhftfE Con mis amigos de @Dormity_com estamos preparando un juego... Participa y pronto nos podremos conocer!\n👉 https://t.co/2XORQB0hx5 Mañana empieza la cuarta edición de mi campus! Nos vemos pronto! \n👉🏻 ⚽ https://t.co/VtP367PMjP PES2017 Ambassador Icon campaign is now live on Android -  win me for your team! Download here: https://t.co/I32wISIXYQ https://t.co/q2rG1HEfkz Ya puedes tenernos en tu equipo PES2017 para Android!  https://t.co/I32wISIXYQ https://t.co/Vj0LB4gqRh EQUIPAZO..👫❤👫!! #inmejorablecompañia #boattrip #nochesdeverano https://t.co/mo9QhgJWyg Some days ago I lent my new #NissanLEAF to some friends in Barcelona. ¡Here's a summary of what happened! ⚡️ #LEAFofIniesta https://t.co/p0CO6OdYwq Hace unos días presté mi nuevo #NissanLEAF a algunos amigos en Barcelona. ¡Aquí tenéis un resumen de lo que sucedió! ⚡️ #LEAFdeIniesta https://t.co/e6iBYJXoMa 🔝😊 @AlbaceteBPSAD https://t.co/ZRI4S9Ne5h Muchas felicidades a los dos equipos de mi corazón. @FCBmasia y @AlbaceteBPSAD el año que viene en La Liga 1,2,3... https://t.co/v5n17K4kcb Vamos @AlbaceteBPSAD, mañana una final!! Toda la suerte del mundo! https://t.co/6EeygMw9zA Muchas felicidades Leo!! Bienvenido al club de los 30! Disfruta amigo, eres 🔝! https://t.co/1KK3tsHkg6 10 años después. Increíble todo lo que hemos vivido y la familia que hemos creado pero sobre todo lo que nos espera por delante! Tq mam! https://t.co/KwkkChEd8G Felicidad total... a tu lado se para el tiempo. Momentos únicos! Tq mama #familia #felicidad #vacaciones #avapas https://t.co/ZXWrPMdKaV El otro día me invitaron a la presentación del nuevo televisor. #Sony #OLED https://t.co/S6ed0pr0wa FCB players are looking incredible in the #PES2018 E3 trailer in case you missed it: @officialpes \n\nhttps://t.co/K9HzdKK1xl Los jugadores del Barcelona lucen increíble en el nuevo #PES2018. ¡Mira el tráiler aquí! @officialpes \n\nhttps://t.co/K9HzdKK1xl Vamos @AlbaceteBPSAD!! Gran experiencia!!!!! https://t.co/pZxwU1TlFA Se terminan los elogios para describirte @RafaelNadal! Muchísimas felicidades! #leyenda #rafa #10 https://t.co/ysT54ManQx Gran victoria ✌🏻y un paso más hacia el mundial! Grande @SeFutbol! https://t.co/BIuVeLgluW Último entreno con la @SeFutbol antes del partido de mañana contra Colombia! https://t.co/8JqqARs6Jk Primer día de entrenamiento con la @SeFutbol! A dar otro paso más. https://t.co/65l9cjumGc 2 añazos para este super héroe que nos hace cada día mucho mejores y felices a todos! Eres un campeón, felicidades!!! https://t.co/Oh7yAdtlNW RT @BodegaIniesta: Hoy es un día especial, es el día de nuestra tierra. !Feliz día a todos los castellano manchegos! https://t.co/imIicYV5V9 Un verdadero orgullo formar parte de esta maravillosa familia @SaveChildrenEs poder ir  aprendiendo, sumando y ayudando! https://t.co/CIzckvTeVv Mis respetos 🛡🗡💪👑 @Totti https://t.co/k8HWQ2tR6C Fue un placer como jugador y lo ha sido todavía más como entrenador. Gracias por todo!En lo deportivo y en lo personal!Salud en todo míster! https://t.co/Bb7ryJeoa2 Campeones! Gracias afición! Un orgullo ser culé! Força Barça!! https://t.co/C1q5XzUBGD Último entrenamiento de la temporada! Mañana nos jugamos un título! Força Barça! https://t.co/t7pUGpeU7h Preparando último partido de la temporada! Buenas sensaciones! Força Barça!! https://t.co/oDeu1ZTHsY El otro día visitando la recién remodelada tienda @BarruguetToys. Gracias por vuestra atención! @StokkeBaby @abitare_kids https://t.co/iAqe11biUY #PES is out now on mobile! Join me, @Aubameyang7 @gabigol and @MesutOzil8! Download here:https://t.co/tbM65RPCQ7 https://t.co/HyRDNZf5Ae #PES ya está disponible en tu móvil! Únete a mí, @Aubameyang7 @gabigol y @MesutOzil8! Descárgalo aquí: https://t.co/eZjxYgg0QN https://t.co/kIqq7oxw8o Porque no vuelva a ocurrir en ningún sitio del mundo. Hoy todos pensamos en Manchester. https://t.co/u9TMZyOynw Lo hemos intentando hasta el último partido. Gracias afición por el apoyo. Ahora toca pensar en la final de Copa. Vamos equipo, Força Barça! https://t.co/PkYRNdpAJU Mañana último partido de Liga en casa! Força Barça! Legendary changes coming to #PES2018! Can’t wait to play it! More info here: https://t.co/wr89IrhASz https://t.co/JwtledV0Sl Grandes cambios en el nuevo #PES2018! Qué ganas de poder jugar pronto! Para más información clicka aquí: https://t.co/wr89IrhASz https://t.co/03zjT1TGpK Friday and Saturday you will be able to test drive myLEAF in Barcelona and win presents. Stay tuned to the @NissanEV_ESP! #LEAFofIniesta https://t.co/XuECBQ9Gfe Viernes y sábado podréis probar mi LEAF en Barcelona y conseguir premios firmados. ¡Atentos a las redes de @NissanEV_ESP! #LEAFdeIniesta https://t.co/fowr8XUCCR Bienvenida Siena!! La mamá y ella están muy bien!!!! Un día inolvidable!!! https://t.co/3k6zH8Tdbp Muy contento de presentaros la cuarta edición de mi Campus! Os espero este verano en Iniesta's Methodology! \n\nhttps://t.co/7n2DWX5zMx https://t.co/8McjCk5Y10 Con mi Bodega sorteamos dos entradas dobles para la Final de Copa. ¿Os animáis a participar? https://t.co/xuvSZhNA8R ¡Mucha suerte! Gran victoria. Seguiremos hasta el final! Força Barça! https://t.co/iLnR5G4IMp Viaje a Las Palmas! Ese equipo de Mario Kart!!! Força Barça!!! https://t.co/u0sXrZh3qy Momentos que no tienen precio rodeado de los mejores!!!! Gracias por esta celebración!! #33 #family https://t.co/8TgcBJ8SZb Soon you will be able to drive my #NissanLEAF y and win signed presents. ¡Saty tuned to the @NissanEV_ESP twitter account! #LEAFofIniesta https://t.co/VohSduilNU Pronto podréis conducir mi #NissanLEAF y conseguir premios firmados. ¡Estad atentos al twitter de @NissanEV_ESP! ⚡ #LEAFdeIniesta https://t.co/wroZ04PBbj Día espectacular!! Cumplir a vuestro lado, lo mejor de este mundo!!Gracias por todos los mensajes de felicitación!! Por el cariño y respeto! https://t.co/DR43DGkpgo Preparando el partido contra Las Palmas! Força Barça!! https://t.co/CsToRpvh78 RT @BodegaIniesta: ¡Nuestros rosados vuelven a escena! Nuevos premios para nuestros vinos en el concurso Mondial Du Rosé 2017 ¡Gracias por… Mami!!! Felicidades!!! Gracias por querernos como lo haces!!! Gracias por todo!!! Te queremos @AnnaOrtiz34 https://t.co/LMxldKfuBf Un año más celebrando este día tan especial junto a ti! Te quiero madre! Gracias!!! https://t.co/JtndtIFjAN Día especial en todos los sentidos. Seguimos!!! Força Barça! https://t.co/OQbGTBPtUz 3 Jornadas para el final!!! Mañana contra un gran equipo a por otros tres puntos!!! Força Barça!!! https://t.co/fDy4y9cDaD Gracias @TAGHeuer por hacerme parte de vuestra familia!\nProud to be part of the @TAGHeuer family! #DontCrackUnderPressure https://t.co/ZUkHrvOZm8 En el entrenamiento preparando el partido contra el Villarreal con el gran @DenisSuarez6! https://t.co/zNFCfXKXBD The top #PES European players competed against each other to qualify for the @PESLeague World Finals! Watch it here: https://t.co/WueSsPDXS9 https://t.co/30vXclJjz4 Los mejores jugadores #PES Europeos compitieron para llegar a las Finales Mundiales del @pesleague!! Revívelo aquí: https://t.co/WueSsPDXS9 https://t.co/7o7W7NQxHg Tres puntos más para seguir en la pelea! Felicidades compañeros, siempre especial ganar el derbi! Força Barça!! Muy orgulloso de poder presentaros mi metodología. Con ganas de enseñar lo aprendido... Os espero en \nhttps://t.co/RLFklmIWeh 3 puntos más para seguir en la pelea! Felicidades @Mascherano bien merecido 😊😊! https://t.co/LYYF8C4BQP Con mi compi y fenómeno @ivanrakitic en el entreno de hoy. Mañana partido contra el @CAOsasuna ! Força Barça!! https://t.co/XzF2cIXwkn Tres años sin ti, pero estarás siempre en nuestros corazones. #Tito https://t.co/GpgCbXdyRB Sin comentarios!!! Felicidades!!! Un privilegio!! https://t.co/y5TABL1Opb Un 10 para todos!!!! Grandioso equipo!!!! Força Barça! https://t.co/RDC6viafaL Es un momento difícil, nos tenemos que levantar. Gracias afición por vuestro apoyo, sois increíbles! Hoy y siempre equipo. Força Barça! https://t.co/LkFMDc8kpG Todo preparado para mañana! Juntos como siempre! Força barca! https://t.co/vSZHdvCRHW Gran día en familia @AnnaOrtiz34!!! Os queremos!!! Gracias a estos padrinos #maribel #marta #familias https://t.co/ECkDQ1CJLo Tres puntos más para seguir en la pelea. Ahora sí, todos los sentidos en el miércoles. Força Barça!! https://t.co/qkuJYdaKWW Último entreno antes del partido de mañana. Vuelve la #Liga. Força Barça! https://t.co/BcYUD1fzJC Llegada a Turín!!! Esta tarde entrenamiento. Força barça!! https://t.co/2vXHFizDm3 Mis inicios... feliz noche! https://t.co/hrtymbmT24 Con mi compi!! Gran victoria! 👌 https://t.co/5t6SlBgAuw 6 añazos para la princesa de la casa!!!! Lo mejor de la vida!!!! https://t.co/VBckrHt2o3 Seguimos sumando y con buenas sensaciones! Força Barça!! https://t.co/tWFc5Sba2h Vuelve la Liga!!! Força Barça! https://t.co/6pggrD5rTI Vuelta a los entrenamientos y pensando en el próximo partido!!! https://t.co/wzQMfWp0lW Muchas felicidades @FCBfemeni ¡A semifinales! #FCBFemeni https://t.co/F7kWbSAYrv Gran partido, @Sefutbol!! Volvemos a casa con muy buenas sensaciones!! https://t.co/Hbnw458c0h Preparados para el partido de mañana! Vamos @SeFutbol! https://t.co/yrdgC7ZhGg Gran partido @SeFutbol!!! Gran esfuerzo!!!! Gracias Gijón!! https://t.co/zYCmKTa7y2 Mañana importante partido contra Israel!!! A dar otro paso más en la clasificación para el Mundial! https://t.co/NDdlhzlNxB Hola a todos! Siento este error en la informática/persona. Prefiero estar en Gijón con la selección que jugar a baloncesto. Un abrazo! Season 08/09 version of me is still available for your PES2017 myClub team! #PES2017 #myClub\nhttps://t.co/Qa76NK3NTv https://t.co/D3hovHBtoL Aún podéis jugar con mi versión de la temporada 08/09 para vuestro equipo del #myClub! #PES2017\nhttps://t.co/Qa76NK3NTv https://t.co/p1FP17fFZA #DiaMundialSindromeDeDown \n@annetavives https://t.co/cedGC7eTnH Felicidades hermano!!! Eres especial!!! Un placer compartir tantos momentos contigo! Por muchos más @JordiAlba https://t.co/FgtexCJkxf Gran reencuentro con la selección!!!\n@gerardeulofeu https://t.co/vyOjs03dPJ The best! https://t.co/POw90t0wWl Grande equipo! 3 puntos más para seguir sumando. Força Barça https://t.co/qhsUwFGoZC Partido mañana en casa contra el Valencia! Força Barça! https://t.co/A9kWJPhynx Compartiendo charla con mi amigo @Mascherano! Grande! https://t.co/3ie1GmrOWI Será una eliminatoria muy disputada y emocionante. Con la ilusión de dar otro paso más!! Força Barça!! https://t.co/kNvN2Dc4tp It's a pleasure to join the @TAGHeuer family. Thank you for the trust!\n#DontCrackUnderPressure https://t.co/azFZCXdzIW Un placer unirme a la familia @TAGHeuer. Gracias por la confianza!#DontCrackUnderPressure https://t.co/3JEOcOr69b Un orgullo ser Embajador Honorario de la marca España. Muchas gracias! https://t.co/EisUhH8F0l Un clásico!!! Los de mi generación lo entenderéis 🕹🎮😊 https://t.co/GSqNN7wosa Con mi Bodega hemos preparado un sorteo muy especial para el Día del Padre… ¡Participa y asiste al Barça-Valencia!\nhttps://t.co/57Hgq222Hd Vuelta a los entrenamientos mirando al siguiente partido. Força Barça! https://t.co/cjpWc1s5GP Qué recuerdos los pitufos... ahora iré con los peques de la casa! https://t.co/ufm9jcaczV Felicidades amigo! Me alegro de poder compartir vestuario con una persona como tú @ivanrakitic. https://t.co/f6eyMsxtLf Héroe!!! Grande!!! https://t.co/ROZiyKPJpE Visca el barça siempre! Os he dejado un vídeo que he hecho ahora en mi comunidad, https://t.co/ZwaHLlNdTu Último entreno antes de mañana! Todos juntos Força Barça! https://t.co/FtDob7mJvQ Preparando EL PARTIDO. https://t.co/kuQo5CiImp Gran partido y 3 puntos más! Ahora sí a pensar en la Champions. Nos vemos todos el miércoles en el Camp Nou! Força Barça! https://t.co/QpEMNJU34r Ya tenemos el nombre del ganador del concurso \"400 partidos en Liga\" que hice en mi Comunidad! Lo podéis ver aquí: https://t.co/ZwaHLlNdTu Hoy termina el primer concurso en mi Comunidad! Mañana conoceréis el ganador!!!!\nhttps://t.co/ZwaHLlNdTu Preparando el partido de este sábado! https://t.co/UMcpd91JJb Brand new #FCB Legends are live in @officialpes #myClub right now 😃 #PES2017\nhttps://t.co/CvUNMGQmas https://t.co/hKirCtb9p3 Ya están aquí las nuevas leyendas del #FCB, en @officialpes #myClub 😃 #PES2017\nhttps://t.co/rNgnMiTJK9 https://t.co/rSgq9gwDNx Gran partido y seguimos sumando!! Força Barça! Hoy es el día mundial de las Enfermedades Raras. La investigación es nuestra esperanza #SOMOSFEDER\nColabora https://t.co/zmHf6NDfzl He subido un vídeo en mi comunidad con las botas de mi partido 400! Espero que os guste https://t.co/ZwaHLlNdTu 15 millones de gracias!!\n15 million thank you's!! https://t.co/eF8zqE1jfs Grande equipo... https://t.co/ZwaHLlNdTu! Último entreno esta tarde antes del partido contra el Atlético! Força Barça! https://t.co/0k9m7xFuwF Buen entrenamiento bajo la lluvia esta mañana. https://t.co/FIMYkTKlpI Ya está aquí la 2ª temporada de la @pesleague EU. Apúntate y compite por grandes premios! #PES2017 https://t.co/3DHj60qpDn https://t.co/PatSKRjpNB .@pesleague EU season 2 has begun. Sign up and compete for huge prizes! #PES2017 https://t.co/3DHj608OeN https://t.co/w5NqQZoaQd Quiero agradecer vuestro apoyo regalando las botas con las que jugué mi partido 400! Participa en mi comunidad: https://t.co/ZwaHLlNdTu Seguimos sumando! A seguir trabajando y confiando en nosotros. Juntos Força Barça!! https://t.co/m4mkAJPUtT Os dejo una foto del entreno de hoy en mi Comunidad! https://t.co/pzc4bco8ZJ Creer y creer, siempre.\nAlways believing. https://t.co/GlYYqGvrKF Mañana toca Champions!! Os dejo una foto del entreno de hoy en mi comunidad https://t.co/pzc4bco8ZJ Feliz cumpleaños @Rafinha que lo disfrutes crack! No te preocupes que sales más guapo con la máscara 😁🤣! https://t.co/mvXnRgQsvd Esperando que la lesión de Aleix sea lo menos posible. Gran partido para seguir creciendo!! Força Barça https://t.co/lBigCcRt7a Entrenamiento finalizado!! Mañana partido en Vitoria!!! Força Barça!!! https://t.co/YbM4YEj8ZH Un orgullo poder presentaros mi comunidad. Espero que la disfrutemos juntos. Os dejo mi primer vídeo!\n📲 https://t.co/r6nviKMe4t https://t.co/Oi4O26iRmd Volvemos a estar en otra final de Copa!! Grande afición!! Grande equipo!! Força Barça!!! https://t.co/a4lKTe3bbj Preparando el partido de mañana! Força Barça!\nPreparing tomorrow's match! Força Barça! https://t.co/XwejQZhorY Entreno terminado y sumando buenas sensaciones! Hoy toca felicitar a @neymarjr! Grande crack!!!!! https://t.co/2xvn6WCDEp La lucha es cada día. Hoy y siempre al lado de los que luchan contra la enfermedad.\n#DiaMundialContraElCancer https://t.co/6nN0e0J0xi Gran victoria!!! Força Barça!!! Buenas sensaciones!!\nGood feelings!! https://t.co/VfQWGMULln He probado el #NissanLEAF y no tengo ninguna duda, lo recomiendo!! Y además, ¡si no te convence lo puedes cambiar! https://t.co/Pw2y4fkFZq Muchas felicidades @3gerardpique! Otro más al club del 3!! Te sales Geri! https://t.co/tdrMYvzDYs Grande equipo! Primera parte de la eliminatoria! Força Barça!! Siguiendo dando pasos para poder volver con el equipo. Qué ganas! https://t.co/HCwhfgmGkX Muy pronto veréis la campaña que rodé con los amigos de @NissanEV_ESP. ¡Muy ilusionado con mi nuevo #NissanLEAF 100% eléctrico! https://t.co/fh1yEfzjBo Happy birthday @ArdaTuran you're one in a million! It's my pleasure to share this locker room with you! https://t.co/4xtdsajWRt Muchas Felicidades @ArdaTuran eres un grande!!! Un placer compartir vestuario contigo crack! https://t.co/7khRjcNWjn Grande equipo!! Más cerca el objetivo!!! A semis!!! Força Barça Bienvenido al club del 3! Estas que te sales @LuisSuarez9! Muchas felicidades amigo!! https://t.co/oTRYKwL4t5 Muchas gracias por este reconocimiento! Buenas noches a todos! https://t.co/5RnmIRyTIZ Grande equipo!!! Tres más y seguimos sumando!!! Força Barça Muchísimas felicidades Mama! Feliz de disfrutar contigo tu aniversario y q sea x muchos años más! Gracias x todo, eres un ejemplo para mi! https://t.co/DTAvjkCSrL Gran paso en la eliminatoria! Gracias a todos por los mensajes. Esperar que no sea nada! Força Barça! Mañana vuelve la Copa!! Gran eliminatoria!! https://t.co/DUAVvNE5dc Gracias Míster!! https://t.co/tgWS9gZnWR Preparando el partido de Copa del jueves!!! Força Barça!!! https://t.co/KkSKo3ubdS Grande equipo! Seguimos! Ahora a pensar en el partido de Copa!\nForça barça Después de conocer el emparejamiento duro contra la Real Sociedad, preparamos el de mañana!!! \nForça Barça! Seguimos! https://t.co/YX2uKfXktJ Para que Pau Gasol siga haciendo historia!! #NBAVOTE #AllStar Cada RT es un voto oficial! https://t.co/DCwYx7MqFe Objetivo cumplido y sensacional esfuerzo equipo y afición! Força Barça!! https://t.co/hezwQtMWiG Un punto que nos sabe a poco, gran esfuerzo del equipo! Preparar la vuelta de copa y seguir y seguir!!! Força Barça Último entreno antes del difícil  partido de mañana contra el Villarreal CF!! https://t.co/cbDexXmuIA Espero que haya sido un feliz día de reyes para todos, especialmente para los más pequeños!!! Buenas noches!!!! #ilusión #familia Eliminatoria abierta y a darle la vuelta en casa, con nuestra gente! Lástima el final. Força Barça! I want to thank you all for the great reception that my autobiography has had over these Christmas Holidays!https://t.co/FZ91rCKCEh https://t.co/7Yb5UXUbfA Quería agradeceros la gran acogida que ha tenido mi autobiografía estas Navidades!\nhttps://t.co/iiUKb05bID https://t.co/seFHlzIMHX Día bonito junto a nuestra gente en el mini estadi y después visitando a los más pequeños en el @hvhebron! https://t.co/UxZ3ytZxDG Preparando a tope el partido de copa del jueves! Força Barça! https://t.co/4c1xZekQQE Feliz 2017 a todos!!! Que se cumplan vuestros sueños y tengáis mucha salud!!! https://t.co/9KpAThcvA4 Último entreno del año! Força Barça!! https://t.co/MdBt87aKb1 Vuelta a los entrenamientos!! https://t.co/eD0RJJAS0R Felicidades al Infantil B del @FCBarcelona por revalidar el título en el torneo #LaLigaPromises. Grande chicos!! Feliz Navidad a todos!!\nMerry Christmas to all of you!! https://t.co/3g09Wc19VU Abrigándome del frío... Mañana partido!!! https://t.co/4yhWeSC2Za Grande equipo! Siempre es especial ganar el derbi! Muy contento por la victoria y las sensaciones!\nForça Barça! https://t.co/W2dILvkDtl Último entreno antes del Derbi! Força Barça!! https://t.co/k12vji8Nbk Para estas Navidades en @BodegaIniesta tenemos una sorpresa, ¿quieres pasar una tarde conmigo? Participa!\nhttps://t.co/tPI92Fhngk Thrilled and happy for ‘The Artist. Being Iniesta’ ’s great welcome!! \nThank you all!!\nhttps://t.co/FZ91rCKCEh https://t.co/J6hxOqbZDY Muy contento por el acto que pudimos organizar ayer compartiendo la experiencia de mi libro. Gracias a todos!!\nhttps://t.co/iiUKb05bID https://t.co/fwIr99Eluh RT @MalpasoEd: [último día]\n#Encuentro con @andresiniesta8 / 14-dic en @Malpasolibreria *Sólo 4 plazas Participa aquí: https://t.co/OWHik8A… Gran día preciosa!! Un orgullo compartir mi vida contigo y en especial días tan señalados, te quiero @AnnaOrtiz34 #felicidad #familia #amor https://t.co/KeIyzPoLpD En casa con la satisfacción de haber hecho un gran trabajo! A seguir!!!! Força Barca! https://t.co/ZOvUkasKSQ Ya estamos en Pamplona! https://t.co/c4KQcODTgq Estas Navidades mis primeras jornadas de tecnificación: Iniesta Methodology! Espero que las disfrutéis!\nhttps://t.co/lMBkx5C1Vv Con @BodegaIniesta hemos preparado un sorteo muy especial. ¿Quieres pasar una tarde de Navidad conmigo? ¡Participa!\nhttps://t.co/tPI92Fhngk https://t.co/CHg75OFjw0 Grande equipo! Contento por la victoria y por las sensaciones! A seguir!! Força Barça https://t.co/jZAJnYP1C4 Cuesta asimilar un final así después de un esfuerzo tan grande. Feliz por poder volver y por la afición que tenemos! Juntos, seguimos!! Último entreno antes del Clásico! #forçabarça\nLast practice before El Clásico! #forçabarça https://t.co/puBhrhLsWU Ya ha salido la 2a edición de mi autobiografía \"La jugada de mi vida\". Muchas gracias a todos por hacerlo posible!\nhttps://t.co/J9c7K7OrmL https://t.co/UANtxwVtiG Empezamos otra competición con la ilusión de llegar hasta el final!!\nForça Barça!! Protagonizando la nueva campaña de @sonyxperiaes... 🎬⚽️🏓🍕📞Espero que os guste!\n#WowXperiaXZ https://t.co/wBClnoQO6q Toda mi solidaridad y apoyo a las familias de las víctimas y a todos los compañeros del @ChapecoenseReal tras la tragedia aérea de Colombia. Empezando la semana entrenando fuerte! Força Barça! https://t.co/byIZETuD4w Vamos equipo, Força Barça!! 💪🏻👍🏻 Contento de anunciar que mi autobiografía \"La jugada de mi vida\" ya está a la venta en mi tienda Bodega Iniesta de Barcelona (c/Dr Ibáñez) https://t.co/afUmvMDKsw Grandes sensaciones en mi primer entreno con el equipo!!! https://t.co/WrYKr052HF Buenos días! Qué mejor manera de empezar el día: clasificados!!! Grande equipo!!! Cada día con mejores sensaciones y avanzando! Seguimos! 😊💪🏻 #yafaltamenos https://t.co/QU1r3noPMA Un paso más!! https://t.co/GTRU9fpBip Todos a votar. Mucha fuerza Pablo, para ti y toda tu familia.\nhttps://t.co/TDWtJ7916t Gran partido @SeFutbol felicidades compañeros! Un paso más para el objetivo!!! Gracias @SergioRamos ojalá y lleguemos todos @3gerardpique, #ElClasico se lo merece!!  De los puntos mejor no hablamos 😁😁😁 Acabar la semana con buenas sensaciones después de un trabajo bien hecho... nada mal!!! 💪🏻💪🏻 #recuperando #máscerca #pasoapaso https://t.co/zgf1aMzzj9 RT @FCBarcelona_es: 🏃 💪\n@andresiniesta8  \nForça Barça! https://t.co/3XTjK4TmC1 RT @FCBfemeni: 📝 La crónica del FC Barcelona Femenino - FC Twente: 'Primer escalón hacia cuartos superado con éxito (1-0)' https://t.co/eis… Empezando con la segunda fase de la recuperación! Un paso más... 💪🏻💪🏻💪🏻💪🏻! https://t.co/liEISNXkqA En casa con todo preparado para ver el partido! Mucha suerte compañeros!! Força Barça Siguiente fase! Me has ayudado mucho pero no quiero verte más! https://t.co/AK7kkRqBl5 A seguir con la confianza en lo que hacemos. Faltan dos partidos para conseguir nuestro primer objetivo. Força Barça Una semana menos!!\nBuenas noches Hace 14 años, un día como hoy...\n14 years ago, on a day like today... https://t.co/mkC8czm0T7 No es un momento fácil, serán unas semanas pero podía haber sido mucho peor... Quería agradeceros los mensajes de ánimo! Un abrazo! Ya estamos en Valencia, mañana nos espera un gran partido! Buenas noches a todos y força Barça! https://t.co/8JYMj08LwD Momento especial para compartir con el #botadeoro @LuisSuarez9!! Un placer!!!! Por muchos años amigo!!! https://t.co/tGoj9NkdH4 Grande equipo y afición! 3 puntos y más cerca del objetivo! Força Barça!! https://t.co/P724pqSnAi Great match tomorrow!!! Go Barça!!! https://t.co/t9QkVTfQ5O Gran partido mañana!!! Vamos Barça!!! https://t.co/AlEIMSNydI Enhorabuena @marcmarquez93 por este nuevo campeonato del mundo. Muchas felicidades crack! https://t.co/HUpzdFWkG3 Grande equipo, tres puntos más para seguir sumando! Hay imágenes que emocionan... Gracias afición! https://t.co/HtAd0BuinX I am very happy that my autobiography is having such a good reception. Thank you all! The Artist, Being Iniesta! \nhttps://t.co/4Qj4hNeLeO https://t.co/UOva8ROfuN Muy contento de la aceptación que está teniendo mi autobiografía! Muchas gracias a todos! La jugada de mi Vida!\nhttps://t.co/gUvfYY0ETF https://t.co/6X8HSxY40D Gran victoria!!! Grande equipo! Un pasito más!! Vamos España! https://t.co/cc0q5xG4Z0 RT @SeFutbol: 📺 Con la mente puesta en los 3 puntos ante Albania. ¡Así ha sido el entrenamiento de la @SeFutbol en el Loro Boriçi! #VamosEs… Muchas felicidades Papá!!!! Te quiero! https://t.co/Jrewt63oun Gran partido en un escenario complicadísimo. Gran trabajo de todo el equipo! A recuperar y pensar en Albania. Mañana partido contra Italia! Siempre difícil! Vamos equipo! 9 años juntos! Te quiero @AnnaOrtiz34 #aniversario #felicidades https://t.co/FEG5a7URdr Con mi Bodega sorteamos 5 autobiografías firmadas “La jugada de mi vida\". ¡Participar es muy fácil! 😀\nhttps://t.co/ZYPYQpmw1M Decepcionado por la derrota. Se puso muy complicado y nos quedamos cerca. Hoy era un día muy especial, 600 partidos. Seguimos. Força Barça! Preparando el difícil duelo de mañana! Força Barça! https://t.co/jAQCE6Jh5I De pequeño quería jugar a fútbol... ¡Y los sueños se cumplen! ¿Quieres ser #IniestaPorUnDia? ¡Entrena con nosotros!\nhttps://t.co/Ny9qL2dMxe https://t.co/mvDPNzpyHF El 9 de octubre es la Cursa Hol•la Genís contra el cáncer infantil. ¡Os animo a todos a participar!\nhttps://t.co/tYM3oBUqBD Valiosísima victoria hoy en Alemania. Gran trabajo!! A seguir sumando!! Força barça\n#UCL https://t.co/QE5T2SmXvG Mañana segundo partido de Champions! Vamos!!!!!!\n#UCL https://t.co/yxz7D9VZJK Gran victoria fuera de casa! Grande equipo! Força Barça! Lástima este empate. Hicimos un gran partido y un esfuerzo tremendo. Descansar y preparar el partido del sábado! Força Barça!! Mañana partido!!! Preparación... https://t.co/cprU9NjEWL RT @jrdelamorena: Ya estamos montando @ElTransistorOC en casa de @andresiniesta8 No te lo pierdas https://t.co/2GAvtUZkQK Muchas felicidades a todos nuestros atletas que terminan hoy los #JuegosParalimpicos. Sois un ejemplo para todos. #31🏅🇪🇸🇪🇸 Día de recuperación y a preparar el partido del miércoles! https://t.co/HaYDlg2ELn Contento por las sensaciones y el partido que hicimos! A seguir trabajando, equipo! Vamooooos! https://t.co/ehok6rGbol 20 años del día que empezó a cumplirse mi sueño... Interminables recuerdos... Gracias a todos por hacerlo posible! https://t.co/0T9BGKJ7Un Hace unas semanas empezamos y ahora seguimos con la vendimia a tope! Gran trabajo @BodegaIniesta! 🍇🍷 https://t.co/6FzUkKycJG Visita de una leyenda!!!! Un placer @paugasol! https://t.co/P7gV2vyCtP Gran comienzo de Champions!!! Con el gran @aftgomes! Força Barça! https://t.co/hXsgkH7rSt Mañana vuelve la Champions!!! Entrenamiento prepartido⚽️ https://t.co/oRQi32JIsk Derrota inesperada. Corregir, trabajar y seguir mejorando. Força Barça!! Entrenamiento completado con el equipo y con buenas sensaciones! Seguimos!! https://t.co/aXF4qReaKk .@Olyseum ya está dando sus primeros pasos! Tienes la APP en Google Play y App Store, descárgala desde https://t.co/pzc4bco8ZJ I'm very happy to announce that my book is available in english too! I hope you can enjoy it https://t.co/h3W3cmwDyy https://t.co/suejwLKiqc RT @olyseum: Cambia tu manera de vivir el deporte con Olyseum. ¡Descarga ahora la app! https://t.co/uQdrb5CsSi #JoinTheMatch! https://t.co/… Os presento @Olyseum, la nueva red social para amantes del deporte! Podéis descargarla aquí: https://t.co/syo9hzwVgB https://t.co/ObYI0u5YIO Ya está en marcha la época más dura en @BodegaIniesta. Pero también la más bonita y delicada. La vendimia! https://t.co/GfrawgAIce Empezando la semana y sumando sensaciones positivas! https://t.co/NRBrQDemTh Buen día de trabajo con muy buenas sensaciones. Siguiendo los tiempos y los pasos que tocan! https://t.co/J6cYbYHsw7 Qué ganas de que podáis disfrutar de mi libro... El lunes ya estará dispónible en tiendas! https://t.co/J9c7K7OrmL https://t.co/qsjKXVcpGv Siguiente fase de la recuperación. Paciencia y con muchas ganas!! Un placer compartir estos dos años tan especiales! Como jugador y persona! Mucha suerte amigo! https://t.co/cP6PfxtvXr Gran victoria y gran trabajo!!! Força Barça!!! 30 añazos! Deseo que haya sido un día especial! Un placer ser tu hermano y compartir tantas cosas contigo! 1 Besazo! https://t.co/aLOnNQaTfM Estos son nuestros rivales. Con la ilusión de cada año por alcanzar el objetivo. Força Barça! https://t.co/NvDeoiEtZ9 Es un proyecto muy personal en el que he trabajado durante más de 3 años. Desde hoy podéis reservar vuestro ejemplar https://t.co/J9c7K7OrmL Estoy muy contento por presentaros mi autobiografía!! 'La jugada de mi vida'. https://t.co/Tji3xjq1T1 Muchas felicidades a los atletas españoles que han participado en las Olimpiadas! Nos habéis hecho vibrar y emocionarnos! 🏅🏅🔝🔝🇪🇸🇪🇸 #JJOO2016 Gran comienzo de liga! Grande equipo!!! Y un orgullo recibir el trofeo de la Liga que conseguimos el año pasado! Força Barça! Grande equipo... Primer título!! A seguir trabajando para estar de vuelta. Gracias por vuestro apoyo. Força Barça!! https://t.co/02t55HFIWM Con muchas ganas de estar de vuelta con el equipo lo antes posible. Ahora unos días de recuperación! Primer paso para ganar el primer título! Gran trabajo! Gran día de presentación con nuestra afición!! https://t.co/3vo3sQIUnn Mañana es nuestro día, el día del Gamper! #GamperFCB https://t.co/nSWjFwD9c5 7 años después... En nuestra memoria. https://t.co/yCGbl2vhcz Primeros minutos de pretemporada. A seguir preparándonos! Empieza la temporada. #Magista II https://t.co/4fPrAXH1TW https://t.co/ZX21XVXP5i Primer día de entrenamientos de esta nueva temporada. Con mucha ilusión y energía para afrontar un nuevo año!! https://t.co/FN5qG5hzsF Hoy hemos presentado el Corazón Spumante de @BodegaIniesta, el primer vino espumoso de calidad de la D.O. Manchuela! https://t.co/NcPyzzOqvn Juntos en los orígenes #AVAPA #felicidad #familia #Fuentealbilla https://t.co/7Kx4zxcPzn Muchas gracias a todos por haber participado en mi Campus​! Espero que hayáis disfrutado. Nos vemos el año que viene https://t.co/VsaKZYp4VY Todo empieza en Fuentealbilla. Nacer en un pueblo pequeño no es un límite para alcanzar tus metas. @Nike #JustDoIt https://t.co/kSOAUPTNBK RT @AccionistasCABK: Encuentro corporativo de #accionistasCABK en @bodegaIniesta acompañados de @andresiniesta8 https://t.co/5sBG6r2R7h htt… https://t.co/LecZcKU0dt Un día como hoy hace 4 años nos casamos!!!  4 años después volvemos... Eres única, @AnnaOrtiz34. TQ!!! https://t.co/0CR1gwnNq0 Gracias por tanto Vicente. Contigo hemos llegado a lo más alto. Grande míster!! https://t.co/jiqR2aQgnN https://t.co/CI39OtbEBv La ilusión de los niños hace grande al fútbol. Muy feliz por poder hacer mi Campus por tercer año. Gracias a todos! https://t.co/tZHpyBJICl Es una decepción para todos. Volveremos para ser más fuertes. Gracias por todo @SeFutbol! https://t.co/YUbvZjqriF En tres días partidazo contra Italia!! Grande equipo!!!! https://t.co/Ocr6E3FdlP Difícil derrota. Estamos en la siguiente fase! Mismo objetivo! Vamos equipo! Grande equipo! Muy contento después de esta victoria y asegurar la clasificación. A seguir trabajando @sefutbol! https://t.co/qAF53P7O1s Empezamos la competición con el mejor pie!!!! A seguir el camino!!!! Grande equipo!!! Grande afición!!!! https://t.co/LdeLAWyH33 Con un crack al acabar el primer entrenamiento en Francia! https://t.co/j2Nosn5IJY Camino a la Euro! Grande equipo! @SeFutbol https://t.co/ao9GFjPJ3p Os presento el cortometraje de @EstrellaDammEs. ¡Nada como disfrutar de #LasPequeñasCosas! https://t.co/UGLigvNLdX Feo resultado ayer en el último partido de preparación pero con ilusión y ganas tremendas de afrontar este nuevo reto!! Muy contento por cómo está quedando la tercera edición de mi Campus! \n\nInscripciones en: https://t.co/lMBkx5C1Vv https://t.co/6ju05ifbZZ La Euro ya se cerca y con mi Bodega sorteamos 2 entradas para que podáis venir a vernos! https://t.co/L0lUdGjWbZ https://t.co/EUiAuvlSWc RT @SeFutbol: 📷 ¡#4Fotos únicas! ¡Imágenes para la HISTORIA! ¡Ellos nos representarán en la #EURO2016! #VamosEspaña 🇪🇸 https://t.co/08x36AA… Muchas felicidades @GarbiMuguruza!! 🔝 https://t.co/TMNUM7Ht8o DEP Muhammad Ali. https://t.co/EzMrZ8eHwy Te deseo todo lo mejor amigo, te lo mereces!!!! Un placer conocerte y compartir muchas cosas juntos! Lo mejor! https://t.co/TyvlMQl881 Mis condolencias para la familia de Luis Salom y amigos. ¿Has visto el último ‘spot’ que he rodado con #CaixaBank @progEstrella? Míralo aquí: https://t.co/6LSdBGcHnm https://t.co/Eqyx9A9Xvb Hemos ganado y hemos llorado juntos. Te deseo lo mejor en tu nueva aventura amigo! https://t.co/hPQrtjjcDa Muchas gracias por todos estos años juntos, @DaniAlvesD2. Se te echará mucho de menos.... Después de 25 años volveremos a repetir la historia con esta camiseta. #iluminaeljuego https://t.co/KhQNLXOhBv https://t.co/v8eECfMQx5 Buenas sensaciones! A seguir trabajando. El próximo amistoso en Getafe! https://t.co/6AxRJW76ro Esta tarde segundo partido de preparación! Con mi paisano! Qué porterazo!! https://t.co/nB8fyIf9gA Seguimos preparando la Euro a tope!! https://t.co/Pd2JljQuPu Hola, ayer os presenté el teaser, hoy el nuevo spot de @Dormity_com! Un placer colaborar con ellos y con @23Llull.  https://t.co/2IXyOXsz2S Hola a todos, si queréis una camiseta firmada, entrad en https://t.co/H9tKN3qSx4 y adivinad quien está detrás de esta campaña. #ElRescate Primer amistoso! Vamos compañeros!!@JordiAlba  @SeFutbol https://t.co/l8wzWiYnCD En Austria con la @SeFutbol! Primer entreno recién terminado! Empezamos a preparar la Euro a tope! https://t.co/0ZCZLXdzXU 😄😄😄 https://t.co/mDzV0cOg3H Grande equipo! Grande afición! Grande Barça! Qué placer pertenecer a esta época!! https://t.co/aNTgwSUNHN Último entrenamiento y mañana en juego un título! Todos juntos!!! Força Barça! https://t.co/eRuKLSsm4X Preparando la final!! https://t.co/74HcyxxbRG Un orgullo!! https://t.co/Jm3XJRvWWQ Celebrando la Liga!!!! Con la afición y compañeros!!!! Grande equipo!!! Força Barça!! https://t.co/vnsfjFAwug Campeoooooooones! #Felicidad #Equipo #Afición #Barça #8 https://t.co/GMWDB5P5cC Esta tarde último entrenamiento y viaje para el decisivo partido de mañana! Força Barça!!!! Qué día tan especial ayer!! Fue maravilloso! Gracias por estos momentos tan especiales!! #Felicidad #Familia #AVPAA https://t.co/Qlm7UFA7O3 Gran victoria en el derbi! Sólo nos quedan 90' para ser campeones!! Força Barça! https://t.co/NCMKiTvrIc Felicidades Mami!!! Gracias por todo! Por querernos así!!! Te queremos! Eres la mejor @AnnaOrtiz34! https://t.co/6NiuIpJVas Ningún camino tendría sentido sin ti! Gracias por todo, te queremos mama!! https://t.co/GlGVjs92u7 Dos partidos para nuestro objetivo! Força Barça! Con @SergiRoberto10! https://t.co/fpDplweYpN Gracias por todos estos años. Tu voz nos acompañará siempre! Descansa en paz Manel. https://t.co/4SLkVYgmbW Otro año más nuestro stand de @BodegaIniesta en la Feria Alimentaria! https://t.co/cfTRgXyqwc Ya están abiertas las inscripciones para mi Campus de Fútbol. ¡Nos vemos este verano! https://t.co/lMBkx5C1Vv https://t.co/t7AxmGwauf No te olvidamos! https://t.co/UxonyZs9xo In honor of Johan Cruyff, his foundation shows why being active allows you to move forward https://t.co/ilKiUn7DkA #14forever Victoria y a tres partidos de nuestro objetivo! Força Barça!! Victoria y 4 partidos para nuestro objetivo!  Força Barça!! Parece inexplicable el partido de hoy, pero sucede. Dependemos de nosotros y confío más que nunca en que lo conseguiremos! Força Barça! Mañana vuelve la Liga!!! A por todas, Força Barça!! Difícil de asimilar el momento. Lo intentamos hasta el final y no fue suficiente. Aún quedan cosas importantes por hacer. Orgullo Barça. Llegada a Madrid! Mañana, partido de vuelta!!! Vamos equipo! Força Barça!! Nadie dijo que sería fácil y queremos volver a repetir objetivos y lo haremos juntos! https://t.co/fzMmitXLg1 Difícil después de perder pero confianza total en este equipo! Más que nunca!! A seguir! Força Barça!! Importantísimo partido mañana contra la @RealSociedad ! Buenas noches a todos! https://t.co/E8NEOmUfHx Con @Nissan buscamos a 2 personas para mantear la lona de la final de la Champions. Envía tu selfie! #TakeMeToMilan https://t.co/rgNMVrmCTR Primer paso! Nos quedan 90min para dar otro paso hacia nuestro objetivo! Grande afición por el apoyo! Grande equipo! https://t.co/I83fdUAQpX Mañana vuelve la Champions! Todos juntos a por otro objetivo!!! Força Barça! https://t.co/ZzR9mvrasu Duele perder un partido como este pero seguimos cerca del objetivo. Analizar y el martes otro reto! Força Barça! https://t.co/IrmRQvpx8V Último entrenamiento antes del clásico!! Vamos equipo!! https://t.co/6TTpTPyuAM Con #XperiaZ5Champions podemos vivir una experiencia única juntos. Participa! + info en @sonyxperiaes https://t.co/CSWj65OEYV Preparándome para jugar en #ElClásico con mis nuevas #Magista Radiant Reveal: https://t.co/XlnMw1zO82 https://t.co/0dZLLIvI7l Con mis amigos de la tienda de Paseo de Gracia #dirkbikkembergs ! Muchas gracias por todo. https://t.co/48LgojcOtr Muy contento de que mi bodega siga mejorando año tras año! Gran trabajo y felicidades @BodegaIniesta!! https://t.co/HgzmbYSGMw En el entreno de esta mañana preparando el Clásico! https://t.co/Gdh09LOT8p Un día triste. Se va una leyenda y una persona clave para el Barça y el fútbol. Mi más sentido pésame a la familia. https://t.co/QQ20emK0D0 Recuperando sensaciones!! https://t.co/vvL2dvI428 Próximamente. / Coming soon. @SergioRamos\nhttps://t.co/9xF1oJg614 Una jornada menos y más cerca de nuestro objetivo! Seguimos! Tener claro el camino es lo importante sea lo que sea lo que te encuentres en él.Feliz día del padre.Te quiero Papa! https://t.co/QfZNhX75hX Ya tenemos rival!! Con toda la ilusión de dar un paso más!! Força Barça!! https://t.co/ZCqviWin3Y Grande equipo! A cuartos!! Vamooooos Força Barça!!!!!!! Con mi compi @ivanrakitic! https://t.co/RbUBTltGiZ Entrenamiento finalizado, mañana vuelta de octavos!! Gran partido! Vamos equipo!!! https://t.co/c3YXqyGmcA El placer es mío! A seguir cosechando éxitos con la selección 😉🤗 https://t.co/HugSxc3huZ Estrenando mis nuevas #airmax de @Nike_Spain. Os gustan? Personaliza las tuyas en https://t.co/szPmVj0Nxv https://t.co/YE7HQ9lHvo Nueva victoria!!! Más cerca del objetivo! Gran partido y gran ambiente!!! Força Barça!!! https://t.co/6k8C5Oz6v3 Después de estos dos días de relax, hoy ponemos vuelta a los entrenamientos para preparar el partido del sábado! Feliz #DíaInternacionalDeLaMujer!! https://t.co/BH7cIWldlq Ella es mi campeona! Quién es la tuya? Menciona a tu #ChampionsWoman! Iniciativa de @Nissan ;) #IWD2016 https://t.co/kd3goSf2b0 Ya en Barcelona! Otro paso más! Ahora semana para preparar el próximo!!!  Grande equipo! Esta tarde entrenamiento y mañana partido en Eibar! Vamos equipo!! Visita sorpresa de mi amigo @alexdeguirior! https://t.co/CvjomqAUfb Buen partido y sumamos tres puntos importantes para el objetivo final. Ahora a pensar en el partido contra el Eibar! Força Barça! Con mi amigo Álvaro y su familia. Ejemplo de superación y lucha. Más info en https://t.co/eXBf85ZxJW @Asociacion_jpv https://t.co/2CE5tmNJ1B Estaba claro, cada vez son más los que confían en el #MétodoDentix\nhttps://t.co/gNA2jqd9fe Gran proyecto de mi amigo @SesiMS81! @smashpadelin!!! Tendremos que ir no, @fbelasteguin?? https://t.co/ToqasYsqfM RT @BodegaIniesta: Hoy día mundial de las #EnfermedadesRaras os animamos a ayudar a @FEDER_ONG y os suméis a #creandoredesdeesperanza https… Tres puntos importantísimos para el objetivo final. Quedan 12 finales!! Força Barça!! Hoy toca partido importante en casa. Vamos equipo!!! Força Barça!! Qué difícil es convencer a un #cabezota. Creo que al final lo conseguiré. https://t.co/aDcrYuEqA4 RT @FCBfemeni: 🎥 @andresiniesta8 y @M_unzue6, de capitán a capitán: \"El domingo, todos al Mini!\" #FCBFemeni https://t.co/YAjFZT4jDm https:/… RT @FCBarcelona_es: 🔴🔵 @andresiniesta8, al lado del @FCBfemeni. ¡El domingo, todos en el Mini! https://t.co/yibsNEFA0C #FCBlive https://t.c… Día de descanso y cena con mi mujer @AnnaOrtiz34 de relax!!!  Buenas nochessss! https://t.co/FfhtVDLaxS Espectacular victoria! Gran paso pero nada definitivo. Grande equipo!!! https://t.co/ArqpzxuVSB Finalizado el entrenamiento! Mañana partido en el Emirates Stadium! #vuelvelachampions\n\nTraining finished! Game in the Emirates tomorrow! Sufrida y trabajada victoria!! Seguimos sumando de tres en tres! Grande equipoooo!! https://t.co/eYq7Zgs5T1 Terminado el último entreno antes del partido de mañana. Ya en el aeropuerto para Las Palmas! Vamos equipo! https://t.co/dSZu4XhPec Más de 300 goles, qué barbaridad. Ninguno como tú! Sin palabras una vez más! https://t.co/peomChXuAH Tres puntos más fuera de casa. Ahora para casa, a descansar y a preparar el partido del sábado contra Las Palmas. Esto no para! Esta mañana último entreno antes del partido de mañana en Gijón! Vamos equipo!!! Mucha fuerza a todos los niños que luchan contra el cáncer. Ellos son los verdaderos superhéroes! https://t.co/0iZGEZ7qoo Ya te queda menos amigo!!!! Te estamos esperando @Rafinha!!!! https://t.co/ROpRrcpo8K Grande equipo! Partido exigente que supimos resolver muy bien. Ahora a recuperar, el miércoles otro más! Força Barça https://t.co/8KhXgXZU17 Felicidades a la @sefutbol de fútbol sala!! Campeones de Europa!! Buenas noches! Último entreno antes del partido de mañana. Vuelve la Liga!! @mterstegen1 https://t.co/0H4EoB1ja6 Muchas felicidades y mucha suerte para la final a la Selección Española de Fútbol Sala! #FutSalEURO Yo ya he votado mis 4 canciones para la EURO 2016, ¿y tú? https://t.co/MPCL6ZMbgK #TodosAFrancia @sefutbol. Grande equipo, a la final!!!! Más cerca de un objetivo! Buenas noches!! Os dejo esta foto con un fenómeno con quien compartí vestuario y títulos! https://t.co/eqsZ9uuAl6 Felicidades @FutbolCatalunya, más de 15.000 followers!! Contento por seguir un año más con @Arcos. Un placer trabajar con gente de mi tierra junto a un crack, @QiqeDacosta https://t.co/H9jatJjuiG Valiosa victoria!!!! Grande equipo!!! Ahora para casa!!!!!\n\n@ivanrakitic @JordiAlba #Messi #Busquets https://t.co/nNqW4wDryP Mañana partido a las 12!!! Estrenamos horario! Buenas noches! Enhorabuena a @firstv1sion finalistas de #1st&amp;Future by @NFL y @TechCrunch. Lo celebran sorteando mis botas firmadas https://t.co/8rvlPPYbXP Con un grande! @ArdaTuran https://t.co/HbOGAeGLm3 Para casa después de una gran noche de fútbol! A un paso de la final de Copa!! Força Barça!! https://t.co/YtmKtNnJpS Mañana toca semifinales contra un gran rival! Con toda la ilusión en la Copa! Buenas noches! Bonita noche ayer. Gracias por el reconocimiento! Felicidades @LaiaSanz_! https://t.co/hKoZwq3II5 Qué alegría volverte a ver!! Con el crack @10Ronaldinho!!#GalaMD https://t.co/4xpDtlJuWf Grande equipo!!! Líderes! A disfrutarlooo y a seguir!!! https://t.co/DEjLxvEy32 Mañana partidazo en el Camp Nou! Buenas noches y buen finde! Nos espera una gran semifinal! Força Barça!! https://t.co/g83l7ULQ68 Así es como se hace chicos! @tsilva3 @ECavaniOfficial @MarcoVerratti1. Quién se atreve con el #ConeChallenge? https://t.co/BlyQ7qafFO Grande equipo! A semis después de un gran esfuerzo! Felices por el resultado final! A recuperar y el miércoles Copa! Seguimos, equipo! Força Barça! https://t.co/CeJXnAQbvf Tras el entreno viaje a Málaga! Vamos equipo! @MarcBartra @ivanrakitic @iamathieujeremy @Mascherano @LuisSuarez9 https://t.co/9sP4S8aJc6 Buen resultado para el partido de vuelta en casa con nuestra gente! Grande equipo! Força Barça! https://t.co/8YNzxvQ6GT Tres puntos después de una buena victoria y ahora a pensar en la Copa! Esto no para! https://t.co/XmTS2CIDUd Bonita eliminatoria!!! Complicada como siempre pero con la ilusión de dar otro paso hacia el objetivo. Força Barça! Un paso más en la copa! A esperar rival... Hoy día de derbi! Mi apoyo a Pau Gasol para el #AllStar2016. RT si queréis que Pau esté en el All-Star una vez más. Ánimo campeón @paugasol!!! #NBAVote Grandes @neymarjr, @DaniAlvesD2, @LUISENRIQUE21 y en especial tú, Leo. Cinco Balones de Oro. Eres único! https://t.co/snv0FMsPJA Seventh year in a row here. It is a huge pride. #BallondOr #DirkBikkembergs #Gala https://t.co/EZHVWSzpTQ Séptimo año consecutivo aquí y es todo un orgullo. #BallondOr #DirkBikkembergs #Gala https://t.co/Mn2Qfwtxxz Gran victoria! A seguir trabajando y ahora a pensar en el partido de vuelta de Copa. Força Barça! Hoy último entreno antes del partido de mañana en casa contra el Granada! Força Barça! https://t.co/8yiWdpqG0t Grande Equipo!! Felicidades por el debut @ArdaTuran y Aleix Vidal! https://t.co/N8014XFYPL Gran día de puertas abiertas y después visitas en los hospitales. Un abrazo muy fuerte para los niños y sus familias https://t.co/Y1Dv7ZVIcC Derbi intenso como siempre. Un punto y seguimos!!! Ahora a prepararse para la copa! Força Barça!! Otro año más, muchas gracias por vuestro cariño y respeto!!! Os deseo un feliz año 2016!! Salud para todos!!! https://t.co/hZ6ZOxUKdE With my friends from Nissan we want to thank you for your support. Wish a happy new year on using #IniestaWishes https://t.co/nuhebTaOwe Despedimos un año muy especial con una victoria! Gracias a todos por vuestro apoyo! Força Barça! Vuelta a los entrenamientos después de las vacaciones de Navidad! Preparando el partido del miércoles! Força Barça! https://t.co/xBU2gxaYfJ https://t.co/h3FltNeFvC Feliz Nochebuena y feliz Navidad a todos!! Salud!! https://t.co/TY4Ofv459E En casa con la copa!! 5 de 6!! Felices vacaciones!! https://t.co/WaKyLW2XZB RT @MediaBaseSports: .@andresiniesta8 es el jugador con más títulos en la historia del @FCBarcelona_es. Orgullosos de ti, Andrés!! https://… Campeonessss!!!!\n\nChampions!!!!! https://t.co/CC4ikShxCy Prepartido! Todo preparado para mañana!!!! Vamos Barça!!! #FCBRiver https://t.co/uO7BA1qOeu Con @bodegainiesta hemos preparado una sorpresa navideña para toda la familia ¿Participáis? https://t.co/EBBMSFjLIT https://t.co/1uAl69Q3va En bus por Yokohama con gran compañía! https://t.co/qGkm9AZVbV Grande, equipo!! Ya estamos en la final!!! #JapanFCB https://t.co/ZLB4xPfsZJ Finalizado el entrenamiento previo al partido de mañana! 4 años después volvemos con la misma ilusión! #JapanFCB https://t.co/Q7dQszXgap Ya tenemos rival para octavos... Será una eliminatoria complicada! Buenas noches desde Japón! https://t.co/pUjKSOymfP Impotencia por haber dejado escapar dos puntos en casa. A seguir trabajando juntos! Força Barça! https://t.co/pbwRx9buM0 Hoy cumple años la mujer de mi vida... Muchas felicidades @AnnaOrtiz34 te quiero! https://t.co/7OQwpgHmux Hoy acabamos la fase de grupos!! Suerte, equipo! A punto de empezar la carrera... Quién ganará?? #MarioKart https://t.co/NBOOvhS8S0 Una pena que no hayamos conseguido la victoria. Buen partido en un campo donde cuesta mucho ganar. Seguimos, equipo! https://t.co/kt8rVsVk64 Esta semana se ha despedido uno de los más grandes... Te deseo lo mejor @kobebryant!! https://t.co/NcSXkDII1H En el entrenamiento de esta mañana, preparando ya a tope el partido de este sábado!! https://t.co/xTacP9LH8c Buenos días a todos! Esta noche vuelve la copa al Camp Nou!! #compartirmomentos con protección, nos ayudará a conseguir el objetivo de #0transmisiones. Muchas felicidades a todos por vuestros premios de ayer en la gala de La Liga! Muy merecidos: Bravo, Ney, Leo y el míster. Mucha felicidades Leo, Ney y al Míster pos sus nominaciones. Mucha suerte!! Os lo merecéis!!!! Grande equipo! Tres puntos más para seguir líderes y gran partido! El miércoles Copa! \n\nCon @ivanrakitic https://t.co/8YDu2CS8c9 Esta mañana durante el entreno prepartido!!! https://t.co/URyeMuvk7n Mi apoyo al #GivingTuesday como mis amigos del @VHIR_ El 27 de noviembre ayuda a su investigación en Illa Diagonal https://t.co/1k6LTMbT56 Con el campeón!!! Grande @lorenzo99! Gracias por el regalo. https://t.co/S9BmTWakMG Gran victoria y primera plaza de grupo!! Vamoooos!! Mañana vuelve la Champions!! Grande equipo!!!!!! https://t.co/buBnXhgvM9 Hi everyone! In a few moments, you can watch my press conference about #ElClasico: https://t.co/gr6yGpfgMN Hola a todos! En unos instantes podrás ver mi rueda de prensa sobre #ElClasico: https://t.co/zhXADepI5M Cuántos momentos jugando a fútbol con mis Playmobil...! Aún podéis ganar uno aquí: https://t.co/j53PCisLL2 https://t.co/VNa0Zz8bCj Primer entrenamiento preparando el clásico!! Hogar dulce hogar! https://t.co/GVYS7Y9ALN Entrenamiento terminado en tierras belgas antes del partido de mañana. Otra buena prueba para seguir preparando la Euro! Todo mi cariño para las familias y el pueblo francés. Te quedas sin palabras... https://t.co/QYZR2FuFXo Cuando era pequeño siempre tuve claro qué quería ser de mayor. Bonita iniciativa @Playmobil! https://t.co/j53PCisLL2 https://t.co/1lItXV3CSR Primer día de concentración con la @SeFutbol! https://t.co/Omhspr89SY Gran esfuerzo y trabajo de todo el equipo y la afición!! Vamos equipo, Força Barça! Con el gran @LuisSuarez9! https://t.co/qzrG3rn5SP Mañana partido importante en casa contra el Villarreal! Muy contento por inaugurar la tienda de Bodega Iniesta en Barcelona! La encontraréis en la calle Doctor Ibáñez 15. https://t.co/gXVQwyWIeG Mañana Champions! Força Barça!! https://t.co/0IC7ocOPR3 Mañana de trabajo con mi equipo de @MediaBaseSports https://t.co/XMvIS1WFLo Feliz Halloween 2015 a todos! Con @AnnaOrtiz34 @Meli_jimenez  @rakelmauri @MarcBartra @JordiAlba @ivanrakitic https://t.co/5QljzBuomQ Victoria y volver a jugar... Gran combinación! Grande equipo!!!! @mterstegen1 https://t.co/CeTOUB0Y3c Mañana para Getafe! Muy contento por volver con el equipo! Vamos Barça!!! https://t.co/wtOe0V0jtW 13 años de un momento mágico. Muchas gracias a todos por todo el cariño y apoyo!! https://t.co/8ZREcgKygY 4ta semana... Se hace largo pero ya en la recta final. Mañana Copa, a defender el título!! Felicidades compañeros y en especial a @LuisSuarez9 por sus tres goles! El miércoles copa del rey! Con mi amigo @MarcBartra! https://t.co/8exhDex2pg Todo mi apoyo para Johan Cruyff y su familia. Un abrazo grande Primer entreno con los compañeros completado!!! Contento y con buenas sensaciones!!! https://t.co/5PCKgwGpwn Tercera semana de recuperación y con muy buenas sensaciones! Espero poder estar pronto con el equipo!! https://t.co/d94QeMzYXk Viendo el partido, muchos ánimos y mucha suerte compañeros! Força Barça! Sigamos peleando contra esta enfermedad! Mucha fuerza para las mujeres que la sufren. \n#DiaContraelCancerdeMama http://t.co/rOfM4Je871 #DiaContraelCancerdeMama  https://t.co/7CcZI8VWbX Vuelve la Liga!! Vamos equipo!Força Barça!! Mírate: https://t.co/WdIauzYFZV 2 semanas de la lesión. Con muchas ganas de empezar en el césped!! Buena semana para todos!!!! RT @FCBfemeni: Este miércoles vuelve la @UWCL a Barcelona. Da tu apoyo al equipo ante el BIIK haciendo RT del vídeo #FCBFemeni http://t.co/… Felicidades por la victoria!!! Gran clasificación hacia la Eurocopa! Ya estamos en la Euro! Felicidades compañeros por el partido!! A defender el título! Una semana después, seguimos avanzando. Cada vez queda menos. http://t.co/amWILxxCzF Gracias @rickyrubio9 @DavidFerrer87 @sonypictures_es #SoloHayUnBond #SpectreLaPelícula \nhttp://t.co/7Z1eUo2iZb No busco entender el porqué ha pasado sino aprender para intentar que no vuelva a suceder. Gracias por vuestro cariño, os lo agradezco (2/2) Otro día menos para estar de vuelta, sólo pensando en recuperarme para volver pronto! (1/2) Victoria importantísima! Orgullo de equipo!! Aunque a veces no se entiendan las cosas... Paras para volver mejor. Un día menos. Força Barça! Victoria y seguimos trabajando. Mucho ánimo Leo, espero que puedas estar pronto de nuevo con nosotros!! Finalizado el entrenamiento antes del partido de mañana en Vigo! Força Barça!! Buena victoria después de un partido cerrado! Esto no para y toca preparar la complicada salida del miércoles contra el Celta! Força Barça! RT @FCBarcelona_es: Presentada la campaña ‘Tant se val d’on venim’ en ayuda de los refugiados llegados a Europa http://t.co/zdxcva5ba8\nhttp… Qué partidazo!! Espectacular!! http://t.co/8OJM9j7RAs Mucho ánimo amigo!!! Volverás como un toro @Rafinha http://t.co/VjF8OLjsQJ Lástima no conseguir los tres puntos de hoy. Ahora a recuperar para el domingo. Un abrazo @Rafinha, esperando que no sea grave. Força Barça! Muy orgulloso y agradecido a todos los que me habéis ayudado siempre a llegar hasta aquí. #sueñosquesecumplen (2/2) http://t.co/rS7mlrkp0c Hoy hace 19 años que empezó mi sueño con el Barça... (1/2) Mañana primer partido de Champions!! Vamos Barça!! http://t.co/TSW1bI4y0n El 20 de septiembre os animo a correr 5km en la @CursaNickHorta por la investigación de @VHIR_ en @hvhebron https://t.co/1iEAlSZW4z Gran trabajo del equipo y grandísima victoria!! Ahora toca Champions!! Força Barça! @mterstegen1 http://t.co/SwfNtSDJ53 Con todo un crack! @DavidFerrer87 http://t.co/PIKFJCLosz Vuelta a los entrenos y preparando el partido tan importante de este sábado!! http://t.co/N96bs8qj1y Dos victorias importantes para estar en la Euro, y a un paso...!! Gran victoria para ponernos líderes!!! Ahora a ganar el siguiente partido!! Grande equipo! Grande equipo, primer partido de liga en casa con victoria muy trabajada! Força Barça! Gracias a mis amigos de Nissan podréis ver 3 partidos de la UCL en directo. Haz RT para participar! #ChampionsKey https://t.co/ChIogg1lMv Volviendo de Mónaco. Felicidades Leo... Eres único!! Con ganas de empezar la Champions una nueva temporada! http://t.co/awd7hXTTij Siempre es un placer venir a verte amigo @SesiMS81 ! Buena comida y mejor servicio 😉 #CasaAndres #TossadeMar http://t.co/axFQ1WnkxD Muy contentos por empezar la Liga con esta victoria! Espero que @DaniAlvesD2  y Sergio estén bien! Força Barça!!! http://t.co/kV1qbfXFhi Te deseo toda la suerte del mundo @_Pedro17_ . Te echaremos mucho de menos amigo! http://t.co/wZhHB19MmM Toca centrarnos en el inicio de la Liga y en todos los retos que tenemos por delante, que son apasionantes!! Força Barça! No hay nada imposible para este equipo! El lunes todos juntos a por la remontada!! #ForçaBarça http://t.co/whmPcHa1XD Muy feliz por llegar a los 550 partidos con esta camiseta.Espero que sean muchos más y que consigamos muchos títulos! http://t.co/aa6VbELxKV Grandeeeeee equipo!! Hemos sufrido muchísimo pero hemos conseguido el primer título de la temporada!Campeoooooones!!! http://t.co/wTpbUxyPNp 6 años sin ti. Pero te seguimos recordando cada día que pasa, amigo. http://t.co/oi2fAde6AM Con @BodegaIniesta sorteamos 2 entradas para la vuelta de la Supercopa!! Sólo tenéis que contestar a una pregunta... http://t.co/9oD7PoUA26 Mañana la fiesta del Gamper!!! Otro año de ilusión junto a mi amigo @DaniAlvesD2!! http://t.co/UuHi5DZFRZ Ya en Washington, última parada de la gira, seguimos preparándonos... Gran tarde de Béisbol! http://t.co/4jiGZ2VFih Con un grande @JordiAlba,  camino de San Francisco!! http://t.co/c65BmBmhCp Hoy por la mañana hemos recibido la visita de uno de los más grandes... @kobebryant!! http://t.co/MPkXP1xDsO Un fuerte abrazo para los familiares y amigos de Bernat Martínez y Dani Rivas. Descansen en paz. Gran día para todos los Barcelonistas!! Mucha suerte a los 4 candidatos. #EleccionesFCB http://t.co/1CisWiWrYE Iker, mucha suerte en tu nuevo equipo!! Te deseo todo lo mejor! http://t.co/hOmTa0RbzP Hoy hace 3 años de aquel 8 de julio... Sencillamente mágico! Gracias @AnnaOrtiz34!! #felicidad #amor http://t.co/Cyns1gjH59 El otro día pude pasar una tarde muy agradable con toda la gente de mi Campus! Gracias a todos por hacerlo posible!!! http://t.co/gMZWUQuFIy 8 añitos juntos @AnnaOrtiz34... Gracias amor!! http://t.co/GOqgWhekJf Disfrutando en la boda de Pedro y Carol!! Muchas Felicidades!! #boda #amigos #moda #Dirkbikkembergs http://t.co/qd4LqtKNll Muy contento por presentaros mi nueva web!! Aún quedan algunos retoques pero espero que os guste tanto como a mí!! http://t.co/4zbZgsE6HD RT @Rafa13Vargas: Para tod@s l@s que hemos hecho #iniestademivida ha sido un placer enorme y único. Hoy a medianoche en TeleCinco http://t.… Una vez terminada la temporada, quién se anima a entrenar para la #GTAcademy de Nissan? http://t.co/aSAdR5fPKz http://t.co/v9T03aSo1H ... después del partido no ha mejorado y no me permite estar con mis compañeros. Os deseo lo mejor para los próximos días. (2/2) Lamento no poder estar con la selección en estos dos partidos. Aunque he hecho todo lo posible, la lesión que tenía... (1/2) En breve comienza la rua!! Felicidades Culeeeeeers!!!! http://t.co/pdXqEbl7yK Sin palabras! Gracias a todos!!!!!!!!! http://t.co/8birwARumO Mañana la gran final!! Força Barça!!\n\nTomorrow the big final!! Força Barça!! http://t.co/2v21DTr6lD Gracias, gracias y un millón de gracias! Siempre Xavi!!\n\nThanks, thanks and one million times thanks! Always Xavi!! http://t.co/s6tRshgMZO Cada uno tiene su propio ritual para preparar la final. Los hay que son de lo más curiosos. #ChargeUp #JUVFCB http://t.co/swSSe6VPN6 Empieza la cuenta atrás para la final. Cuál es vuestra manera de prepararla? #ChargeUp #JUVFCB http://t.co/ulubYSbI6l Hola a todos!! Ya tenemos con nosotros a Paolo Andrea, la mamá y el pequeñín están muy bien!!!!  Felicidad total!!!! Gracias por compartir este momento!! Ya tenemos el doblete y ahora todo puesto para Berlín!!!! Força Barça! http://t.co/4TVeXXQFu8 Dobleeeete!! Preparando a tope la gran final de este sábado!! Vamos Barça!!! http://t.co/GOjqkgvHO7 El miércoles @Arcos anunciará los 2 ganadores que irán a la final de Copa. Participa aquí http://t.co/NXkCTCrJgV http://t.co/wQDHRJFBKJ La última liga juntos!! Muchas gracias por todos estos años!! Ahora a por lo que nos queda!! Força Barça!! http://t.co/5o6EFNT1FN Buenos días! Vienen partidos importantes y con mi Bodega os quiero invitar a la final de Copa! http://t.co/PpFZxu0AHe http://t.co/nUCEJMAUuQ Un privilegio tantos años a tu lado! Pero aún no hemos terminado!!! http://t.co/rZhtf6oSjr Mañana contestaré a vuestras preguntas en la #AntigaFabrica de @estrelladammcat. Podréis seguirlo en directo en http://t.co/shy6OwkpuH Un orgullo como culé y futbolista!! Gracias a todos!! Visca el Barça!!! http://t.co/sWOj3jOfQ7 Champions!!!!! Huge!!!! Congratulations team!!!! And to every Barça fan... Força Barça!!!! http://t.co/vw5j58lmpW Campeoooooooones!!! Grandiosoooooooo!!! Felicidades equipo!!! Y a todos los cules... Força Barça!!!!! http://t.co/YjkZrmLBRH Os dejo el vídeo de mi visita sorpresa al Nissan Test Lab en Barcelona. Creéis que superé el reto? #genius http://t.co/SGG0Rk7jb1 Mis amigos de @Arcos regalan 2 entradas dobles para la final de Copa! Podéis participar aquí: http://t.co/X3a8TQteQM http://t.co/Okyaic8Mp3 Celebrando el cumple con mi mujer @AnnaOrtiz34...! http://t.co/i7ebcIUkRT Yo puedo vencer el tiempo, y vosotros? #XperiaExtraordinario\nhttp://t.co/L0o043y5Cq Os recomiendo la Festa solidària de la Recerca de mis amigos del @VHIR_ @hvhebron el 23 de mayo https://t.co/7vPBjVmkdm #festarecerca Nos vamos para Berlín!!! Qué grande!!! Vamos Barça!!! http://t.co/66x3cRsWYf Muchas gracias a todos por vuestras felicitaciones! #feliz #aniversario #31 http://t.co/88cmLrizIV Donate to help refugees in North Cameroon #YWBFC http://t.co/Lqbf5TjHW8 Grandísima victoria!!!! Una jornada menos!!! Força Barça!!! Mañana penúltimo partido en casa!!! Feliz fin de semana y buenas noches a todos :) Os recomiendo este libro a todos: La Luz de Miki Roqué. Todo un ejemplo de lucha. http://t.co/NEpZp4bXpK Grande equipo!!! Grande afición!!!! Qué gran noche!!! 90 minutos para el gran objetivo!!!  Força Barça! http://t.co/YjSa6EDvdw Os animo a que compartáis vuestros trucos con balón con #genius. Pronto os descubriré uno mío. Qué os imagináis? https://t.co/7r1bkjT7Hs Bájate Epidemia The Game en tu móvil y ayuda a acabar con el #sida: http://t.co/tHjXt1mN0u #EpidemiaAlert El 19 de mayo responderé tus preguntas en la #AntigaFábrica de #EstrellaDamm. Envía la tuya a #UnaEstrellaConIniesta #UnaEstrellaAmbIniesta Feliz día Mamá!! Te quiero!! http://t.co/hvSVxHfHzq All my warmth and support to @rioferdy5 and his family. Our thoughts are with you and your family. Todo mi cariño y apoyo en estos momentos para @rioferdy5 y los suyos. Nuestros pensamientos están contigo y tu familia. Grande equipo!! Un paso más y más cerca del objetivo. A seguir a tope!! Força Barça!!!! Con @MarcBartra y Ter Stegen! http://t.co/tnAs9uegPY Ya queda menos para mi Campus!! Podéis conseguir una plaza y balones firmados gracias a mis amigos de @TosfritOficial http://t.co/H2wHNXRh4T Esta tarde he podido comprobar el gran trabajo de investigación que hacen en  el @VHIR_ Es un honor ser su embajador http://t.co/ox0Dl63lNO Gran victoria y sumamos tres puntos más para el objetivo final... Último entreno antes del partido de mañana... Muchas felicidades por el alta @thomasvermaelen!! Siempre es especial ganar un derbi! Gran partido y tres puntos importantísimos!! Força Barça!!!! http://t.co/FDkzcNaJky Grande equipo!!! Ya estamos en semis!!! Força Barça!!\n\nWell done team!! We are in the semifinals!!! Força Barça!! http://t.co/XWHCpZNrhq Mañana nos queda un gran esfuerzo para pasar a semifinales! Last effort to reach semifinals! #FCBPSG #teamIniesta https://t.co/nOk4iYsgiW 3 puntos importantísimos! Qué grande compañeros... Un paso más hacia la Liga!! Gracias por todos los mensajes de apoyo. Estoy bien y mañana haremos pruebas para descartar lesión! A por la vuelta en casa! Força Barça!! Con @_Pedro17_ en el último entrenamiento antes del partidazo de mañana!! Força Barça!! http://t.co/0snK1veQVd Nos espera un partidazo contra el PSG! Preparado O Monstro @Tsilva3? #TeamIniesta #PSGFCB. https://t.co/Ppo4ezVQy7 Hola a todos, ya hemos abierto la inscripción para mi campus... Os dejo el link con toda la información!! http://t.co/lMBkx5C1Vv De vuelta a casa... Lástima de este empate. Hay que seguir!!!! Ahora Champions!!! Força Barça!! Buenas noches... espero que sea un gran fin de semana! Abrazos!! From now on you can stay whenever you want at @BodegaIniesta with @Airbnb: http://t.co/p7Y1LBn5ny https://t.co/gZrPOy7TAt A partir de ahora te podrás alojar siempre que quieras en @BodegaIniesta con @airbnb_es: http://t.co/p7Y1LBn5ny https://t.co/gZrPOy7TAt Seguimos sumando victorias!Grande equipo!! Pronto os podré contar novedades sobre mi Campus. El año pasado nos lo pasamos muy bien y este año vamos a repetir!!! http://t.co/fbptJQzfSZ 3 puntos más en una salida difícil. Ahora a seguir preparando un mes de abril muy competitivo! Es un placer colaborar con mis amigos de @Pallapupas con la subasta solidaria de mis botas... Aquí tenéis el link!! http://t.co/xDrpA7jNT7 Tres puntos importantes que nos permiten seguir peleando por la primera plaza! Gracias sevilla por el apoyo!! Terrible noticia. Un abrazo muy fuerte a todos y mis condolencias a familiares y amigos. Hay momentos que no se olvidan #LaFelicidadTieneUnColor http://t.co/CzHPbSMylp Força Barça!!\n\nVamos Barça!!\n\nCome on Barça!! http://t.co/nTu4qofx84 Último entreno antes del clásico de mañana!! Força Barça!\n\nLast training session before tomorrow's clasico!! Força Barça! RT @NissanEurope: Looking forward to it! #PSGFCB http://t.co/sf8gyVOv11 http://t.co/6YibYSedeq Aún estás a tiempo de conseguir mi camiseta firmada. Participa en el concurso del #ClásicoBBVA http://t.co/zey8ttW1tT http://t.co/ACZ8Gru7UC Grande equipo y afición. A cuartos!! http://t.co/W4EZJfhLwr A seguir sumando en la @ChampionsLeague! El miércoles partidazo! #genius http://t.co/UPfSuDlRTL ¡Con mi bodega sorteamos 2 entradas para el clásico! Entra en http://t.co/O3bQUrwt8g para saber cómo conseguirlas. http://t.co/suBb9rFDpj Victoria importante antes de una gran semana!! Felicidades Xavi, no hay palabras amigo! Vamos Barça!! Mañana toca Ipurúa!!! Força Barça! ¿Te imaginas haber podido ver el mundial igual que yo? ¡Con http://t.co/QfpDsCQpwq  será posible el próximo! https://t.co/Nfm2sV7PZT ¿Quieres mi camiseta firmada? Tendrás que ganártela en el concurso del #ClásicoBBVA. http://t.co/zey8ttW1tT http://t.co/pQbOtnh5WH Disfrutando del día libre. Tarde con los amigos! http://t.co/mHWggmeV3w RT @SeFutbol: ¡Únete a @sfw_tweets y a la @rfef\nen la lucha contra la obesidad infantil y viaja a Holanda a ver a la @SeFutbol! http://t.co… Gran mañana en el Camp Nou! Grande equipo, grande afición!! Força Barça!! http://t.co/xWxZOiDusi A la final!!!!!! Grande Barçaaaaaaaaaaaa!!!!! Finalizado el entrenamiento. Mañana partido que vale una final!! De vuelta a casa con otra victoria!! Ahora a preparar la Copa...!!! Rumbo a Granada! Mañana 90 minutos importantísimos... Vamos Barça! ¡Muy contento de poder dar la bienvenida a @BodegaIniesta a Instagram! http://t.co/7xc2LreZGa http://t.co/hbXcjhtSKc Grande Luis!!! Gran victoria equipo! Toca descansar y Granada!!! Força Barça! http://t.co/Kya8w1a8oc Finalizado el entrenamiento!! Mañana Champions!!! Força Barça!!! Dolidos por la derrota y más después de cómo estaban saliendo las cosas. Ya centrados en el importante partido del martes. Vamos Barça! No hay mejor nombre para nuestro campo de entrenamiento... Y mañana partido contra el Málaga! A seguir la racha!! http://t.co/1pLf2Ndidw Mis amigos del @VHIR_ desarrollan una metodología que ayuda a escoger el tratamiento más eficiente contra hepatitis C http://t.co/FbfjkqIqoT Grande equipo, otra victoria más!!! Seguimos sumando! Força Barça! En casita para descansar!!! A 90 minutos de una final. Gran trabajo equipo y gran afición!!! Vamos Barça! http://t.co/VpEAhMZya0 Gran victoria en un campo siempre complicadísimo!!! Grande equipo!! Vamos Barça! Último entrenamiento de la semana, mañana partido bonito en San Mamés. Vamos Barça!! Presento el libro de @Arcos y @Dabizdiverxo con mis platos favoritos. Consigue uno http://t.co/Th3fnSGx3m http://t.co/9JyhGsszC3 Mucha a fuerza a todos hoy y siempre. #DiaMundialcontraelCancer Grande equipo!!! Vamos Barça!! http://t.co/McWqbgPVjL A semis! Grande equipoo!!! RT @AnnaOrtiz34: Crea un estilo en tu mesa..encuentra los elementos que te ayudan a hacerlo @cotonetbois  #interiorismo #decoración http://… Buen resultado! Nos esperan 90min muy intensos en La Copa!! Grande afición en un día difícil. Vamos Barça!! http://t.co/A7lc9FdJRI Buena victoria fuera de casa y con sensaciones positivas! Ahora a por el partido contra el Atlético del miércoles. Esto no para! Força Barça Último entreno terminado antes del partido de mañana contra el Depor!! Feliz fin de semana a todos! :) Felicidades @AnnaOrtiz34 por un nuevo proyecto! Ha quedado muy bonito!! #familia #interiorismo http://t.co/FEvmtFdG03 Nos espera una gran eliminatoria contra el Atlético!! Compartiendo hobbies con la peque de la casa ☺️ http://t.co/26vnQ6l3ZG Entrando en la gala del Balón de Oro!! Muchas gracias a todos!!! http://t.co/hyOC22vAiy Grande equipo y afición!!!! Vamooooooos!!!! @3gerardpique http://t.co/4cCTknAAtD A un paso de cuartos. Ahora a pensar en el partido del domingo contra el Atlético. Todos juntos, força Barça!! Feliz año 2015 a todos!!!!!!! Happy new year everyone!!!!!! http://t.co/qkKKyZjoAm De vuelta de las vacaciones de Navidad! Primer entreno terminado!!! http://t.co/0ocunhTLSb @Dabizdiverxo @Arcos Encantadísimo pero creo que te destrozaría la cocina :)) Gran día ayer con la familia de @Arcos y el crack de los fogones @Dabizdiverxo http://t.co/kbW1KVTpg1 Os presento un nuevo proyecto solidario en el que participo: La Fundación Spiribol. Felices fiestas!! http://t.co/4L8osFVn83 ¡Felices fiestas! http://t.co/D4sCWXZFKL Os dejo una foto del otro día en la primera tienda de @BodegaIniesta en la Calle Riera Blanca num. 43 de Barcelona! http://t.co/CKHlbvjkFv Esta noche en @BodegaIniesta conociendo a los primeros huéspedes de @airbnb_es! Un placer que hayan podido venir! http://t.co/MmRImsmlf3 Repasando uno de mis grandes hobbies, los Playmobil. #recordando http://t.co/UG9jD55WWD You'll always be the greatest @EAbidalOfficial! A role model for me and very proud to meet you! http://t.co/RKU6ppl3lS Siempre serás el más grande, @EAbidalOfficial!! Un ejemplo para mi y un orgullo conocerte amigo! http://t.co/K1pewnPd7a Victoria para acabar bien el año en casa!! A descansar y volver a tope para todos los retos que tenemos por delante! Força Barça!! El guiño especial de Estrella #SóloporNavidad https://t.co/yZUhQNfzk6 Qué grandes momentos Titi!!! Fue un placer estar a tu lado! http://t.co/FPccYuSOkN Un paso más en la copa y ahora a octavos! Espectacular el reto de estos dos cracks a más de 7.500km de distancia http://t.co/7cuHevat6M #conlosojosvendados ¡Nos espera una gran eliminatoria contra el Manchester City!\n\nA great tie against Manchester City is awaiting us! Un mal resultado pero hay que seguir y seguir. Vamos Barça! Grande equipo... Pasamos como primeros de grupo!! Mañana vuelve la Champions. Necesitaremos todo vuestro apoyo como combustible #TeamIniesta #UCL http://t.co/CJpNlk49Zm Contentos por ganar el derbi... Ahora a pensar en la Champions!! Mañana derbi. Es un partido muy especial. Abrazo a todos ¿Mi combustible pre-partido? Entrenar duro y mucha concentración #CargandoBaterias #genius #UCL http://t.co/ejPt8KrZHR Contento por haber jugado después de estos días de lesión! Muy buenas sensaciones!! http://t.co/pj271B1BYI Esta mañana @annetavives me ha enseñado su nueva tipografía. Todos juntos sumando capacidades http://t.co/8bF4DtCyQF http://t.co/nca5QGa0Dm My @Airbnb friends and I invite you to live a special night in @BodegaIniesta #AirbnbIniesta http://t.co/pNp90FwDSu http://t.co/KOTT2wbtoY Con mis amigos de @Airbnb_es os invito a una experiencia única en @BodegaIniesta #NightAt http://t.co/pNp90FwDSu http://t.co/UW7r4v5TWG Final de infarto! 3 puntos muy importantes en un campo muy difícil. Felicidades compañeros! Partidazo equipo! Y victoria... Felicidades Leo, te sales!! Grande equipo!!! Te sales Leo, eres único, sin adjetivos! RT @VHIR_: Gracias @andresiniesta8, contigo daremos a conocer la investigación del @VHIR_ en nuestro #20VHIR aniversario http://t.co/2VWACr… Muchas felicidades @SeFutbol 1 millón de followers!! Gracias por todo el trabajo que hacéis... Empezando la semana y con muchas ganas de estar con mis compañeros! Vamossss!! http://t.co/viRrpLh1th Muchas felicidades equipo!! Remontada final y tres puntos!! ¡Mucha suerte compañeros! Tenemos que seguir trabajando y confiar en nosotros mismos. Todos juntos, equipo y afición. Força Barça! Quiero daros las gracias a todos los que en los momentos buenos y no tan buenos, habéis creído, creéis y confíais en mi. (2/2) Hoy hace 12 años que debuté con el Barça. Es un orgullo y un sueño! \n(1/2) http://t.co/7msc2Oj1kI Empiezo mi recuperación para estar lo antes posible con el equipo!! Força Barça! Perder estos partidos siempre duele más. Ahora a seguir mejorando. Mañana pruebas para ver como esta el sóleo. Esta mañana hemos hecho el último entreno antes del clásico! Vamos Barça! #classicFCB Os presento mi último spot con mis amigos de @sonyxperiaes. Sin duda #MejorConSonyZ3 http://t.co/JN3eTJX1YS #SOS Me han capturado! Será… #MejorConSonyZ3 http://t.co/QDbls0hkFQ Te espero en el #clasicoBBVA. Consigue en http://t.co/cio707TPO8 una de las entradas vip que sortea @WizzoEs http://t.co/Oem9IADjlK Con mi compi @JordiAlba! Muy contentos por el partido y las sensaciones. Ahora sí a pensar sólo en el Clásico!! http://t.co/T340dHdXBz Victoria trabajada!! Entramos en una semana muy importante: Champions + Clásico!! Vamos Barça!! Viendo el tráiler de la nueva de #DenzelWashington, The Equalizer, tiene muy buena pinta! #crack Muchas felicidades @LuisSuarez9 por este premio, enhorabuena! \n\nCongratulations Luis Suarez for this award! Muchas gracias a todos por este premio... Golden Foot 2014! http://t.co/MSnUfFjs8z De camino a Mónaco para la gala del Golden Foot! http://t.co/vOyFColGTN Contentos después de la victoria y las buenas sensaciones! Un orgullo llevar el brazalete de capitán! Grande equipo! http://t.co/i8SVKFEcqU Muchas felicidades por este campeonato @marcmarquez93. Crack! Saliendo para Luxemburgo. Jodidos por la derrota de ayer pero con ganas de jugar el domingo y ganar el partido. Enhorabuena a @grupoamiab y @ASpronaAlbacete por el #premioIntegra de @BBVA. La integración laboral es una realidad https://t.co/NffuPmErLx Recién llegado a la concentración! http://t.co/vj0Wy32Mpq De vuelta a casa después de una buena victoria!! Con @MarcBartra!! Un abzo a todos! http://t.co/iX75kGDFQK Gran victoria en casa, equipo!!! El martes nos espera un gran partido de Champions contra el PSG! Hoy no hemos conseguido desequilibrar el partido. Sumamos un punto y nos preparamos para el próximo! Muy contento por el partido y los tres puntos. El miércoles a Málaga. Vamos Barça! Primera victoria de la liguilla en un día muy especial para mí y mi familia. Hoy hace 18 años que llegué a La Masia. 1 abrazo! Força Barça! Empieza la Champions... Mañana primer partido en casa!\n\nThe Champions is back... First game at home tomorrow! http://t.co/K274AXzD4G Muy ilusionado por seguir un año más con mis amigos de @Arcos. Esta temporada te espero para cocinar juntos! http://t.co/MWA89epma7 Muy contento por haber conseguido esta victoria tan trabajada y por las sensaciones que he sentido en el campo. Un abrazo a todos! Sometimes you're chosen, sometimes you choose. Today was a good day! Thanks to @Nissan_ESP + @NissanEurope for the first delivered #Pulsar A veces tú eres el elegido, a veces quien elige eres tú. Gracias @Nissan_ESP @NissanEurope por este #Pulsar Gran día! http://t.co/Cxeqa7tKyi Hoy ha sido mi segundo entreno con el grupo. Y con muy buenas sensaciones! Os dejo una foto con mi compi @DaniAlvesD2 http://t.co/K12Ltiug5Q ¡Mucha suerte compañeros @SeFutbol en el primer partido de clasificación para la Eurocopa! Grande y trabajada victoria delante de un rival muy difícil... Grande equipo!!! Muy buenas sensaciones en el debut en Liga con nuestra afición! Hoy empieza la Liga! Mañana nos toca! Un abrazo Yo también me mojo por la ELA http://t.co/UjGY7eUMS3! Mis nominados son @estopaoficial @21LVA y @JordiAlba http://t.co/k2CLA2Ux79 Aprovechando el día libre para comer con los amigos en Casa Andrés. #Momentos #FaltaJordi http://t.co/RPDF9G1Lcy Nuestra presentación y con muchas ganas de que sea una gran temporada!! Força Barça! http://t.co/7hMSUHro4f Mañana es nuestra fiesta, la fiesta del Gamper!! Feliz domingo! Crea un calendario con tus fotos y las del #FCBarcelona en esta App: http://t.co/wiHvttI9lx Enhorabuena @baloncestofeb por este triunfo en Turquía!! Y en nada, el Mundial de basket!! Mucha suerte cracks!! http://t.co/0TMfZ6Q7bF Gracias a todos los que hicieron posible nuestro campus!! Te dejo el álbum con algunas fotos! 1abrazo http://t.co/TgMHNAZYoR RT @Nissan: Say hello to Nissan’s newest teammates @AndresIniesta8 and @ThiagoSilvaOff! #genius #UCL http://t.co/9GbJgmk7c5 Tercer partido y seguimos preparándonos, mañana descanso y semana que viene toda para entrenar!! 5 años sin ti. Te echo de menos amigo. \n\n5 years without you. I miss you my friend. http://t.co/fSDgoU0C96 Volvemos para Barcelona... Mal resultado pero seguimos preparándonos. Seguimos los entrenos ya en Barcelona... El miércoles jugamos en Ginebra! http://t.co/Wx5tWNsSD0 Todavía puedes participar en el concurso que estoy haciendo con @EstrellaDammEs!! Ojalá pudiera jugar con todos!! http://t.co/i4eVDIjzSK Contento de disputar el primer partido de esta temporada. A seguir preparándonos!! Antes de empezar la temporada ¿echamos unos toques? Gracias a los amigos de @EstrellaDammEs ¿Os animáis? http://t.co/i4eVDIjzSK Buenas noches a todos. Primer día en Inglaterra completado!! Tenemos una semana intensa de trabajo... Nos vemos!! http://t.co/q6hZxJboyt Primer día!! http://t.co/tq6w5EOR5C Cada 11 de julio es un día imborrable. Siempre quedará en nuestro recuerdo!! Un abrazo. Descansa en paz Alfredo Di Stéfano. Leyenda del fútbol. RT @sempremeslluny: Nuestros atletas están ready para cumplir en la travesía a Mallorca. Compra brazadas a 0,03€ para la ONG@pallapupas: ht… Hola a todos, hay pocas cosas que os pueda decir en estos momentos... La decepción por volver tan pronto a (cont) http://t.co/CTUClkf1hM Poco se puede decir después de este inicio. Reflexionar y ganar los dos próximos partidos. Todos juntos, ahora más que nunca @SeFutbol Completado nuestro primer día en Curitiba. Ya solo quedan cuatro días para el debut!! Todo el mundo puede tocar balón. Pero pocos se atreven a jugar bien. http://t.co/ldEJUzS4Hr  @Nike_Spain  #ArriesgaloTodo Ya estamos en Brasil!! Os dejo una foto desde nuestra concentración en Curitiba! http://t.co/vy9aegIJj7 Mis amigos de @Gol_Television han escondido 20 abonos por España con todo el Mundial gratis #GolTeRegalaelMundial http://t.co/P0ypMLZd3n Último ensayo antes de llegar a Brasil! Mañana nos vamos para Curitiba... Empieza la cuenta atrás! Todos somos @SeFutbol Es el momento. 'The Last Game. http://t.co/k1sJuWsgh2 @nike_spain #arriesgalotodo Después del entrenamiento, mañana partido y para Brasil!!!! @Guaje7Villa @_Pedro17_ @Javi8martinez http://t.co/ZQoNoDKFeu Gracias a la Smartband de @Sonyxperiaes podré registrar mi día a día durante el Mundial #AficiónZ2 http://t.co/k6PoEHk7Ap Me hace mucha ilusión presentaros mi nuevo helado 116. Gran experiencia prepararlo con mis amigos de Kalise http://t.co/ozZ8TlAnet Con mis amigos @SonyXperiaes nos podemos conocer y venir al partido del 18 en Brasil #AficionZ2 Participa! http://t.co/RbcVjp2DAI Nos vamos para Washington, última semana y amistoso antes de llegar a Brasil!!!! http://t.co/DLP1OJ6fV5 Último fin de semana con la familia antes de la aventura del mundial. Con muchas ganas e ilusión! Un abrazo a todos. http://t.co/81b2u7KMJN Último partido en España después de esta semana de concentración en las Rozas. Mañana el míster dará la lista de los 23 en @SeFutbol Estrella nunca falla, qué buen mensaje el de este año! http://t.co/hzLHo7ZpYP http://t.co/Wadi1UdSuF Me encanta la combinación Xperia Z2 con la SmartBand. #EscenarioSonyPS14 http://t.co/VbFlOdJGgW Felicidades al @AlbaceteBPSAD, a su afición, y a toda la ciudad. Os merecíais este momento! ...que el año que viene pelearemos por daros las alegrías que merecéis y merece este club. (2/2) Me siento tan mal que sólo siento decepción y desilusión. Gracias por vuestro apoyo y deciros... (1/2) Today the greatest one said goodbye. Thanks for everything captain! A pleasure and to have lived so many experiences. http://t.co/mgqOO4TkYm Hoy se ha despedido el más grande. Gracias por todo capi!! Un placer haber vivido tantas experiencias a tu lado. http://t.co/LIw3AFrk4j Qué final de liga nos espera el sábado. Con nuestra gente lo podemos conseguir! Estoy muy orgulloso porque este verano se celebra mi primer Campus de fútbol para niños y niñas entre 6 a 14 años! http://t.co/X1M71PdiN7 Hoy hace cinco años de uno de los momentos más felices de mi vida... Nunca lo olvidaré! http://t.co/TrZDDuyYyA No tengo palabras que deciros después del partido de hoy... Un abrazo. Mucha suerte a nuestro equipo de hockey. Mañana juega la F4 en el Palau. “@aitoregurrola: Només hi faltes tu!!! http://t.co/WjPaINkMLc” Jamás olvidaré a @nicolaicalabria y su superación http://t.co/gKNBdj933W #powerthrough http://t.co/ZgKX5n3Sgq Buenas noches amigos, os dejo este vídeo de mi amigo @13_Pinto... Gran labor de @pallapupas en los hospitales https://t.co/fnyQJ4nDhQ Circunstancias complicadas para jugar y hemos remontado un partido difícil. Grande equipo. Dedicada a ti, míster. http://t.co/TQcwY8Dj2c ... Mucha fuerza para tu familia! Descansa en paz míster. Un beso (2/2) http://t.co/M1YI3TgozD No tengo palabras. Has sido y serás un ejemplo, un orgullo formar parte de tu vida. Nunca te olvidaré... (1/2) Feliz Sant Jordi a todos!!!!! http://t.co/Zo8Q5UVUOl Llevé en mi @Honda_es Civic Tourer a 2 grandes @marcmarquez93 y @26_DaniPedrosa y lo pasamos así http://t.co/gzdzo4xRRA #ElPoderDeLosSueños Seguiremos trabajando y peleando hasta el último partido. Merecíamos esta victoria. Vamos Barça! Triste por la derrota y por no traer la copa a casa. Teníamos muchas ganas de daros una alegría. Hoy más que nunca, orgulloso de todos. Rumbo a Valencia para la gran final! Vamos Barça!!!!!! Muy ilusionado por presentaros un proyecto que hace años que quiero llevar a cabo. ¡¡Este verano arranca mi Campus!! http://t.co/P3o0jTOUC4 Es muy difícil encajar una derrota así... después de haber hecho tanto para ganar. El miércoles tenemos una gran final. Siempre Barça! Muy jodido por la eliminación. Duro momento que tenemos que superar juntos, equipo y afición. Rumbo a Madrid!! Mañana partidazo!! Vamos Barça!! Hoy es el último día para participar en el concurso de @Arcos para que nos podamos conocer antes de irme a Brasil. http://t.co/uFvtt1iEDa Hoy es el día del Deporte y la Paz. Erradiquemos la violencia en los estadios. #tarjetablanca ¡Felicidades @AlbaceteBPSAD! Gran victoria contra el Guadalajara. Tres más para seguir en la lucha!! Recuperar, descansar y el miércoles más!! Vamos Barça!!! Vamos juntos!!!! No importa el lugar, el partido más importante es el que estás jugando ▶ http://t.co/xwZxGLm8nx | @POWERADE #powerthrough #HayPower Ayer fue el día mundial de #ConcienciaciónAutismo. Os comparto este precioso vídeo. https://t.co/IYME7l8iT5 Orgulloso de nuestro equipo y afición... Nos esperan 90 minutos trepidantes. ¡Vamos Barça! http://t.co/N0wfAQla3O En casa después de haber entrenado... Mañana nos espera un partido apasionante! ¿Os apuntáis a que nos conozcamos antes de la aventura de este verano? http://t.co/8LglQkSUar http://t.co/wHWxbqf8Ji Derbi muy disputado y tres puntos importantísimos para seguir en la pelea. ¡Ahora a pensar en la champions! Noche demasiado triste.... Toda mi fuerza está contigo @1victorvaldes, hermano. Grande equipo! Partidazo! Fuimos valientes y fieles al estilo! Muy contento por el gol y por todo! Con @MarcBartra91 http://t.co/Z43kSJfQDG Muchas gracias @annetavives por el regalo, eres un ejemplo para todos. http://t.co/yIHn9QCEm9 El día del sorteo de Champions siempre es un día bonito. Nos ha tocado el Atlético y así lo veo: https://t.co/9FobcnVTNC Buenos días, ya queda menos para El Clásico de la Liga BBVA. Si queréis \nestar al tanto de todo, entrad en http://t.co/xc7mBTGHQX Os dejo una foto de este mediodía con Valeria! Feliz día del padre a todos! http://t.co/VdlxbLdsFb Dentro de un rato.... El príncipe!!!! Ahora te toca a ti hacer fácil lo difícil. ¿Aún no has visto lo que puedes hacer con BBVA wallet? No te lo creerás. http://t.co/IlF1gqSB3T Qué grande!! Gracias Victor!! \"@1victorvaldes Feliz por el golazo de mi hermano @andresiniesta8 [...] http://t.co/CJoiJ4m8gv\" Gran victoria... Felicidades Leo, te sales... Ahora a preparar esta semana importante!!! Este gol es muy especial! http://t.co/GsE1SpsLCV Hoy era un partido muy importante y muy especial!!! Gracias afición, juntos vamos hacia adelante!! Buenas noches. En nombre de Anna, mío y de nuestras familias no podíamos dejar de agradecer todas las (cont) http://t.co/4H2SMFtHUd Esta noche película con la familia. Alguna sugerencia? #nochedecine Ya estoy preparado para hacer magia en el campo. #Magista https://t.co/oMuRArFGDA Mis nuevas botas. Con ellas, el fútbol ya no volverá a ser igual. #Magista http://t.co/YjnDk5sDx0 Siempre es importante ganar... aunque sea un amistoso y delante de Italia! Preparando el mundial! Felicidades a Diego por el debut! Seguiré disfrutando a tu lado hasta el final de este año, un honor. Después lo mejor para ti! Ninguno como tu capi! http://t.co/fZ5yusR0j5 El rondo no es un simple ejercicio, es la base del juego de posesión, donde se crea la magia del fútbol. #Magista http://t.co/IePRMZTSlB Victoria importante que nos permite seguir sumando. Quedan 12 finales para terminar la liga.... A seguir confiando. En la Masía es donde se forman los mejores centrocampistas del mundo. Dirigir el juego es la clave. #Magista http://t.co/wHGupP2TDl A partir de ahora, el fútbol nunca volverá a ser igual. #Magista http://t.co/ef7K01xya0 Os dejo una foto de ayer con el gran @DANIROVIRA http://t.co/ZQBXQXvquv ¡Aquí os dejo mi primer mensaje de voz! https://t.co/ls7F8Us8tc Descubre mi faceta de superhéroe en #AmazingSpiderMan #SuMayorBatalla (http://t.co/KsKnh8mcuh) #MWC14 ¡Buenas noches a todos! Estupenda manera de animarnos a salir más! http://t.co/QDwzV7yLsj #EntrenaElAlma Derrota dura en un momento importante, nos han superado. No podemos bajar los brazos y hay que seguir. ¡Gran partido de Champions! Volvemos con un buen resultado... Sin embargo no podemos fiarnos del City. Vamos Barça! http://t.co/2gWFuXAjNi Muy contento por esta victoria! El martes vuelve la Champions, nos espera una eliminatoria muy difícil y competida! http://t.co/tf6dO6Wko3 ¡A la final! http://t.co/sBCK5VmrGv Importantísima victoria en Sevilla en un partido pasado por agua! Y el miércoles a por la final... Vamos equipo!!!! Hace unos meses grabé mi primer anuncio para @POWERADE como embajador global. La fuerza está en ser uno mismo. http://t.co/aye10Y43tc Buen resultado... A noventa minutos de una final. ¡¡Vamos equipo!! En casa preparado para ver la nueva serie @ElPrincipe_tv en Telecinco! Muy buena pinta... #feliznoche Un abrazo muy fuerte y mucho ánimo a todos los que estáis luchando contra el cáncer. http://t.co/9mooSt25MR Derrota dolorosa... A levantarse y ahora a preparar la copa!!! Som-hi Barça!!! Muchas gracias por todo lo que nos enseñaste, por todo lo que nos diste...Te recordaremos. Hasta siempre míster. DEP. http://t.co/6WxNJ1M0r0 Día de recuperación después del pase a semis. Muy contento por haber vuelto con el equipo con tan buenas sensaciones. ¡Un abrazo a todos! Gran victoria!!! Seguimos a tope!!! ¡Felicidades Ibi por estar de nuevo en la convocatoria después de tanto trabajo! http://t.co/a4Jmg2vyop Primera parte de la eliminatoria con resultado a favor, siempre complicado el campo del Levante... ¡Con ganas de estar a tope con el equipo! Lástima estos dos puntos, hay que seguir! Felicidades por el partido y el esfuerzo!!! Con ganas de volver con el equipo!! Todo un ejemplo para mi... ¡Mañana empieza la segunda vuelta! http://t.co/HhHonrFiYS Sigo con mi recuperación y espero estar pronto para entrenar con el equipo! Un privilegio estar un año más en el 11 de la FIFA junto a mis compis. Felicitar a Cristiano por el premio y a Leo y Ribery por su gran año! Partido de alta intensidad y muy disputado. Un punto importante y seguimos arriba! Feliz por esta ventaja para afrontar la vuelta! Grandísimo retorno de Leo! Vamos Barça! Feliz año! Happy new year! http://t.co/ipcIzloFeD Primer día de entrenamiento después de las vacaciones navideñas! Mañana último entreno del año ;) Esta noche en TV3 a las 21:50h \"Marcados por el 21\", el documental de Dani Jarque. Despedimos el año con victoria y líderes! Grande Pedro!!! http://t.co/d0NJ6cHjx6 Ya tenemos a @JordiAlba en Twitter!! Bienvenido fenómeno! ;) http://t.co/qkpdbxM1FL El lunes @BodegaIniesta anunciará la familia afortunada que vendrá a nuestra comida de navidad! Aún podéis participar http://t.co/WorIncI6fS ¿Queréis venir conmigo a celebrar las fiestas en @BodegaIniesta? Invitaremos a una familia a nuestra comida del 28! http://t.co/WorIncI6fS Despedimos el año en el estadio pasando a la siguiente ronda! ¿Qué os parece si celebramos las navidades juntos? El 28 las celebraré en mi bodega con el ganador de este sorteo! http://t.co/WorIncI6fS Vibrante eliminatoria que viviremos en febrero! Vamos Barça! \n\nWe will live an exciting knockout next February! Come on Barça! Muchas gracias Laura por este regalo... Una gran asesora de ilusiones desde @matarocat http://t.co/JwAVStB87m http://t.co/R6xRpc5iVi Aún podéis conseguir regalos de #LluviaDeAlbóndigas2! La semana que viene @sonypictures_es anunciará los ganadores http://t.co/YR04CEWbma Gran noche!! Gran partido!!! Felicidades equipo!!! http://t.co/udoedHiYj1 Mañana termina el concurso de @Arcos! ¿El premio? Todos los gastos pagados para venir a Albacete y conocernos! http://t.co/PCkPoJsr50 Gran victoria del equipo y pasamos como primeros de grupo! Gran noche!!! Ahora a por el partido de Liga! Abrazo a todos. Con @sonypictures_es hemos preparado un concurso sobre #LluviaDeAlbóndigas2. Podéis ganar entradas e ir a la premier! http://t.co/YR04CEWbma Es un orgullo colaborar con @quenofaltedena. Estas navidades, que nadie se quede sin jugar! http://t.co/Tp0xg9JPZt Con mis amigos de @sonypictures_es estamos preparando una sorpresa sobre #LluviaDeAlbóndigas2. ¡Os dejo el tráiler! http://t.co/RAT5iotvUh Preparado para ver a mi equipo... Qué alegría ver a Jordi Alba otra vez en el equipo! Primera parte de la eliminatoria! Apasionante grupo para empezar el Mundial... Vamos!!! @SeFutbol “Lo que cuenta en la vida no es el mero hecho de haber vivido. Son los cambios que hemos provocado en las vidas... http://t.co/vT0Kyz3kUp Dura derrota. Confianza máxima en nuestro equipo!! Vamos Barça! Después de celebrar mi santo con la familia! Toca descansar para mañana! Un abrazo y buen finde! http://t.co/Kk5OynloqK Hola a todos! Estoy preparando un evento con mis amigos de @Arcos para que nos podamos conocer y visitar su fábrica! http://t.co/q6gdTPBDWJ Mala primera parte donde nos han superado en juego, la segunda cambió. En casa tendremos que cerrar el grupo para quedar primeros! Mañana vuelve la Champions... Y en un estadio donde jugaré por primera vez! Buenas noches a todos!! Muy contento por la victoria... Seguimos sumando y trabajando para mejorar día a día! Ahora a por la Champions!! http://t.co/qRnyp6eHVw Hoy es el día #McHappyDay, os animo a participar y ayudar así a la @FundacionRonald! Mis amigos de Arcos tienen una sorpresa preparada para todos vosotros... ¿Te gustaría que nos pudiéramos conocer? http://t.co/q6gdTPBDWJ Nos vamos decepcionados por no haber podido ganar en nuestra vuelta a Sudáfrica. Espero que lo de Víctor sea lo menos posible. Ánimo Víctor! @siphiweshabba Nice! Last time we were in South Africa, I scored the final goal for the world. #CTR360 RT @siphiweshabba: Hey @andresiniesta8, last time Spain was in the country, I opened the scoring for the world. #CTR360 http://t.co/cebg5TB… Aquí os dejo... LA FOTO http://t.co/69S6v2ywO0 Nos esperan sensaciones únicas en nuestro regreso a Sudáfrica! Felicidades @MarcBartra91! http://t.co/0dYs3k4OvJ Buena victoria antes del parón por selecciones! Foto con @2Montoya! Ánimo Leo! http://t.co/xPkciKYoZQ Con el equipo de la película '¿Quién mató a Bambi?'. Muchas gracias @sonypictures_es por todo! http://t.co/1e3IT2829T Descarga la app http://t.co/VtV6ba4GoF o http://t.co/vQkW3GrBYC, apunta la foto con el móvil y descubre lo que miro. http://t.co/MROVP1P1jh Gran noche del equipo que nos ayuda a obtener la clasificación. ¡Ahora a por el primer puesto! Mañana partido importantísimo para la clasificación! Vamos equipo! Especulares las fotos que hay en http://t.co/q3p6v83ucy Muchas felicidades!! @theObjective_es Hay una de Kenia brutal. Aquí os dejo una foto del otro día con uno de los ganadores del concurso que hice... Todo un crack! http://t.co/r8w3pOrmNC Ganar el derbi siempre es diferente. El miércoles partido importante de Champions!  Vamos equipo!! RT @Mascherano: Gran victoria. 3 puntos más. Felicitaciones @andresiniesta8 por estos 11 años de mágia!!!! http://t.co/8KEZvDwKjY Nueva victoria... Seguimos la buena línea! Contento por celebrar con una victoria mi 11 aniversario! El viernes derbi en casa, esto no para! Hace 11 años que cumplí el sueño de debutar con el primer equipo del Barça. ¡Gracias a todos los que confiaron en mi! http://t.co/s6wcBPaPek Viendo a ver qué peli Denzel Washington veo esta noche!! ¿Para vosotros cuál es la mejor? Gracias @Rexonamen_es por animarnos a hacer más. #HazMás #Superación #BarçaReal #Ad http://t.co/8HwE5HsHuU Ya tengo los ganadores de las entradas del viernes. Aquí el link! http://t.co/csgqsZKHBo Muchas gracias por vuestras felicitaciones de ayer! Muy contento por cómo ha salido todo... Gran victoria equipo y afición!!!! http://t.co/mnTDSN1d88 Nos llevamos un punto en un partido muy trabajado... Seguimos líderes de grupo. Ahora a preparar el clásico del sábado!!! Un abrazo a todos. Ya estamos en Milán, mañana gran partido de Champions! Os dejo el link al concurso para el partido contra el Espanyol http://t.co/E2x7jZDNyL Lástima sólo haber sumado un punto, hemos tenido opciones para ganar después del gran esfuerzo... El martes más! http://t.co/Di81z2O94y ¡Aquí va la sorpresa! Sorteo dos entradas dobles para el partido contra el Espanyol y después podremos conocernos. http://t.co/csgqsZKHBo ¡Qué ilusión verte de nuevo convocado! Te lo mereces capi! @Carles5puyol http://t.co/Mg8nsw7uQR Inexplicable... Sólo puedo dar las gracias a todos! Ya estamos en el Mundial!Agradecido por vuestro cariño.@SeFutbol http://t.co/Ei6ot57bMb Hoy ha sido un día muy especial! Muchas gracias por todo! Mañana a disfrutar al máximo! 1 abrazo y buenas noches http://t.co/7Dgh8kDbMG RT @SergioRamos: En la tierra de un grande.. @andresiniesta8!! In the land of a great man.. http://t.co/1FZlsZsnF8 Os deja una foto de esta tarde aprovechando el día libre en Fuentealbilla. Buenas noches! http://t.co/LtIMlfwIEI Aquí os dejo cómo se hizo el anuncio de #BBVA http://t.co/bZLH0LjXvT Gracias a todos por vuestra ayuda y vuestro trabajo. Ha quedado genial! Más cerca de Brasil! Próxima parada Albacete... Qué ganas! Muy triste noticia la de hoy... Mi más sincero pésame para la familia de María de Villota. El día 15 jugamos con la selección en Albacete! Sin duda será muy especial. Mi bodega ha preparado muchas sorpresas! http://t.co/H9tP16bWz4 Victoria importante antes del parón para ir con la selección!! Tenemos que seguir trabajando....! Fiesta benéfica contra el cáncer. Retweet por favor! #espluguesdellobregat #bcn #cancer #lucha Todo el mundo tiene derecho a un trabajo decente. La OIT lo explica de cine #horatrabajodecente @OIT_ES http://t.co/6GNQw8JlIs Aquí estoy con #IkerCasillas @KDTrey5 y @JHarden13 en el último spot de #BBVA http://t.co/xRhfflq1i0 Qué cracks! Hola a todos. Sé que muchos habéis preguntado por la sorpresa y sobre lo que podía ser... Quería invitar a 4... http://t.co/H0H8DQ2mcP Victoria muy importante fuera de casa, gran partido del equipo. Aquí es dificilísimo ganar, qué ambientazo!! http://t.co/kyITBRst5X En el avión a punto de salir para Glasgow @1victorvaldes @SergiRoberto10 @MarcBartra91 http://t.co/EJ9JVzXrTT Esta semana tengo una sorpresa para todos vosotros! Después del partido de Champions os contaré más! Que terminéis de pasar un buen domingo! Dura victoria! Conseguimos 7 de 7 y ahora toca Champions! Gracias a todos!! Descansando en Almería! Mañana otro partido! Un abrazo! Ganas de cine y de ver este viernes #2GUNS la última de mi actor preferido Denzel Washington http://t.co/dxguAHOqp5 Día de descanso y aprovecho para una gran comida con @SesiMS81 en Casa Andrés, Tossa! http://t.co/PxksQxQvdO Sumamos una buena victoria fuera de casa, el martes más!! Ahora hacia Barcelona! Un abrazo a todos. http://t.co/S0bGD2ux5H Gran inicio de Champions!! Esto no para, así que mañana a preparar el partido de Liga. ¡Abrazo grande a todos! En casa preparado para ver @elconvidatTV3!! Qué ganas de verlo! Espero que os guste. Un abrazo a todos! Victoria in extremis... Grande equipo y afición. El miércoles llega la Champions!! En casa después del partido, ya con la familia! Un abrazo a todos y gracias por los mensajes! Qué gran escapada en el día libre, la vendimia ha empezado y hoy he podido vivirla. @BodegaIniesta a tope!!!!! http://t.co/wg0M8ofWUI Paso muy importante para la clasificación... Muy contentos por haber podido conseguir la victoria! En Finlandia, os dejo esta foto, con mi nuevo #XperiaZ1 de @SonyXperia durante el entrenamiento. Grande el time shift http://t.co/acC2ckMIPp Grandísima victoria y sumamos tres puntos muy difíciles fuera de casa! Se nos complicó pero aguantamos muy bien. Os dejo una foto del otro día celebrando el cumpleaños de mi hermana! ¡Buenas noches a todos! http://t.co/Layyi41Agu En breve empieza la champions,  competición apasionante! En la champions no hay rival fácil! Reencuentro con Bojan! Os dejo una foto de ayer después del partido. ¡Campeones! http://t.co/eYPvK41F86 Chicos, acabo de llegar y me estoy preparando para el enuentro digital. Os dejo el link donde estaré conectado: http://t.co/C5Qf4tI8Uf Hola a todos, nos vemos finalmente a las 13h en la página de Facebook de @Arcos para que me preguntéis todo aquello que queráis! ¡Qué ganas! El jueves a las 12h (Esp), contestaré vuestras preguntas en la página de Facebook de @Arcos https://t.co/PuYwJVCYMM ¡Hasta el Jueves! Gran victoria fuera de casa, ¡la primera de la temporada! Grande @1victorvaldes , ¡te sales! Nos esperan 90 min muy intensos en nuestro campo! Siempre es importante marcar fuera. Un abrazo a todos y nos vemos en el Camp Nou! Un año más con la Liga llega la colección de cromos de toda la vida.... :) http://t.co/Oa8PacRxZv Gran inicio de Liga! Nos espera una temporada repleta de grandes objetivos... Ahora a por la Supercopa! Ya en el aeropuerto después de haber ganado... Unas horitas y en casita!! Muchas gracias a toda la gente de Ecuador! Reencuentro con @Thi_Alcantara91 ! A entrenar y mañana partido!! http://t.co/WWOC7g8iaI Ya estamos en Ecuador!! Aprovecho para compartir con vosotros el making of del anuncio de Kalise! 1 abrazo! http://t.co/vNffTwYCvR Os dejo una foto de ayer con mi mujer antes de viajar en un rato con la selección!! Un abrazo!!! http://t.co/hmgEypgov3 Se termina la gira! Muchas gracias a toda la gente con la que hemos compartido estos días! En breve a casa con la familia! Un abrazo a todos Hoy es 8 de agosto, un día señalado pero no diferente a cualquier otro desde aquel 2009. Se hace muy difícil. Dani, te echo de menos amigo! Contento por poder disputar mi primer partido en Tailandia! Gracias a la gente por el cariño!! Mañana viaje! http://t.co/GQZd9nFIaU Hace unos años en Tocopilla (Chile) sufrieron un terremoto muy fuerte. Siguen necesitando reconstrucción y médicos, Ya!!! Dar las gracias a la gente de Israel y Palestina por su cariño de estos días, saliendo para Bangkok! Con @13_Pinto http://t.co/ASo0FfV11U Gran noche en nuestro estadio y con el  gamper más solidario! Mañana de gira! Empieza el Partido con un minuto de silencio por la muerte de Ramallets. Descansa en paz. Mazazo. Es una noticia que nunca quieres leer, descansa en paz Christian. Un abrazo muy fuerte para la familia. Mateo y otros niños te necesitan. Buscamos #MedulaparaMateo. Te lo explicamos en http://t.co/fG7Te0icNE Ayudar es muy fácil!! RT!! Triste por el trágico accidente de ayer en Galicia. Sin palabras suficientes d consuelo para las familias afectadas. Abrazo desde el corazón De vacaciones con la familia!! Un abrazo a todos y gracias por vuestro apoyo y cariño!! http://t.co/55nfPySfs1 Felicitar al equipo por el grandísimo torneo, por el esfuerzo. De todo hay que aprender. El año que viene... http://t.co/5m72Pg5qT5 Mañana es la gran final, la final soñada en Maracaná! Lo daremos todo para intentar volver a casa con la Copa!!... http://t.co/pGSrQgRHBp Qué semifinal tan increíble, estamos en la final... Máxima felicidad!! Ahora a descansar y a prepararnos bien!!... http://t.co/JmhBCQNeiJ Desde Brasil y antes de finalizar la temporada, me gustaría presentaros a mis amigos de @Arcos ¡Os sorprenderán! http://t.co/l2zBpsEOGO Nos espera una dura semifinal. Muy contentos por haber ganado los 3 partidos de la liguilla! Un abrazo a todos!\nhttp://t.co/qQW6rtoR3Q Otra victoria y nos ponemos con 6 puntos. Agradecer a la torcida su carinño... Jugar en Maracaná es la bomba! http://t.co/Ad3hcpaZ49 Felicidades a la sub-21!! En especial para mis compañeros del barça y a @Thi_Alcantara91 por su hattrick!!!! @sefutbol Buenos días desde Brasil! Os dejo el último anuncio de Kalise que grabé hace unas semanas. http://t.co/FPP0LIWLiN #Kaliseparatodos Gran partido del equipo, siempre es importante empezar ganando... mañana para Rio! un abrazo a todos! http://t.co/qMz7xqk3h9 Aquí os dejo una foto con Sergio en el escenario de mañana! Un abrazo! http://t.co/49cFc57IUs Nos vamos para Brasil mañana con buenas sensaciones... deseando que todo vaya muy bien! un abrazo!! Bajo la lluvia en New york! Os dejo una foto con mis amigos Raúl y Fernando!! Qué cracks! http://t.co/muIPSgMyIU El grupo @daigualoficial ha hecho esta canción para mis amigos de la @FundacionRonald! https://t.co/unqxk6Q0Q0 Muchas felicidades por tus 8 Rafa!! Y felicidades también a Ferrer por ser uno de los grandes y demostrarlo de nuevo... Ha sido muy especial haber llevado el brazalete de capitán de la selección. #SueñoCumplido Primer amistoso en estados unidos antes de jugar la Copa Confederaciones!! Mañana para Nueva York. Buenos días desde Miami, aquí os dejo una foto del partido de anoche, gran experiencia... http://t.co/sBI4KhpJCj Dirección al aeropuerto y para Miami... Con el gran @PReina25, bienvenido a Twitter! He publicado una foto nueva en Facebook http://t.co/ZQpJsAk6pe En casa a punto de salir a jugar el partido más especial! Nos vemos todos a las 21h en el partido para Dani! A... http://t.co/nk9iXaEMud Esta mañana en el acto con mis amigos de Simon! Un abrazo! http://t.co/jizX1vjVdZ Que lástima, que partidazo habéis hecho, a un paso nos hemos quedado. Ánimo a todos y a seguir confiando en que... http://t.co/rX2PQs5W7Z Mañana es un día muy especial, os espero a todos en el partido de homenaje a Dani Jarque! No podéis faltar!! Aquí... http://t.co/KOCSIftXau Todos al campo a ayudar a nuestros jugadores! Juntos podemos http://t.co/RqkdiPhEjv Grandiosa temporada!!! Qué gran despedida en todos los sentidos! Te queremos Abi! Un abrazo! http://t.co/XtZV5siGMP Hoy es el día de Castilla la Mancha! Muchas felicidades paisanos! Qué grande eres Abi!! Qué emotivo e increíble tener el placer de conocerte... Grande equipo! Felicidadessssss! Qué gran tarde de pádel, todo un privilegio jugar con @fbelasteguin #SergiBruguera y @SesiMS81\nhttp://t.co/kPslwbtY5R Hoy a las 20h (España) voy hacer un Hangout con @pato7oficial para inaugurar mi página en Google+! Os dejo el enlace http://t.co/AzS9QUIU54 Esto es para todos vosotros! Ha sido maravilloso levantar mi sexta Liga con mi hermano... Un orgullo!! Muchas... http://t.co/FWF35y0jNs Felicidades a todos los barcelonistas! Esto no se detiene... http://t.co/cnPYk6G1Pw De Rúa!!!!!!! http://t.co/naAcfKn5DA Feliz por esta Liga. Ha costado muchísimo, qué bien que sabe ganarla! Gracias a todos!  http://t.co/OLSkerPWou El mejor regalo, cumplir 29 y ganar la liga... El premio al trabajo de todo el año!!!!!! Vamossssss... http://t.co/geV2KOtuKK ¡Gracias por vuestras felicitaciones! http://t.co/uI3M0EOz8D En casa después del entreno de esta mañana... Preparando el partido del domingo!! 1 abrazo a todos. Gran paso hacia el título! Lo tenemos muy cerca!! Grande equipo! http://t.co/qsGYiLLWS2 Buenas noches a todos, antes de ir a dormir quería felicitar a todas las madres por el día que les espera mañana,... http://t.co/zFxmJiKagS Muy dura eliminatoria. Agradecer a la gente toda su fuerza desde que hemos llegado con el autobús hasta el final... http://t.co/abPuS6R3AD En el último suspiro se nos fueron los tres puntos pero más cerca está la liga. Ahora todo al miércoles! Un abrazo! Muy duro lo de esta noche, nos han superado. Toca levantarse y luchar hasta el final. Ya en Munich después de comer, ahora un poco de descanso y esta tarde entrenamiento en el estadio. Un fuerte abrazo a todos!! Después de un gran paseo en bici con mi mujer Anna y nuestra hija Valeria...!! http://t.co/vOZsAfzqe4 3 puntazos hoy y tenemos muy cerca el objetivo! Mucha suerte para la Titan Desert @eva_asdent @irontriax @christribike ! Qué proyecto tan bonito! #Nacho http://t.co/JQo9oLQZiN Nada como el deporte para llevar una vida sana!! Un buen mensaje antes de empezar el entreno de hoy #ysinoslevantamos http://t.co/6jDW0TV2TH Aquí os dejo una foto con el ganador del concurso #IniestaKratos #GOWAscension #PS3 http://t.co/LdDfrjx32F Después de la triste noticia de ayer y viendo las imágenes durante el día de hoy, me parece increíble que puedan... http://t.co/IFcgc2FRAa Qué grande equipo! Tres puntos más y una jornada menos! Con 2 grandes, muy grandes!!! @1victorvaldes @Carles5puyol Muchas felicidades Capi!!!!!!! http://t.co/7kszKaVC33 Hace dos semanas pasé un rato increíble entrenando con el equipo de @FCBFutbolsala ! Apasionante semifinal que nos espera! Grande equipo y afición!! Estamos en semifinales, qué felicidad!! Os dejo una foto con una visita muy especial...! http://t.co/gzBWSUEbaW El sábado hizo 1000 días, del día más feliz de mi vida. Descubre porqué entre los tuits de @sefutbol Gran partido equipo!! Una jornada menos y mantenemos la distancia! Ahora la mente en el miércoles. Afición y... http://t.co/jZWFmKoP7w RT @AlbaceteBPSAD: Humor 100 % Albacete http://t.co/MFDjJC0ShX Hoy mi peke cumple 2 añitos!!  http://t.co/CWEanIEDuz Gran partido, lástima el final pero vamos con un buen resultado y sabiendo que para estar en semis tendremos que... http://t.co/wtketZQiYQ Grande @AlbaceteBPSAD!! Importantísima victoria en Cádiz!! Felicidades!! Lástima de gol final, teníamos los tres puntos. Estos dos días a preparar bien el partido difícil de París. Lo mejor de todo, vuelve Abi! Grande! http://t.co/ZVEXGjXl1p Con mi hermano! Qué paradas y qué partidazo! Qué triunfo! Grande equipo! Nos ponemos primeros! http://t.co/8wOkw0ibUJ Un abrazo muy grande a Pete Mickeal, mucho ánimo y que te recuperes muy pronto! Duro empate por lo que se ha podido ver pero esto sigue y el martes tenemos otro! Un abrazo!\n\nTough draw for what... http://t.co/lbwa0sR3Hy El Fútbol Sala es donde todo empezó para mí: http://t.co/gI1RiOQOZ7 #MiPista #TeamNike Antes de ir a entrenar quería compartir con vosotros la nueva página web de la Selección Española de Fútbol... http://t.co/DhG3udlYjc ¿Quieres jugar conmigo una partida a #GOWAscension con #PS3? Participa respondiendo en qué me parezco a Kratos seguido de #IniestaKratos Grande equipo!!! Gran desgaste pero bonita recompensa!! Ahora toca selección! Desde la página de mi bodega sorteamos 2 entradas para los partidos de la semana que viene que jugamos con la... http://t.co/FsizPDPyFG Buenos días! Nos espera un apasionante cruce con el PSG! Un abrazo a todos! Incredible teammates and fans, you have carried us to the win, you are the best!! Together we are unstoppable!!!! http://t.co/4CpibUAMKk Increíble compañeros y afición, nos habéis llevado en volandas, sois los mejores. Unidos somos imparables!!!  http://t.co/4CpibUAMKk Tres puntos más y una jornada menos!! Ahora martes, martes y martes! Comiendo en la ciudad deportiva después del entreno de esta tarde!! Som-hi barça!! http://t.co/E1OCZTlDB7 RT @sonyxperiaes: Aquí la foto de equipo con los primeros compradores de #XperiaZ http://t.co/gU6dGkUMR6 Semana dura, toca recuperarse de todo y volver a tener buenas sensaciones. Y lo haremos! Dura eliminatoria a un paso de la final pero tenemos por delante cosas que hacer y hay que pelearlas hasta el... http://t.co/zd7ymD98iv Ya en casa muy contento después de la victoria de hoy! Ahora a descansar para afrontar un semana muy intensa!! http://t.co/xl1xHGSl9x Empezamos mal la eliminatoria pero en casa toca remontada. Confianza! Viajamos en breve para Milan! Mañana vuelve la Champions! Un abrazo! http://t.co/Gy9SDmvu Mis amigos de honda se han sumado a la iniciativa solidaria de la Cruz Roja. Por cada km recorrido Honda donará 1... http://t.co/c2adnHOJ Esta noche he ido al teatro a ver al gran @Goyojimenez! Brutal! http://t.co/P62GeF91 Otro pasito más delante de un difícil equipo de batir! Vuelve la Champions! Samana de preparación y recuperación!! Sábado contra el granada! http://t.co/A9FijWqc Desacreditados, es el cortometraje donde participa mi cuñada. Se estrena este sábado en Arenys de mar! Mucha suerte! Saliendo de la gala del mundo deportivo! Muchas gracias por este premio, mejor deportista español del año!! http://t.co/WaEJ0Woj Cómo te cuidas! “@cesc4official: Ya sabéis que mi plato favorito es el Sushi, pero nunca antes lo había comido ... http://t.co/U1pu0CFO” Muchas Felicidades, Campeones de la Copa del Rey!! Os lo merecéis! Recuperando piernas con el @Guaje7villa después del esfuerzo!! Qué gran mañana! http://t.co/EZdRJqQj Vaya partidazooooo de básquet!! Copa del Rey en estado puro!!! Enhorabuena compañeros!!!! Muchas felicidades por tus 100 partidos Puyi! Todo un ejemplo a seguir!! Contentos por la victoria y las sensacion... https://t.co/1qkPyM0a Hola desde Qatar!! Ya podéis participar en la promoción de Gol Televisión y conseguir un mes gratis por ser mis... http://t.co/JaHlBVY9 Buenas noches a todos, ya estamos en Qatar!  http://t.co/LEqdvTEh Partido muy intenso en Valencia, un punto más!! Ahora para Madrid que mañana nos vamos con la selección! Documental increíble, impresionante!! Siempre hay que recordar los inicios y de donde vienes...! http://t.co/Me81ROVK Qué lástima el empate final, pero felicidades equipo! Tenemos la vuelta en casa. Aquí os dejo el blog culinario de mi cuñada! Es una crack...\n http://t.co/J94iURCr Gran victoria compañeros!! Ahora a preparar el partido de Copa del miércoles!! 1 abrazo a todos. Gran semifinal de la Selección Española de balonmano! Enhorabuena por la clasificación a la final, mucha suerte!!!! http://t.co/X0QpuflC Gran pase a las semifinales de Copa!! Muy contento por cómo ha salido todo! 1 abrazoo! http://t.co/TlU0dvMs No hemos podido evitar nuestra primera derrota en liga. Lo intentamos hasta el final pero no ha podido ser! Ahora a pensar en la Copa!! Aprovechando la mañana libre para reunirme con mi equipo de trabajo! Esta tarde después de entreno nos vamos para... http://t.co/1bMe4JZ4 @Eva_Asdent @Christribike @Irontriax van a competir en la titan desert para recaudar fondos para la enfermedad de dent http://t.co/nNSbVgRJ Duro momento final pero ésto es la copa y estaremos preparados para ir a ganar a Málaga . Gran esfuerzo equipo! A seguir! Muy contento por cerrar esta primera vuelta con otra victoria y con grandes sensaciones! Grande equipo!!!! http://t.co/jdOU89mH Gran victoria para pasar de ronda en la Copa! Ahora a seguir pensando en la Liga! 1 abrazo a todos y buenas noches! Muchas felicidades Leo! Ha sido un placer volver a estar aquí, todo un orgullo! En el hotel antes de irnos para la gala! Muchas gracias a todos por vuestros mensajes! http://t.co/eQ68c86K Con mis compis en la gala!\n\nWith my mates at the show! http://t.co/HELxtBjm En casa contento después de ganar el derbi! Ahora estoy abriendo los regalos de reyes con la familia! Os dejo una...\nhttps://t.co/2iXYOpHH Espero que tengáis una gran tarde de reyes y disfrutéis de la cabalgata! Acabo de ver que Tarantino estrena su última película, Django. Me encanta este director! Comparto el trailer :) https://t.co/iHd5P8ip Feliz 2013! http://t.co/WoAwd78l En Fuentealbilla aprovechando para desconectar estos últimos días de fiestas! http://t.co/LejXdGN1 Yendo a inaugurar la ciudad deportiva del Alba, que llevará mi nombre. Un día muy muy especial. Feliz Navidad!! Bon Nadal!! Merry Christmas!!\nhttps://t.co/pgwYQ7ka Despedimos el año con una nueva victoria que se la podemos dedicar a nuestro Míster!! Después de la gran noticia que todo ha ido bien, seguimos mandándote energía positiva míster! Contentos por la victoria y por poder aumentar la distancia con los rivales... Hoy noche de copa, mucha suerte compañeros! Como sabéis estoy preparando con mi Bodega una sorpresa muy especial... http://t.co/V9eeLrrb Que intensidad y que bien saben estos tres puntos, grande equipo!! Muchas felicidades Leo... Impresionante lo tuyo! Mi Bodega ya ha empezado su campaña de Navidad y lo ha hecho con una sorpresa muy muy especial. Os atrevéis a jugar...\nhttps://t.co/q4I0zTHB En el campo listo para ver a mis compañeros y terminar el grupo de Champions! http://t.co/ApuL3tYn Estoy ayudando a mi amigo Carlitos en su proyecto @kickatkrisis, la rifa más grande de esta navidades. http://t.co/Q0jNYMKc Muy feliz por la victoria... Sumamos tres puntos importantes en un partido muy intenso. A seguir trabajando!!! Hoy ha venido a verme mi amiga @annetavives !! Me ha explicado porqué ha decidido crear su propia letra... Me encanta! http://t.co/ZA7sPz4L Gracias por todos los mensajes por la noticia de estar entre los finalistas al balon de oro!! En el camp nou listo para ver a mis compañeros. Vamos Barça!! http://t.co/zs6NFQx7 Tu humildad te hace grande @albaceteBPSAD, ¡El Alba te necesita más que nunca!  #Compra1accióndelalba Muy feliz por la victoria en una salida muy difícil y por haber podido ayudar al equipo! Piel de gallina al ver... http://t.co/NbRIqAPQ Hoy es el día McHappy Day, os animo a participar y ayudar así a la Fundación Infantil Ronald McDonald! https://t.co/RSP7qs1Z Haciendo algunos ejercicios en la ciudad deportiva con mi amigo @Guaje7Villa!! http://t.co/Y36vpcgn Objetivo conseguido! Muy feliz desde la fría Rusia! http://t.co/di7QAMZq Buena victoria para seguir sumando puntos... Mañana nos vamos a Russia. Volvemos para casita en breve, gracias a la gente de Panamá por su cariño!! Jugar en el estadio Rommel Fernandez ha sido muy bonito. Aquí os dejo una foto con las cracks de sony mobile! Ahora en el aeropuerto, nos esperan 11 horas de viaje a Panamá! http://t.co/PYOkVJC6 Importante seguir sumando de tres en tres!! Un abrazo a todos! Derrota que nos hace seguir peleando por el primer puesto. Jugadas aisladas que han provocado que se nos vaya... http://t.co/IDByEa5H Grandísimo esfuerzo por conseguir la victoria! Muy contento por las sensaciones del equipo. Muchas felicidades a Leo y Antonella! Enhorabuena... Me alegro mucho que todo haya salido bien!! Hoy ha sido un gran día! He ido al cine con los ganadores del concurso que hice hace 2 semanas! Muchas gracias a todos!\nhttp://t.co/3u6WkBpp Paso importante para seguir en la Copa!! Contento por haber podido ayudar al equipo con un gol! Volvemos para... http://t.co/OJUZzFRE Muchas gracias a todos por las felicitaciones! Ha sido un día muy especial! Espero compartir muchos más! Muchas felicidades a @lorenzo99 y @marcmarquez93 !! Que grandeees!! Buenísima victoria y seguimos sumando de tres en tres! Muchas felicidades Iker y Xavi! Os lo merecéis! Es un orgullo ser compañero vuestro! Aquí va la peli de la semana... Un saludo!  https://t.co/ShLzNmY3 11 millones de gracias! Pronto os explicaré una sorpresa para celebrarlo. Esto es gracias a vosotros!!\n\n11... http://t.co/HzR5iXGJ Qué bien sabe ganar al final, hemos hecho méritos para conseguirlo antes pero hemos insistido hasta el final y... http://t.co/awU04Tnx Vaya partido más loco!! Primer objetivo de toda la maratón de partidos que nos quedan por delante!! Felicidades de... http://t.co/aAJ1Jk9c Hola a todos, el lunes termina el concurso para ir a ver conmigo al cine la nueva de James Bond, Skyfall!! Os... http://t.co/6EPTt5TN En la ciudad deportiva después del entreno de hoy. Le quiero enviar un beso muy fuerte a todas las mujeres que... https://t.co/hvjtOfaz Duro empate al final del partido y con muy mal sabor de boca por los lesionados. Hoy hemos entrenado en el Calderón! Mañana partidazo contra Francia! Os dejo una foto en el campo... Buenas noches! http://t.co/AoOYZwUV Gran victoria en mi 75 partido con la selección!! Felicidades a Pedro por su hattrick! Ahora a preparar el (cont) http://t.co/GLyK7J5I http://t.co/58zjXwOr Buenos días a todos! Desde la fría Bielorrusia me gustaría proponeros si queréis venir (cont) http://t.co/EWhxSElM En breve subiré una sorpresa que hemos preparado con mis amigos de @sonypictures_es ... Grandísimo esfuerzo del equipo con una afición increíble. Una lástima que no hayamos podido sumar los 3 puntos.... http://t.co/fRRpOfh8 Importantísimos los tres puntos, empañados por la lesión de Puyi, mucho animo capi! Camino a Lisboa!!! Muy feliz de volver a estar con los compañeros! Os dejo una foto con un crack!! http://t.co/3ugHDOUq http://t.co/3wCX6wTx / Muy muy contento por estar de nuevo en la convocatoria para el próximo partido, han (cont) http://t.co/y4QT3RwP Qué partidazo, muchas felicidades compañeros! Qué mal se pasa desde casa... Partido de infarto!! Nos ha costado mucho pero finalmente hemos podido sumar los 3 puntos, que golazo de Xavi!!... http://t.co/oMOnS7Vx Muchas felicidades equipo por esta primera victoria en Champions. Que ganas tengo de poder estar con los compañeros de nuevo... Gran victoria, felicidades compañeros! Se hace difícil verlo desde casa... Espero poder estar pronto de vuelta. Comenzamos bien con tres puntos, que complicado ha sido... Ayer terminaron los juegos paraolímpicos de Londres 2012, con una increíble participación de nuestros atletas, 42... http://t.co/Ia8exqkr Este mediodía comiendo con el equipo en Santiago!! Mañana para Georgia!! http://t.co/peD5IevH Partido para preparar el primer partido oficial de clasificación al Mundial! Contento por la vuelta del Guaje!!!! Esta noche he vuelto a vivir uno de esos momentos mágicos en mi estadio con mi afición, gracias por este... http://t.co/G4ytLILH Después del gran día de ayer, en casa con amigos antes de cenar!! http://t.co/KoNp5Xzi Muchas gracias a todos!!! Lo quiero compartir con todos vosotros, con los compañeros... Con todo el mundo!!... http://t.co/BT5xd6L2 De camino a Mónaco!\n\nGo to Mónaco! http://t.co/4bbmNSBJ No hemos podido ganar este primer título, lo hemos intentado hasta el final. Esto sigue y el domingo tenemos liga! Força Barça. En casa descansando... aquí os dejo el anuncio que he hecho junto a Sergio Ramos, Soldado y Navas de GolT http://t.co/2u0WJzOi Al final conseguimos tres puntos buenísimos en un campo siempre difícil, a prepararnos para el miércoles! Contento por la victoria, las sensaciones y el juego que hemos hecho! Ahora toca ir al Bernabéu que aún quedan 90min! http://t.co/99fM54aJ Buenas noches a todos! Mañana primer partido en el Camp Nou, empieza la Liga!!! Antes de ir a dormir os presento a  mi amigo @sesiMS81 de Casa Andrés! Os servirá la mejor paella de Tossa!! http://t.co/1ikb5lvA Mañana se estrena Piratas, espero que os guste mucho, fue toda una experiencia poner mi voz al personaje Albino... Al abordaje!!! Primer partido después de la Eurocopa y muy contento por como ha ido todo! Muchas gracias a toda la gente de... http://t.co/iN85soeU http://t.co/qlb0qTFz En el aeropuerto a punto de salir para Puerto Rico! Antes de irme comentaros que (cont) http://t.co/EL5UL8L7 En casa viendo el precioso acto de clausura de los Juegos Olímpicos, muchas gracias a todos los atletas que nos... http://t.co/j06J6paN Último partido antes de empezar la liga, hay ganas de empezar la competición!! Muy, muy contento de volver a estar con Fontas y Villa! Today is 3 years without Dani Jarque, but I can assure that I'll never forget you, my friend. http://t.co/B2Wk0lrD Ya está aquí @13_Pinto! un fuerte abrazo! Primer partido de pretemporada y primeros minutos de juego!! A seguir cogiendo ritmo y minutos.\n\nFirst preseason... http://t.co/OU0FWtmb Primer día de entreno!! Muy contento de reencontrarme con los compañeros!! http://t.co/w1hZQIRQ First day of training! Very happy to meet with my colleagues! http://t.co/sWC34hMc Esta mañana he hecho la presentación de la película \"Piratas\" en mi Bodega junto a mis amigos de Sony Pictures!!... http://t.co/Hrhon8NO Solo quiero aclarar que nuestra única boda fue el domingo. Estamos en México de luna de miel! Me acabo de despertar y hoy es un día de muchos recuerdos, hace dos años que ganamos la Copa del Mundo, todas las emociones siguen intactas! http://t.co/OZiQ2DkA / Aquí os dejo el espectacular pastel de nuestra boda. Gracias a la familia Farga y a (cont) http://t.co/kjHdgGjY Después de todas las emociones de ayer nos vamos de cine a ver The Amazing Spiderman que me la han recomendado!!!... http://t.co/BqTrNsAD Un dia increible! Recién casados.\nAmazing day! Just married. http://t.co/jg3lj4aZ Gracias a todos por participar con vuestras preguntas! Un abrazo. Estaré unos minutos más, aún podéis hacer vuestras preguntas! http://t.co/o7bSzsXl Empiezo ya la @twitcam!! Entra en el enlace y pregúntame lo que quieras!!\n\nhttp://t.co/o7bSzsXl I'm starting my @twitcam! click the link and ask anything you want!  http://t.co/o7bSzsXl http://t.co/1g6l0zhJ - Empiezo ya la @twitcam!! Entra en el enlace y pregúntame lo que quieras!! RT @twitcam: We just learned that Andres Iniesta ( EURO2012’s MVP) will be LIVE today at 1 PM ET! Follow him: @andresiniesta8 for the li ... Hola a todos! Hoy a las 19h haré mi 1er Video Chat en directo para que podáis preguntarme lo que queráis. Os pasaré el link, estar atentos! Hi everyone! I'll do my first Live Video Chat so you can ask me anything you want. I’ll send you the link later, pay attention! Hola! Avui a les 19h faré el meu primer Video Chat en directe i em podreu fer les preguntes que vulgueu. Us passaré el link, esteu atents! Maravilloso!! Esto es mágico! Va por todos vosotros, os lo merecéis!!!! http://t.co/dyfsMrYe Great! This is amazing! This is for everybody, you deserve it! http://t.co/aj3KuPrm Mañana, aquí, tenemos una ocasión única! Vamos equipo!! http://t.co/GppGQHc9 Aprovechando el día tranquilo para mirar un poco internet y desconectar... Que os parece el trailer the amazing (cont) http://t.co/irB923X6 Que felicidad!!!! Estamos en la final!! Que grande es este equipo! Gracias a todos!!! http://t.co/4BPI2BIi What happiness!! We are in the final! This team is great! Thanks! http://t.co/O6rraNGs Tengo un regalo muy especial para mis amigos de la fan page de la bodega y para vosotros también! La camiseta con... http://t.co/vYf7hBHu Noticia muy triste. Quiero mandar un abrazo muy fuerte y mucho ánimo  para la familia de Miki Roqué. Te echaremos de menos. Great day because we have pass to the quarterfinals and because we are more than ten million on facebook! Amazing! http://t.co/BQ85JJKv Que gran día, pase a cuartos después de un partido intenso y ya somos más de diez millones! Increíble!! http://t.co/rLh0n4vD Antes de ir a dormir quiero felicitar al Barça de basquet por el título de liga!! Que partidazo y que gran final!! Victoria contundente con un gran juego, ahora a preparar el partido decisivo contra Croacia! Vamos equipo! Empezó la Eurocopa, un empate contra Italia en un partido disputadísimo!! A preparar el siguiente con la máxima... http://t.co/5DlsL5Ws Un día triste con la perdida de Manolo Preciado, que gran tipo. Descansa en paz. Un abrazo muy grande a la... http://t.co/fUijvG14 Aprovechando el día libre, mañana hacia Polonia!! http://t.co/do8QvSAm Me encantan los anuncios de Estrella Damm! Que os parece el de este año? #mediterráneamente  http://t.co/qCPGJroC Ya llega el Europeo. My Time is Now! Aquí os dejo el último spot de nike. Espero que os guste! Un abrazo. #makeitcount http://t.co/YNzVJmsO Hoy toca la última del gran Will Smith... Otro de mis preferidos... http://t.co/XTNmUMnG Hace unos días estuve en Kalise y pude ver como se hace un helado. Aquí va foto con Juan Fernando, director industrial http://t.co/j0Bai7jV Esta mañana he estado jugando a padel con @krlitos713 y mis rivales, @SesiMS81 y Dani. El resultado me lo reservo... http://t.co/GY76A1sS Empezando los días de descanso antes de incorporarme con la selección... Ahora viendo una peli de Denzel! Qué... http://t.co/epycsuyw Que bien sabe esta copa!!! Campeones! http://t.co/SEWndfo4 Queréis viajar a Sevilla, asistir a un partido de la selección y que nos conozcamos,...??\n\nCon Honda civic vamos... http://t.co/nDTyaqLA Mañana es el sorteo del concurso de Sony Mobile y Orange para ir a la Eurocopa... aún podéis participar!\n\nhttp://t.co/4Gem4OQT Últimas horas para participar en el Sorteo Solidario en el que podeis conseguir 2 invitaciones para la Final de... http://t.co/8XngFrru Mucha suerte @albacetebpsad ! Antes de empezar el fin de semana libre y encarar la recta final de Copa os recuerdo que podéis venir a la... http://t.co/ujgZFFDS Ya sois muchos los que habéis participado para viajar al España-Italia y conocernos. Aún podéis participar en el... http://t.co/bGt6xYP4 Sorteo Solidario / Draw for Good / Sorteig Solidari \n\nOs gustaría asistir a la final de la Copa del Rey, viajar a... http://t.co/9VE8L5yO Que os parece si algunos de vosotros podéis venir al partido de la selección que juega contra Italia?? Hablando... http://t.co/gwU9wyIx Os vuelvo a adjuntar el link!! Buenas noches y ánimo a toda la gente de Villareal, Sporting y Racing de... http://t.co/d14USJMb El próximo 3 de Junio la selección juega en Sevilla,..\nOs apetecería asisitir al partido y que nos conozcamos,..?... http://t.co/TUFxT9OI Vamos Alba! Último partido de liga y último esfuerzo para estar en el playoff, mucha suerte!! Hola a todos, aquí va el trailer de la película de la semana, tiene muy buena pinta! A ver qué os parece!! https://t.co/2e8U22h3 Que mala noticia hoy, quiero mandarle un fuerte abrazo al capi @Carles5puyol  y a recuperarte como siempre!!! Te esperamos!!! ¿Quieres conocer a Will Smith? Mis amigos de Sony me han pasado este concurso que os puede dar la posibilidad... http://t.co/tmN7sX3B GRAN DESPEDIDA DE LA TEMPORADA EN NUESTRO ESTADIO. GRACIAS MISTER! #graciesPep Muy contento por como ha salido todo! Próximo sábado último partido en casa! Un abrazo a todos. Otra victoria!! Felicidades a Ibi por volver a jugar después de todo lo que ha pasado con la lesión! Un abrazo a todos! Hoy nos ha dado la noticia el mister y solo darle las gracias a él y a su equipo por estos años y sin olvidar que... http://t.co/v7yL63nm Momento muy duro y difícil. Lo hemos hecho todo para estar en la final de Munich pero no ha podido ser... Muchas... http://t.co/gn9EdMfF Dolidos por la derrota, lo hemos dado todo para intentar alargar la liga pero no ha salido bien. Mañana a cambiar... http://t.co/ijGpE40S Faltó el gol pero en la vuelta, todos juntos en el Camp Nou, lucharemos hasta el final! Vamooos!! En unos momentos comenzaremos el entrenamiento en Stamford Bridge. Mañana gran partido!!!!\n\nIn a few moments... http://t.co/hh7eAGUD Victoria en un campo dificilísimo.... Seguimos peleando y el sábado que viene toca \"El Clásico\"!! Muy contento... http://t.co/qlINmGAi Nueva victoria en casa! A seguir peleando hasta el final... Feliz por haberte podido dedicar esta victoria Abi, va por ti!! Seguimos sumando de 3 en 3, en este mes se decide todo!! Vamos equipo! Otra semifinal!! Gracias afición por el apoyo!! http://t.co/xedP7KUX Muchas felicidades @AlbaFemNexus y mucha suerte en el ascenso!!! Estirando un poco después del partido tan exigente de hoy! Partidazo! Ahora solo pensar en el partido del martes!... http://t.co/c8rb76j5 En casa !! http://t.co/VwaqsSMw Para ir calentando motores para el partido que vamos a jugar con Qé! y celebrar que ya somos más de 9 millones,... http://t.co/obBuajK5 Primer partido de la eliminatoria, nos quedan noventa minutos muy apasionantes con nuestra afición! Vamoooos!! Muy contento por una nueva victoria fuera de casa... A seguir trabajando igual y ahora a preparar el partidazo del Milan!! Justo antes de salir de casa. Ahora ya estamos a punto de salir para Mallorca!! http://t.co/go18fINu Hola a todos, para celebrar que ya somos más de 9 millones, voy a  organizar con mis amigos de la marca de... http://t.co/xZyDRmXN Gran victoria!! Partido a partido seguimos sumando y cumpliendo con nuestra obligación de sumar de tres en tres!... http://t.co/FfVGAHnf I wish all the best to @fmuamba! All my support to him and his family.... Please Don't stop fighting!!!!! Gran victoria y cumplimos con nuestro objetivo de sumar tres puntos más! Hoy no era nada fácil!!! Me gustaría... http://t.co/kAI7ByA5 Abi, volverá a salir todo genial y volverás a ganar! No estás solo!\n\nAbi, everything is going to be right and... http://t.co/ZAryAdKV Hola a todos, ayer recibí un premio que me ha hecho especial ilusión que me dieran por parte de la Agrupación... http://t.co/Rl4vJ9ux Volviendo a casa muy contento después de la victoria contra el Racing y por las sensaciones del partido! Un... http://t.co/6a6Eh4gR Muy contento por como han salido las cosas y por estar en cuartos!! Noche mágica en el Camp Nou! ah, y... http://t.co/2ROzfNg6 http://t.co/spbx0uf4 Gran victoria después de lo complicado que se nos puso! Muy contento por haber podido (cont) http://t.co/eXKTfoA1 Fuerza Pedro Martinez Bravo. La gran familia del @albaceteBPSAD estamos contigo! Muy contento por esta gran victoria con un grandísimo ambiente!! Muy buenas sensaciones!!! Partido muy intenso y gran victoria en un campo complicadísimo!! Ahora toca selección! No puedo irme a dormir sin felicitar a Estopa!! El próximo concierto estoy allí! Que grandes! Ya tengo película para este fin de semana! Ghost Rider! http://t.co/b3svlrJm Grande equipo!! Muy contento por la victoria y por el partido que hemos hecho!! con @WMakinaciones http://t.co/pwrnzq7F En la ciudad deportiva con @Guaje7Villa ! Que ganas de que esté recuperado! http://t.co/n1YBclX9 Gran victoria en esta eliminatoria y muy contento de volver a jugar! Abrazos!\n\nGreat win in this round and I am very happy to play again! Feliz día de San Valentín desde Alemania, que hoy jugamos la ida de los octavos de final de la Champions League!!! Derrota dura. Pudimos reaccionar pero no fue suficiente. Hay que seguir hasta el final. Ahora a preparar el partido de Champions. Un abrazo. A otra final!! Que ilusión! Espectacular equipo! Felicidades!!!\n\nWe are again to the final! Amazing! Great team!... http://t.co/pwmM2xLo Hola a todos, cada día me siento mejor de las molestias, he podido entrenar con el equipo y las sensaciones son... http://t.co/NdzdoOnS Muchos ánimos Contador, yo también estoy contigo!!!!! Sumamos tres puntos más, partido complicado. Ahora a preparar bien la vuelta de la Copa. Aquí os dejo una foto de esta mañana que hemos ido a la montaña! Ahora a punto para ver el partido!! Toda la... http://t.co/vehe6lP5 En casa con Anna preparados para ver el partido!! Mucha suerte compañeros! http://t.co/ytzFKjVK Un día dificilísimo, que hace que mi lesión sea insignificante. Lo es por la perdida de mi amigo Dani Montesinos,... http://t.co/MIz760gj Felicidades equipo y afición! Sois muy grandes! Finalizamos una semana muy intensa con una gran victoria! Era un partido muy difícil y lo hemos podido solucionar... http://t.co/uEJmIwCH Hola a todos, como sabéis colaboro con la asociación San Filipo, les he dado unas botas con las que jugué el año... http://t.co/A0SNxAYa Primer paso de la eliminatoria. Faltan 90 min para conseguir el objetivo con nuestra gente. Ahora a descansar y a... http://t.co/2ZI3E3UQ Victoria después de un partidazo donde hemos podido sumar una gran victoria!! Ahora a preparar el partido del... http://t.co/W1AOC3fQ Gran partido y ya estamos en cuartossss! De camino a la gala!! Un abrazo! http://t.co/Njtl9Uoa Saliendo del control antidoping. Derbi intenso como siempre. Lástima del empate final. Paso importante en la eliminatoria todo y que aún tenemos que jugar el partido de vuelta!! Ahora a pensar en el... http://t.co/Sg3swl6r Hola a todos, a punto de ver el Alba-Bilbao! Ya estoy mejor de las molestias y durante esta semana terminaré de... http://t.co/117GT8hl Que paséis una gran noche y que el 2012 sea un año especial pero sobretodo salud! Un fuerte abrazo! http://t.co/YDcppZPd El gran @Guaje7Villa ya está aquí! Bienvenido al Twitter, un abrazo!! En la siguiente ronda, esperando el sorteo de mañana. Las molestias que he sufrido hoy desaparecerán pronto!... http://t.co/hHjtH3Vw Hoy hemos ido a por el regalo de Anna! aquí os dejo el video! Feliz Navidad!! http://t.co/iv8wHQ8K Hola a todos, ya estoy en casa!!! Me acaban de pasar los dibujos animados que han hecho Kalise para felicitar las... http://t.co/qgRhvulX Histórico!!!! http://t.co/gAiQpkW3 Hola a todos, como os prometí, ya he elegido 2 comentarios!! Son los de:\n\nMariela Pueblo Verdugo y Bea Nieto Josa... http://t.co/R3f7xgmH Hemos pasado a la final con mal sabor de boca... Muchos ánimos David, estamos contigo!! Deseo que le podamos dedicar este gran título!! Muchas gracias por tantos comentarios, intentaré leérmelos todos!!:) Os prometí una sorpresa, así que a ver qué... http://t.co/DWkSLDkC Hola a todos! Estaba pensando en regalarle un perfume a Anna para estas Navidades pero no tengo mucha idea...... http://t.co/3A2h0ki5 En el metro de Tokyo yendo a cenar, hoy tenemos la tarde libre! Un abrazo! http://t.co/6n3MDv9K Espectaculaaaar!!!!!! http://t.co/w3M2qHgI 2 millones de gracias!\n\n2 million of thanks!\n\n2 milions de gràcies! http://t.co/PgFiJRZ8 Felicidades a todos por esta fase de grupos y a todos los debutantes que han jugado hoy!! Maravilloso terminar... http://t.co/SYKSrdRe Contento por la victoria y por haber disputado los 90 minutos! Ahora a preparar el partido de Champions antes de... http://t.co/OsHbsqxa Ya tenemos rivales para la fase de grupos de la Eurocopa!! Irlanda, Croacia e Italia! Defenderemos el título e... http://t.co/AsCuZMq8 Hola a todos, ya tenemos ganador del concurso para ir a Tokio... Os dejo el link para que lo veáis... Muchas... http://t.co/O73WpuN7 Hola a todos, ya tenemos ganador del concurso para ir a Tokio... Os dejo el link para que lo veáis... Muchas... http://t.co/uxitKjYm Hola a todos, tan solo recordaos que hoy a las 16h termina el plazo para participar en el concurso para ir a... http://t.co/xVEivooj Hola a todos, mañana se termina el plazo para participar en el concurso para ir a Tokio!! Os dejo de nuevo el... http://t.co/sHjO8boj Contento por la victoria y poder haber podido volver a jugar!! A mejorar las sensaciones en los próximos días! No hemos podido ganar. Hay que seguir y seguir, espero estar pronto con mis compis. Hola a todos, perdonad por el retraso... Para celebrar que ya somos 8 millones he llegado a un acuerdo con... http://t.co/Yq0sFc8M ¿Os acordáis que hace unos días dije que haríamos una sorpresa para celebrar que ya somos 8 millones? Pues estad... http://t.co/rZeMqNOW Grandísimo trabajo y primeros de grupo! Un abrazo grande a todos! Victoria después del parón con la selección! Contento por el resultado y porque en esta liga es muy difícil sumar... http://t.co/1Mewxi0o Hola a todos, recién acabo de llegar a casa después de ir con Anna a la clase de natación de Valeria :)!! Ahora a... http://t.co/njJlUtYx Como el año pasado,  colaboro con la fundación infantil Ronald Macdonald. Hoy es el día internacional Mc Happy,... http://t.co/URVLO6vj Mala primera parte, segunda parte muy bien. Ahora volvemos para casa. Un abrazo! No hemos podido ganar este primer amistoso todo y que hemos creado numerosas ocasiones! ahora para Costa Rica!... http://t.co/sD4gTfpp No ha sido un partido fácil, el Hospitalet nos ha jugado de tú a tú. Contento por la victoria y el gol. Mañana... http://t.co/6xIvehJG Partidazo en San Mamés todo y no haber podido sumar los tres puntos, un campo muy complicado donde apretan... http://t.co/SDRtG5Ay Gran victoria y ya estamos clasificados. Ahora a seguir trabajando para quedar primeros de grupo! Felicidades a... http://t.co/AeOtkKiQ Hoy es un día especial, gran victoria del equipo y 9eno aniversario de mi debut! Ah, por cierto, esta noche en... http://t.co/mx1RqJwe Tres puntos más, ahora a recuperar y el sábado de nuevo partido! Un abrazo! Ciao Marco, riposa in pace. RIP Una pena no haber podido conseguir los tres puntos. Hicimos todo lo que pudimos y jugamos nuestro fútbol hasta el... http://t.co/WbfpqmY9 Muy contento por la victoria y por haber ayudado al equipo con un gol!! Las sensaciones han sido inmejorables.... http://t.co/sT3Ez31H En casa antes de cenar, que hoy tengo la visita de mi amigo Carlos! Miércoles vuelve la Champions! http://t.co/symqsjTR Muy contento después de haber jugado de nuevo!! Las sensaciones han sido geniales!! Que mejor manera de volver... http://t.co/tR9RpJdk I posted a new video to Facebook http://t.co/pz9NroGw 8 millones de gracias... Es increíble que ya seamos tantos, este es el mejor prémio que alguien puede tener!! Un... http://t.co/IJtgwUQH A punto para ver el partido de esta noche. El último del grupo, ojalá hagamos un pleno de victorias. Mucha suerte... http://t.co/CVtIh5Vh En casa ya listo para ver el partido de la selección!! Mucha suerte compañeros!! \"Tu tiempo es limitado, de modo que no lo malgastes viviendo la vida de alguien distinto. No quedes atrapado en... http://t.co/DJ5K9mQ0 Hola a todos, os presento la página oficial de Facebook de mi capitán! http://t.co/dxSr7QaI Victoria trabajadísima en un campo que con esa afición aprietan muchísimo... Somos líderes! Esta semana entro en... http://t.co/jwospbxd Hoy es un gran día, he entrenado con mis compañeros y la otra noticia es que he conseguido dar otro pasito más en... http://t.co/hqGfAzUk Ahir vaig anar al teatre a veure els bojos del bisturí! Molt divertida! Victoria importante fuera de casa que nos permite sumar los tres primeros puntos de la liguilla! Felicidades... http://t.co/JLx03JIp Sigo con mi recuperación, hoy con Alexis Sanchez a correr por la montaña! Cada día me encuentro mejor! Muchas... http://t.co/zMJXBBc3 Preciosa victoria en un gran partido!! Delante teníamos un Atletico que llegaba muy bien al Camp Nou! Cada día me... http://t.co/W8N2Bxgd Gran partido y buen resultado en un campo muy difícil! Sensación muy extraña la de no poder estar con mis... http://t.co/KZ3BJScQ Que gran partido y que gran victoria!! Felicidades a todos mis compañeros! Un abrazo y a preparar el partido contra el Valencia!! Muchas gracias a todos por las muestras de cariño y ánimo de estos días. Espero poder recuperarme lo antes... http://t.co/a8HhSxWy Avui és la diada de Catalunya. Que passeu tots un gran dia!\n\nHoy es la diada de Cataluña. Que paséis todos un gran día! No hemos podido llevarnos los tres puntos, lo hemos tenido de cara y en la segunda mitad se nos complicó mucho. A... http://t.co/bjvPo7C Después del arranque del Alba quería desearle toda la suerte del mundo en 2-B, y en este nuevo proyecto tan... http://t.co/KfWSjM6 Objetivo cumplido! Muy contento por la clasificación para el Europeo! Felicidades a todos!! Ahora para casa! Gran remontada!! Contento por haber podido contribuir con un gol! Ahora a pensar en el partido oficial del martes!! http://t.co/xtLFuQJ Gran manera de empezar la liga! Muy contento por como ha salido todo y el juego que hemos hecho! Ahora parón por... http://t.co/MmWtFII Ahora sí, vuelve la liga! Mañana primer partido en casa, qué ganas!! http://t.co/eDAQc9v Campeones de la Supercopa de Europa! Muy feliz por haber conseguido este nuevo título! Este equipo es... http://t.co/mnf7iMM Gran noche del Gamper!! Es muy bonito vivir un año más la fiesta del barcelonismo. Muchas gracias a todos por el... http://t.co/yiGyuJD Muy feliz!!!! Primer título de la temporada después de una final muy disputada! Un abrazo a todos y a disfrutar... http://t.co/KDLBVux Hola a todos, último entreno antes del partido de mañana...Aprovecho para enseñaros mis nuevas botas para esta... http://t.co/of6MfNo Muy contento por como han salido las cosas. El Bernabeu siempre es un campo complicadísimo y más a principios de... http://t.co/707s6Pp No hemos podido superar a italia, hemos tenido ocasiones y al final no ha podido ser...! \n\nWe couldn't beat Italy,... http://fb.me/Jr4LjUVs Hoy se cumplen 2 años sin mi amigo Jarque. Muchos recuerdos... Quiero mandar un beso muy fuerte para su familia y... http://fb.me/Dwlbi9nT Último partido por tierras americanas y ponemos punto final a la gira con una victoria. Volvemos a casa! Un... http://fb.me/13qgQkRqr Acabamos de aterrizar en Dallas con la noticia de la muerte de Jesús Farga, ex directivo del Barça, tuve la... http://fb.me/12YNvSuqJ Acabamos de aterrizar en Dallas con la noticia de la muerte de Jesus Farga, ex directivo del Barça, tuve la suerte... http://fb.me/tJqLMhUE Duele mucho perder así, aunque sea un partido de pretemporada. Debemos seguir preparándonos fuerte para lo que... http://fb.me/xNTqTbCA Con los ganadores del concurso que han venido de gira conmigo!!\nWith the winners of the contest that have come... http://fb.me/Px9Mk0xE Despedida de Washington... En unas horas nos vamos para Miami!! Un abrazo a todos! http://fb.me/RlpDCTKJ Yendo para el aeropuerto que nos vamos ya para USA... Muchos ánimos para Jonathan Soriano, espero que no sea nada! 45 minutos más para seguir cogiendo ritmo, y las sensaciones siguen siendo buenas!! Mañana un nuevo partido antes... http://fb.me/LGvS9aJx Primer partido de pretemporada y seguimos preparándonos... Es muy bonito ver tanta gente del filial con nosotros!"}