{"tweets": "\"Reframing love as something I get to create with someone I admire, rather than something that just happens to me without my control or consent, is empowering.\" \n\nWatch @LenMandy's full TED Talk here: https://t.co/jrGlgShfIk https://t.co/xs3pQyTHgD \"You might know it as 'cyberbullying.' The media calls it 'revenge porn.' I now call it 'digital domestic violence.'\" @DariethChisolm https://t.co/MjnEjsOyTn I woke up... like this? https://t.co/w6RgwP4gLv \"Everything you know about time management is wrong.” https://t.co/fL6EpyDtNd Warning: This @Cirque performance will make your heart drop. \n\nWatch the full TED Talk on the power of awe here: https://t.co/O4Lpu1KGmx https://t.co/s5CfXdB536 This list of classic reads assigned to students around the world will expand your horizons — and your bookshelves: https://t.co/kT1onRiFqx #TEDReads How to bring affordable, sustainable electricity to Africa: https://t.co/nRlewiQpmJ https://t.co/FHUS9I1M1h Here’s why bonuses, commissions and other traditional workplace rewards don’t work for the 21st Century: https://t.co/tiAAAyKerd The tabloids sensationalized my freak accident. Here's how I took my story back:  https://t.co/Zx1BNKxZUK Best-selling author Elif Shafak explores the political power of storytelling, and how we can embrace uncertainty in turbulent times.  \n\nFor more, listen to #TheTEDInterview on Apple Podcasts: https://t.co/vcDUI8UYYj https://t.co/YsCFACPpmv \"Higher profit margins do not increase societal wealth. What they actually do is exacerbate income inequality.\" https://t.co/B4Y1Rc9PdK How medicine's culture of denial and shame keeps doctors from ever learning from their mistakes:  https://t.co/tyK4TAOtNO Did you know that married men earn about 26 percent more than single men at equivalent levels? https://t.co/xpx0mZCVll It's awkward to tell you this on Twitter, but... https://t.co/rOowndiDOI 7 ways to prep for going to a protest: https://t.co/7fdwWCCxF5 For the hoarders out there: https://t.co/mRS4UKDOYI There's no place like home, so make it the best it can be: https://t.co/iWBwFj6tow Learn how to label your feelings correctly: https://t.co/87kn2cU7jU Did you know that some flowers masquerade as horny insects? https://t.co/NJx77utdLO \"Just as we have marriage ceremonies to mark the beginning of a union, we also need rituals to mark the end.\" https://t.co/aQGcHemhyN \"We're beginning the age in which machines attached to our bodies will make us stronger and more efficient.\" https://t.co/TIPivyFVvm Why are pencils hexagons, and where did they get their iconic yellow paint? https://t.co/3VRS1cETwg Even a toothbrush can reveal a world of inequalities. https://t.co/PMY8RaPD0M The best way to satisfy your wanderlust is in your own backyard: https://t.co/8OOXMPnGom The best of TED, picked just for you. Sign up now for the newsletter you'll actually want to open. https://t.co/kd6Iv3vxYN https://t.co/rO60iTFyc6 Rise and shine... to these great TED Talks this Saturday morning!\nhttps://t.co/CtDr6C9uLM How to introduce more color — and joy — into your life: https://t.co/0KcHX3O505 Congressman Elijah Cummings spoke about the importance of unity during his March 2019 interview at TEDxMidAtlantic. Today we reflect on his message: https://t.co/LDj0wjwetY RT @TED_ED: Restoring our forests is one of the most effective natural solutions to the climate crisis. That’s why we’re joining #TeamTrees… Watch \"Crazy Rich Asians\" director @jonmchu's full TED Talk on the pride and power of representation: https://t.co/49L85Vm6qx https://t.co/y3gs989n6P Swinging into the weekend like... \n\nWatch @rbeaulotto's TED Talk on awe and Cirque du Soleil here: https://t.co/gXRolBMfn5 https://t.co/b62my1SaUT How we experience awe — and why it matters: https://t.co/ekkTWddhMi @rbeaulotto @Cirque https://t.co/rXDyPhh8HT Ever wonder what your dog is thinking when he stares at you? https://t.co/ziW4yShkEo \"Rather than intellectualizing the terror of lynchings as has been done over the decades, the memorial physicalizes it.\" https://t.co/JryXCBnNOB In 2018, 45 million images and videos of child sexual abuse were uploaded in the U.S. @Thorn has a ground-breaking new approach to taking down abusive content and the abusers who share it.\n\nWatch the full TED Talk here: https://t.co/aRw2YEQErs https://t.co/oE7O9YBDsa \"When we face hard choices, we shouldn't beat our head against a wall trying to figure out which alternative is better. There is no best alternative.\" https://t.co/epVOipPlTm Bugs have sex in some creative ways... https://t.co/581ImBmbst \"Why is there such a gap between the colors that enliven us, and the colors that surround us?\"  https://t.co/kYhsNBLSiR Life is short. Take some selfies. Keep a journal. https://t.co/5HjRWHmLbk Want to make great slides for your presentation?\n\n1. Keep your slides simple and succinct.\n2. Choose your colors and fonts with care.\n3. Avoid visual clichés.\n4. Don’t get bogged down by charts and graphs.\n5. Don’t be afraid of blank slides.\n6. Practice!\nhttps://t.co/IYWVt16SSZ Turn someone's whole day around with these tips for thoughtful compliments: https://t.co/66KOsl28cx Do you ever order clothes online in different sizes and colors just to try them on and then send back what doesn't work? Yeah, maybe stop doing that. https://t.co/hnS5XnzlxQ The pride and power of representation in film: https://t.co/NWSulDjuF9 @jonmchu https://t.co/ToXIVS5foK The link between fishing cats and mangrove forest conservation: https://t.co/EyLmEF98Wx @AshwiNaidu https://t.co/6bUFIPSUzm Need a boost of motivation to get you thought the week? Explore ideas from the most joyfully curious minds in the world. https://t.co/LMfQ2AbgGc https://t.co/B2drzI3iof Hear how Minda Dentler, who contracted polio as a baby, raced a total distance of 140.6 miles in just 14 hours—using only her arms. #WolrdPolioDay https://t.co/ptgzq4Ff2h Tips on how to hack your relationship with your phone, from a productivity expert: https://t.co/9DfzZcnUN5 Can you really trust how you see the world? On #TheTEDInterview, Anil Seth dives into consciousness, and the difference between perception and reality. Listen on @Spotify or wherever you get your podcasts: https://t.co/TuYKeREpGT https://t.co/n6IjQzxMFz We must engage in democracy every day, not every few years: https://t.co/dvGYtmkfyT Chemist @DavidRLiu recently unveiled his lab’s groundbreaking method for DNA-editing that could fix genetic diseases. Watch his TED Talk from April: https://t.co/yCHcMI9zbr We can't be afraid to talk about race, especially in the workplace.\n\nWatch the full TED Talk here: https://t.co/fDYQMhWvoZ https://t.co/9miaV5Mfle Happy #NationalMoleDay! To be clear, we aren't talking about skin growths or undercover spies. https://t.co/DPGLHzTlQE Which would you rather have: two weeks’ additional salary or two weeks off? https://t.co/A3NXNa5viK \"Once your appliances can talk to you, who else are they going to be talking to?\" \n\nWatch the full TED Talk here: https://t.co/7VblxQFeFS https://t.co/R2zlyYX47Y RT @nypl: Want to hear the @TEDtalks of some of your favorite writers? Check out our list featuring inspiring talks by authors like Chimama… Best-selling author @Elif_Safak shares how storytelling can be profoundly political, and how in turbulent times we can embrace uncertainty. Listen to #TheTEDInterview now on TuneIn or wherever you get your podcasts. https://t.co/S8wGRNEKiR #NationalBookMonth https://t.co/bSl4KTv5Bl The danger of AI is weirder than you think: https://t.co/HAhH1jdN6r @JanelleCShane https://t.co/4NOyU1nkkA How motivation can fix public systems: https://t.co/j35SVjJrOc https://t.co/hNa8llprtK Why does running on a treadmill feel like such a punishment? Maybe because it was created as one: https://t.co/wj7jzr3UYu Hypnotism may be a powerful tool for healing: https://t.co/scfmO096ne Leaders, diversity is only half of the battle: https://t.co/HmQCM5CXVg What will your curiosity unlock? Find out by joining a global community of doers and thinkers. \nhttps://t.co/XVNESARg81 https://t.co/cuX2iI0DM3 \"If we learn to think of our internal voice as that of an advisor rather than a dictator, it can become enormously helpful to us.\" https://t.co/mDpBcM76m0 How much can you really trust how you see yourself? On #TheTEDInterview, Anil Seth dives into consciousness, and the difference between perception and reality. Listen on @Stitcher or wherever you listen: https://t.co/jUs6rJwWzf https://t.co/ZFt9976bvX Fashion that celebrates all body types — boldly and unapologetically: \nhttps://t.co/uEGui3r2T7 @BeccaMcCharen https://t.co/WtCSAtCXpA Teens aren't getting enough sleep. And it's not because of social media and smart phones: https://t.co/KTX71gHu2J Here's why you should adopt a work hard/play hard mindset: https://t.co/Of2VngA8DE Does your life feel like chaos? Here's how to find some stillness every day:  https://t.co/KdSsHypNr0 Are you a misfit? Grieving a loved one? Don't know how to make new friends? These tips are for you: https://t.co/YwtsxHEAor When a disaster happens, this is how you can effectively help: https://t.co/F3tv11XCNV These posters will get you excited to go vote:  https://t.co/65IDc4iHys It is, after all, #BackToTheFutureDay: https://t.co/CPz2JTd7UO You’re not always going to be inspired, and that’s okay. Take it from @taylorswift13, who shouted out @GilbertLiz’s TED Talk in her NPR Tiny Desk Concert. Watch the talk here: https://t.co/CEmvT5ajTN @NPR @taylorswift13 We love to cry at TED Talks, too, Taylor! Watch the Elizabeth Gilbert talk that got a @taylorswift13 shout out here: https://t.co/pQbOFwd8iP How an algorithm can make sure every vote counts: \nhttps://t.co/SYG3fjwDmK What if we replaced politicians with AI representatives trained to vote based on your values?https://t.co/dynIa8HH8Y For when you want to do more than vote but less than actually run for office: https://t.co/kPN6Z5PotT How I took control after the tabloids trampled on my privacy: https://t.co/mv02u2AAlW This helpful way of thinking about creativity doesn't require you to be a tortured, brooding artist. \n\nWatch @GilbertLiz’s full TED Talk here: https://t.co/eN3dmalQom https://t.co/sijkikZFW7 RT @greenlightbklyn: Can you ever have enough free bookmarks?\n\n@TEDTalks dropped off some of these guys with us for #NationalBookMonth! Swi… Can dogs sniff out malaria? https://t.co/x6ETRMUNLN @ProfJamesLogan https://t.co/q6jHU41TmL A love story for the coral reef crisis: https://t.co/Oiwyi3S2Jm @ayanaeliza https://t.co/JF4Y1h9o9q If you want to: \n-Get ahead at work \n-Be more hopeful \n-Learn something new \n-Become a better human\nWe’ll send you the perfect TED Talks to help you become the best version of yourself.  https://t.co/9DcB7iLJ0F https://t.co/Q7ye2n4EJD \"In Silicon Valley, the big tech companies fish from essentially the same small pond or bay. A distributed company can fish from the entire ocean.\" @photomatt https://t.co/69Es3JLrtb \"Our relationship has always been about setting each other free.\" @KimKatrinMilan https://t.co/FPtGxNu5AD This dinosaur hunter has a beautiful message about our place in the universe: https://t.co/OotwdeDmuH @kenlacovara How political cartoons speak truth to power: https://t.co/AkMGheAh4R @PatChappatte \"This isn't about politics. This is the algorithm figuring out human behavior. I once watched a video about vegetarianism on YouTube and YouTube recommended a video about being vegan. It's like you're never hardcore enough for YouTube.\" @zeynep https://t.co/QrxTChAGve After serving time, this dad decided to help other incarcerated parents stay connected to their children by helping them record beautiful bedtime stories: https://t.co/geRBdHN3qZ Happy #NationalBookMonth! Use these TED Speaker quotes for inspiration—and maybe a book mark: https://t.co/pI6rYcJ3TC The movie \"I, Robot\" may be more accurate than we think... https://t.co/8JJvmD0rOJ From where to eat to who to marry, our lives are full of computational problems: https://t.co/7oCXIfptzz How we can store digital data in DNA: https://t.co/A2OXoey6Cx @dinazielinski https://t.co/RTBBB6tC6C Viewing a stressful situation as an opportunity to improve your skills, knowledge or strengths makes it more likely that you'll experience stress inoculation. https://t.co/JLFkiLmzuF An extraordinary story of attempted murder, forgiveness and redemption: https://t.co/BZLKikdAU2 @AnandWrites How we can turn racism into a solvable problem -- and improve policing: https://t.co/BVKddATeat @DrPhilGoff https://t.co/KZcVrbdDfR Dinosaurs deserve your gosh darn respect. https://t.co/QcbtOkCCxN \"Who we see thriving in the world teaches us how to see ourselves, how to think about our own value, how to dream about our futures.\" @AmericaFerrera https://t.co/4QHja6TrCJ A ground-breaking new approach to taking down abusive content and the abusers who share it: https://t.co/YRNSO89iBq Why I turned Chicago's abandoned homes into art: https://t.co/9yWzNEUdu2 https://t.co/0y5D7ix47X A groundbreaking expedition to the bottom of all five of the world’s oceans: https://t.co/oVpPQ7BFrI @FiveDeeps Here's how you can squash your inner self-saboteur: https://t.co/KUGPWzlev2 \"We tend to take every comment or opinion that's expressed as a personal affront to our own values and beliefs. But what if changed the way we think about these conversations?\" https://t.co/L1BQYjjuNC How nanoparticles could change the way we treat cancer: https://t.co/F2ur37oPoX @WolframJoy \"The positive part about Twitter and social media in general is that it is a place where you can find connection and a place where you can find community, and you can find those things that are sometimes inaccessible in person.\" @JonnySun https://t.co/tg2uL3tXrb Before Adam Driver became Kylo Ren in Star Wars, he was a United States Marine. \n\nWatch his full TED Talk about bringing theater to the military: https://t.co/uHxWj3dABo https://t.co/SQ4wqUSaQo \"What truly makes us free is being bound to others in mutual aid and obligation, having to work things out the best we can in our neighborhoods and towns, as if our fates were entwined — because they are.\" @ericpliu https://t.co/J6ldfCYznn A love story for the coral reef crisis: https://t.co/LPmch6BJUN @ayanaeliza https://t.co/C5zXeqJ06s What would happen if you…\n\nGot out of your bubble?\nOpened your mind to new possibilities?\nSaw yourself differently? \n\nFind out how an unexpected idea could change you.  https://t.co/3Ty0pGrcTc https://t.co/kYaaw1Pnuj Hear from reporters who were willing to go anywhere to uncover important stories: https://t.co/tGuqJyVUKZ 3 moments humanity teetered on the edge -- and how we survived: https://t.co/EIM1fWROu4 @indyfromspace Here is the actual mathematical formula for how many people to reject before you find \"the one.\" https://t.co/x31xU5KRvv How to teach kids to talk about taboo topics: https://t.co/ATqP8aa5VK https://t.co/rSZjNVKvI8 Why didn't they teach us how to fill out tax forms in school?!  https://t.co/lGHRVoQnW3 \"Trying to measure the atmospheric composition of an exoplanet passing in front of its host star is hard. It's like trying to see a fruit fly passing in front of a car's headlight.\" https://t.co/4VNTbwLz8p How a handful of fishing villages sparked a marine conservation revolution: https://t.co/8WMyGB2cdm @aarhh https://t.co/vPGxkBX5Ul This woman grew up in the Westboro Baptist Church. Here's how Twitter helped her leave: https://t.co/xlEnqoO4K2 Get ready to be amazed and inspired by the feats achieved by these adrenaline junkies: https://t.co/75cDzByc6q This trick will help you quickly overcome a steep learning curve: https://t.co/Dd92gnZq2X \"Whenever anyone would ask my mom what my father was like, she would say, 'How he was in front of the camera, how you saw him in his films, how you saw him in his interviews was, in fact, exactly how he was.'\" https://t.co/ow0ymWQkUW How family separation at the US-Mexico border affects children's mental health: https://t.co/OEMvwB8u3P @lhzayas https://t.co/nic9gMbcXh A circular economy for salt that keeps rivers clean: https://t.co/ZdRkecxQDt “If you look to lead, invest at least 40 percent of your time managing yourself.” https://t.co/WRuEOgvXYp Like all personal relationships, mentorship needs to be a two-way street. https://t.co/JNXLtgZBQZ How humans have the power to reshape the galaxy:  https://t.co/K2ozP7UYAl Learn the technique that allows anyone to memorize anything: https://t.co/Wg6sxahRx9 \"It’s easy to restrict ourselves — without even realizing it — to people like us and to views we agree with.\" https://t.co/Uo0XFPMflv Everyone has traits they’re not proud of.  Don't let them hold you back. https://t.co/WpmrkPdxS8 Here's what happens when two monkeys are offered unequal pay for the same task. \n\nWatch the full TED Talk here: https://t.co/RPudy2d4j9 https://t.co/JLFuFlWDd6 How to build an Alzheimer's-resistant brain: https://t.co/Kr2c1d7D4l How we can eliminate child sexual abuse material from the internet: https://t.co/ynh8XkCEBv @juliecordua https://t.co/dZhoSItVd1 An app that helps incarcerated people stay connected to their families: https://t.co/G8iBHKX5uk @_marcus_bullock How you can use your strengths, values and experiences to lead you to your passion: https://t.co/M01bpqVkhS Before you head into your next yearly review at work, watch these talks: https://t.co/xEeFV5xxWm Are you a caregiver? You might have \"compassion fatigue.\" https://t.co/D89EWsQAd7 Learn more about these masters of camouflage: https://t.co/De3gTVvhui \"It’s easy to restrict ourselves — without even realizing it — to people like us and to views we agree with.\" https://t.co/5MVel5nPky This study has tracked the lives of 724 men (including JFK!) for 78 years. https://t.co/Xo7569gMto Tribal attorney Tara Houska shares how we can support Native people in the U.S. #IndigenousPeoplesDay\n\nWatch her full TED Talk here: https://t.co/EjtPPjtqFm https://t.co/OgYboBoTO6 \"I had a college adviser tell me 'Anatomy's a dead science.'  He couldn't have been more wrong.\" https://t.co/01uMWuKRz4 The answers to some of life's biggest questions: https://t.co/c5IQCQL7tw Take a picture of yourself using your new bookmark and share it with the hashtag #TEDReads to spread the joy of reading far and wide! Visit one of these locations to grab your own illustrated bookmark featuring a quote about reading or writing from a TED speaker: @greenlightbklyn @bookculture @WordUpBooks @thelitbar @booksaremagicbk #TEDReads Are you a TED fan in the New York area who loves to read? In honor of #NationalBookMonth, we're sharing free bookmarks at local bookstores all over the city!  #TEDReads https://t.co/3cKjqVVf0O Find more quotes on the joy of reading and writing here:  https://t.co/5LBwdQmWgL #TEDReads Watch @GilbertLiz's full TED Talk here: https://t.co/J6O8oAPbTM https://t.co/bftXozwfVK Watch Andrew Stanton's full TED Talk here: https://t.co/qLHFGL2WSs https://t.co/TAHNWZRuee Watch @JackieWoodson's full TED Talk here: https://t.co/7RR8JO3WpZ https://t.co/jtfcwtssTy Watch Chimamanda Ngozi Adichie's full TED Talk here: https://t.co/yV7KkFzxyi https://t.co/dltdBFSDOo In honor of #NationalBookMonth, here are some of our favorite quotes about reading and writing from TED speakers. #TEDReads RT @nypl: Want to hear the @TEDtalks of some of your favorite writers? Check out our list featuring inspiring talks by authors like Chimama… The hoodie is a lot more than just a comfy sweatshirt. https://t.co/YQgKxjNmDD The cosmic war between monotony and creativity: https://t.co/89Bjo9CNUl @DavidDeutschOxf https://t.co/MUsNSQvW5l \"It seems in order to invest in our future, we actually have to invest in the present and help people who want to become parents. Give them affordable health care, give them affordable childcare, give them paid parental leave.\" @WajahatAli https://t.co/3MRrktPMF3 \"Will you be #ManEnough to stand up to other men when you hear 'locker room talk,' when you hear stories of sexual harassment?\" @justinbaldoni #MeToo https://t.co/TR3aGPSEwv \"By not affording employees the time they need to heal from emotional pain, companies are left carrying the burden of less productive workers.\" https://t.co/6wQPUHbgOf \"The link between lack of sleep and cancer is now so strong that the World Health Organization has classified any form of nighttime shift work as a probable carcinogen.\" \n\nWatch the full TED Talk here: https://t.co/D0aEBRrBY0 https://t.co/i1qZqUkSes \"Change will come when each of us has the courage to question our own fundamental values and beliefs.\" @AmericaFerrera https://t.co/oDTkTjQaWm How we can improve maternal healthcare — before, during and after pregnancy: https://t.co/0AcH6gJ2da @LizHowellMD https://t.co/ezjEYTuJqd \"We have marginalized identities but we don't live marginalized lives.\" @themrmilan https://t.co/TZgoiEeHBy Local reporters get the scoop before national media outlets. So why aren’t we listening to them? https://t.co/J0PbO9pzi3 \"We really are living in an age of miracle and wonder. We're lucky to be alive today. We're lucky to see this stuff.\" @EvolvingJuan https://t.co/EdA6TE7viP It is extremely hard to report sexual assault on college campuses. This app can help.  https://t.co/ns2kI7vmLv The art of asking for what you want -- even when it's scary: https://t.co/ObovFLYcJE @amandapalmer These horrifying stories from new mothers will change how you think about family leave: https://t.co/FdpfwvOf8z The next big societal shift won't come from AI or biotech. It will come from video games. https://t.co/Bc5VZpBFkl What you can do every day to create a sense of belonging for immigrants: https://t.co/FWKmk2NlSY For good sexual education, parents have to make \"the talk\" an ongoing conversation: https://t.co/8MdHe0e0zD The secret to making a zero-calorie milkshake without sacrificing taste? Neuroscience: https://t.co/9dMyNR16SI Three reasons you should thank your local sanitation worker: https://t.co/Hk4tLGFeS6 Two million people are blind or visually impaired because of trachoma. As many as 200 million may be at risk. But we can stop it: https://t.co/Lz58TpYRNE Take some time for yourself. Let us help you recharge and find a better you. https://t.co/mIFWXVoOtw https://t.co/5vZIZdykja Stay with us, but one involves breaking the law.  https://t.co/wyYSUxQLoV \"We're hurrying through our lives, instead of actually living them. We're living the fast life, instead of the good life.\" https://t.co/S8os7BO42C Parents, stop trying to raise happy kids:\nhttps://t.co/nmYHoDwaJR Revelations from a lifetime of dance: https://t.co/LjBMrZNutE Want great ideas that will change how you see yourself? Find a whole new world of ideas that will inspire and challenge you here: https://t.co/J2xKGix3sZ How to live passionately no matter your age: https://t.co/v31kBAI0xK @isabelallende #HispanicHeritageMonth https://t.co/SZpTsxZ9aa To understand autism, don’t look away: https://t.co/MX1mX1Akyn @carinamorillo #HispanicHeritageMonth https://t.co/0NdkblUcwW Poetry, music and identity: https://t.co/ONi9KD4PcP @drexlerjorge #HispanicHeritageMonth https://t.co/35zE86DxTK The story of Marvel’s first queer Latina superhero: https://t.co/nqOwik1QjC @QuirkyRican #HispanicHeritageMonth https://t.co/5P9QvVnaU4 My identity is a superpower — not an obstacle: https://t.co/R9QgmAVNJO @AmericaFerrera #HispanicHeritageMonth https://t.co/vhYss8sW9R To honor #HispanicHeritageMonth, we’re highlighting our favorite moments from Latinx speakers: Get the skills you need to be a better leader, communicator and coworker. We'll find you the perfect talks to put your motivation to work. https://t.co/ZrSShiWhSK https://t.co/nq5MNRSIe4 If you can't remember the last time you learned something new, these TED Talks will leave you feeling a little brighter. https://t.co/VLXbIpSeno \"What is altruism? It's the wish that others may be happy and find a cause of happiness.\" https://t.co/DlMK2HQhwP You don't have to be alone to feel lonely. https://t.co/tTPyvblKEd This author quit his uber-healthy lifestyle, but kept these two surprising habits: https://t.co/ISoLuaxv6Y What Bruce Lee can teach us about living fully: https://t.co/QdXm6ko2OI A personal plea for humanity at the US-Mexico border: https://t.co/8sXNgJxtUn @EvolvingJuan Are you a misfit? Grieving a loved one? Don't know how to make new friends? Listen to these tips: https://t.co/eJrU5Ea1jW “Maybe if I had known my ancestors sooner, it wouldn’t have taken me so long to find a source of pride in my identity and in my community.” — Trans activist Samy Nour Younes\nWatch his full TED Talk on the history of trans rights here: https://t.co/qFT75RlXm0 https://t.co/5aMRBgc1K5 \"These men were committed to learning how they could create a better life after they served their time.\" https://t.co/EqU7kOOXQn Do you feel stressed or unfulfilled? This shift in perspective can bring harmony and calm to your life. \n\nWatch the full TED Talk here: https://t.co/N6rxrmAWby https://t.co/Y3FUITq57U How we're using DNA tech to help farmers fight crop diseases: https://t.co/xiTaTbnoVD @laura_boykin https://t.co/rWuKMKuMyu If you frequently forget people's names even though they told you minutes ago, this is for you: https://t.co/loizf6160a Don't let anyone make fun of you for that English degree: https://t.co/2DOsnUzxGR What is happiness, and how can we all get some? https://t.co/QBHkov4BGz \"Animals can care very deeply for each other, maybe they even love each other. And when they do, a survivor's heart can be pierced by a death.\" https://t.co/MGzLUt9tFD \"Without feedback, your brain loses track of its own results.\" https://t.co/JzoaIfO9nX Some simple (and honestly scary) ways we could potentially prolong the human life. https://t.co/KkIHxE0c7c Psychologist @DanTGilbert delves into the counterintuitive science of happiness and why our minds often make us worry about the wrong things. Listen to the new season of #TheTEDInterview on Stitcher or wherever you get your podcasts. https://t.co/lDRhyPIYyj https://t.co/WFv79aTq7w “How does life change when you choose to be unapologetically yourself?” Artist @DanielLismore lives as a walking masterpiece, inspiring others to find the confidence to be who they truly are. \n\nWatch his full TED Talk here: https://t.co/2OkaYBBTOh https://t.co/MsJ8IKqS47 What could you do if you stepped out of your comfort zone? Find a whole new world of ideas that will inspire and challenge you. https://t.co/lS8tpqkHFI https://t.co/xOEe01nK13 Send this to a co-worker who deserves a vacation. https://t.co/ErYYiwm0H0 The more our mind wanders, the less happy we can be. https://t.co/RuS8TvTCVC Here are some tips for finding serenity in the everyday: https://t.co/x6rQxFNa7z Leave today's annoyances — that critical comment made by your coworker, or the disappointing numbers in the weekly report — at the office. Here's how: https://t.co/pNLp1ML6Un \"As abortion is hotly debated, it's still rare for us, whether as fellow women or even just as fellow people, to talk with one another about the abortions that we have.\" https://t.co/cP0Cx4NWFn Every skin color is celebrated in this series of stunning portraits—complete with matching Pantone backgrounds: https://t.co/q6DcYnG22F How we're helping local reporters turn important stories into national news: https://t.co/MShmv4TDq9 @gangadharpb A brief history of trans rights: https://t.co/RgHBRGK9Q8 RT @TED_ED: Let’s celebrate #WorldOctopusDay by taking a look inside the amazing octopus brain: https://t.co/m5bx2sJuCA \"Turns out, if you spend most of your life working in the conservative religious world, coming out as transgender is not all that great for your career.\" https://t.co/swLtdTNAHW “Imagine how the conversation would shift if we acknowledge just how long trans people have been demanding equality.” Watch Samy Nour Younes’s full TED Talk here: https://t.co/qFT75RDyKA https://t.co/j5NyW8xpJS The transformative power of video games: https://t.co/Cg9p7IiQ47 @HermanNarula Today, #SCOTUS will hear three separate cases about LGBTQ discrimination in the workplace. Pastor Paula Stone Williams lost her jobs after coming out as transgender. Here is her story: https://t.co/NueTsryJX9 \"There's something important about sharing your imperfections and your insecurities and your vulnerabilities with other people.\" @JonnySun https://t.co/dgKUJwcgLT Here’s how you can discover history’s hidden artifacts -- without leaving home: https://t.co/2LyBprqh8N How a global weather service for water could help fight issues like pollution and climate change: https://t.co/oat51Ebtuo A mother and son’s photographic journey through dementia: https://t.co/vVyDLi5udV https://t.co/1rzLtAoydV Why I became a climate activist -- and why you should too: https://t.co/pN585Hzk0D @Luisamneubauer \"We women have to start practicing bravery, too. We cannot teach our girls until we teach ourselves.\" — Watch the full TED Talk here: https://t.co/k3A0EZkxAH https://t.co/xBARTkepaA \"Let us not forget to think before we speak, just because we might have a screen in front of us.\" @ionewells https://t.co/A4E95jyuBr “Writing is visceral. If you write something down and don’t feel some kind of way, then it’s not working. It’s not doing what you wanted to do.” @JackieWoodson https://t.co/Pdr9JrQb4J \"CEOs have their employees suffer for them. But yet, the CEOs's pay goes up and up and up. And so many people are left behind. I'm here to tell you: no more. It's not right, it's never been right.\" @hamdiulukaya https://t.co/VdomrDfLpO An ancient rock suggests a new theory for how life started: https://t.co/4DrmTKTAxJ @tara_djokic Artist @JRart uses the city as his canvas, creating giant posters of human faces on bridges, walls, buildings, and more. \"93 percent of first year college males and 62 percent of females have seen pornography at least once.\" @EmRothman https://t.co/27GGvBYJoA Ever wonder who was behind Beyoncé's amazing Formation World Tour stage? Hear from the designer herself: https://t.co/TevShTIGvj \"Writing taught me everything I needed to know about creating worlds where people could be seen and heard, where their experiences could be legitimized, and where my story, read or heard by another person, inspired something in them.\" @JackieWoodson https://t.co/uUSizLfXhd \"To be online at any given point is to feel so much sadness and anger and violence. It can feel like the end of the world.\" @JonnySun https://t.co/xwN5Pwztlx \"Being queer and trans is about loving people as they are, not as they're supposed to be.\" @themrmilan https://t.co/U1UtEPgzuR \"As a child, I knew that stories were meant to be savored, that stories wanted to be slow, and that some author had spent months, maybe years, writing them.\" @JackieWoodson https://t.co/yD9b2GPeB9 \"When we’re frustrated, we reject the status quo, question the way things have always been done, and search for new and improved methods.\" @AdamMGrant #WorkLife https://t.co/2akVHAXbYo \"Hard choices are precious opportunities for us to become the distinctive people that we are.\" https://t.co/ujzqqhKoig The story of Marvel's first queer Latina superhero: https://t.co/ow8cL2xugK @QuirkyRican https://t.co/k8KCJ5jxXa \"We read to get lost, to forget the hard times we're living in, and we read to remember those who came before us, who lived through something harder.\" @JackieWoodson https://t.co/PeI8IJJj6Z A powerful story of what it means to be a true American: https://t.co/ohclcdiAqA @AnandWrites \"I am just one of millions of people who have been told that in order to fulfill my dreams, in order to contribute my talents to the world I have to resist the truth of who I am.\" @AmericaFerrera https://t.co/yLdiLaZYpv *Records voicemail greeting for the 20th time* https://t.co/Sa0jfyqkN9 A former New York Times cartoonist warns about the dangers of self-censorship: https://t.co/02NEbOsmqV Journalist @AndrewMarantz shares what social media companies—and you—can do to make the internet less toxic. https://t.co/fwSCl6rcB8 Kick start your creativity with ideas from your favorite makers and thinkers. https://t.co/Pv2xc0WPZk https://t.co/jrj1NAx4QQ Here's why you should decorate your workspace: https://t.co/XN1DG7Krwh 3 out of 10 times, your doctor prescribes or suggests something that is completely unnecessary: https://t.co/oIVGmmwosv Do you want to: \n -Be a better public speaker \n- Know how to negotiate your salary\n- Improve your communication skills\nWe'll find you the best TED Talks to help you sharpen your skills! https://t.co/dFa4rm2w9f https://t.co/ZoRV7jfv14 A brain scan revealed what's happening to you subconsciously when you eat: https://t.co/OQjQ626ahy Journalist @AndrewMarantz argues for curtailing toxic online speech that too often leads to real-world violence in @nytopinion. In April he spoke about the same at TED: https://t.co/Qa0aRkUwch \"As we looked at most prosperous countries today, we found they were able to reduce corruption as they became prosperous -- not before.\" https://t.co/LP8x7VhAAB \"Depression doesn’t diminish a person’s desire to connect with other people, just their ability.\" https://t.co/mIr1NxHHde Innovation is the antidote to corruption: https://t.co/yuOIfSz0Rz @EfosaOjomo “Walking in the forest is like moving through a picturesque vat of VapoRub.” Learn all about South Korea's \"healing forests:\"  https://t.co/UhdiaFGxYX “Isolation creeps in when your new boyfriend or girlfriend starts pulling you away from your friends and family, your support system, and tethering you more tightly to them.” @Join1Love https://t.co/YUh8npoPiU \"My identity is not my obstacle. My identity is my superpower.\" @AmericaFerrera https://t.co/GfBvnQZGWq 99 percent of rapists get away with it. That doesn't have to be the case. https://t.co/RCh4IlR08Z Why language is humanity's greatest invention: https://t.co/Gp2VUD7Qrp @Dedalvs \"We need to treat other people the way they want to be treated, which means we have to ask.\" @KimKatrinMilan https://t.co/ecyxE6BGV6 \"The hard choices — what we most fear doing, asking, saying — these are very often exactly what we most need to do.\" — @tferriss\nWatch the full TED Talk here: https://t.co/Yk8bCC7mNx https://t.co/Ymeloo0ulI My identity is a superpower — not an obstacle: https://t.co/mMWq0t0sMN @AmericaFerrera https://t.co/HI1yQz3PNR What happens in your brain when you taste food: https://t.co/yEDXBGDtrA https://t.co/flXey4ksqv Imagine if capitalism prioritized social good. Andrew Yang, now a Democratic Presidential candidate, explained his vision in 2018. https://t.co/r409TJvP94 \"Our outcomes are not meant to be playful, but our process is. To us, play is an act of resistance.\" \nhttps://t.co/bo0UgzzGvi “A trucker drove three days with a raging infection, only coming to see me after he had delivered his merchandise.” https://t.co/k53mrksesc Rising carbon levels in the atmosphere can make plants grow faster, but they rob plants of the nutrients we need to survive. https://t.co/w9mnq4bveh From Republican or Democrat to Red Sox or Yankees, humans have evolved to group ourselves: https://t.co/g6RUeS5YTt “British researchers found that one smile can generate the same level of brain stimulation as up to 2,000 bars of chocolate.” https://t.co/wcrLL3Jtp1 Here are some tips for finding serenity in the everyday: https://t.co/XHCs1MSvaX @RyanHoliday Creativity builds nations: https://t.co/T6Cj39pViw https://t.co/FOL1oS5oWq Stories can change dramatically depending on who is telling them: https://t.co/QgT0HTIa08 Deciding not to have children isn't \"selfish.\" https://t.co/GllqVZZ3sN There are five ways humans find community: Practice, proximity, purpose, providence and passion. https://t.co/dHz0BqceYD How community-led conservation can save wildlife: https://t.co/mtoda8FkvS @MoreangelsM https://t.co/aQ3xZ7K4S0 This giant squid is as tall as a two-story house. The footage of it attacking the camera is incredible: https://t.co/kn365SK5pG \"Systems are just collective stories we all buy into. When we change them, we write a better reality for us all to be a part of.\"  https://t.co/d1F6pYTNfm Expand your mind with the best ideas from the world's brightest minds.  https://t.co/sRa5b7aYXL https://t.co/Cz7AC3B21Q \"As a child, I knew that stories were meant to be savored, that stories wanted to be slow, and that some author had spent months, maybe years, writing them.\" Happy #NationalBookMonth! https://t.co/T1wfxY6zrl From tiny robots to dog poems: https://t.co/ujaMlOf328 \"It doesn't really matter where any of these pieces end up, because the real point for me is that they end up in your memory over time.\" https://t.co/zBmllcgCFm Capturing your vacation with your smart phone may be good for the 'gram, but not your memory. https://t.co/IRGo8oblOw The secret? Always let people know why their work matters. https://t.co/tQXvyFfdIA \"Shame is highly, highly correlated with addiction, depression, violence, aggression, bullying, suicide, eating disorders.\" —@BreneBrown\n\nWatch the full TED Talk here: https://t.co/NmkI2zjojl https://t.co/mfApRa422a Why some couples stop having sex, while others keep up a sexual connection for a lifetime: https://t.co/eE040GuPXs \"I am excited for a world where our entertainment could connect us instead of isolating us -- a world where we can bond with each other over our shared interests and create real, strong communities.\" https://t.co/S6CfXGrqqN “Write something good, and feel good about writing it.” @JackieWoodson https://t.co/RY6SOvaLsL Cannabis research has been banned for much of the last 100 years. Scientists are just now scratching the surface of its positive—and negative—side effects. https://t.co/RLd4XXAMf5 Art that explores time and memory: https://t.co/Wfv5a9AbHc @SarahSze It's not true that young people are more creative — but there is one factor that changes as you get older: https://t.co/HBTtI6KDQM It's time to start playing the long game. https://t.co/lbcX5uzIag \"Domestic violence happens to everyone -- all races, all religions, all income and education levels.\" https://t.co/cHXNxp3yJC \"I need each of you to tell every young woman you know to be comfortable with imperfection.\" https://t.co/VuOfcnpngk @reshmasaujani \"Abuse thrives only in silence. You have the power to end domestic violence simply by shining a spotlight on it.\" https://t.co/WesIkliGPu \"There are an infinite number of histories that we could've had. We only get one, and wow, did we ever get a good one.\" https://t.co/A7DRfr4KR1 Why domestic violence victims don't leave: https://t.co/OJ203XLyc5 18 TED Talks to help you deal with the internet when it's driving you nuts: https://t.co/2daYdCjTni This is how stolen nude photos turn lives upside down:  https://t.co/fqdnzreEWo Fun fact: Despite contrary belief, Richard Nixon was never impeached. https://t.co/yYFajx4Ijs \"Dinosaurs pushed the envelope of physiological possibility, broke record after record and were paragons of success by almost any measure.\" @kenlacovara https://t.co/XJI9AdwAHH \"I tend to find the ecstasy hidden in ordinary joys, because I did not expect those joys to be ordinary to me.\" https://t.co/HkI5w1xLmI Couples who sustain strong sexual connections over multiple decades have two things in common: https://t.co/XoGbSZvwNC @emilynagoski We're building a dystopia just to make people click on ads: https://t.co/iKaJVvt5ua @zeynep https://t.co/38282h9Nwr Why you should search for meaning — not happiness: https://t.co/my8yU4NvyF @EmEsfahaniSmith https://t.co/K4UPLmT9Hj \"The secret to high performance isn't rewards and punishments, but that unseen intrinsic drive: the drive to do things for their own sake. The drive to do things cause they matter.\" #MondayMotivation https://t.co/aKgrs7NCJs \"Your life isn't just a list of events. You can edit, interpret and retell your story.\" @EmEsfahaniSmith https://t.co/kiJhpA53qo FYI: Impeachment does not equal removal from office: https://t.co/wkB70oK4K3 \"Sooner or later, I think we all wonder: Is this all there is?\" @EmEsfahaniSmith https://t.co/oXDfcX5D4F The epic carbon-capturing potential of seaweed: https://t.co/C8Pjxbb0oY “If you’re depressed or anxious, you’re not weak and you’re not crazy —you’re a human being with unmet needs.” \nhttps://t.co/CsJCbSxrOA @johannhari101 We’ll just leave this right here: https://t.co/1s4ASIsNUn How one tree grows 40 different kinds of fruit: https://t.co/iQD1lZRV0v https://t.co/LyydafCGZB Climate activist @GretaThunberg shares why we must act now to fight climate change. \n\nWatch Greta's full TED Talk here: https://t.co/YZwJqravoV https://t.co/DSjp8IH9Nh Kids make up a quarter of the population, so shouldn't they have a say in what their world will look like? https://t.co/9sHQtylvHk @mara_mintzer Why we need a global weather service for water: https://t.co/5xOhXWKLwl Anyone, regardless of age, can become a climate activist. #ClimateStrike\n\nWatch @Luisamneubauer’s full TED Talk here: https://t.co/8Q0prEbJoe https://t.co/WOPmgZOipG \"Hard choices are hard not because of us or our ignorance; they're hard because there is no best option.\" https://t.co/5hdlJum7M1 12 TED Talks about the weather you'll actually want to talk about: https://t.co/7psC3j5NmO Find out what drives your creative process — and how to achieve your full potential.\nhttps://t.co/JctQqZIlmx \"We have to live simply, so that others can simply live.\" https://t.co/QoMuMfT4hF Get a realtime look at how beatboxers make such wild sounds:  https://t.co/yLgNerREEs Ever wonder what your smile says about you? \n\nWatch Ron Gutman's full TED Talk here: https://t.co/5xlYEVf6W6 https://t.co/MITrY4hGPJ What we could learn from a family tree of all humankind: https://t.co/UPFDKNPh4C While you're sleeping, your brain is hard at work cleaning itself: \nhttps://t.co/gMeaUS4YrL How to help kids fall in love with the outdoors: https://t.co/E2UYLTIBGI Great advice for all the 20-somethings in your life: https://t.co/w3fZgBCyH8 Great advice for all the 20-somethings in your life: https://t.co/d5iXgo73S6 Break out the cat pictures and succulents in the name of productivity! https://t.co/mN7Aq33Aza Congratulations to @flordetoloache on their Latin Grammy nomination! Check out their performance from the TED stage here: https://t.co/jRhr5F85vt “If they’re hired, we’ll spend more waking hours with each other than with our families, so I’m checking, Can they carry on a regular conversation?” https://t.co/4m9L8de7us How we’re building the world’s largest family tree: https://t.co/CsTUBSZ89l @erlichya https://t.co/X0mMXFr1mB Take some time for yourself. Let us help you find the inspiration you're looking for. https://t.co/iOUpGggcip https://t.co/DmcMc2jvZ8 Some social scientists say replacing voting with a jury system could be the best way to improve democracy. Here's why: https://t.co/NzKe9RVsr7 “If they’re hired, we’ll spend more waking hours with each other than with our families, so I’m checking, Can they carry on a regular conversation?” https://t.co/C3NHSX85hx Have trouble thinking positively? This will help.  https://t.co/YHoW8JRYlH Get out of your bubble with ideas from the most joyfully curious minds in the world. https://t.co/2G4TfE8QCw https://t.co/Zjb1uvUTbg Here's how impeachment works (via @TED_Ed): https://t.co/SFXI7gedGI This is what distinguishes extraordinary altruists from the average person.\n\nWatch Abigail Marsh’s full TED Talk here: https://t.co/e7T92p2R5F https://t.co/aO0Zg9fTKt \"Being resilient means you face stressors, not eliminate them. To be resilient means you learn from your mistakes, not avoid making them.\" https://t.co/LWYcCL0TXr The next time you want to endlessly scroll social media, let yourself be bored instead. It'll greatly improve your creativity.  https://t.co/kmYiG7hWPE Ask your meeting attendees: \"What’s going well in our meetings? What could be done better? Do you have any specific ideas to improve them?\" https://t.co/0LoyBJJjPY How couples can sustain a strong sexual connection for a lifetime: https://t.co/LCjVFncHnj @emilynagoski https://t.co/R6CtiGCGvQ Apologizing is hard. Try these simple steps to make it easier: https://t.co/bqFGiOZmhk Learn how to improve your visual intelligence: https://t.co/QgarivayxD This is what truly leads someone to change their worldview. https://t.co/5Xah5UxwVI 6 ways to make people laugh, according to science: https://t.co/qBhn9FOLNF Here’s how Game of Thrones star @Maisie_Williams went from an aspiring dancer to on-screen assassin: https://t.co/oGCK21HGfJ Can seaweed help curb global warming? https://t.co/AMm46QftMP https://t.co/WkAxVZmfp6 Executive function is our ability to consciously control our thoughts, emotions and actions in order to achieve goals — like learning how to drive. https://t.co/4XB8JiVm58 A bold plan to empower 1.6 million out-of-school girls in India: https://t.co/8W9DLPTkYP @safeenahusain Ready to flourish? We've got ideas to motivate and inspire you when you need it most. \nhttps://t.co/tcnZx4mb0a https://t.co/VZ4k0VSVQQ \"To bloom, we must learn not to fear self-doubt but to embrace it as a naturally occurring opportunity for growth and improvement.\" https://t.co/zUlJj1erNy \"Romantic love is not an emotion; it's a drive. It comes from the wanting part of the mind, the craving part.\" https://t.co/Lh3H1NEZBD \"A grieving person is going to laugh again and smile again. If they're lucky, they'll even find love again. Yes, absolutely, they're going to move forward. But that doesn't mean that they've moved on.\" @noraborealis https://t.co/LnJ3TYoZWJ 3 mathematically verified tips to improve your love life: https://t.co/gXu063vDqe The best way to get a baby to laugh? Research confirms.... it's peekaboo. https://t.co/ST2fBwpPWR \"One of the simplest facts in business is something we often neglect: We're all human.\" \nhttps://t.co/E6FOmDEpel Here are the tricks politicians and other public figures use to convince people of their ideas: https://t.co/KzqEPUpCJy Why @justinbaldoni is done trying to be \"man enough\": https://t.co/g1cCRCKZiC #ManEnough https://t.co/oTSTPtkIU4 No one makes us love dinosaurs like @kenlacovara. https://t.co/MTdnRhDujs \"America was fracturing into two distinct societies: a republic of dreams and a republic of fears.\" https://t.co/L3juhyw5QX \"One should never, ever remain silent for fear of complexity.\" @Elif_Safak https://t.co/H0E9seIDgF What it's really like to live with ADHD: https://t.co/4W1oWXzSTd @HowtoADHD Self-reflection is not the same as self-knowledge. Here's how to truly get to know yourself: https://t.co/WrTd2LZCpB When we’re forced to say goodbye to someone in the physical form, we’re also being offered an opportunity to say hello to them in our imaginations. https://t.co/RCnYdSn1Uj \"Believe her. Believe her.\" @AshleyJudd https://t.co/EhSGz8lCde This is what happens when you click on an ad online: https://t.co/DxSvcHq2GW Why I interview people who leave me mean comments: https://t.co/7E7aYaNFbS @dylanmarron https://t.co/Fw19bVChC3 Do you know how much the person next to you gets paid? https://t.co/f03btEclFo Let's put an end to millennial bashing: https://t.co/yj9L6XQTHC PSA: Cuddle after sex! https://t.co/7R63goYYNJ Here's how to stop ruminating and move forward: https://t.co/3k8zTsG5K9 Email taking over your life? Try this: https://t.co/ScNVEzH7Jy We need to track the world’s water like we track the weather: https://t.co/gqOyU1IW8y @sonaar https://t.co/e8zdILkBGf Today, millions of people are participating in the Global #ClimateStrike to demand an end to the age of fossil fuels. The youth-led movement is spearheaded by 16-year-old activist @GretaThunberg. \n\nWatch Greta’s full TED Talk here: https://t.co/YZwJqravoV https://t.co/ESfJjSvTs8 When we define racism as behaviors instead of feelings, we can measure it — and transform it from an impossible problem into a solvable one, says justice scientist @DrPhilGoff. https://t.co/4IOJKy6wGG The Global #ClimateStrike is happening all around the world today. Here’s what to know if you’re participating: https://t.co/IZaQLWfViL Struggling to remain optimistic? Here are eight tactics to help: https://t.co/wQ1Kvzvdod Are protesting and marching too stimulating for you? You're not alone — and you can still contribute to your favorite causes: https://t.co/CE8jLPO7aU? Young people all over the world are protesting today for the Global #ClimateStrike. 23-year-old @Luisamneubauer encourages anyone, regardless of age, to become a climate activist and join the movement. \n\nWatch Luisa’s full TED Talk here: https://t.co/oyTb8iewIR https://t.co/rGAP78pAkZ \"Why study the past? Because that’s where the answers are.\" @kenlacovara https://t.co/qTGzAD4r02 The simple questions that will help you avoid unnecessary medical care: https://t.co/FO7E2OCVFy Here’s how movements create monumental change: https://t.co/ASUEDLXiEX Connect with people who know what you're going through.   https://t.co/d3QKEJAzm7 https://t.co/7S9ofWUsUe 4 questions you should always ask your doctor: https://t.co/ZFPuEA7KIk @cmjaset https://t.co/JldyCfoQA4 What can the ancient past teach us about parenting today? An archaeologist explains: https://t.co/BMZCTPF6Gt You were wrong — but you felt so right. Here’s why: https://t.co/tTGyCePgbj @juliagalef \"The climate crisis has already been solved. We already have all the facts and solutions. All we have to do is to wake up and change.\" @GretaThunberg https://t.co/RLumVFyFsn \"Queerness encompasses all of the layers of who I am and how I've loved.\" @KimKatrinMilan https://t.co/RX0zi3Sxum Here’s how you can be less distracted and more focused: https://t.co/97xfTCBlOc 4 steps to becoming a climate activist: https://t.co/xfl6eOhQHV @Luisamneubauer Why I became a climate activist -- and why you should too: https://t.co/xSsceq2mg9 @Luisamneubauer \"Everyone keeps saying climate change is an existential threat, and yet they just carry on like before. I don't understand that, because if the emissions have to stop, then we must stop the emissions. To me that is black or white.\" https://t.co/Pa7FMkbH7q @GretaThunberg This could be why you're depressed and anxious: https://t.co/24WBqvYU6y @johannhari101 https://t.co/ggczbVTWbk The honest reasons why people write mean comments online: https://t.co/JWdnc2OPiA @dylanmarron https://t.co/I2ZU7fTvdt Our emotions can cause our hearts to change shape in response to grief or fear, and even to literally break.\n\nWatch @sjauhar's full TED Talk here: https://t.co/Rw8yWbV8it https://t.co/2U2jMpeHnJ @Talbotus We're so sorry you're going through a difficult time right now. We’ve added the full TED Talks as a tweet reply to the original video. We hope they help ❤️ 4. How to tame your wandering mind: https://t.co/49AVENCJZN 3. The gift and power of emotional courage: https://t.co/92UzOhPSmr 2. How to make stress your friend: https://t.co/OQHP7Vtm40 Here are the full TED Talks featured in this video: \n1. How to stay calm when you know you’ll be stressed: https://t.co/qbF0qVj2LE “You don’t need to have a great vocabulary. What you need to have is a creative way of using the words you have.\" @JackieWoodson https://t.co/hrgXkyfBrR You are not alone in your loneliness: https://t.co/Phjs8Xp2DC @jonnysun https://t.co/2BzMH5rQXQ This is the psychology of PTSD: https://t.co/ABuaniwwg5 \"Far too often, responsibility is attributed to female survivors of sexual violence, and not to the males who enact it. Far too often, the denial and running leaves all parties at a great distance from the truth.\" https://t.co/ScHGW7aZTL Is women's sexuality actually more complicated than men's? No. https://t.co/NPe2Pr0jvu If you want to:\n\n- Be a better leader\n- Improve your communication skills \n-Solve big problems  \n\nWe’ll send you the perfect TED Talks to help you make a difference.  https://t.co/rS3RE9pxXy https://t.co/LizvezN64s A free world needs political cartoons: https://t.co/RV4M8PUBb1 @PatChappatte https://t.co/TL94c3Jode Here’s how to fight stress — and win: https://t.co/4y6JlMk7Fs How @tavitulle built a space for strong female, teenage role models to find each other: https://t.co/GdOMFxJ1R0 \"When someone shares that they feel alone, it actually makes me feel less alone, not by getting rid of any of my loneliness but by showing me that I am not alone in feeling lonely.\" @JonnySun https://t.co/zYFgHbpsGu “The truth is, unhealthy relationships and abuse are all around us. Abuse sneaks up on us disguised in unhealthy love.” @Join1Love https://t.co/S6LPdA7j1B This is the ultimate story of forgiveness: https://t.co/oiNGwLcXGW Intelligent machines have learned to control you — and we don’t know how they did it: https://t.co/qtfite1Eao @zeynep Hear stories from people who've been where you are. https://t.co/fNpCzMALX6 https://t.co/qHg38RSL2K Why teens love vapes — and why they’re dangerous for them: https://t.co/7uSfPbAkXB Get out of your own way: https://t.co/e3GyMvtOft What streaming means for the future of entertainment: https://t.co/An2jvR7kRz @eshear https://t.co/nu7opPtcYC \"Everyone keeps saying climate change is an existential threat, and yet they just carry on like before. I don't understand that, because if the emissions have to stop, then we must stop the emissions. To me that is black or white.\" @GretaThunberg https://t.co/uwaXxCUrKG Here's why it matters that Facebook knows everything about you: https://t.co/1YI67JbzP6 “Healthy love includes independence, two people who love spending time together but who stay connected to the people and activities they cared about before.” @Join1Love https://t.co/Q7wvEq7Gqj Let us debunk some age-old myths about women’s sexuality! https://t.co/REZU6RPiYf \"Stories can punch holes in our mental walls. And through those holes, we can get a glimpse of the other.\" https://t.co/H5icSQdm0D \"If I could have dinner with anyone, dead or alive, I would. I am very lonely.\" @JonnySun https://t.co/9GtdIbfkY2 Want to be a good person? Let go of the concept of \"good.\"  https://t.co/hK9HNyw9m8 “While love is an instinct and an emotion, the ability to love better is a skill we can all build and improve on over time.” @Join1Love https://t.co/YfMuFDGVdQ If you want to be a good person, start by allowing yourself to make mistakes. https://t.co/R3Se1TANPC Leave the bad vibes at the office: https://t.co/FUpkHCDiez \"Female sexuality can't be fixed with a pill. That's because it's not broken: it's misunderstood.\" https://t.co/S2L1bAhU3o \"Empathy is not endorsement. Empathizing with someone you profoundly disagree with does not compromise your own deeply held beliefs and endorse theirs. It just means acknowledging the humanity of someone who was raised to think differently.\" @dylanmarron https://t.co/rpKaxmmOrJ Outsmart your own brain: https://t.co/376LJaZO9f \"Nobody deserves this. Nobody deserves this level of humiliation.\"  https://t.co/RxeRnPKJwv “Your partner should have your back. Their words should build you up, not break you down. They should make you feel more confident, not less.” @Join1Love https://t.co/NhATQ52Fi5 “Abusive relationships don't start out abusive. They start out exciting and exhilarating. There's an intensity of affection and emotion, a rush. It feels really good.” @Join1Love https://t.co/yLbspyY3W7 “It's important in the early days of a new relationship to pay attention to how you're feeling. Are you comfortable with the pace of intimacy? Do you feel like you have space and room to breathe?” @Join1Love https://t.co/fShQuYEL8F Wanting to be a \"good person\" is making us bad people. Here's how:  https://t.co/IKowsYTfVC How close are you to deleting Facebook? https://t.co/doqhbntUub “Abusive relationships don't start out abusive. They start out exciting and exhilarating. There's an intensity of affection and emotion, a rush. It feels really good.” @Join1Love https://t.co/pwikFS1N0F \"I realized that the man who I loved so much was going to kill me.\" https://t.co/knJ7qsT9Id Before the 20th century, doctors would test if someone was truly dead by chopping their finger off or burning their feet. The other examples made us too nauseous to tweet, but you can read for yourself: https://t.co/w6SNLeNvdP Worried about being buried alive? This mortician will calm your fears ... maybe: https://t.co/N99tOxpGXu Some #FridayThe13th weirdness for you: https://t.co/VxEypXdkc5 In honor of #FridayThe13th: https://t.co/llNvrQfsY1 Whether you’re interested in fashion, the environment, creativity, or more, you can find a whole new world of ideas, curated just for you: https://t.co/IKVIynteIY Bono shares data that shows the end of poverty is in sight... if we can harness the momentum. Watch his full TED Talk here: https://t.co/RzwGdAuxlB https://t.co/2Hj7n15O1o This is what it’s like to hear color. Watch @NeilHarbisson’s full TED Talk here: https://t.co/JiDIApvH4V https://t.co/JTVvGJOXqz This helpful way of thinking about creativity doesn't require you to be a tortured, brooding artist. Watch \n@GilbertLiz’s full TED Talk here: https://t.co/eN3dmalQom https://t.co/mM3eNTl3ic Viewing a stressful situation as an opportunity to improve your skills, knowledge or strengths makes it more likely that you'll experience stress inoculation. https://t.co/Onjrp5abcx A potential way to stop Venice from sinking?  Sustainable architecture that actually repairs itself. Watch Rachel Armstrong’s full TED Talk here: https://t.co/fMwyVGOw4b https://t.co/cBHhg06Mwm It’s the end of #nyfw! Legendary fashion designer @DVF curated a short playlist of some of her favorite TED Talks. Check them out here: https://t.co/0RXgbY3UAt The dirty secret of capitalism -- and a new way forward: https://t.co/QI88mccaoR @NickHanauer https://t.co/ZyfjQa4wGu People who are good at stress allow themselves to be changed by the experience of stress. https://t.co/gDZftVaNZo Writer @JackieWoodson invites us to slow down and appreciate the stories that take us places we never thought we'd go and introduce us to people we never thought we'd meet. \n\nWatch her full TEDTalk here: https://t.co/Shqn3bkxaP https://t.co/dFdmWBcxag This is what you're actually inhaling when you vape.\n\n(Hint: It's not water vapor.)\nhttps://t.co/I2Uc5XXoS5 Let's just go home. https://t.co/qdMz11hgWb How to spot a narcissist at work: https://t.co/ZA0NvJ8P2a This new model could shift the landscape of power in the US court system: https://t.co/KsCNYrKLvR Introspection is great, but you have to do it the right way. https://t.co/WgsTMlyeYP Be a better friend, partner and coworker.\nhttps://t.co/CYRYeBOrpn What reading slowly taught me about writing: https://t.co/oqP8OR9lrj @JackieWoodson RT @JackieWoodson: What reading slowly taught me about writing (Jacqueline Woodson | TED2019) https://t.co/cCgwqr9CUh via @TEDTalks \"If your creativity is driven by a desire to get attention, you're never going to be creatively fulfilled.\" @hitRECordJoe \nhttps://t.co/FdaSGvNcxw Do yourself a favor and let go of some of your misconceptions about casual sex. https://t.co/WYjYPkWu4w The countries with the biggest disparities in wealth also have the longest workweeks.  https://t.co/vkNFJrC42Z Myth 1: Women are biologically less interested in casual sex.\nMyth 2: Monogamous sex is better and safer, and monogamous people have better relationships.\nMyth 3: Sex is immoral and dangerous.\n\nHere's what the research actually says:\nhttps://t.co/yEtWjwBFBG Helpful advice for aspiring writers, from the great @JackieWoodson: https://t.co/p9mIhPw1OI \"Imagine the night before an election. There's a deepfake showing one of the major party candidates gravely sick. The deepfake could tip the election.\" @daniellecitron https://t.co/3uQB5Yj8oN Bad news. E-cigs and vapes are basically the Trojan horses of nicotine: https://t.co/F7LFGCOUkH Stress isn't all bad. https://t.co/UpeTzuvGKn How to be good at stress: https://t.co/YxWc3FnHpX @jonnysun Big mood. RT @JackieWoodson: My brilliant friend, @DrPhilGoff, breaking it down. Take the time to watch, please. Perfect for classrooms, too.    \nHow… Thoughtful ways to grieve those we've loved and lost: https://t.co/nLn2VtSYML RT @sjauhar: A record of our emotional life is written on our hearts. My TED talk. \n\nhttps://t.co/PnEA7CUjZD via @TEDTalks Our emotions can cause our hearts to change shape in response to grief or fear, and even to literally break.\n\nWatch @sjauhar's full TED Talk here: https://t.co/Rw8yWccJH3 https://t.co/MehI9r3OBb How deepfakes undermine truth and threaten democracy:  https://t.co/0A3ZcFkXAg @daniellecitron https://t.co/cjCcsZVXFX RT @daniellecitron: Here is my TED talk on Deep Fakes. Thanks @TEDTalks How deepfakes undermine truth and threaten democracy (Danielle Citr… \"We have a system of justice that treats you much better if you're rich and guilty than if you're poor and innocent.\" https://t.co/A5oqzXurQL Sometimes complex problems are best solved with simple solutions, but a simple solution is deceptively difficult to find. \n\nIn this episode of the @TEDRadioHour, 5 TED speakers show the innovation and hard work that goes into achieving simplicity. https://t.co/sDgw0au44r \"Life is not linear; it's organic. We create our lives symbiotically as we explore our talents.\" https://t.co/tq44PoLd9M It may actually be possible to die of a broken heart. https://t.co/EOzxSWr8Wq RT @freestylelove: Our fearless creator Two Touch did a fully improvised TED talk (based on Speechless Live, using slides the speaker has n… RT @Lin_Manuel: Wherein Anthony, armed in nothing but a suit and head mic, rolls up on Ted, knowing nothing about the slides he’s displayin… Great ideas that will change how you see yourself.https://t.co/d7vDoIf23b https://t.co/YkDqAtKeLK A “living drug” that could change the way we treat cancer: https://t.co/oxjE8KNEWs https://t.co/HZEHQFRjm1 6 techniques of clear and compelling speech to help you convince people you're right: https://t.co/Hf5kxqJWZN For years, Sergeant Kevin Briggs patrolled San Francisco’s Golden Gate Bridge, a popular site for suicide attempts. Here's his advice on talking to a loved one who you fear might be suicidal. #WorldSuicidePreventionDay\n\nWatch the full TED Talk here: https://t.co/iSBkV9Epa4 https://t.co/Ur9hhlDUsw Incredible talks for inquisitive minds. https://t.co/620A91utOs https://t.co/1oDubiPgdI The politicians who most clearly understood the danger posed by Hitler were the ones who never met him.\n\nDo you know how to recognize evil in strangers? https://t.co/UTA4D5HNaV How our inborn tendencies and biases skew our judgement and prevent us from spotting the evil among us: https://t.co/iU3ZRlz33H Most of us want to believe we would have flagged Hitler and Madoff right away if we met them in person. But would we have? https://t.co/C7OwJCDAGz Adolf Hitler, Bernie Madoff and Amanda Knox show us 4 mistakes we all make when meeting new people: https://t.co/n252U4En2J Do you know how to spot a bad person? https://t.co/rxEDrOgSt6 When we define racism as behaviors instead of feelings, we can measure it — and transform it from an impossible problem into a solvable one, says justice scientist @DrPhilGoff. https://t.co/Wy086EUfjB What would your best self do right now? https://t.co/AOh1xQCoDY 4 steps to help you regulate unpleasant emotions: https://t.co/elJYYFGrXX In praise of the 10 minute meeting. https://t.co/TvHa9KrzD2 RT @MsPackyetti: Look, @DrPhilGoff's @TEDTalks is finally live and I promise you you don't want to miss it:\n\nhttps://t.co/X3bhpI2Y7H RT @DrPhilGoff: So...this happened. https://t.co/Yhstuq1T7C Let's talk about COSMIC DUST. https://t.co/5QIlSmS524 How we can turn racism into a solvable problem -- and improve policing: https://t.co/BW2i6QDWZl @DrPhilGoff https://t.co/ExoNPy8X4O \"A lot of the people I spoke to seem to have a combination of a high IQ and a low EQ. They seem to take comfort in anonymous, online spaces rather than connecting in the real world.\" @andrewmarantz https://t.co/SHPmJRRWo0 \"Divorce is not the end of a family; it’s a reorganization.\" @EstherPerel https://t.co/0tRYpcxn2P Inside the perplexing and creative world of making puzzles: https://t.co/TPCUz8wGw8 @traffiquelite Kumbh Mela is a Hindu festival that takes place every 12 years at the confluence of the Ganges and the Yamuna rivers. Over a 100 million people visit the sacred site in 55 days. \n\nLearn how this megacity is built in about 10 weeks — and then taken down: https://t.co/NEqz0CsNV8 \"We don't think that youth should be watching pornography. But we want them to become critical thinkers if and when they do see it.\" @EmRothman https://t.co/bNHmNZaf1F \"The objective of economic policy should be collective well-being: how happy and healthy a population is, not just how wealthy a population is.\" @NicolaSturgeon https://t.co/NiXdlbMmPE \"Education is a critical protective factor against contact with the criminal legal system. So we should be building out policies and practices that keep girls connected to their learning, rather than pushing them away from it.\" @MoniqueWMorris https://t.co/fZR6jLklMm Why this artist repaints houses destined for demolition: https://t.co/MjeI7lbwbe \"Disability is as visual as race. If a wheelchair user can't play Beyoncé, then Beyoncé can't play a wheelchair user.\" @maysoonzayid https://t.co/ymSNZFBHC8 These soft robots could revolutionize everything: https://t.co/OcJx8AKjlz \"Winning is super addictive. Once you experience it, you always want to get that feeling again.\" @serenawilliams https://t.co/Thy9xsRKrR 3 lessons on starting a movement from a self-defense trailblazer: https://t.co/tsApQskPOA @ranabdelhamid https://t.co/7k1VfJ75QT Why we must evolve the human body: https://t.co/UAWHhbYues @EvolvingJuan What will humans look like in 100 years? https://t.co/17WryOQbyr @EvolvingJuan https://t.co/w6VSoJrwYa \"Positivity is something worth fighting for, and the fight is not with others -- it's internal.\" @leethomastv https://t.co/gtBZaB0NMZ \"One of the simplest facts in business is something we often neglect: We're all human.\" \nhttps://t.co/YeoO5Ofgbn \"If your creativity is driven by a desire to get attention, you're never going to be creatively fulfilled.\" @hitRECordJoe \nhttps://t.co/xwuS9q8FMO Connect with people who know what you're going through: https://t.co/W8v3RV5n6d https://t.co/Ef4UK0S5nM \"A political leader's ability to do good is limited, but their ability to do harm is unlimited.\" https://t.co/AYCVsnf45O \"It's just a skin disorder. It's not contagious, it's not life-threatening, it just makes me look a little different.\" @leethomastv https://t.co/CgtlkRltCL \"Every time I lose, it takes a really long time for me to lose again.\" @serenawilliams https://t.co/8dc0pX9siA \"These things aren't joyful for just a few people; they're joyful for nearly everyone. They're universally joyful.\" https://t.co/L5tZErB6HF \"This is the most exciting adventure human beings have been on. This is the greatest superpower we have ever had.\" https://t.co/qfsBVSxu8A Want to help people impacted by Hurricane Dorian? Don't do this: https://t.co/27lrtFzJ3h When (and how) children begin to change their behaviors in the presence of others: https://t.co/lXXyjCHsyH \"One of the things I know as a historian is that you should never underestimate human stupidity.\" https://t.co/OeBheHC1Hj When a disaster happens, this is how you can effectively help: https://t.co/zHWUWSGPzd \"I don't have goals; I have fantasies. They're exactly like goals but without the hard work.\" \n https://t.co/nYvh6qCAQj What explains the rise of humans? https://t.co/mXJj00q0aS https://t.co/4oGTUClo6G Great ideas that will change how you see yourself: https://t.co/GJlPO8rfqz https://t.co/ycuxg3qCnE Why business leaders should measure employee happiness: https://t.co/1cjqFoJtox \"The thing that makes Goliath seem strong is the source of his greatest weakness.\" https://t.co/zGTaR03X1Y Headed back to school? Let us help you with your homework: https://t.co/DajnYYslCB https://t.co/DNl4AKKs1k How to teach teenagers to think critically about porn: https://t.co/QqwOKFCWRk This is how to build your life around joy: https://t.co/9DQoCV7O75 Whether you’re interested in fashion, the environment, creativity, or more, you can find a whole new world of ideas, curated just for you: https://t.co/LpNbrywdKY Bono shares data that shows the end of poverty is in sight... if we can harness the momentum. Watch his full TED Talk here: https://t.co/RzwGdAuxlB https://t.co/bS5ThKRxwu This is what it’s like to hear color. Watch @NeilHarbisson’s full TED Talk here: https://t.co/JiDIApvH4V https://t.co/vb5odZgxCi This helpful way of thinking about creativity doesn't require you to be a tortured, brooding artist. Watch @GilbertLiz’s full TED Talk here: https://t.co/eN3dmalQom https://t.co/pFU6cFA4b8 A potential way to stop Venice from sinking?  Sustainable architecture that actually repairs itself. Watch Rachel Armstrong’s full TED Talk here: https://t.co/fMwyVGOw4b https://t.co/3YzLsMDt2b It’s the first day of #nyfw! Legendary fashion designer @DVF curated a short playlist of some of her favorite TED Talks. Check them out here: https://t.co/Xt5Z0U8xYV What boomers can learn from millennials at work — other than how to download a PDF. https://t.co/67BhQkvycG \"We focus on the pursuit of happiness as though it's an object we have to go out and get.\" https://t.co/h3LhTUiuDm This powerful talk by Bryan Stevenson got the longest standing ovation in TED's history: https://t.co/YCNtY7wU08 Why I became a climate activist -- and why you should too: https://t.co/TDKApzC283 @Luisamneubauer \"Money is the most successful story ever invented by humans, because it is the only story everybody believes.\" https://t.co/wVBVPcrGio Here's what baby boomers can learn from millennials at work — other than how to use the office printer: https://t.co/J0Pxr0ROVt Movies like \"Juno,\" \"Little Miss Sunshine\" and \"Slumdog Millionaire\" almost didn't get made — until The Black List. \n\nThis is how one list changed where Hollywood looks for talent: https://t.co/9FHnv3WkV5 “Sloths have taught me a lot about slowing down. The planet would benefit if we all took a slowly digested leaf out of their book.” https://t.co/sdg9LZ5Dgj \"I became a better man, the man I always wanted to be, the kind of guy who can stand up in front of a room full of strangers and tell some of the toughest stories in his life and end it all with a smile.\" @leethomastv https://t.co/xR2a6Vn4u0 \"We cannot just look away from this stuff. We have to try to understand it, because only by understanding it can we even start to inoculate ourselves against it.\" @andrewmarantz https://t.co/iKbarUReDd \"Contrarian white teens of the world, look: if you are being a round earth skeptic and a male privilege skeptic and a racism is bad skeptic, you're not being a skeptic, you're being a jerk.\" @andrewmarantz https://t.co/RgNSjjzbf3 Inside the bizarre world of internet trolls and propagandists: https://t.co/Y3Vudnrr1R @andrewmarantz Inside the bizarre world of internet trolls and propagandists: https://t.co/B4BjQDv5tj @andrewmarantz https://t.co/cXlegxjMsM In this exciting tech demo, @ipoupyrev lays out his vision for a physical world that's more deeply connected to the internet: https://t.co/BEdXO2UO1G https://t.co/EWIMS8hNJ1 “Domestic workers are in charge of the fundamentals. They love and they care, and they show compassion no matter what.” @aijenpoo https://t.co/NleNP8AXwz In the opioid crisis, here's what it takes to save a life: https://t.co/1jiIHJmVGG @blazinwv https://t.co/CqQ1JG3i9d \"Less than 50 percent of the states in the United States require that sex education be taught in schools. Less than half of those states require that the information presented be medically accurate.\" @EmRothman https://t.co/Vx0CetoueJ The real reason female entrepreneurs get less funding: https://t.co/6vxDptPDZM @KanzeDana https://t.co/fn8OFJTrK6 \"Babies have always represented humanity's best, boldest, most beautiful infinite possibilities.\" @WajahatAli https://t.co/qSHMU3n10R Why we need a food revolution: https://t.co/htJj1TDOJ0 @JamieOliver \"I believe that all of us are born into a reality that we blindly accept until something awakens us and a new world opens up.\" @ashweethashetty https://t.co/rVmd3hOFJF \"A child’s fundamental sense of security in the world is based on their caregiver being someone they can rely upon.\" https://t.co/Nw36XZMbb2 \"These adolescents may not be adults yet, but they are living in an adult world. And they're ready for adult conversations.\" @EmRothman https://t.co/fCrNpSzqq4 https://t.co/tDCaaQObSI We asked improv master Anthony Veneziale of @freestylelove to give a TED Talk on a random topic with slides he'd never seen before. This is what happened. https://t.co/dZcdpDFMvt The untold story of David and Goliath, or the advantage of being an underdog: https://t.co/cHjKirmlmp \"All you need is one person, just one person who trusts and believes in you, and then you feel you can do anything.\" https://t.co/3c5jmrDHVZ Want to help people impacted by Hurricane Dorian? Don't do this: https://t.co/QTA73iGLUI RT @EmRothman: Porn isn’t the enemy. The lack of conversation about how to have good, consensual sex IS.\n\nHow to teach teenagers to think c… How to teach teenagers to think critically about porn: https://t.co/01tftOCZuJ https://t.co/McL5yokU2x One of the expert cleaners on the reality TV show Hoarders gives his advice on letting go: https://t.co/kty13cXlFh Stop asking yourself if something \"sparks joy.\" https://t.co/wDeBXWq2IC Most of us accumulate things because we think they’ll make us happier. While they might, it’s a short-term buzz. \n\nWhat will definitely make you feel better — and free up time and space — is letting go of stuff you don’t use. Here's how: https://t.co/GqAlvcKgeZ What happened when an at-home DNA test kit revealed an unsettling truth about a daughter's birth father? \n\nListen to this episode of #SincerelyX anywhere you get your podcasts and dive into the whole season only on @hearluminary. https://t.co/bR8rL1IVj3 https://t.co/p0NZV2bOhj Soil can offset global warming... if we stop treating it like dirt. https://t.co/TxhQSWp27T @aaberhe A climate change solution that’s right under our feet: https://t.co/WsoYz4Ho6a @aaberhe https://t.co/XdNh3BP9Se In spring 2019, more than 17,000 Europeans from 33 countries signed up to have a political argument with a complete stranger. Here's how it went: https://t.co/FFdN4Kob8v @Jochen \"Never provide poor solutions to poor people. They are smart.\" @chetnavsinha https://t.co/fkExRWc9ps \"People with disabilities are the largest minority in the world, and we are the most underrepresented in entertainment.\" @maysoonzayid https://t.co/C0EeluoIke \"My vision for the Me Too Movement is a part of a collective vision to see a world free of sexual violence, and I believe we can build that world. Full stop.” @TaranaBurke #TEDWomen https://t.co/1vjl1YCHr7 Is your country at risk of becoming a dictatorship? Here's how to know: https://t.co/LZiapa7JDM @Farida_N https://t.co/nNerO993xx Can we cure genetic diseases by rewriting DNA? https://t.co/Ehi4PG1zNl @davidrliu The Hindu Kush glaciers are melting. If we don't protect them, the lives of one-fifth of humanity will be in jeopardy: https://t.co/UhYE8p5sQi @tsheringtobgay \"The legacy of two decades of a shared life is larger than the legacy of the affair.\" @EstherPerel https://t.co/wIuyIez9mw How online shaming destroys lives: https://t.co/IyrRO0PttL @jonronson \"We can't build a business that is successful unless we have a diversity of perspective inside of our walls that actually feel these issues every single day.\" @jack https://t.co/dgZr1Wg8tI What we should teach every child about food: https://t.co/S0bwjWq3AY @JamieOliver \"What really matters to us in our lives? What do we value in the communities we live in? What kind of country, what kind of society, do we really want to be?\" @NicolaSturgeon https://t.co/vg9no2z5hh This company is so dedicated to remote working that they literally don't have an office. \n\nHere's why a \"distributed\" workforce is better for business — and employees: https://t.co/Yp3o9Igmai @photomatt How the simple washing machine has changed women's lives around the world: https://t.co/WiigLRyjDe “This is a movement about the far-reaching power of empathy. It’s about the millions and millions of people who, one year ago, raised their hands to say, 'Me too.'” @TaranaBurke https://t.co/p7Ggc9qOnp How we can store digital data in DNA: https://t.co/YDhbje7532 @dinazielinski https://t.co/vRAWhq43Tk In a story of scientific discovery, chemical biologist @davidrliu shares a breakthrough: his lab's development of base editors that can rewrite DNA. https://t.co/5T33A8IAr8 \"Every society is vulnerable to accepting propaganda as truth, and no society where propaganda replaces the truth can be truly free.\" @wangnanfu https://t.co/nLInkmi86i How would you prefer to spend the last years of your life: in a sterile, hospital-like institution or in a village with a supermarket, pub, theater and park within easy walking distance? https://t.co/Thqzmi2VIH Me Too is a movement, not a moment: https://t.co/rJN64qfWEj @TaranaBurke https://t.co/tD40eXYeYf How to end a marriage with grace and respect: https://t.co/2J5UWMwwiY @EstherPerel https://t.co/W6Z2BeAdEc This simple checklist app can help refugees start new lives: https://t.co/xO2sJ7n0LZ “What domestic workers do is fundamental to the very basics of human need and humanity. They are there when we are born into this world; they shape who we become in this world; and they are with us as we prepare to leave this world.” @aijenpoo https://t.co/EKhBnpebnO \"We can live well not in spite of death, but because of it. Let death be what takes us, not lack of imagination.\" https://t.co/DHI65ybJ6T Inside the world’s best nursing home for people with dementia: https://t.co/mewiStW7rv \"Everyone keeps saying climate change is an existential threat, and yet they just carry on like before. I don't understand that, because if the emissions have to stop, then we must stop the emissions. To me that is black or white.\" @GretaThunberg https://t.co/3igoCYfzkb Forget hard drives and the cloud, here’s how we can store computer files in DNA: https://t.co/7TxxlUvFmA \"Repression is a bitter pill that's offered to us all. We're taught to hide so many parts of who we are and what we've been through: our love, our pain, for some, our faith.\" @CaseyGerald https://t.co/8rqJCjp1yN This teenager was diagnosed with Tourette's syndrome at age six, and she struggled for years to find the right treatment. But then she noticed something amazing: whenever she played music, her involuntary tics suddenly went away. https://t.co/G17FqDQadv \"Hate crimes against Muslims in the US increased by 1,600 percent post-9/11, and one in every four women in the US will suffer some form of gender violence.\" @ranabdelhamid https://t.co/Es1EExERb0 Learn how life experiences shape the way our genes are expressed — and what that means for our understanding of gender. https://t.co/4PF0GstFtN \"We should be working with nature, not trying to control it.\" The future of food, with @jamieoliver: https://t.co/WPEaGBBtAV This woman grew up in the Westboro Baptist Church... and then she joined Twitter. https://t.co/xNPVnvY2Tc How do you build your confidence? @MsPackyetti shares meaningful ways to give your confidence a boost in this episode of the @TEDRadioHour. https://t.co/klcPA0bhzh Made just for cats, this cellist's album was inspired by bird chirps, mother cats’ purrs, kittens’ suckling and classic meows. It even includes ultrasound frequencies that only cats can hear. #InternationalCatDay  https://t.co/YmpPs7uAzM This tiny computer can turn any object — like your favorite jacket — into a smart device: https://t.co/nr8Fv0LDFZ This designer wants to integrate technology into everyday objects — like a jacket you can use to answer phone calls or a houseplant you can play like a keyboard. https://t.co/l57JW2fN7C \"We don't realize the constant degree of noise pollution we're exposed to and how much we could profit from more quiet spaces.\" https://t.co/bLEDzi2zAy “The most powerful movements have always been built around what’s possible, not just claiming what is right now. Trauma halts possibility. Movement activates it.” @TaranaBurke #TEDWomen https://t.co/Wh9Zgmchrc What if something was manipulating everything you saw, believed and voted for? \n\nIn this episode of the @TEDRadioHour, 5 TED speakers show you what your favorite technology is doing to you. https://t.co/rgKJV5zNR9 These bricks made out of ashes are helping people rebuild their homes in Gaza: https://t.co/cGsTEVQ7xX \"Vulnerability is our most accurate measurement of courage.\" https://t.co/3I7oA1k2GU \"Positivity is something worth fighting for, and the fight is not with others -- it's internal.\" @leethomastv https://t.co/6OAiELFeJ6 Confessions of a recovering micromanager: https://t.co/CyxF2qv4P4  @Astrochieh https://t.co/Mu4RsmAygm TED Talks to help you imagine a better future and inspire you to take action.  https://t.co/ZevWoO8zYw https://t.co/NMttTFzjEI \"The United States is the most expensive country in the world to give birth. If you do not have insurance, it will cost you 32,000 dollars to have a baby, if everything goes perfectly.\" @WajahatAli https://t.co/BgGn2qVFew \"About 38 percent of abusive tweets are now proactively identified by machine learning algorithms so that people don't actually have to report them.\" @jack https://t.co/vAQi4vUZ8W This is for the students, coworkers and regular people who are often overlooked because we are seen as neither exceptional nor problematic. https://t.co/bI9YvgMULY New season, new goals? We’ve got the perfect talks to help you reach them. https://t.co/83zO9Sxfto https://t.co/io7FKdX5iZ These aren't your usual self-help quick fixes. In this episode of the @TEDRadioHour, 5 TED speakers share meaningful ways to reduce stress, gain confidence, and connect. https://t.co/yI9oNmn00j “We’re big enough to know about these things because these problems are happening where we live. And we have the right to talk about them because it will be our life in the future.”\nhttps://t.co/N5KUhx2D50 This is what happened when @dessadarling worked with a neuroscientist to try to get her brain to fall out of love with her ex: https://t.co/JJi07sufdX \"If you need any more proof I'm neurodivergent, yes, I am calm doing a thing that scares the hell out of most people. I'm almost dead inside up here.\" @Hannahgadsby on stand-up comedy and getting diagnosed with autism https://t.co/RkdHPAFwtN If you want to: \n\n- Get ahead at work \n- Be more hopeful \n- Learn something new \n- Become a better human \n\nWe’ll send you the perfect TED Talks to help you to reach your goals: https://t.co/sjWI0SaZwa https://t.co/UDTdmgYrHr The art of asking for what you want -- even when it's scary: https://t.co/wGB5m4AA6p @amandapalmer \"Diagnosis gave me a framework on which to hang bits of me I could never understand. My misfit suddenly had a fit.\" @Hannahgadsby https://t.co/HgtQk9b8vE https://t.co/wGDOfBnFfs \"Our schools should be places where we respond to our most vulnerable girls. Our ability to see her promise should be at its sharpest when she's at her loudest, or her quietest.\" https://t.co/oJ3UoVBGBe \"I was a chubby-cheeked five-year-old when I joined my family on the picket line for the first time.\" @meganphelps https://t.co/VXog5yp0my \"Severing anger from femininity means we sever girls and women from the emotion that best protects us from injustice. What if instead, we thought about developing emotional competence for boys and girls?\" @schemaly https://t.co/gopBgyUiNC \"Love isn't a neat, symmetrical Valentine's heart. It's bodily, it's systemic, it is a hideous pair of ram's horns buried somewhere deep within your skull.\" @dessadarling https://t.co/5sswnehqzK \"It's just a skin disorder. It's not contagious, it's not life-threatening, it just makes me look a little different.\" @leethomastv https://t.co/3Et3m1oxU2 How I help people understand vitiligo: https://t.co/JeEHD2x3Ry @leethomastv https://t.co/KfeTQdc6Wi RT @leethomastv: Today is the day! Here a link😁 \nhttps://t.co/34QeFB211K\nMy @ted talk went live at 4pm. \nI am nervous 😳and excited 😁at the… The President of Sierra Leone shares his vision for its future: https://t.co/xNVucqeFbf @PresidentBio https://t.co/xTnwERbyvZ \"Finding my use has helped me to break free from being boxed, caged and bottled. Finding my use has helped me to find my voice, my self-worth and my freedom.\" @ashweethashetty https://t.co/y7f1cAVHFM RT @dessadarling: Love, pain, compulsion, unconscious conditioning, and a custom disco ball. The talk I gave in Hong Kong at @TEDxWanChai i… Why fewer people are choosing to be parents — even when they want to have kids: https://t.co/ExYAWDWxcd @WajahatAli Can we choose to fall out of love? https://t.co/5Aakfy7MKS @dessadarling https://t.co/UADWylQ5eX How to overcome apathy and find your power: https://t.co/brigw6SJGK  @DoloresHuerta https://t.co/ca9nkLLOc3 \"The way we're taught to live has got to change. I learned this the hard way.\" @CaseyGerald https://t.co/J5wVUcprM3 \"Just by listening and being kind to somebody, you have the ability to make a difference in their lives.\" @blazinwv https://t.co/DowNK9zOjb How do we find meaning in our work? Author @johannhari101 offers deeply personal advice on navigating some of life's biggest challenges. Listen to #TheTEDInterview on @Castbox_fm or your favorite podcast platform: https://t.co/PjrQY1XbSu https://t.co/tC9Bj6tLkU \"I'm not here to tell you how to live your life, I am simply inviting you to be brave enough to author your own life, to come up with your own definitions, and to think for yourself.\" https://t.co/ghd0OXHbGy How to teach kids to talk about taboo topics: https://t.co/cNpjnJp8kw https://t.co/kk9QdvHvMQ A mother and son’s photographic journey through dementia: https://t.co/zvJvHgV8Db https://t.co/wYP63Z2jUr \"Where do you feel useful to this world? Because the answer to that question is where you will find your voice and your freedom.\" @ashweethashetty https://t.co/0nQDGBQzL8 This is disgustingly cool. Just trust us. https://t.co/PApJ9n0kAn @TomThummer \"It’s always been a dream of mine to have done a TED Talk in the past.” https://t.co/nVM4A8L5zq @waitbutwhy This is what a nursing home based on freedom, meaning and social life looks like: https://t.co/XS1JuP2JGB Learn more about the promises and risks of \"cloud brightening\" — and how it could help restore our climate to health. https://t.co/vr2BTdESFf \"Your life isn't just a list of events. You can edit, interpret and retell your story.\" @EmEsfahaniSmith https://t.co/X14JtjPEuI A new, human approach to treating addiction: https://t.co/5BVk89veVB \"Claim your adulthood. Don't be defined by what you didn't know or didn't do. You're deciding your life right now.\" https://t.co/oJB7WXUddk \"Human beings are works in progress that mistakenly think they're finished.\" https://t.co/2reY4cklzV Embrace the strange magic of your true self: https://t.co/AN9VWDEeXX @CaseyGerald https://t.co/SWwy08MshT \"CEOs have their employees suffer for them. But yet, the CEOs's pay goes up and up and up. And so many people are left behind. I'm here to tell you: no more. It's not right, it's never been right.\" @hamdiulukaya https://t.co/ft5SZJBLOA \"I wrote a comedy show that did not respect the punchline, that line where comedians are expected and trusted to pull their punches and turn them into tickles. I did not stop. I punched through that line into the metaphorical guts of my audience.\" https://t.co/12Oq5VAZ4M In this village, everyone has dementia — and a chance to live their own life: https://t.co/FWTCcLHUvA \"I tend to find the ecstasy hidden in ordinary joys, because I did not expect those joys to be ordinary to me.\" https://t.co/FfRFHQWUG3 \"A core part of addiction is about not being able to bear to be present in your life.\" - @johannhari101 https://t.co/FBSxkvcHqM How climate change affects your mental health: https://t.co/oJ7r9KBbVU @brittwray https://t.co/mlAgTf3hgQ \"In Silicon Valley, the big tech companies fish from essentially the same small pond or bay. A distributed company can fish from the entire ocean.\" @photomatt https://t.co/hZmxCSGVBz Research shows female entrepreneurs get less funding from venture capitalists than their male counterparts. The reason why may have to do with the fact that they're asked different questions. https://t.co/LM8dNKZOWH \"The harmful effects of stress on your health are not inevitable -- how you think can transform stress.\" https://t.co/lsKZuwilS4 “I know some of y’all are tired, because I’m tired. I’m exhausted, and I’m numb. Those who came before us didn’t win every fight, but they didn’t let it kill their vision. It fueled it. So I can’t stop, and I’m asking you not to stop either.” @TaranaBurke https://t.co/9lmb0ZGxHk Scientists are working on a way to screen of the contents of your exhaled breath and detect diseases. https://t.co/6nAsIUklbs The joyful, perplexing world of puzzle hunts: https://t.co/HyUVdwN3Uv @traffiquelite https://t.co/DMhD0ItYOz 10 funny, insightful TED Talks by Hans Rosling: https://t.co/z2ZjvBOBJ2 https://t.co/NUP6C87RS3 It's not true that young people are more creative — but there is one factor that changes as you get older: https://t.co/iLqEdN6dPZ \"Hard choices are precious opportunities for us to become the distinctive people that we are.\" https://t.co/4jYY5LsrOp \"Are we raising kids who don't know how to dream big dreams, whose biggest goal is getting the next A?\" https://t.co/8LsUGnx3a1 As Asian economies and governments continue to gain power, the West needs to find ways to adapt to the new global order, says @mahbubani_k. https://t.co/Rm6r7yh0l3 RT @TEDFellow: Psst... tomorrow is the deadline to apply to become a TED Fellow. If you're doing innovative work and are excited about part… A generous vacation policy allows companies to communicate two messages to employees: “We care about your well-being” and “We trust you to get your work done.” https://t.co/RoXvBopIug 7 steps to successfully persuade a friend to cut down on eating meat: https://t.co/pLb11ipgmT #MeatlessMonday The best way to make people more productive is to give them real time off: https://t.co/8WDGv2k5p4 The work that makes all other work possible: https://t.co/pncO46PGIo @aijenpoo https://t.co/TceQqozGUv \"The gray areas are where you find the complexity, the humanity, and the truth.\" https://t.co/g2LM8eCow1 \"We are one of the loneliest societies that has ever been.\" - @johannhari101 https://t.co/DqmtO04Q8k \"Grief is kind of one of those things, like falling in love or having a baby or watching \"The Wire\" on HBO, where you don't get it until you get it, until you do it.\" @noraborealis https://t.co/DGARo3tA3v How to stop chasing attention and find your creative flow: https://t.co/WSNIW5A52p @hitrecordjoe \"Sooner or later, I think we all wonder: Is this all there is?\" @EmEsfahaniSmith https://t.co/ZvoETJjWIm \"Hard choices are hard because there is no best option.\" https://t.co/WnvLHM57sL How paying attention — instead of seeking attention — can make you more creative: https://t.co/yUXWXUEXkF @hitrecordjoe Why you should search for meaning — not happiness: https://t.co/EBDLHjQNwy @EmEsfahaniSmith https://t.co/iQCqDTToTq Why you want to wash your hands when you're feeling guilty: https://t.co/yH6v2PzgqU “The problem with stereotypes is not that they are untrue, but that they are incomplete. They make one story become the only story.” https://t.co/lsDtqwAIb1 Let's call this bonding 101. https://t.co/jVjlspWXZ6 Why sunscreen is really, super duper, extra important: https://t.co/C9FR1m5niD \"Our control of the outer world is limited, temporary, and often, illusory.\" https://t.co/n2zQR1EuD4 “When we have these conversations with students at a young age, it actually takes away some of that taboo feeling when those topics come up at a later age.” \nhttps://t.co/1t0WaTR1tG \"We humans have extraordinary potential for goodness, but also immense power to do harm.\" https://t.co/Pe2uif1wpk How the simple washing machine has changed women's lives around the world: https://t.co/90XPoZQcd5 \"Hard choices are hard not because of us or our ignorance; they're hard because there is no best option.\" https://t.co/xjOfqZzcpz \"We have to live simply, so that others can simply live.\" https://t.co/0S3tjV4bJ4 \"We have to live simply, so that others can simply live.\" https://t.co/XFtnG21BMH You should give your office's confusing software a second chance. https://t.co/5iULIq7YrG Writer @Andrew_Solomon takes you to the darkest corners of his mind during the years he battled depression: https://t.co/jlHkUigggG Getting people to do what you want them to do requires telling these 3 stories: https://t.co/YWTfcp3NIR Why trust and cooperation are essential to good business: https://t.co/8BnkYYaudT \"Your stress response has a built-in mechanism for stress resilience, and that mechanism is human connection.\" https://t.co/J7PhPRgmd6 How to let kindness guide your choices in life: https://t.co/Q1rc0ZvRTy \"These days, the hunt is on for people's shameful secrets.\" — @jonronson https://t.co/aYRWVUhDip \"Instead of looking for hope, look for action. Then, and only then, hope will come. We can't save the world by playing by the rules, because the rules have to be changed. Everything needs to change, and it has to start today.\" @GretaThunberg https://t.co/JD34KwjHUM Do animals grieve? Do they have language or consciousness? In this episode of the @TEDRadioHour, 5 TED speakers explore what we know about the minds of our friends in the animal kingdom. https://t.co/VAAjGY7daW Need some motivation? Find the talks that will keep you excited to reach your goals. https://t.co/y4pY13ZmpH https://t.co/Pzs0Uxqoue \"You can always find a shock of beauty and meaning in what life you have left.\" https://t.co/Dtz7D1c5vO @zenhospice \"It is profoundly traumatizing to be told by tens of thousands of people that you need to get out.\" — @jonronson https://t.co/wGocvv0rqY Desperate to quit your job? Read this first. https://t.co/bCD8S8TD6M @SimonSinek https://t.co/KjGbJDMeqy Ping pong and the riddle of victory: https://t.co/CyCllP3U2U @PicoIyer \"The victim of an affair is not always the victim of the marriage.\" — @EstherPerel https://t.co/y3ngcqgjF2 \"Anger is a human emotion, neither good nor bad. It is actually a signal emotion. It warns us of indignity, threat, insult and harm.\"  https://t.co/LYiF75uuTA @schemaly \"I believe fundamentally that public conversation is critical.\" @jack https://t.co/NdFU8ML9jK It's normal to be at a loss for words when you're asked to speak at a memorial or a funeral. Here are some basic guidelines to get you started: https://t.co/nHxBfsMwla We would like to salute the weirdos who thought it would be a good idea to stick a camera down a beatboxer's throat and just see what happens. https://t.co/8rh8C7Ocfh Why work doesn't happen at work: https://t.co/H99Ep45yvU @jasonfried https://t.co/HDBbYZwLqB Smart ways to build yourself up: https://t.co/okMMEUNRgM \"For this disaster, we need to redefine our job as a first responder. We need to be more than just the cavalry. We need to do more than just save a life. We need to find ways to rebuild that life.\" @blazinwv https://t.co/5y53BZkHJa \"When a leader makes the choice to put others first, remarkable things happen.\" https://t.co/fGRcaDsZ6R How to give a powerful eulogy: https://t.co/EQ39y17Loj https://t.co/xXtRJLqYdw Imagine what you could have if you asked for what you want:  https://t.co/BOLfvDN3DN \"Getting access to the right resources and information can be the difference between life and death.\" https://t.co/7tz4we2Kbt The power to think ahead in a reckless age: https://t.co/V5axMAszeF @binajv \"Chasing meaning is better for your health than trying to avoid discomfort.\" https://t.co/4nByO1UyAh Is women's sexuality actually more complicated than men's? No. https://t.co/rJ6E0ji5Wb \"Leadership is a choice; it is not a rank.\" https://t.co/eB0eEXT5ql A librarian's case against overdue book fines: https://t.co/SVsTIwTMDh https://t.co/L2IjrHfT0J Learn how we create our own happiness in this fascinating, classic talk: https://t.co/alSjUcH0y2 What really matters at the end of life: https://t.co/4sjqqeOuzU @zenhospice https://t.co/LpNYJcBsKo \"Stories matter. Stories can break the dignity of a people, but stories can also repair that broken dignity.\" https://t.co/U6DW0SaMaX “You’re imperfect, and you’re wired for struggle, but you are worthy of love and belonging.” https://t.co/acn6WMMr13 Family, hope and resilience on the migrant trail: https://t.co/87AOtyoL97 @JonLowenstein \"The one constant in our life is change.\" https://t.co/EvJ4kmyU5S \"Connection is why we're here. It's what gives purpose and meaning to our lives.\" https://t.co/p75e7JzfaD How great leaders inspire action: https://t.co/vqc1aoY4Ks @simonsinek Why you should treat the tech you use at work like a colleague: https://t.co/PEnllJnbTJ https://t.co/hadB4Yy2R4 \"The person you are right now is as transient, as fleeting and as temporary as all the people you've ever been.\" https://t.co/FXjQSnlxHY Success is a continuous journey, not a one way street: https://t.co/wVQvH2tJmF How to find the person who can help you get ahead at work: https://t.co/6bpDO7gljl @carlaannharris https://t.co/79siBtJEt2 Shah Rukh Khan: What fame has taught me about humanity. https://t.co/Z4zjEfRKlm @iamsrk https://t.co/1tcEkQA1oC 8 ways to become a more resilient person: https://t.co/n8cyIrR3go @drmegjay https://t.co/tlIwQ1zNzr Here's how paying attention — instead of seeking attention —  can make you happier and more creative. \n\nWatch @hitrecordjoe's full TED Talk here: https://t.co/1GUQIFu59W https://t.co/RxTlp3x1RU This talk will completely change the way you think about stress: https://t.co/8vnvCVxv0a Get a realtime look at how beatboxers make such wild sounds:  https://t.co/Cff4pZ8SMP \"Being resilient means you face stressors, not eliminate them. To be resilient means you learn from your mistakes, not avoid making them.\" https://t.co/eSWe4qvSmB Great advice for all the 20-somethings in your life: https://t.co/Yzqg6G3uul How craving attention makes you less creative: https://t.co/Iy1xWrFkeK @hitrecordjoe https://t.co/J1fQa1fSIS \"If men knew how often women were filled with white hot rage when we cried, they would be staggered.\" @schemaly https://t.co/iryX2R2G2U Whether you're starting a new business or just having a conversation, learn how to spot the kinds of questions you're being asked -- and how to respond more effectively. https://t.co/ZaZ4qkRYPC \"Forging meaning can give you the vocabulary you need to fight for your ultimate freedom.\" https://t.co/qqtMTvEDKV This one speaks for itself. https://t.co/fiYKHSG9oZ 3 ways to build a better, less selfish society: https://t.co/TA6DcOEbnq \"There is no greater joy than working together.\" https://t.co/OlYywILuQu \"Forging meaning can give you the vocabulary you need to fight for your ultimate freedom.\" https://t.co/g789PkKbH9 \"In order for connection to happen, we have to allow ourselves to be seen, really seen.\" https://t.co/2WPWnksdKl \"Gender colors the way we experience the world. But we can change that.\" https://t.co/Dsk9ifzFAA Yes, you can have a successful divorce. Here's how: https://t.co/UyQKsNQvxQ @EstherPerel \"How powerful would our world be if we had kids who were not afraid to take risks, not afraid to think?\" https://t.co/ejr5Ca2f2E Replace the brain cells you fried sitting too close to the TV because you didn't listen to your mother: https://t.co/MCUgmHsd0g When do kids start to care about other people's opinions? https://t.co/qSNrbquSiX https://t.co/QMKVYU06w4 \"Our brains evolved for a very different world.\" Why we make bad decisions: https://t.co/B960bFC1N3 The most mysterious star in the universe: https://t.co/hR6GwHfAKa https://t.co/fMXtDerAfl \"There are mountains of sorrow that cannot move, and one way or another, we will all kneel there.\" https://t.co/37KW1Gnnw0 @zenhospice \"We teach boys to be afraid of weakness, of vulnerability. We teach them to mask their true selves.\" https://t.co/9kEOQ6waV4 Feeling beaten up? Here's how to become a more resilient person: https://t.co/jBI7ggV4y6 @drmegjay \"We need sustainable harmony, not sustainable growth.\" https://t.co/A87Gi68Roi Roughly 40 million Americans are looking for love on the Internet. https://t.co/OJEPMZQvFE We all need this talk right now. https://t.co/3BPjnXYogd \"There was a library in San Francisco that did an amnesty day last year, and they welcomed back 5,000 users who had been blocked. That same day, they received more than 700,000 items that were overdue. Among them was one book that was 100 years overdue.\" https://t.co/5ZDfwB18z0 Gender and biological sex are much more complicated than x and y chromosomes. This new field of science is finding interesting answers: https://t.co/Uy3yAVslYd \"Where did we come from? How did the universe come into being? Are we alone in the universe? What is the future of the human race?\"\n\nStephen Hawking on some of the biggest questions of our time: https://t.co/W0RmKXNgY7 .@BreneBrown's advice on how to feel like you truly belong: https://t.co/CvjgNdR0Ss https://t.co/Hdgky50wly 3 important lessons on how to build a long, happy life: https://t.co/cs99lGqnBZ Love yourself. https://t.co/VkRhsdq3Ns \"Dependents want to feel a part of something, anything. Make the time meaningful. Life, it's about wanting to live and not waiting to die.\" https://t.co/r6JwkiKJ7g How to stay calm when you know you'll be stressed:  https://t.co/3yIhrH3XJj @danlevitin https://t.co/ayCKBcIH42 We don't \"move on\" from grief. We move forward with it: https://t.co/v1tJ9AdTBC @noraborealis https://t.co/jikOsLFHZ3 We don't \"move on\" from grief. We move forward with it: https://t.co/0UTLBWNcTy @noraborealis https://t.co/D54xVtPXWh The two mistakes we all make when we try to make a decision: https://t.co/4KQ3eRms96 \"The future you has to be a you that loves. Otherwise it will cease to flourish.\" @iamsrk https://t.co/D4acPEpcPD This is why some people are more resilient than others: https://t.co/Gx7Ln7ApUx How to turn shame into strength: https://t.co/Oujnp32E8H What to do when you face a really tough decision: https://t.co/3xIvJQ6Rbp What you need to know about power so no one can take advantage of you: https://t.co/d2ZlZx5RUK \"You can lead a good, ethical life, but some bad phraseology in a tweet can overwhelm it all.\" https://t.co/34vlVg4yzG @jonronson \"Grief doesn't happen in this vacuum, it happens alongside of and mixed in with all of these other emotions.\" @noraborealis https://t.co/g2fAPbJ4DS \"Kids don't learn from people they don't like.\" https://t.co/UoN2TmMsVn Let us debunk some age-old myths about women’s sexuality! https://t.co/7hbTwZiI5n What you need to know about power so no one can take advantage of you: https://t.co/4BqsCpymbn Good news! There is hope for the bees. Really. https://t.co/OOWS2ajLjz If you need help learning how to back off at work, start here. https://t.co/0B5uKDeOsp Disappointed with democracy? Try automating politicians. https://t.co/GoueY6U3bE \"Getting over heartbreak is not a journey. It's a fight, and your reason is your strongest weapon.\" @GuyWinch https://t.co/cOG3LghMsE \"Monogamy used to be one person for life. Today, monogamy is one person at a time.\" https://t.co/zM5uHl3LLg \"Every child deserves a champion, an adult who will never give up on them.\" https://t.co/9UT6TuMjwJ This is what truly leads someone to change their worldview. https://t.co/FbBt6hFUoa A pastor who helps people write eulogies offers the following guidelines: https://t.co/ciYEfhoI31 Can you pass the ignorance test? See what you really know about the world: https://t.co/UqWeX2c44K How to cure micromanagement at work: https://t.co/95ZbRBG0JQ Can you pass the ignorance test? See what you really know about the world: https://t.co/Ww9SQW8FLA This is one of those TED Talks that you need to see to believe. https://t.co/uXMZGdbQxT “Teaching kids about equity in schools is not teaching them what to think. It is about giving them the tools and strategies and language and opportunities to practice how to think.” https://t.co/EwzfhH7Gc4 How do you make a decision when both options seem equal? These tips will help you make the tough calls. https://t.co/kMfY9FZ57D \"We have to be willing to fail, to be wrong, to start over again with lessons learned.\" https://t.co/RznlZRAesM \"Leaders hold a position of power or authority, but those who lead inspire us.\" https://t.co/fhPsUQAeoC 3 ways to recover from rejection: https://t.co/Wmcz3auSGR 10 things you didn't know about orgasm: https://t.co/ItCo4UeoBW @mary_roach \"If you ask people where they go to get something done, you almost never hear them say the office.\" https://t.co/xxgjEl3zxw How to recover when you feel rejected or lonely: https://t.co/bQNeTfUsgW If you want to be good at something, tell yourself this: https://t.co/bjmDk4bZEP Meritocracy is a myth. This is the real key to getting ahead at work: https://t.co/pLj3Ppg8cY 3 bits of advice that every twenty-something needs to hear: https://t.co/jqXzMVFnQ8 \"We have within us the capacity to manufacture the happiness we are constantly chasing.\" https://t.co/I5VVB51J2F What your breath could reveal about your health: https://t.co/SSqCDUJbMy https://t.co/vIo2RtOOAf Why do happy couples cheat? https://t.co/H9xzcbKDGY Why hearing \"you're not there yet\" is more helpful than hearing you failed: https://t.co/ijwCc7M34Y What is happiness, and how can we all get some? https://t.co/h1j8PeR0Qa \"Talent and intelligence are equally distributed throughout the world. But opportunity is not.\" @photomatt https://t.co/Bqe3jeoBWs 10 funny, insightful TED Talks by Hans Rosling: https://t.co/KnrWgT5UvR https://t.co/ND3e0zEBOQ Why hearing \"you're not there yet\" is more helpful than hearing you failed: https://t.co/CIGEYBOVHb It's time to stop spending your days complaining, says leadership expert @simonsinek. https://t.co/YQvyxaO8jE \"We do a great disservice to boys on how we raise them; we stifle the humanity of boys.\" https://t.co/dzLGV95EeX Stuck between two options? Here's how to weigh them. https://t.co/7kLogyz9aw Watch the late Stan Lee's TED Talk about how to create your own superheroes: https://t.co/2zq719pbmt For everyone who waits until the last minute to get things done: https://t.co/G2MtqZjUW8 \"If you hire people who believe what you believe, they'll work for you with blood and sweat and tears.\" https://t.co/5FLLqkYXpS \"What is altruism? It's the wish that others may be happy and find a cause of happiness.\" https://t.co/4Y7YRoVVYL \"A human being can never be broken. Technology is broken. Technology is inadequate.\" https://t.co/1UxxUIz2S1 \"I learned that I did not have to trade part of my body to get an education. I had a right.\" https://t.co/ZRcuKEknzc A funny, provocative talk on why we're often afraid to pursue what we really want: https://t.co/86fykmhj0W \"Female sexuality can't be fixed with a pill. That's because it's not broken: it's misunderstood.\" https://t.co/oteRWAJmoz You only wish you could procrastinate as well as this guy. https://t.co/4FA8aTVNDD \"Dictators feed on propaganda. They like giving the impression that they are the saviors, and without them, the country will fall apart. And they are always fighting some foreign forces.\" @Farida_N https://t.co/vqYn0ILMKK \"The best time to work on your marriage is before you have one.\" https://t.co/DHqzDWF3dD \"Affairs are an act of betrayal. They are also an expression of longing and loss.\" https://t.co/aQdQLYSFQg Do you procrastinate often? Blame your office: https://t.co/UibTd34ddM \"Passion is your greatest love. Passion will help you create the highest expression of your talent.\" https://t.co/zHJJrdqYtW \"Does a Snapchat with a stranger count as cheating in the same way as the old-fashioned romp in a motel room?\" https://t.co/5tM5hj7rLL Some libraries are getting rid of late fees and the impact is amazing. https://t.co/Lo1k8Nz1nQ This master procrastinator is the king of Internet rabbit holes. https://t.co/NixgNcJZ8D How to make stress your friend: https://t.co/lAEM5qNhZO Just get your heart broken? Don't idealize your ex. https://t.co/EE8m9waCYI Great advice for avoiding conflict if politics comes up at the dinner table. @julia_dhar https://t.co/SLdlKlz3MJ \"It's a pretty terrible situation when you're coming to a service that, ideally, you want to learn something about the world, and you spend the majority of your time reporting abuse, receiving abuse, receiving harassment.\" @jack https://t.co/MykGce4W3n \"Our minds and our feelings are not the trustworthy friends we thought they were.\" https://t.co/4uKDrlau5B From curating social media feeds to getting into the perfect college, our obsession with perfectionism is getting worse. Here’s how it hurts our health: https://t.co/dLmg7BExTo \"What if there are things that even a good relationship can never provide?\" https://t.co/Nk9EQ3OovJ One key characteristic could predict success: \nhttps://t.co/vSyPmCf1y7 Just a weird star … or signs of an alien civilization? https://t.co/dYpXocgHSM 10 things to consider before you walk out in the middle of a meeting. https://t.co/Ak4YJJhLyT \"Leaders will choose to sacrifice so their people may gain.\" https://t.co/kQTQsxDRFE Tips on how to let creativity flourish, from a reformed micromanager: https://t.co/WOrcMI4ArX \"The very ingredients that nurture love are sometimes the very ingredients that stifle desire.\" https://t.co/Q2k2RqugfG \"It’s not that I ignore when I’m feeling badly. I accept it, I let it in so that I can acknowledge it, and I do what I need to do to move past it.\" https://t.co/MKokQpZsek 3 tips for dealing with loneliness: https://t.co/WJAZVCzqAl This is where middle managers are learning bad habits — and how to change that: https://t.co/IqtPAdaRrY Weird facts about orgasm, from obscure scientific research:  https://t.co/Nt8VzOJNvq 1 out of every 100 people is a psychopath. This is the test. https://t.co/VAycjxWFac What makes a great leader? A recommended reading list: https://t.co/2Y9x2FslFN A sponsor will champion your hard work. Here's how to find one: https://t.co/oLYDRfrFOd What makes a good life? Lessons from the longest study on happiness: https://t.co/7iRwZCXqz1 Why storytelling is the ultimate weapon of the powerful: https://t.co/pFuiOABa7w 4 tips for talking to people you disagree with: https://t.co/OueDHLJo5B https://t.co/VqhXazNKbx This is where bad managers learn such terrible habits: https://t.co/7wMMeQ94Cv \"Four hours of uninterrupted time is the best gift you can give anybody at work.\" https://t.co/ptZWmBBeOb These are the long-term benefits of regular exercise for your brain: https://t.co/kxs6rH4Jzi @wasuzuki Traffic, construction, your neighbor’s lawnmower and other loud noises can have a surprising impact on your health. Here’s how to get a little more quiet in your life: https://t.co/MFLHSLwJaE \"Black girls are routinely seen as too loud, too aggressive, too angry, too visible. Qualities that are often measured in relation to nonblack girls and which don't take into consideration what's going on in this girl's life or her cultural norms.\" https://t.co/NxmukNRR4w \"You cannot selectively numb emotion. You can't numb hard feelings without numbing joy, gratitude, happiness.\" https://t.co/2NgBKifPN7 \"Stress gives us access to our hearts.\" The surprising benefits of stress: https://t.co/XGrAOIXqMq If your career truly sparked your passion and used your talent fully, what would you be doing? https://t.co/dC9JtYuAw9 Easy ways to grow new brain cells -- even as an adult: https://t.co/Dtf0XPMx7B You can grow new brain cells. Here's how: https://t.co/ruJlK69wbH https://t.co/s8j84ias7A Want to be healthier? Start by seeking out a quieter life. https://t.co/pydUYHexa9 Learn how to argue — and disagree politely — from a debate champion: https://t.co/m5ufjql1ru This is how habits form — and how to break them: https://t.co/yFQw27FSn2 This personality trait is a major predictor of success: https://t.co/buPEoXQPXB \"We can't practice compassion with other people if we can't treat ourselves kindly.\" https://t.co/GEBK4dvAvy Why talent often has little to do with success: https://t.co/vW2qHVPdZ1 How to (actually) enjoy learning a new language: https://t.co/uulxKPrbD6 The brain science behind why teenagers make questionable life decisions: https://t.co/DYYbWFeB9d \"A grieving person is going to laugh again and smile again. If they're lucky, they'll even find love again. Yes, absolutely, they're going to move forward. But that doesn't mean that they've moved on.\" @noraborealis https://t.co/BWmRJHGJAi Polyglots are people who speak several languages fluently. Learn their clever advice for picking up new tongues quickly: https://t.co/ZNZCtDeXB8 3 tips on how to argue — and find common ground — from a debate champion: https://t.co/PowoQP2EgW Alexis Jones spent years in college locker rooms talking to young men about their relationships with women. Here's what she learned: https://t.co/LndxXH2oPo It's National Bring TED to Work Day — a holiday we just made up, but a great opportunity to listen to these TED Talks on your commute! https://t.co/8kXJJJTZau 7 of your burning questions about workplace romance, answered. https://t.co/jFLthFLMaz This is what you're actually inhaling when you vape.\n\n(Hint: It's not water vapor.)\nhttps://t.co/eMoOg0rFll 4 TED Talks for cat lovers: https://t.co/Rp88olegvj #InternationalCatDay https://t.co/KvOIMy6Pfi This is why your cat is such a weirdo. #InternationalCatDay  https://t.co/HtHAWKCDsN Happy August! If you're heading to the beach, let us be the millionth person to remind you why sunscreen is important. https://t.co/Z6xjEwozL0 Even a toothbrush can reveal a world of inequalities. https://t.co/FUxljQvjO6 On the road again? https://t.co/oVXe2aJ6vL The science behind when in life you will succeed or fail: https://t.co/jw72OoVONQ @barabasi Drown out your backseat drivers with these TED Talks. https://t.co/NBD6qq98mM Another day, another commute? Here are some great TED Talks to take with you: https://t.co/qZdQS7yh2F For your next vacation, try going nowhere. https://t.co/FMf6d70g4b Thinking about an immoral act quite literally leaves a bad taste in your mouth. https://t.co/vRVoNKUO4G If your commute is 10 minutes or 2 hours, these TED Talks will get you through it: https://t.co/IkqefPD8GA Your mom called! She says, \"Wear sunscreen.\" https://t.co/1uha9GCIWY The real relationship between your age and success: https://t.co/S6RYP8rhzd @barabasi @Adweek We're hosting a potluck in the teachers' lounge. A pastor who helps people write eulogies offers the following guidelines: https://t.co/0eJym1QNVt Should workplace couples keep their relationships secret? And why are coworkers so often attracted to each other? We asked an expert. https://t.co/9l83EyAmPC 100 solutions to climate change:\nhttps://t.co/23Xx1HERfN  @ChadFrischmann This documentary filmmaker is sharing the untold stories of China’s one-child policy: https://t.co/H8lSSLfLYg @wangnanfu \"Nobody invented dance. It is deep in the heart of every culture throughout history; dance is part of the pulse of humanity.\" @SirKenRobinson https://t.co/bAStANc5UX \"With every click, we make a choice. The more we saturate our culture with public shaming, the more accepted it is.\" @MonicaLewinsky https://t.co/QNyURWJ3VU \"Imagine walking a mile in someone else's headline.\" \n\n@MonicaLewinsky on the price of shame: https://t.co/ACA74Qzz40 RT @BBCRadio4: In this very moving interview, @MonicaLewinsky reveals the very personal price to public humiliation and explores how we can… \"Anyone who is suffering from shame and public humiliation needs to know one thing: You can survive it.\" — Monica Lewinsky https://t.co/woI57hKtIj A groundbreaking expedition to the bottom of all five of the world’s oceans: https://t.co/BdxxABYuuc @FiveDeeps \"We reward confidence in some people and we punish confidence in others... For some of us, confidence is a revolutionary choice.\" @MsPackyetti https://t.co/CStUYnpYKi Scientists use CRISPR to edit genes... but what does that actually mean? Here’s how it works: https://t.co/GpPbp03bvy RT @TED_ED: In honor of one of our favorite authors, Toni Morrison, a reminder to us all: https://t.co/SeXJbED7Iq \"For all the talk about how we’re disappearing into our isolated technologies, we still are living in a culture that expects us to be on a remarkable percentage of the time, often with people who we don’t know that well or have never even met before.\" https://t.co/MmWr98Turm How do we heal in challenging times? Author @johannhari101 offers a deeply personal and uplifting perspective on the search for hope and meaning. \n\nListen to #TheTEDInterview on @Spotify or your favorite podcast platform: https://t.co/GocDLM08eO https://t.co/cJ6bHqtaqL This woman's job is to imagine the consequences of new inventions: https://t.co/a669sFqN1B @anabjain To transform society, we should place wellbeing at its heart: https://t.co/p1itIKZZ6I @NicolaSturgeon This simple checklist app can help refugees start new lives: https://t.co/vYHFuyofUB \"I learned a lot of big words when I was 16 getting ready for the SAT, but none of them come to me now. In the police car, the only thing that really speaks is my skin.\" @bamuthi https://t.co/x28FfsKTL7 \"I smell like the last gasp before my own death. I think how long the boy will wait before he realizes that daddy is not on his way. I think his last barely formed memory of me will be the story of how I never came for him.\" @bamuthi https://t.co/nbaFfTVu7N From envy to lust, the 7 deadly sins are ingrained in human behavior. In this episode of the @TEDRadioHour, 7 TED speakers explore why humans love to sin. https://t.co/EuI0cgzrcd Implantable defibrillators save lives, but they come with a terrible price — painful electric shocks. For patients, the question remains: What are you willing to give up to live a little longer? https://t.co/6205UZOO0S A powerful look at what we should learn from #BBQBecky, #PermitPatty, and other viral stories of white people calling the police on black people for just living their lives: https://t.co/jsOAxMCdEV @baratunde #LivingWhileBlack This is what would happen if we let the Hindu Kush glaciers continue to melt: https://t.co/rtpRZU6KJa @tsheringtobgay This simple invention to prevent stampedes could save thousands of lives. Here's how it works: https://t.co/35k5E1LcMI @1geek0 \"Dance can help restore joy and stability in troubled lives and ease the tensions in schools that are disrupted by violence and bullying.\" @SirKenRobinson https://t.co/Y23vzjpLwL These 6 pioneering women helped create modern computers: https://t.co/cKKiCK7MsE This is the important connection between politics and parenting. \n\nWatch @hajershareif's full TED Talk here: https://t.co/6MAurpHQq4 https://t.co/H59BjjPKdR What's on the bottom of the ocean — and how we're getting there: https://t.co/aVgaqPYBHK @FiveDeeps https://t.co/VjvPZkfhoa How parents can run a democratic family — and raise smart kids who care about politics: https://t.co/DhLE79eqk3 @hajershareif \"For the past three decades, everyone in my family had to apply for permission from the government to have a child.\" @wangnanfu https://t.co/7V1nD0r4fj Early education is critical to children's success — but millions of kids in the United States still don't have access to programs that prepare them to thrive in kindergarten. \n\nEnter the UPSTART Project: https://t.co/QqkHvaAXIt @WaterfordOrg RT @CBSThisMorning: Is there anything wrong with being average? In her popular @TEDTalks, educator and CEO of @Oliver_Scholars @DrDanielleM… \"Confidence is the difference between being inspired and actually getting started, between trying and doing until it's done. Confidence helps us keep going even when we failed.\" @MsPackyetti https://t.co/D7aR8xAEw9 \"Life is not linear; it's organic. We create our lives symbiotically as we explore our talents.\" https://t.co/AQAiGDOjxd The case for a decentralized internet: https://t.co/J9y9njQiAz  @hellozeronet https://t.co/AastlxW2Wp Watch the first TED Talk by a digital human: https://t.co/Td6FKgGzf4 You don't have to pretend to know what quantum computers are anymore: https://t.co/nUoC93roEa For when you've deleted every social media app on your phone but it's still not enough. https://t.co/ESTE9kH7oR \"There is emotional damage done when young people can't be themselves.\" @DenaSimmons https://t.co/b8iIjWgHxB Your exact Venmo payments might be making you look petty: https://t.co/gZ9wH3XAHz How to teach kids to talk about taboo topics: https://t.co/kRk3Z5DybF https://t.co/dnnrQPHT44 When technology can read minds, how will we protect our privacy? https://t.co/rvyPzIm7xR @NitaFarahany https://t.co/jUVkLOeylS Why teachers should see \"at-risk\" students as \"at-promise\" kids: https://t.co/q0Z3ZC5Pqe @drvictorrios Brainstorming doesn't have to suck. Here's how @TheOnion's writers' room helps people be creative: https://t.co/xgpfTHSKVy \"Confidence is the necessary spark before everything that follows.\" @MsPackyetti https://t.co/xlL058knaS How to show up as your most confident self: https://t.co/pmhJ02SQEA @MsPackyetti https://t.co/VcskV0OJsL 3 questions this CEO uses to weed out jerks: https://t.co/D9TjibuzqH How we'll earn money in a future without jobs:  https://t.co/PJHCjS9hHq @MFordFuture https://t.co/xTO59QNVyF This engineer built her own physical version of Flappy Bird: https://t.co/Ad7I6HVTgf \"Instead of looking for hope, look for action. Then, and only then, hope will come. We can't save the world by playing by the rules, because the rules have to be changed. Everything needs to change, and it has to start today.\" @GretaThunberg https://t.co/Rna5n44ThI For these women, reading is an act of daring: https://t.co/ukCSJL1vgF https://t.co/ehP8PHvytN This is one of those tech demos you have to see to believe. https://t.co/6mDkTr4GDf The fundamental right to seek asylum: https://t.co/kQw9PCYePY https://t.co/MAhCPYxUij CRISPR, explained: https://t.co/W5mKCTJU3o Here's the deal with that \"alien spaceship.\"\nhttps://t.co/cDd1ROkdS6 \"GDP measures the output of all of our work, but it says nothing about the nature of that work, about whether that work is worthwhile or fulfilling.\" @NicolaSturgeon https://t.co/ic8LYiTjmm There is not just one sex talk parents need to have with their kids. https://t.co/sKbIy8UmYf How tech companies deceive you into giving up your data and privacy: https://t.co/6s3I3xzUtk @finnmyrstad https://t.co/LEVAvoZJUh This is the important connection between politics and parenting: https://t.co/5cyN8oBzTM @hajershareif This scientist accidentally coded bias into her computer. Here's what she learned: https://t.co/wBORBIWple \"Language is the most beautiful of human creations. It's the loveliest thing that our brains have invented.\" @ajitq https://t.co/92TTVAnq7t Here's why you should have a candid family meeting where everyone can express their opinions, negotiate and compromise on how the household is run: https://t.co/U13RtGhGR4 @hajershareif Good news! There is hope for the bees. Really. https://t.co/aQ6ve2UEcW Four tricky ways that fake news can fool you: https://t.co/bED6I7kuKp https://t.co/vOt6mmk2TJ .@callisto could revolutionize how we report sexual assault. Here's how it works: https://t.co/woEvAEQsRO @JessicaHLadd \"Do you feel trapped in a broken economic model that excludes billions of people while making a handful unimaginably rich? That sorts us into winners and losers, and then blames the losers for their misfortune? Welcome to neoliberalism.\" https://t.co/EAPSKnjE1U Watch @bamuthi's breathtaking jazz-inflected spoken-word performance \"You Have the Rite\": https://t.co/sRQav9M7zN https://t.co/d0gwCXGqZw These TED Talks are perfect for kiddos excited about science and technology: https://t.co/SxghuCv3oI Would you pay for Facebook if it meant having full control of your data? https://t.co/wFdk0e5QEM 4 key pieces of feedback that children wish they could give their parents: https://t.co/5qTidPCvoa Simple ways to raise kids who are creative, confident, and in control of the world around them: https://t.co/9CF7lAAulB \"What is the point of locking a house with a key if anyone can enter it through a connected device?\" https://t.co/T8IM8qVc02 \"We are a society of altruists, but we are governed by psychopaths.\" https://t.co/ISWcnn00x9 The human skills we need in an unpredictable world: https://t.co/A7m39E3SFL @M_Heffernan https://t.co/1365tRrPMR These are the unpredictable, messy human skills you should work on cultivating: https://t.co/0vTNwlao43 @M_Heffernan https://t.co/KVVvbSM4Q0 5 TED Talks every new graduate should watch: https://t.co/jMjjy79Dun Why even morally upstanding people choose corruption: https://t.co/6i5nZPMKOD Let us validate your hatred of treadmills with facts. https://t.co/iZQvb8wc5q How to encourage kids to think critically from an early age: https://t.co/8UhY8ubYGK A clever, easy way to turn family chaos into peace and calm: https://t.co/o58IW9m9Dk Do you ever order clothes online in different sizes and colors just to try them on and then send back what doesn't work? Yeah, maybe stop doing that. https://t.co/o6q0iF5Wyz Want to fight terrorism? Don't buy knock-off purses and watches. https://t.co/QhLatXdNYd \"Everyone keeps saying climate change is an existential threat, and yet they just carry on like before. I don't understand that, because if the emissions have to stop, then we must stop the emissions. To me that is black or white.\" @GretaThunberg https://t.co/kM13va43TY San Diego recently announced plans to produce 35 percent of its water from recycled sewage by 2030 — not just for irrigation but for drinking. https://t.co/RthjrG1QRf Why you should stop telling people that they're the \"best\": https://t.co/UersldfDwq @shawnachor The Orange County Sanitation District facility pumps out 100 million gallons of drinking water each day. The sewage moves through eight stages of filtration before it is drinkable. https://t.co/mD5qIxYQEe RT @dabeard: We should measure how happy and healthy a country is, not merely how wealthy it is —@NicolaSturgeon at @TEDTalks https://t.co/… Our planet is getting hotter and drier, and drinking water is in short supply. \n\nGet a taste of what might be in store for your thirst: https://t.co/u13Ip5JNaH Would you drink desalinated seawater? What about recycled sewage water? https://t.co/DtvYVsxfsa Charles Darwin was fascinated by laughter. Here's why: https://t.co/sYTVvC9Qkf If you want deeper, more meaningful connections with others, this is how to make that happen. https://t.co/FHOy68o6O5 What it was like to grow up under China's one-child policy: https://t.co/KivaUTsjA9 @wangnanfu https://t.co/FWMh27YOCw A well-placed guffaw is the key to developing social bonds: https://t.co/rZGj6asAtM “We think we have to be successful, then we’ll be happier. But our brains work in the opposite order.\" https://t.co/WcivwjYNyu This is how to make friends as an adult. https://t.co/57M5jvQ4Oj This is how habits form — and how to break them: https://t.co/TwD8rW6wYL \"If you raise your level of positivity, then your brain performs significantly better. Your intelligence rises, your creativity rises, your energy levels rise.\" https://t.co/hgttVS7Cu9 These rural women in India were denied savings accounts because they couldn't read and write. Now the bank they started has $20 million in capital. https://t.co/x0HI416N2s A trans man in the South argues for his right to keep his history private and pushes against the idea that he must be \"out\" to be authentic and proud. \n\nListen to #SincerelyX on @hearluminary: https://t.co/F2kyKaJyuS https://t.co/kHWn4gI97X How to use laughter to de-escalate tense situations: https://t.co/h9cFV6GBrH \"Policewomen are met with the same rates of force as their male counterparts, sometimes more, and yet they're more successful in defusing violent or aggressive behavior overall.\" @PD_PhD https://t.co/Ept6Hmq9Pv Less than 13 percent of police officers in the United States are women — despite their proven effectiveness in diffusing violent situations and reducing the use of force: https://t.co/ZaAbHoK3yv @PD_PhD https://t.co/PdNWeDuKIi RT @PD_PhD: I am a 2019 @TEDFellow; Please let me know your thoughts on my talk.  Less than 13% of police officers in the U.S. are women --… Why First Minister of Scotland @NicolaSturgeon thinks GDP is the wrong measure of a country's success: https://t.co/HOem1mjoUt \"Despair is the state we fall into when our imagination fails.\" https://t.co/ThT65wAtFh \"Studies show that the extroverted leaders, the charismatic ones, tend to get paid more, but they’re not necessarily delivering better results.\" https://t.co/Oni90GEQQA 8 TED Talks about how to invest in making the world a better place: https://t.co/j1SW9tN3e6 Getting rid of open-plan offices isn't only about making introverts more comfortable — it will help employees focus and build trust: https://t.co/NPVOsd2vX4 \"When you have people in open offices, they’re less productive, they have trouble focusing, and ironically, they have more trouble forming close connections.\" https://t.co/9aY4BwVjPn You use your brain's executive function every day — it's how you do things like pay attention, plan ahead and control impulses. Here's how to make it stronger: https://t.co/bgXJMDbbW1 \"People assume that if you’re introverted, you wouldn’t be competitive or ambitious, and that’s not necessarily so. It just shows up differently.\" https://t.co/gl4IvXpLHE What’s the difference between shyness and introversion?\n\n@susancain answers some frequently asked questions about introversion: https://t.co/YberoncTCT Executive function is our ability to consciously control our thoughts, emotions and actions in order to achieve goals — like learning how to drive. https://t.co/ouPEXY2IAD Use this inside look at your brain to break bad habits and achieve your goals: https://t.co/b0BlRictQQ Learn something new without your brain breaking a sweat: https://t.co/bQZlVSorP1 \"GDP measures the output of all of our work, but it says nothing about the nature of that work, about whether that work is worthwhile or fulfilling.\" @NicolaSturgeon https://t.co/We0hkVe3ta RT @TEDchris: We rarely have politicians on the TED stage. But @NicolaSturgeon won over the audience at #TEDSummit last week. And she won u… Why governments should prioritize well-being: https://t.co/IPTSshMgR1 @NicolaSturgeon https://t.co/KzRv5MIFH2 RT @amandapalmer: sorry to inundate you with @TEDTalks but i just sat through 45 of them in a row, so, not sorry. anyway....THIS ONE!!! THI… @DanTGilbert @iain_00 @NicolaSturgeon Yes, it's just gone online! https://t.co/yQpRAOHwqV \"Confidence is the necessary spark before everything that follows.\" @MsPackyetti https://t.co/CY5qGMzGS7 Why dance class is just as important as math class: https://t.co/LY1vYDd0qO @SirKenRobinson https://t.co/h3n6Nu2Gaz Why educators must love and lead fearlessly: https://t.co/MyYXqeGhHl Humanity is more important than money — it’s time for capitalism to get an upgrade: https://t.co/ncMqk6tRK7 This dramatic restructuring of the economy would value the well-being of the average person more than the marketplace. Here's how it works: https://t.co/41ugjDRqqI \"We are a society of altruists, but we are governed by psychopaths.\" https://t.co/IVkZlbBUxC How our education system fails young boys, and what we can do to fix it: https://t.co/5fTdwxlIWR Faced with a challenging-to-pronounce name? Here's what to do: https://t.co/ex5EXeiovh \"The goal is not to turn kids into your kind of adult, but rather better adults than you have been.\" https://t.co/JQ7PBTiEbP 9 TED Talks to reawaken your creative energy: https://t.co/vujZJKJrIc \"There was a library in San Francisco that did an amnesty day last year, and they welcomed back 5,000 users who had been blocked. That same day, they received more than 700,000 items that were overdue. Among them was one book that was 100 years overdue.\" https://t.co/Bu82BX87cu An introvert's guide to working: https://t.co/rqKi1qxt4H 9 TED Talks from inspiring teachers: https://t.co/EfOr01aI2j “Teaching kids about equity in schools is not teaching them what to think. It is about giving them the tools and strategies and language and opportunities to practice how to think.” https://t.co/aEZQS5lfaI These steps can help you tackle your insecurities in the bedroom: https://t.co/endin3FkVh Polyglots are people who speak several languages fluently. Learn their clever advice for picking up new tongues quickly: https://t.co/SABaAr9rDc 8 TED Talks to help you do better research: https://t.co/Sf0a2TL6CY https://t.co/z9dD8eKchU A sex educator shares the keys to a happy sex life: https://t.co/7VycRjSlmG Why you should ask your doctor, \"Is this really necessary?” https://t.co/wesT6LQOcI We entrust teachers with the world’s most important job: educating our kids. So why don't we pay them more? https://t.co/WuTmBCAY9Z Never take a bad work day home again, using these 3 steps: https://t.co/Vz0F1HpNIS You can master networking even if you don't like talking to people. Here's how: https://t.co/KZr7STbuy1 Ask your doctor these 4 questions the next time they recommend a medication or surgery: https://t.co/CCn518kSFM 5 TED Talks every new graduate should watch: https://t.co/TAWFxhi2iF \"One of my suggestions for improving education is very basic: pay teachers like the professionals they are.\" https://t.co/scLJiMfaIl How to encourage kids to think critically from an early age: https://t.co/6qnzEpe33i This list of books assigned to students everywhere will expand your horizons — and your bookshelves: https://t.co/DF6hMPepeq These are instant red flags: https://t.co/d2VCoowxKY The books that students are required to read in 28 countries around the world: https://t.co/CMW6tKBypm https://t.co/TEfM61mvOy The pressure to be perfect is hurting our girls: https://t.co/Y9yXrPgypM @reshmasaujani #BraveNotPerfect People who develop a more complex understanding of their emotions are healthier and go to the doctor less frequently: https://t.co/tOKvYstNhk 4 tips for learning new things quickly: https://t.co/aKbMRf6TMM Leave today's annoyances — that critical comment made by your coworker, or the disappointing numbers in the weekly report — at the office. Here's how: https://t.co/b0PQcC1c3F Does your doctor prioritize your health or their payment? https://t.co/pJixaaV3qP Having a hard time pronouncing someone's name? Here's what to do: \n\n1. Be humble and admit you're having difficulty.\n2. If you hear someone mispronounce another person's name, kindly correct them. \n3. Don't change their name just because you can't say it.\nhttps://t.co/twKInF8Vxn \"Do you feel trapped in a broken economic model that excludes billions of people while making a handful unimaginably rich? That sorts us into winners and losers, and then blames the losers for their misfortune? Welcome to neoliberalism.\" https://t.co/4qviiywxrB The new political story that could change everything: https://t.co/InXC0OuTZp https://t.co/l1bVZg9Qab Free up space in your mind with these tips from the creator of the Bullet Journal. \nhttps://t.co/0bCF54C3L5 Is Venmo ruining your friendships? https://t.co/u0Pm7Nbj41 How Venmo could be harming your relationships: https://t.co/7YGXIlpPBx Never ever decide you're going to change someone's name just because you can't pronounce it. https://t.co/RIxHRPQdhX 3 excuses we use to avoid starting big projects — and how to get past them: https://t.co/PB0gjz12YS Learn how to clearly identify your emotions and recategorize them: https://t.co/cqswQzHtSQ RT @Scotland: Being a global centre of excellence for innovation, philosophy and literature is proof that Scotland is full of powerful, wor… How to stop failing before you've even started: https://t.co/pb5SODvOwe Stop checking your ex's Instagram. Seriously, stop. https://t.co/9GDsNfXhSP Try these two techniques to master your emotions: https://t.co/w1R4BiKzyd The Hindu Kush glaciers are melting. If we don't protect them, the lives of one-fifth of humanity will be in jeopardy: https://t.co/CyZMlD4aIv @tsheringtobgay RT @tsheringtobgay: The Hindu Kush Himalaya glaciers are melting, threatening to destroy the livelihood of almost a quarter of humanity. We… The world's \"Third Pole\" is melting away. Here's how we can stop it from disappearing: https://t.co/YzrNApeEXV @tsheringtobgay https://t.co/tBvICCiMOT The benefits of giving spike when people feel a real sense of connection with those they are helping and can easily envision the difference they're making in their lives: https://t.co/zjeyewtT4T @DunnHappyLab Here’s a fun fact: Three-toed sloths fart through their mouths. You’re welcome for this knowledge. https://t.co/8Igkdc84it This surprisingly simple device can heal a hole in a baby’s heart in one 30 minute procedure: https://t.co/xeg0kOjscZ https://t.co/0SRy2fzx8n “Anything that is worth pursuing is going to require us to suffer, just a little bit.\" https://t.co/gcR5M2aBEH These 9 paintings have a trippy secret: https://t.co/K8qgOgDzn5 https://t.co/hJRmCmJVjg This isn’t a still painting. You’re looking at a real person. \n\nArtist Alexa Meade paints directly onto the bodies of her subjects, taking three-dimensional scenes and making them look like two-dimensional paintings. Here's how: https://t.co/Bau0ZDsWIT https://t.co/IZNfvCzIYm Get a behind-the-scenes look at how artist @AlexaMeadeArt submerged @ArianaGrande in a pool of paint:  https://t.co/t3mKVw5V3l https://t.co/G3qLVAYWDC Surf photographer Chris Burkard is obsessed with the coldest, choppiest and most isolated beaches on Earth. \n\nSee more of Chris’s jaw-dropping photography:  https://t.co/d5QSzDDOQw https://t.co/yyRKl05gY6 Do you feel stressed or unfulfilled? This shift in perspective can bring harmony and calm to your life.\n\nWatch Raymond Tang's full TED Talk here: https://t.co/DybZTAJS21 https://t.co/4ihX0qhsYQ It's not true that young people are more creative — but there is one factor that changes as you get older: https://t.co/eRDHnP2mJR The science behind when in life you will succeed or fail: https://t.co/DFwc2ij6m8 @barabasi The real relationship between your age and success: https://t.co/a5mc4v2I7s @barabasi When in life are you most likely to succeed? https://t.co/j38D5VKkBJ @barabasi https://t.co/YBew7hNvaD \"Poetry and grace can be found in the words of people all around us when we simply take the time to listen.\" https://t.co/ykOnFtahGj \"We have a system of justice in this country that treats you much better if you're rich and guilty than if you're poor and innocent.\" https://t.co/zbhEM3PkCi How to give a powerful eulogy: https://t.co/8XyoyRNDdC https://t.co/jn8KA0wdxy Here's what to do when a friend is diagnosed with cancer: https://t.co/hlvLufzwux @suleikajaouad https://t.co/ASZeyhHVnP RT @TED_ED: Did you know that Harriet Tubman was the first woman in U.S. history to plan and lead a military raid, liberating ~ 700 enslave… This is the important connection between politics and parenting: https://t.co/OC4tf6NnUf @hajershareif It's normal to be at a loss for words when you're asked to speak at a memorial or a funeral. Here are some basic guidelines to get you started: https://t.co/PkR7LSqQrc In April, journalist @carolecadwalla gave a vital TED Talk about how a barrage of misleading Facebook ads targeted at swing voters shaped the outcome of Brexit.\n\nHere's what has happened since her talk went viral. Watch the full interview here: https://t.co/f0ubiBLH0D #TEDSummit https://t.co/JWdaYpzeOT Here's why you should have a candid family meeting where everyone can express their opinions, negotiate and compromise on how the household is run: https://t.co/2RApo8ZZ3v @hajershareif A judge in the juvenile justice system becomes a whistleblower and reveals her plan to take power away from judges. Listen to the latest episode of #SincerelyX on @hearluminary: https://t.co/NEXEQZsLJ2 https://t.co/MycRJ9gF1t How to give a eulogy that truly celebrates the person you’re honoring: https://t.co/KEpMbZFcuZ https://t.co/uCsEaJMJSW RT @kaysarahsera: Episode 10 of #SincerelyX (the final episode of the season!) is here. “Absolute Power”: A judge who works in the juvenile… RT @hearluminary: In the season finale of #SincerelyX from @TEDTalks, @kaysarahsera shares the story of a judge who works in the juvenile j… This is why it's so hard to get over failure. Here's how to unstick your brain: https://t.co/5nasfBQX2I This community hall in Mumbai is made out of paper-mache and plaster of Paris. It's built for the Ganesh festival and is disassembled after 10 days.\n\nLearn more about temporary architecture: https://t.co/OfeR94Qj9l https://t.co/UEOeMCEgC7 How to use family dinner to teach politics: https://t.co/rTmgzrwaYW @hajershareif https://t.co/XxiA9A4gEH \"Failure to prepare could allow the next epidemic to be dramatically more devastating than Ebola.” — @BillGates https://t.co/283LBfpk1I This is what happens when you reply to spam email: https://t.co/Wctof8h4Lf @veitchtweets https://t.co/5O7S53dHLU These are the ingredients of a great conversation: https://t.co/jsa9WVWW5O 7 TED Talks to help you find your purpose: https://t.co/wO2f4dWoji \"We have within us the capacity to manufacture the happiness we are constantly chasing.\" https://t.co/WLnRQWRvL9 “Half the confusion in the world comes from not knowing how little we need.” https://t.co/0roKv6GLU5 Why you should ask your doctor, \"Is this really necessary?” https://t.co/3YnszL3XCZ Ask your doctor these 4 questions the next time they recommend a medication or surgery:\n- Is this really necessary?\n- What are the risks?\n- Are there other options?\n- What happens if I don’t do anything?\nhttps://t.co/crbAyLtjmT Ask your doctor these 4 questions the next time they recommend a medication or surgery: https://t.co/b0JRvDb4pm \"Honor killings take place in many parts of the world, where men punish women who transgress rules made by them... In the rest of the world, honor killings would be known as murder.\" @SOCFilms https://t.co/2kw0uHSsSn The architectural wonder of impermanent cities built to disappear: https://t.co/bGkA6hMksj https://t.co/nh1Zof0Zg8 Some valuable parenting lessons from children: https://t.co/7SitVbDWvH Having a mentor can make a huge difference in your career — but first you have to find one. Here's how: https://t.co/hfS6xRThrB What happens to privacy when we can read people’s minds? \nhttps://t.co/Ea5AEePwKS \"I realized that the man who I loved so much was going to kill me.\" https://t.co/PLtlg6WL2Z \"My question to you is, is this what you want? Is this how you want history to remember you? As the handmaidens to authoritarianism?\" \n\nWatch as @carolecadwalla calls out the \"gods of Silicon Valley\" for being on the wrong side of history: https://t.co/wHpI18epXp Learn how to cultivate a healthy dose of skepticism: https://t.co/iyXLW0smSY \"We are what happens to a western democracy when a hundred years of electoral laws are disrupted by technology. Our democracy is broken, our laws don't work anymore.\" @carolecadwalla  https://t.co/GnrtZg6e1j Space traffic is our next big environmental problem: https://t.co/KkXOFvu0Qf @moribajah Grilling this weekend? This is the future of plant-based and cell-based meat:  https://t.co/3a8M1n8T7t An astronaut's story of curiosity, perspective and change: https://t.co/2hpOxzwwrj @Astro_Flow https://t.co/txiNt448yW How to support a friend through cancer: https://t.co/VntWLNVCT0 @suleikajaouad https://t.co/acP74vLgZt \"It can be difficult to know what to say to someone who has just been diagnosed with cancer — and when people don’t know what to say, they often say nothing at all. It’s better to show up than to err on the side of silence.\" @suleikajaouad https://t.co/KzKA1Vn8wW 6 space technologies that we can use to improve life on Earth:  https://t.co/721HCMekOI @space_enabled For centuries, authors like Jules Verne and H.G. Wells wrote stories about traveling to space. Here’s how those tales helped us get to the moon: https://t.co/n6T3Udacnu The relationship between the Earth and the Moon is unlike anything else in our solar system. This groundbreaking theory explains what makes it so special: https://t.co/KcAoDeTnLE This is a brilliant way to support the local businesses you love. Here's how it works: https://t.co/m5uIaZVUNI Mentalism, mind reading and the art of getting inside your head: https://t.co/lQuLLgVfUa @DerrenBrown https://t.co/ZZ7Cw2IQHz Why your city should think about starting its own currency: https://t.co/ALPhvYbRGH https://t.co/vfZIJ8Cf01 How going to space shifted my perspective on humanity: https://t.co/OwvjpYau0T This personal air-quality tracker lets you know what you're breathing: https://t.co/z2jRjn2mjc Listen to some of these great jams for your cat: https://t.co/DsdosWs4uA Made just for cats, this cellist's album was inspired by bird chirps, mother cats’ purrs, kittens’ suckling and classic meows. It even includes ultrasound frequencies that only cats can hear. https://t.co/8pTRgAVOgz Psychedelics could reshape how we treat trauma and mental illness. Here's how: https://t.co/343mfgC5KA Free up space in your mind with these tips from the creator of the Bullet Journal. \nhttps://t.co/pmaoMXvX2j 4 TED Talks for cat lovers: https://t.co/Z6XRyLo0Tm https://t.co/Kh7C6U2Hfc When Leland Melvin was 5 years old, he watched Apollo 11 land on the moon. In 1969, he never imagined he'd grow up to become an astronaut too. https://t.co/ewI5vt2NZt 7 TED Talks about what it would actually be like to live on another planet: https://t.co/t4shECuNXR In 1969, when humanity first landed on the moon, the typeface Futura was right there with them. @dougthomas31 shares Futura's role in launching the Apollo 11 spacecraft — and how it became one of the most used fonts in the world. https://t.co/HMWRhDixMR This is why your cat is such a weirdo: https://t.co/96cyZfFMXK The psychological reason you need more plants in your life: https://t.co/fAvLL0ukqG \"Only dead people never get stressed, never get broken hearts, never experience the disappointment that comes with failure. Tough emotions are part of our contract with life.\" @SusanDavid_PhD https://t.co/J608edCCZ3 \"How is it possible that we landed on the moon and walked around 29 years before we discovered the anatomy of the clitoris?\" \nhttps://t.co/hNByPW8toz Whether you're heartbroken or stressed out, these TED Talks will help you process your emotions. https://t.co/onaESJtSkf This weekend, let yourself get lost in your thoughts. https://t.co/6SbBT6Nw62 How the Futura typeface helped launch Apollo: https://t.co/N0luw56WUf @dougthomas31 https://t.co/8w2YoTD0jj All the motivation you need to tackle that to-do list waiting for you at home this weekend. https://t.co/Gf2jLniSUD Three years ago, the US resettled 15,000 Syrian refugees in response to the largest refugee crisis on earth. A year later, that number was 3,000. Last year, that number was 62 people. https://t.co/LfyfIIKBbC \"My identity is not my obstacle. My identity is my superpower.\" @AmericaFerrera https://t.co/fMorqvPsyJ How do we take back control when technology knows us better than we know ourselves? @harari_yuval talks about the incredible effect of taking time to unplug on this episode of #TheTEDInterview.  \n\nListen on @Spotify or your favorite podcast platform: https://t.co/Tzp2ttucpN https://t.co/VEZhi1lFuv A refugee &amp; immigrants rights attorney shares an urgently needed historical perspective on the crisis at the southern US border — and shows how citizens can hold their governments accountable for protecting the vulnerable: https://t.co/DWIJD4srWv \"Acute physical pain ends relatively quick; complex emotional pain does not.\" @eubanksaustin \nhttps://t.co/97bw8nLl0F \"Being cured is not where the work of healing ends. It's where it begins.\" @suleikajaouad https://t.co/ccibsLuDer The US maternal mortality rate is shockingly high. Here’s how to fix it — and save lives: https://t.co/JH8EjiG9I4 @LizHowellMD \"It's absolutely legal to seek asylum. It is a fundamental right in our own laws and in international law.\" https://t.co/O8WyyQkryW The shocking truth about maternal health in the US: https://t.co/U7Jp1vvipo @LizHowellMD \"We'd worry a lot less about what other people think of us if we realized how seldom they do.\" @DerrenBrown https://t.co/CRGgWLu2Se What is mentalism, and how do you practice it? \n\nWatch psychological illusionist @DerrenBrown's dazzling mind-reading performance from #TED2019: https://t.co/blgfpQAXYd RT @MTVNEWS: .@BoJackHorseman writer @jonnysun talked to us about his recent #TED Talk, using social media for good, and building a digital… \"I don't believe for a second that I have any special psychological gifts, let alone any psychic ones.\" @DerrenBrown https://t.co/XzVTqEC7XI You only need 30 seconds to know if you click with someone. So why do we get stuck on inescapable Tinder dates when we already know we're not interested?\n\nWatch @cmwalla's full TED Talk about making online dating work for you: https://t.co/kscVvjeWup https://t.co/QxlLAQIHJX How we can improve maternal healthcare — before, during and after pregnancy: https://t.co/GK2lAvrtol @LizHowellMD https://t.co/gTXCbgIXXn Polyglots are people who speak several languages fluently. Learn their clever advice for picking up new tongues quickly: https://t.co/Axu0CVbUli RT @MsPackyetti: Thank you for coming to my TED talk. \n\nLiterally. 😭😭😭😂😂😂\n\nhttps://t.co/qqBfbEVWFC RT @TED_ED: Estée Park has a solution to fix the frustrating wage gap between professional men's and women's soccer. Check out this passion… RT @TEDchris: This was a mind-blowing conversation with @harari_yuval -- latest episode of #TheTEDInterview.  At the heart of it is a chill… \"Hide-the-pain Harold is a role. It's not really me, it's given to me by the internet people.\" https://t.co/Yi1nHQkVJG \"A country shows strength through compassion and pragmatism, not through force and through fear.\" https://t.co/4BI28R4Kpl \"You don’t need to work for an organization that saves lives to find meaning and purpose in what you do.\" https://t.co/dAS6xi7siq 25 TED Talks that will change how you see the world: https://t.co/kNSWEYpYIs 4 TED Talks to help you stop being such a perfectionist: https://t.co/F6K1YV26bR How to get over the end of a relationship: https://t.co/6TXrSU66DW \"To bloom, we must learn not to fear self-doubt but to embrace it as a naturally occurring opportunity for growth and improvement.\" https://t.co/v3nXunF5I3 One day you're a retired engineer in Hungary. The next, you're a viral internet sensation. https://t.co/JqjYVX5BhM Technology knows you so well, it won't even need your data anymore. @harari_yuval says it's time to fight back by taking time to disconnect on this episode of #TheTEDInterview.  \n\nListen for free on @Apple Podcasts: https://t.co/FAEAYqmFSj https://t.co/ZsP85fxVo2 4 ways you might accidentally make things weird when you ask for help: https://t.co/z0puTBYUoY RT @LittleMsFossil: Hello! Because of the questions coming through from my TED talk @TEDTalks I’m doing a @reddit Ask Me Anything (AMA) thi… Need to ask for help? Here's the wrong way to do it. https://t.co/bfolhTpfed Early education is critical to children's success — but millions of kids in the United States still don't have access to programs that prepare them to thrive in kindergarten. \n\nEnter the UPSTART Project: https://t.co/f10SaJRwPH @WaterfordOrg The fundamental right to seek asylum: https://t.co/SfODfOOtO2 https://t.co/awHwe6FHJU \"Magic is a great analogy for how we edit reality and form a story — and then mistake that story for the truth.\" @DerrenBrown https://t.co/QeTqRZmD5d What does it feel like to be a sociopath? Listen to the latest episode of Sincerely, X here: https://t.co/WJzAVYxkAN https://t.co/QJ4b0QvQEf These origami robots can roll, jump, catapult like a slingshot and even pulse like a beating heart. https://t.co/oIISQpFrCK @robotician The fascinating art of mentalism: https://t.co/mf7JHSheOD @DerrenBrown Mentalism, mind reading and the art of getting inside your head: https://t.co/LRnVc29Iva @DerrenBrown https://t.co/EjeDuRXkUI \"My mom got a lot of her beliefs from social media, from Facebook and from organizations that were allowing their platforms to push lies that were very dangerous.\" @j_lindenberger \n\nThe inside story of one teen's quest to get vaccinated: https://t.co/C7wKKBXfHz \"There is no feeling on earth like the start of an expedition. You know that there's this possibility that you're about to find something that could change our knowledge of who we are and where we come from.\" @LittleMsFossil https://t.co/ovUQLAIqzS \"Listening to one another will not magically solve all problems. But it will give a chance to create avenues to start to work together to solve many of humanity's problems.\" https://t.co/6ftdx64zSV \"A grieving person is going to laugh again and smile again. Yes, they're going to move forward. But that doesn't mean that they've moved on.\" \n\nWatch @noraborealis's full TED Talk about grief here: https://t.co/vUGXYGXuag https://t.co/ZDy5Zpwf20 .@MonicaLewinsky reveals the personal impact of public humiliation and how forgiveness helped her heal. Listen to #TheTEDInterview for free on @ApplePodcasts: https://t.co/JGRF1Uej7E https://t.co/1tnYJFEDky “Cinema can play a very positive role in changing and molding society in a positive direction.” @SOCFilms https://t.co/f2kBoETYdV How special effects trick our brains when we watch a movie: https://t.co/v9mYBmNpse \"Science was about going out into the unknown. It was about truly global exploration, even if there were risks.\" @LittleMsFossil https://t.co/SDtr3qMous \"Obituaries are testament to a human life. They're the last chance to talk about somebody's contribution on the world. They were also an example of who society deemed important.\" @NYTAmy https://t.co/vVvOqE956c \"Overlooked\" tells the stories of marginalized groups of people who never got an obituary in @nytimes. It's a chance for the newspaper to revisit its 168-year existence and fill in the gaps for people who were, for whatever reason, left out. https://t.co/HQt5I6ZaXm \"Film can change the way people perceive issues. An effective storyteller speaks to our emotions, elicits empathy and compassion, and forces us to look at things differently.\" @SOCFilms https://t.co/uVKvd4gIaQ Need to stop procrastinating? Try this. https://t.co/ngHx39NFbj Here are 3 strategies to stop procrastinating — for good: https://t.co/iMYLNW2Axq Accepting your negative emotions actually makes you happier in the long run. https://t.co/LTuRE1Ma3t Just say \"no\" to the cult of positivity. https://t.co/qongOFbGQl Polyglots are people who speak several languages fluently. Learn their clever advice for picking up new tongues quickly: https://t.co/EGmbDiakeW One reliable, science-backed way to make any baby laugh: https://t.co/ina6B5sLap We're not doing frontline exploratory science in a huge portion of the world — the places governments deem too hostile or disputed. What might we be missing because we're not looking? @LittleMsFossil https://t.co/AzHntjYCU3 Here are 3 ways that 20-somethings can re-claim adulthood in the defining decade of their lives.\n\nWatch Meg Jay's full TED Talk here: https://t.co/1RoNS5Gcqn https://t.co/iLHjAN0v8T RT @LittleMsFossil: THIS is my TED talk. Science has a geography problem... we aren't exploring a significant portion of our planet because… RT @indyfromspace: I witnessed this talk in person and it is brilliant and timely and evocative. You might cry (I did). Give @LittleMsFossi… The fascinating places scientists aren't exploring: https://t.co/aRenLmBdH5 @LittleMsFossil https://t.co/KIjmqlSq9n Will the next generation of coaches be computers? https://t.co/0I2Eat2Cud \"The positive part about Twitter and social media in general is that it is a place where you can find connection and a place where you can find community, and you can find those things that are sometimes inaccessible in person.\" @JonnySun https://t.co/tsg6HFFza2 \"Our online data is more than just a collection of 1s and 0s. It's our lives, our hopes and aspirations.\" https://t.co/kwDLprA6i6 Some scientists think it's anthropomorphism to believe that animals experience grief and mourning. But this biological anthropologist doesn't agree. \n\nLearn how animals mourn their loved ones, from elephants to ducks: https://t.co/8DafOftrAt For when you've deleted every social media app on your phone but it's still not enough. https://t.co/wB2lKwYNQJ Writing a haiku every day can help you discover the hidden joy in your life: https://t.co/veF09qghrY \"I define trust as a confident relationship to the unknown.\" @rachelbotsman https://t.co/gib9ReBarQ \"We are in the process of building some sort of god. Now is a good time to make sure it's a god we can live with.\" https://t.co/IW8A48Yiqe 7 TED Talks to help you reach your goals: https://t.co/yiefYE3ZO8 Someday, solar panels may be light and cheap enough that they could be hung on a clothesline, thanks to a synthetic mineral called perovskite. https://t.co/dhRDaWkgKd \"Writing haikus brought me back to something I hadn’t felt for a long time — the sheer, elemental joy of playing with words.\" https://t.co/kJXb2Co81p Watch these TED Talks when you want to throw it all away. https://t.co/lChHv9OHMp How to help kids fall in love with the outdoors: https://t.co/aTlT13tuhF The technology we're developing now could change the world as we know it. https://t.co/v8ZlZ017kq \"Be a hummingbird parent. Sit on the periphery. Zoom in only when necessary, which isn’t very often, and zoom back out again.” https://t.co/M7BAOJ4ozO How we can break out of boys-are-blue and girls-are-pink stereotypes when raising our kids: https://t.co/tsVc35idsZ Whether you're looking for a career change or just getting started, learn how to navigate it all. https://t.co/baM0aBc7l7 Is retirement bad for your health? https://t.co/si0sqBNcqk Next time you’re frazzled and need a motivational pep talk, give one to yourself in the second or third person. This can help you look at the situation from a logical, objective perspective rather than an emotional, biased one.\nhttps://t.co/h1AZFxXFyk Take a deep breath. Look them in the eye. Tell them how you feel. https://t.co/Bl2ObVIRL2 No matter how long you've been together, it never hurts to have a little refresher course on what really matters. https://t.co/Q7xStJqhOy 7 TED Talks to watch if you need help opening up: https://t.co/suXOpt8K7Z Many people are caregivers for their sick parents, partners or friends, with an unfortunate consequence: They end up suffering too. https://t.co/Yb3UB0g6nC Here's how retirement might impact your brain: https://t.co/sNIC1qXbzA 14 mind-blowing technology breakthroughs: https://t.co/p692tM47Za Introverts bring extraordinary talents to the world, but they're often overlooked. Writer Susan Cain shares ideas for better offices, schools and relationships built with introverts in mind.  \n\nListen to #TheTEDInterview for free on @ApplePodcasts: https://t.co/isui78vJkW https://t.co/Jr0Gu1cJzY Is it better to take one long vacation or a few short ones? Let's check the research: https://t.co/vVKCVpuYVC Our 2019 summer reading list is finally here! What books are you excited to dive into this summer? https://t.co/RvJuEd7TWU \"To bloom, we must learn not to fear self-doubt but to embrace it as a naturally occurring opportunity for growth and improvement.\" https://t.co/BVngX4dK97 \"Honor killings take place in many parts of the world, where men punish women who transgress rules made by them... In the rest of the world, honor killings would be known as murder.\" @SOCFilms https://t.co/a4EnYwV8xM \"You define your success. There are no accomplishments that will satisfy you and make you feel like you’ve arrived.\" https://t.co/iMBbaoniVQ How I'm using film to end honor killings in Pakistan: https://t.co/4iNzYQFk2l @SOCFilms https://t.co/lnxgBUHHSS This woman turned the world’s worst aquatic plant into something magical: https://t.co/liO8ZkyHlR https://t.co/F9B3efeHFW RT @AdamMGrant: Multitasking isn't a problem if you do it slowly.\n\nHighly creative scientists switched topics 43x in their first 100 papers… \"I need to do everything in my power to eradicate racism in my lifetime.\" https://t.co/mGp9oeT9ye Thinking about quitting social media? This man has never had a social media account — and shares 3 reasons why you should join him: https://t.co/FSBF3U2F85 Can you tell if an animal is grieving? These are the signs: https://t.co/uQyUmB0FZq @bjkingape The honest reasons why people write mean comments online: https://t.co/YN3AiiETCC @dylanmarron https://t.co/tIQNNAaSSK Crossword puzzles + magic = @davidkwong https://t.co/eSDdNmkUde This ornate 240-page book from the 1400s is one of history's biggest unsolved mysteries. The reason why? No one can figure out what it says. \nhttps://t.co/Pv8I69RehJ \"Everything happens for a reason\" — and other lies I've loved: https://t.co/f0Knu4daxG @KatecBowler https://t.co/hBYgGONRg4 11 things you should know before you start your career: https://t.co/9BxWDUDj6a 11 bits of great work advice, wherever you are in your career: https://t.co/0l0Cm5fiUc What do you wish you knew before you started your career? https://t.co/99YFg9KsVW There's nothing wrong with you. We promise. https://t.co/0MRTOaBuXE Why @NYTObits is writing new obituaries for people forgotten by history: https://t.co/S7GGGBuol0 @NYTAmy Life-hacker @tferriss reflects on his past struggles and shares what he learned about success and building lasting confidence. Listen on @Spotify: https://t.co/x2RtQvl4MV #TheTEDInterview https://t.co/AzJeS2oprM How we're honoring people overlooked by history: https://t.co/E7s4ClPclz @NYTAmy https://t.co/6LDfuYbbrj If lying means making more money, what motivates people to tell the truth? https://t.co/nSZ9bAjhVN As if you needed another reason to delete Tinder. https://t.co/cEIObaXJ5Y The magic of Fibonacci numbers: https://t.co/pQhYcfPne4 The psychological reason you need more plants in your life: https://t.co/ay7JIFF0Fo \"I reject the idea of work-life balance. The phrase is a bald-faced lie, designed to hang over the human psyche like the Sword of Damocles.\" @staceyabrams @PicadorUSA https://t.co/lQX8QyMIww This lie-detection technology could someday reveal our hidden emotions. https://t.co/6Vx51S1Usc \"We all want reasons. We want formulas to predict whether our hard work will pay off, whether our love will always make our partners happy and our kids love us. We want to live in a world in which not one ounce of our hard work will be for nothing.\" https://t.co/BZ85HHF0d7 Why it’s better to be adaptable than smart: https://t.co/FiaKis7KBp @nataliefratto https://t.co/y16fVwlwFD US authorities recovered an illegally looted mummy, and they wanted to return it. Big problem: They didn’t know where it was from. \n\nEnter @indyfromspace. https://t.co/8e2YIULHLx \"Acknowledge the gains of freedom that you have today, because some people had to give their lives for you to have it. Don't take this for granted.\" @Farida_N https://t.co/haPHUP28Lm Drugs like LSD, psilocybin and MDMA — when paired with psychotherapy — could change the way we treat PTSD, depression, substance abuse and more. \n\nWatch @RickDoblin's full TED Talk here: https://t.co/6hMHGgUACa https://t.co/kJnRnMSvvR @hanhorne1 Better late than never! RT @alexnautilus: Some people are smart, some work harder, but Jamie Paik is both! Her work and ideas about robotics are groundbreaking. So… Origami robots that reshape and transform themselves: https://t.co/bdh37nHVMO @robotician https://t.co/A86b64eL8B \"Animals can care very deeply for each other, maybe they even love each other. When they do, a survivor's heart can be pierced by a death.\" @bjkingape https://t.co/9rHZgzASQt RT @AdrianSaville: The short list: 24 books, each under 200 pages, as recommended by TED speakers https://t.co/RydSe70IH2 via @TEDTalks Why sharing someone else's nude photos without their permission is a horrifying betrayal of privacy: https://t.co/0CHhMsk1cA RT @scjansen: The blurring between what is art, what is politics.. Can public art inspire productive political conversations? https://t.co/… RT @kaysarahsera: Episode 8 of #SincerelyX is up! 🏳️‍⚧️ \"None of Your Business\": A trans man in the American South argues for his right to… This beautiful public art project explores what it means to be American: https://t.co/vlVJkTOJXk Drugs like LSD, psilocybin and MDMA — when paired with psychotherapy — could change the way we treat PTSD, depression, substance abuse and more. https://t.co/Ly0WoUIqEV When you’re thinking about your next high-stakes situation, ask yourself the same question that actors ask when developing a character: “What’s my end goal?” https://t.co/6D9otekoom Could psychedelic drugs treat PTSD and depression? https://t.co/LPCTxA197F https://t.co/y0503N495d When you feel your palms sweat and your stomach churn as you’re about to walk into a job interview, that just means that you’re alive. https://t.co/ekUUH6XYDi You have to perform all the time, from giving toasts at weddings to asking your boss for a raise. Here are 3 tips to help you channel your inner actor: https://t.co/ZjvtRT3JrS Raise your game in the high-pressure moments that matter by thinking like an actor. https://t.co/eOLWHw4WNr This is how psychedelic-assisted therapy works: https://t.co/AbKKJpVJ7D Psychedelics could reshape how we treat trauma and mental illness. Here's how: https://t.co/kEh31jgdPB The future of psychedelic-assisted psychotherapy: https://t.co/i40fCtvmv8 @RickDoblin @MAPS https://t.co/BB6LHZ0wmB \"Every single time we choose a plant-based meal, we are contributing to reducing animal suffering.\" @bjkingape https://t.co/j5ydUZBQLC Nude photos are not the problem. Nonconsensually sharing or publishing nude photos is the problem. https://t.co/oBb1RgTNV8 A powerful look at what we should learn from #BBQBecky, #PermitPatty, and other viral stories of white people calling the police on black people for just living their lives: https://t.co/U9cWLGYRsy @baratunde #LivingWhileBlack \"Animals don't grieve exactly like we do, but this doesn't mean that their grief isn't real.\" @bjkingape https://t.co/UNJYfWcJVg Can you tell if your pet is grieving? These are the signs: https://t.co/xmSXVCK8oS @bjkingape “Art and politics are the same thing. They’re both forms of advancing humanity.” https://t.co/2LoHCw12uX What does it look like when an animal is grieving? Here are some of the signs:\n- social withdrawal\n- rocking\n- irregular eating or sleeping\n- depressed posture or vocalization\n https://t.co/km72IQq4Hb This art project is updating Norman Rockwell’s iconic Four Freedoms paintings: https://t.co/mAGCqTZMiJ https://t.co/4t1BkS0gn8 These tiny books pack a punch. https://t.co/sWtVu3J7IX Overwhelmed by your summer reading? Pick up one of these shorties. https://t.co/4VyI9o0DVJ @MmishLoww https://t.co/QBe5rKmC4A @TheMantissa1 Nope, they're just fantastic *and* short! RT @PresidentBio: Watch my @TEDTalks online where I shared what I believed in and still believe in now – that #SierraLeone is bigger than a… RT @SindyElefante: I did an adaption of @TEDTalks about #procrastination and I translated to English. Check it on my web page: https://t.co… @SindyElefante This is awesome, Sindy! Thank you for sharing! These fantastic books are all under 200 pages. https://t.co/DpQyBgY0xV Grief and love in the animal kingdom: https://t.co/QYBj74qtLb @bjkingape https://t.co/O80z9ccjnq RT @bjkingape: My TED talk is up! I speak about grief and love in #animals, and how all of us can do better, and be better, for animals. An… Your vacation is short. So are these books. https://t.co/c9nRQbpwnj RT @NatalieFratto: My TED talk was released today and is featured on https://t.co/Yz8tFCUzBJ - on why it's better to be adaptable than smar… 3 ways to measure your adaptability — and how to improve it: https://t.co/GLGZsnRDNN @nataliefratto https://t.co/x6T8qOQskg \"The most audacious and nation-changing events or policies or even personal choices happen when we ask, 'Why not?' then make bold choices and ensure those bold choices happen.\" @PresidentBio https://t.co/RSZTiv5oHR What happens when you have a disease doctors can't diagnose: https://t.co/CCNL4FSjwW @jenbrea https://t.co/1vnDPiK3Yf \"Whoever you are, whatever you're going through, in whatever way you might be going through it, just know this: in order to heal it, you have to feel it.\" @eubanksaustin \nhttps://t.co/L2fE4CXr8A \"I believe that leadership is about creating possibilities that everyone, especially the young people, can believe in, own, work to actualize, and which they can actively fight to protect.\" @PresidentBio https://t.co/hSI79bQbFQ .@MonicaLewinsky reveals the personal impact of public humiliation and how forgiveness helped her heal. Listen to #TheTEDInterview for free on @ApplePodcasts: https://t.co/TmHsKLXGDz https://t.co/OC3pFdCpnj How to talk to kids about race: https://t.co/OAzTptOGHK @Forward_Promise The conversation about nude photos and digital privacy we should have right now: https://t.co/F2wfCvOza8 \"Sierra Leone is bigger than all of us, and Sierra Leone must be a secure, peaceful and just society where every person can thrive and contribute to national development.\" @PresidentBio https://t.co/4tzktFIq17 The frightening relationship between racism, stress and pregnancy: https://t.co/YNf5ucJAI5 @miriamzperez Activist Ruby Sales reflects on her time as a freedom fighter in the civil rights movement and her hopes for the future. https://t.co/LklmCNhNIK Why we need to call out casual racism: https://t.co/izOqmxK78v @Luvvie https://t.co/odPs8cs6ZR \"How could a disease this common and this devastating have been forgotten by medicine?\" @jenbrea https://t.co/ia251zuZkH In March 2018, @MorganTreks and @VanessaTreks hiked the path that Harriet Tubman took to freedom nearly 170 years ago. Here are some lessons from their long walk. https://t.co/iALDgJ7NTz The manipulative tricks tech companies use to keep your attention: https://t.co/zDC7cTgaTn @tristanharris How to build a company where the best ideas win: https://t.co/rVkhKYxzH6 @RayDalio https://t.co/lsliri614r The ignored struggle of chronic fatigue syndrome: https://t.co/pKKU0VH356 @jenbrea https://t.co/H2lvMmqqhx 3 moments humanity teetered on the edge -- and how we survived: https://t.co/KVWobKc7hk @indyfromspace Here’s how you can discover history’s hidden artifacts -- without leaving home: https://t.co/0LShZMHtaI \"Where do you feel useful to this world? Because the answer to that question is where you will find your voice and your freedom.\" @ashweethashetty https://t.co/o5HOOEi1Ay How online abuse of women has spiraled out of control: https://t.co/QWsyW0tpim @AshleyJudd https://t.co/yO6UHDgB00 Practical strategies to help you find more time for what matters most: https://t.co/GCS656syWQ @lvanderkam The next step in nanotechnology: https://t.co/KihrqLsJOV @gtulevski How to gain control of your free time: https://t.co/X9nE1rVB6A @lvanderkam \"Believe her. Believe her.\" @AshleyJudd https://t.co/dPBNNr7DnO How to find the hidden hours in your day: https://t.co/uY9vAn20qc @lvanderkam \"You may think it is ignorant to speak broken English, but even articulate Americans sound foolish to the British.\" https://t.co/8jA6iaZiBz You will never look at bank tellers the same way again. https://t.co/RfqIgsPmK2 @davidautor Retirement could lead to a decline in your cognitive function, according to new research. https://t.co/4CAILkiAqm Are you terrible at small talk? This radio host has some advice: https://t.co/QKkaRoAX76 How the story you tell about yourself affects your life: https://t.co/ihP8fee8nM \"Every time a women has sex simply because it feels good, it is revolutionary. She is revolutionary.\" https://t.co/29gz4DVBK8 Mystified by love? We're here to help: https://t.co/QJi6dvEhVI \"As long as there is breath in your body, it's never too late to change your story.\" https://t.co/ODXpT7YRwr \"When we curb abuse, we will expand freedom.\" — Ashley Judd https://t.co/rhIB2hB1cw Stop looking at your ex's Instagram. Seriously, stop. https://t.co/h2hSnRNbOL Is retirement bad for your health? https://t.co/tzOZjT1H1x How to raise gutsy girls: https://t.co/pDGuyw0n3m @carowriter \"The best time to work on your marriage is before you have one.\" https://t.co/VgaKURH1sM Why it's important to surround yourself with people who challenge you: https://t.co/PcES5aJTGo 8 TED Talks to help you rise above life's daily dramas: https://t.co/DMFm8S0OK9 You only wish you could procrastinate as well as this guy. https://t.co/cffcxa1y6q \"It's simple: it's your body, and you decide what's best to do with it.\" https://t.co/Zt6fcaU1NY \"People have sex for many reasons, some because they want a baby, but most of us have sex because it feels good.\" https://t.co/DQ8GkfTTTA This powerful talk by Bryan Stevenson got the longest standing ovation in TED's history: https://t.co/3jGu3azQsb This is the difference between having depression and just feeling depressed: https://t.co/BCj4ei7Nm4 7 deadly sins of speaking that we should all avoid: https://t.co/pu0S7mFVYB This could be the secret to a truly satisfying night's sleep. @DanGartenberg https://t.co/MDbfiZkdGH \"Freedom is not an ocean you want to swim in, it's a river you want to get across, so you can commit and plant yourself on the other side.\" @nytdavidbrooks https://t.co/UvjvpEl9OC Your brain uses a quarter of your body's entire energy supply, and it really needs rest. https://t.co/ChC1RkNwju \"Soccer is the only thing on this planet that we can all agree to do together.\" @bamuthi #fifawwc https://t.co/PwCpLE5lrQ Feeling down? Cheer up with these charming talks: https://t.co/b2IqOdzmfY Ever feel like your career has been a winding, messy path? This talk is for you: https://t.co/VSz3Yaaqkq Easy ways to grow new brain cells -- even as an adult: https://t.co/NaXyXzFYpO This young boy invented a brilliant way to protect his village from lion attacks -- without hurting the lions: https://t.co/9Mxd74aR6v The factors in childhood that predict success later in life: https://t.co/pwnc9PAgmx Is it better to take one long vacation or a few short ones? Let's check the research: https://t.co/Ue5pOCgCXd \"The hardest part of my cancer experience began once the cancer was gone.\"\n\nWatch @suleikajaouad's TED Talk on the myth of the divide between \"sick\" and \"well\": https://t.co/6PJrSveklf https://t.co/dovBruLjFG Brilliant, simple advice on how to get your passion back: https://t.co/QsU8D65sbO Here's how retirement might impact your brain: https://t.co/25JAyDK7gh The President of Sierra Leone shares his vision for its future: https://t.co/adWLp6ZF33 @PresidentBio https://t.co/FinNfG3rIV .@MonicaLewinsky reveals the very personal impact of public humiliation and how forgiveness helped her heal. Listen to #TheTEDInterview on Spotify or your favorite podcast platform: https://t.co/K53XVtREkD https://t.co/y7SPrR9CDx \"With augmented reality, we the people have the power to highlight the narratives of the oppressed when institutions refuse to do so.\" @mvrsandshakers https://t.co/UpEWPxko3N Attention fellow word nerds: \"Daily haiku-ing fired up my creativity, sweetened my days, brought me closer to others, and more,\" says TED Ideas Editor Daryl Chen. https://t.co/1IFjWjQosO These shockingly lifelike digital avatars look just like you and can be controlled by your motions: https://t.co/M6GG0LQ3px Your mom was right. You need to stand up straight. https://t.co/bEV4yDitwS RT @moribajah: Thank you 🙏🏾 kindly! https://t.co/8mAncWdBBP Space traffic is our next wicked environmental problem: https://t.co/sB9Sts1LAw  @moribajah https://t.co/9DqKuq8Nic This is why anxious dogs love to sit on their owner's feet: https://t.co/pZzDRG3CwT Get back to your art. We believe in you. https://t.co/KvMBEuUeV9 Sit up straight! https://t.co/dVPUNTJQVY \"True awe is timeless, limitless and without division. It suggests there is a unifying whole to which we all belong — if only we could hold onto that awareness.\" https://t.co/R7Lt0lalyu This is why dogs yawn when they're anxious: https://t.co/7HWrUHKSXO \"Be a hummingbird parent. Sit on the periphery. Zoom in only when necessary, which isn’t very often, and zoom back out again.” https://t.co/xQ9sUsgELo This is so cool! Thanks for sharing your favorites, Aaron! https://t.co/GxlDGLWqkz \"Experiments have revealed that after just a few moments of awe, some people behave with increased altruism, cooperation and self-sacrifice.\" https://t.co/V1HR6An8Bw This is the big difference between a human's brain and a dog's brain: https://t.co/ekJMiKACHD This app places AR monuments that celebrate overlooked heroes all over NYC: https://t.co/IH3YttqJ8W @mvrsandshakers 3 steps to help your kids fall in love with nature: https://t.co/jEOyQZktqL How do dogs feel about their owners? This is what emotions look like in a dog's brain: https://t.co/lagCHUimCH One or two days a week is probably the ideal amount of time to work from home. https://t.co/yyeVjYk5QA Do you know how to communicate with your dog? Here's how to read your pup's body language: https://t.co/wUwkacll37 @javinlozano Hey Javier! We have a new tool called TED Recommends to find you the perfect TED Talk to watch next :) https://t.co/a2WVARh6Oe https://t.co/w03exngfM7 What TED Talks are your favorite entrepreneurs watching? Sign up for TED Recommends to find out: https://t.co/AeMXaeMloM https://t.co/c9lt3jZG5U True, people who work from home may not be wearing pants. But they are more productive, report higher job satisfaction, and save their companies money on office space.  \nhttps://t.co/UETH71ZMk2 TIRED: Helicopter parents.\nWIRED: Hummingbird parents. https://t.co/JHmYMZsjgX How to help kids fall in love with the outdoors: https://t.co/72gDXtSkrT How augmented reality is changing activism: https://t.co/w3TWAW2TCV @mvrsandshakers https://t.co/6jmujbYZAC \"The outpouring of grief about the murder of rapper and entrepreneur Nipsey Hussle is largely due to the fact that he decided to stay and evolve in place, rather than leave his hood.\" @GhettoGastro https://t.co/OJjYIFnUUp How to overcome apathy and find your power: https://t.co/a1jk7zPEqJ  @DoloresHuerta https://t.co/z1jTD3OVIN Three things to never say when you ask someone for help:\n\n\"I'm so, so sorry that I have to ask you for this.\" \n\"I really hate bothering you with this.\" \n\"If I had any way of doing this without your help, I would.\" https://t.co/26gObrepM3 \"My mom got a lot of her beliefs from social media, from Facebook and from organizations that were allowing their platforms to push lies that were very dangerous.\" @j_lindenberger \n\nThe inside story of one teen's quest to get vaccinated: https://t.co/FKsFTdXZlG “Democracy is one of the most faith-fueled human activities there is. Democracy works only when enough of us believe democracy works. It is at once a gamble and a miracle.” @ericpliu https://t.co/FV3eV0iynr \"To be online at any given point is to feel so much sadness and anger and violence. It can feel like the end of the world.\" @JonnySun https://t.co/OQasLFn6Xj The story we tell about millennials — and who we leave out: https://t.co/sJHjUOcVIS @rnz1 From New York to Bangkok, cities all over the world are sinking because of global warming. This landscape architect is helping design cities that stand up to the rising tides:  https://t.co/d1FL4PYFIj What if we could harness the sticking powers of sea creatures like mussels, oysters and barnacles, which refuse to budge even on wet, stormy coastlines? From metal to bones, nature has a glue for that: https://t.co/IAFvRczO45 \"We don't edit who we are when we do our thing.\" @GhettoGastro https://t.co/kG66msIcoa \"There's something important about sharing your imperfections and your insecurities and your vulnerabilities with other people.\" @JonnySun https://t.co/NEmpUCAPD3 \"There's this confessional nature to social media. It can feel like you are writing in this personal, intimate diary that's completely private, yet at the same time you want everyone in the world to read it.\" @JonnySun https://t.co/IipQ5sc06x \"The positive part about Twitter and social media in general is that it is a place where you can find connection and a place where you can find community, and you can find those things that are sometimes inaccessible in person.\" @JonnySun https://t.co/3LRsx7hMoV \"When someone shares that they feel alone, it actually makes me feel less alone, not by getting rid of any of my loneliness but by showing me that I am not alone in feeling lonely.\" @JonnySun https://t.co/G0AepMVbhD \"We don't realize the constant degree of noise pollution we're exposed to and how much we could profit from more quiet spaces.\" https://t.co/3lkMXItUYF \"A lot of people think that it is a big, scary thing to be online if you're not already perfectly and fully formed. But I think the internet can be actually a great place to not know.\" @JonnySun https://t.co/Y4LYRGqYYA \"If I could have dinner with anyone, dead or alive, I would. I am very lonely.\" @JonnySun https://t.co/KTMHVvxkbF \"We have to live simply, so that others can simply live.\" https://t.co/WxZisfDD50 The case for cliteracy: https://t.co/L9vEuclv9N Learn how @GhettoGastro is bringing the Bronx to the world in Jon Gray's new TED Talk: https://t.co/65qyy1cPPY https://t.co/JzTsK2CSGL Civility isn’t censorship or political correctness. Here’s why it matters: https://t.co/ZLdEiTQqaG We're getting closer to ending HIV for good. https://t.co/7ALGVJlFVT This is how light and melatonin actually impact your sleep: https://t.co/MIYk9ZbeG1 Almost 150 million people worldwide are born intersex — with biology that doesn't fit the standard definition of male or female. Let’s finally break the silence. https://t.co/wRD9R91p71 @emilord How light impacts your sleep, your focus, and your health: https://t.co/iQffJ78T8G Want to be healthier? Start by seeking out a quieter life. https://t.co/OcmQAM25La The story of a parent's transition and a son's redemption: https://t.co/txfchZLn3u @paulaswilliams2 @the_jonathanw #PrideNYC https://t.co/x9pKeKOhGg Our 2019 summer reading list is finally here! What books are you excited to dive into this summer? https://t.co/iYLM1TN16m Do yourself a favor and let go of some of your misconceptions about casual sex. https://t.co/qRiYG2bD64 \"I harnessed all of my insecurities and self-doubt and let it flow through the words that came out of my mouth. I was cheeky. I was loud. I was angry. And for this, I was perfect.\" — @Maisie_Williams on auditioning for #GameofThrones https://t.co/AHHoTEFpet Myth 1: Women are biologically less interested in casual sex.\nMyth 2: Monogamous sex is better and safer, and monogamous people have better relationships.\nMyth 3: Sex is immoral and dangerous.\n\nHere's what the research actually says:\nhttps://t.co/kqnm6oVQf9 Traffic, construction, your neighbor’s lawnmower and other loud noises can have a surprising impact on your health. Here’s how to get a little more quiet in your life: https://t.co/qAlOZ0GoAJ \"The clitoris is not a button, it is an iceberg.\" Everything you never knew about the clitoris: \nhttps://t.co/4jRP3lnun4 What is it about love that pulls certain people to each other? 5 TED speakers examine how we love and the mystery of connection in this episode of the @TEDRadioHour. https://t.co/xnKFSWuumT Can we still save the ocean? Dive into the fascinating, horrifying and hopeful story of the ocean on the latest episode of #TheTEDInterview. \n\nListen on @Spotify: https://t.co/sk3Q6KTycN https://t.co/A0gTZzzTBD \"At @GhettoGastro, we don't run from the word 'ghetto,' and we don't run from the ghetto. Because at the end of the day, Ghetto Gastro is about showing you what we already know: the hood is good.\"\n\nWatch Jon Gray's full TED Talk here: https://t.co/7DYh6fIi88 https://t.co/emi5wedJtL RT @baratunde: You are not alone in your loneliness (Jonny Sun | TED2019) https://t.co/39nRyY3z9Q via @TEDTalks RT @GhettoGastro: YERRRR! \nBringing the Bronx to the World via @TEDTalks stage. https://t.co/caYn7R97Gp https://t.co/f9KqX1Nl5V \"What is @GhettoGastro? It's a movement and a philosophy. We view the work we do as gastro-diplomacy, using food and finesse to open borders and connect culture.\" \n\nWatch Jon Gray's full TED Talk here: https://t.co/7DYh6fqHgA https://t.co/jkW0UY9NNJ The next big thing is coming from the Bronx, again: https://t.co/zy7LpacMHo @GhettoGastro https://t.co/x5BDChE85j RT @jonnysun: THANK YOU FOR COMING TO MY TED TALK!!!!!!!!! RT @iSmashFizzle: Just got to watch the homie @jonnysun’s TED talk. Didn’t think I could love him more, but after this? I already do. Thank… \"Self-loathing left a void, and celebration needs to fill and overflow it.\"\n\nWatch @Andrew_Solomon's full TED Talk on why we still need #Pride: https://t.co/MAhl9Zf0dX #Stonewall50 #WorldPride https://t.co/7iwG9Xye8F \"Being cured is not where the work of healing ends. It's where it begins.\" @suleikajaouad https://t.co/stfdr6cErn \"My identity is not my obstacle. My identity is my superpower.\" @AmericaFerrera https://t.co/5TH7Dh2QFi \"Who we see thriving in the world teaches us how to see ourselves, how to think about our own value, how to dream about our futures.\" @AmericaFerrera https://t.co/VQHRtUyPlz \"Just because things look more equal than they did in the 20th century, doesn't mean that things are equitable at all.\" @rnz1 https://t.co/nIWsMpYz7v \"Acute physical pain ends relatively quick; complex emotional pain does not.\" @eubanksaustin \nhttps://t.co/a97wV7M3fg RT @jonnysun: hello! this is my TED talk. i spoke about how being open and vulnerable with our sadness and loneliness can bring us closer t… Astonishing footage of the camouflaging abilities of cephalopods, which can change their skin color and texture in a flash: https://t.co/0jCYlqxZT9 https://t.co/ooEeSWKPKP \"Addiction is the only disease where we commonly wait until it's at the highest levels of acuity before we try to do something about it. And by then, it's often too late. We have to start sooner.\" @eubanksaustin \nhttps://t.co/YXGjFwy8YA A pediatric nurse shares her experiences helping parents cope with unexpected complications during pregnancy. \n\nListen to the latest episode of Sincerely, X here: https://t.co/8YQLuX5IXB https://t.co/XcrY78kSNu RT @brosandprose: BIG NEWS IN MEMES. \n\n\"Hide-the-pain Harold\" is a really nice man from Hungary who was extremely baffled when a stock phot… RT @dylanmarron: .@jonnysun is an angel and here he is distilling his angelic existence into a concise TED talk!!! https://t.co/a62UdeqCtQ \"90 percent of the help that coworkers give one another in the workplace is in response to explicit requests for help.\" @heidigrantphd https://t.co/Zb6M1LfMt1 Next time you’re frazzled and need a motivational pep talk, give one to yourself in the second or third person. This can help you look at the situation from a logical, objective perspective rather than an emotional, biased one.\nhttps://t.co/VhgH2gRTIw \"When I see someone share their vulnerabilities, it makes me feel allowed to be more vulnerable.\" \n\nWatch @jonnysun's new TED Talk about finding your community here: https://t.co/xJSyFAbqNq https://t.co/UDpPBXrGdi The internet isn't perfect, but it can be a beautiful place to discover who you are and that you're not alone.\n\nWatch @jonnysun's full TED Talk here: https://t.co/xJSyFAbqNq https://t.co/6a5QNuDvyA You are not alone in your loneliness: https://t.co/q3kVpLMTta @jonnysun https://t.co/KMYBXvU4g8 \"In these dangerous and unsure times, in the midst of it all, I think the thing that we have to hold on to is other people.\"\n\nWatch @jonnysun's full TED Talk about vulnerability and finding your community here: https://t.co/xJSyFAbqNq https://t.co/nB3SBzWxim \"To bloom, we must learn not to fear self-doubt but to embrace it as a naturally occurring opportunity for growth and improvement.\" https://t.co/VR7rO6ePXf Meet the queer Mr. Rogers for the next generation of kids: https://t.co/LoZ8AFeGNj \"How can a retired engineer become a meme? It's a strange story with some interesting twists.\" \n\nMeet the man behind the \"Hide-the-pain Harold\" meme. Just trust us, you want to. https://t.co/yJsK4kywFr \"There's something mysterious and gorgeous just about the way a poem looks. The empty space is as important as the words themselves.\" @kuokuomich https://t.co/hzHAOBJPZ9 What almost dying taught me about living: https://t.co/OHAmpMRlrr @suleikajaouad https://t.co/slVV5Js59I \"Hide-the-pain Harold is a role. It's not really me, it's given to me by the internet people.\" https://t.co/tItzrHJ6TT A pediatric nurse shares what she wishes parents knew about the heart-wrenching challenges of having a premature baby. \n\nListen to the latest episode of #SincerelyX here:  https://t.co/hgG9KWFF9V RT @jonnysun: hi everyone!! my TED talk is going online on thursday. here are some photos of it! watch this space!! i can't wait for you to… \"You can be held hostage by the worst thing that's ever happened to you and allow it to hijack your remaining days, or you can find a way forward.\" @suleikajaouad https://t.co/1Kd01hn4jo What it's like to be on a jury that gives someone the death penalty: https://t.co/CnQ5IkjY9r .@j_lindenberger never got vaccinated as a kid. So one day, he went on Reddit and asked a simple question: \"Where do I go to get vaccinated?\"\n\nWatch his full TED Talk here: https://t.co/eAt73rLQRe https://t.co/9jDiQaGy0D RT @TEDchris: Excited to share this episode of #TheTEDInterview featuring the iconic marine scientist and lifelong advocate for the oceans,… One day you're a retired engineer in Hungary. The next, you're a viral internet sensation. https://t.co/eTSEFPkzxy Three things to never say when you ask someone for help:\n\n\"I'm so, so sorry that I have to ask you for this.\" \n\"I really hate bothering you with this.\" \n\"If I had any way of doing this without your help, I would.\" https://t.co/S38t3D8lO0 Do you hate asking for help? Here's how to get over your fear: https://t.co/Vtv5WUOlOc How to ask for help — and get a \"yes\": https://t.co/wnJpYN8wFt @heidigrantphd https://t.co/71diXG6A1R \"How many of you have written a letter to somebody you feel you have let down?\" @kuokuomich https://t.co/YUHeMvLtcX Octopus, squid and cuttlefish — collectively known as cephalopods — have strange, massive, distributed brains. What do they do with all that neural power? https://t.co/sU0D0L56DD Learn about the smart skin of octopuses, squid and cuttlefish: https://t.co/AAmvoVYJsT https://t.co/9JQY3oQ1Xy TED is looking for remarkable individuals from all disciplines – technology, art, science, humanities, film, music and beyond to join our next class of TED Fellows. \n\nApplications are open now through August 27: https://t.co/inQ3gwrkDz https://t.co/e8jmmOLhIx \"I am just one of millions of people who have been told that in order to fulfill my dreams, in order to contribute my talents to the world I have to resist the truth of who I am.\" @AmericaFerrera https://t.co/cw0rxHOVzn As a queer teen in Kansas, @Snacpack struggled to feel safe and valued in the world. But then she found @ThatKevinSmith's rom-com Chasing Amy and saw herself represented on screen for the first time. #ChasingChasingAmy #Pride https://t.co/BpbolsKPmA \"When marginalized people talk about the need for representation in media, we're not being hyperbolic. Seeing yourself on screen endows you with the feeling of existing in the world.\" @Snacpack #ChasingChasingAmy #Pride https://t.co/evcaTrJwIH One great way to celebrate #Pride is to help document LGBTQ history. Here's how: https://t.co/dEVOpkj3Az #StonewallOutLoud \"My mom was misinformed and misled by sources that convinced her that if she was a loving parent, she wouldn't vaccinate.\" @j_lindenberger https://t.co/PM2rm3fNjK \"This is one of those rare times when it's incredibly productive to freak the hell out.\"\n\nWatch @Rob_Reid's full TED Talk about the danger of synthetic biology here: https://t.co/DQe4aFv2Ou https://t.co/N1UZNyRBdx Why we need to fight misinformation about vaccines: https://t.co/ffdzNqUNi7 @j_lindenberger https://t.co/DF3RvoSJCl RT @j_lindenberger: My ted talk is finally out! Check it out by clicking the link below! https://t.co/ScMWKR21RM .@j_lindenberger's parents fell victim to anti-vaccine misinformation and never vaccinated him as a child. When he asked Reddit how he could get vaccinated at age 18, his story went viral. https://t.co/6IMy552664 Watch the first TED Talk by a digital human: https://t.co/PpWyIiT3G9 Writing a haiku every day can help you discover the hidden joy in your life: https://t.co/u07IbOhONY @haolechild We'll be your friend, Jessica!! We have a new TED Talk Recommendation tool! https://t.co/a2WVARh6Oe https://t.co/m6D3hYgWMo \"Tattoos can give us new abilities that we don't currently possess. By upgrading the particles, we can engineer tattooing so that it will change not only the appearance of our skin, but also the function of our skin.\" https://t.co/GL9CR70Tq6 Getting people to do what you want them to do requires telling these 3 stories: https://t.co/WDFmhpwI8H Tattoos aren't just beautiful — they could also give you superpowers. https://t.co/AuzBbAHsWA \"Writing haikus brought me back to something I hadn’t felt for a long time — the sheer, elemental joy of playing with words.\" https://t.co/sKEfIJjjRl I wrote a haiku every day for a week — here’s what I learned: https://t.co/8SSpn5NxF0 https://t.co/pyID7vvkrz This is one of those tech demos you have to see to believe. https://t.co/bLmDUQN2Oz What you need to know about power so no one can take advantage of you: https://t.co/7QCGTavmli This unbelievable new technology brings us one step closer to personal devices that we can control with our minds: https://t.co/JTxKSIh25q How AI could become an extension of your mind: https://t.co/mU48x3XtAP RT @MicahEames: One haiku a day:\nA challenge and a delight\nWe should all indulge\nhttps://t.co/J0BQZEDHUr How we can break out of boys-are-blue and girls-are-pink stereotypes when raising our kids: https://t.co/SlqSQJ5dS2 Reflect on the last meeting you were in: Who spoke? Who took up the majority of the airtime? Who was checking their messages when a certain person was talking, and then started paying attention when someone else was talking? https://t.co/7DAhfK2Rg8 Why kids need to learn about gender and sexuality: https://t.co/HJSnrunDd2 @lindzamer @queerkidstuff https://t.co/MBSlHFh85z Many people are caregivers for their sick parents, partners or friends, with an unfortunate consequence: They end up suffering too. https://t.co/jFUvtqRWbE RT @TEDTalks: \"My question to you is, is this what you want? Is this how you want history to remember you? As the handmaidens to authoritar… Watch this TED Talk if you feel overwhelmed by the universe: https://t.co/sRXyx6UfdQ #MondayMotivation @kaysarahsera https://t.co/RFwAsCdEmE Why good bosses never give advice: https://t.co/ccMA8GdmwU How to run a meeting that doesn't suck: https://t.co/xpZjYsCqnP #MondayMotivation \"You'd never trust your surgery to the man on the street. You'd want an expert who spent years doing surgery and knows the best techniques. That should apply to every major decision. Politics, business, health advice require expertise.\" https://t.co/Lj2PjqF3FL Why fewer people are choosing to be parents — even when they want to have kids: https://t.co/g3I679dlK6 @WajahatAli Caregivers: Make a list of dependable relatives, friends, colleagues or other people whom you can call on to help you talk through challenging decisions or experiences, lend a hand with day-to-day tasks, or simply listen as you vent. https://t.co/UOZaPUDS4V Ask yourself, “Where does it hurt?” and “What’s the worst part of it?”  https://t.co/f6eMTgd2oC Reddit. Google. Airbnb. What makes a great (or terrible) startup name: https://t.co/WBGBUhHSe2 Grilling this weekend? This is the future of plant-based and cell-based meat:  https://t.co/tjnNEyCfVt The ancient building techniques behind Stonehenge and Easter Island: https://t.co/Rraji58QGV \"You don’t need to work for an organization that saves lives to find meaning and purpose in what you do.\" https://t.co/8cYMYHCTsv 25 TED Talks that will change how you see the world: https://t.co/pELNTaH1XZ 4 TED Talks to help you stop being such a perfectionist: https://t.co/Dh1WhYeirZ 8 TED Talks to watch when you feel like a misfit: https://t.co/lpbVJHk9Kh 17 helpful TED Talks for new parents: https://t.co/UibmscS30v How to get over the end of a relationship: https://t.co/I0ROSiIQ3K How do you \"move on\" after your life takes a sudden turn? 3 TED speakers share how they moved forward in the face of grief, illness, and unexpected circumstances. @TEDRadioHour  https://t.co/5V4Zhe7BrM Being a caregiver can lead to mood swings, exhaustion and irritability, as well as feelings of anxiety and emptiness. Family members caring for a loved one with dementia report high rates of depression. \n\nHere are 6 ways caregivers can fight burnout: https://t.co/pyZhmTzAKR 8 TED Talks to watch when you need to calm down: https://t.co/rDJK6VxiNQ Big news. Stop what you're doing and watch Sarah Kay's new TED Talk. https://t.co/klgNEFBsT7 We're still working on our annual summer reading list for 2019, but you can read our 88 must-read books from last year's list while you wait. https://t.co/Dp91yhkP2N “Your partner should have your back. Their words should build you up, not break you down. They should make you feel more confident, not less.” @Join1Love https://t.co/oEptS3lpM8 What’s the most satisfying job in the world? You’d be surprised. https://t.co/Exe2A3IcG2 The architectural secrets of the world's ancient wonders: https://t.co/MG69ghFSc1 https://t.co/owmjY9lmEp RT @TEDFellow: \"In an era where we design buildings to last 30, maybe 60 years, I would love to learn how to create something that could en… \"The universe has already written the poem you were planning on writing.\" —  Kaveh Akbar\n\nWatch @kaysarahsera's full TED Talk about the poems surrounding us: https://t.co/xdYz5zQJEb https://t.co/1p7SiKNkBF Good news, it's a new poem from @kaysarahsera! This is \"A Bird Made of Birds\": https://t.co/jChpjNrTKA https://t.co/9jGnIEyNNf @Shark_ManDan Break a leg! https://t.co/3dExaJlN51 RT @kaysarahsera: The poem I performed to open the 2019 TED conference is now online! It is called, “A Bird Made of Birds,” &amp; was inspired… \"It's my job to listen to what the universe is showing me and to keep myself open to what the universe offers, so that when it's my turn, I can hold something to the light, just for a moment, just for as long as I have.\" @kaysarahsera https://t.co/eWIFeemhoK Bad news. E-cigs and vapes are basically the Trojan horses of nicotine: https://t.co/V5gVWd98B3 Knowing more than one language keeps your brain healthy, complex and actively engaged. https://t.co/vhw6FgGI87 “Abusive relationships don't start out abusive. They start out exciting and exhilarating. There's an intensity of affection and emotion, a rush. It feels really good.” @Join1Love https://t.co/SOPNnyyML0 We call kids who step outside gender lines “brave.” But if we adults want to support them, we need to show some courage and embrace some discomfort. https://t.co/EDzn5XOW7H How synthetic biology could annihilate the human race: https://t.co/7IRDKbPHDG @Rob_Reid \"This is no time to remain calm. This is one of those rare times when it's incredibly productive to freak the hell out.\" @Rob_Reid https://t.co/M7z4I9xOlM \"Being cured is not where the work of healing ends. It's where it begins.\" @suleikajaouad https://t.co/IVS8TkBQM0 How to take care of yourself when you're caring for someone you love: https://t.co/Lj2AZD47Xz The living tech we need to support human life on other planets: https://t.co/rcsHme1L81 https://t.co/ojfMQ1EROE Strange dreams visited @Nnedi while she was confined for months to a hospital bed. She used these experiences in her strange, fantastical stories to cope — and is now an acclaimed sci-fi author. https://t.co/Kl8fPZD9xJ \"It is far more radical and dangerous to have hope than to live hemmed in by fear.\" @suleikajaouad https://t.co/6CkaP95Y22 RT @lenadunham: I’ve been a fan of @suleikajaouad for years and years, since her column in the @nytimes introduced her incredible wit and b… Why people cheat even when they're happy in their relationship: https://t.co/MVK0tiUzAQ @EstherPerel https://t.co/qlA33iQGnC \"For me, the hardest part of my cancer experience began once the cancer was gone.\" @suleikajaouad https://t.co/Qz5m8MOZnE \"My theory of social change is that society changes when a small group of people find a better way to live, and the rest of us copy them.\" @nytdavidbrooks https://t.co/PmYP6xd6e7 \"You can be held hostage by the worst thing that's ever happened to you and allow it to hijack your remaining days, or you can find a way forward.\" @suleikajaouad https://t.co/T3T3DfvHaa \"Staring your mortality straight in the eye has a way of simplifying things, of rerouting your focus to what really matters.\" @suleikajaouad https://t.co/4IZuh7GUCj \"I felt greater than myself. I felt myself become greater.\" @Nnedi https://t.co/GNnQHLUXG1 Being confined to a bed for months brought isolation and unspeakable pain, but it opened up @Nnedi’s mind to a universe of characters, ideas and stories. https://t.co/VjQRP0yUy6 What does the future of technology hold for our jobs and the economy? MIT's Andrew McAfee shares the terrifying and exciting answer on this episode of #TheTEDInterview. \n\nListen for free on @ApplePodcasts: https://t.co/lq1RY36jDH https://t.co/JmT7kC50pE \"When you go through a traumatic experience, people treat you differently. They start telling you how much of an inspiration you are. They say you're a warrior.\" @suleikajaouad https://t.co/iwWbAXGrPN \"This is more than a memory passed down orally, better than any autobiography. It was a local knowledge penned by a formerly enslaved man’s full grasp of a belief in God, in his humanity and in the justice of being newly free.\" #Juneteenth https://t.co/H46X20Hfec RT @suleikajaouad: It was the greatest honor of my life to give this @TEDTalks. To anyone who has had their life interrupted at some point—… @alewp https://t.co/fxSjlj6ajY RT @TEDbooks: We're excited to announce our latest publication: \"Broken Spaces &amp; Outer Places: Finding Creativity in the Unexpected\" by sci… RT @Nnedi: My memoir BROKEN PLACES &amp; OUTER SPACES is in stores today (@TEDbooks)! My 1st book of nonfiction! 🎆🎉🥳\n\nThis book focuses on That… RT @Nnedi: Heh, it was more the horrid fact of being  paralyzed than being in the hospital, but you get the idea. 😌🔥✨🌪https://t.co/MPcJPmbA… What almost dying taught me about living: https://t.co/GemeLseAQK @suleikajaouad https://t.co/SP3BUkCL7i A letter from a former slave, shared with us by his great-great-granddaughter in honor of #Juneteenth: https://t.co/TODFe9OGwP Wishing a very happy birthday to the one and only @kaysarahsera, TED speaker extraordinaire and the host of our podcast #SincerelyX! \n\nWatch her first TED Talk from 2011 here, and stay tuned for more soon: https://t.co/wkvHVOBiag https://t.co/wZQmOPCAgS RT @TEDTalks: \"Whenever people ask me why trans people are suddenly everywhere, I just want to tell them that we've been here. \"\n\nThis #Pri… How to support a kid who breaks out of gender norms: https://t.co/0Oy0N5j6HO The deeply strange anatomy of the hyena: https://t.co/IW2zdHXH4u https://t.co/ro0VQEjWFG How playgrounds create small worlds of joy: https://t.co/BLFPSNRsdu @TEDx @stefenchow Three-toed sloths poop once a week, take a month to digest a single leaf and fart through their mouths. https://t.co/y9isQB9SAj Watch @EstherPerel's TED Talk if you've ever been cheated on — or if you have been unfaithful yourself: https://t.co/MVK0tiUzAQ https://t.co/jUW2NCSZ0B Y'all, it's time to talk about sloths. https://t.co/SQRb90uArz \"To be racially literate, to understand who we are so that we can heal together, we cannot neglect the heart or the mind.\" @choose_org #TellMeWhoYouAre https://t.co/qpPVUKusQ1 These biological marvels are way weirder than you think. https://t.co/SvmISwLjSw If your manager has an answer for every question you ask, they're setting you up to fail. Here's how: https://t.co/dYYEIxk149 \"Victims of discrimination are not looking for saviors. They're looking for individuals who will support them as they get up and do the best they can to save themselves.\" @MonicaRamirezDC https://t.co/Bmw6WbcA2D Why good bosses never give advice: https://t.co/1cXIFI8EOD In the US, the same blood test can cost $19 at one clinic and $522 at another clinic just blocks away — and nobody knows the difference until they get a bill weeks later. @chcosts is making that data public.\n\nWatch Jeanne Pinder's TED Talk here: https://t.co/VpGyNPPbU4 https://t.co/kiW8aalXRZ “I believe that in the darkness, even there, there will be beauty, and there will be love. And every now and then, it will feel like more than enough.” @KatecBowler https://t.co/Z9JA35E2Gr RT @Rob_Reid: Yes, my most of my new TED talk is terrifying. But the real point is its optimistic ending. We can derail these inevitable bi… How synthetic biology could wipe out humanity — and how we can stop it: https://t.co/ARbRC2WnYe @Rob_Reid https://t.co/KSpsRnvyXB Why are straight women having less satisfying sex than men? Let's talk about the orgasm gap. https://t.co/RZQfApalJj This is why some people are more resilient than others: https://t.co/5TVGtu0tk4 How to stop waking up in a panic every morning: https://t.co/k8wjdbee9Y Advances in protein design could lead to a universal flu vaccine, one shot of which would give you a lifetime of protection against the flu. @UWproteindesign https://t.co/gX9Q2x6GtL Want to wow your boss during your next presentation? Learn how to make incredible slides: https://t.co/8Fhp8EAjlW Watch this if you've ever wondered, \"Why is this happening to me? Aren't I a good person?\" https://t.co/nNLAVpzB4D Here's how to master the art of office diplomacy, even with people you don't like: https://t.co/LD0Jz0Dwkh \"We all want reasons. We want formulas to predict whether our hard work will pay off, whether our love will always make our partners happy and our kids love us. We want to live in a world in which not one ounce of our hard work will be for nothing.\" https://t.co/2nKg2ee4pt Stop arranging your entire life around what you think is wrong with you. https://t.co/lNKhMSgd2l It's time to start believing in yourself. https://t.co/wJMLBA8gFh Having a mentor can make a huge difference in your career — but first you have to find one. Here's how: https://t.co/WXeEGCO0Fs Want a mentor? Learn how to meet someone who can make a difference in your career: https://t.co/A73xFkFrbv Looking to make a big change? These talks will get you started. #MondayMotivation https://t.co/PL9EnwfIKM Is your passion still making you happy? Don't be afraid to leave behind what no longer fits you.\n\nListen to #WorkLife with @AdamMGrant, season two streaming now: https://t.co/V70SoSIIg6 #MondayMotivation https://t.co/vffC98Y7q2 \"When a couple comes to me in the aftermath of an affair that has been revealed, I will often tell them this... Your first marriage is over. Would you like to create a second one together?\" \n\nWatch @EstherPerel's full TED Talk here: https://t.co/MVK0tiCYJi https://t.co/GGX4r7qmRJ 5 challenges we could solve by designing new proteins: https://t.co/ABKn0w7V8y @UWproteindesign https://t.co/fFeDKgnQje Want to make great slides for your presentation?\n\n1. Keep your slides simple and succinct.\n2. Choose your colors and fonts with care.\n3. Avoid visual clichés.\n4. Don’t get bogged down by charts and graphs.\n5. Don’t be afraid of blank slides.\n6. Practice!\nhttps://t.co/mKe1ozL27Z Artist @daniellismore lives his life as a work of art. His clothes are constructed out of materials ranging from beer cans and plastic crystals to diamonds, royal silks and 2,000-year-old Roman rings. \n\nWatch his full TED Talk here: https://t.co/GCdvMJXk63 https://t.co/JpEhImDA7O In his searing TED Talk about corporate immorality, @hamdiulukaya calls for the end of business leadership motivated only by profit. https://t.co/y3fD8jWjOb \"My theory of social change is that society changes when a small group of people find a better way to live, and the rest of us copy them.\" @nytdavidbrooks https://t.co/PiVbrIzWyr \"Confidence is a concept you can choose. I've come to realize that authenticity is necessary, and it's powerful. I've tried to spend time being like other people. It didn't work. It's a lot of hard work, not being yourself.\" @daniellismore https://t.co/eAorIgDxmr These weird, slow microbes may actually have the answers to some of the greatest mysteries of life on earth. @archaearama https://t.co/czdc0LYWf3 \"I am art. I have lived as art my entire adult life. Living as art is how I became myself.\" @daniellismore https://t.co/dekEeJK026 https://t.co/n6Xqd8pWG3 This is what it's like to be a transgender dad: https://t.co/IMk7kzSYFm #PrideMonth \"Joy is not the expansion of self, it's the dissolving of self. It's the moment when the skin barrier disappears between a mother and her child. It's the moment where you're so lost in your work or a cause, you have totally self-forgotten.\" @nytdavidbrooks https://t.co/XkkR7wF926 \"When we see someone different from us, they should not reflect our fears, our anxieties, our insecurities, the prejudices we've been taught, our biases — we should see ourselves. We should see our common humanity.\" @MichaelDTubbs https://t.co/jSGHFv3rCZ \"This is the difference between return on investment and return on kindness. This is the difference between profit and true wealth.\" @hamdiulukaya https://t.co/sXtjOBFRhc The story of Marvel's first queer Latina superhero: https://t.co/2dbO1XZvzS @QuirkyRican #PrideMonth https://t.co/G13K5IiaMV In a century when most developed nations will see populations decline, Canada will continue to grow. Here's why: https://t.co/rsQFGL7s0Q Take a look at the cutting-edge flood resilience infrastructure coming to New York City: https://t.co/HUq10AccSq @BIGstertweets \"Everyone is capable of creating their own masterpiece. You should try it sometime. It's quite fun.\" @daniellismore https://t.co/nAvBmdDd22 \"We used to find out after the extrajudicial police killings. Now, we're getting video of people calling 911. We're moving upstream, closer to the problem and closer to the solution.\" @baratunde #LivingWhileBlack https://t.co/XKHGqQ2Z3K \"True belonging only happens when we present our authentic, imperfect selves to the world.\" @BreneBrown https://t.co/53srQsKX5a RT @MichaelDTubbs: Giving a @TEDTalks was challenging and I was nervous! I decided to talk about what it means to be a good neighbor, and t… RT @common: \"When we see someone different from us, they should not reflect our fears, our anxieties, our insecurities. We should see our c… \"Something is structurally wrong when people working two and three jobs, doing all the jobs no one in here wants to do, can't pay for necessities, like rent, like lights, like health care, like childcare.\" @MichaelDTubbs https://t.co/NmcV3bdxul \"True belonging only happens when we present our authentic, imperfect selves to the world.\" @BreneBrown https://t.co/Y5AsrvQKT9 Want to wow your boss during your next presentation? Learn how to make incredible slides: https://t.co/Om3r4FoNk1 \"It's a lot of hard work, not being yourself.\"\n\nArtist @daniellismore lives as a walking masterpiece. Watch his TED Talk here: https://t.co/GCdvMKeUXB https://t.co/nMkRU4ppIS The next time you feel yourself getting angry, don't try to turn it off. Listen to what your anger is telling you. @rycmart https://t.co/Hq3v0aZHEt \"With the endless and well-publicized stories of billionaire college dropouts, we romanticize entrepreneurship. But before you step into the cage of chaos monkeys, ask yourself and some people you trust about your personality and skills.\" @profgalloway https://t.co/rRu92bPDBp \"With the endless and well-publicized stories of billionaire college dropouts, we romanticize entrepreneurship. But before you step into the cage of chaos monkeys, ask yourself and some people you trust about your personality and skills.\" @profgalloway https://t.co/60F2JgFHqk \"When you have one of those bad moments in life, you can either be broken, or you can be broken open.\" @nytdavidbrooks https://t.co/CAqsXCaSJs These scent playlists could boost your health and well-being: https://t.co/xfp8UHEf73 What if you could curate a soundtrack of smells to take you through your day? https://t.co/huskH9IHDm \"Who are you? How many versions of you are there? And I have one final question: Are you using them all to your advantage?\" @daniellismore https://t.co/aoVyAb7NMz Mayor @MichaelDTubbs is one of the youngest Mayors in the U.S., and he's shaking things up in his hometown of Stockton, California.\n\nThis is his simple but brilliant vision for helping people thrive. Watch his full TED Talk here: https://t.co/glK9ZvX6YP https://t.co/bVFmvPS210 This is the moment when you find your purpose in life: https://t.co/JLltX6yU0e? Mayor @MichaelDTubbs of Stockton, California asks an important question: What are we prepared to do today to create a better, more equal future? \n\nWatch his full TED Talk here: https://t.co/glK9ZvX6YP https://t.co/t0XA8NItgw RT @MichaelDTubbs: I had the honor of giving a @TedTalks about how our work is reinventing Stockton thru structural change. This is a great… The political power of being a good neighbor: https://t.co/e0tuRdCzOG @MichaelDTubbs https://t.co/jP4CLJDU8F Anger is a powerful and healthy force in your life. @rycmart https://t.co/Ze4SFXZmWH Want to make amazing slides for your next presentation? Banish those phony stock photos. You know which ones we're talking about. https://t.co/bx6eQjX36E https://t.co/9c39bMizK6 Every hyena clan is a matriarchy ruled by an alpha female. In the clan’s strict power structure, dominance passes down the alpha female’s line to her cubs. https://t.co/P2nR2EUMTb Every hyena clan is a matriarchy ruled by an alpha female. In the clan’s strict power structure, dominance passes down the alpha female’s line to her cubs. https://t.co/LVUOgpmgb2 4 key pieces of feedback that children wish they could give their parents: https://t.co/9625Mm7Cmj 6 dos and don’ts for next-level slides, from a TED presentation expert: https://t.co/HhWCtHjXrb Too many leaders simply don’t know how to lead. https://t.co/thRxoO8Boj Introverts bring extraordinary talents to the world, but they're often overlooked. Writer Susan Cain shares ideas for better offices, schools and relationships built with introverts in mind.  \n\nListen to #TheTEDInterview for free on @ApplePodcasts: https://t.co/yM581XtFpk https://t.co/YsoQTQQHx4 4 key pieces of feedback that children wish they could give their parents: https://t.co/1bEqslnDqT Watch @priyaparker's new TED Talk about how to host a truly transformative gathering: https://t.co/jklaHzQAno #TheArtofGathering https://t.co/awJNZGDR2G Canada's attitude towards refugees and immigrants has set it apart — and other countries should take note if they want to thrive. https://t.co/9LgzgC1mGA “How does life change when you choose to be unapologetically yourself?”\n\nArtist @daniellismore lives as a walking masterpiece, inspiring others to find the confidence to be who they truly are. \n\nWatch his full TED Talk here: https://t.co/GCdvMJXk63 https://t.co/Sucux4l318 RT @TEDchris: Really important point made by @susancain in latest episode of #TheTEDInterview https://t.co/syZCBSUXJF... https://t.co/73k9j… Too many leaders simply don’t know how to lead. https://t.co/fWioGLTM8I My life as a work of art: https://t.co/hRItxYquQ9 @daniellismore https://t.co/ZiflP4L4HK \"Being resilient means you face stressors, not eliminate them. To be resilient means you learn from your mistakes, not avoid making them.\" https://t.co/zZqf6PtJ8p This magnificent art is absolutely gigantic. https://t.co/VvKNAjFujG https://t.co/JMMHtgMvU7 \"Anger is a powerful and healthy force in your life. It's good that you feel it. You need to feel it.\" @rycmart https://t.co/odXDgbsWJ8 Unlock a new you. https://t.co/WuZ4Bfyahk This is why some people are more resilient than others: https://t.co/lXedKfICro How your voice betrays your emotions: https://t.co/ND0GnxMs3c \"I was a really anxious kid growing up. I couldn't sleep. I would stare into the darkness and I just kept thinking about everything. My brain was like a radio that someone had left on all night.\" @sczanella https://t.co/wGNQgnSx7u 14 TED Talks to help you be your best self: https://t.co/86OvayKRIK \"I made a choice today to reveal a part of myself that I have hidden for too long. I hope that this means I will never hide again.\" #PrideMonth \n\nIn this unmissable TED Talk, Morgana Bailey comes out as a lesbian to an audience of her co-workers: https://t.co/fhVkYtkfcz RT @TEDTalks: \"Confidence is a revolutionary choice, and it would be our greatest shame to see our best ideas go unrealized and our brighte… How do you keep going after failure? In the moments when you ask yourself, \"Why am I doing this?\" think about this: https://t.co/4Zu6liLdqo RT @HelenWalters: The clearest, most uplifting analysis of what's going on (miles) beneath our feet, or, why microbes and @archaearama are… RT @TEDchris: This was an uplifting conversation with my fellow introvert @susancain who's done so much to champion the cause of introverts… What happens when a black man visits the whitest towns in the US? @IamRichBenjamin shares his funny, raw stories: https://t.co/t6Pzdd13ZH Millennials are not a monolith. They're the largest and most diverse adult population in the United States. @rnz1 https://t.co/nwDPxwwg49 \"Structural racism is baked into America’s national psyche and behavior.\" @IamRichBenjamin https://t.co/0FS5SGiJKQ Cremation uses the natural gas equivalent of a 500-mile car trip. Here's a better option: https://t.co/tXzUyovEQn @TheGoodDeath How can you change a crushing defeat into a stepping stone? TED speakers share how they turned moments of failure into something greater in this episode of the @TEDRadioHour. https://t.co/lEiR7IjdM6 \"Freedom is not an ocean you want to swim in, it's a river you want to get across, so you can commit and plant yourself on the other side.\" @nytdavidbrooks https://t.co/JnYa1CORWe The relationship between the Earth and the Moon is unlike anything else in our solar system. This groundbreaking theory explains what makes it so special: https://t.co/sqWzJZstzt \"Human connection is as threatened by unhealthy peace as by unhealthy conflict.\" @priyaparker https://t.co/secjlUIBjD .@AmandaPalmer opens up about facing criticism and sharing deeply personal truths through her music. \n\nLearn more about one of the most unique voices in music on this episode of #TheTEDInterview. Listen on @Spotify: https://t.co/lIfidTF2Dy https://t.co/6lnUXZroa8 RT @TED_ED: Hey TED-Eders! We wanted to give you a peek behind the animation curtain to see how today's lesson on witch hunts went from pap… From fake meat to courageous teens, is there anything that can save us from the worst of climate change? \n\nGreta Thunberg and other brilliant minds dive into the battle for our planet in this episode of the @TEDRadioHour. https://t.co/BsWlva6fZI \"Gatherings, at their best, allow us to be among others, to be seen for who we are, and to see.\" @priyaparker https://t.co/Bt1xJot0he \"Curiosity doesn’t take anything from you. Curiosity just gives.\" @GilbertLiz https://t.co/Hs6xoBc6mq \"Identify the best, worthiest thing that you love most and then build your house right on top of it.\" @GilbertLiz https://t.co/Yz5qbkooHZ RT @AnandWrites: Most meetings and conferences and parties are “meh.”\n\nHow can you turn them meaningful?\n\nHelp @priyaparker help you. This… RT @priyaparker: Friends, my @TEDTalks is live. Why do some gatherings take off and others don’t? And how can you make sure yours do? #TED2… How do you authentically bring people together? Resist the urge to pretend we’re all the same.\n\nWatch @priyaparker's TED Talk about the art of gathering here: https://t.co/DKTt0LSAOa https://t.co/2onjZ19bb2 3 steps to turn everyday get-togethers into transformative gatherings: https://t.co/oXvVetccnJ @priyaparker https://t.co/wT4QPlht2y Is genius something we are, or something that comes to us?\n\nWatch @GilbertLiz's full TED Talk about harnessing your creativity here: https://t.co/AT0T8be5LK https://t.co/HINOE18yFI \"Perfection is the death of all good things.\" @GilbertLiz https://t.co/XSJWHVEXqk Ask your meeting attendees: \"What’s going well in our meetings? What could be done better? Do you have any specific ideas to improve them?\" https://t.co/W0MHC5n2F2 Why are straight women having less satisfying sex than men? Let's talk about the orgasm gap. https://t.co/IJBLTOu5f2 7 books that shaped @GilbertLiz as a writer: https://t.co/MmkPU12qBR https://t.co/xTdcMCCwsm Breaking eye contact is everything. https://t.co/CrtJrucvKO We don't need fewer meetings. We need better meetings. https://t.co/QH2AHHosXd Watch this if you've ever wondered, \"Why is this happening to me? Aren't I a good person?\" https://t.co/nd26beAU2Z The top 14 characteristics of \"creepy\" people, according to psychological research: https://t.co/lalcRHx55Q \"Your home is whatever in this world you love more than you love yourself.\" @GilbertLiz  https://t.co/BjtWfqRxQj Share this with your boss who runs terrible meetings. https://t.co/UEtSsilZY7 11 TED Talks to watch if you're doubting yourself: https://t.co/LKHpK7O7in The mysterious microbes living deep inside the earth — and how they could help humanity: https://t.co/7cahctETYY @archaearama https://t.co/KxR7m7RGAM RT @archaearama: Here's my new @TEDTalks! It's got microbes. It's got volcanoes. It's got cameos from @d_giovannelli, Carlos Ramirez, @pbar… How a country can have racism without racists: https://t.co/qLzyxWt3f9 @IamRichBenjamin \"In recovery, we often say, you keep what you have by giving it away. Find the courage to lean into the pain, and you can be a force in helping others.\" @eubanksaustin \nhttps://t.co/VjDyobOptD Can you tell when a headline on a health discovery is exaggerated? Play this game to find out. https://t.co/boSGWjjJxv \"Joy is not the expansion of self, it's the dissolving of self. It's the moment when the skin barrier disappears between a mother and her child. It's the moment where you're so lost in your work or a cause, you have totally self-forgotten.\" @nytdavidbrooks https://t.co/MTTxI9y74j We know we should plan for the future, but why is it so hard to actually do it? \n\n5 TED speakers show us how to start preparing for the future, today. https://t.co/2tGZ3Ivf0N .@thejunaverse is on a mission to map every large galaxy in the observable universe by 2060. https://t.co/ngr0njByaB \"Opioids are profoundly more effective at relieving the symptoms of emotional pain than they are at relieving the symptoms of physical pain.\" @eubanksaustin \nhttps://t.co/punfrWOALe Thinking about quitting social media? This man has never had a social media account — and shares 3 reasons why you should join him: https://t.co/qsYYCBVbvx Fascinating perspectives on the LGBTQ experience, from Kenya to Australia:  https://t.co/j23FhNACVT #PrideMonth What LGBTQ life is like around the world:  https://t.co/bfpWwUbtZ6 #PrideMonth “Anything I thought was good or special about me could not save me — my hard work, my personality, my humor, my perspective. I had to face the fact that my life is built with paper walls, and so is everyone else’s.” @KatecBowler https://t.co/N8nA96erho How a country can have racism without racists: https://t.co/qzSk5ZszqQ @RichBenjaminUSA Why everyone should be guaranteed a basic income: https://t.co/H1Om3Aro3K @rcbregman Light pollution isn't just annoying — it's dangerous. https://t.co/tpRj0xYWIU Stop saying you're sorry, unless you're actually apologizing for doing something wrong. \n\n(Or unless you're Canadian. We don't want to risk the ire of Canadians.) https://t.co/1brIVXSntA Want to build your confidence? Here are the three things you need: https://t.co/O4hxQ4XypA “I believe that in the darkness, even there, there will be beauty, and there will be love. And every now and then, it will feel like more than enough.” @KatecBowler https://t.co/MDEV0LjZlO This ornate 240-page book from the 1400s is one of history's biggest unsolved mysteries. The reason why? No one can figure out what it says. \nhttps://t.co/x6x9wBY252 According to research, the \"creepiest\" professions are clown, taxidermist, sex-shop owner and funeral director. https://t.co/ceHqvlBlfY \"We know that in life there are befores and afters. I am asked all the time to say that I would never go back, or that I've gained so much in perspective. And I tell them no, before was better.\" @KatecBowler https://t.co/fPN1d9D9P1 There's one tiny plastic that ocean experts want to ban even more than straws. #WorldOceansDay https://t.co/3D9K41vIjZ This one weird trick will help you spot clickbait: https://t.co/jivB08Vege Happy #PrideMonth, everyone! https://t.co/BScc7TKQ8k This ingenious plan would increase the amount of protected areas in all of the world's oceans by 15 percent. #WorldOceansDay https://t.co/Kh0Q8QvJ5d This ambitious plan would buy out the national debt of coastal nations — and invest that money in saving our oceans. Here's how it works: https://t.co/q4PKByQZN7 #WorldOceansDay @MarkTercek @nature_org \"We all want reasons. We want formulas to predict whether our hard work will pay off, whether our love will always make our partners happy and our kids love us. We want to live in a world in which not one ounce of our hard work will be for nothing.\" https://t.co/22ExTaBmQQ Learn how to avoid being misled by grabby headlines: https://t.co/TeGYW5N2dO Are deception and secrecy always wrong? \n\nIn this episode of the @TEDRadioHour, hear stories of going undercover to explore dangerous territory for the greater good. https://t.co/oM4F6T3PgM Watch this if you've ever wondered, \"Why is this happening to me? Aren't I a good person?\" https://t.co/Ru9S04kXnL Why are straight women having less satisfying sex than men? Let's talk about the orgasm gap. https://t.co/iV9NTd7Qao An ingenious proposal for scaling up marine protection: https://t.co/FhYYSnVZTy #WorldOceansDay @MarkTercek @nature_org https://t.co/qOUoqdbdls The most detailed map of galaxies, black holes and stars ever made: https://t.co/sukxC3ZUDi @thejunaverse https://t.co/7EmX81feEi This is how dogs went from aggressive wolves to humanity's first domesticated pets: https://t.co/t1ntVlpAP2 \"Poverty is not divine necessity. It's human creation. Ending poverty is possible.\" @liztheo @RevDrBarber https://t.co/gz8YOhiQEp These fish are.... we don't even know what's happening here. https://t.co/UcZSZ0OaNc Parents, stop trying to raise happy kids:\nhttps://t.co/NPpzvnF2nl This is how your childhood impacts your DNA: https://t.co/NNi6lsfDQ6 \"When you have one of those bad moments in life, you can either be broken, or you can be broken open.\" @nytdavidbrooks https://t.co/Cj9foUUyOx Breaking eye contact is everything. https://t.co/DadD2vQaiL The healing power of reading: https://t.co/2NVHyP4IDg @kuokuomich https://t.co/1G42tKtEqM How to stop waking up in a panic every morning: https://t.co/W5GmZBxoP2 “'Why' questions trap us in our past; 'what' questions help us create a better future.\"  https://t.co/JJtxTJJrVQ You might wish you could unsee this... but you will never, ever forget it. \n\nWatch @TomThummer and Matthew Broadhurst's full TED Talk here: https://t.co/8oYm1GNSbf https://t.co/mPtlYEtO7U Do your Venmo payments make you look petty? https://t.co/NJfiOxoPm5 The delightful science of baby laughter: https://t.co/MBuw2yoWCJ These incredible disappearing creatures use their unique brains to make over 100 camouflaging decisions in a two-hour forage. \n\nWatch Roger Hanlon's full TED Talk here: https://t.co/RS2viaMJH3 https://t.co/5ShXuGh1fN You may have more control over aging than you think. https://t.co/EfmDUMNtX7 The top 14 characteristics of \"creepy\" people, according to psychological research: https://t.co/piuZVdwIld 11 TED Talks to watch if you're doubting yourself: https://t.co/xFGAGF3Z1U One form of romantic self-sabotage is choosing partners that are just plain wrong for you. https://t.co/ohniUDGOSa Here's how to master the art of office diplomacy, even with people you don't like: https://t.co/K0cC0yaSbh \"Suffering's great power is that it's an interruption of life. It reminds you that you're not the person you thought you were.\" @nytdavidbrooks https://t.co/101RFMbCgZ How will artificial intelligence change your life? Technologist @kaifulee talks about what it really means for the future of work and the high-stakes battle between the West and China over AI. \n\nFind #TheTEDInterview on @Spotify or wherever you listen: https://t.co/pqdoyMU197 https://t.co/nEgZK9gdYB @TheSineadBurke This is so cool!! RT @TEDchris: There are shocking implications in @kaifulee's vivid description of AI progress in the new episode of #TheTEDInterview.  http… 5 TED Talks every new graduate should watch: https://t.co/sKeUcbnKMB What if your brain's bias put someone else in danger? Learn what happened after a woman escaped being killed by her own family in this week's episode of Sincerely, X.  \n\n🔐 Unlock the latest episode on Luminary with our special 3-month trial: https://t.co/kc7MYZu8jL https://t.co/OxkkFRfAh9 Opening up helps you build healthier, stronger relationships with others — and yourself. These TED Talks can help you do it: https://t.co/32vADNPvWx Do you know how to recognize unhealthy love? \n\nWatch @KatieHHood's full TED Talk here: https://t.co/YQkkhYS6zZ @Join1Love https://t.co/FzhwZJDahj The lies our culture tells us about what matters — and a better way to live: https://t.co/70YLBABpTV @nytdavidbrooks https://t.co/FcW1yFGKDc RT @nytdavidbrooks: The lies our culture tells us about what matters — and a better way to live (David Brooks | TED2019) https://t.co/hcsAl… The best way to get a baby to laugh? Research confirms.... it's peekaboo. https://t.co/rezDYyBmHR We love this definition of \"queer\" from @KimKatrinMilan.\n\nWatch @TheMrMilan and Kim Katrin Milan's beautiful TED Talk here: https://t.co/AewFZWYsNe #PrideMonth https://t.co/0sYLYfe4Cc Stop arranging your entire life around what you think is wrong with you. https://t.co/S00ODZys0y RT @CBSThisMorning: The decision to start a family is intensely personal. But have you ever considered how having kids affects your friends… \"Dictators feed on propaganda. They like giving the impression that they are the saviors, and without them, the country will fall apart. And they are always fighting some foreign forces.\" @Farida_N https://t.co/HLWNpWu6pU The world is lying to you about your body. Teach your mind to see things differently: https://t.co/zadskGLZdR How to encourage kids to think critically from an early age: https://t.co/EYlvwoD7GP The three things you need to make a marriage work, and how to spot them while you're dating: https://t.co/5ZAV56dNJd Learn how to read faster without missing a detail. https://t.co/TSXfrXRzHe If you frequently forget people's names even though they told you minutes ago, this is for you: https://t.co/dDrEiufr9J These are instant red flags: https://t.co/RWQEceM8Xq A reminder to tell your friends why you love them. https://t.co/WjMZmF1k7Y Fill in the chart to see what's in the way of your happiness:\n\n1. What are you doing that you want to do?\n2. What are you not doing that you want to do?\n3. What are you doing that you don’t want to do?\n4. What are you not doing that you don’t want to do?\n\nhttps://t.co/4lHeRefBpZ https://t.co/UrAiL54fSr \"I get terrified when I have a chatty taxi driver, hairdresser or plumber. I get terrified in most conversations. I'm terrified of checking my email, and I'm absolutely petrified about talking on the telephone. I don't get stage fright, I get life fright.\" https://t.co/c3Y5X6woK7 Here's how to outsmart your mental blocks and actually get things done: https://t.co/dYzptkgCjR RT @CBSThisMorning: WEDNESDAY: @NYTimes contributing op-ed writer @WajahatAli will join us live on @CBSThisMorning to discuss his latest @T… Squids are freaky, y'all. \n\nWatch Roger Hanlon's full TED Talk about the camouflaging abilities of cephalopods here: https://t.co/gEEcOiv5Rs https://t.co/Bz6un8nL36 RT @TED_ED: #EidMubarak everyone! \n\nIn celebration of the end of Ramadan, brush up on the beautiful and complex geometry of Islamic design… \"Sleep is not like the bank. You can't accumulate a debt and then hope to pay it off at a later point in time.\" @sleepdiplomat https://t.co/mD5EGDPmPQ RT @kaysarahsera: Episode 5 of #SincerelyX is here. 🚓 “Lethal Doubt”: A woman escapes being killed by her own family. The police don't prot… RT @ReeseW: This is what I needed today ! Thank you @AmericaFerrera for sharing your incredible story about your career &amp; the importance of… \"Everything happens for a reason\" — and other lies I've loved: https://t.co/m0J4ScZf3m @KatecBowler https://t.co/orZ9FedpEO This is what's going on in your brain when you feel a \"spark\" with someone: https://t.co/Ws3N9xlc9C \"Whenever people ask me why trans people are suddenly everywhere, I just want to tell them that we've been here. \"\n\nThis #PrideMonth, learn about the long and beautiful history of the transgender community. Watch @nourypublic's full TED Talk here: https://t.co/HC3fy5NJHZ https://t.co/GzrEtuP8u3 How to talk about mental health without discrimination and stigma: https://t.co/3sqA3pwEzX Feeling stuck? Here's how to outwit the mental blocks holding you back: https://t.co/pwx1Xf9ixY You've probably taken aspirin or ibuprofen for everyday aches and pains, but do you know how these pain relievers actually work? https://t.co/YDpgy5wEQi These tips can help you make sure you’re eating because you’re hungry, and not just because you’re bored. https://t.co/I7d6HcGkTp Answer these 10 questions to find out how much perfectionism is holding you back. https://t.co/Sc2vptgqSZ The brain science behind why teenagers make questionable life decisions: https://t.co/kHPY5gvAD9 9 hard-to-kill plants that you should adopt to brighten up your desk: https://t.co/degVzRtWeo RT @UniteThePoor: “We must have a sustained moral movement that engages in broad fusion of people from every walk of life…If we have a diff… Your thinking patterns impact how you see yourself. Here's how to work through some of the ones that don't serve you. https://t.co/hPlTehJZvX \"I used to think I would know myself to be mature when I could simply be gay without emphasis. But self-loathing left a void, and celebration needs to fill and overflow it.\"\n\nWatch @Andrew_Solomon's full TED Talk on why we still need #PrideMonth: https://t.co/MAhl9Zf0dX https://t.co/OSWRxeLDlH \"My identity is not my obstacle. My identity is my superpower.\" @AmericaFerrera https://t.co/o9ni17EuYZ Floating cities, the LEGO House and other architectural forms of the future: https://t.co/lpqkdRYKSl @BIGstertweets \"Stories of black millennials, brown millennials and all millennials of color really need to be told, and they also need to be listened to.\" @rnz1 https://t.co/m0EBtAsvTg This designer wants to integrate technology into everyday objects — like a jacket you can use to answer phone calls or a houseplant you can play like a keyboard. https://t.co/vlpHqfgrtD Current treatments for depression and PTSD only suppress symptoms, if they work at all. What if we could prevent these diseases from developing altogether? @RebeccaBrachman https://t.co/sACVEWJgNu \"Change will come when each of us has the courage to question our own fundamental values and beliefs.\" @AmericaFerrera https://t.co/euPsl8wUKP \"My advice would be to slow down. Take the time to figure out something you are really passionate about.\" @sundarpichai, CEO of @Google https://t.co/fpGPfW2VAB The case for curiosity-driven research: https://t.co/YRiorvupt1 @suziesheehy https://t.co/xEZhUivITY Can we cure genetic diseases by rewriting DNA? https://t.co/PDSfVevMJI @davidrliu The story we tell about millennials — and who we leave out: https://t.co/VZnFbawlZv @rnz1 Where is it?! Inside an octopus’s quest for disappearance: https://t.co/ncv8N4Gu74 https://t.co/h01d8KbOSH When technology can read minds, how will we protect our privacy? https://t.co/AH6OqU3EpL @NitaFarahany https://t.co/8EsPE4i8vC Here's our challenge for you. As much as you are able, take a step back from the apps and notifications that distract you from what matters. https://t.co/HY6B24j1ON We were heartbroken to learn that restaurateur and civil rights advocate Leah Chase passed away yesterday. In her TED Talk, she shared her wisdom from a lifetime of activism, speaking up and cooking. https://t.co/mpudTtlzGG \"Just because things look more equal than they did in the 20th century, doesn't mean that things are equitable at all.\" @rnz1 https://t.co/G8DNKfBXFV \"Breathe slowly, don't try to blink, don't be self-conscious. Be relaxed.\" https://t.co/tQ58fB9ZDb Skeptics are everywhere. This is what you can learn from their constant questions: https://t.co/Q6gS6KfHZY The stereotypes you might miss when you read sports news: https://t.co/OPFwyF4sqq These TED Talks will help you process your burnout. https://t.co/UU5FenLTAF Slowing down is an art. This is how you master it: https://t.co/B64gxrSLfB Seriously, use your vacation days.\nhttps://t.co/CYxr1u7Dhr Take a load off and relax with these soothing TED Talks. https://t.co/S5ix59bILr Strengthening your skepticism muscles will teach you a lot about the world. https://t.co/oX5fc47Ide Everything you need to know to let that person go for good. https://t.co/GD1VKi9q3y Speed reading is a superpower that you can turn on and off. Learn how to strengthen it: https://t.co/W8fxRx0oHl The secrets to a truly restorative vacation: https://t.co/HmpOxfYGo5 https://t.co/xghP0BiAZt 3 techniques to speed up your reading: https://t.co/aPslCYn7io We all doubt ourselves sometimes. Here’s a reminder that you’re enough. https://t.co/tVe8kwUY16 If you yawned while reading this tweet, congratulations! Your mirror neurons are working. https://t.co/vv8gntAdTy 8 TED Talks on how to find, and be, a good mentor: https://t.co/dwBYIDzddV 4 books to read if you’re fascinated by the inner lives of well-known people — and 74 other great reads: https://t.co/fTApqbp26r Don't let self-doubt hold you back. These TED Talks can help you see yourself in a new light. https://t.co/IlV3B51BWL How to be a better news consumer:\n1. Stop reading incomplete breaking news reports.\n2. Turn to experts &amp; trustworthy journalists for analysis, not trending Twitter hashtags.\n3. Read arguments against your political position to deepen your understanding.\nhttps://t.co/rXhAmnnKAR Here are your must-reads for 2019: https://t.co/ymuToTiEvB Is it better to take one long vacation or a few short ones? Let's check the research: https://t.co/OlLNBgn2lM RT @rnz1: I have a @TEDTalks out today about black millennials!!! https://t.co/4rRx8OnLnr Instead of having an answer to every question, the most effective leaders are coaches — people who can guide others to arrive at their own solutions. https://t.co/Sed0GhtuOq \"The skills that get someone elevated to a top job may have little to do with their ability to guide and inspire others.\" https://t.co/ktZOZ5U6rJ Hyenas’ big brains enable them to recall each member’s voice and status, ensuring they have the political savvy to recognize friend from foe and negotiate their strict social hierarchy. https://t.co/u3uPfjHgkd Hyenas are the underrated feminist icons of the animal kingdom. https://t.co/9RnYZU53ds \"I've realized that discovery is mostly a process of finding things that don't work, and failure is inevitable when you're pushing the limits of knowledge.\" https://t.co/U2L9NolSGc Too many leaders simply don’t know how to lead. https://t.co/yOPGEQgyMB There is not just one sex talk parents need to have with their kids. https://t.co/CQ22BUYwxH Every hyena clan is a matriarchy ruled by an alpha female. In the clan’s strict power structure, dominance passes down the alpha female’s line to her cubs. https://t.co/8fQJFkMGGd How to get over the end of a relationship: https://t.co/v3c9JeJkNg How do good leaders give advice? They don't. https://t.co/S3zTxha0lv RT @melindagates: 1 in 3 women will experience relationship abuse in their lifetime. Abuse can sneak up on us, disguised as unhealthy love.… What it takes to launch a telescope: https://t.co/U5llcVVvD7 @ErikaHamden https://t.co/IyFi37j7iZ How do you live a more meaningful life? \n\n@nytdavidbrooks explores what life has taught him about the value of community and connection in this episode of #TheTEDInterview. Listen on @Spotify or wherever you get your podcasts: https://t.co/uh7XIFrhJs https://t.co/3jw9X7WB2Q Chill out today with this haunting @anebrun performance: https://t.co/uHPdvKsDN6 \"Confidence is a revolutionary choice, and it would be our greatest shame to see our best ideas go unrealized and our brightest dreams go unreached all because we lacked the engine of confidence.\" @MsPackyetti\n\nWatch her full TED Talk here: https://t.co/cyKEey9lbh https://t.co/yro5nXGeso A small-town preacher with a radical secret — he doesn't believe in Hell. \n\n🔐 Unlock the latest episode of #SincerelyX for free on @hearluminary with our special 3-month trial: https://t.co/masVJBuLbW https://t.co/lk2b2ekwWX \"Today's business book says: business exists to maximize profit for the shareholders. I think that's the dumbest idea I've ever heard in my life.\" @hamdiulukaya https://t.co/W77miZWDF1 \"We don't realize the constant degree of noise pollution we're exposed to and how much we could profit from more quiet spaces.\" https://t.co/54ehESyl8f The deeply strange anatomy of the hyena: https://t.co/p7lXs17dE7 https://t.co/l54ly4B8Uh These biological marvels are way weirder than you think. https://t.co/kGBPyST6pS Here's what we should learn from #BBQBecky, #PermitPatty, and other viral stories of white people calling the police on black people for just #LivingWhileBlack. \n\nWatch @baratunde's full TED Talk here: https://t.co/8S3s9RwbFu https://t.co/Ik3gYSh17f A powerful look at what we should learn from #BBQBecky, #PermitPatty, and other viral stories of white people calling the police on black people for just living their lives: https://t.co/GDgbUKlPvz @baratunde #LivingWhileBlack \"A fact is not data, it may not be representative if it's only one data point. And data is not evidence -- it may not be supportive if it's consistent with rival theories.\" https://t.co/qCmLBBWQ8E RT @TEDchris: New episode of #TheTEDInterview features @nytdavidbrooks on the search for meaning in both our lives and our broken politics.… “Isolation creeps in when your new boyfriend or girlfriend starts pulling you away from your friends and family, your support system, and tethering you more tightly to them.” @Join1Love https://t.co/vEGYsjt6KH How to deconstruct racism, one headline at a time: https://t.co/hT23McN6Qm @baratunde #LivingWhileBlack https://t.co/pzmzA2WDrb RT @baratunde: My @TEDTalks is live! In it I transform the tragedy of #LivingWhileBlack headlines into something beautiful. Please watch, s… How would you prefer to spend the last years of your life: in a sterile, hospital-like institution or in a village with a supermarket, pub, theater and park within easy walking distance? https://t.co/sRdRqMqeN0 A small-town preacher with a radical secret — he doesn't believe in Hell. \n\n🔐 Unlock the latest episode of #SincerelyX for free on @hearluminary with our special 3-month trial: https://t.co/PzurEKACi9 https://t.co/cXvvtZsjT0 RT @kaysarahsera: Episode 4 of #SincerelyX is up! 🔥\"A Private Hell\": A small-town preacher in the deep south with a radical secret—he doesn… \"Addiction is the only disease where we commonly wait until it's at the highest levels of acuity before we try to do something about it. And by then, it's often too late. We have to start sooner.\" @eubanksaustin \nhttps://t.co/7BX21pCKD2 This is why diversity — in its many forms — is so important within the tech industry: https://t.co/Zx8lWnbock The most important thing you can do to fight climate change: talk about it. https://t.co/O7H92oely1  @KHayhoe https://t.co/90th4eWDb6 “Democracy is one of the most faith-fueled human activities there is. Democracy works only when enough of us believe democracy works. It is at once a gamble and a miracle.” @ericpliu https://t.co/k30WG8HreR \"Instead of looking for hope, look for action. Then, and only then, hope will come. We can't save the world by playing by the rules, because the rules have to be changed. Everything needs to change, and it has to start today.\" @GretaThunberg https://t.co/M8H76JU8Fj This tiny computer can turn any object — like your favorite jacket — into a smart device: https://t.co/rILocJAWlM Why fewer people are choosing to be parents — even when they want to have kids: https://t.co/3n5KjKVzsJ @WajahatAli \"Who we see thriving in the world teaches us how to see ourselves, how to think about our own value, how to dream about our futures.\" @AmericaFerrera https://t.co/Df8zolfEP4 \"Confidence is the difference between being inspired and actually getting started, between trying and doing until it's done. Confidence helps us keep going even when we failed.\" @MsPackyetti https://t.co/dWPuK2szmM RT @iamsrk: Busy...busy...busy! Time to think out of the box on Ted Talks! Listening and Learning. #TedTalksIndiaNayiBaat.. On @StarPlus @T… \"Whoever you are, whatever you're going through, in whatever way you might be going through it, just know this: in order to heal it, you have to feel it.\" @eubanksaustin \nhttps://t.co/OW6hOWtYrd Applications are open until May 29 for the #TED2020 Ideas Search. If you or someone you know has an idea to share on the TED stage, this could be your chance!  Visit https://t.co/OfNS92zsUa to apply. https://t.co/oXmm0SvqCe \"Acute physical pain ends relatively quick; complex emotional pain does not.\" @eubanksaustin \nhttps://t.co/QPt7PRBN7a \"I wanted to play people who were complex and multidimensional, people who existed in the center of their own lives. Not cardboard cutouts that stood in the background of someone else's.\" @AmericaFerrera https://t.co/E2XsQJuJwu \"This is the difference between return on investment and return on kindness. This is the difference between profit and true wealth.\" @hamdiulukaya https://t.co/kTLBtVSAc7 \"CEOs have their employees suffer for them. But yet, the CEOs's pay goes up and up and up. And so many people are left behind. I'm here to tell you: no more. It's not right, it's never been right.\" @hamdiulukaya https://t.co/WB9VO3Qsej These soft robots could revolutionize everything: https://t.co/eaRqK73tXN \"You'd never trust your surgery to the man on the street. You'd want an expert who spent years doing surgery and knows the best techniques. That should apply to every major decision. Politics, business, health advice require expertise.\" https://t.co/2cLfOXYfud \"Where did we come from? How did the universe come into being? Are we alone in the universe? What is the future of the human race?\"\n\nStephen Hawking on some of the biggest questions of our time: https://t.co/zV21DUZVcZ \"Wouldn't it be great if, every once in a while, we did mathematics simply because it was fun or beautiful?\" https://t.co/dTM2zARIhi \"Hidden mathematical truths permeate our whole physical world.\" — Cédric Villani https://t.co/noX2fFBGub \"Embrace your many passions. Follow your curiosity down those rabbit holes.\" — @emiliewapnick https://t.co/WCRXZQBMwc The microbes on your skin are almost as unique as your fingerprints. Here's what they say about you: https://t.co/i2wBMGTI31 \"I am just one of millions of people who have been told that in order to fulfill my dreams, in order to contribute my talents to the world I have to resist the truth of who I am.\" @AmericaFerrera https://t.co/DqQe97KTPB \"There is really mathematical evidence to say that you should never let the sun go down on your anger.\" https://t.co/Zq7lq8qRuH Ask yourself, “Where does it hurt?” and “What’s the worst part of it?”  https://t.co/lxOuBUswGy Have you lost someone you love? Are you supporting a friend in mourning? Here's the messy truth about grief: https://t.co/gls7cOCjU6 @noraborealis We know you're not going to give up your phone entirely. Here's how you can realistically cut down on screen time. https://t.co/j98UGlMRHN Push a piece of buttered toast off the table. Do it for science. https://t.co/IXSIcRQki3 \"Mathematics allows us to go beyond the intuition and explore territories which do not fit within our grasp.\" https://t.co/9OuXNaJsrf Here's why you should appoint someone to be the devil's advocate in your life. (No seriously, hear us out.) https://t.co/E0dPnHSsZP This is what happens when you click on an ad online: https://t.co/95GcOF8FHr For once it actually is rocket science. https://t.co/HG7nxOVsAQ This is how your brain influences your understanding of what you think you know: https://t.co/Ep2smKduOO @DrShepherd2013 Meritocracy is a myth. This is the real key to getting ahead at work: https://t.co/xuvxqVrsPP How to stand up tall, no matter what has you down: https://t.co/0mRfkbEYdW Shoutout to everyone who freaks out when it's time to calculate the tip! https://t.co/YSI98MDAAb Whether it’s with a partner, family member, friend, boss or colleague, ending a relationship is hard. But even harder can be what comes afterward. https://t.co/fT6KqSBT6j Hexagons! And other reasons to love math: https://t.co/S47c2ZhH4r https://t.co/8I5bHCwJ02 Don’t have one true calling? That’s a good thing: https://t.co/Az4nsf6uQy @emiliewapnick Do you know the difference between facts, data and evidence?\nhttps://t.co/C47y9Zyst0 These TED Talks are perfect for kiddos excited about science and technology: https://t.co/a2qaKyZZpS \"Only if you are truly open to the possibility of being wrong can you ever learn.\" https://t.co/V6njgS2iIV The impact of algorithms on everything from architecture to online dating: https://t.co/TOtOKYvgGq 3 kinds of bias that shape your worldview: https://t.co/Y3S1FNWlow @DrShepherd2013 https://t.co/jzCRb6mcVk This is how pain relievers work: https://t.co/vSahOmcOxI Research suggests that even working 40 hours a week is too much. https://t.co/nrLXQswqxq What makes someone an alpha male? It turns out we're way off base. https://t.co/mQ5KkQRGYT It's so much worse than we think it is. https://t.co/z7j4jec5in The price of being single: https://t.co/2gWsbLCM5z Viruses have a bad reputation — but some of them could one day save your life. https://t.co/Z0dmnqLAmh There's a lot to love about monster prime numbers: https://t.co/sT3ancDTWV 5 TED Talks every new graduate should watch: https://t.co/djYG8NTv01 Want to be a good person? Let go of the concept of \"good.\"  https://t.co/LaoSBAUbjW Great advice for avoiding conflict if politics comes up at the dinner table. @julia_dhar https://t.co/8PVCAYPKPL If you want to be a good person, start by allowing yourself to make mistakes. https://t.co/oGq8eb34bv 1 out of every 100 people is a psychopath. This is the test. https://t.co/bE0MBW7abf 5 excuses we use to not work out, and how to change your thinking. https://t.co/o0QSkLGlEl Grilling this weekend? This is the future of plant-based and cell-based meat:  https://t.co/AEhfz6qb5H Knowing more than one language keeps your brain healthy, complex and actively engaged. https://t.co/3E9wG69QjI “There’s very good evidence that shows when you confront people with a ton of facts that contradict their worldview, it actually causes them to hold their existing beliefs more strongly.”  https://t.co/fsUjHV3AAN We are saddened to hear that legendary physicist and Nobel Prize winner Murray Gell-Mann has passed away. In this talk, he shares the beauty of life, the universe, and of course, physics. https://t.co/TAma7AF0BW We all doubt ourselves sometimes. Here’s a reminder that you’re enough. https://t.co/Zk82Kcz7Nl Want to be a good friend? Erase this sentence from your vocabulary: https://t.co/ox92OI2GwO https://t.co/IGTQN7UFnM Wanting to be a \"good person\" is making us bad people. Here's how:  https://t.co/EqucEttLbG Ever feel like your career has been a winding, messy path? This talk is for you: https://t.co/xEZA9K3M01 Here's why your body prefers to poop at home: https://t.co/muRfoaamgX Next time one of these 5 excuses crosses your mind, you'll have the antidote. https://t.co/s5OomBFxQU 5 TED Talks every recent graduate should watch: https://t.co/ZdpV2PY8kR RT @TED_ED: Sea turtles can grow from the size of your palm to the size of a dinner table, but what are their odds of making it that far? I… “Healthy emotion has a vitality curve. It emerges, you feel it, you express it, and then you’re done.” https://t.co/Rh9L5xma4X RT @AmericaFerrera: It was a powerful, emotional, and challenging journey to relive my life experiences and 18-year career in an attempt to… How clever marketing has hidden the dark science of vaping: https://t.co/giMmcWHmfF Play this game to see how good you are at detecting misleading science headlines. https://t.co/W2huEcKGtY \"My identity is not my obstacle. My identity is my superpower. Because the truth is, I am what the world looks like. You are what the world looks like.\" @AmericaFerrera\n\nWatch America's full TED Talk about the need for more authentic representation here: https://t.co/4ioJYzolt4 https://t.co/pwKfwc3RxI My identity is a superpower — not an obstacle: https://t.co/8AUm89HyhX @AmericaFerrera https://t.co/RHvjUBIdsa .@AmandaPalmer opens up about how she connects with her fans through her music.\n \nLearn more about one of the most unique voices in music on this week's episode of #TheTEDInterview. Listen on @Stitcher: https://t.co/XOk8DS6t5z https://t.co/D8qyDmWTJ5 \"Whoever you are, whatever you're going through, in whatever way you might be going through it, just know this: in order to heal it, you have to feel it.\" @eubanksaustin https://t.co/o5RqrEBpnO We were heartbroken to learn that Columbine survivor and addiction recovery expert Austin Eubanks passed away this weekend. In his moving @TEDx Talk, he discussed the role emotional pain plays in the opioid epidemic. Rest in peace, Austin.\nhttps://t.co/o5RqrEBpnO \"Confidence is the necessary spark before everything that follows.\" @MsPackyetti https://t.co/aOTQZTXeq8 New research is investigating how a family's income changes a child's cognitive and emotional development: https://t.co/Erj7vSQ6he Watch the first TED Talk by a digital human: https://t.co/AU3txNhUKY \"Plant-based and cell-based meat gives consumers everything that they love about meat — the taste, the texture and so on — but with no need for antibiotics and with a fraction of the adverse impact on the climate.\" https://t.co/LvLaYmq3gu Wearable tech could change the lives of people with epilepsy. Here’s how it works: https://t.co/LTVPb4Zvbm \"When you get accurate, judgment-free information from your peers, you realize that sex ed doesn't have to be scary.\" https://t.co/Y2tPTqs6E8 These plant- and cell-based products could soon transform the global meat industry — and your dinner plate. https://t.co/X8Ummw5bUe This is for the students, coworkers and regular people who are often overlooked because we are seen as neither exceptional nor problematic. https://t.co/VkSwF1PANQ RT @Chobani: You’ve heard of the anti-hero. Now it’s time for the anti-CEO. Watch Chobani Founder @hamdiulukaya's @TEDTalks on why it’s tim… RT @hamdiulukaya: if you’re right with your community &amp; your people &amp; your product, you will be more profitable &amp; you will be more innovati… Want to be healthier? Start by seeking out a quieter life. https://t.co/fzqwxQJNri In the US, the very same blood test can cost $19 at one clinic and $522 at another clinic just blocks away — and nobody knows the difference until they get a bill weeks later. This journalist is making that data public: https://t.co/UWWyjjzCPX RT @TEDchris: New episode of #TheTEDInterview with @amandapalmer. I found her incredibly compelling on artistic courage, truth-telling and… RT @amandapalmer: my talk with @TEDchris for #TheTEDInterview podcast is OUT TODAY!! you can listen to it wherever you listen to podcasts,… RT @amandapalmer: this visit to the #TheTedInterview with @TEDchris anderson, the head of @TEDTalks, was an incredibly challenging - and th… \"This is the difference between profit and true wealth.\" — @hamdiulukaya \n\nLearn how @Chobani's founder and CEO is rewriting the business leader playbook. Watch his full TED Talk here: https://t.co/Q7mvr9AOvU https://t.co/8ExAlUqVOP RT @hamdiulukaya: it's time to admit that the old CEO playbook is broken. we need a new playbook. one that stands for more than profits, on… This is the new anti-CEO playbook, from @Chobani's @hamdiulukaya: https://t.co/ONCxZbiIOv https://t.co/Plq7kVsc6d Getting people to do what you want them to do requires telling these 3 stories: https://t.co/CUQRBA1aG5 This is one of those tech demos you have to see to believe. https://t.co/Q7UpRFadfY What you need to know about power so no one can take advantage of you: https://t.co/MiMdba3qqZ Why storytelling is the ultimate weapon of the powerful: https://t.co/MZgyASrBZ3 Bad news. E-cigs and vapes are basically the Trojan horses of nicotine: https://t.co/37XQRpRBTp \"I harnessed all of my insecurities and self-doubt and let it flow through the words that came out of my mouth. I was cheeky. I was loud. I was angry. And for this, I was perfect.\" — @Maisie_Williams on auditioning for #GameofThrones https://t.co/qcTu3lJ5ao Why talent carries you farther than fame: https://t.co/rlKZtKfxo4 #GameofThrones @Maisie_Williams Everything you think you know about the science of virginity is nonsense.\n\nWatch Nina Dølvik Brochmann and Ellen Støkken Dahl's full TED Talk here: https://t.co/CzEzV28Ifd https://t.co/5uQZ0fgah8 This is what you're actually inhaling when you vape (hint: it's definitely not water vapor): https://t.co/30QYPHVLOm Y'all, it's time to talk about sloths. https://t.co/KfLbdzRKfH These TED Talks make the case for why more diversity in tech is better for all of us: https://t.co/nhytV6Tlwi How dogs bring joy and calm to hospitals — especially for kids: https://t.co/hAqer04o63 Three-toed sloths poop once a week, take a month to digest a single leaf and fart through their mouths. https://t.co/Rqo1RPAqyn Everything you need to know about taking care of your desk plant: https://t.co/JG8K5Y7Qnv This is the moment when you find your purpose in life: https://t.co/tVQQsDff20? The psychological reason you need more plants in your life: https://t.co/vckRMNbiBn This is the magic behind the incredible stage sculptures created for Beyoncé, Adele, U2 and more by legendary artist Es Devlin.\n\nWatch her full TED Talk here: https://t.co/MDSzYmVsBy https://t.co/yQiOFWendH How to show up as your most confident self: https://t.co/yoSl23INeX @MsPackyetti https://t.co/BOgelYjJco A young woman in an ultra-orthodox community finds a way to covertly sneak in mental health resources. \n\nTune in for free on @hearluminary with this special 3-month trial for TED fans: https://t.co/kYnjiPuJ4o https://t.co/ZmwX0WWyfX \"Confidence is the difference between being inspired and actually getting started, between trying and doing until it's done. Confidence helps us keep going even when we failed.\" @MsPackyetti https://t.co/LvCHN4WeDS This citizen-driven club leverages the skills of regular people to solve some of the most challenging cold cases in North America. https://t.co/zxi3z1VAWE \"We reward confidence in some people and we punish confidence in others... For some of us, confidence is a revolutionary choice.\" @MsPackyetti https://t.co/m8Rk3gnnMM 9 hard-to-kill plants that you should adopt to brighten up your desk: https://t.co/vW9W7UJ305 An organizational psychologist answers your burning questions about whether or not to date your co-workers: https://t.co/p126m2dBvg \"Confidence is the necessary spark before everything that follows.\" @MsPackyetti https://t.co/PBayC6Vp4R “Regarding relationships of all categories (platonic, romantic, professional, etc.): Don’t let someone take up your emotional real estate if they aren’t paying rent.” https://t.co/Uqx9MQe0iY How to build your confidence — and spark it in others: https://t.co/fQtZxvbudv @MsPackyetti https://t.co/uYOVqMneOX RT @MsPackyetti: 🚨🚨MY @TEDTalks IS HERE!!🚨🚨\n \nSo, listen up: society rewards confidence in some, and punishes it in others.  For some of us… “It's important in the early days of a new relationship to pay attention to how you're feeling. Are you comfortable with the pace of intimacy? Do you feel like you have space and room to breathe?” @Join1Love https://t.co/KY1H0uGj55 “The opposite of addiction is not sobriety. The opposite of addiction is connection.\"\n\nWatch @johannhari101's full TED Talk here: https://t.co/O2RK2lDbVL https://t.co/uREKO98Q1W “Abusive relationships don't start out abusive. They start out exciting and exhilarating. There's an intensity of affection and emotion, a rush. It feels really good.” @Join1Love https://t.co/HyQ0ou96AW “Healthy love includes independence, two people who love spending time together but who stay connected to the people and activities they cared about before.” @Join1Love https://t.co/7pc43uAeh6 \"I have learned to pay genuine respect and put our energy into places that can serve us and give us joy.\" @donttrythis https://t.co/1UZeJ4s08v For whoever needs to hear this today: Stop entering relationships that you know are doomed! https://t.co/wAgkMIYSF7 \"Obsession is the gravity of making. It moves things, binds them together, and gives them structure.\" @donttrythis https://t.co/k5Ed6O8nlg “The truth is, unhealthy relationships and abuse are all around us. Abuse sneaks up on us disguised in unhealthy love.” @Join1Love https://t.co/khcskD0n9r “Your partner should have your back. Their words should build you up, not break you down. They should make you feel more confident, not less.” @Join1Love https://t.co/yDipCwEQWr \"Your ideas can come from anywhere. Being attuned to those pings of interest is the duty of a creator.\" @donttrythis https://t.co/ygoEYE65k2 Great advice that every twenty-something needs to hear. \n\nWatch Meg Jay's full TED Talk here: https://t.co/1RoNS5XNhV https://t.co/xJzSEPZyy2 5 warning signs of an unhealthy relationship: https://t.co/xhTxId1D9T “Relationship skills are one of the most important and hard to build things in life. While love is an instinct and an emotion, the ability to love better is a skill we can all build and improve on over time.” @Join1Love https://t.co/zz0dVRzVnq Kids get feedback all the time; parents should get some, too. https://t.co/3ofQ5PCF1a 4 key pieces of feedback that children wish they could give their parents: https://t.co/lMFIQnI0Vr What an unhealthy relationship looks like: https://t.co/P3xFgXSgft 5 differences between healthy and unhealthy love: https://t.co/qXIcz6SUIC Figuring out your answer to “Why you?” can help you speak authentically and build your confidence. https://t.co/aY81SaRqi9 \"Every single one of us is trying to make sense of the world: Our place in it and how everything fits together.\" @donttrythis https://t.co/qvQWULpUAy One form of romantic self-sabotage is choosing partners that are just plain wrong for you. https://t.co/WRdeNClmAl Children could definitely give the adults in their lives some lessons in parenting. Here are a few: https://t.co/taxoBqnqZ2"}