{"tweets": "me impedirían en estos momentos prestarle la dedicación exclusiva que el cargo merece.\n\nQuerría agradecer al club la confianza depositada en mí al ofrecerme esta posición de tanta responsabilidad.\n\nSalut i Visca el Barça. he decidido no aceptar la oferta del Club. No ha sido una decisión fácil, ya que siempre he dicho que me gustaría volver a la que considero mi casa, pero diversos proyectos personales en los que me encuentro inmerso Buenas tardes a todos, \n\nEn las últimas semanas se han publicado distintas noticias sobre mi posible incorporación al FC Barcelona como Director Deportivo. Es por ello que me siento en la obligación de comunicar a toda la familia culé que, después de sopesarlo mucho, @IkerCasillas @mterstegen1 Es sensacional hace mucho tiempo, amigo. 😘 Gracias @mterstegen1 🙌🙌 @WorldPadelTour @FBelasteguin 👏👏👏👏👏 No estamos tan mal... 👏👏👏🔵🔴 🔝🔝🔝@5sergiob Golazoooooo @AntoGriezmann 👏👏👏 @FCBarcelona_cat Som-hi!!!!! 💪💪💪 Yo no dudo! este @FCBarcelona_cat nos seguirá dando muchas alegrías. Visca el Barça. 🔵🔴💪😍 Congratulations @PepTeam you are the best! 💪💪💪👏👏👏🏆 enhorabona Pep. @ElHuffPost 👏👏👏👏👏 ¿Nueva incorporación para el @FCBbasket ? https://t.co/AM3mJm0Uvz Hay deportistas que a pesar de conocerles poco, te dan la sensación de que son personas auténticas. Es lo que me pasa con @MarcGasol, me parece un tío cojonudo. Enhorabona crack! T’ho mereixes. @Radioestadio 👏👏👏👏 @ARAesports 👏👏👏👏😍🔵🔴 @UnivisionSports @javierzanetti Será un placer volver a estar con vosotros. Nos vemos pronto. No ha podido ser, pero cabeza arriba, ánimo y a seguir luchando. Orgullosos de vosotras @FCBfemeni  Visca el Barça 🔵🔴 @shakira 👏👏👏👏💪 Muchas felicidades, amigo. https://t.co/aakvrVLDHc @marca @LuMartinBCN @FCPorto @IkerCasillas 👏👏👏👏👏💪 Visca el Barça  🔵🔴 OMG LEO MESSI! 👏👏👏 Som-hi!!!! @FCBarcelona 💪🔵🔴 Mucha fuerza amigo! @IkerCasillas ❤️💪 Enhorabona Campions!!! \n7 ligas de las últimas 10, no hay duda de cuál es el mejor equipo! Congratulations Barça! 🔵🔴💪 visca el Barça! I love @ChampionsLeague Congratulations @AFCAjax you are amazing guys 👏👏👏👏 Grande @Phil_Coutinho 👏👏👏 Som-hi nois!!! Força Barça!!! 💪🔵🔴@FCBarcelona 🙌🙌 @FCBarcelona_cat 💪👏👏👏 @10Ronaldinho @LaLiga @FCBarcelona @fcbarcelona_br Grandes recuerdos hermano! 🤙 @DavidFerrer87 👏👏👏👏 t’ho mereixes. @GarbiMuguruza @DjokerNole @MiamiOpen @LaLiga @LaLigaSports @WTA @ATP Un placer y gracias por la paciencia en la pista. Mucha suerte💪 @LaLiga @andreaesteban10 👏👏👏👏👏 @manaban86 @IkerCasillas @mterstegen1 Tienes razón hay mucho nivel @IkerCasillas ¿Difícil? Tú entiendes de esto y no hay duda. @mterstegen1 What an exciting @ChampionsLeague this season! 😳😳 Thank you mister for everything you have taught me, for trusting in me and giving me the opportunity to fulfill a dream, without you nothing would have been the same. THANK YOU. I wish you good luck in this new chapter, friend. https://t.co/mKRTELoxQC Gracias mister por todo lo que me has enseñado, por confiar en mi y darme la oportunidad de cumplir un sueño, sin ti nada hubiese sido igual. GRACIAS. Te deseo mucha suerte en esta nueva etapa, amigo. https://t.co/kFvTBNAsK4 How great to see the increasing support for female sport. Congratulations on the attendance record, @ClubEstudiantes and @magectias1995. Now it’s time to surpass ourselves again in football @FCBfemeni @AtletiFemenino 💪🏼 #PassionForSport Contento de ver cómo cada vez más se apoya al deporte femenino. Enhorabuena por el récord de asistencia, @ClubEstudiantes y @magectias1995. Ahora es el turno de volver a superarnos en el fútbol @FCBfemeni @AtletiFemenino 💪🏼 #PasiónPorElDeporte RT @FCBfemeni: #WeAreFootballers\nEl futbol és per a futbolistes\n🔵🔴 https://t.co/Dwv6i1AkXL Que bonito es el fútbol... Enhorabuena al @AFCAjax, no sólo por ganar a un equipo como el @realmadrid sino por como lo han hecho.👏👏👏 OMG 🙌🙌🙌😳😳 Qué golazo! Como juega el @AFCAjax 👏👏 Gran @3gerardpique 💪 Vaaaamoooos @LuisSuarez9 🔝 #VISCAELBARÇA 🙌🙌🔵🔴 💪💪💪💪🔵🔴 Som-hi Barça!!! 💪🔵🔴 👏👏🔝🙌 https://t.co/dDHRbv09iz @danisenabre 👏👏👏👏🔝 Tres puntos importantes, puede que no estemos en el mejor momento de la temporada, pero nunca podemos dudar de estos jugadores. #Orgulloso #ViscaElBarça Vamoooooooos!! #ViscaElBarça Who will win? ¿Quién ganará? Enhorabona, campions! @FCBbasket 👏👏💪 Que bueno es Busquets 🙌💪 Salvador @mterstegen1 👏👏 Per molts anys amic! #HappyBirthday Geri https://t.co/lZi536TxR7 Bona nit 👏👏👏👏 son molt bons. Visca el Barça @FCBarcelona_cat @JasperCillessen 👏👏👏👏👏 ¿Remontada? @orioldomenech @NKARABATIC Es una bestia competitiva. M’encanta. Saber ganar, saber perder... ejemplo 👏👏👏 https://t.co/97Aq8ExINw Per molts anys amic! #HappyBirthday https://t.co/jIrczHQFos Som-hi Barça!!!! Remuntarem 💪 visca el Barça. 🔵🔴 We support @fundacioncruyff so that Cruyff’s legacy lives on and has a positive impact on society, helping less fortunate children by giving them the opportunity to get an education and training through football.\n#CreatingSpace #CruyffLegacy #ISupportJCF https://t.co/M1fOK0FE4E Cruyff cambió el fútbol con su forma de entenderlo y su filosofía. Acompañemos a @fundacioncruyff para que su legado tenga un impacto positivo en la sociedad, ayudando a niños desfavorecidos a formarse también a través del fútbol.\n#CreatingSpace #CruyffLegacy #ISupportJCF https://t.co/ky5ZepEchC Premier League definitely not over, a lot to come. 👏👏👏 Who will win? https://t.co/h4aDZAn7nO ¿Cómo ves el próximo partido contra M City? https://t.co/9ciG8KY56x Y ahora más que nunca amigo. 💪 https://t.co/KkLPllvKmh I Love rock &amp; roll #Liverpool OMG Liverpool... ¿Para cuando el VAR en la Premier? #liverpool-Newcastle Me he encontrado con este recuerdo de la que fue una de las etapas más bonitas de mi vida. Dos años increíbles en la Masia con compañeros con los que compartía un mismo sueño #PasionPorElDeporte. ¿Cuántos jugadores reconocéis?  #vintageBarça https://t.co/RJc6i51vUm Después de 6 años sólo puedo dar las gracias por tenerte en mi vida, siempre he sido muy afortunado pero contigo más. Gracias por ayudarme en los momentos difíciles, por entenderme y respetarme siempre. TE QUIERO, eres lo más. https://t.co/BkMiLbu6Od ¿Qué os parece el sorteo de la Champions? ¿Qué equipos pasarán a cuartos? Veremos cómo llegan los equipos a febrero. 😱😱👏👏👏 @Dembouz ¿Alguien duda de quién es el mejor? No le hacen falta premios individuales... #LeoMessi 🙌🙌 Leo Messi DEP President Josep Lluís Núñez. Forta abraçada a la família. Training 💪🏃‍♂️ https://t.co/YAoExLDEcU @Javier87609913 @CarmeBarcelo Tenemos que censurar todos los actos violentos, no justificar nunca la violencia. Vergüenza total, es muy triste ver esto, y por desgracia no es un caso aislado, muchos padres no son conscientes del daño que le hacen a los niños. https://t.co/TGlLZ23Cu8 Stuani, que jugador.... Qué pena las noticias que llegan de Argentina... Así no se vive el fútbol. VERGÜENZA!!! Som-hi Barça!!! 💪⚽️ partidazo. ¿Resultado? Lorena pronto voy con Vanesa a visitarla. Espero veros por allí. Un beso https://t.co/6mt8ZCMuZP @FBelasteguin 👀 estoy preparado amigo. 🤪 🤩🤩 @mterstegen1 Danke @mterstegen1 🙌 Grande Leo. Grande equipo!!! 👏👏👏 Il·lusionat per participar en l'espot de @socatalunya us animo a tots assistir. #millorquihointenta \nIlusionado por participar en el spot de @socatalunya os animo a todos a asistir. #mejorquienlointenta https://t.co/qeDdLQIRMu ¿Falta? ¿Pedimos el VAR? 🤣🤣#sipasalapelotanopasaeljugador https://t.co/pxxl8OHVAt RT @FCBarcelona_cat: Feliç Diada a tots. Visca el Barça i Visca Catalunya! https://t.co/gl3HM9rCbl Feliç Diada de Catalunya!!!! ¿Tarjeta amarilla o penalti? Campions!!!! Enhorabona companys... 👏👏💪 Visca el Barça🔵🔴 😱😍@KMbappe Samuel!!! @samumtiti 👏👏👏 👏👏👏😍😍❤️🔝 https://t.co/wlIVsHqxSj @lucia_villalon @AdrianaMonsalve @AnaCatyHdz @Jimena_Alvarez @Montserrat33 @irinabaeva1 👏👏👏👏👏🔝🔝 En unos minutos con @javierzanetti analizamos la eliminación de España en @LaJugadaTD por @TD_Deportes \nEstamos en @MiCanal5 \n...Y mañana #VamosConTodo a apoyar a mis amigos mexicanos. #ProhibidoRendirse https://t.co/XSnOWipulS Acompañado de @Compayito_TD como “Cáries Puyol” en @LaJugadaTD. #VamosConTodo https://t.co/XQeeAAXbuP Qué jugador @KMbappe 🔝🔝 Va de golazos hoy... 👏👏 Que Golazo!!! 👌 ¿Dentro o fuera? 🧐 Después de la eliminación de Alemania, ¿tendremos sorpresas en el grupo E? Vaaaaamoooos!! #thebest Muchas felicidades, Leo. No tengas dudas, eres el mejor y te mereces tener la copa en tu palmarés. Un abrazo fuerte y disfruta. https://t.co/ZwrzrR2M8o Golazo!!!  y para mi resultado justo. Presión para Alemania... ¿le dará la vuelta al marcador? Proud to accompany @AldeasEspana in their work to ensure that children in situations of vulnerability feel part of a family and have a chance of a better future. Thank you @OrbitSpain, it’s a pleasure to collaborate with you. + on IG https://t.co/EklfYlIC9U. #ProyectoSonrisas https://t.co/v6EZTZvcAs Orgulloso de acompañar a @AldeasEspana en su labor de asegurar que niños y jóvenes en situación de vulnerabilidad se sientan parte de una familia y tengan la oportunidad de un futuro mejor. Gracias @OrbitSpain por contar conmigo. + en IG https://t.co/EklfYlIC9U. #ProyectoSonrisas https://t.co/C1sDzsgZ19 Que golazo @Phil_Coutinho 👏👏👏 Que grande @RafaMarquezMX 5 mundiales. 🔝🔝🔝 Hoy empieza el Mundial. Recordad, Foco + Unión = a Campeón. Mucha suerte a todas las selecciones. Today the #WorldCup2018 begins. Remember, Focus + Union = Champion. Good luck to all the countries. 💪🌍⚽️🏆 #PasiónPorElFútbol https://t.co/1KnyCbpaZA ✈️ to Moscow ⚽️🏆🌍 RT @JoanjosepPallas: @Carles5puyol explica en conversación con @LaVanguardia qué hay detrás de su controvertido tuit. El ex capitán invita… RT @sport: #Opinión ✍️ | Lo que quiso decir Puyol, de Carles Sans https://t.co/DbRFeweJRv https://t.co/kTh168HSVr @gutiposse La liga no se puede tirar nunca, pero la copa la tienen que jugar los que no juegan habitualmente, y estar a tope para la Champions. Dicho esto creo que el Barça ha hecho una gran temporada. Visca el Barça siempre. Enhorabuena madridistas. 4 Champions en 5 años con uno de los mejores Barça de la historia... tenemos que reflexionar en las prioridades. Thank you @AthleticClub for such an emotional award and thank you to the supporters for your warm welcome. It is an honor to received #OneClubManAward from a Club that keeps competing in the best league remaining true to their philosophy, a difficult goal in the football world https://t.co/wEVDzrospD Gracias @athleticclub por este emotivo premio y gracias a los aficionados por tanto cariño. Es un orgullo recibir #OneClubManAward de un Club que es un ejemplo en el mundo del fútbol, tiene mucho mérito seguir compitiendo en la mejor liga del mundo manteniendo vuestra filosofía. https://t.co/frmw0Ytcph Challenge accepted @ivanrakitic ! Let’s all work as a team. For every post with #EatLikeAPro, @beko will donate 1€ to @UNICEF in collaboration with @FundacioFCB to prevent childhood obesity. What about you, @kobebryant @cescf4bregas and @vanesalorenzo_ ? https://t.co/dasu4PXLZG Trabajemos en equipo para prevenir la obesidad infantil. Yo como cómo un Pro. 🍌 ¿Y vosotros @cesc4official , @kobebryant y @Vanesalorenzo_ ? @beko donará 1€ a @UNICEF por cada post con #EatLikeAPro https://t.co/upWy4NoxM0 Felicitats campions! Sou molt grans. Visca el Barça!!! 👏👏❤️ @mosalah 🙌🙌🙌 És un pal, dia dur, però ara no ho cremem tot... tenim 2 títols a tocar. ara més que mai visca el Barça!!! Ya queda menos para la fiesta mundial del fútbol 👏👏👏 https://t.co/xTfyVLOLGs DEP Quini... nos deja un grande. Abrazo fuerte a la família. CAMPIONS!!! Enhorabona @FCBbasket 👏👏 Geri, el meu gran amic i company. Et trobo a faltar en el dia a dia, les teves bromes, les meves bronques...🤣 Ets molt gran! Per molts anys @3gerardpique #pasionporeldeporte https://t.co/yETCUD4XxR Que grande! #contigosiqueempezotodo https://t.co/ehigYYZBAt Gracias por tu profesionalidad y tu forma de entender el deporte, siempre anteponiendo el equipo a todo. Al retirarme en 2014 se que dejé la defensa del @fcbarcelona en buenas manos. Te deseo lo mejor amigo @mascherano  #GraciasMasche #pasionporeldeporte https://t.co/rByZ5veJjL Formar equipo contigo fue un regalo, nos contagiaste tu alegría y contigo empezamos una nueva etapa llena de éxitos. Siempre recordaré que antes de salir al campo me decías: “tú detrás y yo delante” 🤙🏽 Gracias amigo, te deseo lo mejor @10Ronaldinho #leyendaeterna https://t.co/Yk7fvsvrUm A per un nou any i totes les coses bones que estan per arribar. Per molts anys amic @MarcBartra https://t.co/eBgl2l6eGt @LUISENRIQUE21 👏👏👏👏😘 Felicitats amics, sou els millors. Visca el Barça. https://t.co/jRpzDT9B9A Som-hi amics.💪\nVamos amigos.  Força Barça!!!! #tbt #elclasico https://t.co/7lIsvnmHr4 @mundodeportivo Muchas gracias por aclararlo, la foto es muy confusa. Un abrazo @mundodeportivo Pocas veces he jugado en manga larga, y nunca una corta y la otra larga... que pena que tengan que manipular las fotos. Bona nit 😘😘 RT @rbesac: Las mejores cosas que le han pasado últimamente al Barça empezaron con un señor, buen entrenador, gran jugador, siempre caballe… @FCBarcelona_cat 🔝🔝🔝🔝🔝 Pasan los años, pero la amistad con los excompañeros perdura. Un gusto volver a veros y recordar lo que hemos vivido juntos @10Ronaldinho @setoo9 #pasionporeldeporte \n\nYears go by but friendship remains. Love getting back together guys and bringing memories alive #passionforsport https://t.co/9SAI8kKpvL With Maradona, one of football’s greatest legends. I enjoyed our chat about our shared passion for this incredible sport. Interesting and funny! Such a shame I couldn’t play with you on the football field! https://t.co/LbbO8BodqK Junto a Maradona, una de las grandes leyendas del fútbol. Me ha gustado nuestra charla sobre la pasión que tenemos por este deporte. Interesante y divertida. Que pena no haber coincidido contigo en el terreno de juego. https://t.co/KyVLoqWq3H I’m with the presenter of the #Russia2018 World Cup draw. You may also know him as being one of the World Cup’s top scorers! 😂⚽Happy birthday @GaryLineker, a legendary striker! https://t.co/K757ttVkMx These possible groups have appeared in one of the draw rehearsals for the #Russia2018 World Cup. Can you imagine if this group of death were real? What a World Cup we would have! https://t.co/N0RM2oYNHB En uno de los ensayos del sorteo del Mundial #Rusia2018 han salido estos grupos ficticios. Os imagináis que este grupo de la muerte fuera verdad? Menudo mundial nos esperaría. https://t.co/evPdmoVaFn Mucha suerte a @davidaganzo, nuevo presidente de la @afefutbol . Espero que le vaya muy bien al frente de una asociación que siempre ha defendido los intereses de los jugadores. Estoy seguro que seguirá haciéndolo en esta nueva etapa. Mira que he formado parte de muchos equipazos a lo largo de mi carrera, pero este es simplemente de otro mundo. Un honor compartir escenario con estos #FIFALegends y ayudar a decidir los grupos de #Rusia2018. @FIFAWorldCup https://t.co/0sC9rnnC8C Tot el meu suport a #Barcelona per aconseguir ser la seu de l’Agència Europea del Medicament. Molta força! #BCN4EMA\n\nAll my support to Barcelona to become the headquarters for the European Medicine Agency. Good Luck! Con lo que las he maltratado y todavía me siguen el ritmo… #locodeldeporte #pasionporeldeporte https://t.co/vZpis6DP9F Quin palmarès amb 24 anys, 6 mundials ja! Segueix fent història, nanu. Felicitats, ets un crack @marcmarquez93 Se retira @Pirlo_official, jugador respetado por el mundo del fútbol y con el que hemos disfrutado tanto. Suerte en tu nueva etapa, fenómeno Terrible lo que ocurre en Galicia, Asturias y Portugal, tres pueblos luchadores que hoy luchan contra el fuego. Mucha fuerza y ánimo! Votar es democracia! We've been together in many of the matches we've played. You're one of the reasons I enjoyed them so much. Leo, the best. @mundodeportivo https://t.co/U3Zty5EvYW Hemos jugado muchos partidos juntos. Y eres uno de los responsables de que los haya disfrutado tanto. Eres el mejor, Leo. \n@mundodeportivo https://t.co/CdgvdWiYrs Disfrutando a tope de un día de fútbol con los niños y niñas de la #danonenationscup\nPorque todo empieza aquí, desde la base!👌👍⚽️ https://t.co/wiDV3pHcsR Muy dolorosas las noticias que llegan desde México. Toda mi fuerza para un país que llevo en el corazón. Estamos con vosotros 🇲🇽 @Borja_Pardo Muy buena. Recomendable 100x100 Welcome to Barcelona @Uniqlo_esp, you are landing to a city full of joy and open to the world #simplemadebetter https://t.co/5NCqxlfrwg Bienvenidos a Barcelona @Uniqlo_esp, llegáis a una ciudad llena de alegría y abierta al mundo. #simplemadebetter https://t.co/z8sdtXCQi9 Ven y juega el torneo solidario XAP de pádel en beneficio del @SJDbarcelona_es y #ayudanosaayudar a construir el Pediatric Cancer Center BCN https://t.co/CFnifNkP2E Who's the best? Feliç Diada a tots. Visca Catalunya!! @FBelasteguin Caerse está permitido, levantarse es obligatorio 💪💪💪 i trust you guys!!! @XSB8 Un petó per a la teva filla 😘 RT @SpheraSports: #PortadaSphera\nIN MEMORIAM\nhttps://t.co/YGZlIuhQyZ https://t.co/43leU87JWM Gran!! 🔝 https://t.co/EDxzKCUwEo 🔝🔝🔝 https://t.co/1lc71EoqKr El meu condol als familiars de les victimes i suport als ferits de l'atemptat de #Barcelona. El terror no vencerà mai #TotsSomBarcelona Día de Gamper solidario especialmente emocionante por el homenaje al Chapecoense. Hoy compartimos vuestra ilusión de resurgir de nuevo! https://t.co/rOXBHhqx6I Ejemplo de grandeza, rendir tributo cuando ganas al mejor. #humildad #Deportividad https://t.co/YgnB9qXu6q DEP Ángel Nieto. Leyenda del deporte que creó escuela dentro del motociclismo. Todo mi afecto a sus familiares. Hasta siempre, campeón 12+1 https://t.co/R2sslFEDsJ If you want my signed official shirt, support #TOTHEBRAVE https://t.co/E4jKgZMqsV. Discover how to participate here https://t.co/FEWR6pyVwN https://t.co/SWSiUoHLuB Si quieres ganar mi camiseta oficial firmada, apoya #TOTHEBRAVE https://t.co/E4jKh041Rv. Descubre cómo participar en https://t.co/FEWR6phkFf https://t.co/HS1eBJejb8 Emotiva visita a los pequeños luchadores del @SJDbarcelona_es. Toda mi fuerza para ellos. Conoce el proyecto en https://t.co/Mr6853L2zP https://t.co/W355gnXo5O Loved our chat. Thank you, friend. https://t.co/z3isa34diJ Competir es: pasión, motivación, concentración y esfuerzo. 💪 #pasionporeldeporte https://t.co/gv1dTcSorh RT @StarSixes: Tonight's #StarSixes quarter final fixtures here @TheO2 \n🇪🇸🇳🇬\n🇧🇷🇩🇪\n🇩🇰🏴󠁧󠁢󠁥󠁮󠁧󠁿\n🇮🇹🇫🇷\nhttps://t.co/RPOvXGWoIH https://t.co/0zBwx… We've reached 10 million on Twitter. Once again, thank you for your support. #Continuousgrowing https://t.co/ae1AteFiLI Ya somos 10 millones en Twitter. Una vez más, gracias por vuestro apoyo. Gràcies pel vostre suport #Seguimoscreciendo https://t.co/6pv3SVihqO @fizzer18 Sorry man!! I hope your knee is fine.  I didn't mean to do it. 🙏 @SiqueRodriguez Gràcies Nanu!!! Demà més... 💪 Así es cómo esperamos para la boda de nuestro amigo Leo, en la cuna del pádel #Argentina #Pasionporeldeporte #Padel https://t.co/MiPBm15LXZ Ready!!! https://t.co/m97b7lU2G0 Martes de gym. Liberando tensión y recargando energía. 💪#pasionporeldeporte https://t.co/EP1rKasntL Hoy es el cumpleaños de este crack. Amigo, te deseo todo lo mejor. Muchas felicidades Leo! #Messi30 #L30MESSI https://t.co/eNpu7uKVzb Great memories from the Sydney's @Olympics. Let it inspire you to get active for #OlympicDay on June 23rd. What are you going to do? https://t.co/x1Pk45ECL5 És un honor apadrinar el XII TORNEIG XAP en benefici de @SJDbarcelona_es al @golfllavaneras #paralosvalientes https://t.co/eFTdLoTYxZ https://t.co/YUlSWsUNNe 🔝🔝 https://t.co/WPrhpqMsiP Des de Colòmbia em sento #AProp escoltant la cançó del nou videoclip de @boxets https://t.co/oHiGfYF9HC En unos minutos me enfrento a la audiencia de #WOBIBogota gracias a @HiCueSpeakers https://t.co/se7PdzlOUw Enhorabona @MarcBartra t'ho mereixes! 💪👌 Velocidad y emoción a bordo de un biplaza @F1. Gracias #F1Experiences por este momento inolvidable. Más en https://t.co/9FeMx5hrwK #F1 https://t.co/OYmgoPZIfi Mi primera vez en #India, un país que deseaba descubrir, apoyando la #FIFAU17WC. Más fotos en https://t.co/jyRgV90jnH  #pasionporeldeporte https://t.co/SZQDKdfd2e @gauravkapur @Barca It was a pleasure to meet you, big brother. 👍 Ya queda poco para estar en directo desde Mumbai contestando a vuestras preguntas. Os espero a las 11AM CET en Facebook. #FIFAU17WC #Namaste https://t.co/vg7nqWiJqe Una abraçada molt forta Carlos!! https://t.co/3D5y2Wmqn0 Pronto viajaré a la India para la #FIFAU17WC. Muchas ganas de conocer este país. Nos vemos pronto, India!  https://t.co/iOXmPP3k9R https://t.co/vG0YXWk12C Hoy me atrevo a escribir al lado de @vanesalorenzo_ en su blog sobre la experiencia del shooting de @fashionandartsm https://t.co/HKUbK7ul4P https://t.co/jnRBX7Mm8R RT @BBHI_cat: \"Participar @BBHI_cat  es un regalo porque vas a conocer tu estado de salud cerebral\" @Vanesalorenzo_  @Carles5puyol con la #… Mi all-time 5 del Barcelona. https://t.co/3UtTmWmTvy Feliç Sant Jordi!!🌹📖 Un placer estar en la inauguración del club Tennis Padel Soleil con estos fenómenos. Gracias Fabrice por hacerme sentir como en casa. #padel https://t.co/Cr1M5nvHSx M’has tornat a sorprendre amb la teva fortalesa, aquesta vegada fora del camp. És un orgull poder acompanyar-te. Ets un crack @MarcBartra https://t.co/Y5CY5IBQW7 Gracias hermano, nos vemos pronto. Abrazo fuerte. https://t.co/RmhfuzEPek Gracias amor! Te quiero❤️ https://t.co/e383EjuZcj Gracias hermano! Un abrazo muy fuerte https://t.co/VnyK2DBjRP Was great to be a Judge on @thevictoriousar. Don't miss the fun challenge between @therealsalgado and I tonight on Dubai TV #thevictoriousar https://t.co/2IZTpt4Epp All my support to the families of the victims of the metro explosion in #SaintPetersburg. Ánimo y fuerza a los familiares de las víctimas de la explosión del metro de #SaintPetersburg. Un fuerte abrazo a la gente de Mocoa. 🙏🇨🇴 @casaleantonio @Heineken_col Antonio, disfruté mucho de nuestra charla. Un placer ¿Te suena el lugar @carlosvives? 😜 https://t.co/9nMeZgvIv2 Ya en #Colombia, buenas noches que mañana me espera un largo día. #conmuchasganas El 5 está cargado de significado para mí, Orgulloso de que el libro de @vanesalorenzo_ ya vaya por la 5ª edición https://t.co/J0GBxvQdjK https://t.co/6yvQ9Fhkk1 Comparto este vídeo de mi amigo Luis Hernández que me parece muy útil para nuevos #emprendedores https://t.co/hTobYmC6AA irmão muitos parabéns! te desejo o melhor. um abraço https://t.co/uvLhyjR8cp Este fin de semana me vuelvo a poner las botas en Dubai para participar en la iniciativa LaLiga DU Football Championship. https://t.co/VVAlRKV7AQ RT @olyseum: Publica una foto en Olyseum practicando deporte 🏃🚴 y gana una GoPro 📸 @Carles5puyol elegirá al ganador. ¡Juégatela! https://t.… Siiiiiiiiiiiiiiiiiiii👏👏👏 orgullós d'aquest equip. Sou molt grans. Som-hi!!!! 💪 RT @LaLiga: .@julianobelletti sabe de remontadas en la #UCL con el @FCBarcelona_es\n\n📺 Vídeo completo 👉 https://t.co/SFNMEjnUmC https://t.co… RT @FIFAcom: Want to volunteer at #FIFAU17WC?🇮🇳\nApply now! ➡️ https://t.co/yf0O4bIDLl\nInfo ➡️https://t.co/h80Lae6iTM https://t.co/deHsTbZLF9 @10Ronaldinho @RafaMarquezMX Abrazo fenómenos Viaje a Rusia. Inspeccionando el Arena de St. Petersburgo y jugando un partido con los voluntarios de la FIFA. Ganas de volver! https://t.co/rpjSKIG04I Hoy con FIFA revisando el Arena de Sant Petersburgo. Me entran ganas de ponerme las botas. https://t.co/9mcc89mpfx #TBT al lanzamiento del Programa de Voluntarios 2018 de la FIFA en Rusia. Con muchas ganas de volver la semana que viene. #KK2017 #ConfedCup https://t.co/WMO2JHQ7Zi Un placer fenómenos... @pablojoselima @FBelasteguin @3gerardpique Esto no me lo pierdo! 💪✌️ Nos vemos luego @3gerardpique @FBelasteguin #padel #pistabela #belavspique https://t.co/hV3xkqmMAm RT @LaureusSport: The legendary @Carles5puyol is excited to answer YOUR Twitter questions LIVE tomorrow! Use #AskPuyol now to ask him anyth… Wearing my #SneakersforGood to support @LaureusSport as a symbol of the power of sport. Show me yours @3gerardpique @juanmata8! #Laureus17 https://t.co/aLyLLyDpdy Mis #SneakersforGood para el próximo martes con @LaureusSport.  #elpoderdeldeporte. Es vuestro turno @3gerardpique y @juanmata8 #Laureus17 https://t.co/dEB1dYkh6w @FBelasteguin @starspadel estoy esperando la propuesta para poder defender este club, prometo darlo todo... jejejejeje @carlosgrenoir mucha suerte crack!!! Te mereces lo mejor. Abrazo fuerte amigo Per molts anys @3gerardpique!!! #amic #30 🔝🔝#teechamosdemenosmister #autentico #muygrande https://t.co/7IYwgCxTGH Emotional moments in the new #Laureus17 Best Sporting Moments of the Year. I already voted for my favorite. And you? https://t.co/eU7tPOvOOW https://t.co/SOfFQhS6Z4 Momentos increíbles en la categoría #Laureus17 Best Sporting Moments of the Year. Ya tengo claro mi voto ¿Y tú? https://t.co/eU7tPOvOOW https://t.co/BFfNfTgMKf #nopainnogain https://t.co/b0FOMF8v06 Moltes felicitats @1victorvaldes, you are the best!!! 👌👍 Buenas noticias!! 👌💪💪 https://t.co/wRHBRr51sG 😏😏 Un placer volver a verte mister... https://t.co/4xaSYsjhPl Jump de Kung fu... https://t.co/epoMlXyxgL Messi es de otra galaxia. Que placer verlo jugar. #elmejordetodoslostiempos @ferranlatorre amb molta diferencia... OMG!!! 👌👏👏👏 Bon dia! Con muchas ganas de participar en el partido de  #laMaratodeTV3. Som-hi... https://t.co/MmB4pUHwQx The best!!! 👌👏👏 😳😳 Que pase de Messi... 😱 La Pobla de segur, mis orígenes. Aquí empecé a jugar a fútbol. https://t.co/AYqtGRXg5i @FBelasteguin @MarceFerrari81 @xaviyeye como persona no hay comparación, muy 🔝 Muchas gracias @MarceFerrari81 eres la mejor entrenadora del mundo. #padel #friends https://t.co/ZqkETQ1R2j Orgulloso de ti y tu libro #yogaunestilodevida. Enhorabuena!, ya vas por la 2 edición, a por más. Lo encontraréis en https://t.co/dHNFNc1POX https://t.co/bL1vCHiXfj Un placer volver a verte @MorientesNo9. Disfrutemos #ElClásico 👏👏⚽️ https://t.co/9PHe2msQXp https://t.co/PqJtPC4uIV Congratulations @nico_rosberg!! Good job!! 👏👏👏 Quién ganará el mundial? Good luck boys!!💪 https://t.co/3MklxXu1Ew Bon dia! Batido verde para recuperarme de la clase de yoga con @Vanesalorenzo_ #yogaunestilodevida #entreno https://t.co/RZ28SnuwRe Cada día un poco más cerca de alcanzar la cura del #SIDA gracias al trabajo de profesionales como el Dr. Clotet y su equipo. #GalaSida https://t.co/yXoNHw9GRS Gran partit @MarcBartra, enhorabona!! 💪👏👏 Siempre un placer verte amigo! https://t.co/uTBPcSIz3a Increíble @Max33Verstappen 👏👏🔝 @sergibrunet 🔝 Interesante la carrera de #F1 quién ganará? @FBelasteguin @starspadel tranquilo que no nos perderemos la final a las 20h 😉👌 Bonita mañana compitiendo en el torneo #publidep en @starspadel pasando ronda en dos categorías. https://t.co/TwBY9oYkcg Un día muy emotivo y un reconocimiento más que merecido. #graciesjohan https://t.co/fCr4ggOi9S 500⚽️👌👏👏 @RaulGonzalez @nycmarathon @nyrr enhorabuena fenómeno! Abrazo fuerte @jvehils 🔝 Partidazo!  #SEVFCB #tbt Bon día, como me hubiese gustado trabajar con él. #marcelobielsa #futbol https://t.co/gaAZQlH7f7 Son molt bons... #MCFCB #MCFCB como veis el partido? Resultado? Nice too meet you! @NikiLauda_F1 Loved chatting with you yesterday. All the best. https://t.co/ov42ri09fE Visita de ayer a @TrasoAC con la fundación @LaureusSport y campeón @LennoxLewis en México #sportforgood https://t.co/nN9tEDVEj4 @LaureusSport  @TrasoAC @LennoxLewis gracias a vosotros por darme la oportunidad de conocer y apoyar este proyecto. #sportforgood @carlosainz un placer volver a verte!! Un abrazo fuerte. Llegando al auditorio Expo Santa Fe para #WobiMéx , luego os cuento más... https://t.co/7IXAUw8Pz7 Mi primera titularidad en el Barça llegó tal día como hoy, hace 17 años, contra un equipo sueco ¿sabéis cuál era? #tbt https://t.co/YjzUNwrCym Me espera un largo viaje, pero se me hará más corto leyendo las batallas de @FBelasteguin https://t.co/ri5pyN53S7 Resultado? #FCBCity Sorpresa con las aliniaciones? #FCBCity Barça-Manchester City. El mejor partido que se puede ver hoy en día? Partidazo un lunes. Liverpool-Manchester U. Resultado? @marcmarquez93 pentacampió del món! Enhorabona crack! #givemefive Enhorabuena @FBelasteguin y @pablojoselima uno más. Ya estáis preparados para jugar contra nosotros...😜#losmejoresdelmundo Adivináis quién estaba lanzando la falta? 🙈🆘 #TBT https://t.co/vSJDacVuYN @EduPolo @3gerardpique me suena todo esto... bona nit Penalti o no? Yo digo no Partidazo. Italia-Espanya resultado? Con dos grandes del fútbol, @Deco20oficial y @piresrobert7 en el lanzamiento oficial de #StarSixes https://t.co/1BlBwo0GFE Vaya equipazo hemos formado los de #LaLigaAmbassadors! Sólo nos falta vestirnos de corto! 👍 https://t.co/qYsHjM3b0s Content de tornar-te a veure amic, en la inauguració de #AspireSummit16. \n\nA pleasure to participate in the opening of @A4Stweets https://t.co/Al2aLDEcNW Hace 17 años debutaba en el primer equipo del @fcbarcelona. Siempre estaré agradecido por todo lo que me ha dado el fútbol. #gracias https://t.co/Wv3LNBm4FJ @FCatalanaPadel @MarceFerrari81 enhorabona cracks!!! 🔝 @FBelasteguin @pablojoselima enhorabuena fenómenos!!! Con el más grande dentro y fuera de la pista. Un placer pelotear contigo amigo @FBelasteguin (por desgracia no se me pega nada 😜) https://t.co/9UqgkJZAwc Partidazo, Barça-At Madrid. Resultado? El deporte nunca deja de sorprendernos: vaya final de triatlón con los hermanos Brownlee. Felicidades @mariomola! https://t.co/uguFS548aS Volver a disfrutar del fútbol! Más fotos en la nueva app @Olyseum. Descárgatela en https://t.co/tD1Z889QLJ https://t.co/MccGvmRoR9 Calzarme las botas siempre es un placer. Shukran Beirut! Encontraréis más fotos en Olyseum #JoinTheMatch Olys.me https://t.co/pt4S7wz19i @FBelasteguin @pablojoselima enhorabuena pareja. Abrazo fuerte Joyeux anniversaire mon frère! @EAbidalOfficial https://t.co/kMUlr1Okhd Bon dia i bona diada! “Tomar el dolor, aprender del dolor y ganar por el dolor” @TheSlyStallone estuvo en el #MSXXI, gran charla! #tbt https://t.co/qGNBmCTfRf RT @olyseum: Cambia tu manera de vivir el deporte con Olyseum. ¡Descarga ahora la app! https://t.co/uQdrb5CsSi #JoinTheMatch! https://t.co/… Bienvenidos a @Olyseum! Conoce la nueva red social para adictos al deporte #JoinTheMatch! https://t.co/vCsghChkgy https://t.co/fHhiJg6D8F Coleccionabais los @paninicromos de @LaLiga? Es momento de empezar el de esta temporada. Yo ya tengo mi cromo XXXL 😂 https://t.co/AJG5d67xt1 Mucho ánimo y fuerzas para @BrunoHortelano y su familia. Espero verte pronto compitiendo como tú sabes #FuerzaHortelano Inolvidable formar parte del #MexicoSigloXXI y estar rodeado de gente con tanto talento. Gracias @FundacionTelmex! https://t.co/DGPKAae6Bf @arturoelias 10-7 4-10 12-10 me ganaste pero pronto te ganaré, estoy seguro...💪👍 Enhorabona @maverickmack25. Quién ganará la carrera de #MotoGP? @EAbidalOfficial siempre proponiéndose nuevos retos! Suerte en las #24hBCN! @Vanesalorenzo_ ❤️ Un honor conocer a la familia Slim  y el increíble trabajo social que hacen para su país #vivamexico https://t.co/cc27ZIykqW Preparados para dar la conferencia en el #MexicoSigloXXI de la @fundaciontelmex. Un honor formar parte de este grupo https://t.co/6rxDYI3Ykf Mexico, here I go... https://t.co/fLVn68tHyH Buen partido de Padel... Parece que nos han atacado un poco. 🙈💪🏼 https://t.co/InoECLRTdd Que golazo!!!! 🔝 Moltes felicitats @BoKrkic! 26 anys i molt de futbol! Sort aquesta temporada a l'@stokecity! https://t.co/qIIOYVKLym Se acabaron las vacaciones, pero siempre hay tiempo para comer con los amigos 🔝 https://t.co/mwv1nVfZc5 Tanti auguri @DemetrioAlbe! Que golazo!!! 👌👌 @JordiMuns_26 ok, ja has fallat el primer 😜 Hoy maraton de partidos: Stoke - Manchester City. Barça - Betis. Sevilla - Espanyol. Resultados? Adivináis qué me estaba diciendo el míster en esta foto? 🤔 #tbt https://t.co/OjI4sjTM2J Good workout 💪💪 https://t.co/an6V8XmOPw Empieza la temporada oficial #Supercopa https://t.co/OIUsnfrBie Molta sort @marcbartra en aquesta nova etapa al @bvb #supercup #bvbfcb Disfrutando del Mediterráneo. #Menorca #familia #jump https://t.co/BTd6MRWVnR Top!!👌👍 https://t.co/CRLX4PWptV Felicitats @rafaelnadal i @marclopeztarres per l'or a #Rio2016 La guinda de las vacaciones es que @Oriol_Balaguer te prepare tu postre favorito. Moltes gràcies crack!!! https://t.co/aMe9R2ppjp Disfrutando del juego de mis compañeros. Molta sort amics en aquesta nova temporada #GamperFCB https://t.co/8Lb3TJB5iH Enhorabona per la teva acadèmia @RafaelNadal. Des de la teva terra et desitjo molta sort a #Rio2016. Una abraçada! https://t.co/ETgVHaRMG0 De cumple en el @cottonhousebcn Felicitats @xaviyeye! https://t.co/scszCN7iVT Aprovechando las horas de menos calor para hacer deporte. #padel #friends #precumple https://t.co/HPs3QtXiNk @albertboix @3gerardpique @jordidilo va tenir que venir amb mi per poder guanyar un set... #426miles #tbt Vaya par de chavalines @1victorvaldes, ¿sabéis qué temporada era? https://t.co/t0ps8Wmton Comiendo con Iván. Con él, las comidas de trabajo saben mejor! https://t.co/gcKMKrKkac Entrenament de bon matí ✅ A gaudir del diumenge ara! #lacarreteradelesaigües https://t.co/nOfgFxp1CG Que golazo!!! 👌👏👏 Echando de menos las puestas de sol de Ibiza. Missing Ibiza's sunset. https://t.co/lLirVGo7ai Molt agraït a la @FundacionCruyff per pensar en la Pobla de Segur i en mi. Mira tota l'entrevista al meu Facebook! https://t.co/UEh0xQW3Dg Último día en Ibiza y ya de vuelta a Barcelona!  Last day in Ibiza, coming back to Barcelona! https://t.co/E1miHMqCzF @MarceFerrari81 @FBelasteguin @3gerardpique @xaviyeye 👍👌💪 @DeporteslaSexta @3gerardpique quién ríe último ríe mejor... 6-3 6-3 6-1 listos @FBelasteguin @MarceFerrari81 @3gerardpique Marcela tu trabajo da sus frutos, Victoria fácil, la tenía que sacar xo podía romper un cristal. Sort en aquesta nova etapa @MarcBartra! Viel Glück! https://t.co/ZALbOjXp4c @MARCATV @3gerardpique esperaba ganar 6-0 6-0 6-0 y gané 6-3 6-3 6-1 listos... @3gerardpique a mi no m'ha costat tant trobar un error teu 😏😉😘  6-3 / 6-3 / 6-1 https://t.co/TYGgZKIx0u @3gerardpique si si... El @xaviyeye juga molt b xo 6-3 6-3 6-1 no ho fa sol un... Com vam jugar a casa teva tens el control de les imatges @3gerardpique prefiero que Geri diga el resultado...💪👍 Resultado? @3gerardpique ??? 😜 https://t.co/zPkDotvfRQ Quién ganará? #426challenge https://t.co/NAqMB3pHmn T'has retirat @3gerardpique ? @Carles5puyol gana el mejor y el más listo. Felicitats @marcmarquez93 y su equipo. Puede ganar @marcmarquez93 ? Llegará? @CerroDaza me encanta, después lo miraré. @Carles5puyol recuperará @lorenzo99 ? Ahora un poco de #MotoGP, quién ganará? Me preguntaba cómo habrás dormido esta noche sabiendo lo que te espera esta tarde en la pista...  Nerviós amic @3gerardpique? 😜 Gracias @setoo9, pronto nos vemos. Un abrazo hermano! Ya en Barcelona después de lo sucedido en Turquía. Hemos pasado algún momento de incertidumbre, pero estamos bien. https://t.co/755RJiy6Wt Already in Bcn after all that happened in Turkey. We always felt calm and safe. Thanks @setoo9, big hug brother! https://t.co/cbx1ek2k5O On my way to Turkey with good friends! Eager to play again with them! @EtooCharityM https://t.co/ofPdVhVnIH Orange: old boots. Yellow: new ones. One pair have much to tell, and the other much to write! #NewBootsSamePassion https://t.co/Ulj57VdNPZ Naranjas: botas viejas. Amarillas: nuevas. Unas tienen mucho que contar. Las otras, lo tendrán #NewBootsSamePassion https://t.co/2kdkGjX0l9 @sergibrunet necessites un plat... Yo quiero ir!💪🎾 abrazo a los dos  https://t.co/HwdCIkrMoG Hoy final de la #Euro2016. Quién creéis que ganará? Today is the final! Who will win? Un año más apoyando el torneo XAP de golf solidario en beneficio de @HSJDBCN y todos los niños y niñas ingresados. https://t.co/l5IIQ7xoMk Un any més recolzant el torneig XAP de golf solidari en benefici de @HSJDBCN i tots els nens i nenes ingressats. https://t.co/K3mn4UMidw @1victorvaldes molta sort nanu!!! Estic segur que tornaràs a ser el millor. Abraçada forta. Hace 6 años marqué uno de los goles mas importantes de mi carrera #tbt https://t.co/jxD3aMkfow Tantos años disfrutando con los mejores, algo he aprendido! 😂 https://t.co/wfIzRthECN Content d'ajudar al Torneig XAP de golf solidari en benefici de @HSJDBCN al @golfllavaneras. https://t.co/eFTdLoTYxZ https://t.co/xwwgzXagdx Gracias por todo míster! Un maestro dentro y fuera del campo. #GraciasVicente https://t.co/bhj44As7qu Espectacular partido de pádel, un solo set pero 12-14 https://t.co/IalkhXbh10 Y vamos a por las 5 horas de retraso... Llegaremos a casa para ver la final de la #EURO2016 ? Vergonzoso... #AtrapadosEnUnAeropuerto Un día de trabajo con Iván en París https://t.co/0NtmVRDvxx Partidazo en Saint Denis, qué buenos recuerdos me trae este estadio. Suerte @SeFutbol! #Euro2016 #ESPvITA https://t.co/EnkHbSWYgg Ánimo Leo, eres el mejor! https://t.co/ST8dtsz8eb Feliz cumpleaños @RaulGonzalez! Disfruta del día y tranquilo que para nosotros no pasan los años 😉  #rivalesnoenemigos Despegamos ✈ , nos vamos a París! #EURO2016 No podría tener mejor guía @EAbidalOfficial https://t.co/GfZWl1EAW7 Mañana de padel, tiembla @FBelasteguin 💪👍 https://t.co/bJZmgBRrMY Croacia-Portugal Quién ganará? Resultado? Ajudem als nens i nenes amb immunodeficiències! #bombollesdecolors  @boxets @fundacioIDP_Bcn https://t.co/o1O4n2cs7X Hoy cumple años un genio del fútbol. Felicidades Leo! #messi29 https://t.co/fHj7osfxQD 4 años sin #MikiRoque. No t'oblidem. https://t.co/qROHFRx8lK @EvaGayoso mucho que aprender... Nos vemos pronto. Abrazo Espectacular tarde de padel!!! https://t.co/ibV9d4Hk5Q #fallespobla2016 https://t.co/fGwGBx1Kxf Buen fin de semana! #vivalavida Have a nice weekend! https://t.co/d4xFl6N0wA Footalent contra @CSM_worldwide, ¿quién ganará? Footalent vs CSM: who will win? https://t.co/4rUFxtzSfh Con el número 1. Un placer verte y espero jugar un partido pronto, @FBelasteguin. https://t.co/IcneLIHkkf https://t.co/4BbPHxTrsL Vaya espectáculo el concierto de @coldplay de ayer noche! Amazing show last night! https://t.co/IjNjWOneix Noche de concierto en un sitio muy especial. Grandes recuerdos! https://t.co/kHuOMQGXhD En Londres, donde le espera una sorpresa a @Vanesalorenzo_ https://t.co/K3ypGTyvrQ RT @FundacionCruyff: Os dejamos el vídeo de la inauguración del ‘Cruyff Court @Carles5puyol’ en La Pobla de Segur! https://t.co/knuYa2N5EF… 4 millones en Instagram, gracias! ¿Eres uno de ellos?\nWe are 4M in Instagram. Thank you! https://t.co/Ea7uQL1HPE https://t.co/s01PYgYhot Com t'agrada passejar-te per l'àrea @3gerardpique ! ¡Y vaya centro @andresiniesta8 ! ⚽ Buen inicio @SeFutbol #EURO2016 Gracias por la clase @alo_oficial, para cuándo un partido de fútbol?😁 Ya vi que también tienes un guante en el pie! https://t.co/Fnx7H6yKG1 Happy birthday Sir Jackie Stewart. It's been a pleasure to meet you at #CanadianGP https://t.co/PSYJIHIhIB Vaya familia de cracks que me he encontrado en la @F1 ! Mucha suerte @carlosainz !  @CSainz_oficial #CanadianGP https://t.co/S49m8WyxPN It seems it's gonna be an interesting week end in Canada. Do u recognise everybody? @Heineken #IfYouDriveNeverDrink https://t.co/BiyLbde2Cq Gracias a todos. Es un honor estar en el 11 histórico de la Eurocopa @UEFA An honor to be in the All-time Euro 11 https://t.co/TC62oI3qHA Muy contento de inaugurar una #CruyffCourt , junto a @JordiCruyff, en mi pueblo, La Pobla de Segur @FundacionCruyff https://t.co/fXyG3W2KWr Un plaer estar a la festa dels 40 anys de @latdp 📻 i content de tornar-te a veure, Pep. https://t.co/HyExlDGlbg Felicidades campeona! Gran victoria @GarbiMuguruza ! #RolandGarros La actitud es una forma de vida, RIP #MuhammadAli Día triste para el deporte. Mi más sentido pésame a la familia y amigos de Luis Salom. DEP Me quito el sombrero 🎩 Cómo suben los futuros cracks de @LaLiga #LaLigaPromises Nice move! 👍⚽ https://t.co/i2yTQlWFKL ¡Qué juego en equipo y golazo! ⚽ Estos niños prometen #LaLigaPromises @LaLiga 🔝 https://t.co/iUrBsD3X2Z Si no fuera porque nuestros compañeros de equipo no tenían 12 años 😂 @RaulGonzalez  #LaLigaPromises @LaLiga https://t.co/4MfFMQBcFP Un placer estar en la presentación de #LaLigaPromises de @LaLiga y volver a encontrarme amigos como @RaulGonzalez https://t.co/54X07ai2bN Amazing 2 days in #cairo Hope to be back soon! Thank you @heineken for the invitation! #UCL https://t.co/bh5GnFEEv0 It has been a pleasure to attend at the lauch event of the 2018 @fifaworldcup Volunteer Programme in Moscow. https://t.co/MizHGLzOPZ Mañana hace 7 años que conquistamos Roma. #TBT #UCLfinal https://t.co/tOOqvHaSdW Felicitats equip!!! Doblete para cerrar la temporada. Sou collonuts!!! Visca el Barça!!!! Disfrutando de la Final. Sort companys! 👍  #CopaFCB https://t.co/DNMLAQqXtn Felicidades @SevillaFC por la victoria ante el Liverpool y por la quinta @EuropaLeague !! 👏👏 ¡Hace 10 años vivimos un momento histórico! 🏆🏆  10 years ago we lived an historic moment!! #Paris2006 https://t.co/WeINGSYazU Campeones! Este equipo no se cansa de ganar // Champions! This team doesn't get tired of winning. Visca el Barça!👏🏆 https://t.co/PZP20XIwuR Campions! Moltes felicitats. Aquest equip no es cansa de guanyar... Sou els millors. Visca el Barça!! #CampionsFCB https://t.co/b9QuWBu1hp Check me out in the latest #ChampionTheMatch film. I had a lot of fun, thanks @Heineken! https://t.co/zRwiLUSTpi Feliz de volver a veros y jugar con vosotros @10Ronaldinho y @setoo9! // Happy to see and play again with you! ⚽ https://t.co/3Qv8NXHtAb Una amistad VERDADERA. Nada puede llenar el vacío que me has dejado, Soci. Nunca te olvidaré. Te quiero. https://t.co/4JHgDM4ygf Felicidades Leicester! El esfuerzo y la constancia tienen premio / The victory of effort and perseverance 📸:lcfc https://t.co/zIdI30pAw8 Dos años sin Tito... No te olvidamos. #TitoEtern / Two years without Tito. We don't forget you. https://t.co/gdMzf21sVj In honor of Johan Cruyff, his foundation shows why being active allows you to move forward https://t.co/raU4pNDZyy #14forever Interesantísimas e instructivas ponencias en la X Conferencia \"Gestión de Empresas Deportivas\" de @iesebs https://t.co/Sy635SWgA6 Deporte y amigos… la mejor forma de empezar el día! / Sport and friends… the best way to start the day! 🎾 #paddle https://t.co/MXPpiNoAD6 Foto para @LAF_Magazine https://t.co/puJ3fYfVtJ RT @JordiCruyff: Un momento verdaderamente emocionante. Gracias a los @LaureusSport por el homenaje. #LWSA16 https://t.co/98ht64AG3u Congratulations @DjokerNole Nice to meet you https://t.co/yelWYIxLCQ RT @FCBarcelona_cat: 🎥🏆 Johan Cruyff reconegut amb el premi a l’Esperit de l’Esport per Laureus Sport https://t.co/vyLaPNUlcS #FCBlive http… En la gala de los @LaureusSport #LWSA16 https://t.co/ei06qznL8c Feliz de verte amigo y bienvenido a la familia @LaureusSport #rivalesnoenemigos #SneakersforGood #amigos https://t.co/uFXxIqrmoE RT @LaureusSport: Raul and Puyol ⚽️⚽️\n\n#legends https://t.co/PSbKItE8FK #SneakersforGood @LaureusSport! You decide! Which 👟 is the best? And @3gerardpique @SergioRamos you are next! https://t.co/W4Sd50qfmK Muchas gracias Vietnam, no me esperaba tanta pasión por el fútbol. Han sido 6 días fantásticos. https://t.co/TDe26s81yW Thank you Hanoi for this amazing welcome. Cam on Ha Noi vi su chao don tuyet voi nay !!! https://t.co/uvs64kfEhI Good memories with this trophy. Que recuerdos. #championthetrophy #Vietnam https://t.co/wtwV9N0VvF The sun will always rise... https://t.co/h8sebK5MHi Enjoyng Hoi An old town. Disfrutando de #Hoian https://t.co/hM9DHQJEwZ No me esperaba esta acogida en Vietnam. Amazing atmosphere, thanks for everything.#championthetrophy @GullitR https://t.co/WG2ZWw4Z90 RT @GullitR: Fantastic fans in #vietnam #championthetour with @carles5puyol https://t.co/CaxHpdlWwR Good morning #hochiminhcity. Here I am with the champion's league trophy and this legend. #championthetrophy https://t.co/ZIpwBOeyFV Long trip, today on my second flight. https://t.co/dGS1vjA5ar Mirando el partido antes del vuelo. Watching the game before getting into my flight https://t.co/Jqr2bgH178 Working on my way to Madrid. https://t.co/dffO0XC4JK Bonita experiencia ayer en el @museoreinasofia con muy buena compañía. #IñakiGabilondo #LolaCarretero https://t.co/INDHSYXyA2 On my way to Madrid. https://t.co/tGRJxjrxfo Brutal!!! #GraciesJohan  https://t.co/lJzmW0oeQX Gracias por todo mister. Pocos han influido tanto en este deporte como tú. Te echaremos de menos maestro. https://t.co/CYVR5rBw7s RT @Borja_Pardo: Sobre Johan Cruyff y ese hijo de puta sin forma definida | https://t.co/vGNDXJBvCB  #JohanCruyff #EstadiJohanCruyff https:… Who is she? https://t.co/NUoQmtNpXo True love!!! #FelizDíaDelPadre https://t.co/rkYTTsU87x Qué Estoy cocinando? What am I cooking? https://t.co/rj9s8wbJ0S Comiendo en Cabrera y encontrarte esta botella justo en la espalda... #wembley #recuerdos https://t.co/AT53A3p1KA I love Barcelona #thebestcityintheworld https://t.co/Pb4djf2O8n #tbt three years ago... https://t.co/VMBilw9QdD En Arco en buena compañía. https://t.co/CNBxEtqln9 😱😱⚽️⚽️ RT @10Ronaldinho: ⚽ ⚽ Xavi, Frank Rijkaard, @Carles5puyol https://t.co/oeZEM9EqmJ @VictorTomas8 enhorabona crack i sobretot a @FCBhandbol per tenir un capità com tú! Abraçada!!! Felicidades por la renovación y gracias por tu confianza, contento de seguir este camino juntos. https://t.co/JjqVRrx6sy Having a coffee with my partner Ivan in Manchester https://t.co/8I2jRJtnz4 RT @LaVanguardia: La lucha de Ari contra la leucemia, una inyección de energía y optimismo https://t.co/YrdR7uCbDk Por @anamacpherson #tbt la persona que nos devolvió la sonrisa. The one who put a smile back on our faces. @10Ronaldinho https://t.co/iYNktvwjEJ RT @LaureusSport: How much does @FCBarcelona legend @Carles5puyol remember about his career?\n\nWe decided to find out...\n\nhttps://t.co/govQo… Enhorabuena Leo. 5!!! Te lo mereces. Gracias por tanto. Enhorabuena @LUISENRIQUE21 You are the best. 👍 Bienvenida María!!! Feliz!!!! https://t.co/OwOM0I7nPN Estamos muy felices de comunicaros que nuestra segunda hija nació el pasado dos de enero. Ya somos 4 en la familia. Bienvenida Maria!! Que golazo!!! 😳😳 Tic tac tic tac... https://t.co/AfpcqoCNIo Gran partit @FCBbasket enhorabona!!!! Mañana de entrenamiento con estas espectaculares vistas. Love Barcelona. https://t.co/WuFE5n2S2G Enhorabona Campions!!! Este equipo no se cansa de ganar, orgulloso de mis amigos. Visca el Barça!!! Con el gran @10Ronaldinho un placer volver a verte amigo. https://t.co/FlsBzhEKXJ RT @NuriaPicas: Touching, emotional, solidary. We are Nepal. @Carles5puyol @onacarbonell @kilianj #SOSHimalaia https://t.co/KmR5pVX6Vp RT @onacarbonell: Presentación de 'Langtang' de @kilianj con @Carles5puyol y @NuriaPicas! \n#Nepal #SOSHimalaia #SummitsOfMyLife https://t.c… RT @LaureusSport: What a morning! Thank you @SpecialOlympics and our Academy Members Edwin Moses, @LuisFigo and @Carles5puyol! 👏🏻 https://t… #tbt con el fenómeno @andresiniesta8 #crack #amigo https://t.co/quXMLkQCAN #laligaambassadors https://t.co/aLwqVcVjxp I’ll be on the jaberstadiumkw opening on the December 18th for the Kuwait Champions Challenge:… https://t.co/Dykhqpbrjz With my British and American teachers. https://t.co/gJLPv9SDap En la #GalaSida. Increíble el trabajo del Dr Clotet y todo su equipo en la lucha contra el sida. https://t.co/TceRvWTo2V Hoy en el @elpais_deportes entrevista con @rbesac, un plaer mestre. https://t.co/a6WRSQtAhM https://t.co/s7ebtAXUsT Contento de volver a verte amigo. See you soon davidvilla #ny #amics #futbol https://t.co/nNNxeccjc3 Descubrir NY es todo una experiencia y con buenos amigos mucho mejor... https://t.co/2OYFdNBvuv Yankee Stadium last night. Meeting up with davidvilla https://t.co/gVIQjJvGys Mi amigo @domingozapata creando en su estudio de NY. Que fenómeno. https://t.co/dCri8XvfKC #tbt #2009 #rivalesnoenemigos #capitanes #derby https://t.co/ASxctzoUeg Breakfast time!!! #NYC #familia #oatmeal https://t.co/XgvoLGg6dh See you later Barcelona! #fly #familia #mevoyaestudiaringles https://t.co/1N6SEjNXuR #TBT El 2 de octubre del #1999 empezó todo. No me cansaré de dar las gracias al fútbol por todo lo… https://t.co/HxTw8CodMM RT @ClubsDiR: El gran @Carles5puyol apadrina el Pedaleja per Unicef! @W_Barcelona @unicef_es Mira el vídeo! https://t.co/kGaSYWZy7V http://… Celebrando el cumpleaños de mi hermano en nuestra Masia familiar!  putxi9 #40aniversari… https://t.co/vXceWIwoFO Ahora un poco de Inter-Milan.\nResultado? Feliç Diada a tothom!!! Recuerdos del viaje a Mónaco. https://t.co/YsxBdJlT8i @CarlesCapde ànims!!! Abraçada. Disfrutando de la #galachampions, contento de encontrarme otra vez con alguno de mis compañeros y… https://t.co/o5XvEL7R20 The best!!! Felicidades leomessi https://t.co/FJMqUMONeE Aprovechando los últimos días de vacaciones, ilusionado con nuevos proyectos que me esperan en… https://t.co/HdQyiGagK5 Mucha suerte _pedro17_ te deseo lo mejor! Y muchas gracias por todo.Abrazo fuerte amigo! #graciespedro https://t.co/r6SuGR0NK9 Un placer conocer ayer a domingozapataofficial y poder disfrutar de sus cuadros. https://t.co/dBCYCCyCdY Felicitats equip!!!! Que partidazo. Seguimos haciendo historia. Visca el Barça. RT @Vanesalorenzo_: FINAL SALES. You can shop my #Summer Collection at http://t.co/fwpfii8jAT Encuentra las últimas… https://t.co/o2oAH5Hkgc Cena con @vanesalorenzo_ en Ibiza. #ibiza #love #lamejor https://t.co/QzAjkF5pCM Una gran sorpresa encontrarme en Ibiza con Maldini, todo un referente para mi!! #crack #ilcapitano #Milan-Barça http://t.co/gESpPNYShf @onacarbonell felicitats!!! En Ibiza con amigos y família. @tricicle @nuriacun @vanesalorenzo_ #carles #Ariadna #Xavi #MariaAntonia https://t.co/5Ici4D5pnh Avui és un gran dia per als barcelonistes! Visca el Barça. 3gerardpique #Milan #Xavi https://t.co/5tcOVVTgt1 Visca el Barça!!! https://t.co/MBGKq1Msau Estamos muy felices de comunicaros que esperamos nuestra segunda hija para enero @Vanesalorenzo_ http://t.co/9UyBe6v8ps Por encima de los colores están las personas! Mucha suerte amigo. Abrazo fuerte @CasillasWorld http://t.co/EnyRst1pdY @NKARABATIC mucha suerte fenómeno! Abrazo fuerte Amics! @javipobla @xaviyeye putxi9 #Frank https://t.co/aWj0AYJL3X Una de las mejores personas y más auténticas que he conocido en el mundo del fútbol. #Frank #crack… https://t.co/NIZaCN2xLB En La costa Brava celebrando el 10 aniversario de boda de #Xavi&amp;Pingu @vanesalorenzo_ @javipobla… https://t.co/LrolK3ULq3 RT @EduPolo: Tres años sin Miki Roqué. Hoy emociona especialmente escuchar a @LidiaGuevara, Volveremos a encontrarnos  https://t.co/sozer9i… Cenando con grandes amigos. #lomejordelfutbol #amigos @DemeAlbe #lopelat #lopelut #friends https://t.co/jfwNtoYLBr Content d'ajudar al #XTorneigXap a favor de @HSJDBCN demà al @golfllavaneras http://t.co/bB6K0ncLzb @GrupoConstant http://t.co/gaoNkSGggL Good morning. My English is improving every day.👍 thanks Cristina, Matthew, Paco. #berlitzspain… https://t.co/2V1UmU32HM Felicidades Zubi, este triplete también es tuyo!!! Son els millors!!! I ho han tornat a demostrar. Felicitats equip! Visca el Barça. Hola 3gerardpique tot bé? https://t.co/wW1Ano1cKR #6raciesxavi https://t.co/WGDGmp6ch4 Felicitats campions!!!! Sou collonuts. Thanks for everything @ehfcl #final4köln @victortomas8… https://t.co/sqC42hymim Campiooooons!!!!! Felicitats equip! A per la 3era. 👍⚽️ Gracias a @ehfcl por la invitación a la final4. Som-hi Barça!!! A tope @victortomas8 https://t.co/f5v6RlCRdj RT @EAbidalOfficial: Ça fait 4 ans de ce moment magique #Wembley2011 #ChampionsLeague. Merci encore @Carles5puyol http://t.co/jaVqWp7TZ7 I Miss you @vanesalorenzo_ T'estimo!! https://t.co/AYpppOt4Do @EduPolo @FNavarro_3 😉 Felicidades @FNavarro_3 me alegro mucho por ti! Abrazo fuerte Enhorabuena al @SevillaFC @3gerardpique @GoldenMgr 😱 http://t.co/a9ct57eVzX @3gerardpique @GoldenMgr Ya veremos quién gana la liga... Vas a publicar una foto también? 😬😬💪💪 petó Nanu!!!! RT @GrupoConstant: El proper 18 de juny celebrem el 10è #torneigXAP amb @Carles5puyol com a padrí! T'hi apuntes? http://t.co/p8imaCemyD htt… Feliz de estar a tu lado hermano! Te mereces todos estos reconocimientos. Abrazo fuerte. https://t.co/FsUH4jN8da Felicitats campions!!!! Sou els millors. Visca el Barça! Grande @_Pedro17_ ! Se lo merece. Bon dia! Antes de entrenar, un batido verde. Let's go!!!💪 #espinacas #plátano #vitacoco https://t.co/Y3l4TERwlU Eating with #delapeña @javipobla abrufaup #Oh'Bo #sol #barcelona #amics https://t.co/NmvSrTrRMF Felicitats equip!!! Sou Molt grans. Visca el Barça!💪👍 Ya os habéis descargado el juego #EpidemiaTheGame? Ayuda a ganar la batalla al #sida http://t.co/uHU7Y1VHAc http://t.co/DU39dc1OUZ I'm studying English at the Berlitz academy in Barcelona. Let's go! #Berlitz https://t.co/bzMtcXQQ6b Que grande es Carles Sans! No puedo parar de reír... https://t.co/SXnk9RjRkz #EpidemiaAlert http://t.co/SNZEtBc20Y Download Epidemia The Game in your smartphone &amp; help ending #AIDS: http://t.co/uHU7Y1VHAc #EpidemiaAlert http://t.co/cHr7giErg3 Bájate Epidemia The Game en tu móvil y ayuda a acabar con el #sida: http://t.co/uHU7Y1VHAc #EpidemiaAlert http://t.co/vMFXbSJ2rq Barcelona en pareja, disfrutando de #CottonHouseHotel  un edificio con historia y un servicio… https://t.co/eiTCpQpoIK Good morning!!! https://t.co/UjmxPOv08c Good memories whith @vanesalorenzo_ in Shanghai https://t.co/iqxl20DJQj @EduPolo nanu a veure si et sancionaran...  #JusticiaParaTopo Feliç diada de Sant Jordi!!! Os recomiendo el libro de mis amigos del @tricicle #delaZalaA #santjordi… https://t.co/PvHKzyTo9s Bon dia! Ya en Barcelona, empezando el día con el último disco de @MacacoMusic #HistoriasTattooadas Buen rollo y talento. #laureusawards #Cantona #mito https://t.co/glHJi2cboi Saque inicial del partido de niños en Shanghái con Laureus. #laureusawards #shanghái #fútbol… https://t.co/65TmCBw3ch Preparando el partido de Laureus en Shanghái con algunos de los grandes del fútbol. #laureusawards https://t.co/FuUqVACGBy Shanghái! https://t.co/NdoSFUZLG3 Empezando el día con un batido energético que me da fuerza para entrenar. Feliz sábado. #espinacas… https://t.co/YEqzwpyhEF Último día en Sri Lanka con tormenta tropical. https://t.co/d9k3jmR15k Wow!!! https://t.co/71Vdj4XSQx En #UdaWalawenationalpark,disfrutando de esta increíble naturaleza. 🐘 https://t.co/Sgtn76mrJl #beach #paseo #relax #holidays #platja #love https://t.co/5NSyGPwIVQ Días de vacaciones en pareja. #holidays #pareja #love #piscina #paraiso #primerbañodelaño… https://t.co/d3BJhn0PvG Bye Bye Barcelona, see you later.  @vanesalorenzo_ https://t.co/rLvtKk1Vi6 @The_real_Gio mucha suerte!!!! 💪 abrazo fuerte. Gran @3gerardpique ets el millor!!! Felicitats equip. A seguir. Visca el Barça!!! Si eres flexible, te mantendrás recto... Ens veiem aquesta nit @JORDIRIOS @lamonicaperez. Molta merda cracks. Un día muy emotivo en la presentación del libro de Miki Roqué. Os lo recomiendo #laluzdemikiroqué… https://t.co/s5HKBuAU9O Muy contento de la visita a la sede de la FIFA y recordar grandes momentos del fútbol. #FIFA #fútbol… https://t.co/3mbPZHmEnO @PasuzuTweet @javipobla quin llibre? Jo no tinc res. 😬 Ready for training💪 https://t.co/1wYtsdS4N3 Cenando con la familia en el Raval.\nFelicidades elenalorenzo_ 😘😘 http://t.co/2KpgqqnDuu RT @diana_pintado: Vanesa Lorenzo…….PRUEBA desde el minuto 1…. ;) http://t.co/ePiEwpCvHr http://t.co/UddkHhhlGn @ainaclotet molta merda guapa! Petó Buen entrenamiento con @javipobla , ya falta menos para poder jugar a pádel. http://t.co/OSDh6oyuaA @inmakola 😉 un abrazo La mejor compañera de viaje. @vanesalorenzo_  #GalaMD http://t.co/1jRHBK0kSM Con dos referentes. Cracks @nkarabatic eabidalofficial http://t.co/L9SBdV7W7C Muchas gracias hermano, eres muy grande. http://t.co/3HBPlGdhJL Hoy una hora de Eliptica, la rodilla cada día responde mejor. http://t.co/NUT7wAcz2J Y para terminar un poco de #acroyoga con  @vanesalorenzo_ Un abrazo y buenas noches. http://t.co/dkr7cJhneu Practica de ashtanga yoga con @vanesalorenzo_ y @xuan_yogalan #yoga #flexibilidad #concentracion… http://t.co/ACzbLUxItn @ALVAROGP77 me alegro mucho fenómeno. Un abrazo Pizza time! Friday night. #latremenda  @vanesalorenzo_ http://t.co/7uoFHhvJww http://t.co/UMGj9NNnkb\n\nUna crónica de nuestro tiempo en forma de canción. Una forta abraçada amic @MacacoMusic Suma y sigue... 💪 http://t.co/qJor3g14TS Suma y sigue... 💪 http://t.co/7uR76hWStm Ànims amic @BoKrkic abraçada forta!!! Bon día. 1h de entrenamiento con @javipobla en la carretera de les aigües.💪 http://t.co/umStqjdStQ @3gerardpique a veure si encara m'hauràs de tornar a posar al joc... Jejejeje Comiendo con @javipobla @xavimolist @nayrajosy en el Caliu de Finestrelles.\n#cargols #amics #futbol http://t.co/srzitLKMIZ Los nuevos modelos de mi marca CP5. Los podéis ver en la web. http://t.co/p3rElRSE93 o en:… http://t.co/lhg4Jyd2yY Después de entrenar, ahora un poco de lectura... http://t.co/zRuSjGP8KT GRAZIE per la disponibilità che ci ha permesso di visitare i vostri centri di allenamento e di conoscere la vostra organizzazione. GRAZIE al @acmilan @Inter @juventusfc per averci ospitato in questi. GRAZIE a tutte le persone che abbiamo incontrato. Muy amables Grazie per la splendida giornata! http://t.co/sWklUzJbGm Hoy el otro equipo de la ciudad. Un placer saludarte Mancini. http://t.co/iU8YXRU7ZQ En el museo del Milan con dos grandes amigos. Iván De La Peña y Demetrio Albertini. http://t.co/Ys0X9SYBlX Hoy en la Casa Milan. #Milan #Idolo http://t.co/Sr9mBnYe05 RT @verobrunati: Ya estamos en el Camp Nou para pedir #JusticiaParaTopo , nos acompañan? http://t.co/4x6qEGSWbp Leyendo la historia de Andre Agassi. http://t.co/4xehU3wr3E Hoy entrenamiento en la carretera de les aigües. Que gusto tener un sitio así tan cerca de casa. Adjunto comunicado sobre mi despedida:\nhttps://t.co/Xu5wiX60Pn Un 2014 con luces y sombras, llega un 2015 con muchos sueños e ilusión.\nRodeado de amigos y familia.… http://t.co/9KfoBKyltD RT @LaVanguardia: Más de 135.000 personas firman para que la zoofilia sea delito en España http://t.co/8OSzt1pbi7 http://t.co/RoLgvydgui RT @Nescafe_ES: @Carles5puyol mira cómo tu tweet #IluminaLaNavidad ha salido hoy a las 19:57 http://t.co/bhjq3DOjV0 La Navidad me hace recordar tantos buenos momentos de mi infancia... #iluminalanavidad Gracias hermano, eres un ejemplo de lucha. Mucha suerte en tu nueva etapa. http://t.co/mhThJfYZwc Thanks for everything. http://t.co/hxPvgNhfLj Conseguido el diploma de director deportivo, a seguir con nuevos retos. http://t.co/LyXFBA0TvC Merci mon ami pour ton football. http://t.co/K8ymsf6FeD #LaMaratóTV3 2014, dedicada a les malalties del cor! http://t.co/67OI2uUJjk Vuelta a Mis orígenes. #montaña #pueblo #libertad #familia #buitres #naturaleza #muchofrio http://t.co/m3kSEZ0apJ No os perdáis la película #rastresdesandal con la gran @ainaclotet, estrena el 28 de noviembre. http://t.co/hunHUqrNpy Que alegría volver a verte @RafaMarquezMX.abrazo fuerte amigo. http://t.co/oCDCBm3xth With #phiyakushi at @therockinghouse #macrobiotic #comidamacrobiotica http://t.co/66S8i7xhge Gracias por tanto, Leo!!! #thebestplayer leomessi http://t.co/9PnwqLc8ku This Tweet from @Carles5puyol has been withheld in response to a report from the copyright holder. Learn more. Bona nit! http://t.co/GswMt69GvD @queconovell @Min_Absoluta @teatrepoliorama sou molt grans!!! Ho vam passar molt bé. Una abraçada forta RT @onacarbonell: Felicidades por estos 35 años @sport!!!!! Con el gran capitán! @Carles5puyol Buenas noches!! Bona nit!! http://t.co/AHUmR… #JusticiaParaTopo http://t.co/Qo4lUInyGY RT @IRBBarcelona: No et perdis #IRBdances! Si el mires i el comparteixes, ajudaràs la #recerca en #cancer #Alzheimer i #diabetes. http://t.… Ánimo @Thiago6 sé lo que sientes y lo que te pasa por la cabeza. Pero ahora hay que ser más fuerte que nunca. Abrazo amigo. On my way to madrid. Noche de risas en #thehole2. @vanesalorenzo_ elenalorenzo_ lssantiveri #Raul janandreu http://t.co/kQVAjDsqhg @kilianj felicitats crack! Abraçada forta. @RaholaOficial va ser un plaer. Petons!! @VictorTomas8 ànims capi!!! Abraçada forta. RT @MillaSarria: .@Carles5puyol @Vanesalorenzo_ http://t.co/A50ZvOzkFu Feliç #Diada2014. Visca Catalunya!!!!! Disfrutando con @_danielmartin_ en Ibiza!!!! Muy grande!!! http://t.co/yW0jDgHbQQ Acepto el reto de @orioldomenech  #icebucketchallenge mi donación es para #Dgeneracion.com #JanoGalan… http://t.co/ubdHqupaEp “@JanoGalan: X fav ayuda a difundir nuest vídeo http://t.co/IWEifjKIC4 @DGeneracion_com #IceBucketChallenge RT @DaniMateoAgain: He estado a punto de pararlo varias veces, xo confieso que me ha impactado. Cosas así me devuelven la fe en internet ht… Acabo de publicar una foto http://t.co/IbyApHwza5 Acabo de publicar un vídeo http://t.co/XRkLkIkW9R @Yohis15 felicidades. Un beso @muratdastan ;) @albertoborregan felicidades!!! Abrazo fenómeno Es Xarcu! http://t.co/XXjJYY1Tgr Cenando con chiscogg y @vanesalorenzo_. #ibiza #familia #amigos #sunset #calamoli #love http://t.co/Aq0cooVjyz #puestadesol #sunset #amigos #familia #ibiza http://t.co/8pA8n1Qolp @EAbidalOfficial suerte hermano!!! Nos vemos pronto. Abrazo Bona nit!!! http://t.co/u5WeoLZN2w @RafaMarquezMX mucha suerte fenómeno. Un abrazo fuerte RT @JORDIRIOS: #InstaSize #yoga #pocafeina #esyogapis #cosesdelrios #putucrack #loputo http://t.co/q98vkWe5Oz No tengo dudas de que el número 5 queda en las mejores manos (Sergio Busquets). Estoy seguro que lo cuidarás. Sort amic. Para que veáis que es real. #acroyoga #jugando #familia #peligroderomperselacabeza #casinosmatamos… http://t.co/C7MzvSviJw @3gerardpique @Vanesalorenzo_  us trobo massa a faltar nanu... Petó amic RT @javipobla: @Carles5puyol aquí tens l'aposta. #yogapoblatà http://t.co/QH1XBepTs1 @IbarsNat @campmanyjoan molt bona, en dos dies la feu perfecta. Un petó @IbarsNat @campmanyjoan ara l'altra. @IbarsNat @campmanyjoan ;) @JGALLEGOonfire me gusta ;) un abrazo Mejorad la réplica de Carles Sans (tricicle) #crack #humor #tricicle #risas #amigo #ibiza http://t.co/HsaPw2JgUn @EliDomeque el mèrit és de la Vanesa per l'equilibri i per confiar en mi. És divertit i fas exercici. @EliDomeque és de veritat @jordifargas la germana de la Vanesa. Abraçada @MarcosCabota más de una... Abrazo!! Bon dia!! #acroyoga #jugando #equilibrio #fuerza #estiramiento #peligroderomperselacabeza #ibiza… http://t.co/CUf5tbG99V Calentando para mañana. #humor #vacaciones #familia #ibiza #love #acroyoga #estiramiento… http://t.co/0KebLXvXtV Con @vanesalorenzo_ #jugando #equilibrio #fuerza #peligroderomperselacabeza #vacaciones #ibiza #mañanamás http://t.co/WcqQGXhkRU RT @Edurne_Pasaban: Grande  @ferranlatorre !!!! Cumbre en el K2 . Ahora bajando poco a poco. Felicidades crak !! Bona nit. http://t.co/PV0g9Kw0Ei @EAbidalOfficial un abrazo hermano!!! Preparados para ver la final. #Brasil #worldcup #familia #Maracana #sostres @vanesalorenzo_ http://t.co/54iYK6PGDe Brasil. #RíodeJaneiro #fútbol #worldcup http://t.co/kkvDubWj3T Volviendo a los orígenes. http://t.co/oHhoW2dpQf Avui no us perdeu #ElGranSilenci al programa @senseficcio , un documental que segur ens farà reflexionar a tots plegats. RT @javipobla: No hi podeu faltar, Espardenyada 2014. http://t.co/Rg6GItxaf9 En el concierto de @_danielmartin_ con @vanesalorenzo_ http://t.co/imMQclS7To Siiiiiii campions!!!!! Felicitats cracks!!! Visca el Barça 10 aniversario de boda @xuantmv y #Fabian. #costabrava #love #amigos chiscogg @vanesalorenzo_ http://t.co/r82uyE5JiS RT @Vanesalorenzo_: Hoy a las 22h en Canal + Liga estreno del documental \"Puyol, más que un capitán\" @Carles5puyol @canalplusespana http://… RT @menchudlim: Hoy es el día de @Carles5puyol en Canal+Liga. Desde las 11, algunos d sus partidos + especiales. Y a las 22.00, \"Puyol, más… Las montañas de Utah! http://t.co/A7o8XeGaQR #Titoetern http://t.co/JLYx4LVbjX RT @13_Pinto: Descubre la importante labor que realiza la asociación @Pallapupas en los hospitales:\nhttps://t.co/RojqJ3zAwe\n#VAPTScapitulo5… #TitoEtern http://t.co/8rfI3YKJch Moltes gràcies per tot Mister. Exemple dins i fora del camp. Mai t'oblidarem. #TitoEtern Felicidades al Juvenil A del FC Barcelona, campeón de la UEFA Youth League. Felicitats!!!!! @VictorTomas8 felicitats crack!!! Felicitats crack!!! @PuritoRodriguez Acabo de publicar una foto http://t.co/tKecmOGoYu @muniesa92 felicitats nanu!!!! Abraçada forta #ànimsVictor http://t.co/14WVDCTMjA @ALVAROGP77 @XaviMolist abrazo fenómenos. Nos vemos pronto (@casadellibro: En stock la #biografía definitiva de Puyol) No es mi biografía autorizada. No engañéis y confundáis a la gente. Nuestra felicidad depende de nuestra elección. (@Aracelisegarra) bona nit!!! @EAbidalOfficial grande eres tú!!! Un abrazo hermano. @chuzodepunta: Mi últ artículo en el blog Así es..o no.\nhttp://t.co/7vXjp4MfPA” increíbles recuerdos, gracias por tus palabras, un abrazo. @david8moure @mitjabarcelona @vamosacorrer sort!!!💪👍 RT @Vanesalorenzo_: Manuela ya es socia del #Barça, está bien equipada! #capitana http://t.co/XDwMl4Ae1x Día triste para el mundo del fútbol. Gracias por tanto mister. Un fuerte abrazo a toda su familia. #HastaSiempreLuis http://t.co/FNLdAAsjhc Xavi Molist (Horta), un atacant incombustible El futbolista de fons @XaviMolist http://t.co/lmSqQE02z9” felicitats crack!!! @Vanesalorenzo_ y yo estamos muy felices de anunciar que ayer nació Manuela, nuestra primera hija. RT @MonicaCarrillo: Qué nos define. Aquí os dejo el testimonio con subtítulos en castellano. No os lo perdáis.\n\nhttp://t.co/dQ6ZOwrDzc @MarcBartra91 felicitats nanu!!!! Abraçada forta. 2013 ha sido un año muy duro donde he aprendido muchas cosas y he podido ver quien son mis amigos de verdad!!! Feliz 2014, mucha salud!! @albertoborregan @LAURAMESAS1 Feliz año pareja!!!! Besos para los dos. @albertllovera 2 cracks. Exemples a seguir. Una abraçada i felicitats!!! Hoy empiezo el libro de @Aracelisegarra . Seguro que aprenderé muchas cosas. \"Tots som alpinistes\" http://t.co/RbuVH9gOrB RT @gemmaherrero: Una vueltita por un hospital y se van todas las gilipolleces. Así quedaron las botas después del partido! Bona nit http://t.co/kmgHrszuti Con @The_real_Gio Un placer volver a verte. Abrazo fuerte futuro mister 😉👍 http://t.co/YgKapgv66j Toni mi Profesor de pilates, un crack en todos los sentidos.💪👊✌️ http://t.co/c2vffWXYOy @cecicamba @sergirayolozano @nico__nd sois vegetarianos? Equipo ganador!!!! Mañana más... http://t.co/DHGKbYg0aW RT @Vanesalorenzo_: El invierno ha llegado!.Mi pieza favorita,\"Tibet\"chaqueta de piel merino http://t.co/2SksovKSER http://t.co/Xe2Pzagi4J Para despedir el fin de semana una tarta de manzana. #bonanit #mañanapilates #bcn http://t.co/3kpQtgE11g Múrgoles amb foie. #placeres #gordo #solodiadefiesta http://t.co/LXKuMlPqms RT @LidiaGuevara: Hoy es el primer día del crowdfunding de NUESTRO disco. Pásate a ver el vídeo y leer el texto donde lo explico todo: http… Equipo ganador!!!! http://t.co/O5PMWi6RCM Volviendo a disfrutar! #mivida #fútbol #entrenamiento http://t.co/YBsQGGovHt @kilianj així m'agrada crack!!! Gaaas!!! Una abraçada. RT @Vanesalorenzo_: Mis looks favoritos de la Colec Invierno 2013 con @eusilva ya están en @HolaModa #HolaFashion Ready for winter? #Cold h… Agua fría para recuperar... #muyfria #recuperación http://t.co/5sp05ramIR Uno de los pocos platos que se cocinar. #tortillafrancesa #cena #omelette http://t.co/yvCfRSeJJN Felicitats @MarcBartra91 t'ho mereixes. M'alegro molt per tu. Agafa el 5 😉 @cesc4official como podéis ver es un falso, dice que celebra el gol y no lleva el peto rojo... Por suerte ya lo conocéis... Feliz sábado @cesc4official gol si!!! Pero fuera de juego de 2 metros también... Moc moc @vanesalorenzo_ no puede resistirse al \"crepe suzette\" bona nit http://t.co/0pmTDcp1Wk Con mi hermano cescf4bregas. Buen entrenamiento para preparar el partido de domingo!!! http://t.co/tK4sbEEH8m Buen entrenamiento de resistencia! Seguimos... Feliz día!!!! http://t.co/1Rh9vOn4gh Bon dia!! Momento pilates... Espera lo mejor, pero prepárate para lo peor... Acabo de publicar una foto http://t.co/wpQXJU6HW9 @carlosgrenoir espero que todo salga bien. Un abrazo Hodei Egiluz (23) desaparecido en Amberes desde el 19 de octubre ¡RT! Gracias @HodeiMissing #HodeiEgiluz http://t.co/qDiH6TXCej Bona nit!!!! Mañana será otro día y seguro que mucho mejor... Fins demà amics RT @MonicaCarrillo: La vida de Iñaki Ochoa de Olza se quedó en el Annapurna. Su sueño puede seguir vivo si colaboramos con su Fundación.\nht… Tarde en familia. @vanesalorenzo_ putxi9 elenalorenzo_ lssantiveri @javipobla #lomejorquehay http://t.co/hSdUkdyCeQ Bona nit!!! http://t.co/7WYutUUl4p Camino del hotel después de un buen entrenamiento. Bona nit http://t.co/gSxHYBjcQx Me gusta el número de seguidores que tiene @Vanesalorenzo_ http://t.co/pDkKA6YV36 Día de recuperación. Morning workout #estiramientos http://t.co/XfJAoTXL0J @EAbidalOfficial suerte hermano!!! Un abrazo!!! RT @Vanesalorenzo_: #diamundialcontraelcancerdemama. #unetealrosa http://t.co/Rw62VnkW1T @LidiaGuevara no ho dubtis, petons Súmate al rosa!!! http://t.co/uQApe4bBN7 Acabo de publicar una foto http://t.co/jWej6nTVv8 Buena @13_Pinto... https://t.co/bczXL3LbHa bona nit!!!! Acabo de publicar una foto http://t.co/KVNcUGDfRX @MonicaCarrillo muchas gracias, un beso Amb més ganes que mai!! Con más ganas que nunca!! As enthusiastic as the first time!! http://t.co/SJmXNGI478 Gràcies Santi Buenas noticias para empezar el día, vuelve Elefantes!!!  Sort nois... http://t.co/gmBoPYx4jc Todo tiene dos asas... http://t.co/xve1eqqdqV Only he who knows the destination knows the way... Bona nit!! RT @Vanesalorenzo_: Un placer hacer esta entrevista para  http://t.co/GEI2qCLAu4. http://t.co/myeZIMIlOd Bon dia!!! Empieza una semana muy importante para mi, ahora pilates!!! Feliz lunes. @erikavillaecija ja falta poc. Un petó Que grande @RafaelNadal ejemplo de trabajo, sacrificio y lucha. Felicitats crack!!! Buenos días! Bon dia!! http://t.co/ReCiGkQ94s @Mireia_Miro ja ens diràs que tal... Espero que estiguis millor, petons @theholeshow @Vanesalorenzo_  y lo pasamos muy bien, con ganas de disfrutar con \"The Hole 2\" Bon dia. Ahora un poco de estiramientos en pilates... RT @Vanesalorenzo_: Sunday looks in #paris #summer #collection #2014 #PFW http://t.co/XWgB9XhNVx Seguimos... http://t.co/Tk8wzx6ldq Ànims @26_DaniPedrosa espero que no sigui res... Abraçada Pensaba que nunca más lo volvería a sentir... Muy feliz!!! RT @Vanesalorenzo_: Presenting http://t.co/fwpfiipUsr  SS/14 Col in Paris. 25, Rue Yves Toudic. 75010. http://t.co/NiyNwYHab8 Un paso más!! Buenas sensaciones, y muy feliz de volver a jugar un partido. Ya falta menos. Bona nit!!! http://t.co/MepA6u53nb Nuevas botas!!! #nike #megustaelcolor http://t.co/vfqdglN3ZX RT @Vanesalorenzo_: Risas y más risas. Fantástico espectáculo http://t.co/dibThrQKJU No os lo perdáis. @PasuzuTweet m'he trobat al nostre amic comú @JORDIRIOS He pasado muy buen rato con @Vanesalorenzo_ Luis y Elena, gracias a todos los que hacen posible \"The Hole\" os la recomiendo. Bona nit!!! Hoy entrenamiento completo con el equipo, buenas sensaciones, aquí con el gran Iniesta!!! http://t.co/V6V2gLvWAp No subestimes el poder de tus pensamientos. Son capaces de alterar la realidad... (Joe Dispenza) @laninadalua un petó, ens veiem aviat. @Mireia_Miro molts ànims, pots amb tot, i son moments per aprendre coses també. Petó i força!! @Mireia_Miro moltes gràcies!!! Com estàs? Petons Feliz por volver a entrenar con mis compañeros!!! podéis imaginar las ganas que tenía... http://t.co/wVSwZxBssS @PolEspargaro bona nanu!!!! Felicitats!! Falta poco!!! Muy contento, mañana puede ser un gran día... http://t.co/G5gjaQhAWW Bon dia!!! Feliç Diada!!!!! Estem molt feliços de comunicar-vos que esperem ser pares a finals de gener. @Vanesalorenzo_ http://t.co/VjLxVV1jJE Estamos muy felices de comunicaros q esperamos ser padres a finales de enero. @Vanesalorenzo_ http://t.co/Umtfh8su96 Recuperando energía del entrenamiento de esta mañana. Por la tarde más!!! http://t.co/zCIJv2Bigl Back on track... @PasuzuTweet no se on para el soci... @PasuzuTweet ??? De qué em parles? Ens veiem demà? Bon dia!!! Buena clase de pilates, ahora a entrenar, mejorando cada día.  Feliz lunes!! Acabo de publicar una foto http://t.co/gfwVAy1eiX Felicitats crack!!! http://t.co/QEz7fiQiwD #friends #photooftheday #igers #instagood  #happy #food http://t.co/7KgcG1IS80 RT @chuzodepunta: Baúl de los recuerdos. @ALVAROGP77 , @rubenmaca , @CarlesPuyol5 http://t.co/T4B8CIUMbG Acabo de publicar una foto http://t.co/TJv3ryWI2K Acabo de publicar una foto http://t.co/aAeP1pI3zR @3gerardpique tu si q ets un brut... Xo jo t'estimo igual. On està el @cesc4official ? @paugasol moltes gràcies crack!!! Una abraçada forta! #Juanjo #Yon #sinellosnoseriaposible http://t.co/TTqsnll2Ht Muy contento por volver a entrenar en el campo. Cada día un paso más... http://t.co/hV0AEHBp03 ¡Dona médula y ayuda a Mateo y a todos los \"Mateos\" del mundo! Hoy por ellos y mañana por ti. http://t.co/LvTPElX6cU #MedulaparaMateo RT @AdriaVilanova: Muchas gracias a todos por los ánimos, este partido lo sacaremos adelante una vez más.  Seny , Pit i Collons! http://t.c… Acabo de publicar una foto http://t.co/N3W56ifLs3 Mucha suerte!!! Un abrazo amigo. http://t.co/OgbblfGYnR Relax!!!! http://t.co/fTYvW8kkrn @PasuzuTweet  he penjat una foto i no era el dia. Quan la fiqui de nou m'agradarà saber la teva opinió. Una abraçada xaviyeye @javipobla putxi9 #eivissa http://t.co/Ozi34facbb @PasuzuTweet  ja sabem a qui ha sortit... Abraçada nanu @jpamies9 \"en català\" millor no? #amics #Eivissa http://t.co/qMVO8yobAL RT @Vanesalorenzo_: Navegando con la \"Camisola Smoke\". La puedes encontrar en http://t.co/fwpfiipUsr http://t.co/JRVwiJLZeX Ens veiem l'11 juliol al Torneig Golf Solidari en benefici de l'Hospital Sant Joan de Deu.Apunta't a http://t.co/NMXnD2uD7J Después de una cena increíble con @Vanesalorenzo_ en el rest La Masia de Ibiza, preparado para ver la final. Un abrazo #ibiza http://t.co/NAlkvRjiQL RT @joanpowergym: Comentando con @Carles5puyol  su suplementacion para mejorar su recuperacion. #Recuperox + #Powerflex de #Powergym http:/… #mocmoc http://t.co/B8k7TBxlwh #Amics Foto de mi Amigo pepmorata http://t.co/7APAmwOPjW @fontas24 molta sort amic, una abraçada Acabo de publicar una foto http://t.co/FBOZYsHxxj Ya estoy en casa!! Muchas gracias a todos por los mensajes de apoyo, se acabaron los problemas en la… http://t.co/5ynfDQYvOG Felicidades campeones!!!! Selección sub 21!!! Muy merecido! Un abrazo a todos. Con @Vanesalorenzo_ en \"EN Japanese brasserie\".NYC.  Muy recomendable http://t.co/rMoinqKKKn RT @Vanesalorenzo_: En Times Square con los \"Nico pants\" pintados a Mano. Los puedes encontrar en http://t.co/fwpfiipUsr http://t.co/uBMKjF… http://t.co/Ib76GwN55v #MerciAbidal Eres muy grande!!! http://t.co/UztYD8C39c RT @XaviMolist: Este #verano hago un Campus de #futbol con @FootviaAcademy en Badalona. Si quieres aprender y disfrutar, NO LO DUDES! http:… Os dejo el link de mi perfil de Instagram por si lo queréis visitar.\n\nhttp://t.co/HTWdSOnBtC Crack ya eres el número 1!! Felicidades!!! @_danielmartin_ http://t.co/vBIUvThokh RT @IEDMadrid: Excellence Executive recoge el artículo “Lujo silencioso” sobre Vanesa Lorenzo, exalumna de @IEDMadrid #Moda Lab. http://t.c… 500 partits!!! Moltes felicitats @1victorvaldes http://t.co/g6LnEzVnvI Todas las informaciones q están saliendo son falsas.  Sólo estoy centrado en recuperarme bien y estar a tope para la próxima temporada. No t'oblidem #MR26 http://t.co/06GekY9w3y RT @Vanesalorenzo_: Os recomiendo el documental. http://t.co/N5rDOPaHFq \"Rodriguez\" que lección de integridad y fidelidad hacia uno mismo. No se puede Andar sin saber Caer... RT @Tu_Inspiras: Cuando la lucha cuesta es cuando más sirve. Persiste Q fenómeno!!! Como me suena todo lo q dice... http://t.co/yGsRtcJvW3 RT @MarcBernaus: Obert el termini d'inscripcions per a la V Edició del Campus Marc Bernaus sol.licitud d'inscripció a la pàgina web http ... Moltes felicitats parella!!! Petons @cesc4official @firstLadyD4 Después del tratamiento un poco de Básquet. Som-hi Barça Regal RT @javipobla: Per als amants del ciclisme us deixo el perfil de la Marxa \"La Superbonaigua\" 2013. http://t.co/927c6KfF9t Abi eres muy grande, un ejemplo a seguir para todos. #grandeAbi @Silvinha_ac nitrato de potasio va muy bien, xo no se si es muy agradable, Tendrías q hablar con tu amigo el doctor... Un beso RT @Vanesalorenzo_: El País Semanal. Moda española. Vestido de seda de mi colección de verano. \nEspero que os guste. http://t.co/h4upfWz72x Moltes felicitats AMIC!!! @JuanjoBrau gaudeix del teu dia!!! Petó @noe5puyolina muchas felicidades!! Q pases muy buen día. Un beso @Angelaluxury cierto!!! Un beso @LUISENRIQUE21 grande hermano! Un abrazo fuerte. Recuerdos a #elruso Comiendo con @Vanesalorenzo_  feliz domingo... http://t.co/XRTaGPRAUt @albertllovera el referent ets tu!!! Una abraçada forta RT @laninadalua: ... Mi hijo me susurró en pleno invierno #HOYESPRIMAVERA. Su talismán me inspiró la curación del cáncer: http://t.co/Yo ... Comiendo con @javipobla, después un poco de Kinetec y recuperación. Cada día mejor... Ver, oír y callar... El tiempo pone todo en su sitio. Feliz día del padre! http://t.co/PPIJoqUXhV Bona nit! MaÑana empieza la recuperación, espero estar bien lo antes posible. Un abrazo Gracias x los mensajes de ánimo. Un abrazo http://t.co/ejpXEb9qUF @dafnefdez mucha mierda... Besos @lorepulecio del tiempo... Un beso Comida en casa con grandes amigos... No hemos hablado de fútbol. #ironíaon http://t.co/8WKhGo8IIb @XaviMolist bona nanu, felicitats!!! Una abraçada Tornarem... http://t.co/2wkBWJr1VG Después del Palo de ayer! Hoy una gran noticia para los Barcelonistas y el fútbol, Abidal ya tiene el alta médica. Con el somos + fuertes. @gerardquintana gràcies crack! Una abraçada @gerardquintana l'honor és meu! Una abraçada forta @dafnefdez mucha mierda!!! Un beso! @cesc4official a partir d'ara ens faràs tu el sopar? Moc moc http://t.co/eG0slNbx Moltes gràcies x tot!!! @laninadalua @LidiaGuevara petons!!! @XaviMolist moltes felicitats crack!!! Una abraçada forta Bon dia!!! Feliz domingo! http://t.co/8USLxB2h @XaviMolist molta sort amic!!! A tope!! Una abraçada. Corre X2 perquè ells no poden... http://t.co/xDXkCQpi bon dia!!! http://t.co/RmOJn3SK Moltes felicitats parella @shakira   @3gerardpique!! Petons Cenando con un buen amigo!! @JORDIRIOS risas aseguradas... Bona nit!! http://t.co/3ZGOgBjD @PasuzuTweet ja tenim una cosa x ells... Demà t'ho porto. Tomando café con @javipobla y criticando a @PasuzuTweet ooohhh moc moc @lorenzo99 gracias crack!! Nos vemos cuando estés x bcn. Un abrazo fuerte @cesc4official gràcies amic! Petons http://t.co/Y6cxIrv1 @dafnefdez q vaya muy bien!!! Besos @LidiaGuevara tens raó!!! Petons @torreBe @Silvinha_ac estáis fatal... Besos para las 2 Cenando con mis hermanos Ivan de la Peña y @LUISENRIQUE21. Q enfermos del fútbol... http://t.co/40WzlLK1 Feliz lunes!!! http://t.co/fvYfofoT @PasuzuTweet q guapos nanu!!! Sort q han sortit a la mare. Una abraçada \"@espinosa_albert: En 90 dias sale mi cuarto libro! Ojala os guste tanto como lo he disfrutado escribiendo.... Abrazos!!!\" Segur q sí!!!! RT @LidiaGuevara: Zapaterías en las que te regalan un pergamino con este texto bonito. Es que lo hacen todo a medida? Nada es casual. ht ... RT @LUISENRIQUE21: Eso es!RT @Josehermida: Stop! No more cyclist killed ! No mas ciclistas asesinados!\nLejarreta,Cabedo,Cristóbal,Burry. ... Felicitats @kilianj ets molt gran!!! Un exemple a seguir!!! Una abraçada crack! #unaliniafina RT @mpallas23: Congratulations @kilianj and @sebastienmontaz for your film @SummitsofMyLife. Superb!! Ya tenemos página en Facebook de mis relojes CP5, si queréis dar un  vistazo os dejo la dirección. https://t.co/jg56JZG5 Primer entrenamiento del año!!! Un abrazo! http://t.co/n130KLtJ @LUISENRIQUE21 hermano tendrías q entrenar un poco +, tienes michelín... Un abrazo!!! Con el Romario de La Pobla http://t.co/xRY14buZ Tenemos futuro... http://t.co/CFiYRBHT Con Marc Bertan y Jordi Mauri, un crack como entrenador q el taxi lo privó de entrenar en primera.Jeje nos enseñó mucho http://t.co/j0DxYmcc Feliz Navidad!!! Bon Nadal!!!! http://t.co/CqFctYyK Entreno en familia, pensaba q mi hermano estaba + mal físicamente, @putxi9. Donde estabas @javipobla ?? Bon nadal!!! http://t.co/UPF26YES @cesc4official jejejejejee aviat torno i veurem q passa. Petó amic Hoy he entrenado con amigos q aguantan mi ritmo no como ayer... Grandes @javipobla y @jfranch85 http://t.co/v7DkKgNR Ya tenemos al falso de la jornada @cesc4official , no entiende como no puede seguir a uno de 34 años.  Es igual de falso q @3gerardpique Muy buen entrenamiento de series en la Carretera de les aigües con @cesc4official @JuanjoBrau y Keita. Feliz domingo!! http://t.co/qVo2SubK Bona nit! http://t.co/sgpkxRrR @dafnefdez @HibaAbouk @Silvinha_ac buen viaje!!! Besos a las 3! On fire!!! #ÀnimsTito El proper 11 i 12 de gener participa a la #MaratóDonants. Reserva hora i dia a http://t.co/sMP59FVp i comparteix la teva sang! #donarsang RT @LUISENRIQUE21: A ver si nos enteramos!!!! RT @THEJAMONERO: Me encantaria q todo el lo retweeteara........ !!!!!!! http://t.co/aSn0UB35 Bon dia!!! Me voy a Pilates!!! Señor ten piedad... On .... Feliz lunes!! Bon dia! Avui tots amb la #maratóTV3 Buenos días!!! http://t.co/gJHXFiOu RT @SummitsofMyLife: Solo tres días para la estrena! Entrades esgotadíssimes! Mil gracias a todos por apoyar este proyecto con vuestra i ... @marcoaudelo ni tan difícil... Bona nit!!! MaÑana + y mejor. @marfarri si escoltes a la @LidiaGuevara segur dorms molt bé. Petó @LidiaGuevara no tothom ho veu... Petó! 12-12-12 nueva etapa! http://t.co/gOvmTOHS @FBelasteguin felicidades!! No entiendo como no me lo dieron a mi... Q tal el codo? Un abrazo Bona nit!....................zzzzzz!! Increíble, enhorabuena crack!!! http://t.co/rllAHtIS @Marinacule18 muchas gracias! Un beso! RT @XaviMolist: Mas de 15 años de amistad, @Carles5puyol y yo mejoramos con los años pero @nayrajosy pierde.. Jeje.. #inseparables http: ... @irene5tomas felicidades, q pases buen día! Un beso #wertgonya #Somescola @_danielmartin_ igualmente crack!! Nos vemos pronto! Un abrazo .............. Bona nit! @LidiaGuevara me encanta, todos somos Clara! Un petó @PasuzuTweet has fet una feina increïble!!! Com tot el q fas... @putxi9  @javipobla @CotiOficial El gusto es mio, un abrazo fuerte!! Hoy inauguración de @Beleco425 centro de fisioestética en Barcelona. Espectacular!!!! Molta sort amics! @Xime_FCB nunca pierdas la fe... Besos! @torreBe una tormenta de verano!!! Disfruta x allí. Besos! @anasagre todo el cd me gusta!!! Y he tenido la suerte de conocerla y es una crack! Un beso! Lo imposible sólo es complicado... ;-) @laninadalua @LidiaGuevara petons i gràcies! Bon dia!!! http://t.co/ptkLpKFg @JORDIRIOS jo ja ho he fet... @FBelasteguin vamos crack!!! Mucha fuerza!! Puedes con todo. Querer es Poder!!! Un abrazo fuerte. @gerardeulofeu nanu em sembla molt bé xq surto jo... ;-) una abraçada @PasuzuTweet bona nit!!! @PasuzuTweet l'has vist? No es pot \"permitir\"... @PasuzuTweet q fas despert? Bcn!!!! Molta merda Monica-Jordi #PARARAPAPA una abraçada!!! http://t.co/ydx1ucWO @PasuzuTweet qui ets? Hoy vuelta a los inicios, entrenamiento con el B, cada día mejor. Muy contento, recuperando sensaciones! Un abrazo @LidiaGuevara Enhorabona, t'ho mereixes. Un Petó #PARARAPAPA ????\"@JORDIRIOS: PARARAPAPA MUPI: http://t.co/AdsKHxxF via @youtube #PARARAPAPA\" Buen entrenamiento, ahora estirar un poco y agua fría! Nota del entreno: necesita mejorar... Mañana +. Feliz lunes Ahora un poco de Milan-Fiorentina!! #ForzaMilan Lorenzo o Pedrosa?? #MotoGP @Miguelpajel mucha fuerza!!! La recuperación es dura!! Con paciencia y trabajo, todo llega. Un abrazo @marcmarquez93 increíble... Ya va con motoGP? Feliz!!! Cada día mejor. Bona nit!!! Un abrazo http://t.co/9h3HPLZL RT @MerBlanquet: ”Donde hay una voluntad hay un ganador” John C. Maxwell @lorepulecio felicidades x la parte q te toca, un beso!! Lo q fue duro de soportar, es dulce de recordar... @XaviMolist bon dia! Tàctica??? Defensa de 5??? Veig a @nayrajosy de 1er... RT @kilianj: In Italiano! \"Correre o morire\" e già disponibile:\nhttp://t.co/Ayd1kLVo El destino es el destino... RT @LaBuenaAventura: Podéis seguir votando a @LidiaGuevara como Artista revelación del año en los premios ARC hasta el domingo!\nhttp://t ... @A_Xouxere jejejejejee buenas noches!! Un beso Buenas!!! Os gusta el nuevo modelo de CP5?? http://t.co/viRf4ilj @3gerardpique Bona nanu!!! Ets el millor!!! a topeeee @PasuzuTweet x compensar. Abraçada http://t.co/hS31pw5B Bona nit, me retiro a leer, #elgocedelaspequeñascosas @Silvinha_ac @torreBe te lo pierdes... ya sabes, una visita rápida y vamos!! Besos RT @torreBe: Comiendo con @Carles5puyol antes de irme al teatro! Venid, nos quedan 4 funciones!! #PerversionesSexualesEnChicago http://t ... @vicki_mxt yo fui ayer y @torreBe sustituye a @ursulolita Si queréis pasar un buen rato id a ver #PerversionesSexualesEnChicago con @torreBe . Quedan 3 días de función en la Villarroel. Un abrazo No llames a una cosa triste, te puede suceder algo peor... RT @LidiaGuevara: Me ayudáis a conseguir el premio ARC a artista revelación de Catalunya? Votar son sólo 5 segundos! Gracias!! http://t. ... @torreBe mucha mierda!!! Temps de canvis... RT @LidiaGuevara: Vamos en sexta posición. Me votáis, por favor? Són sólo 5 segundos. Gracias!!!!! http://t.co/HlX21ai7 RT @MamenYellow46: @Carles5puyol Carles,nos ayudas con un RT a homenajear a #SuperSic? Queremos lograr q sea TT #Eterno58 gracias Carles ... Buen entrenamiento de fuerza + cinta con @LidiaGuevara de fondo... Ahora a animar al equipo! Som-hi Barça!!!! #EnLaAgendadeRistoMejide apunta la cena q tenemos pendiente... Un abrazo @lorepulecio un beso! Una abraçada nanus!! @XaviMolist @nayrajosy fins aviat! http://t.co/2swBoOUK Comiendo con @XaviMolist y @nayrajosy, compañeros de piso cuando estábamos en la cantera. X cierto se nos quemo... Q recuerdos!! Bon dia!!! Hoy me ha visitado Erika de medilast!!! Gracias x todos los productos, ahora seguro q me recupero + rápido! http://t.co/UFjYGXj6 @XaviMolist bon dia nanu!!!! Fins aviat ;-) Bona nit! Hoy día completo, entrenamiento x la mañana,circuito de fuerza y x la tarde series en la carretera de les aigües, 10km... Abrazos! @LuchoGarcia14 vaya pelucaaaaaa!!! Un abrazo fenómeno RT @ristomejide: Estés donde estés, seas quien seas, quiero que sepas que saldrás victoriosa. #DíaMundialcontraelCáncerdeMama RT @paulocoelho: No podemos evitar el dolor, pero podemos elegir superarlo Muy contento, he vuelto a correr en el campo, cada día mejor. Poco a poco ;-) un abrazo q ahora ya puedo... @dafnefdez buen viaje, q te vaya todo muy bien, disfrutaa!! Besos @torreBe bienvenida ;-) Nadie dijo q seria fácil xo tampoco tan difícil... Feliz domingo :-) RT @JuanjoBrau: Os recomiendo el Centro de FisioEstética @Beleco425 en Muntaner 425 de BCN.  Manos para la Salud y para la Belleza!! ... ... Un poco de merienda... http://t.co/eo0uNCaC Bon dia! Hoy desconexión total en La Pobla de Segur!! Mañana empiezo la recuperación del brazo!!! Un abrazo. Hoy se retira un crack y sobretodo buen amigo! Molta sort nanu!! @nayrajosy Mi nueva compañera... http://t.co/u5MNFJDT Últimas horas con el yeso! :-) http://t.co/ikEiOR3J @alunis62 me alegro, un beso He escrito sobre mis mejores 55 minutos para el blog de @FIFTYFIVEDSL http://t.co/VB785AfR Bon dia!! Una de las causas + comunes del fracaso es el hábito de abandonar cuando uno se ve presa de una frustración temporal... Hoy he visitado un centro  espectacular @Beleco425 os lo recomiendo!! Un abrazo. http://t.co/9wdPR8oI Con uno de los mejores jugadores del mundo!! Un ejemplo a seguir. http://t.co/VO1Yqo6T Asumir riesgos supone provocar al miedo, pero asumirlos supone también estar + vivo q nunca... RT @soniagelma: Sí, Piqué hauria de respectar les normes de trànsit, també estaria bé que els paparazzi respectessin la seva privacitat Bon dia! Siempre vuelve a salir el sol... Gracias x todos los mensajes! Un abrazo fuerte Ya en bcn! Quiero dar las gracias a todos los q me han tratado en Portugal! Pronto a tope! Un abrazo http://t.co/9wvhmx3m Falta? Claro!!! son manos de cesc. @cesc4official http://t.co/9mxaRVq4 Ya hemos terminado el entrenamiento y nos vamos a descansar al hotel. Bona nit!!! http://t.co/qK3Twu5h RT @MerBlanquet: Hoy @Beleco425 abre sus puertas!Mucho éxito! @PuritoRodriguez moltes felicitats!!! Una abraçada. @kilianj sort crack!!! Gaaaas! Una abraçada RT @villarclachato: Cito: \"Si un conductor ve un caballo, frena. Si ve unas vacas, frena. Si ve unas ovejas, frena. Si ve un ciclista se ... @3gerardpique oooohhhhhh!!! \"@alonsoRM13: @Carles5puyol hijo de la gran puta haber si se te parte otra vez el pomulo hijo puta\" \"haber\" \"haber\"... Hoy he cenado con uno de los mejores deportistas q conozco, @kilianj un ejemplo a seguir. Un plaer crack! Molta sort!!! http://t.co/4nUCHtWb @julianobelletti grande crack!!! Un abrazo!! La película @puravidaridge me ha encantado #estrenopuravida Increíble entrenamiento en la Carretera de les Aigües con @JuanjoBrau y Jon... Escuchando a @shuarmamusic (Vuélvelo a intentar) en acústico!!! Me voy a entrenar, feliz día! @javipobla bon dia soci! Q no renuncies a tu sueño, q sigas durmiendo... así mejor no? Me voy a entrenar. Abrazo!! Nunca renuncies a tus sueños, mejor renuncia a tus miedos, que son los que no te dejan alcanzar tus sueños y hacerlos realidad. Bon dia!!! Bona nit!!! #noveoná Bon dia!!!! Esperando a @JuanjoBrau para entrenar... Va nanuuuuuuu Bon dia! Pilates y Después entrenamiento. Feliz viernes \"@Jesus19moreno: @Carles5puyol muerete catalan hijo de puta ! Ojala no pases de hoy cabron ! #QueVivaEspaña #Oléeeeeee\" gràcies!!! @5Noah5 un abrazo fuerte! Mientras no esperes nada de nadie no habrán decepciones... @torreBe igualmente!! Besos Bon diaaaaaa!!!! @kilianj gràcies crack! Ens veiem aviat. Una abraçada A quién imita @JORDIRIOS ??? http://t.co/zt4zJ1LH Moltes felicitats!!! @putxi9 @MonicaCarrillo muchas felicidades un beso! @MarcosCabota fenómeno como estas? Cuando nos vemos? Un abrazo @lorenzo99 cada día lo tienes + cerca... Felicidades crack!!! Vamos @ValeYellow46!! @xuli_pobla benvingut crack!!! Una abraçada Q mala suerte Pedrosa!!! ànims crack!!! Q espectáculo @marcmarquez93 y @PolEspargaro! Molt grans!!! Q grande es @marcmarquez93 felicitats crack!!! @3gerardpique oooohhhhhh i MotoGP? @Rogergrimau gràcies nanu! Aviat a tope! Una abraçada @paugasol gràcies nanu, una abraçada La paciencia es amarga, pero su fruto es dulce... @CarlaLlado moltes gràcies! Un petó RT @lamedialunasusu: Salida a la venta del libro-disco de La media luna!!! \"La media luna se va de viaje\" el 20 de septiembre!!!!! @PasuzuTweet Bon dia, q hi ha algú? Vas parat... @XaviMolist bon dia nanu!!! http://t.co/ZnAYMsWx Hoy estreno nueva máscara... Nada q ver con la otra Aprende a creer en ti, xq a medida q te convenzas, serás capaz de convencer a los demás... Bon dia. Bona diada a tothom!! Aprovechando el fin de semana libre para inaugurar la masia familiar con mi hermano y amigos! Un abrazo http://t.co/xa2MCLzp #AntesDeMorirQuiero VIVIR!!!! Final del entrenamiento. Muy buena semana, cada día mejores sensaciones.Ahora 2 días libres para desconectar un poco y estar con los amigos @fontas24 ja vinc nanuuuuuu. Bon dia!!! Pilates... Bona nit, buenas noches!!! Me voy a descansar Después d 1 cena increíble en el restaurante Emperador. Muy buena la comida y la compañía, los amigos es lo mejor q hay. Muy buena la entrevista de @puritorodriguez ! Q fenómeno. Increíble Contador!!!! @3gerardpique jo la màscara no? Oooohhhhh moc moc Q ha pasado en la Vuelta? Bon dia! Hoy he probado la mascara, no es muy cómoda xo con unos ajustes creo q irá mejor... Un abrazo http://t.co/N1gUUOC9 RT @13_Pinto: Aquí os dejo el enlace de la guardería de @MedinaDoc por si alguno estais interesados o quereis echarle un ojo ;)\nhttp://t ... RT @13_Pinto: Si buscais guarderia en Cádiz capital,os recomiendo la que mi amigo y doctor del FCB @MedinaDoc ha abierto\nTu retoño estar ... @Toquero_theboss un abrazo crack!! @Toquero_theboss yo tengo una... Así q cuando quieras, mínimo 1000km no?  Jajajaja @Toquero_theboss toquerista total, q duro el final hoy!!! Ciclismo en estado puro. Cada día un espectáculo, hay q esperar al sábado... Como veis la Vuelta? Podrá remontar Contador? Yo veo muy fuerte a Purito, xo seguro q Contador lo volverá a intentar... Muy grandes todos. Increíble la vuelta... Purito va muy fuerte! Bon dia!!! Vuelven las clases de Pilates... Feliz lunes!!! @kilianj moltes felicitats!!! Ets un crack! Una abraçada #TodosConMálaga Felicidades @andresiniesta8!!! Te lo mereces! Vaaaaaaaaaaaa!!!! RT @ristomejide: Lo siento,pero semejante hijo de puta no merece ni el ingenio de un tweet. #CadenaPerpetuaParaJoséBretón @anasagre muchas gracias!! Un beso Moltes gràcies xls vostres missatges. Estic bé i segur q aviat tornaré a donar guerra... Una abraçada. Bona nit Ya en bcn, muchas gracias x vuestros mensajes, estoy bien y seguro q pronto volveré a jugar. Un abrazo! Bona nit Siiiiiiiiii vamos Marc Marquez!!!! @AlexCorretja74 Benvingut crack!!! Una abraçada RT @SerGimeno: @Carles5puyol RT pr el meu gran amic @gerardgarcigu q avui fa anys i es la millor persona k conec i sbretot es un gran fa ... RT @analopezct: Llevan a un bebé gorila del zoo de Melbourne al hospital y mirad la cara q pone al sentir el frio del fonendo http://t.c ... @_danielmartin_ un abrazo amigo!!! Feliz x los 3 puntos y x el gol del Guaje!!! Bona nit http://t.co/2wbzyKAy @PasuzuTweet al soci el tenim a la Pobla... Tu i jo el dia q vulguis Todos saludando a @paugasol eso demuestra lo grande q es... Una abraçada crack!!! Muy grandes!! Q partidazo! Gracias x este espectáculo... Feliz x el Guaje y Fonti, ahora somos + fuertes... Bona nit @RafaMarquezMX Enhorabuena crack!!! Un abrazo #VIVAMEXICOCABRONES RT @Kitus_: @3gerardpique @Carles5puyol @soler_toni Gerard, no és \"ficar\", és escriure. Ficar és posar dins d'algun lloc (un calaix p.e) @Carles5puyol si no saps parlar amb català no hi parlis!! No existeix \"gafe\", es diu malastruc!! #algúhohaviadedir @3gerardpique @3gerardpique repassa el q has ficat... \"Amb català\" TONTO @3gerardpique ets gafe, no diguis res +... @FortesJordi tu un pollo no, tu un cerdo asado... Jejejeje un abrazo Uno de los entrenadores + importantes de su carrera... @cesc4official @3gerardpique ooohhhhh!!! http://t.co/TjiXR0UD Wow increíble Javi Gómez. Muchas felicidades!!! @LUISENRIQUE21 como te cuidas hermano!!! Un abrazo Increíble Del Potro y Federer!!! Felicidades a los 2. Vaya cracks!!! @Mascherano te lo mereces crack!!! Y recuerda q no es el último... ;-) un abrazo @claudiadelariva gracias!!! Poco a poco... Un beso loca! Bon dia, buenos días! Mucha suerte para @muniesa24 tot sortirà b crack!!! Una abraçada. @xic_pobla a tope nanu!!!! Cuideu al cuco... ;-) @anasagre gracias! besos Alta médica, quiero dar las gracias a todos los q me han ayudado, en especial a @JuanjoBrau Moltes gràcies amic!!! @LauMDominguez muchas gracias! Un beso @PaulSuite gràcies crack!!! @dafnefdez alta medica!!! Tu todo bien? @carlotafabregas siii xo no diguis res... Shhh petó guapa! Buenas noticias... Feliz!!! RT @juditmasco: Después d mi experiencia en Uganda me gustaría apoyar  @IntermonOxfam con esta iniciativaMe ayudáis?Gracias http://t.co/ ... Bon dia, buenos días! @MarcGasol molta sort cracks!!! Una abraçada!!! @JesusAld no te preocupes, @3gerardpique no pone nada interesante... @3gerardpique q vols guerra falseti? Ja fas alguna cosa x allí? O rodaràs aquesta pretemporada? @cesc4official @donmartaday jejeje ;-) un beso Entrenando con Adriano http://t.co/eRwY2lcO @torreBe otro para ti!! @LauMDominguez muchas gracias! Petoo Primer entrenamiento con el grupo y muy buenas sensaciones! Ahora a descansar q x la tarde hay +. Un abrazo @3gerardpique ja ho veuràs... @3gerardpique Bon dia amic!!! Oooohhhh RT @MarcBartra91: #animsmuni ! Molta força de part dels teus grans amics.T'estimem i sempre estarem al teu costat! @muniesa24 http://t.c ... Ànims Muni!!! Último entrenamiento de la semana, ahora a cenar con los amigos y mañana para Barcelona. Un abrazo!! Bona nit. http://t.co/afyxbF4X Ven a la Supercopa! Averigua los 3 jugadores más mencionados en Twitter en la final de la Eurocopa: http://t.co/EnJvHDWN @ThinkBig_es @torreBe disfruta de la ciudad guapa! Una pena q no nos veamos... Besos!! Después de pasar un día increíble con @javipobla y amigos me voy a dormir q mañana hay q volver a bcn!! Bona nit A Pobla celebrant l'aniversari del meu millor amic Javi. Celebrando el cumpleaños de mi amigo Javi #mediterràniament http://t.co/Uabz4vmB Moltes felicitats!!! @javipobla q passis un bon dia!! Bon profit!!! Bona nit http://t.co/f40tFIcF Entrenando con mi amigo @13_Pinto. Un abrazo!!! http://t.co/c7qcrpRB @Urirosell molta sort crack!!! Segur q anirà molt b! Una forta abraçada amic. RT @_nachomontero: @MigRico #siempremiki II Campus Real Betis Balompie, hoy va por ti @JofranEventos http://t.co/EtYtLiwr Un poco de agua fría para recuperar la doble sesión de hoy! Bona nit @torreBe pecadoraaaa ;-) Todo lo q no suma resta... @LUISENRIQUE21 bona nit germà!!! Me encanta esta canción... Zaz - Je veux (Spanish subtitles) http://t.co/91uMWvN5 vía @youtube Hay pocas cosas q me gusten tanto!!! Y los de mi madre son los mejores!!! Feliz viernes! http://t.co/HPje4hHu @paugasol moltes felicitats crack!!! Q passis un bon dia!!! Una abraçada RT @W_Barcelona: Muchas gracias por todo el apoyo!! @UNICEF @ClubsDiR @Carles5puyol @Guaje7Villa http://t.co/S7kOkojs Vaya día... @SandraFalga moltes gràcies, un petó @PasuzuTweet això ho fas tu... Jejejejejeje @PasuzuTweet jejejejeje ets un animal... @PasuzuTweet no t'aniria malament... Xo es poden fer + coses no? #EsTuAmigoSi va a entrenar todos los días contigo... GRACIAS @javipobla @putxi9 @JuanjoBrau Me voy a entrenar con @javipobla abrazos Dicen q todo lo q empieza acaba y esto termino sin comenzar... @LauMDominguez algunos nos despertamos peor... Un beso RT @RBetisOficial: El Real Betis retira la camiseta con el número 26 de Miki Roqué @claudiadelariva claro, Así es. Besos @claudiadelariva ??? RT @MercheMadrid: RT:INCENDIO El pueblo d Carlet (Valencia) necsita voluntarios con motosierras y tractores con cubas URGENTE.Contactad  ... @3gerardpique petó nanu, gaudeix q t'ho mereixes!!! Felicidades!!!!! http://t.co/RyUWrqRD Vamoooooos!!!!! http://t.co/43CjrRGx @PaulSuite q vas cap a la Pobla? Vamos Iker!!!! También quiero aclarar q mi apoyo ha sido anímico, x ello agradezco al Betis su inmensa ayuda en todo sentido. Miki ya descansa en paz, ha sido un ejemplo de entereza y valentía. La despedida muy emotiva, Uno nunca se va mientras es recordado... @claudiadelariva suerte!!! Beso @PaulSuite nanuuu com pots tenir dubtes? El tinc estirat al terra q no es pot moure. Una abraçada Q equipo ha ganado? Rojo o Negro http://t.co/zCBFWglG Quien la sigue la consigue... ;-) RT @ifilosofia: El destino decide quién entra en mi vida, pero soy yo quien decide quién se queda La broma del parchís os la podéis ahorrar... Sesión terminada, alguien le puede decir a Juanjo q no corro maratones? Bona nit!!! http://t.co/tQtLJuAE Primera sesión de entrenamiento terminada, fuerza + carrera continua, por la tarde +. Abrazo http://t.co/dl6cIY2d RT @paugasol: Le damos una sorpresa a @rickyrubio9 ? Que se despierte viendo que todos le apoyamos en su recuperación! #YaQuedaMenosRick ... Siiiiiiiiiii!!!!!! Campions!!!! Felicitats cracks!!!!! @javipobla jo tb!!! Semblem dos tontets Aquí a la carretera tirats... @claudiadelariva tenemos la misma izquierda... Besos Día duro de entrenamiento, @JuanjoBrau ha venido con ganas. MaÑana +, si me despierto... Bona nit @claudiadelariva nada mal... Cuando te veo? Besos @laliedu06 perdonada ;-) Para mi el mejor partido q hemos visto hasta ahora, y si riegan el césped se vera mejor fútbol. Yo confío en la Roja!! Estelar Iniesta @PasuzuTweet ja ho saps... Ens veiem aviat nanu!!! Abraçada Bona nit! Buenas noches, mañana + y espero q mejor... Besos @carlotafabregas vols dir? ;-) un petó guapa!! DEP Manolo Preciado. Un fuerte abrazo a su familia y amigos. RT @FCBarcelona_cat: El 8 de juny al Palau Sant Jordi, no et perdis el concert benèfic \"Les nostres cançons contra la sida” @ContraLaSid ... Hola, us deixo la foto dels guanyadors del concurs que vam fer conjuntament amb  @EstrellaDammCat http://t.co/KNlKtOmt @RubenSanz11 igualmente crack!!! Nos vemos pronto ;-) un abrazo Bon dia!En Bcn después de pasar 3 días en Madrid. Ayer concierto de @_danielmartin_ Muchas gracias x todo fenómeno. Ahora partido de vuelta @LUISENRIQUE21 bon dia germà!! A tope!!! Un abrazo Tan importante es estar como no molestar... Feliz sábado Si queréis jugar contra una máquina del Apalabrados... Ferran8080 Celebración de la victoria... Bona nit!! http://t.co/e7pb79Bn @3gerardpique ya conocéis todos lo falso q es Geri, ahora digo el resultado. 13-6 para mi equipo. Yo NUNCA miento... Increíble tarde jugando en el Camp Nou. Amigos de Piqué contra amigos de Puyol. Obviamente ganadores http://t.co/RMXVMNgB RT @CorrePallars: Ja em fet la presentació oficiaaaal :)... http://t.co/xAL08j3v @MarcBartra32 entrena a tope crack!!! Molta sort. Una abraçada @PasuzuTweet q tens? Les 3 coses? ;) @javipobla eres un pesetero... #pallorar @javipobla se puede ser + pelota? @PasuzuTweet Quiero mandar un fuerte abrazo a Florentino y toda su familia. Mucha fuerza!! Aquí teniu el link per veure si sou els guanyadors del concurs amb Estrella Damm! Molta sort! http://t.co/9BcflLDs Diumenge us esperem tots al Palau Sant Jordi per al partit de la Marató per la pobresa. No hi falteu! Bona nit. @carlotafabregas ??? Tarde con amigos con un denominador común...Cp5. Un abrazo! http://t.co/eMICqlNK Vaya carrera de Moto2. Hay q tener un par... Ànims Marc @_danielmartin_ un abrazo fenómeno. Encara podeu participar al concurs amb @EstrellaDammCat per anar a la final de Copa. El termini acaba dimarts a les 12. http://t.co/9BcjTlEm Bon dia. En la ciudad deportiva con el fenómeno de @3gerardpique. Me voy a entrenar un poco. Abrazo! http://t.co/7w5nY7R8 @claudiadelariva q fas? Jo recuperant al club. Petó Recuperando mañana y tarde con @JuanjoBrau para estar bien lo antes posible. Un abrazo. RT @FCBarcelona_cat: Twitter agraeix al Barça la seva implicació en la traducció al català de la xarxa social http://t.co/jgwS131r #twit ... Queréis venir a la final de Copa a apoyar el equipo?Gracias a @EstrellaDammEs, patrocinador del club, podemos!! link: http://t.co/znTVj0KW Hola a todos, aquí estamos haciendo trabajo de recuperación con Juanjo, mi compañero de fatigas las próximas... http://t.co/vlrqVWgt @AlbaCanal així m'agrada!!! Una abraçada al teu pare i un petó x tu!! @3gerardpique segur q has fet trampes q ens coneixem... Tengo el presentimiento de que empieza la acción... @paugasol molta sort crack!!! Una abraçada @dafnefdez @DaniMateoAgain la amistad es lo mejor q hay... Abrazo a los 2 @dafnefdez tienes razón xo tb tienes q saber de quien esperas... Un beso @carlotafabregas MOC MOC Bon dia, primera sesión de recuperación terminada, todo muy bien. X la tarde otra, Sin prisa xo sin pausa... El basquet es así... Jejejeje bona nit Cuando ves jugar a Federer crees q el tenis es fácil... Q crack!!!! El fútbol es así... Ya en casa, aquí jugando con mi primo. Un beso para tod@s http://t.co/dsiNfB7Z Como me cuida mi hermano @putxi9 #amordehermano http://t.co/yohHcQsN Muchas gracias x los mensajes. Un fuerte abrazo!! Una abraçada!! http://t.co/tG16lQDA Buenos días, ya estoy en la habitación después de la operación. Todo bien. Un abrazo Cenando con mis hermanos!!! Moc moc... http://t.co/dlr4YKLI Quién es el amigo de los niños? Oooohhhh!!! http://t.co/HiBMPTUD Vaya paliza q le he metido a mi amigo @javipobla  al Apalabrados. Abrazo Que partidazo del Colombiano Falcao, siempre q la toca peligro... Que golazo!!!! Que calidad... Bona nit! Muchas gracias a todos x vuestros mensajes. Estoy animado, pronto a tope!! Un abrazo muy fuerte! RT @javiervillalba5: Necesito un favor. Entrar en mi cortometraje Sin Mirar Atras, http://t.co/wXfOr9oT Registraros y votarlo. Para gana ... @cesc4official x molts anys nanu!!! Un petó Muy contento x la victoria. La dedicatoria del gol era para mi mejor amigo Javi. Bona nit Cenando con @cesc4official @fontas24 y el falso de @3gerardpique un abrazo @javiervillalba5 claro q te voy a ver... Lo haces muy bien. Un abrazo fenómeno. Siempre estoy preparado para aprender, aunque no siempre me gusta q me enseñen... @Giovannihinojos ya la he visto, muy buena. Hoy he terminado la 1 temporada de Tierra de Lobos. Cuando sale la 2 en dvd? @torreBe @dafnefdez @Silvinha_ac @3gerardpique yo pensaba q con el golpe en la cabeza se pondría bien! Xo ya veo q no... No tiene solución. @albertllovera molta sort crack!!! Gaaaas. Abraçada @claudiadelariva no pasa nada, a seguir... Disfruta de Ibiza. Un beso!! MOLTES GRÀCIES X TOT PEP!!! Ens has ensenyat el camí... Una abraçada molt forta. Ya tengo regalo para Sant Jordi!! Ja tinc regal per Sant Jordi!! http://t.co/KMnqxbYf Después del duro golpe de ayer, ahora toca pensar en el martes, nos jugamos una final de Champions... Visca el Barça!!!! @claudiadelariva si puede ser no tardes 2 años a volver a verme... RT @FCBarcelona_cat: Posa’t aquesta imatge al teu perfil de Twitter per donar suport a l’equip! SOM i SEREM! http://t.co/1Rhvsodg Bon dia! Ya nos vamos para bcn, se puede tener + sueño???? Feliz domingo @capde11 felicitats crack!!! Una abraçada Moltes gràcies a tots xls missatges. Muchas gracias a todos x los mensajes. Besos, buenas noches. Bon dia! Ya tengo el libro de la Roja por dentro, un abrazo. http://t.co/u33LKuyX Sabéis q es esto? http://t.co/qegR4Dag Diioooooooos!!!! Q nerviós! Q grande Marc Marquez. Felicitats crack! Increíble la carrera de Moto2... @carlotafabregas oooooohhhh! Petó guapa @Espardenyada Xic jo tinc q anar a millorar marca... Un placer como siempre, espero no tardar un año a repetir... http://t.co/sTWJOR1h Estoy cenando con alguien y sigo en silencio... @La_Queca et trobo a faltar, torna aviat a casa... RT @crackoviadeTV3: Ja tenim @La_Queca!  I mireu qui ha aconseguit atrapar-la!! Moltes gràcies @Carles5puyol http://t.co/0fqWo0VD @javipobla no entramos nanu... Jejejejeje Comiendo con @PasuzuTweet, ahora rueda de prensa y entrenamiento!!! Feliz tarde! RT @SkyGames2012: Mañana  presentación de SKyGames2012.12.30 hras en el  Museu Colet en BCN con el Secretari Gral de l’Esport http://t.c ... Comiendo con mis hermanos @3gerardpique y @cesc4official. Moc moc http://t.co/zFf732S3 Avui es l'aniversari de @JuanjoBrau Moltes felicitats amic!!! Petó @javipobla q fas soci? Ja estem a l'hotel, ara una mica de pasta i cap al llit... Siamo arrivati a Milano, cittá fantastica.... Buongiorno a tutti @noe5puyolina muchas felicidades, espero q pases un buen día. Beso RT @joanpowergym: Quieres conocer los secretos de suplementacion de Carles Puyol? Entrevista en http://t.co/ocndBs1o. @JuanjoBrau felicitats nanu!!! Així m'agrada q entrenis x quan em retiri, petó @donmartaday muchas gracias, necesitas hacer mucha fuerza para q marque yo... Disfruta de la compañía. Besos Ya en la habitación, me estoy riendo mucho con el libro de @albertllovera  Bona nit RT @albertllovera: Uno aprende a ser feliz cuando entiende que estar triste es perder el tiempo y perder tiempo es perder vida y ... eso ... RT @JORDIRIOS: Hoy en Madrid @lamonicaperez y compañia,estrenan : @QDDF2012 @torreBe un beso!!! Felicidades máquina!!!! http://t.co/ORKRf1Ms @marservia moltes gràcies!! Petó Hace tiempo empecé quitando las primeras piedras, hoy he desplazado la montaña... Xo sigo quitando piedras. (Albert LLovera) @alipuyol buenas noches, un beso! Te quiero hermano!!!! Mucha fuerza!! http://t.co/zc5n7Uiu @A_Xouxere cuidado con estos 2 q son muy peligrosos, buenas noches!!! @tpromuevo un abrazo fenómeno!!!! Comiendo con @javipobla en una terraza de bcn, increíble el día q hace!!!! Un abrazo. Podréis ver a Suite el 4 de abril en Mallorca en el festival Spring Meeting!!! Buenas noches. Suite, vaya fenómenos http://t.co/kTZJa8tB @LuchoGarcia14 la foto es real, lo q faltaba... No tiene limites. Abrazo crack!!! Tb de portero? Increíble... http://t.co/OGRb4IGW @WMakinaciones la última sonrisa máquina... Un abrazo @xtina24_ moc moc @carlotafabregas em tinc q preocupar?? Ooohhhh moc moc @PasuzuTweet xo cada dia ho tinc + clar... Hay días tontos y tontos todos los días... RT @Jorge_Morell: @otramallorca @Carles5puyol Que se lo pregunten al Gato de Schrödinger, mecánica cuántica en estado puro http://t.co/G ... RT @im_08: @Carles5puyol Preguntale al gato de Schrodinger. Se puede estar vivo y muerto a la vez? @firstLadyD4 \"the peoplo in the world\" o tu aprendes español or I learn english. @dafnefdez no son sólo los de Madrid... @tkdotkom un fuerte abrazo amigo!!! ZzzZZzz!!! Bona nit Bon dia, buenos días, ya en la ciudad del fútbol. X la tarde entrenamiento. Abrazo @PasuzuTweet jejejejejejejeje ;-) Viendo MILAN-JUVENTUS Buenas tardes!!! Me voy a entrenar, un fuerte abrazo!!! RT @javipobla: Sprint Ciclo Club POBLA: L'SCC POBLA A BALAGUER http://t.co/qQpRuKoX @PasuzuTweet m'han dit q tu ets un crack? Le acabo de pintar la cara a mi amigo @xaviyeye al futbolin... Ooooohhhh!!!!!!! Partido increíble!!!! Aquí una foto con el + grande!! http://t.co/9qbzP9H1 Increíble Lorbek!!!! @__ClauuPuyi gracias, un beso @XaviMolist @nayrajosy sort nanu!!!! RT @isaacml14: Y al final me disfracé del gran capitán: @Carles5puyol !!!!! http://t.co/QKd3qkHY @PasuzuTweet penso igual ;-) Ya he terminado el libro el Prisionero del cielo,muy bueno. Ahora toca Steve Jobs @PasuzuTweet @Borja_Pardo muchas gracias. Un abrazo. Me voy a dormir, xo antes un poco de lectura, el prisionero del cielo... Bona nit RT @torreBe: Viendo http://t.co/utsZAWsR \"TARDE\" nos haceis RT si os gusta? podeis dejar vuestro comentario en la web. GRACIAS RT @EduPolo: Valdés: \"A Piqué lo veo perfecto, como siempre, no hay que darles más vueltas. Para mí es el mejor central del mundo, no ha ... RT @Lv_5: Tenemos futuro! @Carles5puyol solo hay uno, pero... :) http://t.co/LAaBmtTA Bona nit, buenas noches!!! Q golazo de Boateng... Muy buen resultado. ahora a descansar al hotel, mañana volvemos a Bcn. Bona nit http://t.co/VnWUlXYh Ya hemos terminado el entrenamiento y nos vamos al hotel a cenar y descansar. Un abrazo!!! @torreBe ese es el camino... ;-) besos RT @shuarmamusic: En mi facebook o en www.shuarma.com podeis escuchar \"Llueven piedras\" primer adelanto de \"Grietas\". Me encantara saber ... http://t.co/ClMMgJTz perdón q he puesto mal el link . Me voy a entrenar. Abrazos @PasuzuTweet a mi m'agrada... Partido muy completo,nos espera otra final!!! Aquí os dejo una foto con @WMakinaciones Bona nit http://t.co/qC6VPcpG \"@FCBtv: Esta noche (21.30h) el actor @JordiRios es el protagonista del programa 'Estació Camp Nou' en Barça TV http://t.co/Hhq8JIEu\" keitee Muchas gracias!!! Me alegro x Luis y Bojan. Un abrazo Como va la Roma? Gracias @nayrajosy molta sort crack!!! Una abraçada Ya en casa, a descansar para el miércoles q nos espera un partido muy duro!!! Bona nit Bon dia, buenos días!! Sabéis quién es el niño? Un abrazo http://t.co/qrBTvnJT Bon dia, buenos días. Oooohhhhh!!! Felicitats!!! #25gerardpique http://t.co/Iv3jmnJi Ya en Bcn, a descansar. Mañana +. Bona nit!!! #25gerardpique Gran partido. Hoy es el cumpleaños de mi amigo Geri. Moltes felicitats!!!! #25gerardpique http://t.co/wnwbldao @donmartaday muchas gracias, así me gusta, ahora + q nunca. Besos Bon dia, buenos días. q fríoooo!!!  Ya nos vamos a Valencia. Un abrazo. RT @LuisJoseDuran10: @Carles5puyol Puyol ese es tu hijo perdido en Republica Dominicana. http://t.co/O79V9fxB @torreBe muchas gracias, ya estamos en el hotel. beso @por_elmundo no tengo el gusto de conocer a Raimon Samsó, el libro es muy bueno, no hay nada + @A_Xouxere sí!!! Es muy bueno. Ya en el tren, ahora un poco de lectura. \"Cita en la cima\" Bon dia, buenos días, desayunando con Busi en el estadio. Un abrazo Nunca te olvidaremos!!!! http://t.co/5PWyerJg @XaviDLA @PasuzuTweet quin parell... Bon dia, buenos días hoy entrenamos x la tarde, ahora café con @putxi9 \"@dafnefdez: Pedazo de relojes los de @Carles5puyol. @Silvinha_ac @torreBe @donmartaday http://t.co/F86WjUhA\" con esas modelos... Un fuerte abrazo a la familia de Dani Montesinos. RT @javipobla: A lo Pallars #volemlotren . Fem-nos sentir!! Bon dia, buenos días, desayunando con los compañeros y ahora a entrenar. Un abrazo @torreBe bon dia!!! No me dirás q no es preciosa Barcelona!!! Saludos Viendo Mirandés - Espanyol con @cesc4official y @3gerardpique. Saludos moc moc @SignedDudu moltes gràcies ;-) Ya nos vamos al hotel a cenar y descansar para el partido de mañana. Hoy Roma-juventus. Daje Roma!!! Bona nit @julianobelletti grande hermano!!!! Un abrazo!!!! Hola a todos!! Hemos logrado 3 puntos importantísimos contra el Málaga! Ahora a centrarnos en el partido del... http://t.co/c3GokSm5 @kilianj felicitats crack!!!! Una abraçada Ya en Malaga, ahora para el hotel a cenar. Bona nit @torreBe Q peligro... Saludos ;-) @WMakinaciones yo sí socio!!!! Abrazo. El imperio!!!!! @Toquero_theboss siempre estoy dispuesto a mejorar... Toda ayuda es buena. Un abrazo \"@Guaje7Villa: (PD)Os dejo una foto con el más grande @Carles5puyol! Qué golazo! Un lujo tenerle como capitán! http://t.co/dGOTh8bs\" abrazo! Ya somos 2 millones!! Muchas gracias x vuestro apoyo. Moltes gràcies!!! Nos vamos a entrenar. Abrazo. Gran partido, grande hermanoooo!!!!! http://t.co/0eY5v8Di Hola a todos, victoria muy trabajada contra el Betis, un equipo que juega muy bien. Agradecer a la afición que... http://t.co/gfxnbB9U Hoy he conocido a @_danielmartin_ eres un crack!!! Lástima q solo he podido escuchar unas canciones http://t.co/WZv8KYSG @cesc4official ooooohhhhh moc moc. Ritaaaa ritaaaaaaaaaa... #Ànimsfontàs t'estimo amic!!!! @fontas24 Ya estamos en cuartos de la Copa pero tristes por la lesión del Andreu Fontàs. Muchos ánimos Fonti!!\n\nJa estem... http://t.co/i5aJ3LNQ @DonaireG muy pronto, un abrazo Escuchando al gran @shuarmamusic. Q fenómeno En el bus de camino a Pamplona. Feliz día. Viendo Roma-Fiorentina. Vamos Roma!!!! Felicidades a Leo por su tercer Balón de Oro y a Pep por ser el mejor entrenador del año. También felicitar a... http://t.co/f7hTeA6r Desayunando con @fontas24, hoy entrenamiento en el mini y Después visita a los hospitales. A ver si @cesc4official me enseña a meter un gol... Bona nit, buenas noches. http://t.co/hkFHqKlQ Bon dia, buenos días me voy a entrenar para preparar el partido de copa, Xo primero un café. Abrazos \"@_danielmartin_: Día 12 enero en Barna quedan entradas !! Y 20 en Oviedo también !!!!\" Nos vemos pronto fenómeno. Un abrazo RT @javipobla: La PB Carles Puyol de Pobla ja té facebook. http://t.co/M0ZQCQV4 RT @SBE12: Añada Real, vinos de la Rioja. Botellas firmadas por Puyol y por Xavi. Gracias amigos http://t.co/UsMQ9a8V RT @javipobla: Als amants del ciclisme us recomano seguir a @ciclobonaigua Feliz año nuevo desde La Pobla, yo lo celebraré con familia y amigos. Os deseo lo mejor para el 2012.\n\nBon any... http://t.co/SuiQZnE1 Ya tenemos un compañero + en twitter @Guaje7Villa. Bienvenido hermano. Un abrazo!!!! Hoy he terminado el libro de Joan Piqué \"DUES VIDES\" muy bueno, lo recomiendo 100x100. Felicitats Joan!!! RT @ASoucek: Buscamos a Bala, nuestra yorkshire. Se ha escapado y estamos en baqueira. Pido RT xfavor. Si alguien se entera, q me escrib ... Ver la ilusión con la que entrenan los niños de La Pobla!! #razonesparacreer @Maria5ochoa bones festes guapa, un petó!!! RT @javipobla: Papa Noël y los renos ya estan en Bcn!! http://t.co/rhAyBmO4 @javipobla lo q dius soci? Dolooooor? RT @xavicoral: Només per conèixer gent com el bomber Josep val la pena presentar la #maratotv3... RT @fontas24: Des de Japó no ens oblidem de #lamaratóTV3 Per la regeneració i el transplantament d'òrgans i teixits! Entre tots podem sa ... Va x ti Guaje!!! Te queremos!!! http://t.co/S92dSsIk En el metro de camino a Ginza! http://t.co/1oXDxnie Hola a todos, victoria que nos lleva a la final de clubs contra el Santos. Ánimos para el Guaje!! Seguro que... http://t.co/albFLtqZ Sabía q mi amigo @WMakinaciones (Pinto)era un amante del sonido pero no hasta q punto era tan máquina! Miren,moc,moc! http://t.co/PH5dFX5J @MarcGasol felicitats crack!!! Una abraçada. En el metro de Tokyo con @cesc4official y @fontas24 oooohhhhh moc moc http://t.co/yQorQEKS @EduPolo seguro? RT @JayJayGT: @Carles5puyol es el Monte Puyi.... Dgo Fuji hehe, grande Capitán! Vistas desde el hotel, sabéis q es? http://t.co/oMy3t1xe @FansBartra32 una forta abraçada, jo tb a ell, es un crack!!! @javipobla como puedes ser tan falso? Si fue un paseo... Hoy te doy la revancha. Hola a todos! Hemos cerrado la fase de grupos con victoria, que placer ver tanta gente de la cantera en el campo.... http://t.co/GHB4t8e2 Hay muchos colores... Os gusta? http://t.co/B1o0P8rc Buenas tardes, estoy viendo los nuevos modelos de CP5. Después os paso alguna foto.  Abrazo Sico Farràs, professor de  generacions de pallaresos és Medalla President Macià!  Felicitats!! Busqueu el perquè i us sorprendreu. Os presento a mi hermano, ahora desayunamos un Colacao y aprovecharemos la jornada de descanso para ponernos al día. http://t.co/Ht8NJp8Q Hola a todos, qué os parece el grupo que nos ha tocado para la Euro 2012 con Irlanda, Croacia e Italia?\nMe voy a... http://t.co/hOlsQvzY @alejandrosanz en las voces de #PositiveGeneration nos hablan de un futuro sin #sida. Ayúdanos a difundirlas http://t.co/vHXUVETA #DiscoMSF Q tal @BoKrkic ? Os presento a mi doble!!! Un abrazo!!! http://t.co/K9JtXj58 mirar a cesc... Para mi mejor con el pelo largo!!! Xo t'estimo igual amic. Moc moc http://t.co/NgdUP16n @cesc4official nooooooooooo!!! @PasuzuTweet nanuuuuuu q fas? Nanuuuuu q haces? Nanuuuuu what are you up to? @cesc4official aguanta cesc aguanta!!! @cesc4official nooooooooo!!!!! Q et queda molt b! @cesc4official ooooohhhhh sou germans? Moc moc Hola, ya hay ganador de las 2 entradas del partido Barça-Levante , en la pestaña del concurso hay el nombre.... http://t.co/xg9HzkhZ Bon dia, buenos días quiero dar la bienvenida a @BoKrkic. Guerxinaaaa com estas? Una abraÇada Os dejo el link del concurso de 2 entradas + conocernos después del partido Barça-Levante que organizo en facebook. http://t.co/HDQaiXs0 Hola a todos, mal resultado el de hoy, lo hemos intentado hasta el final pero no ha podido ser, ahora no queda... http://t.co/4N1BeBwR @Jeffren17_SCP vamos máquina. Un abrazo Buenos días. De camino a Madrid, escuchando @mowlihawk \"Otra Visión\" recomendación de @WMakinaciones. Me gusta pishaaa!!! RT @CarmeBarcelo: Doneu suport avui a @GranRecapte2011 Del @BancAlimentsBcn Necessitem recollir 800 tones d,aliments a Catalunya. Fes RT ... RT @PasuzuTweet: Gracies @Carles5puyol !! Bonic rellotge!!! CP5 forever!! http://t.co/CZhBZwID Hola a todos, hoy hemos vuelto de Milan y tarde libre. Este domingo os daré una sorpresa por aqui, por el... http://t.co/38M1ZAlR @AlejandroSanz felicidades fenómeno. Un abrazo Cesc ya quiere ir directo al campo del Getafe... Oooohhhhh moc moc. bona nit. http://t.co/1nudMUzo Hola a todos, hoy hemos entrenado en San Siro, donde mañana tenemos un partido de los grandes contra el Milan para... http://t.co/BCzOs6OJ Hoy cena con @javipobla @mpallas23 @JORDIRIOS @lamonicaperez. Q fenómenos... http://t.co/1qbNOnxr Después del entrenamiento de recuperación, ahora aperitivo con @JuanjoBrau @xaviyeye ara ens veiem mandril... Bon dia, ayer me llevé el balón a casa... feliz domingo http://t.co/K2PHlC0u Feliz x la victoria y el gol! Voy a verlo repetido que no me lo creo! ahora un Colacao y a recuperar fuerzas!Bona nit. http://t.co/E89pkQXB Hoy nos ha visitado Chusma, un antiguo compañero de la masia, q zurda tenia, casi como la mía. Jeje http://t.co/S7Ns7o2r @_danielmartin_ gracias a ti fenómeno, x ahora me gusta mucho. Abrazo @fontas24 moltes felicitats crack!!!! Una abraçada RT @javipobla: I think Lionel Messi should be named @TIME's Person of the Year! Vote now http://t.co/fsXFvfE9 #POY2011 Nos vamos a entrenar... Abrazo!!! @PasuzuTweet siiiiii x on pares? Bon dia a tots, ahir vaig anar a veure l'obra de teatre \"39 esglaons\", si voleu passar una bona estona us la... http://t.co/C9TpvxdC Hola a todos, no hemos podido lograr los 3 puntos en un partido vibrante y bonito para el espectador. Ahora a... http://t.co/LCejc61I Hola a tots, avui el F.C Barcelona ha inaugurat la nova pàgina web de l'entitat, segur que us agradarà!!... http://t.co/GLcFT6mF Hoy he empezado a leer el libro de Dani Martín, 'Soñar no es de locos', y me está gustando mucho. Seguro que me... http://t.co/1N9he6dY Hola a todos, contento de certificar el pase a octavos, ahora a continuar luchando para quedar primeros de grupo,... http://t.co/E5lGbLtw Hola a todos, ya estoy en el campo con Juanjo Brau tomando un colacao antes de ir al aeropuerto, mañana champions! http://t.co/aPLkdrJN RT @kilianj: Ajudem a l'albert a anar a la MdS http://t.co/uXXNRMpH Viendo el partido en casa con @javipobla y Miki Roqué... Som-hi nois!!!! Hoy entrenando... Pronto a tope!!! Un abrazo http://t.co/Xr96jrWb @_danielmartin_ el partido es a las 20:45 ;-) una abrazo fenómeno. RT @sumatealrosa: @Carles5puyol Muchísimas gracias por todo tu apoyo en este día tan especial para todas las mujeres, y ayudarnos a difu ... RT @No_al_Cancer_: Ya es el Día Internacional contra el Cáncer de Mama. Hagamos que #sumatealrosa sea trending topic. ¡Por la lucha cont ... \"@Marie_1987_: Un nuevo dibujo de ti. Te pareces a un gladiador o un guerrero. Besitos @Carles5puyol http://t.co/4PWXLqNf\" ;-) @A_Xouxere muchas felicidades!!! \"@fontas24: Uno de los días más importantes de mi vida, muy feliz con la renovación!!\"Moltes felicitats nanu!!!! Una abraçada \"@frong14prince: Muy paradójico que @Carles5puyol se ria de la melena de otro\" tienes razón... Ssshhhhh Vaya peluca... Oooohhhhh moc moc http://t.co/lJUTsxXf RT @Marie_1987_: mi dibujo de @Carles5puyol http://t.co/XRZZODsO Bon dia, buenos días, me voy a entrenar, xo antes necesito un café xq estoy dormido... Oooohhhhh moc moc Bon dia, buenos días, los de Blackberry volvemos a sonreír. Desayunando con @javipobla. @A_Xouxere yo tb... @cesc4official doncs la meva noooooo!!!! Moc moc @albertboix64 oooohhhh moc moc RT @MonicaCarrillo: Esta semana cayó \"En la red de Mónica\" @Carles5puyol. Aquí os dejo la entrevista completa.\nhttp://t.co/0DmIOejT @A_Xouxere Boas noites Viendo al gran @ristomejide ooohhhhh moc moc @PasuzuTweet eres un vividor... Ooohhh moc moc Buenos días como se presenta el domingo? Yo ya he entrenado y x la tarde otra vez. Un abrazo @A_Xouxere bona nit ;-) RT @PasuzuTweet: Dedicat al meu amic Carles \"Ten el coraje de seguir a tu corazón y tu intuición\", Steve Jobs en estado puro... http://t ... RT @ifilosofia: No te arrepientas de lo que has hecho, porque en un momento en tu vida, era exactamente lo que querías hacer Ya he terminado la entrevista con @MonicaCarrillo. Un placer!!! http://t.co/Ab8aOKV9 @carlotafabregas oooohhhh moc moc Bona nit, buenas noches. Besos RT @andresiniesta8: Hola a todos, os presento la página oficial de Facebook de mi capitán! http://t.co/dxSr7QaI @Maria5ochoa bona nit guapa. Petons RT @martinmm94: @3gerardpique @Carles5puyol Ooohhhhh Moc Moc!! http://t.co/GQGFT8QR RT @MSigalaa: El mejor regalo que mi novia me pudo haber dado de cumpleaños!!! @Carles5puyol  http://t.co/wNjjjfLo RT @antequera_20: @Carles5puyol @3gerardpique @cesc4official #cesclocho http://t.co/ZQdwFVGv @A_Xouxere bona nit! @A_Xouxere jejejejejeje buenas noches @FansCarlesPuyol bona nit, un petó RT @ARAesports: VÍDEO: El primer gol de Bojan amb el Roma, TT mundial: http://t.co/q7pZ3sid via @diariARA @LUISENRIQUE21 felicidades hermano!!!! Vamooooos. Abrazo Felicitats Barça Regal!!!! @cesc4official ànims nanu, en res estaràs a tope!!!! Un petó RT @LoPallars: He arrivat als 100! Hem mereixo un RT no? @ainaclotet @Carles5puyol @jubach12 @soler_toni  @srarakutjo @riberajordana @mp ... RT @xantallavina: \"@Buenafuente: Debemos luchar por decir lo que pensamos y que NADIE ni NADA nos penalice por ello.Faltaría más.\" Ya estoy en el rest, estos 2 son un desastre!!! RT @carlotafabregas: Yeha!!!! #cescpelucafuera!!! Tendremos q cortarle el pelo a cesc a la fuerza!!! @3gerardpique creo q no hay color... RT @male_vola: @3gerardpique , @cesc4official necesita un corte, y @Carles5puyol dejenlo asi, se ve perfecto. RT @JustDoIt_Pique: @3gerardpique nooo!! que @Carles5puyol  no se lo corte al pelo, no seria el mismo !!! RT @pablichi92: Yo pienso que la melena de @Carles5puyol es la más cool que hay sin ella no sería lo mismo.. Sería como @3gerardpique si ... RT @LadyDi130: @3gerardpique con esos rizos no te metas! Los rizos de @Carles5puyol son sagrados! @3gerardpique tendrás q ser portada muchos años... Ooohhhh moc moc @cesc4official ja veus, quin falseti!!!! Moc moc @Tarzan5puyol un abrazo fenómeno. @Laraarmeria buenos días. Un beso Bon dia, buenos días tomando café con @cesc4official y @3gerardpique ooohhhhh moc moc A partir de ahora tb me podréis seguir x facebook. http://t.co/qbJVQSa9 un abrazo #animsafellay un abrazo hermano!!! Bon dia, buenos días, me voy a desayunar con @javipobla. Hoy entrenamos x la tarde. Abrazo!! Viendo Man Utd - Chelsea Muchas gracias, moltes gràcies. Felicitats Marc!!!! @PasuzuTweet i 4 ditets... Jejejejeje Muchas gracias!!! Si me podéis informar de la clasificación al final de la carrera Como va Moto2? @PasuzuTweet q burro... Jo cargols avui... @PadelSpain muchas gracias. Un abrazo @nayrajosy molta sort nanu Bon dia, buenos días, me voy a entrenar. Feliz domingo Bona nit #twitterencatala RT @javipobla: Felicitats Putxi!! http://t.co/yNeb5HpX Bon dia, buenos días, me voy a entrenar. Abrazo @lamonicaperez tots al teatre!!! Petons \"@JORDIRIOS: Moc,moc!!! @Carles5puyol @cesc4official http://t.co/M8tNrcB”\"ooohhhh Moc moc Bon dia, buenos días. Tomándome el segundo café de la mañana. Viendo Roma-Cagliari. Vamoooos hermano!!! Bon dia!!! #diadanacionaldecatalunya Bona nit, buenas noches. @belengutierrezg muchas felicidades, q pases buen día. Besos Hoy otra vez el traje de gala!!! A final de temporada lo voy a sortear. Abrazo a tod@s. @XaviMolist gràcies nanu!!! Abraçada forta bon dia, buenos días. Feliz de volver a la convocatoria. Gracias x todo vuestro apoyo durante estos 8 meses... GRACIAS!!! Moc moc Bona nit, buenas noches. @Carito_Culer mmmmm creo q sí!!! Cenando con @javipobla y @PasuzuTweet q grandes!!! Café con @javipobla. Pronto buenas noticias... @PasuzuTweet ens veiem aquesta nit crack!!! @rafinha_alc93 yo juego con mi mejor amigo @javipobla. Busca día... Se puede ser + falso q Piqué? He quedado para comer y me ha dejado tirado... Suerte q tengo a Cesc. @rafinha_alc93 cuando y donde queráis. Abrazo fenómeno. Yo tengo uno en casa... Ya tengo la nueva BB 9900...Oooohhhh moc moc RT @lamedialunasusu: He actualizado mi pàgina web! A ver que os parece!!! http://ow.ly/6oxhK @judithaldabo moltes felicitats!!! Petó Donde estoy? La culpa es de Piqué, xo la venganza será terrible... http://t.co/BaUSLx7 @bolli5 muchas felicidades, espero q pases un buen día. Abrazo. Bon dia, buenos días ya en la ciudad deportiva, un café y me voy a preparar para entrenar. Feliz día Bona nit!!! Ciaooo @javipobla tururut Arrivederci Roma!!! Tomando café con el gran Albertini!!! Un amigo de verdad. @Maria5ochoa petó guapa!!! @AlbertoJoseFCB un abrazo Bona nit, buenas noches. Besos @natigomez1978 un beso!!! Muy guapa @Eva_Bojanista9 no crec... @laaiagotsens moltes felicitats!!!! @MarcBartra32 crack ja et tinc controlat... Abraçada RT @sroberto_18: Marc Bartra ja esta al twitter!!! @MarcBartra32 !!!!!! Benvingut!!!! Me voy a entrenar un poco... Ayer me hubiese gustado estar en la cena de la quinta en La Pobla de Segur!! http://t.co/oWPyx95 Hoy día de turista, me encanta Roma, ahora tomando un aperitivo en el bar \"della pace\" Después de comer en un restaurante con el camarero + borde de toda Roma, me voy a dormir un poco... Abrazo ooohhhh moc moc Wow!!! Increíble... http://t.co/xDPUUGi RT @JORDIRIOS: “@Carles5puyol: La fontana piú bella del mondo...due anni fa  http://t.co/iT1IRS9 La fontana piú bella del mondo... http://t.co/hYMPvjX Sopar amb @Malenacosta7 Laura i Francesco. Bona nit!!! http://t.co/QPvvtEf Buenas noches desde Roma!!! http://t.co/iKnrmQZ @cesc4official ooooohhhh bon profit!!! @3gerardpique muchas gracias, espero q nos podamos retirar juntos. Cuantos años te quedan? 3-4??? Hola @3gerardpique :-) @kilianj felicitats crack!!!! Sale el sol... Feliz!!!! Gracias a los q siempre están, sobretodo en los momentos difíciles. Ya en casa!!! Feliz día!!! @3gerardpique segur??? Me parece q no... Jejejeje @jordievole ssshhhhh!! ;-) Si todo el mundo te quiere, algo anda mal. Encuentra por lo menos un enemigo para mantenerte alerta... Bon dia!!! De vuelta a bcn... Oooohhhh!! Moc Moc http://t.co/LkqLG2I Bona nit, buenas noches. Moc moc RT @JorjeAlonso: ya que nadie lo hace tendré que comenzar yo. Ayudemos a @Carles5Puyol #colectatrajeparapuyol @3gerardpique ooohhhh moc moc!!!! Muchas felicidades Leo, te lo mereces. Ahora nos vamos a entrenar. Abrazo He estado mirando todos los trajes q tengo...  con el q me siento mejor es con el escudo del Barça en el corazón. @Esterssish muchas felicidades!!! Besos Comiendo con @PasuzuTweet en bcn, restaurante nuevo, después cuento q tal, los primeros platos muy buenos... Abrazo Feliz domingo a todos!!! Bon dia!!! Ooooohhhhhhh moc moc!!!!! http://t.co/MnxsuSU Después de 2 cafés ya estoy despierto. Me voy a entrenar. Abrazo Bon dia!!! @ristomejide buena foto, mucho crack junto... Abrazo Bona nit, me voy a descansar q hoy creo q me he dejado las piernas en la montaña... Abrazo!! Moc moc @WMakinaciones q tiempo? Bona nit @heyletmesleep algún día la contaremos... @Carlespuyolfans muchas gracias, estoy feliz, me encanta entrenar...besos Entreno muy duro, series en la carretera de les aigües. Tengo q reconocer q lo he pasado mal, hay q sufrir ahora para disfrutar después... Ya estoy preparado, hoy @JuanjoBrau va a sufrir... Jejejejeje @MyLifeAsJoy muchas gracias. Un beso Bon dia!!! Con mucho sueño me voy a entrenar. Ya en casa!!! Bona nit moc moc @Sofi4Velez lo voy a pensar ;-) @ASoucek muchas gracias fenómeno. Un abrazo A leer un poco. Ciao RT @DanieGonzalez21: @Carles5puyol Avui a demostrar qui som!! Et posso una cançó que se que et motivarà per a aquesta nit! http://t.co/E ... Bon dia!!! Me voy a entrenar. Feliz día Bona nit, buenas noches!! RT @lidiacirera: @Carles5puyol @3gerardpique  per salvar en Joel http://t.co/F6MlWNG  #SalvemEnJoel @Ramolga moltes gràcies!!! @xDonutsLover_ un besooo, bacio?? @valdesita1 no lo dudes... @tomymarce q tinc q portar 2,3... @Martona_blanca moltes felicitats!!! Petó @jordievole jejejejejeje. Una abraçada crack!!! Me voy a entrenar. Un abrazo a tod@s @dodi0812 felicidades!!!! @maria_ruano así es, muy bueno ;-) @Luissfutbol8 claro, q pensabas? @_Milanista7 ma quanto? Moc moc @DvePG moltes gracies Nanuuuuu!!!benvingut a casa!!! Feliç de tenir-te aquí. @cesc4official ooohhhh moc moc Viendo la luz al final del túnel, espero q no sea como otras veces, q era un coche en contra dirección. (Vaso medio lleno) @paulafersob muchas felicidades!!! Bona nit, buenas noches!!! Besos Leyendo El mundo amarillo, de Albert Espinosa, increíble su historia... Comiendo chocolate negro... RT @Santihumor: La fama no hace gilipollas...los descubre... Comiendo con Fernando Llorente, q fenómeno... @LuchoGarcia14 gracias fenómeno. Bona nit Bon dia, me voy para el aeropuerto... Feliz día Bona nit, buenas noches. Un abrazo Mucha suerte!!!! ;-) Buenos días familia. Tomando café con @JuanjoBrau en la Ciudad Deportiva. Un abrazo Q bota os gusta +??? http://yfrog.com/khrl8gj @juliaferrem muchas gracias tb. Abrazo Lo único bueno es q me he leído el libro q me recomendó @pae1270 Si tú me dices ven lo dejo todo... Pero dime ven. Gracias Paloma. Buenos días, bon dia. El Jet lag me ha atacado y me he despertado a las 3. Vaya día me espera... Abrazo @AndreaIrazoki7 el médico y Marina los he leído muy buenos. Gracias. Un abrazo @3gerardpique bona nit amic. Ooohhhh moc moc RT @CarmeBarcelo: Va por Dani Jarque, el #eterno21 Comiendo con @Malenacosta7, @javipobla y @mpallas23. Un abrazo @Gabri3R los he leído los 2, muy buenos. Gracias @WMakinaciones q aproveche!!! Un abrazo Bon dia!!!! A entrenar. Bona nit, buenas noches. Besos Muchas gracias a tod@s!!! Un abrazo. Buenas tardes, me podéis recomendar un libro? Gracias. @8AngelBlanco muchas gracias. Moc moc @bethrodergas gràcies guapa. Ens veiem aviat. Petó @megiblaugrana @caro3294 un saludo @Ciciiara sempre @SmileLikePique un beso @pablocolinas yo para ir a dormir... Zzzzz RT @ifilosofia: No te preocupes demasiado por lo que dicen de ti, ni siquiera Dios ha logrado caerle bien a todo el mundo... @nayrajosy @XaviMolist i jooooo @Jeffren11 buenos días fenómeno, q tal todo? Un abrazo BARCELONAAAAAA!!!!! Ya salimos!!! Un abrazo. @__Mary10__ no hay q rendirse, un beso @Sandriita_1992 a dormir ya!!! Buenas noches. Beso @LuchoGarcia14 gracias fenómeno. La chufa ya casi la tenemos a tope!!! Hablamos. Un abrazo @Traficologo gracias, un abrazo @Megustalarepa estoy en ello, gracias. Beso @Faany_3 todo llega, un saludo!!! Ya en el bus dirección al aeropuerto. Con ganas de llegar a bcn!!! @andrea_BartraBk gracias. Beso @tha10messi muchas gracias. Beso @R_Myriam ;-) @sandra8mp moltes gràcies. Ja falta menys. Un petó @maait_bartra6 de nada, un beso @fcbpassion un beso @JulianaFCB9 gracias, un abrazo @karn_ncole no hace falta, beso @Fcbmylife muchas gracias, un beso @alex_guavi7 muchas gracias @javipobla calla mandril,cuando vas a bcn? @XaviMolist q tal nanu? Tot b? Nos ja tornem avui. @carloxlopez xq? @TamaraMaartinez claro q te permito. @Jerobg no, me preguntan y contesto... Bon dia, buenos dias!!! El libro q he terminado,lo recomiendo. Abrazo a tod@s http://yfrog.com/keng8toj Bona nit, buenas noches. Ya he terminado el libro, lo recomiendo, muy bueno. @Ja_Ancin ok, muchas gracias!! Un abrazo Las derrotas no importan, a menos que uno se rinda... RT @MRJJFernandez95: @Carles5puyol ese estadio tiene el record d más personas viendo un partido de Baloncesto 108000 en el ALL STARS d D ... @LuchoGarcia14 bona nit nanu!!! Increíble estadio!!!! http://yfrog.com/kk3bhnlj @ThomazYuki10 muchas gracias, un saludo Nos vamos a entrenar, en el bus escuchando a @bethrodergas. Hoy termino el libro, mañana os cuento. Abrazo @PasuzuTweet a disfrutar!!! Ens veiem x bcn? Jo torno el dia 7. @wandaramosm lo siento, muchas gracias, un abrazo @Dmoreira17 muchas gracias!!! Un abrazo @Anita_g_g Que la muerte te acompañe de Risto Mejide @luvcasablancas Risto Mejide. @garcia7ramirez muchas gracias!! Un abrazo Voy a seguir con el libro, x ahora me gusta mucho. X la tarde tenemos entreno en el estadio donde jugamos maÑana. @aye_daii muchas gracias!!! @FatimaLuciaa un abrazo!! @sturf3nix muchas gracias!! Un abrazo @alessiabonilla lo siento, un saludo @isabelalbir no te enfades, abrazo @EddyLive82 un abrazo!!! @mixihandal95 un saludo ;-) @__Yuli__ bon dia @MonicaCarrillo y q tal? Saludo!! @Tarzan5puyol un abrazo crack!!! @Nina417 gracias @Danielosio muchas gracias!! @Teretwingo q tipo? @PaulaGaudes y te gusta? Bon diaaaaaaaa, buenos días. Para los q preguntan q leo: Que la muerte te acompañe de @ristomejide. Un abrazo Voy a leer un poco y pronto a dormir q estoy cansado... Bona nit, buenas noches!! @Ricardoperello pienso igual... Jejejeje Ya falta menos, cada día mejor http://yfrog.com/gzx9ftnj Con geri y @JORDIRIOS (mi hermano) moc moc http://yfrog.com/klh5lmtj He dormido 3h30min de siesta... Ahora una ducha y entreno. Abrazo Bon dia, buenos días!!! Me voy a entrenar al gimnasio. Feliz día Me voy a dormir, un abrazo para tod@s. Bona nit,buenas noches. @3gerardpique mañana ponemos una foto de los 2 sin camiseta y vemos no? Q os parece? Q dius nanu? RT @ICandelaria: y bueno, dspues d verle el abdomen a @3gerardpique y @Carles5puyol en vacaciones, sí q creo q Piqué es un envidioso...  ... @3gerardpique todos sabéis q el falseti es el, claro q soy yo, lo q pasa es q el es un flojo y tiene envidia Oooohhh!!!! Hoy he visto el entrenamiento con el mejor defensa de la historia, mi ídolo Paolo Maldini. Q fenómeno. Bona nit, buenas noches @PasuzuTweet disfruta amic!!! Ens veiem a la tornada. Una abraçada @javipobla q tal soci? Tot b? Ya estamos en Miami. Aprendiendo a tocar la batería con @WMakinaciones ooohhhh moc moc http://yfrog.com/h8dagrqj RT @ifilosofia: La vida no se trata de esperar a que pase la tormenta, se trata de aprender a bailar bajo la lluvia. @sroberto_18 molta sort nanu!!! Una abraÇada Bon dia!! Me voy a entrenar, después rueda de prensa. @XimenaGlzR igualmente. Beso RT @ifilosofia: Nada dura para siempre, ni siquiera los problemas y sufrimientos... A dormir un poco. Ciao Buenos días, hoy 1h30 de gimnasio. Cada día mejores sensaciones... @AlejandraP7 me encanta!!! Ooohhh moc moc Bon dia, buenos días, un poco de @shuarmamusic antes de entrenar. Feliz día Ya estamos en Washington, le podéis preguntar a @3gerardpique q le ha pasado durante el vuelo... Ooohhh!!! Moc moc Ya en el avión con Geri al lado, espero q me deje dormir... ànims Jonathan Soriano!!! Bon dia. Buenos días Hoy primer entrenamiento con botas!!! Suma y sigue... Felicidades al equipo. Nos vamos al hotel a descansar para mañana. Abrazo @javipobla lo q dius soci? @JuanAntZamudio muchas gracias @PasuzuTweet ara vaig a entrenar... Voy a dormir un poco. Ciao En el bus con @3gerardpique pensando la próxima broma q le haremos a @cesc4official. Oooohhhhhh moc moc Ya en el avión, ahora un poco de música y un libro, las 48 leyes del poder. @WMakinaciones q bonito, eres un romántico. Ooohhhh moc moc Bona nit-buenas noches. Un abrazo Mirar q foto!!! Os gusta? Hoy he visitado el Zoo de bcn con Karmele. http://yfrog.com/h3l78ljzj @RoberFan1PUYOL buenas noches y vuelve con tu novia... Jejejejeje ;-) Voy a ver MotoGP @3gerardpique, la gente está muy locaaaaaaaaa. WTF oooohhhhh moc moc Para los q me preguntan q tal la lesión, estoy mucho mejor, poco a poco vamos aumentando las cargas de trabajo. Si buscas atrapar 2 conejos, ambos escaparán... Buenas noches!!!! Bona nit amics RT @ifilosofia: Estás hoy donde tus pensamientos te han traído, estarás mañana donde tus pensamientos te lleven.. @Pastry1986 tu si q sabes... Abrazo Comiendo con @PasuzuTweet, caracoles lo mejor para recuperar bien!!! Abrazo Comiendo con mi socio de CP5. Pronto nuevos modelos y otras novedades. http://www.macchinacp5.com abrazo!! Bon dia, a entrenar después de una semana de vacaciones. Bona nit, buenas noches. RT @SoloQuotes: Cuanto más difícil sean nuestras batallas, mas satisfactorios... serán nuestros triunfos. (Jamas decaigas) RT @martiperarnau: Sergi Pàmies, en el artículo más brillante que jamás se ha escrito sobre lo que significa ser del Barça: http://t.co/ ... @Maria5ochoa moltes felicitats!!! Petons De vacaciones con @javipobla @xaviyeye y Putxi... Falta @3gerardpique oooohh!!!! @3gerardpique bona nit amic. Ooooohhhh moc moc!!!! Bona nit/buenas noches En casa relajado escuchando a @shuarmamusic Increíble carrera de @lorenzo99. Muchas felicidades fenómeno!!! Un abrazo Siiiiiiiiiii felicitats Marc Marquez!!!! RT @martiperarnau: Buen viaje a @JuanjoBrau que está volando a Argentina. Tras afinar a @Carles5puyol ahora va a por Messi. Manos de oro. RT @ifilosofia: Yo nunca dejare de ser lo que soy por caerles bien a otras personas.. @sroberto_18 bon profit crack!! ;-) Felicitats soci!!! @javipobla has mejorado marca. Ooohhhhh moc moc Hoy es un gran día, he vuelto a correr sin molestias... Gracias @JuanjoBrau. RT @SoloQuotes: Descubrimos lo grande que somos, cuando gente que ni siquiera te conoce... te critica. Q gran Roger Grimau!!!!un exemple a seguir. Estem orgullosos de tu!! Molta sort crack!!! RT @ifilosofia: Cuanto más difícil sea la batalla, mas satisfactoria sera la victoria.. Buenos días, Bon dia. @3gerardpique ooooohhhhhh!!! Moc moc RT @clubfansCPUYOL: 677 seguidores ya :) muchas gracias.... @Carles5puyol CADA DÍA MEJOR :) que ganas de verte jugarrrrrrr El próximo 8 de julio se estrena la película \"AMIGOS...\" De mi amigo el director @MarcosCabota no podéis fallar!!! Es la peli del verano... Buenos días, feliz domingo @shuarmamusic bon profit crack!!! Una abraçada Hoy he comido en La Noguera. Q buenos están los caracoles. Me voy a entrenar. Abrazo http://yfrog.com/h4q7pmoaj Ya en bcn para seguir con la recuperación... Buenos días. He leído las declaraciones de @cesc4official y las entiendo perfectamente, es el capitán del Arsenal... Un abrazo Comiendo con @JuanjoBrau @MerBlanquet y @Malenacosta7. El camarero Toni es un fenómeno. http://t.co/nqKkJms En la playa con @Malenacosta7  http://t.co/LVWpNPR Mañana x la tarde llegan @3gerardpique y @cesc4official a Ibiza. Ooooooohhhhhhhh moc moc Buenos días, café y entreno. @andresvelencoso tens raó crack. Una abraçada Ibiza es increíble. Me encanta. Oooohhhhh moc moc http://yfrog.com/keynmxj Comiendo con @JuanjoBrau Os presento a Puyi. http://yfrog.com/kerhij No tiene nombre, espero propuestas... @JORDIRIOS http://yfrog.com/kk7x4rj Hoy es un día triste para mi, Queca ha muerto, ya era mayor y no supo llevar la fama, ahora tengo otro animal de compañía, después paso foto Bon dia!!!! RT @OdiPam: Ayudenme a ganar Miss Sonrisa!!! Voten por MISS JUNIN!!! :D MILLONES DE GRACIAS!!! http://t.co/jPotEfr Ahora mismo he terminado la sesión de la tarde con @JuanjoBrau. Sigo con mi plan de recuperación mañana y tarde xo cambiando de escenario, ahora en Ibiza para desconectar un poco. Buenos días, como estamos? Yo siguiendo la recuperación, sin prisa xo sin pausa... Un abrazo Buenos días q tal todo? Yo sigo recuperando mañana y tarde con @juanjobrau @Jeffren11 suerte fenómenos @Jeffren11 mucha suerte fenómeno. Buen viaje. Un abrazo RT @escritoras: Antena3 va a maltratar a un chimpancé en un concurso [Firma para que no lo hagan]: http://bit.ly/iSJLmy Bon dia, buenos días. Suma y sigue... @javipobla x eso le he dicho al doctor q ya no las quería llevar, o las del Rey o nada. jeje Hoy tratamiento mañana y tarde + visita al doctor y buenas noticias, muletas fueraaa vamoooooos!!! Moc moc @pase_al_hueco muchas gracias. Un abrazo Ya en casa después de entrenar con @JuanjoBrau y mi hermano, mejorando cada día, ahora cena en casa y partido, q tengáis buenas noches. @3gerardpique molta sort amic!!! Ooohhhh moc moc Recuperando con @JuanjoBrau. Me voy a dormir un poco. Abrazo http://yfrog.com/h4h1tlgj Buenos días q tal todo? Yo sigo recuperando, cada día mejor. Un abrazo fuerte y q tengáis un buen día @PasuzuTweet ja saps el q et toca... Abraçada amic Esto de estar lesionado tiene sus cosas buenas, chofer mi hermano, cocineras mi madre y @Malenacosta7, me cuidan como a un rey. Gracias jeje Buenos días, ya en la ciudad deportiva después os paso alguna foto. Abrazo Bona nit-buenas noches.good night @julianobelletti igualmente fenómeno, abrazo fuerte amigo @_danielmartin_ gracias crack!!! Un abrazo Primera sesión de recuperación con @JuanjoBrau terminada. Mañana +. Abrazo Ya en casa, estoy bien, animado y con ganas de empezar la recuperación para estar pronto al 100x100. Gracias a tod@s x vuestro apoyo. Besos Hoy rua, celebración con los nuestros y después al concierto de @_danielmartin_ y shakira, @3gerardpique tiene una sorpresa.. Moc moc Las cosas de hacen desde el corazón, abi se merecía más q nadie levantar la copa. #ànimsmiki. Nos vamos a entrenar, hoy mañana de lectura, El monje q vendió su ferrari... Un abrazo a tod@s @3gerardpique siiii clar q anirem, no podem fallar, ja em vaig perdre l'últim q va fer a bcn... Ooohhhhh moc moc Bona nit, buenas noches. Ya en Londres. #todosconMikiRoqué Bon dia, buenos días. #todosconMikiRoque Impresionante despedida a Ivan de la Peña. Te echaremos de menos en el campo. Un abrazo hermano!!! Te quiero! Hoy se retira otro gran amigo, Arnau. Una forta abraçada crack!!! Jajajajajajaajajajja el topo no tiene buenos contactos... Oooohhh moc moc @3gerardpique les podrías anunciar tu algo no?? Ya conocéis a @3gerardpique os podéis llevar una sorpresa o decepción, no hay #puyinoticia La noticia es q seré padrino de una boda... Ooohhhh moc moc @3gerardpique Ooooooooohhhh moc moc!!!! @3gerardpique RT @ifilosofia: ¡Caer está permitido. Levantarse es obligatorio!. Te quiero Ivan de la Peña!!!! Eres un fenómeno!!! Ayer y hoy entreno de mañana y tarde + Pilates. @JuanjoBrau me va a matar... RT @3gerardpique: La cantera a tope!!! Visca la Masia!!! Visca el Barça!!! http://yfrog.com/gzyz4zgj RT @3gerardpique: Ja la tenim aquí!! La 3era consecutiva!! El Puyi ja en té 5!! Quin mite!! http://yfrog.com/hsrfwjyj RT @eloyweb: @evitagp @3gerardpique @Carles5puyol toda la vida será: \"Noches de desenfreno mañanas de ibuprofeno\"... pero bien xD RT @evitagp: @3gerardpique Noches sin freno, mañanas de iboprufeno.... Comiendo con lo soci @javipobla RT @ifilosofia: La gente podrá olvidar lo que hiciste o lo que dijiste, pero esa gente nunca olvidará el cómo los hiciste sentir.... @sroberto_18 moltes gràcies crack!!!! Una abraçada Oooooohhhhhhh moc moc!!!! CAMPIONS!!!!!!! 5***** http://yfrog.com/h4yagaazj CAMPIONS!!!!!! Moc moc ooooohhhhhh!!!!! Vamooos Rafa!!!!!! Ya en Valencia, feliz día a todos. Un abrazo. Moc moc Buenos días, bon dia!!!! RT @cesc4official: ¡Hola chicos! Solo anunciaros que mi nueva web... ¡ya está online! entrad en http://www.cescfabregas.com espero que l ... Bon dia, buenos días. Moc moc Otro día os presento a la Queca. @rafinha_alc93 muchas felicidades fenómeno. Un abrazo Y Rita http://yfrog.com/h0ajswrj Os presento a Paca. http://yfrog.com/h75leqhj Recomiendo la obra de teatro http://www.ercaminosantiago.com un viaje de risa. Un abrazo a tod@s RT @FCBarcelona_cat: A les 20h FC Barcelona-Reial Madrid, final de la Copa de campions juvenil en directe per @FCBtv @_danielmartin_ q aproveche fenómeno. Un abrazo @Malenacosta7 de res... ;-) @3gerardpique bona nit... Moc moc RT @ifilosofia: Si estamos unidos nada será imposible. Si estamos divididos todo fracasará... (Winston Churchill) Buenos días, muchas felicidades Ivan. Un abrazo fuerte Bona nit!!! Buenas noches. @JaimeMazariegos muchas felicidades, q pases un buen día. Un abrazo Hay días tontos y tontos todos los días... Moltes felicitats amic!!!! @cesc4official oooooohhhhh!!! Moc moc @cesc4official bona nit amic. Ohhhhhh moc moc Bona nit, buenas noches!!! Vamoooooooos Abidal. Me alegro hermano!! Q fenómeno. Alller nique la famille... @PasuzuTweet bon profit. Una abraçada amic @katxutxin muy bien, lo recomiendo 100x100 @javi_garmol q dius? @ferler94 lo q dius? @DanielaMarcelaH con máquinas @SBauti7 para jugar con mis amigos Después de pilates disfrutando de la tarde con @javipobla, los amigos son lo + importante. Abrazo para tod@s Ooooooohhhhhh!!!! Moc moc @3gerardpique @cesc4official q feu amics? RT @3gerardpique: La cantera sube a tope con el Twitter!! @afontas26, @sroberto_18, @rafinha_alc93, @Thi_Alcantara91, @muniesa24!! Molt  ... RT @_danielmartin_: Mi lamento para mi es la mejor cancion de Pequeño , y será single y tendrá video ! Y voy a intentar que sea precioso Buenos días. Felicito a @1victorvaldes x su partido 400. Una abraçada amic. RT @LUISENRIQUE21: Estaban haciendo pruebas. Ya ok RT @LUISENRIQUE21: Enlace de la subasta de camisetas: http://bit.ly/eSPmki @BFN x Manolo Escobar en la celebración del Mundial. Ooohhhh moc moc Moooooc moooooooc x @3gerardpique i @cesc4official. Ooooooohhhhhhh!!!! RT @kilianj: \"Poner el cuerpo al límite me hace llegar a lo más hondo\" a la contra de la Vanguardia!! merci Ima!! http://bit.ly/fgXY7w v ... RT @Salomon_Spain: ¿Te gustaría tener el libro de Kilian Jornet... firmado por él mismo? Ponte guapo, hazte una foto y participa aqui ht ... RT @ifilosofia: Quien te lastima te hace fuerte, quien te critica te hace importante, quien te envidia te hace grande @capde11 una pedrada al cap tens tú!! Felicitats x ahir. Una abraçada RT @LUISENRIQUE21: Hoy a las 20:00 contra el Alcorcon en el mini. Previamente partidazo en la ciudad deportiva FCB- Espanyol de juvenile ... RT @Malenacosta7: Mi último cuadro ! http://yfrog.com/hsfdjnlj @PasuzuTweet jejejejejejeje @cesc4official q tal nanu? El falseti del @3gerardpique no diu res... Ooohhhh!!! Moc moc Buenos días. Ooooooohhhh!!! Moc moc. Hoy he cenado con @javipobla, @kilianj y joan, un placer conocer al numero 1 en deportes de montaña, Kilian Jornet. Bona nit Después de una buena sesión un poco de hielo y un sobre de Isopower de la casa Powergym. http://yfrog.com/h8fvyij Avui tots al Palau!!! #somhipalau Sabemos mucho de poco y pronto sabremos todo de nada... Buenos días!! @3gerardpique ooooohhhhhhh!!!! Moc moc Animo Abi!!!estamos todos contigo. Eres fuerte y esto lo superaras seguro! #ànimsAbi Animo, todos con Japón!!! http://yfrog.com/h8avzfej Buenas noches, bona nit. Oooohhhhh!!!! Moc moc Cenando en el Caliu con @Malenacosta7, Francesco y Laurie. http://bit.ly/epZxPF ya falta menos... Un abrazo a tod@s @PasuzuTweet gràcies crack!!! A veure si ens veiem i fem un soparet. Abraçada Ahora + q nunca... http://yfrog.com/h7dadnoj RT @ifilosofia: La pobreza no viene por la disminución de las riquezas, sino por la multiplicación de los deseos. Platón @logika_Aguilas muchas gracias!!! Tiene toda la razón. Un abrazo. Buenas noches, bona nit. Un abrazo. Miss u!!! La paciencia es amarga, xo su fruto es dulce... Ànims miki!!! #todosconMikiRoqué. Una forta abraçada amic!!! Hoy 1er entrenamiento con el equipo. Muy contento, muchas gracias a tod@s x el apoyo. Un abrazo Me han regalado el libro de @ristomejide . Ya diré q me parece, xo estoy seguro q es muy bueno. http://yfrog.com/gyxcsfhj @Jeffren11 no me esperes... Vaya amigo. Jejejejejeje @cesc4official molta sort nanu!!! Una abraçada. Buenas noches-bona nit!!!!! Buenas noches - bona nit. RT @ifilosofia: No es más grande quién más sitio ocupa, sino quién más vacio deja cuando se va. Buenos días. Aquí tenéis el twitter de @jeffren11 un abrazo a tod@s. Me voy a entrenar. @3gerardpique bona nit amic. Oooooohhhhhhh!!!! Moc moc Hola @3gerardpique q faaaaaas? Oooohhhhh moc moc Buen entreno con @JuanjoBrau ahora me voy a comer con mi mejor amigo @javipobla y x la tarde otro entreno, estoy muy contento... Buenos días, hoy puede ser un gran día... Buenos días me voy a entrenar. Ahora estoy escuchando una canción de SHUARMA Vuélvelo a intentar. Un abrazo a tod@s RT @javipobla: Gran gest de Grimau cap a Basile.Chapeau. RT @editorialespasa: contando los días para enseñaros lo nuevo de @ristomejide !!!! os va a sorprender... muuuuuchooo.... @cesc4official hola amic!!! Ya tengo las 2 ofertas y he decidido q no puedo fallar a @3gerardpique... Ahora vamos a x @cesc4official oooohhhh moc moc @_danielmartin_ no te preocupes ahora viene lo mejor, 34 no es nada... Un abrazo Tengo q decir q tengo una oferta de #eldeloscuadros ahora espero  la de @3gerardpique oooohhhh!!! Moc moc geriiii @3gerardpique jooooooo moc moc guanyarem!!!!! De fet vull jugar amb qui sigui... Q tinc mono!!!! @javipobla faltas tu soci!!! Un abrazo Después del entreno de la mañana, estoy comiendo con @xavimolist en un restaurante japonés. X la tarde vuelvo a entrenar... @PasuzuTweet faltes tu nanu!!! Espero q aviat estiguis a topeee!!! Una abraçada Mirar q come mi amigo @javipobla antes de ir a dormir, espero q duerma solo... Ooohhhh moc moc http://yfrog.com/hs3jppcj http://twitpic.com/3xpjur - Como come mi gordito @javipobla. Bon profit!!! En recuperación con Roger, escuchando al gran @_danielmartin_ @LUISENRIQUE21 mucha suerte hermano!!!! Quién es este \"gato\" con botas? Oooohhh moc moc http://yfrog.com/h2hjcslj @_danielmartin_ igualmente, un abrazo muy fuerte!!! Hoy es el cumpleaños de @3gerardpique, moltes felicitats!!!! Oooohhhh moc moc @ristomejide muchas felicidades espero q cumplas muchos +. Un abrazo fenómeno. Buenos días a todos!!! Buenas noches, bona nit!!! Después del tratamiento de mañana y tarde con @JuanjoBrau me voy con buenas sensaciones, mañana + @3gerardpique amic q fas? Ooooohhhh!!! Moc moc Tratando con @Juanjobrau parecemos novios todo el día juntos... http://twitpic.com/3vhhcm - Escuchando a Shuarma en acústico. Me encanta, q fenómeno!!! Me voy a entrenar. Hola a todos, desde ayer he aumentado las cargas de trabajo y x ahora todo va bien. Un abrazo RT @Malenacosta7: Anuncio de Palmolive , rodado este verano en Praga.\nhttp://www.youtube.com/watch?v=IJYAbOSNJ0s RT @Carlos_Latre: Ya está aquí @lamonicaperez !! No os la perdáis en el teatro Borràs de BCNA con \"pel davant i pel darrera\"...en breve  ... Saliendo del tratamiento de la tarde, Juanjo es un crack!!! Gracias a todos x vuestro apoyo. @Malenacosta7 :))) Hola a todos, acabo de actualizar el blog de mi web en http://carles5puyol.com Muchas gracias a tod@s!!!! Pronto estaré a tope!!!! Un abrazo. RT @javipobla: Carla swart( joven promesa ciclista sudafricana) muere atropellada por un camión, queremos más respeto en la carretera. Buenas noches, bona nit. Hoy he comido con mi gran amigo Albertini, Uriana y @Malenacosta7, ahora voy a dormir un poco. http://twitpic.com/3p42li - Con @3gerardpique y @ochocinco. It was great to meet him! Buenos días a todos,hoy entrenamos x la tarde, ahora me voy a Pilates. @PasuzuTweet la blackberry vermella nanu... Buenas noches a todos, me voy a dormir q estoy igual de cansado q después de un partido. Bona nit!! @3gerardpique tu si q eres el más grande, xo de estatura... Jejeje mooooc mooooc Andrés y Xavi también lo merecen, son muy grandes!!! Ya en barcelona, gran día!!!! Felicidades Leo!!!! @cesc4official y yo ya hemos avisado de como es, juega con la gente, y sobretodo dice muchas mentiras. Si quiere la verdad, no son zapatillas, es un montaje, en la foto se puede ver q solo tiene una pierna. Es un falseti... Oooohhhh!!!!moc moc Ya habéis visto q @3gerardpique es un poco falso no suelta nada de las zapatillas. Serán suyas? @cesc4official bona nit amic, una abraçada @3gerardpique ya sabéis q después no dice nada... Tiene mucho miedo. Mías no son!!! Oooohhhhh moc moc RT @3gerardpique: Abidaltasar!!!!!! http://yfrog.com/gzlucgj Bcn, viaje tranquilo!!! Ahora a descansar, mañana +. Bona nit, buenas noches http://twitpic.com/3ndbpa @3gerardpique lo q dius? @3gerardpique lo dices ahora q lo sabe todo el mundo... Eres un... Ooooohhhh!!!!! http://twitpic.com/3mp3q8 - Hoy a las 20h en Barçatv hablando del libro Me parece increíble q @3gerardpique os quiera dejar así, q no tenga miedo y diga el nombre... Mascherano tampoco RT @3gerardpique: Ya solo quedan 3!!! Sé que os estoy haciendo esperar mucho, pero el jugador no quiere que se sepa.. de momento!! Keita tampoco... 3!!! Ooooohhh!!!! Bojan seguro q no... Ya quedan 4 Buenos días, la sorpresa de @3gerardpique es: sus zapatillas!!!! No lo quiere reconocer xo son suyas @3gerardpique oooooohhhhh!!!!! Moc mooooooc, @3gerardpique de un campeón del mundo? Buenos días, preparado para el 1er entrenamiento del año. @PasuzuTweet igualment, una abraçada molt forta ens veiem aviat!!!! Feliz 2011 para todos!!!! FeliÇ any 2011 http://yfrog.com/h2vtjhuj"}