{"tweets": "#HelloFrom Nienhagen’s Ghost Forest — straight out of a German fairy tale. 📕🐺⁣ https://t.co/UesENYxnMg https://t.co/dUJzy3bAva The mesmerizing movements of Sarah Ritchie’s snake photography isn’t just for show — these 🐍 are her pets and companions. 🖤 https://t.co/pbSbVOXuxM https://t.co/AqaoOHCFCU GREETINGS from the Dark Lord #WeeklyFluff https://t.co/sSR9KEG7cy https://t.co/i48QXV5SUB RT @TeenVogue: \"My vision for the future is everyone being themselves and loving themselves on the inside and out. I just love my complexio… In honor of National Bullying Prevention Month, see how Kheris advocates for victims of racism and colorism and takes a stand against bullying, on IGTV now! ✨ “My vision for the future is everyone being themselves and loving themselves on the inside and out. I just love my complexion. I love who I am, and everyone should!” —@KherisPoppin, creator of Flexin’ In My Complexion https://t.co/tJx7fWWAc8 https://t.co/gilX0eUrDE Getting spooky. 🦇 https://t.co/XFzsC3y14o https://t.co/prM0wc2UWH Check out our new global sticker designed to help you stand up to bullying, support a friend and spread positivity on Instagram. \n\nAdd it to your story today. 💖 https://t.co/tNDBBQtkBy #streetwear comes in all colors and styles on today’s episode of #DoYouFollow with Alyssa. https://t.co/Inl7fZnGhV https://t.co/lV9HamsL1U Now you can easily watch IGTV series from creators you love and get notified when there are new episodes. \n👋@YaraShahidi @KadeSpice @IngridNilsen https://t.co/0QmpHwpxYw 🍄 Fungi fairy tale 🍄 #ThisWeekOnInstagram https://t.co/4Fenkq0nBv https://t.co/hk2FwTvroC Learn more about this and Facebook’s other election integrity efforts: https://t.co/4WWv8MalJk Over the next month, content that has been rated “false” or “partly false” by an independent fact-checker will be more prominently labeled so you can better understand if information you’re seeing is reliable. https://t.co/TPgOjL6HIK Today, we’re announcing new features to reduce misinformation on Instagram. Mind meld mandalas #ThisWeekOnInstagram https://t.co/toAPK6KDJB https://t.co/wN8VUOvWsy #HelloFrom Lofoten Islands, Norway 🐟 https://t.co/UXb1bbD00R https://t.co/NT0Ss6C7bC “Please always be yourself.” —23-year-old creator @ItsAroojA  ⚡️\n\nLearn more about Arooj on https://t.co/DC5huOv791 = THE place to learn more about what it takes to be a creator from the team at Instagram + the creators who inspire us every day. https://t.co/yiih7Xij4B https://t.co/vazqKwnA9m Defying gravity for this week’s #WeeklyFluff https://t.co/AbcJtetUEU https://t.co/kXcMEQioYN RT @TeenVogue: \"Thanks to the courage I found in dance — and, of course, in Miss Jay Alexander — I’m now proud to be out, and I’m proud to… In honor of National Bullying Prevention Month, see how Harper Watters advocates for both the LGBTQ community and young male dancers and takes a stand against bullying. https://t.co/33e0jv1Nh7 “The bully has been and probably will continue to be my biggest hurdle, but I’m a dancer, honey, so I’m gonna jump over.” —Harper Watters, professional dancer for the Houston Ballet https://t.co/NvfuUvY5Qt https://t.co/kHT0ZRY4h9 “Experimenting with fantasy is what I really love.” https://t.co/EDq4SGGEp3 https://t.co/9Iksaekf33 Prepare to have your mind bended by @zachlieberman on today’s episode of #DoYouFollow. https://t.co/TqoI4g2ltw https://t.co/ELTY1PfB07 Starting today, we’re making it easier to manage all of the third-party services connected to your Instagram account, so you have more control over the data you share with other apps and services. \n\nLearn more: https://t.co/AkHefZHOam https://t.co/5ohjyBU0Na Meticulous mother. Sartorial son. Meet Peepy and Mother Lee — the elaborate matching style duo. https://t.co/wU09PlbZmR https://t.co/eM5IMFxkA0 “Music has definitely taught me to embrace my feelings and personality because that’s what makes me unique.” —Australian rap artist @TKAYMAIDZA  https://t.co/5WPk6ct98D https://t.co/AfcMt2JE0K Cosplay time for #ThisWeekonInstagram https://t.co/dN6hSLoNlF https://t.co/4IB458p61J #HelloFrom the Golden Bridge in Da Nang, Vietnam  🙌 https://t.co/AgHxuJ16Oa https://t.co/t6d1fJZamD “My mission is to celebrate the richness and diversity of cultures within the African diaspora.” —artist Adeyemi Adegbesan (who created the @afropunk face filter in Instagram) 🖤 #ShareBlackStories https://t.co/wjSGmOeBKs https://t.co/bkMNd9OBhB RT @chancetherapper: I just dropped my newest video but I cant put it on this app yet. But if u have @instagram meet me over there for THE… We’re on the set of “We Go High” with @chancetherapper. Go behind the scenes here on IGTV: https://t.co/aNYfCV5Syw https://t.co/EGXlPiurFL Peekaboo! #WeeklyFluff https://t.co/fmz8qMAVpb https://t.co/LfZMmFbNfc RT @TeenVogue: \"Fashion has only ever catered for a very specific lens. My job is to work with them to widen it.\" –@TheSineadBurke #Nationa… In honor of National Bullying Prevention Month, see how Sinéad Burke takes a stand against bullying and advocates for people with disabilities on IGTV. “I think often we underestimate how much we matter. The world would not be the same without us. There would be a void, be it big or small. And I think often, we don't think we have an impact. But each of us really, truly does.” —@TheSineadBurke #Advocates  https://t.co/6vsjJmJnQa https://t.co/fDeoSOxa9n The art of illusion https://t.co/LXiVN3q0cw https://t.co/PYxoEG3KlE Say hello to your new camera, including the new Create mode (packed with fun new tools like the GIFs format). https://t.co/0lX68CIaWT #DoYouFollow makeup artist and creative force Sweet Mutuals? See her latest design in bloom right now 💐💄https://t.co/Tt8sjzkoAu https://t.co/SiamFR424N Lines = drawn in the sand 🐙🤯https://t.co/rLI5hh28Kf https://t.co/uRrGxpvKFc RT @mosseri: Starting today, you can use Instagram in dark mode on iOS 13 or Android 10. Turn dark mode on your phone to try it out. 👀 Heads up: Today, we’re launching a new feature to help people identify phishing emails claiming to be from Instagram. This account security feature (accessed through Settings) allows anyone to check if an email claiming to be from Instagram is genuine. https://t.co/3UE5kSypM6 That’s wild. https://t.co/rc3e9RCk0a https://t.co/q9imzm9fMo #HelloFrom the Westfjords in Iceland: a room with a view 🏔 https://t.co/PdukBasYLq https://t.co/0DlG5XrqNA 16-year-old Heber Clawson is in NYC for the first time sharing his Instagram baking skills with NYC. Follow all the tasty action of the #NYTFoodFestival on Instagram this weekend! https://t.co/WYUvzbO6Vm https://t.co/6TeUvFLYiC Meet Harlso, the dachshund who has a head for... you’ve guessed it ... balancing. 🙄#WeeklyFluff 🐾  https://t.co/ohvW7gFDYA https://t.co/nEXvJN29N7 Today, Facebook is launching Threads from Instagram, a new camera-first messaging app that helps you stay connected to your close friends. Learn more here: https://t.co/oMgMiKMT6Y https://t.co/GbQzctLu1t RT @TeenVogue: \"I told myself my voice wasn’t good enough to share with the public, and that even if it was, I was too different-looking fo… “Out of 109 people aboard the plane, only two survived, and I was one of those two people. That has to count for something.” See how @Kechi has found her purpose in a new episode of #Advocates on IGTV. 🎤✨ https://t.co/hadcRc1Kvk https://t.co/GvxRgQidV9 Check out our story today, as we follow model Adut Akech as she gets ready for the @MaisonValentino show at #ParisFashionWeek! 💖 👠 https://t.co/QS8FCxoGGR https://t.co/EMQsedUNyV Starting today you can protect your account from unwanted interactions with a new feature called Restrict. This is just one of the ways we’re empowering our community to stand up to bullying.  https://t.co/65WJuAOdON https://t.co/WOaNnsJC1y “#YoSoy unapologetic.” —Johanna Toruño \n\nThis week, we’re sharing portraits in celebration of #HispanicHeritageMonth. https://t.co/icZYxLENdy https://t.co/D8EgVapng6 RT @TODAYshow: Today, Instagram is launching a new anti-bullying feature called restrict.\n\nThe feature allows you to approve or decline nas… Thriving beyond stage 4 breast cancer with @NalieAgustin 💖 🎗#BreastCancerAwareness https://t.co/IWLud98IaD https://t.co/Qf67QchaHy RT @mosseri: It's been exactly one year since I was given the opportunity to lead Instagram. I feel lucky and grateful. Here are some thoug… In our new series #DoYouFollow, we’re diving deep into some of Instagram’s most popular interests and the people who make them awesome. ❤️ #DoYouFollow that #equestrian life? 🏇⚡️ Maybe you should... 🙃 https://t.co/T4mMmVvc9x https://t.co/xZC5vekZ70 “#YoSoy humano.” —@WTHDZ \n\nThis week, we’re sharing portraits in celebration of #HispanicHeritageMonth. https://t.co/BHyDGC6h0l https://t.co/5nDCujXUyV #YoSoy infinita.” — @dulcecandy\n\nThis week, we’re sharing portraits in celebration of #HispanicHeritageMonth. https://t.co/XPnt27YID7 https://t.co/M5VqCwfN3H BIG NEWS. Launching today: https://t.co/DC5huOv791 ⚡️ = THE place to learn more about what it takes to be a creator from the team at Instagram + the creators who inspire us every day. https://t.co/f1ZpDJnOzl We’re making it even easier to shop new product launches from some of your favorite brands and creators. 🛍 A new notification sticker in Stories and product launch tag in feed help you set reminders, preview details and buy on checkout. Details here: https://t.co/6c7yL5Y51Q https://t.co/6aJLojDWZm #HelloFrom Froggies Beach 🐸 🌊 https://t.co/QvzygJRu2h https://t.co/jq4ep4z4cE It’s a furry spa day for #WeeklyFluff https://t.co/5p4pwAxRM3 https://t.co/SoMWydsoYM Salut! 💖 We’re in Paris with Laetitia + Géraldine, the founders of D'ESTRËE. Shop the goods (and check out their studio) over on https://t.co/ggYYpFerWW 🌈✨ https://t.co/fhdyKlCoD4 https://t.co/tzIV7FIoDP RT @Inc: These Female Founders Have Discovered an Effective Place to Ramp Up Their Mentoring Game: Instagram @lagorio https://t.co/t1UkZp1V… Are you for real? https://t.co/wkaLOtz1It https://t.co/QkR1IkFtX7 #DoYouFollow Supermoon Bakehouse? 🥐🍰🌈⚡️ https://t.co/YqWGw050Kj https://t.co/bu2gtXOvxq Enter the Wild West of digital fashion. https://t.co/vfk8HsdE28 https://t.co/ZBJTAsNBSs RT @instagram: “If we all do something, we can accomplish anything.” —climate change activist, @GretaThunberg #Advocates https://t.co/VyUYO… RT @mosseri: It was really great to get to speak with @nprAudie last week about our efforts to address bullying. Check it out if you have a… Digital makeup that looks like the future. https://t.co/pFLlLt2omk https://t.co/hFTjSETUeN #HelloFrom Wat Samphran in Nakhon Pathom, Thailand. 🦎 https://t.co/0M2L3rdXYZ https://t.co/BT2qaMzzsZ Living that astro life with Shera 🌟: https://t.co/9HMV0oElSa https://t.co/jGsdweSZ8W JUMP AROUND #WeeklyFluf https://t.co/5XWg0ar9Cs https://t.co/i75gzaDnyh 👀 Trending now on Instagram: The one and only @JLo closes the @Versace fashion show in Milan wearing an updated version of that iconic dress. (You know the one). 🌿✨\n\nVideo by @voguemagazine\nhttps://t.co/FlRCpu4zHV https://t.co/GpF3P5lICl “Makeup is a form of art, and there ain’t no rules!” —15-year-old creator Ossi 🍋 🔥 https://t.co/B9IcalQUPH https://t.co/qpdBFRB63S RT @Variety: .@Instagram debuts @JonahHill’s ‘Un-filtered’ bullying docu-series (EXCLUSIVE) https://t.co/tSWzjikVWR RT @mosseri: Starting today, we're rolling out a new policy that restricts and removes posts about certain weight loss products and cosmeti… Weird and wonderful edible jelly sculptures? Yes, please. 🤯 https://t.co/mSrFtrzXgm https://t.co/W6E4HOs3BE In our brand-new series #DoYouFollow, we’re diving deep into some of Instagram’s most popular interests and the people who make them awesome. ❤️ #DoYouFollow football freestyling brothers Kawan and Bawan Hussaini? (Spoiler alert: you should.) ⚽️⚡️https://t.co/NfWqEc8qvR https://t.co/7rdmyDJ6ze See. Hear. Smell. Taste. Touch. #Mukbang https://t.co/LNGysWJRB8 https://t.co/pSpgTgOoQu Embroidered stitches that look good enough to eat. https://t.co/eHM9DzHwXe https://t.co/iCFk5e9fnY #HelloFrom Balochistan, Pakistan. https://t.co/5P0XYMrdDo https://t.co/6s7LInrFtz Trend alert! #BackToSchool is upon us, which means 🍎🍎🍎🍎🍎🍎🍏🍏🍏. https://t.co/V9JsHuJiT7 Mr. Bigglesworth reminds us not to give up 🐰💓 #WeeklyFluff https://t.co/UCdc6aqZmj https://t.co/4r7XBjFcpp Tunnel vision. 🌊 👀 https://t.co/lXoD6HIILS https://t.co/7yXEsT8Lvv In our brand new series #DoYouFollow, we’re diving deep into some of Instagram’s most popular interests and the people who make them awesome. 👍 Get your groove on with today’s episode of #DoYouFollow, featuring street dancer @salif_crookboyz. 🕺⚡️ https://t.co/6cVwcw1KY1 https://t.co/0E2ctViTTk Red riding ❤️ https://t.co/edRH83UTKN https://t.co/w89gdbOUeo No snow. No waves. No problem. https://t.co/pqT9uHm0HK https://t.co/zoTbXToVb0 #HelloFrom Saariselkä, Finland https://t.co/nSTcMvgRnG https://t.co/4N3QzHAeGv Follow along on our story today as we go backstage at the @tomotakakoizumi #NYFW show! 🔥\nhttps://t.co/KIdOfxSoRD https://t.co/nz0PCkHtRV RT @mosseri: Doing a Friday Q&amp;A up on my Stories right now. Feel free to come on over and ask a question - https://t.co/qBHvR1UNjo It’s a spin class for #WeeklyFluff https://t.co/uEFzHnCNHW https://t.co/clvL2rmmO0 This media artist’s face filters could shift your perspective — on yourself. 🤯 \n\nFollow https://t.co/6h6C85UG2z to learn more about Aaron’s work and see more stories about design around the world. https://t.co/GzAAMFsDFs https://t.co/vwodKSrjg6 Grab your 🏈 helmet — it’s a very NFL #GameOn with @ChicagoBears running back @TarikCohen that celebrates the 100th season of the @NFL. 💯💯💯 https://t.co/k1BxexeN1M https://t.co/2XIz6KrjDU When Rorschach tests meet preschool squish paintings. 🎨 https://t.co/lFqDgg6O0k https://t.co/GhQyhjbe3S Portals to another dimension 🌀🌀 https://t.co/T4IHwmvicg https://t.co/ludF6gFkw0 The one, the only @PostMalone is on our IGTV right now. Go behind the scenes of his #Circles music video here: https://t.co/ynQvibGduj https://t.co/SDl9IbY2xm Which of these is the real deal? 🍳🍳 https://t.co/fePLtAFkVD https://t.co/I4MacAMcYP #HelloFrom the Columbia River Highway 🚌🌲 https://t.co/Xf1KEoUm0U https://t.co/jCpz5Ku1qP On today’s episode of #HiddenGems, we drop in on abstract artist @Callen_Schaub’s studio as he spins up a few colorful paintings. Prepare to be covered in paint 🤯🎨. https://t.co/JtzhGN0wXX https://t.co/Pfdo7fjnKN New booties make their debut 🐾 #WeeklyFluff https://t.co/36Upo9LQfK https://t.co/nB678wtABd Cult Gaia’s founder Jasmin Larian Hekmat is ALL about texture and the natural world. 💙 \n\nShop the goods over on https://t.co/ggYYpFerWW 🌈✨ https://t.co/cQi21gF5Rz https://t.co/Xli8taOb5y RT @latimes: As of Thursday morning, the shop had accrued nearly 28,000 Instagram followers. And its happy and overwhelmed owner has been f… RT @BuzzFeedNews: 🚨 wholesome content alert 🚨\n\nTeens are using Instagram to cast each other in fake Broadway shows\nhttps://t.co/fgwmVIwMBy Limited speech hasn’t stopped this model from achieving her dreams... in fact nothing has. ✨ \n\nWatch here to learn about @Madeline_Stuart in this week’s episode of #Advocates. 💕 https://t.co/AwzKGWN9c4 https://t.co/V8D06NXhVu If @justjamiie can do this 👇, you can do anything. 😎 In this week's episode of #YouGotThis, Jamie shares his guide to greatness, up now on our story. https://t.co/lCA9SM0qeU https://t.co/CnSVcjgVQj Flower Power 🌸🌿🌼🌱🌺  https://t.co/okk7kJPpA9 https://t.co/UdN3NvCoNT Join us and add the Create Don’t Hate sticker in Stories to show that bullying has no place on Instagram. https://t.co/BaSS2BHLI5 https://t.co/h46PZM2RiV Rainbow connection ☁️🌈☁️ https://t.co/0WpbmMCybf https://t.co/k7mBAqx55u The butterfly effect. 🦋 https://t.co/0vTGjHufWt https://t.co/5PW5W12okA It’s a special @afropunk edition of #GameOn 🖤 Right now. On our story. LET’S GO. @TierraWhack @aliciakeys https://t.co/MFAtL1vs5x https://t.co/RPtUe9tAdc #HelloFrom Walakiri Beach. Home to white sand, turquoise water and dancing mangroves.\n\nhttps://t.co/ZiNuQYPaAb Soar to new heights with modern-day falconer Adam Baz 🦅(@hawkonhand) and Fox the hawk on this week’s episode of #HiddenGems. 💎✨ Watch on IGTV right now https://t.co/LiW5vv1mq8 Watch today’s episode of #ThreeMinuteAutobiography, where some of your favorite ⭐️ share their life story in just three minutes. Today’s special guest = artist Chika — who’s playing @afropunk this weekend! https://t.co/lWR0Vh1Hjj https://t.co/UPEueBfY2D Bamboozled by a 🦋 for #WeeklyFluff https://t.co/08FGueF5Ct https://t.co/qvIdzMq2bg “You can save the ocean because you love the ocean, but you can also save the ocean because you love humans.” –Actor and activist @shailenewoodley 🌊✨\n\nLearn about her week studying microplastics in the Sargasso Sea on this week’s episode of #Advocates. https://t.co/LCAnRzaxeb https://t.co/nVQEifbmlo “We want young LGBTQ+ people to know that they are worthy of life and love.” —Dominic and Nick Spence #UntoldPride 🌈https://t.co/EPEojhCPJs https://t.co/RHFUJhfhdk Today on our weekly series #YouGotThis, get motivated to move past negative vibes, just like Martha, the adorable miniature horse. 🐴✨https://t.co/Znewg7IK6m https://t.co/6LDQnNpI9E Ornate illustrations, brought to you by Maahy Muhsin’s obsession with nature’s micro-patterns. 🦎 https://t.co/lPwSEkRg4n https://t.co/0zMw1mYNDS “The world is often chaotic and unexplainable, and it is nice to have a little ally that keeps you safe on your way.” – Doll artist Daria Lapto https://t.co/5nMeVLU3Qy https://t.co/fKI79ulnFB This 🐙 is ✂️ from a single sheet of paper. 🤯 https://t.co/J425TYEBeU https://t.co/0A7JJBK8KB #HelloFrom Merewether Baths, an amazing spot for some saltwater therapy 🌊\nhttps://t.co/pd1OwhVUFx https://t.co/XpYymcbpRm Main Tweet: @nyagoringo’s miniature masterpieces are the {star emoji}s of this week’s #HiddenGems ✨ 💎\nhttps://t.co/dQ2nUVakhg https://t.co/XnvzgrQP2C A soft spot for ☀️rays 🐽💖#WeeklyFluff https://t.co/EKm4GWnxPx https://t.co/HFJEIkrZNB Meet @iammarleydias, the creator of #1000blackgirlbooks in this week’s episode of #Advocates on IGTV ✨📚 https://t.co/EtVSH1PsG5 https://t.co/SGaQADxHyw RT @mosseri: Misinformation is an issue I've personally spent a lot of time on. I'm proud that, starting today, people can let us know if t… Today on our weekly series #YouGotThis, outdoor enthusiasts Henry and Baloo 🐶😸 prove it’s worth it to go outside your comfort zone.\n\nCheck out their adventures, right now on our story. https://t.co/Dy7bQHkMtm https://t.co/bwo0c54H7g DIY sustainability = the 🔑 to Andrew Blanco’s creations ☀️🙌 https://t.co/ZFZuO1JiiM https://t.co/NgGMKMxof9 Discover more augmented reality effects – or make your own! 🤩😍🤯\nSpark AR now lets anyone create custom effects and the new Effect Gallery helps you find the perfect one. https://t.co/cawaRxEeiw https://t.co/TlpM3ObYsi “The combination of a girl and a messy room is kind of like the gap between the outside appearance and the inside substance.” —Japanese illustrator @daisukerichard https://t.co/gl1yT63DYm https://t.co/RTGR0BULgy “Dancing at home is my safe haven.” —16-year-old Tre De Rego https://t.co/6nTPwXU02k https://t.co/zErkU5WsVJ #HelloFrom Al-ʿUla, Saudi Arabia. 🐘🌪 https://t.co/fj471Dzbxu https://t.co/pY3PJPV8Cm It’s time to play #GameOn with @DavidDobrik before the @foxtv #TeenChoice Awards tonight. 🎉🔥 https://t.co/B7r7J9qbsE https://t.co/0FzM0FXuFQ The blue skies of the 🏜 are the perfect backdrop for aerialist Aleta French’s colorful silks and breathtaking athletic feats. #HiddenGems https://t.co/UapN7p9Pez https://t.co/OegaiDFhRt These labradoodle pups are always getting into something. (Cue the guilt slide.) 🤣 #WeeklyFluff https://t.co/C0pGne7Occ https://t.co/CmbtfpdB3f “Sharing your stories helps other people feel seen and heard.” —@robinthede, creator of @BlackLadySketch #ShareBlackStories https://t.co/f5yZdbweED https://t.co/o4g7fH46Hy “When we are told that what society deems as our weakness is the thing that’s going to hold us back, it’s actually the thing you can use to amplify your own strengths and your own voice and your own purpose.” —@NTagouri https://t.co/zI3Z0n4PMB https://t.co/F8raz22dlA Check out this episode of our weekly series #YouGotThis, created by our friends from Toonstar who turn real-life stories into animated videos. https://t.co/5xfPxJAYNC Camp I Can’t Even, here we come. 😬 Today on our story, Becca visits a camp dedicated to stress relief. https://t.co/5xfPxJAYNC https://t.co/glWA9qmhnR Candy dreamscapes = (often) starring \"sparkly and soft\" sugar https://t.co/Djyz03Fqgs https://t.co/6BwvyN0sPW Welcome to Tinseltown. ✨ https://t.co/TUKXa52rlL https://t.co/xlD9yqzk2e “These ‘slime drips’ are my mood ring and the mixing of them afterward is my stress relief.” ☮️ https://t.co/NAGfuuR8Sz https://t.co/JdBhpwh6iX #HelloFrom the icy summit of Eyjafjallajökull, Iceland. ✨  https://t.co/Hb5qi92uc9 https://t.co/h0Vrmv2I2O Self-taught artist @Damselfrau’s handmade masks 👹 are anything but ordinary. #HiddenGems https://t.co/gkn9CUEJbE https://t.co/v8WEUH9dqu We all knead a helping 🐾 #WeeklyFluff https://t.co/OGIlCO2DZc https://t.co/YfsjX9ZHLV Today on our story: it’s #GameOn with professional e-gamer @F2Tekkz 🌀 \nhttps://t.co/BMhxClW9Z7 https://t.co/g6w0e1gD9R Learn more about Shirley on this week's episode of #Advocates. “Dress up doesn’t have to stop because you become an adult. It’s a great way to escape the streets.” – Shirley Raines, founder of Beauty 2 The Streetz https://t.co/dSfY5Y1egz https://t.co/Fl8wD9HL7a Today on #YouGotThis, Ludwik the Guinea Pig shares his game plan for living his best life. Check it out, right now on our story. 🏆✨ https://t.co/LnMPAyiXDY https://t.co/v92DMDCyC1 “Yes, we’re twins 😂”— @MontoyaTwinzMob https://t.co/0lUxJe3DYe https://t.co/k3ZfzhOhi7 🕶️ It’s Double Vision (Double Vision) 🕶️ @cocoandbreezy https://t.co/ZPDLv3xTnn https://t.co/yKSKiEM4TX These identical twin sisters bring double the style power. 💕 https://t.co/AJ9as4zQNL https://t.co/aKCVgYLQ9W #HelloFrom Cenote Calavera in Tulum, Mexico ❤️ https://t.co/H4TsdQTIbL https://t.co/OODIN9uKM5 One person’s trash is @PetitPlat’s treasure. Learn more on today’s episode of #HiddenGems 💎✨ https://t.co/9Ap6Gx5y3Y https://t.co/Rdo9wCLs8R Double trouble. 😈😈 #WeeklyFluff https://t.co/cKtv3wpB3w https://t.co/HziWxqqz6T RT @WSJSports: There’s a new generation of young athletes with giant social media followings meant to flag them as future stars to watch. h… Drawing joyful moments and spreading good vibes with illustrator and animator @4ur3liad #ShareBlackStories https://t.co/DEBUHo2wnV https://t.co/Y0Mg3pibVl Meet climate justice advocate @JackHarries — a documentary filmmaker dedicated to showing the effects of climate change in the world’s most vulnerable places. 🎥🌍 https://t.co/H0C76jBKpP https://t.co/e2yfujFjni It’s OK to:  \n◻️ Take a break  \n◻️ Ask for help  \n◻️ Find your comfort zone  \n☑️ All of the above  \n  \nToday on #YouGotThis, @gemmacorrell’s illustrations show that it’s OK to be a work in progress. Share with a friend who needs a reminder, on our story. https://t.co/fVqNSECPNL https://t.co/0vp1pkQany RT @olympicchannel: It's #1YearToGo to @Tokyo2020 and you can celebrate it by using our exclusive Instagram filter. 😎\n\nUse the hashtag and… Float with the flock 💕 (P.S. Can’t wait for the flamingo emoji to be released.) https://t.co/5RFMldV1iY https://t.co/T6rYgY46DS We all could use a little llama infusion every now and again 🎉 https://t.co/iKHu4P4RPq https://t.co/HZaICjWjV0 These complex balloon animals = 🤯 https://t.co/K6wHc4fTC1 https://t.co/PVciRiGf9r #HelloFrom the Van Lake Express 🚞 in Tatvan, Turkey https://t.co/4usoBNuGdU https://t.co/szmN38fuBF .@isshehungry’s “distorted drag” aesthetic 💄 😮 comes alive on today’s episode of #HiddenGems 💎 ✨ https://t.co/6v9MihEU0y https://t.co/kKf584UcCg On today’s story: Take a tour of the Kurt Lyle studio with founder and designer Virginia Craddock and see her favorite summer looks. Then shop the goods over on https://t.co/ggYYpFerWW 🌈✨ https://t.co/1UNuNLpZNO https://t.co/ogg5QIBLdI Meet Homer, lover of  🥕🥕🥕#WeeklyFluff https://t.co/3WLF5oL9Nm https://t.co/9L219Jh34h Mix and match. https://t.co/d3B8ugRmcm https://t.co/VwhPYBArID Learn more about Samm and her work in #Advocates, our weekly series that highlights people around the world who are sparking positive change. ✨ https://t.co/UrtfedYcSp Meet animal activist and photographer Sammantha Fisher — a woman on a mission to support sanctuaries that need it the most. 🐎🐖🐄🐓🐑 https://t.co/pN1k4B3m3q https://t.co/8pux5o9HAC Today we’re updating our account disable policy and introducing a new notification system for accounts at risk of being disabled. Learn more: https://t.co/eiRu9hG6kn https://t.co/zf8TLQfWgK We’re looking forward to learning more about how this change might benefit everyone’s experience on Instagram. We want your friends to focus on the photos and videos you share, not how many likes they get. You can still see your own likes by tapping on the list of people who've liked it, but your friends will not be able to see how many likes your post has received. We’re currently running a test that hides the total number of likes and video views for some people in the following countries:\n\n✅ Australia\n✅ Brazil\n✅ Canada\n✅ Ireland\n✅ Italy\n✅ Japan\n✅ New Zealand https://t.co/2OdzpIUBka Triple threat @NiaSioux is here to slay. Check out our weekly series #YouGotThis to see Nia’s tips for boosting your self-confidence, right now on our story. 💖 https://t.co/FvvuTV8n8F https://t.co/Wm1ISVaXjX “A single emoji can express so many feelings.” 😏 #WorldEmojiDay https://t.co/s78Sl4nL73 https://t.co/GfMsoArdLL Cosmic manifestations, surreal landscapes and celestial bodies 🤯  https://t.co/KotlRE85LC https://t.co/LEry7L2Ydi Cue the star shine and ✨ https://t.co/QtAac5emAG https://t.co/177eeLOLgK “If I can make one person smile, or turn one person’s bad day around, then I’ve done my job.” Get ready to LOL with comedian @ItsAdamW on a special @VidCon edition of #GameOn, on our story now. https://t.co/pg0hc1P3k3 #HelloFrom Kyoto, Japan. ☔\nhttps://t.co/kufTLEilh4 https://t.co/u69zPv5DmT With coral as their primary medium, @CoralMorph’s Colin Foord and Jared McKay blend science, videography and music to create educational and awe-inspiring art 🤯 https://t.co/5HokCrex09 https://t.co/3wEgAJQc5o Three crazy amigos. #WeeklyFluff https://t.co/a2QpsCIhZg https://t.co/qShOO8KdlH @InsideSportIND @SGanguly99 Happy birthday 🎂 and welcome to Instagram. 🎉 Learn more about DEAFinitely Dope in #Advocates, our new weekly series that highlights people around the world who are sparking positive change. ✨ On our story and IGTV right now: https://t.co/MhBUNZ1sky https://t.co/37sGOVrDLJ “We should be trying to make life as enjoyable and equal for everyone involved. Nobody gets left out. Nobody.” —Matt Maxey, deaf rap and hip-hop interpreter behind DEAFinitely Dope https://t.co/bmBioDwt0m https://t.co/uMsAV7MX8I “#DuBistStark (You Are Strong) means to empower others and see that sharing your weakness can be the strongest thing you can do.” —Model Charlotte Kuhrt @brigitteonline💓 https://t.co/tyDgKiw8UX https://t.co/lGP0hvOPPk Today on #YouGotThis: Illustrator Stacie Swift offers some daily mottos to get through the ups and downs. Create your own motto with an illustrated template, right now on our story. https://t.co/wuOocntqK1 https://t.co/qX33WVL6bT Cars = Chris’ “ultimate object of desire” 🏎 https://t.co/B7VwUqk0iP https://t.co/1xXTkCmSZt Imagination, meet reality. 🐢 https://t.co/VbVZITzlM4 https://t.co/rNJbP9CXPV RT @katysteinmetz: My latest feature for @TIME, a deep dive on the work @Instagram is doing to combat a complex ill plaguing young users on… Updates from the head of Instagram @mosseri about our commitment to lead the fight against online bullying ❤️ https://t.co/Co2rgsuJvt https://t.co/tlngJftizT “Clouds are the dreamiest stuff, and a notion that there’s really more out there than we can imagine.” ☁️ 💗 https://t.co/dONjlriACS https://t.co/xtb8TkFIOA What’s the most out-of-this-world place you’ve ever said #HelloFrom? 👽 https://t.co/cR8JmB1EaD https://t.co/p19mWCHMl8 @MacGyverLizard and his human BFF Ice show us the true meaning of friendship today on #HiddenGems 🦎💎 https://t.co/hIGeZ7Hvc4 https://t.co/JpbwbWom0C Step into BODE founder and designer Emily Adams Bode’s studio on today’s story, then shop the goods over on https://t.co/ggYYpFerWW 🌈✨https://t.co/J3hFg6Bs1l https://t.co/jnCIfvgPY2 Morris the cat and Champy the horse = inseparable #WeeklyFluff https://t.co/u8rI3rmFyq https://t.co/7jhkocEart Learn more about @BlackGirlFest in #Advocates, our new weekly series that highlights people around the world who are sparking positive change. ✨On our story and IGTV right now: https://t.co/Mo0InEGDsE “We want black women to see themselves reflected in various industries, but also to know how to build their own kind of space to make their communities see them too.” —Nicole Crentsil, co-founder of @BlackGirlFest #Advocates https://t.co/XEHw4iilgH https://t.co/JanFKddGfx “I draw inspiration from people who use their surroundings and community to create art without tight restrictions, such as rappers and dancers.” —Freestyle footballer Kazane Shimazaki https://t.co/u04ur2LCHO https://t.co/IaYowCLbau Good vibes 😎 “surfing a concrete wave” 🏄‍♂️ https://t.co/FkP3Rm6AgS https://t.co/fmw7cvhLIY We’re back! The issue has been resolved and we should be back at 100% for everyone. We're sorry for any inconvenience. https://t.co/yKKtHfCYMA We’re aware that some people are having trouble uploading or sending images and videos on Instagram. We're sorry for the trouble and are working to get things back to normal as quickly as possible. #instagramdown “The love for movement, music and perseverance through adversity has always been my inspiration for dance.” —@nicospins https://t.co/FBGTSQcvcb https://t.co/M5qmjyKa0d Introducing the new chat sticker in Stories. Now, there's an easy way to start conversations with a group of friends right from your story. https://t.co/A1An7d9TjJ “Pushing through and dreaming big” with @Naomi_Osaka_ at #Wimbledon 🎾☀🍓 https://t.co/wSVTirNXQ8 https://t.co/KsYcAln8JM 🌈⭐️🌈⭐️🌈 #pride https://t.co/tOKzLTCWqK Head to our story right MEOW. 💗🎀 We’re at @CatConWorldwide with @iamnalacat 🎀💗\nhttps://t.co/MWj6gRMAGI https://t.co/sGTvsWVZXL This Pride @Miss_Benny shares how he gained the confidence to fully express himself. 🌈🤠 #UntoldPride https://t.co/VKsQw02Gy7 https://t.co/iYU2XVmhYF Dive down the 🐇🕳 with us each week to uncover some truly one-of-a-kind #HiddenGems. For artist Leonardo Frigo, there is no better canvas than a 🎻. https://t.co/U58VLs7ccJ https://t.co/4yXIAmnV0W Differences don’t matter for this week’s XS and XXL companions Lulu and Brody. #WeeklyFluff https://t.co/MDi80uj2bx https://t.co/zuJxHFhJFS Being weird has never looked so glamorous. Today, AR designer Johanna Jaskowska shows us some of her fascinating face filters. Learn more about her creative vision on https://t.co/6h6C85UG2z. https://t.co/IE0sHzK0Jt https://t.co/vvLHDraJeb Learn more about Wednesday’s work (and life) in #Advocates, our new weekly series that highlights people around the world who are sparking positive change. ✨ On our story and IGTV right now: https://t.co/iXHJCeZ8Oe “I’m trying this thing where I’m proud of who I am in hopes I can be the person I needed when I was younger.” —Queer illustrator and advocate Wednesday 🌈 #Advocates https://t.co/iXHJCeZ8Oe https://t.co/VBopTLf2AA Need an extra bounce in your step this week? Check out some of @katelyn_ohashi’s 💯🙌 skills in our new weekly series #YouGotThis, right now on our story. https://t.co/BPQQWUuhIC https://t.co/GU2sKuWBdJ RT @CBSThisMorning: .@Mosseri says his focus at @Instagram is on well-being. The app is currently testing changes, including making \"likes\"… “To sit quietly alone in my kitchen and totally concentrate on these beautiful and fragile blooms from my garden is a pure form of joyful meditation for me.” —Fashion photographer and director Nick Knight  https://t.co/buUaiWZQuK https://t.co/GmFKLWbi6i “There’s something fetching about seeing a rose with eyes, a mouth... an opinion.” —Artist Angela Deane 🌹👀https://t.co/H5GZkhxenV https://t.co/Gp9xUPVAnO “I really love the ephemerality of flowers.” —Floral artist and entrepreneur Maurice Harris \nhttps://t.co/ZfDpRoDgAk https://t.co/PlPXJnI1Jr #HelloFrom Tulum, Mexico. 🌈 https://t.co/6shVnlphnw https://t.co/mAF1nDjRL2 For Lisa and Bianca, life is always full of rainbows — especially in June. #UntoldPride. 👭🌈\nhttps://t.co/wcH4NiHJyr https://t.co/6iiKYJ4IVd Dive down the 🐇 🕳 with us each week to uncover some truly one-of-a-kind #HiddenGems. https://t.co/cLMdIajY1j Today on IGTV and our story, meet some of @cat_rabbit’s colorful, handsewn creations #HiddenGems 🐷 🐢 https://t.co/mNuZ5QW9eA https://t.co/yfPq4xIpWc Learn more about Instagram’s safety tools from our French community, including @hectorlevrai. https://t.co/lGTLXtKzpo Making a splash with some floaty friends. #WeeklyFluff https://t.co/CxaKYHULD6 https://t.co/0PpbtJhDb8 Step into the founder and designer Jemma Swatek’s @LykkeWullf studio on today’s story, then see Jemma’s styling tips &amp; shop the goods on https://t.co/ggYYpFerWW 🌈✨ https://t.co/VgZNmrFqVp https://t.co/vC8NeMF9UB Today we’re launching #Advocates, a weekly @instagram series that spotlights people from around the world who are sparking positive change. ✨✨ https://t.co/VyUYOneEgT “If we all do something, we can accomplish anything.” —climate change activist, @GretaThunberg #Advocates https://t.co/VyUYOneEgT https://t.co/SLYKVhUKxz Trust and believe, your Wednesday is going to be 💖. Our new weekly series #YouGotThis is here. https://t.co/cLMdIajY1j https://t.co/7RhkUWVQR6 Ready for your day to get a whole lot better? @dontecolley is here to say #YouGotThis. Check out our story now for an extra special dose of joy and inspiration.  😂🙌😻💫 https://t.co/QmAbBACvUr https://t.co/j4Lg8rvluU Doodle illustrations + more than average makeup = a creative outlet from the average day ♡♡ https://t.co/EomCA33ZG5 https://t.co/wprZ0oXHZW “It’s almost an attempt at an ‘anti-selfie.’” —Makeup artist, filmmaker and musician Kiko Nafig\nhttps://t.co/mrmlwfPThL https://t.co/MzG1lpHiLY “I think selfies themselves are pretty boring, so I like to spice them up a bit.” —14-year-old Tamara Burri https://t.co/ZJE2dBHNmk https://t.co/bXoN94LojC Happy #FathersDay and... T-H-A-N-K 💙 Y-O-U to all the dads out there.\nhttps://t.co/gZ4M8oMJ7D https://t.co/reAo5OJD7r Today on our story, we go bananas for the ASMR sounds of squishy “dessert.” 🍌🍦🍒 https://t.co/mjcaeHFmE1 https://t.co/wxYowBV4eR Here 🔥 she 🔥 is 🔥 @pabllovittar wants us to show the world who we are and celebrate #UntoldPride. https://t.co/9OyMdBFaKc https://t.co/WHPuzNtQAA Ultrarare and up close. 🐾📸 Conservation photographer @CarltonWard shares his “impossible” photos of Florida’s wildlife, right now on our story. https://t.co/VUAS5Xrduq https://t.co/LH1xnSEPGd RT @commentsby: Ever wondered what it’s like to be on the other side of @instagram? We sat down with @CharlesPorch, Instagram’s Head of Glo… What do you see when you look at Rorschach’s nose? A heart, right? Definitely a heart. 🖤 #WeeklyFluff https://t.co/KV5Y2HBkTS https://t.co/I7LRxg4lKe We are now fully recovered and apologize for the disruption! #instagramdown https://t.co/PfALWABRKA We're aware that some people are having trouble accessing their Instagram accounts. We're working quickly to fix the issue. #instagramdown Japanese potter Abe Haruya handcarves mesmerizing patterns. See them take shape, today on our IGTV. https://t.co/St890cHmxP https://t.co/lxB8rJa3WC “What inspires me the most is my curiosity.” See more of pastry chef Tal Spiegel’s shoes and sweets today on our story. 👟🍬 https://t.co/0ZiF2Ple3F https://t.co/6OSIs0aQYl Today on our IGTV and story, meet a 17-year-old makeup artist inspired by their Native American heritage. https://t.co/nAlbSNYEdk https://t.co/wqSPJcQKKQ Celebrating #UntoldPride this Pride 🌈❤️ https://t.co/vccN51oXqF It’s Pride Month – officially! 🌈⚡️🦄 – and fashion model @aaronphilipxo is sharing her #UntoldPride message with us. https://t.co/9Wli2OJq2l https://t.co/oNb85GXzwo “As a free diver, you truly feel part of the ecosystem.” 🐳🏊🌎🌊💙  #WorldOceansDay https://t.co/gujHZWP6yO https://t.co/I7ssvu9wUa Nice ‘stache, Hamilton. #WeeklyFluff https://t.co/x3OPQOg3gr https://t.co/NGbfgOdnGl ☕️ + 🐶 + ⚽️ = just another day for soccer star @alexmorgan13. Check it out, right now on our IGTV and story. https://t.co/zV04QEG8rM https://t.co/dMh54B82RV Watch @billieeilish use the new lyrics feature for music in stories. 😎🎶 She’s sharing the meaning behind some songs from her album “WHEN WE ALL FALL ASLEEP, WHERE DO WE GO?” https://t.co/F89yfUW11G https://t.co/BTmRkdWAba Today we are bringing lyrics to the music sticker so you can express yourself and share the mood of any moment. Try it in your story and learn more here: https://t.co/snnxyPYxtG https://t.co/0KMcy5kUD1 Very special 🧦 from Darner Socks star on today’s story. Check it out, then shop the goods on https://t.co/ggYYpFerWW 🌈✨https://t.co/9KaNgfmdNp https://t.co/B4syztOw4u Tonight the @warriors beat the @Raptors in Game 2 of the #NBAFinals. See what the scene was like from Toronto on our story right now. 🏀 💫 https://t.co/P2rWXZrnVO Tune in to our Instagram story tonight after #NBAFinals Game 2. We’re on the sidelines as the Warriors take on the Raptors in Toronto. Watch our first-ever episode of #ThreeMinuteAutobiography, where some of your favorite ⭐️ share their life story in just three minutes. Today’s special guest = Millie Bobby Brown. ❤️ https://t.co/djuKFQG7Mo https://t.co/C5oFKvlMtx Give ‘em their own show! #WeeklyFluff https://t.co/V75efBqd1o https://t.co/7JDaPJPxP1 @JoshuaKissi @Micaiahcarter @afriikaana we live for a picture-perfect love story 💕✨ “The first time I shot a bow from a horse, I knew this was the sport for me.” 🐴⚡️🏹 See equestrian @AlexBauwens_ shoot some arrows, today on our story and IGTV. https://t.co/8WgTZENtV6 https://t.co/qoocG2RnYc Dancer and vlogger Cameron Field separates truth from fiction with a sense of humor. https://t.co/o9qVkzdVIJ https://t.co/qilrCIge6W Curl up with a good book. 📖 😸 #WeeklyFluff https://t.co/JT0q1VzYBd https://t.co/QQDflkaa2g Otherworldly opals and other found objects star in Wing Yau’s designs for WWAKE. 🐚 Head into her studio on today’s story, then shop her goods on https://t.co/ggYYpFerWW 🌈✨ https://t.co/gI8g7PuH0v https://t.co/1TspnmDiwQ Starting today, we’ll begin rolling out a new content appeals feature available in-app. This gives people the opportunity to request a review of content removed from Instagram. Details here: https://t.co/f5bnsM7CfR Do you know how to say “walk the red carpet” in French? 🤔 Find out from French creator @SundyJules in a little quiz we like to call #GameOn, on our story now. https://t.co/dh72P3qnAs https://t.co/qZHXAGGVRx Meet Shivani and Chaya — the choreographers and brains behind BFunk. #APAheritagemonth https://t.co/oeiXVnSgAD https://t.co/6HrGxoJsfS Rock on, little guy! 🤘 #WeeklyFluff https://t.co/XylVCH68Jy https://t.co/v7TNc97L9I Time travel, Maseratis, 🐴 (duh) and even Chris Rock (?!) all have a moment in @LilNasX's #OldTownRoadMovie. Go BTS of making the video today on our IGTV. 🤠 https://t.co/EtMu2REgHk https://t.co/mhKNHNIrX4 You see a #coneofshame, we see a fashion statement. Today on our story, dogs proudly wear their chic, custom medical collars. https://t.co/Dv6cqveVyt https://t.co/bfsjKxZpJz Today on our story and IGTV channel, experience a total glitter party. No vacuuming required. ✨ https://t.co/cvKpDqNkNj https://t.co/Enxx3n4PMS “Honoring my heritage means connecting the food I make to the past, but also using it as a conversation to explore my own identity and tell my own story.” —Food photographer and recipe developer Hannah Che #APAheritagemonth https://t.co/dVYHYIBksD https://t.co/JMlbc4nUpm RT @InsideEdition: Meet @buddymercurydog, the adorable dog popular on Instagram for \"playing\" the piano and \"singing\" along. https://t.co/Z… Happy #MothersDay to all the mamas out there. 💕 Today, we’re celebrating with James and her daughter Plum. 💐 https://t.co/aorPzxCIOS https://t.co/6gG41NoZmZ 🥑 🦋🍒🥨(&amp; more) star on designer Susan Alexandra’s lovely beaded bags. Head into her studio on today’s story, then shop her goods on https://t.co/ggYYpFerWW 🌈✨ https://t.co/ZY2lfYMDlW https://t.co/LAhi6fpVWs Taking it easy, podenco-style. #WeeklyFluff\nhttps://t.co/96EzihC3eV https://t.co/pel2bfRby3 Calling all the shopping lovers out there! 🛍 Discover and shop 💄👗👡🎒👚 from around the 🌎 https://t.co/0ueWYqbzaG https://t.co/JcXRi4LNAv Fashion. Makeup. Basketball? See how @CW_Riverdale star @charlesmmelton spent the day getting ready for his first #MetGala, right now on our IGTV channel. https://t.co/fNvUy1NFNe https://t.co/j4GsVpMGpG Share your moments of everyday kindness and good — and all your Ramadan celebrations — using the hashtag #MonthOfGood. “I wanted to create a project that allowed for the diversity of Muslim women to be seen, and for our individual stories to be elevated, celebrated and shared.” —Alia Youssef, photographer and creator of The Sisters Project https://t.co/3q4dKYfaoA https://t.co/LVWGZKXGU7 Today on our IGTV channel, art meets science in the form of these handcarved pots by scientist-turned-potter Sean Forest Roberts. https://t.co/BhED13MlUV https://t.co/rXczdM1ikI Tonight, we’re at the #MetGala with @CW_Riverdale star @charlesmmelton. Check out our story now to see how he prepped for the big night. \nhttps://t.co/HmWzRrnWfj https://t.co/em8n7flNQA Time to celebrate #APAheritagemonth with Hawaiian artist Sean “Hula” Yoro — who got his start by combining his two loves: surfing and painting. 👋 https://t.co/OjABp6HgLz https://t.co/vzFgnOS4kA Passion-turned-profession? Yes, please. Today on our story, we’re visiting floral stylist Ruby Barber’s Berlin studio. 💐https://t.co/fudWMQ8bA4 https://t.co/xJtqVJVRNi Struck by neon. ⚡️🌴 #WHPgoingplaces https://t.co/CSAY3P6ILe https://t.co/aqMpVfuwMh RT @SELFmagazine: Hey! May is #MentalHealthAwarenessMonth and along with @instagram and @afspnational, we want to have a #RealConvo to show… This mother and daughter are always ready for a soirée. #WeeklyFluff https://t.co/wWTSJ3Gmm1 https://t.co/0Jjv2phQ8d RT @TeenVogue: This #MentalHealthAwarenessMonth, IG is partnering with the American Foundation for Suicide Prevention to imagine an online… “Nobody’s perfect, everybody goes through things in life. I think the more that we talk about things the less it will feel taboo.” —@SashaPieterse ❤️ Head to @afspnational to see more #RealConvo stories and learn more. ❤️ https://t.co/n1G0p0Zins https://t.co/9olejlVgFe “Everyone has a destination in mind.” #WHPgoingplaces https://t.co/xkgxKNNFZL https://t.co/AysrMKnHhG From Berlin to Batumi in no time. #WHPgoingplaces https://t.co/pQFrFDotAN https://t.co/oXU0h730x0 News from #F8! Here are a few updates from @mosseri we’re excited to roll out: https://t.co/0TsVqquYWo https://t.co/jhnvcZgTpw Lost (and found) in the mists of time. #WHPgoingplaces https://t.co/EzupkJjpXw https://t.co/IFI8MPxLSQ If you cast @ellomelissa in a movie, cast her as the future. Today on our story and IGTV channel, we celebrate #NationalPoetryMonth with four Latina poets who rock.🤘🏽https://t.co/5wTFgjCgsa https://t.co/rBcfwsVynM Participate in this weekend’s hashtag project: #WHPgoingplaces https://t.co/gw4oN2h2v0 https://t.co/clbhIGSC0d This desert beach is a pastel dream come true. #WHPplanetearth https://t.co/HSqYUlDiNx https://t.co/kjXkWBBOzJ According to his DNA results, our #WeeklyFluff “scruff monster” Ragtime Jimmy is 100% adorable. Today on our story, we go exploring with Jimmy and his hiking paw-tner Boogie Woogie. 🐾 https://t.co/saOaT6QMQv https://t.co/h3RPEw2XSf Look what we spotted. 😸 #WHPplanetearth https://t.co/qiVPexY4Zy https://t.co/b8252KDiIj Today on our story and IGTV channel, #BodyControl pro @JustJet__ proves all the world’s a stage. ✊ https://t.co/SHOYWxFWlV https://t.co/Q019kditZD Calling all tree-huggers. #WHPplanetearth https://t.co/YB8XTzyfOs https://t.co/MvY9zDRHAX Starting today, you can use the new quiz sticker in Stories to ask your friends and followers a multiple-choice question. See how well your friends know you. 🤔🙃 https://t.co/a6y1PaOnSY On planet Earth, a heart can be made with pure sunlight. 💖 #WHPplanetearth https://t.co/15Yog7VHfo https://t.co/u2qJSWWWyp Today on our story, we’re celebrating #EarthDay by going on a hike with nature photographer Liron Gertsman. https://t.co/DQBLmG2pHp https://t.co/ygMU3Yopjs Happy #EarthDay everyone! 🌵🍄🐚🌸🌻🌈🌲 https://t.co/Kkj2uV2FlM All hail, Lizzo (@lizzo): a #Coachella Queen of 2019. ✨ Tune in to IGTV now to talk fashion, body positivity and performing with the artist whose album #CUZILOVEYOU dropped yesterday. https://t.co/rjg9muTJLj https://t.co/Rp7sm0irVA Participate in this weekend’s hashtag project: #WHPplanetearth https://t.co/S5DIOOzOvm https://t.co/pUlLQgH99d Today on our channel! Check out IGTV Gold = videos we found (and loved) this week. https://t.co/Ykw2Tg6WVk https://t.co/ZWcLM5rGM5 “The chaos of Tokyo meets the stillness of yoga.” #WHPvibes https://t.co/TG2eejbVfk https://t.co/t09f7Ugtbo What’s better than one Easter bunny? Two Easter bunnies! 🐰🐰  #WeeklyFluff https://t.co/jM0kjZ5Wun https://t.co/B9enbTyjhP Follow your own fairy tale. #WHPvibes https://t.co/KIdXeizBRS https://t.co/zeqhO06dao RT @Cosmopolitan: From L.A., a group of badass young hip-hop dancers is taking over your feed, redefining stardom. Trust us: You👏Need👏To👏Fo… Viral dance challenge accepted. Some of our favorite dancers bring their favorite hashtags to life, today on our story and on @Cosmopolitan. https://t.co/QO6Navj1SC https://t.co/fXvmCwYzIc RT @Cosmopolitan: Watch @JadeChynoweth, @TessaBrooks, @AliyaJanell, @Deeglazer, @kaelynnharris, and @oliviawong21 💥KICK ASS💥 and talk about… Head in the clouds? Welcome to the club. #WHPvibes https://t.co/3lLONsFCMs https://t.co/y0q97SbIdA “Together with the flowers I soaked in the first sun rays.” #WHPvibes https://t.co/vH6eyUOIHP https://t.co/KmZo0z9KC3 What happens at Coachella... ends up on our story. Check out our unforgettable weekend with @rosaliavt. 💃 🎡 https://t.co/ZeskxJ70zD https://t.co/hvCEw6FV70 RT @hypebae: We Interviewed four women working at @instagram about career, women in tech and more. https://t.co/K1wPtBIrxg Participate in this weekend’s hashtag project: #WHPvibes https://t.co/NihLIpwzj9 https://t.co/HRQ64MUV8H The only rational explanation here is that mermaids are real. 🧜‍♀️ #WHPfavoritecolor https://t.co/G1gK7kK8Xd https://t.co/8Pvth630hK 9 out of 10 parrots recommend an electric toothbrush. #WeeklyFluff https://t.co/uMsRu9HrnA https://t.co/BS34lDX8bV Dress to express. 👸\nEmbrace your personality. 😜\nDo what you love. 💝\nToday on our story: a quick guide to self-love, courtesy of @juromano. https://t.co/mR0IEDx3dx https://t.co/NDbi9i2L48 Samoa’s true-blue personality shines through. 💙 #WHPfavoritecolor https://t.co/Qti3fviVPL https://t.co/Y9Kc1qb4BB Bright yellow = 😎 #WHPfavoritecolor https://t.co/uTjpfUuvxU https://t.co/o6ffaCHTLw Today on our IGTV channel: @seanlew1125 expresses his feelings through a new dance routine. https://t.co/qUbBIo2hcp https://t.co/FlNft9nBFz Color in the time of cherry blossoms. 🌸 🌸 🌸 #WHPfavoritecolor https://t.co/FpJgv7LAVU https://t.co/puu0Bob6Dd Relive all the sweat, tears and (hopefully) cheers from the #FinalFour showdowns, right now on our story. 🎉 🏆 🏀 https://t.co/hdW8fBvxfl https://t.co/bh77xKsdC9 Want to move like Cheshir Ha? The Korean hip-hop dancer breaks it down for you, right now on our story. 💃🕺 https://t.co/EylqJcpn63 https://t.co/8wnMmiOSQt Participate in this weekend’s hashtag project: #WHPfavoritecolor https://t.co/QBKeCbx0h4 https://t.co/sO9g8cjdpl Today on our channel! Check out IGTV Gold = videos we found (and loved) this week. https://t.co/hQP6SiI9F7 https://t.co/cQFWCGFFhR Using food to make art can be rather fruitful. 🍒 🍐 🍊 #WHPFoodForThought https://t.co/U5DnwJKcTa https://t.co/eWXATc7xXV A lady always greets the neighbors. #WeeklyFluff https://t.co/OPgHBPhihK https://t.co/iZOwhhaYnN Check out this eggcellent self-portrait. #WHPFoodForThought https://t.co/pL0Xj4ERCo https://t.co/KHEk7llz8h Here’s a unique take on “green design.” #WHPFoodForThought https://t.co/Rpnlh4j9xk https://t.co/tO5WITyGKY Today on our story and IGTV channel: one of nature’s rarest flower shows with cactuses that bloom only once a year. 🌵 ✨ 🌺 👀 https://t.co/HOhpTZwM4a https://t.co/ap29nyDGrX When your salad doubles as a flower crown. #WHPFoodForThought https://t.co/61Am5MPNKD https://t.co/XCuDq8srEt On our IGTV channel now: @GeorgiaP83 takes us into her mom’s closet 😂 https://t.co/geGS4usCOr https://t.co/W6GNmLOArG On #TransDayOfVisibility, nonbinary trans writer and performer @tywrent is sharing why today is so very important. 💭✨ #TDOV https://t.co/3Rs3yA5vJH https://t.co/MKkgMSFjt2 When it comes to golf tricks, @taniatare is up to par. See the professional golfer’s crazy trick shots, today on our story. https://t.co/oNFdGF2KcI https://t.co/lYPW1pP9AN Participate in this weekend’s hashtag project: #WHPFoodForThought https://t.co/7OPN41Fo6x https://t.co/6aPfJ0WqtW Today on our IGTV channel, 15-year-old Ping-Pong prodigy Nick Rudd makes insanely tricky shots look easy. 🏓 😲  https://t.co/ltDu9Y30EW https://t.co/ePimUtITVr Cultivate your ideas and watch them grow. 🌱 #WHPplayful https://t.co/64CtNxTtlt https://t.co/ynl3iZTB8r Lovable. Huggable. Totally rubbable. That’s Farfor for ya. #WeeklyFluff https://t.co/X59zesdowO https://t.co/c9nF6gvdak Making memories from such great heights. #WHPplayful https://t.co/l5HLDF90Hv https://t.co/3gUqr8P1No 👏 for making it your own🧕✨ https://t.co/vWftsAhC2t HERE 👏 FOR 👏 THIS 👏 The April/May issue of @girlslifemag spotlights 6 young women who are using Instagram to change their lives — and the world! Get an exclusive sneak peek of the new issue (on newsstands now). https://t.co/DH3NpX8sU1 This March, we’re collaborating with BuzzFeed News reporter and producer @kassy to celebrate women around the globe who are making an impact in their local community and on Instagram. “I want to show that Muslim fashion is something that goes beyond the boundaries of religion and that anyone can empathize with, and enjoy, it.” —Rahmalia Aufa Yazid #WCW https://t.co/QkKqGomtg2 https://t.co/0cVeBVm4sX Going back and forth in Jakarta can be a fun thing. #WHPplayful https://t.co/FylsZyuoSo https://t.co/CFStFHrQMn 🥑 + ⛏ = 🦁 See an avocado turn into a lion, right now on our IGTV channel. https://t.co/kxs2q82UaA https://t.co/FbW5PtQSXa Come through, springtime. 🌸 🐶 #WHPplayful https://t.co/lmGgT3xJdr https://t.co/v0CilLD4hp Are. You. Ready? ⚡️🦄🤘The @Nickelodeon Kids’ Choice Awards are back, and we’re with #KCA nominee @itsjojosiwa — right now on our story. https://t.co/JqIIEaJkZe https://t.co/gM2fLsIUah Participate in this weekend’s hashtag project: #WHPplayful https://t.co/7J9KmsIgym https://t.co/6eTIpI0nfr Today on our channel! Check out IGTV Gold = videos we found (and loved) this week. https://t.co/spKt7dENo4 https://t.co/rTO0iXhl7d Life’s not always black and white. #WeeklyFluff https://t.co/5VD3iYK2U1 https://t.co/izCQO4WlyC This March, we’re collaborating with BuzzFeed News reporter and producer @kassy to celebrate women around the globe who are making an impact in their local community and on Instagram. Meet World Adaptive Surfing champion and doctor of physical therapy @Dani_Burt. #WCW https://t.co/d3YDSb04rn https://t.co/aoVQnZYwQX 🚨TREND ALERT: 🚨@evachen212 and a group of amazing Instagram influencers highlight the hottest fashion and beauty trends for Spring 💐https://t.co/zB6Fz2Z1da (via @TODAYshow) “It’s a retail revolution.” 🤩@TODAYshow 🤩 https://t.co/UULB1NJp0u Today, we're introducing checkout on Instagram. When you find a product you love, you can now buy it without leaving the app. 🛍💕https://t.co/o1L5WsfgVE https://t.co/IlVJxOr10x Breakfast is served courtesy of makeup artist @cakefacerj, today on our story and IGTV channel. https://t.co/6Tw6hC5don https://t.co/vFMOwUeGbG “When the Irish community gathers, music and dance are a vital part of the celebrations. It’s a distinctive signature of who we are,” says competitive Irish dancer Julia Sullivan. #StPatricksDay \nhttps://t.co/po9ramYkOb https://t.co/wNlekUfgEd Sent with love and gratitude from Mumbai. #WHPSheInspiresMe https://t.co/llAfOC52Oh https://t.co/Too1c7etxY Step up to the plate in your rainbow socks. #WHPSheInspiresMe https://t.co/6YCi4pig3Z https://t.co/iCWbVQAKJO 🍣 🥢 = 🤯 at Florida restaurant @wavemountdora 🌊https://t.co/qXng5zk02N https://t.co/iNnzstRfjK Anddddd... we're back. https://t.co/5E8UdlcsPJ We’re aware of an issue impacting people's access to Instagram right now. We know this is frustrating, and our team is hard at work to resolve this ASAP. In 2010, the very first Instagram photo ever was taken by co-founder Kevin Systrom. It features this very cute dog (with a cameo by his wife's foot) near a taco stand in Mexico. #Web30⁠ ⁠ #ForTheWeb⁠ ⁠ https://t.co/HfKFQtVw3v When the stars align, so do these sisters. ⭐️ #WHPSheInspiresMe https://t.co/sBeKTdLWZw https://t.co/QRvejWRfTC Like daughter, like mother. #WHPSheInspiresMe https://t.co/alvIHPohRe https://t.co/UuiOOTmuxH Today on our channel! Check out IGTV Gold = videos we found (and loved) this week. https://t.co/jvWMARy0Xh https://t.co/Kv3mKaB9Kj Participate in this weekend’s hashtag project: #WHPSheInspiresMe https://t.co/CFBUu5ACXx https://t.co/GbV22qXCaP 🙌💕🙌💕🙌 https://t.co/kV66P3rfg5 This March, we’re collaborating with BuzzFeed News reporter and producer @kassy to celebrate women around the globe who are making an impact in their local community and on Instagram. Meet Kheris Rogers — the creator of Flexin’ In My Complexion 🍫🍫🍫 #InternationalWomensDay https://t.co/DCZysfdZvF https://t.co/vHSXIeBtbx Come for the fashion, stay for the Gigi Hadid cameo. We’re at #PFW with Eva Chen (@evachen212), right now on our story. 💋 https://t.co/hrGKkLC8x3 https://t.co/VCxQkljCvi Legs in the air like you just don’t care. #WHPweekend https://t.co/1RY3fdQs3s https://t.co/XiB3PxULFc Orchards in bloom are always in style. #WHPweekend https://t.co/qJCSWD0GVX https://t.co/lhUwABpWZE Playtime with snow angels. #WHPweekend https://t.co/qHefXjvDfR https://t.co/fgKKCYqyaV Today on our story: Spend some time in the suburbs with Alfie the pet alpaca. 🦙🏡 #WeeklyFluff https://t.co/bARnjGi6AQ https://t.co/LmDehDIhvM Wanna hang? 🤗 #WHPweekend https://t.co/PaPtHJ5se4 https://t.co/oCQS7WMjoB Dive into the weekend. #WHPweekend https://t.co/8DD11ACnSF https://t.co/OOYTC9rj97 No rainbow today? No problem. #WHPweekend https://t.co/ZyBxu2isPc https://t.co/590MjTb0Io Ready to believe in @kevinlimagic? Tune in to our story and IGTV channel to see his mind-blowing magic tricks. 🤯 https://t.co/pFIJpmJAHU https://t.co/43STKTveYD Today on our stories and new to IGTV! It’s time to spark joy with tidying 👸 @MarieKondo. https://t.co/Rg4HRJj8I3 https://t.co/XIJeQCNlkr This Stories sticker (for all your “general ‘YASSS’ moments”) came to life on our float at Sydney Mardi Gras. 🌈 https://t.co/hh2txodbug https://t.co/VDwP1vYPHS This March, we’re collaborating with BuzzFeed News reporter and producer @kassy to celebrate women around the globe who are making an impact in their local community and on Instagram. ❤️#InternationalWomensDay https://t.co/r3jDU99eW0 https://t.co/t4x2uXhaqj Participate in this weekend’s hashtag project: #WHPweekend https://t.co/d27yFktW0W https://t.co/fpTcFKHpXc Strike a pose like Pickles. Today is #NationalPigDay. https://t.co/yWzqj64oEb https://t.co/Q7shMN7l20 RT @FacebookWatch: Jordyn Woods comes to @redtabletalk to share her truth. Now on #FacebookWatch. https://t.co/SZzCz3jHb7 https://t.co/kovz… Ride on, Cota! 🐦🤘 #WeeklyFluff https://t.co/Lu7L7KD8wF https://t.co/4JOslrNkl2 Today on our story and IGTV channel: Be a plus-one to #MFW thanks to Teen Vogue editor-in-chief @lpeopleswagner. 🙌 https://t.co/erRnzahwoO https://t.co/b5nb9GrIyd Keep your head above the water. #WHPsplitscreen https://t.co/4GZYKZOGpW https://t.co/chjU1EYNjk Who invited Mr. Lantern Head? #WHPsplitscreen https://t.co/qFpZyZiFPc https://t.co/yeaxxjd0UB On the edge of something great. #WHPsplitscreen https://t.co/mHwPUCrIwp https://t.co/AD3Zks1nMa RT @NEDAstaff: For #NEDAwareness Week, @Instagram and @NEDA have teamed up to let individuals at all stages of body acceptance and eating d… Afro-Latina artist @UzumakiGallery is creating safe spaces for all. Step inside one of them, today on our story. #ShareBlackStories https://t.co/VQ0w8ZXmcR https://t.co/1q2CHzFQBv And the best use of pinning goes to... https://t.co/7JVEp0yrLZ Behold! The magic of a family circus. 🎪 #WHPsplitscreen https://t.co/sOmHB8EBRB https://t.co/DvqNxNTmyV Spring is just across the street. #WHPsplitscreen https://t.co/8ju4SPw0xS https://t.co/IOwjcw2jWB Just another colorful day out at sea. 🌊 #WHPsplitscreen https://t.co/bZ9J9BKJ4D https://t.co/TwbwQfzJ0z We’re behind the scenes at @NBCWorldofDance with the one, the only... ⭐️ @JLo ⭐️ Watch now on our IGTV channel. https://t.co/Q8rUoLG7Qg https://t.co/tEVihd0MuV “Using Instagram, I believe in representing myself and my work equally and just as passionately. I am comfortable stepping into my head and expanding on ideas on what storytelling is and how it can be used.” @YagazieEmezi #BHM https://t.co/XWBPRiLZZP https://t.co/ch8DL3WlmW Teen advocate Noor Aldayeh is speaking up about #NEDAwareness, and encourages you to #ComeAsYouAre. https://t.co/Jy6WyqtPsR https://t.co/MWs2XsO0eh RT @seventeen: 5 Body Positive Influencers Share How They Learned to Love Their Bodies \n#ComeAsYouAre https://t.co/FG6M4sqdgh https://t.co/… And the award goes to… ? 🤩 Tune in to our story right now to see what the #Oscars were like for actress Amandla Stenberg. https://t.co/IVev9iJR3J https://t.co/XuBvSSPwA7 Professional dancer Daniel Harder talks about the African-American visionaries who helped him believe in the power of dance. #ShareBlackStories https://t.co/qzWpC99M4s https://t.co/t9Aa9QCLLM Today on our channel! Check out IGTV Gold = videos we found (and loved) this week. https://t.co/GepVkFxs6h https://t.co/ys76ohXgwo Today on our IGTV channel: Bring an extra layer! We’re penguin-spotting on a subantarctic island with @NatGeo filmmaker @BertieGPhoto. https://t.co/FgCk91jq8E https://t.co/USuhD4jdQb RT @WIRED: Samsung's Galaxy S10's camera has a new mode called Instagram mode. This mode will make it easy to access Instagram stories and… Participate in this weekend’s hashtag project: #WHPsplitscreen https://t.co/GeDyHkEAzK https://t.co/KaLDKjbqU2 Today on our story and IGTV channel: We’re at London Fashion Week with dream team Isamaya Ffrench and Vivienne Westwood. 🧙‍♀️ ✨ https://t.co/UqvgwJrnYA https://t.co/bFIeO3fpDp A double dose of adorable. #WeeklyFluff https://t.co/MCXqA9IzUX https://t.co/b8x9ltmS3C Today on our story, @MichaelDapaah goes to the #BRITs and takes us along for the ride. 😎 https://t.co/EI49FGDxAv https://t.co/4sE1UYZcRQ To create a striking image, sometimes you just have to dress the part. #WHPUpToMe https://t.co/VNN8NA7EKB https://t.co/2Oyjvf7DI7 Happiness attracts everything, even butterflies. #WHPUpToMe https://t.co/8JT0f2J6lS https://t.co/jJFfOZylsz Nature’s very own spin art. #WHPUpToMe https://t.co/WBfEUGXpbJ https://t.co/eUKRYmxHQK Ladies and gentlemen, start your engines! Brehanna Daniels (@Mindless_BMD) shares her journey as the first black female member of a pit crew in a NASCAR series race. #ShareBlackStories https://t.co/kS2NVPsC7e https://t.co/WASgGw88hA #F8 registration is open! Join us at @Facebook (https://t.co/XLtNFBMTyh)'s annual developer conference in San Jose, CA. Apply to attend or sign up to stream at https://t.co/XjfEQ65Phm (https://t.co/Zq4qiU8Ynr). https://t.co/DMZJzxE4zI Surround yourself by what you love. 🌻 🏵 🌼 #WHPUpToMe https://t.co/r85QaQ9kRO https://t.co/lbZxyuSqgu Finding freedom somewhere between Berlin and Beijing. 🚲 🚲 #WHPUpToMe https://t.co/ocQdSE2L6T https://t.co/NFdLx3LGQk Reach for the star suit, and one day it could be you walking on the moon. 🌕 #WHPUpToMe https://t.co/SvtbKRv3O7 https://t.co/8HNonqBHfy “Sport has inspired me in my life, and it inspires people all around the world.” @DjokerNole 🎾 #Laureus19 🌟 https://t.co/8A9aeXdSYm “Instagram provided me with a community I otherwise would not have had the opportunity with which to connect. It has expanded the scope of my interactions, and therefore, the scope of my inspiration.” @macabrii https://t.co/z03kPhBtaU #BHM https://t.co/n9SbWrpznp Today on our IGTV channel: designer Christian Cowan invites us backstage during #NYFW https://t.co/2TLstPQc26 https://t.co/A25wCnAqvA Deep down, Coco just wants your undivided attention. #WeeklyFluff https://t.co/hGASDZf5N8 https://t.co/rmt0dqTiFa Participate in this weekend’s hashtag project: #WHPUpToMe https://t.co/RfO0tgIC32 https://t.co/TmqoGQjib8 Today on our story: creative director @FindingPaola stands tall in her signature headwraps. #BlackHistoryMonth https://t.co/bw3TS0rn9K https://t.co/qL6nea8L8p RT @BritandCo: Happy V-Day, friends. 🤗💕 These 7 Instagrammers are here to remind us that self-love is the best love: https://t.co/l5r2EXfFM… 💌 Our #ValentinesDay gift to you 💌: time to celebrate Hannah Aylward and Shane Burcaw’s love on stories and IGTV. (P.S. Grab your tissues. This one’s a tear-jerker.) ❤️https://t.co/yzSDsxsjs1 https://t.co/fTxJ9cF602 Love turns a house into a home. #WHP❤️ https://t.co/bK5umEknB1 https://t.co/0QIcG7QEDs Stealing hearts left and right. #WHP❤️ https://t.co/zYsLhYgMZV https://t.co/Hkwz0uNsFt The apple does not fall far from the tree. #WHP❤️https://t.co/wibmF4WMTr https://t.co/E6DMDvIh23 Update: we’re expecting to have this issue resolved by 9 a.m. PST tomorrow. We understand this is frustrating, and our team is hard at work to get things back to normal. We have an early #ValentinesDay present for you! Self-care story templates from illustrator Claudia Romano 💆‍♀️ 💝 💯 Head to our story now to screenshot and share. https://t.co/waePcDaK0w https://t.co/I80sOyZidW We’re aware of an issue that is causing a change in account follower numbers for some people right now. We’re working to resolve this as quickly as possible. We found love in a rocky place. #WHP❤️  https://t.co/sh8xQjTG8H https://t.co/wJPxfWKrgX You never forget your first (reindeer) kiss. #WHP❤️ https://t.co/GFU0f5XDUX https://t.co/LenlCRL5M5 Open your heart, rain or shine. #WHP❤️ https://t.co/tpjrGkNhDP https://t.co/6y35eNa6LF 🚨 TREND ALERT 🚨 On Instagram, we love February with all our ❤️💕💙🖤 #ValentinesDay https://t.co/HIU5OsFh8m “My Instagram feed is an organic body of art. Each piece depends on the other works to tell complete stories. This is how I tell stories to empower and inspire the people around me.” —@anibaddie https://t.co/VkmvQCffAt #BHM https://t.co/lAc3pjkxX2 #ValentinesDay is almost here. 💕 So today, we’re spending a lovely day with twins @tess_and_sarah. 👭 💕 https://t.co/X0j6fIzRx0 https://t.co/xd5RBxGR2u Checkmate! Today on our story, wearable art = some cozy fashion from Annabell Lee. https://t.co/iE8FssVFsq https://t.co/RntzeHAIGz Participate in this weekend’s hashtag project: #WHP♥️https://t.co/nAQhUqEBbC https://t.co/KhCJ42CtZq Today on our channel! Check out IGTV Gold = videos we found (and loved) this week. https://t.co/7lphASoSNa https://t.co/9JxvXx38Bn Year of the Pig? You bet it is! 🐷 #WeeklyFluff https://t.co/1ApUNtPdO7 https://t.co/Y3yufVLiu1 Today on our story and IGTV: see all the work that goes into making artist Robbie Cook’s mandalas ☸️ magic. ✨ https://t.co/MJkoHz9ebH https://t.co/dWhuRgWw2U Now, you can preview IGTV videos in your feed. When there's a new video from someone you follow, you can tap from your feed to watch the full video in IGTV. (👋 @HannahStocking) https://t.co/tkYSchB7E8 For this embroidery artist, nature’s vibrancy is the common thread. #WHPcolorwheel https://t.co/G8a8IMG5Gc https://t.co/BHMARf4xZP Color me excited. ✨ #WHPcolorwheel https://t.co/CrJDkL5Eta https://t.co/tvv4Kk4uKq When it comes to decorating cupcakes, Narcos nose best. #WHPcolorwheel https://t.co/01t6PHt8Xg https://t.co/27tJ25Wot9 Warning: these intricate hand-embroidered creations from artist and model Sheena Liam may induce serious hair envy. https://t.co/Y3hmkwhZap https://t.co/aXVwPsQ9Vh A distant planet or a dream? Neither, it’s Canada! #WHPcolorwheel https://t.co/l8FXnnXbPc https://t.co/wTSbpSzmcW When in doubt, find the rainbow.🌈 #WHPcolorwheel https://t.co/90h5uFhzls https://t.co/1jDnZw53Nf Pick a color, any color. #WHPcolorwheel https://t.co/WGtDyXDQaP https://t.co/sH6sT7bWUJ RT @UNICEF: Happy #SaferInternetDay!\n\nYoung people around the 🌎 shared with us their stories on safety and kindness online. Check them out… New Year, New Nails? 💅 When it comes to celebrating the Lunar New Year, Rose Hui Yin Barron nailed it. 💅 🎆 Join the celebration, today on our IGTV channel. https://t.co/EjcDiLMWRt https://t.co/NW2VIoXD6N “The passion to capture and create new experiences daily motivates me. I'm grateful that I'm able to visually document my community and tell stories through my photography.” —@JWMILHOUSE #BlackHistoryMonth https://t.co/6EfbhyfN5K https://t.co/llHE2Q3UYY For #SaferInternetDay, here's a refresher on all our tools available to help keep you safe, and how to look out for one another on Instagram: https://t.co/g5PrZ0Tyza Today on our story, artist @TawnyChatmon tells us why it’s important to #ShareBlackStories all year-round. #BlackHistoryMonth https://t.co/mBvBMksnAF https://t.co/PjpygyNM0C Today on our story and IGTV channel: defying gravity with 15-year-old Amelia Thompson🤸‍♀️\nhttps://t.co/XWY5tqE9HS https://t.co/EPyx5JH2ml Participate in this weekend’s hashtag project: #WHPcolorwheel https://t.co/YTu8eYTzRo https://t.co/HnXhy58Lec Today on our IGTV channel: we’re making friends in high places with Guinness and Pimms. #WeeklyFluff https://t.co/cjBxBdBEbf https://t.co/U33lf6Cy5e These guys were really moved. 😂 #WHPmovement https://t.co/IgmhdtyAbQ https://t.co/4CyRZA7THE Every planet dance now! #WHPmovement https://t.co/7w97T6nqJF https://t.co/5bEZpo9zeV Catch this train, in motion. #WHPmovement https://t.co/aNaMil4K7O https://t.co/aSL6epjTUH 🥊 Basquiat\n🎨 Dalí \n🎤 Tupac \nTake a tour of @kobrastreetart’s larger-than-life murals, today on our story. https://t.co/GzcKdokOWZ https://t.co/SRNwpWymuB Can you paint with all the colors of the wind? 🌬🍃🎨 #WHPmovement https://t.co/kX4JoBu6kH https://t.co/Cfy61rBm6x Frozen-go-round. ❄️ #WHPmovement https://t.co/dUNjwNuKiF https://t.co/8coKEss2Zu Strike a pose. 🕺 #WHPmovement https://t.co/K3e4SjotTb https://t.co/B1RNFKlnz6 In our purr-fect world, all cats wear capes, dresses and kimonos. See more of these unique cat dolls, today on our story. https://t.co/Be5z9WCurx https://t.co/lyGn2lHKTK And the issue is now fully resolved. #instagramdown https://t.co/QwsTzzrVED We're aware of an issue that caused the app to be down for some users this afternoon. We know this is frustrating, and our team is working quickly to fix it. We'll update you here once it's fully resolved. Makeup artist @adelenata has an eye for detail. 👁 Tune in to our story and IGTV channel today to see how these looks spring to life. https://t.co/RmYrYP2I0Q https://t.co/LAMeq3Ejx5 \"We are so much more than what we have been allowed to show. We are unapologetically black, unapologetically women, and unapologetically multitudinous in our beings.\" —@jointhespades filmmaker Tayarisha Poe at #Sundance ♠️ https://t.co/nNM9xDcnZi https://t.co/6I3e434dcm Participate in this weekend’s hashtag project: #WHPmovement https://t.co/FoLush534F https://t.co/GACKNgE6AW Today on our channel! Check out IGTV Gold = videos we found (and loved) this week. https://t.co/fslluebS1k https://t.co/0dsZDwrevm The floor is lava. 😹 #WeeklyFluff https://t.co/ZSQCD60KIa https://t.co/nSGo66JqjT Check out the “magical documentary” style of photographer @nguan — today on our story. 🌈 📸 🌈 https://t.co/Gbs3yiKJy5 https://t.co/gRc8B4Rjvc Sleeping like a log? Don’t mind if we do. #WHPwanderlust https://t.co/wXOiGfrsF9 https://t.co/QSyC3nIgG8 Look up at the sky with rose-colored glasses. #WHPwanderlust https://t.co/VOpJapfowb https://t.co/M8JjdxzDO7 A side of Mount Rushmore we rarely get to see. #WHPwanderlust https://t.co/LVd6M9VJh6 https://t.co/g0GosTSXM5 Today on our IGTV channel: we’re dancing through Harlem with professional ballerina @ingridsilva https://t.co/5XWOlk4vIg https://t.co/zaH8FFyBVQ Awoooooooooo! This view of the wolf moon eclipse sent us howling. 🌕 🐺 #WHPwanderlust https://t.co/RkcmbPP9cJ https://t.co/2SeV9QTUvJ Welcome to Prayagraj, a city in India where rivers come together. #WHPwanderlust https://t.co/iBbnEK9Bmm https://t.co/3yNPg2ppGB A magical morning in Yosemite. 🏞 #WHPwanderlust https://t.co/gFJ7zHUjpz https://t.co/QiK78iYaJT We have not made any recent changes to feed ranking, and we never hide posts from people you're following – if you keep scrolling, you will see them all. Again, your feed is personalized to you and evolves over time based on how you use Instagram.✌️ What shows up first in your feed is determined by what posts and accounts you engage with the most, as well as other contributing factors such as the timeliness of posts, how often you use Instagram, how many people you follow, etc. We’ve noticed an uptick in posts about Instagram limiting the reach of your photos to 7% of your followers, and would love to clear this up. Mia Ong’s style = bullet journaling #goals ✔️✍️  Watch her work on her 2019 journal — new to our IGTV channel. https://t.co/jVkWEYJ33S https://t.co/ijUijzWW8M Today on our story: we spend #MLKDay celebrating Atlanta’s civil rights legacy with muralist @artofyungai. https://t.co/1zxuwXOveP https://t.co/N6lx82dBA3 Papercut masterpieces from @parthkothekar, made by hand — and a single sheet. 🙌 See how, today on our story. \nhttps://t.co/2N8HeP7biM https://t.co/tWsYqAkLPr Participate in this weekend’s hashtag project: #WHPwanderlust https://t.co/g2qdNKiQxd https://t.co/4ztqhQSx1B Today on our story and IGTV channel: Go for a literal spin around the world with BMX champion @MatthiasDandois 🌍 🚲 https://t.co/y70BHm3Yot https://t.co/KQHSLcQpcT Today on our IGTV channel, we answer the call of the wild with today's #WeeklyFluff @PugventurePhoto. 🐾 🏔 https://t.co/edJc1hjkhN https://t.co/QHAbCyevTj Through @yannisdavy’s eyes, the colors of Africa and its diaspora really shine. See his vibrant portraits, today on our story. https://t.co/3mDT5AUzkg https://t.co/FgcDHnTPsj Fashion fades, but polka dots are forever. #WHPinspiredby https://t.co/OysznrInc6 https://t.co/ojxSJV0LP0 Fruit-forward even in the wintertime. #WHPinspiredby https://t.co/05llkdths8 https://t.co/FRYZAk6tSV From dreamy to dramatic, in a blink of an eye. Tune in to our story today to see more stunning l👀ks. https://t.co/sd4ZPHLDq6 https://t.co/3oIcKi91bz A real class clown. #WHPinspiredby https://t.co/jTCCUa8h2c https://t.co/3WF7xNif3B A pixel-perfect tribute to Frida Kahlo. 🌹 #WHPinspiredby https://t.co/ynkHrBz8H7 https://t.co/zX9bHNhw2H An umbrella on a clear day? ✔️ An apple in an unexpected place? ✔️ A seemingly infinite ocean paired with a big, blue sky? ✔️ #WHPinspiredby https://t.co/aQ6G3KEFlz https://t.co/FSMFkmgxPT Check out today’s story and our IGTV channel to see some of juggler Lucas Adverse’s craziest tricks. 🏏 🌀\nhttps://t.co/Nr9QoWatRo https://t.co/fl9lDPwPRY Today on our story: 100% recycled materials + infinite imagination = original upcycled looks https://t.co/kqBJDXVTLK https://t.co/dWVwnvU4eE Eggcellent work here. 🙌😂 https://t.co/EiP6B8jgra For Marie McGrory’s project #closedeyegiraffe, there are two rules: 1) draw a giraffe and 2) close your eyes. Learn more on our IGTV channel! \nhttps://t.co/G9Li6Rak7e https://t.co/vUoCjlfkTq Participate in this weekend’s hashtag project: #WHPinspiredby https://t.co/ElXfeh3NRc https://t.co/sjW87FmPLW Today on our channel! Check out IGTV Gold = videos we found (and loved) this week. https://t.co/ZjaIAePrHY https://t.co/EGCvyKXEQH When your crush asks if you’re well-rounded. See more of Goma, our #WeeklyFluff, today on our story. https://t.co/RgpKxgfVwg https://t.co/50NeOBuqlt The perfect surfing spot, according to dinosaurs. 🏜 🏄‍♂️ 🦖 \n#WHPunexpected https://t.co/8L3hzRUiwf https://t.co/kLrqpmyJ3r Now for a real dog and pony show. #WHPunexpected https://t.co/D2iYgNbhz6 https://t.co/6ta4eB0REa Just keep dreaming. 🌷 #WHPunexpected https://t.co/yTjzLmWGXM https://t.co/8MduFAwV3f “I want to celebrate ordinary cooks, because they cook every day for love.” —Vicky Bennison 🍝 Check out our IGTV channel to watch Italian grandmothers hand-make pasta. https://t.co/yva5H2oCat https://t.co/9ngdcM4nFg 🙃 #WHPunexpected https://t.co/4ZA26eaVtW https://t.co/kprltwCj0P Wow, they really went overboard. 🛳 #WHPunexpected https://t.co/gzHfPSUh3X https://t.co/A0fRLgh7Em When the temps are freezing, we all can use a little pick-me-up. 🐶 #WHPunexpected https://t.co/maccYIWDQV https://t.co/VguPqCwVtD Congrats to @ClemsonFB! Scenes from the #CFPChampionship are up today on our story. 🏈 🏅 https://t.co/Jn56qea2Ru https://t.co/8DDIvasLpt ✨Tonight on our story: we’re at the 76th Annual #GoldenGlobes with actor @Lupita_Nyongo✨https://t.co/EaJzwsyvIe https://t.co/D2T8T0ZR4n Participate in this weekend’s hashtag project: #WHPunexpected https://t.co/CI9dSQHl90 https://t.co/thIM0Erf9U This makeup tutorial from @mooselovesu is what we call a showstopper. 🤩 https://t.co/KLukEak2RP https://t.co/Nk96PmmE4p Behold! The daring stunts of Ojirou and Kintarou star in today’s #WeeklyFluff. 🐦🐦  https://t.co/MFEkYjlTZI https://t.co/9MqNEweEXm Today on our story and IGTV channel: drizzling slime creations to help you chill out. #ASMR https://t.co/ltq0YGqyT0 https://t.co/KuwT14XR75 Steffen’s New Year’s resolution is to catch a flight. Literally. 👋 🛩 #WHPresolutions2019 https://t.co/9BQyNq1ADS https://t.co/8Nm4rYSOnc Step into 2019 and follow your own path, wherever it may lead. 👣 #WHPresolutions2019 https://t.co/RsBHZhqKhr https://t.co/CRvCe7Ar66 Cayenne’s new year philosophy: Never pass up an opportunity to enjoy the here and now. 🌻 #WHPresolutions2019 https://t.co/FRft9KWazP https://t.co/tKE4n1nf1F Share the love in 2019, rain or shine. #WHPresolutions2019 https://t.co/SwkXTyTiGO https://t.co/yfao4F1Rm2 New to our IGTV channel: 🌊 head underwater with free-diving photographer and filmmaker @mishkusk 🐋 https://t.co/UPOJap67ER https://t.co/KV0j7uRxrF ✨ If you’re in need of some resolution inspiration, check out today’s story to see @jovanarikalo’s surreal photo illustrations, and learn about her 2019 goals. ✨ https://t.co/QX1vYGIM6j https://t.co/x0aJHirEVg Participate in this weekend’s hashtag project: #WHPresolutions2019 https://t.co/S7St8pU4An https://t.co/FpqreRDOSI Ready to taste an oh-so-natural 🍝 🌈 from Linda of @SaltySeattle? Watch the recipe tutorial, new to our IGTV channel. https://t.co/nMs9l7I8vx https://t.co/skb7XhAknO Tiny @NorbertDog brings big joy as a volunteer therapy dog. #WeeklyFluff https://t.co/ZvIboNs7P2 https://t.co/ImlzhTk6Er New to our IGTV channel: we’re hanging out (and working out) in Byron Bay with @chrishemsworth 🏄‍♂️ ☀️https://t.co/mDjYqqMxP2 https://t.co/1R6ztdmvPw Due to a bug, some users saw a change to the way their feed appears today. We quickly fixed the issue and feed is back to normal. We apologize for any confusion. Bring home the kindness. ❤️ 🛒 #WHPmagical https://t.co/45Gxux3pfW https://t.co/2AsjztWhjr Now THIS is how you do festive attire.👇👏 #WHPmagical https://t.co/QhNE78xZog https://t.co/1ZYXHc0d8E Spotted: Rudolph enjoying some much-deserved time off. 🦌 #WHPmagical https://t.co/Zup5S83y8j https://t.co/QsPcKli3WL Today on our story and IGTV channel Raymond Tan is mixing up some tasty #Christmas no-bake treats. Tune in to get in the holiday spirit. 🌲 \nhttps://t.co/hft7YcZR9V https://t.co/eSFUYUFmHZ Watch makeup artist @laurabradymua apply a look fit for a winter queen today on our IGTV channel. ❄️ https://t.co/KUvHM03G5h https://t.co/c9PAfDeIn2 Today on our story: watch paper-cutting artist Noe Arata at work. ❄️🌟https://t.co/XQX1L1bZyO https://t.co/AXODCGNJda Participate in this weekend’s hashtag project: #WHPmagical https://t.co/eAwYNAHwjc https://t.co/CMwmOmZXP0 Today on our channel! Check out IGTV Gold = videos we found (and loved) this week. https://t.co/yy0AiWvRIr https://t.co/zMbmq3drUT ‘Tis the season of this: 🎄 🙀 #WeeklyFluff https://t.co/uotaNxX7AM https://t.co/mbRw9S3eG1 Introducing GIPHY stickers in Instagram Direct. Tap and hold the GIF button to send one. https://t.co/pYxg827qIf “I feel like I’m riding on a wheelchair like a BMXer is on a bike or a skater is on a skateboard. I’m not confined to it. I’m just kind of having fun with it.” —Professional #WCMX rider Aaron “Wheelz” Fotheringham https://t.co/tm9XrUeiVm https://t.co/CCG6HY2yiD When you make new friends all over the world who love the camera just as much as you do. 💯 #WHPjoyful https://t.co/QrUSlpS4tk https://t.co/DHk0yeAJhz Fairy-tale vibes in the Amsterdam Forest. #WHPjoyful https://t.co/FL4Zw1RiEf https://t.co/bDosENwBVH 🎼 You can now use the Questions sticker for music recommendations! 🎧 Learn more here:  https://t.co/kHz7Mfc6Tj https://t.co/ZcUgjNA8Fy Step into Natalia Seth’s dreamy, whimsy scenes — today on our story 🌈 ✨ https://t.co/6Pw4kbRyCK https://t.co/k4MPQ6tfvw Ah, yes. A tower of sheep = pure #WHPjoyful 🐑https://t.co/GIJKjFa7bD https://t.co/S3KNqriZVw Don’t even TRY to rain on Bronte’s parade. #WHPjoyful ☔️ https://t.co/1IxHdicMrr https://t.co/WkUegwY2bd Looks like Great Dane Elliott can have the time of her life anywhere — even on a long car ride home #WHPjoyful https://t.co/0X1SHX0rex https://t.co/2VLpt3UFzn 🍕 Introducing the countdown sticker: a new way to count down to any moment with friends in stories. 🍕 https://t.co/kHz7Mfc6Tj https://t.co/SSJa44fLnA Watch Toru Tsuchie craft a batch of his artful wagashi: traditional, sweet, intricate Japanese treats. https://t.co/BeeGa15dGA https://t.co/ZxOKXtXR44 Interact with your interests in new ways on Live starting today: https://t.co/kHz7Mfc6Tj https://t.co/XR4RYNFdwO “If you think a rainbow cut crease looks awesome, chances are other people will too!” —22-year-old artist and creator Eleanor Barnes, aka @babysnitchery 🌈 https://t.co/GbxEze5BR7 https://t.co/uvSmgSUMgH Check out these powerful portraits from “Both Sides of the Veil” — a project from photographer @jakenaughton. https://t.co/CKwzuafKl0 https://t.co/yoazWZowq8 Today on our story: the very fashionable Kuo family’s holiday card photo shoot in San Francisco 🎄 ⭐️ https://t.co/KJaSfbe2OG https://t.co/mVSruHnnVU Now you can add people to an ongoing video chat in Direct. Just swipe up while you're chatting to add more friends and keep the conversation going. https://t.co/is1Zyqjrr3 Today on our story: we’re with the one and only @MichelleObama. Tune in to see Mrs. Obama in conversation with 16-year-old speech activist @riyakatariax #IAmBecoming https://t.co/4nnpsAIi2d https://t.co/Y83PXwzOEc Participate in this weekend’s hashtag project: #WHPjoyful https://t.co/Cu3T69sjle https://t.co/cpYSSt38m8 “My video work is all about playing with perspective.” —Video creator Ari Fararooy ⚡️ See more of Ari’s mind-bending work today on our story and our IGTV channel. https://t.co/dLPx3lAtJb https://t.co/1jRxk8litm 👋 See ya, 2018! 👋 Head to our IGTV channel now to see the top trends and defining moments of 2018 on Instagram. 📺https://t.co/aADgWgCy9o https://t.co/AUn7ApT7df 🚨 TREND ALERT 🚨 Here's some of the top hashtags and trends of 2018 on Instagram! https://t.co/LQTwMa3qnd ❤️ https://t.co/WiOblIdX97 A red escalator + confusing reflections = #WHPNaturalLight https://t.co/tZe1Hp6e1t https://t.co/vUSlevnYn4 #WHPNaturalLight shows up in an unexpected place. 🌊 https://t.co/oTiZEtZE2C https://t.co/ywxaQB1pqv Feeling free in the Swiss Alps for a very special December edition of #WeeklyFluff https://t.co/xVsEef3Er9 https://t.co/14O9TnxZeD Introducing the #InstaGiftGuide! Live now. Hashtags (like #catsofinstagram) 😻 and brands — two important elements of the Instagram community — are coming together to bring you the ultimate holiday shopping guide. Check it out here: https://t.co/6LtaIjDyLX https://t.co/rkR8xN6hxz A bike ballet 📸 for #WHPNaturalLight https://t.co/bp3qA8mwEP https://t.co/0jAN4vDvGk Stretching out with a once in a lifetime shot for #WHPNaturalLight 🦊 https://t.co/1EpzSAvOtp https://t.co/zJw0TDwv2V A drone-powered (double-take-worthy) #WHPNaturalLight submission https://t.co/f5V3Ajcxco https://t.co/DFuICMsVfG “Good design for everyone!” = Baleen Jewelry’s founding principle 🛍 They’re one of the businesses included in our first-ever #InstaGiftGuide https://t.co/Igr45rxrX7 https://t.co/baGwXnKJTr RT @GMA: A @GMA EXCLUSIVE: It's the first-ever @instagram holiday gift guide! The #InstaGiftGuide matches popular hashtag trends with gifts… Tune into @GMA tomorrow morning at 8:30 AM EST! Head of Fashion Partnerships @evachen212 has an exciting announcement that combines two staples of the Instagram community. 🛍 https://t.co/PYjGb5iHdy Starting today, you can send voice messages in Direct. Talk the way you want to be heard, whether by whispering what you’re up to or shouting a compliment. https://t.co/3rkdQneNXO Today on our channel! Check out IGTV Gold = videos we found (and loved) this week. https://t.co/DlYYhqQZ4L https://t.co/P8eet0Zmm4 Greetings earthlings. It’s time to meet 7-year-old kid astronaut and first-grader Harrison Sheldon of #smallstepsaregiantleaps. 🚀 See more on today’s story. https://t.co/c9OLPmQzBM https://t.co/CALfUBm4nJ Participate in this weekend’s hashtag project: #WHPNaturalLight https://t.co/Ueoh7z8fnu https://t.co/2t1rCsKl5S We're aware of an issue making bars appear over some photos. We know this is frustrating and are working to resolve it as quickly as possible. “A snail can do anything, and so can you.” —Artist Aleia Murawski 🐌🖤👽 https://t.co/Y3xQKl7eaA https://t.co/EuocIrGfSd Rising to the occasion for #WHPLayers https://t.co/sP1SjvLPM7 https://t.co/NXxoPpzav8 Hiding out with Sprig and Willow 🤫 #WHPLayers https://t.co/RyoBHTn1mI https://t.co/2AeYIoicWu 🗻 #WHPLayers https://t.co/7lsJNBePxj https://t.co/N05eIUu6db We’re playing on the beach with Pingo and Nina — Dalmatian pals who live together in Rio de Janeiro. #WeeklyFluff\nhttps://t.co/kIyw5Vqnxg https://t.co/y5m2SAwE24 A quiet (eerie) moment of contemplation for #WHPLayers https://t.co/uJu2IDxD24 https://t.co/CnaIP3HboE 🚂 Looks like the #WHPLayers train is rolling through! 🚂 https://t.co/vhF7atK3kT https://t.co/PP05gfqcaB “This is the amount of cats I’ll have in the future if I don’t get a girlfriend right now.”  😻 #WHPLayers https://t.co/C4I54eu3z2 https://t.co/8NtoxFCmbL “Makeup has definitely helped me realize who I am and who I want to be.” —Vlogger Ivan Lam💄💋 Check out Ivan’s #howtoselfie tutorial on today’s story https://t.co/o0u8VcTqAi https://t.co/n8BS5xmMls Excited to be part of #F8, @Facebook's annual developer conference, on April 30 &amp; May 1, 2019 in San Jose, CA. Sign up for updates at https://t.co/XjfEQ65Phm. https://t.co/XXLaYmCgTT It’s #Hanukkah! To celebrate, we’re in the kitchen of Miami bakery Zak the Baker, making babka with...Zak. Check it out on IGTV now. https://t.co/iC80SUaq9x https://t.co/rjuwmFc0Ef “Self-made things are more special and valuable.” —Illustrator, designer and #DIY enthusiast @iraville_de #DIYnachten https://t.co/2Bzitqi6kv https://t.co/5nbsUb7313 Participate in this weekend’s hashtag project: #WHPLayers https://t.co/DPcPEjoids https://t.co/v9Rl57WSwD Starting today on stories: you can make a close friends list and share with just them. Learn more here: https://t.co/x111mq6ANS https://t.co/fzlGFX4dHM Today’s #WeeklyFluff = Non 😻https://t.co/5PIlSBXKln https://t.co/SBMOUEhtDf Today on our story and IGTV: #oddlysatisfying #ASMR chalk videos https://t.co/y3Y2Q9Z1GL https://t.co/3Xnp43gTbJ ❄️ “Ivy on the rocks, shaken not stirred.” #WHPsquares ❄️ https://t.co/0RDY05upBX https://t.co/4772jvKgIL This box fits squarely in the middle of a Hong Kong high-rise. 🏢 #WHPsquares. https://t.co/MTMlDGEeEA https://t.co/24o8yzJTYC Cat at home or “elegant cabaret dancer”? You decide. #WHPsquares https://t.co/KgNKEuDZS3 https://t.co/kC5eR9atgT “Creating a space to be silly and fun and bringing people together is really the most rewarding part.” —Aria McManus, founder of Downtown Girls Basketball 🏀 ⚡️ Learn more about the team on IGTV now. https://t.co/vpiOMOidhs https://t.co/c0tTI3QRF4 RT @abilitymag: Instagram has introduced improvements to make it easier for people with visual impairments—automatic alternative text so yo… We’re also adding a new custom alternative text field to photos so people can add richer descriptions for those who use screen readers. These are just first steps to building a more accessible Instagram. We’re proud to improve Instagram for people with visual impairments. Starting today, we are automatically adding alternative text to photos on Feed, Explore and Profile so people who use screen readers can hear what’s in the photo. https://t.co/IRsiw8F23V Doing a double take for #WHPsquares https://t.co/hOZuIzIbfk https://t.co/cqOYPUzM8V The perfect natural frame in Hakone for #WHPsquares https://t.co/nqdZLJWtph https://t.co/D5TI3lz8iP Looks like Lizzie the golden retriever had no problem posing for #WHPsquares. (P.S. Treats were involved in capturing this shot.) https://t.co/oTJAdzaNrs https://t.co/0ijG1MPHHr Watch Japanese chef Takehiro Kishimoto transform an 🍎 into a🌹. It’s new to our IGTV channel. 📺 https://t.co/9jTnPEUdst https://t.co/ZNClTP1avX 🍳 Let’s get cracking! 🍳 Check out edible egg art from @The_Eggshibit on our story right now.\nhttps://t.co/17Rptti3ig https://t.co/kiMEcqiYkW “Be real and be true to who you are and what you believe in.” —Bryr Clogs-maker and small business owner Isobel Schofield 💚 Watch as Isobel and her team construct a pair of clogs on today’s story #SmallBizSat https://t.co/hKugFktnvN https://t.co/jedVVAOpXp Participate in this weekend’s hashtag project: #WHPsquares https://t.co/nqZXcs2O8v https://t.co/6rXqpbgAHI Check out the scene from @evakosmasflores #Thanksgiving kitchen — today on our Instagram story. 🦃🍁 https://t.co/34HGXZXoAg https://t.co/PBpyJO9wNG 🙌 🙌 🙌 🙌 🙌 #WHPcommunity https://t.co/rYbX80auY2 https://t.co/llICrZJ1kZ Bookish 🦋 wings take flight for #WHPcommunity https://t.co/Q3p6vXaD3J https://t.co/cUWbl0H6KQ “When you are very tired and your friend helps you...” #WHPcommunity https://t.co/8SFmFb18Ly https://t.co/Ia2ywGrbsk Today’s #WeeklyFluff = a family of 10 cats who hail from Hokkaido, Japan https://t.co/B7IgldJkdQ https://t.co/J1QbrvRkpr 🚨 TREND ALERT 🚨 #Thanksgiving = time for pie. So, here's a pie chart of the most popular pies posted on Instagram this week. #nomnomnom https://t.co/FMoVhCHhqX A helping hand makes all the difference. #WHPcommunity https://t.co/9OKwbZBu2K https://t.co/eWIJ4O4dKn When in doubt, go on a good walk through the trees with a good friend. #WHPcommunity https://t.co/hfg6hhAt3H https://t.co/KwXW1VK7K4 Pro tip: make your own sunshine #WHPcommunity https://t.co/5YvzRkusOb https://t.co/25lV3zps4b “I have this special ability with my talent as an artist to tap into emotions, because that’s what art does.” —Artist Zaria Lynn 💙 Learn more about Zaria’s pastel work today on our story and our IGTV channel https://t.co/nD9rp6lYgv https://t.co/Bgtvbt5eoD We know some people are having trouble accessing Instagram right now. We know this is frustrating, and we’re working to resolve the issue as soon as possible. Today on our channel! Check out IGTV Gold = videos we found (and loved) this week. https://t.co/8uR8Utg2IQ https://t.co/iHGTFFA7de Today on IGTV, we’re with photographer and creator @BryantEslava 🌟 Tune in now to go behind the scenes with Bryant on a shoot. https://t.co/cKWljn0Ncf https://t.co/bDL3DsY071 Participate in this weekend’s hashtag project: #WHPcommunity https://t.co/cQ4xBsodUW https://t.co/FbzWP9iUVK Hello, world! Meet this little piggy named Stella. #WeeklyFluff 🐷 https://t.co/8lNH1vEp2L https://t.co/S44iRzGW9T RT @TODAYshow: This holiday season the shopping rush is coming to your social media feeds, as tech companies roll out new features making i… Tonight, we’re in Las Vegas with artist Bad Bunny for the Latin Grammy Awards. Check out our story now to go behind the scenes. #LatinGRAMMY https://t.co/JNEkEzNCGT https://t.co/F4mZJ4HD9k Current mood: all things fall #WHPseasonal https://t.co/agytYCMFw5 https://t.co/ocmnuAro9g 🧡 🍂 ✨ #WHPseasonal https://t.co/XUyHc4j1Wz https://t.co/L0D7Ssk1RG Bed head, pajamas, curiosity and Detroit's first snow fall of the year combine for #WHPseasonal https://t.co/TwWnv3DtsK https://t.co/PIGGvLVu4x It’s now easier to let your friends know their story is 😍 or 🔥. Swipe up while watching a story to send a reaction in Direct. https://t.co/RVuE7dedpq Today on our IGTV channel: we’re on set with the stars of @netflix’s “Riverdale,” talking all about their firsts. https://t.co/JQuv7pWvTX https://t.co/vduJxJYCsb 🍁 Change your perspective = #WHPseasonal inspiration 🍁 https://t.co/Slc9A7iXXy https://t.co/yTAOvrHM8f A five-hour hike in the Swiss Alps made for #WHPseasonal magic. https://t.co/42Pafzb08T https://t.co/3som8tVEWP A very cute 🐶 peeking out — or hiding away — from the rain and cold. #WHPseasonal https://t.co/DnhRzbdwTo https://t.co/Z9pfsSPEm8 Head to our story to see the templates artist @patricialeda created for #WorldKindnessDay ❤️, then spread some kindness with the people in your 🌎. https://t.co/HaDRvClwck https://t.co/2hgj4ol7y5 “Flipbook-maker guy” Ben Zurawski is living his childhood dream job. See more of his work on today’s story https://t.co/wRcq8rZi6g https://t.co/ZMpehucUUp Today on our story: meet human (plus blogger, writer, photographer, workshop teacher and speaker) @leefromamerica 💕 and learn about her self-care practice https://t.co/dbTTPkMfDV https://t.co/KHty8rj5js Participate in this weekend’s hashtag project: #WHPseasonal https://t.co/SppxfgleQo https://t.co/8EKH6cyriN Today on our channel! Check out IGTV Gold = videos we found (and loved) this week. https://t.co/NUNZleUNKV https://t.co/EV8HiLaAo3 Check out today’s story to see what #Diwali was like for photographer Vineet Vohra 📸 https://t.co/FZMQz6HqLU https://t.co/feNsFTlPZA Go behind the scenes with @missjaydenb as she films a dance tutorial. New to our IGTV channel. https://t.co/Z4xYmLam7E https://t.co/wsv5E8kPtI 💕 https://t.co/qRFLuGSdo4 “I absolutely love places that make you and your problems feel tiny.” #WHPscale https://t.co/qlwAd60NpK https://t.co/OMMHcaYdUe A sweet reminder of summer for #WHPscale https://t.co/g4yhMh0i24 https://t.co/UZiOYQVEHb World, meet Loulou! #WeeklyFluff https://t.co/sy0NvjZhOd https://t.co/jtx78uqPlR Lost among giant flowers and sparkling lights for #WHPscale https://t.co/X0mlLy83jR https://t.co/DaBcwWCgxt I spy a sandy tail? Or a giant furry❓? #WHPscale https://t.co/mMjCR2NiiI https://t.co/Ba14Crxl5y Need a Monday pick-me-up? Take a break with some #ASMR magic, on our story right now. https://t.co/lRobMAI34x https://t.co/Rb54PQYoJt “Bullet journaling is for everyone.” —@studywithinspo 📓🌻 https://t.co/PDdisII4ZZ https://t.co/NsWjlICe0v Participate in this weekend’s hashtag project: #WHPscale https://t.co/RnbCDWWOkS https://t.co/0mZj32I7WL Today on our IGTV channel, we're behind the scenes with creator @Paugalindo. Tune in to see Paula share a makeup tutorial for a fresh autumn look. 💕 ✨ https://t.co/u9kgctld8t https://t.co/P0hZtdbc8A Celebrating Día de los Muertos on Instagram. Thanks to all the community members coming to Instagram to share this tradition and keeping the memory of their loved ones alive! #DíadeMuertos https://t.co/orlL6uBcBb Is your 'ofrenda' ready? These are some of the most popular hashtags and locations for Día de los Muertos in the US https://t.co/7ZmyQpaS9S Today, we're celebrating #DíaDeMuertos with the one and only @ElJuanpaZurita! Check out today's story and our IGTV channel. 🌹💀🌹 https://t.co/tK7FaSaHc8 https://t.co/Bz5FiNmgT0 Now you can share your favorite IGTV videos to your story. Tap the paper airplane at the bottom of the video you want to share. When friends see your story, they can tap the preview to watch the whole video in IGTV. https://t.co/oaatUoOqZY BOO. 👻 🏀 #WHPdressup https://t.co/AD7oqEc1vq https://t.co/7X7fKM3k8Y Trick or treat? 🎃 https://t.co/5ToT3gbDhb https://t.co/gA7dbYArrh Time for a quick dance break before meeting with the coven. ⚡️ https://t.co/O7tPFs2JYZ https://t.co/QCgf4VqCQ4 Today's special Halloween edition of #WeeklyFluff stars Maymo, a beagle with a proficiency in doggie disguises. https://t.co/EvCQzMFWqJ https://t.co/61BVyzE7MP Ooooh! A sweet, spooky, “scare-wee” submission to #WHPdressup. 🦇 https://t.co/huTqSfsYFU https://t.co/f4cVbXFU7Z 💀 ☂️ #WHPdressup https://t.co/yAsi80m7Ek https://t.co/nEpDY7RMHJ “If you've got it, haunt it.” #WHPdressup 👻 https://t.co/9fvHKMdZ3g https://t.co/St5lfZyqT9 Watch baker Samantha Chiu design and bake Halloween-themed creatures today on our story. https://t.co/1vH1IxmB5Q https://t.co/iIygjcjMgC 🚨 TREND ALERT 🚨 These were the top posted costumes on Instagram last weekend for #Halloween https://t.co/7g6FJxpipb Body painting takes on a vivid life of its own in the spooky, beautiful work of @rupschana https://t.co/9UJD9U30y2 https://t.co/8hpo6kto9l “Bliss has a new favorite toy: an actual cotton ball. ☁️” #NationalCatDay\nhttps://t.co/0OEXpmE0ih https://t.co/AAbyqpER8A “All I see is a good-looking cat in the mirror 🤔😂 #NationalCatDay” https://t.co/LD3dB6fajZ https://t.co/S4D2qaobJR Spooky AND soothing #Inktober illustrations from Theresa Le  — today on our story.\nhttps://t.co/Gw5ONWBNq1 https://t.co/mEBetFc9oy Today on our channel! Check out IGTV Gold = videos we found (and loved) this week.\nhttps://t.co/Z6YpyKHiJf https://t.co/BrpDOkyGkD Participate in this weekend’s hashtag project: #WHPdressup \n https://t.co/nY3RMHDXfn https://t.co/w5LCrIR5VC Today on our story and on IGTV, we're behind the scenes with @anwar, who is known for his (really) funny videos — including one-star product reviews.🌟https://t.co/ZHacP7WuTU https://t.co/gLadZA4XM8 It's time for #WeeklyFluff! Meet the oh-so-lovely Luna. https://t.co/XYxotYPsu3 https://t.co/B0caUVViQ4 “I guess I was born to do this!” —DJ and producer Peggy Gou ⚡️ On today's story and our IGTV channel, go behind the scenes of @ADE_NL with Peggy. https://t.co/lUUHKdo0Ct https://t.co/cUIMfYUqGm It's time to 🌅 on #WHPmirrorimage magic. https://t.co/y9FJ04G6nq https://t.co/mrslTD6GUk Taking a look from a new perspective for #WHPmirrorimage https://t.co/dsSD7wWzNk https://t.co/lagOgYjgH5 Starting with the man in the #WHPmirrorimage https://t.co/eAbmC2ZPdF https://t.co/JezjCMOpG4 Sister, sister! #WHPmirrorimage https://t.co/YZXUO7yzWs https://t.co/HqFsGSrf8v A Shiba Inu that's (almost) too cool for school #WHPmirrorimage https://t.co/yhFsTEO7fH https://t.co/CWOs2XtEP0 “It's good to remember that not everything, or anyone, is always how it looks outside. Don't you agree?” 🙃 https://t.co/gbT9neUlOd https://t.co/lipShd6pVR RT @SoundCloud: Say goodbye to screenshots 📱 Start sharing your music discoveries from SoundCloud directly to your Instagram Stories - what… Now, you can connect with even more of your friends. Up to 6 people can video chat in Instagram Direct. Learn more here: https://t.co/FexaCdjcNF https://t.co/JFZEVLVSE1 “I hope to give voice to the issues that are unheard and unseen in the world.” —Student and photographer Tahia Farhin Haque 📸 Check out today’s story to see more of Tahia’s work from #ThisIs18. https://t.co/3z4JJmoCzq https://t.co/Xfwzekh2Dm Participate in this weekend’s hashtag project: #WHPmirrorimage https://t.co/oEgyHg4ojI https://t.co/Klw2lmuhgp It’s time to ebb and flow in the studio with artist Suzanne Saroff. Check out today’s story to see her photography come to life. https://t.co/FKyfFc5ZuY https://t.co/Ux3rXfUiCh Meet today’s #WeeklyFluff, Juno. His human calls him “the George Clooney of cats.” 😻 https://t.co/HzZEA99fe6 https://t.co/8cXuIRdACB Shelter from the storm ☔️ #WHPkindness https://t.co/AUX3MDdOlo https://t.co/q04lIVCZrs 🐎 💛 🍎 #WHPkindness https://t.co/cTZthiAcxm https://t.co/bwqfCdLZTw 🌈 A “sweet sibling moment and the awe-inspiring beauty of nature” documented for #WHPkindness 🌈https://t.co/Kf1xcq0y1O https://t.co/Q800OZ1kSr On our story and on our IGTV channel: handmade craft artist @maplelatte_m mixes up a mini meal that (almost) looks real enough to eat. https://t.co/BOrOqHIsRz https://t.co/yP4fGApvs2 Ah yes, the bond between a man and his... goose. #WHPkindness https://t.co/f4XG9hGYIv https://t.co/VJ0VjfFZGb Lending a little love and big lick 👅 #WHPkindness https://t.co/hLJ9EcJxvH https://t.co/2JiXjX1CCN ❤️ Spraying all the good vibes for #WHPkindness ❤️ https://t.co/sOZdophBYD https://t.co/gpZhSRpxmE To celebrate the tip off of this year’s @NBA season, we’re at home and on the court with basketball champion @StephenCurry30. Check out today’s story and our IGTV channel. https://t.co/TokDvoQS41 https://t.co/xDAe9gM6zH The big reveal. 😱 🍞 Update your app now to watch our IGTV channel and see Ran bake her bread in her Tokyo kitchen. https://t.co/9ISNSrG9yp https://t.co/pfNgrGKKMz Prepare for your cares to wash away with these #ASMR sponge sounds from Peggy Clarke. Today on our story and new to our IGTV channel. https://t.co/dUnoYtAm4D https://t.co/sQmQ07Zk2B See what life is like for 19-year-old chef @diningwithflynn who lives and works in NYC. https://t.co/8FFXUWEMNf https://t.co/aWdt1Lrb2c Participate in this weekend’s hashtag project: #WHPkindness https://t.co/BlUVHxWuX4 https://t.co/TcW7abBPe9 Today on IGTV: we’re on set with Misty Copeland (@mistyonpointe) filming “The Nutcracker and the Four Realms” https://t.co/UBmfmkhoa9 https://t.co/rLZo3TApBk Today on our story: we’re hanging out with the one and only @Malala! Tune in to learn about some of the latest and greatest moments and people in her life. #DayOfTheGirl\nhttps://t.co/XDpSbiMUqo https://t.co/SlvQc33DyS RT @girlslifemag: Another important step in the battle against bullies. cc: @instagram @maddieziegler  👏🏽 👏🏽 👏🏽  #kindnesscounts https://t.… Today’s #WeeklyFluff = all about Frenchie smiles https://t.co/BBh0yMGpM4 https://t.co/GSKf3ed6oK “The kindness and sense of community that I met at @Hypefest was far beyond what I expected.” —Photographer Angela Owens 📸 See what the vibe was like last weekend in Brooklyn on today’s story. https://t.co/ZkmTMJCUYT https://t.co/OLrwK4n6aF “Usual but unsuspected” 🌬 #WHPunusualportraits https://t.co/ciRSLmYT0S https://t.co/ibi4anizsa Meet German shorthaired pointer Lal, who took on a new persona for #WHPunusualportraits: “Lalpolean!” https://t.co/54uKvAeW57 https://t.co/bs1isYa18j A perplexing playground photo shoot featuring plaid = the perfect place for #WHPunusualportraits https://t.co/41NQmfQYS2 https://t.co/3NotHjlxkn RT @WomensHealthMag: Here's everything you need to know about @instagram's new features. https://t.co/uqrVh1uEMs On today’s story: we’re with @maddieziegler spreading kindness on Instagram — and rocking the new camera effect she helped work on. https://t.co/Cj8Xpnke3T https://t.co/HH8ru1P0wv Today, we’re announcing more tools to help combat bullying. Learn more about these updates from our new Head of Instagram @mosseri: https://t.co/vqByw3XApG Looks like someone is getting excited for Día de Muertos.(Same!) #WHPunusualportraits https://t.co/WndMUGw36J https://t.co/4JoFhnGUw1 Hey you guys. Meet “Fernie Bernie.” 🌿👀🌿#WHPunusualportraits https://t.co/j9EF0G9UcW https://t.co/fSGJbaebLF A strong 💥 shadow stars in this sideways portrait.  #WHPunusualportraits https://t.co/pqYPKYsfES https://t.co/WYmgofegHR “In my opinion, gaming isn’t about gender; it’s all about the fun!\" —German gamer Lisa Thönnissen⚡️ On today’s story: learn more about Lisa and some of her favorite things. https://t.co/rKH0WeKHyJ https://t.co/Jxr6avBWbM Today on our channel! Check out IGTV Gold = videos we found (and loved) this week, including this one from @LiamPayne. https://t.co/TDxhaScFuy https://t.co/qmdAk5h22e Looks like people were loving pink this Fashion Month 🌸👛💓💘 https://t.co/2PuLhdKQsp Participate in this weekend’s hashtag project: #WHPunusualportraits https://t.co/ZlgZASeb6o https://t.co/wKxckVM2Qf Today on our story and our IGTV channel: we’re with Chicano fashion designer and model Sailor Gonzales #HispanicHeritageMonth https://t.co/U5rROB6H9W https://t.co/M4h20YkchF Now you can quickly add friends on Instagram by scanning their nametags. You can also customize your own nametag with emojis, colors and selfies. https://t.co/fq4HFNiDMy For today’s #WeeklyFluff, it was love at first swim 😻 https://t.co/3KluB2aNyW https://t.co/2n7stikLMS Just a little buddy and his dog plotting their next adventure. https://t.co/c7UrxA5Uwe https://t.co/zADvjDx1OT “It matches a moment of silliness, of joy and just brings a smile on my face.” —Lucia Ciolanel for #WHPmatching https://t.co/GmA57w8mKD https://t.co/jLJB1JAHSw RT @REMEZCLA: Meet 5 Latinos doing incredible and important work. https://t.co/86p0IOmKKW Sharing is caring, except when it comes to books. #WHPmatching https://t.co/b1mrHJCAXq https://t.co/KtS22Sc2k5 Every house needs a hat. #WHPmatching https://t.co/13MyTu37Zp https://t.co/BRjUjNqpDh Which one of these is not like the other? 🐶 #WHPmatching https://t.co/Z4785lvqMB https://t.co/KDPmQfLqT2 “I like to think of my Instagram as a journey of me becoming my best self.” —Liz Miu 🥕 Update your app now to watch our IGTV channel and learn how Liz makes vegan granola. https://t.co/maZM2DhbcX https://t.co/oIEyhKvaNn Please welcome Adam Mosseri as the new leader of the Instagram team: https://t.co/adJdxrAh63 Participate in this weekend’s hashtag project: #WHPmatching https://t.co/tsqINJaUHE https://t.co/R0nVCPfTpk We’re behind the scenes at the @Dior offices and the big show for #ParisFashionWeek. Check out our story and our IGTV channel https://t.co/LfY3fW8N8U https://t.co/iU4TSzHj5F RT @THR: BuzzFeed sets interactive Instagram drama 'Romeo Likes Juliet' https://t.co/RBZJrCKmrs https://t.co/WBOLdbPV6r Who’s walking who?! #WeeklyFluff https://t.co/Bnr3jASOk2 https://t.co/6drsquPy8Y Hang out with Hyojoo Ko while she dances on her longboard — today on our Instagram story. https://t.co/nBaZ0WJ95y https://t.co/hPghTW29lB Childhood bliss swings in for #WHPmotion. https://t.co/hphwwX6jdm It’s a 🐴 🐴 standstill in Kolkata, India, for #WHPmotion. https://t.co/uwlOJDeG6i Ciao from Milan Fashion Week with @voguemagazine photographer @MrStreetPeeper. Check out today’s story to see some serious street style. \nhttps://t.co/zlmyiiuRbP https://t.co/TUDGzWPvXQ Today is #NationalVoterRegistrationDay in the US. If you’re not registered, we’ve made it simple with our partner @TurboVote. https://t.co/Qurs2ewuNq A message from our co-founder and CEO @kevin: https://t.co/XWhN0zZj2O We’re all ears for this #WHPmotion mood-lifter.\nhttps://t.co/KdwQAQyRlZ https://t.co/GT09GKA6FB Wait for it... #WHPmotion\nhttps://t.co/roQ80uxImE https://t.co/0jM6Z8woyG #WHPmotion is looking up.\nhttps://t.co/nSunkwzjRk https://t.co/5rLAWkzqTb “The most inspiring moment is when I feel a connection — when I feel their heart and my heart, and there’s nothing that’s really between us.” —Photographer Sara Hylton, today on our story ❤️ https://t.co/07nV8xZ35x https://t.co/66bC5l7Zap The spotlight is on emotions in sweet, short stop-motion videos from @headexplodie.\nhttps://t.co/nBSC3cw5hn https://t.co/RZzQjtozLR Participate in this weekend’s hashtag project: #WHPmotion \nhttps://t.co/oCoYGRVMxc https://t.co/x9GfaUJHtr On today’s story and new to our IGTV channel: fashion designer Richard Quinn takes us behind the scenes of his show at London Fashion Week.  \nhttps://t.co/K0XM9aWhDn https://t.co/dgoQwziNuW Introducing GIFs in Instagram Direct. Message your friends with the perfect GIF or send a random one if you like surprises. Happy DMing! https://t.co/uKocwLaQ68 On today's story! See the sights with 3-year-old Mr. Pokee — the world-traveling hedgehog #WeeklyFluff https://t.co/T0fVy1IGSg https://t.co/adNBNZW0Iu It's here! Now you can tag your friends in the videos you share to feed. https://t.co/NdZ2hLycmz #WHPperspective or #TongueOutTuesday? 🐶\nhttps://t.co/Kffzesv2Ru https://t.co/AAFDiJdpzC The world’s turned upside down for #WHPperspective.\nhttps://t.co/OjdkRBkbV0 https://t.co/Fk3uZDHPRl #WHPperspective spotted in Switzerland.\nhttps://t.co/RUTYKXshXm https://t.co/AiqtMCzrbr When light meets dark, June Noel’s makeup style emerges.💄 Update your app now to watch our IGTV channel and see June create one of her makeup looks. https://t.co/1Alo2Y3GGm https://t.co/JwWCjko5Ne RT @verge: Instagram will use ads to help users register to vote https://t.co/QxtyVFf37j https://t.co/JwdVzp1Z0a No filter needed. #WHPperspective\nhttps://t.co/qasMA8TBcq https://t.co/idV5beh1SV Setting the wheel in motion for #WHPperspective. 🎡\nhttps://t.co/1lctrl8feP https://t.co/oKeCH7osVD Is this a giant eye trick? It’s all a matter of #WHPperspective.\nhttps://t.co/3ap1FXtm3j https://t.co/lCGDBIyjYB Today on our story: We’re celebrating #HispanicHeritageMonth with 15-year-old @tatimcquay, who’s showing us her dance moves.💃 #MiVoz #MyVoice\nhttps://t.co/Xb7BLNSb7C https://t.co/8jviGoghAz Participate in this weekend’s hashtag project: #WHPperspective\n https://t.co/4j2a6ZD0n3 https://t.co/NqNvNLjeYO Today on our channel! Check out IGTV Gold = videos we found (and loved) this week, including this one from ocean photographer Ben Thouard. https://t.co/qEvIojJfmj https://t.co/CBdKVeK36F Hello, world! Meet today’s #WeeklyFluff: Hank, a little piggy who knows how to strike a pose 🐽 https://t.co/09O8SnORsZ https://t.co/AFfMJT88BI RT @NAMICommunicate: It may be challenging to understand new apps and what your kids and teens are doing online. 📲 That's why we're super e… Ride the wave at #SurfRanchPro with surfers @kellyslater, @gabriel1medina and Caroline Marks from this past weekend’s @wsl competition. 🌊 Update your app now to watch the action on our IGTV channel. https://t.co/1WhLi9i5Xr https://t.co/DiePNYAWmi Celebrating Hispanic Heritage Month with our Latino community. Share your voice on Instagram! #MiVoz #MyVoice https://t.co/r0mZedIaNB Today on our story and IGTV channel: We’re behind the scenes with American designer @BrandonMaxwellStudio leading up to his show at New York Fashion Week. 👠\nhttps://t.co/cMEH3omP2b https://t.co/wsBTsolxmL Congratulations to these 5 inspiring Latinos and Latinas, who will be honored with the first Instagram #MiVoz #MyVoice Award tonight during the Hispanic Heritage Awards (@HHFoundation). https://t.co/3wfLF13KAt A window into #WHPdailylife in Mumbai.\nhttps://t.co/YyjPmN9kqJ https://t.co/Z8HvpStCbN I’m (in) a little teapot. #WHPdailylife\nhttps://t.co/I1mOAJZCJI https://t.co/T4gghNaeJu Reflecting on a cloudy day for #WHPdailylife. ☁️\nhttps://t.co/JtZrkNZaEe https://t.co/bGmu4eJTGn Elbow-to-elbow traffic in Taipei. #WHPdailylife\nhttps://t.co/v4kDqEvf3d https://t.co/lc6VSkJZrT The paw-fect position for lounging. #WHPdailylife\nhttps://t.co/oGVT2ZPzwt https://t.co/OhmIAooPdy Wrapping up preparations for the Hindu festival Ganesh Chaturthi in Delhi. #WHPdailylife\nhttps://t.co/qwiDwR8YvZ https://t.co/Fc642hISQg There’s only one way to fix the growing distance between @millselle and her mother. Update your app now to watch our IGTV channel to see a day of Mills family bonding. \nhttps://t.co/KMwczuTwnE https://t.co/pSjgxdnAAW “Dance has the power to break down social and economic boundaries. It’s a universal language.” —@JonBoogz\nhttps://t.co/SZyqtqew4a https://t.co/Z1GNLwv15Y Get out your markers — it’s time to color! Head to our story to screenshot and share today’s templates from artist Jess Weymouth. https://t.co/1MUmowPviv Participate in this weekend’s hashtag project: #WHPdailylife https://t.co/MdIJBY71tP https://t.co/acE7yaeMlq “I think self-love is one of the most important things on this earth.” —Vegan food stylist Lulu Gaffga #SupportHER https://t.co/aAguz1F03i See more from Lulu on our story and IGTV. https://t.co/FMtpKmUzMZ RT @parentsmagazine: Why it's never too early to teach your child good social media habits https://t.co/qpvborX9ZK https://t.co/MUXLvKpR0L Today on our story: Teen journalist @ClassyMalick shares how to live your best Instagram life, with helpful tips on how to stay safe, manage your time and control comments. https://t.co/hiSrnfGXeA https://t.co/gUFYaRJPH0 RT @parentsmagazine: How @instagram is helping you protect your child from social media https://t.co/90br2uitQo https://t.co/JkRmhyjeaG RT @FamilyCircleMag: Teens have a lot of fun on IG, but there are ways to keep them safer on the platform. We collaborated with @Instagram… Today on the @mastersofscale podcast, our founder @Kevin Systrom sits down with @ReidHoffman to share how Instagram went from a simple idea to a community of 1 billion. It's a fascinating story. Listen: https://t.co/sFyYohBvpc That feeling when your favorite emojis are right in front of you 🙌😍 https://t.co/QPF8eGc5yD We feel a great responsibility to make sure Instagram is a supportive community for teens to do and share what they love, and now we have a new resource to make sure parents feel informed and empowered to help guide them at https://t.co/eJlkwDf72r https://t.co/MzmGXWCHyS The world is a blank canvas for #WHPcolorpalette. https://t.co/v4tLYyDWGL https://t.co/H2sUfMmToa Stop and smell the sunflowers.🌻 #WHPcolorpalette\nhttps://t.co/TATR2ssguk https://t.co/YOm3AoZAJu We’re keeping an eye out for Waldo on this striped Spanish beach. 👀 #WHPcolorpalette\nhttps://t.co/ZCQrCmGmgM https://t.co/mTCnWJT3uU Filling the streets with color for a Hindu festival. \n#WHPcolorpalette\nhttps://t.co/AHfn5RAlhl https://t.co/ijDdFjldJm Car palette or #WHPcolorpalette? 🚗🎨https://t.co/NCLiHR2uyA https://t.co/teHaLKCACr Stained glass brings a rainbow of color for #WHPcolorpalette. 🌈\nhttps://t.co/2HSJWH9C2k https://t.co/Ivwlke1yZs Today’s #WeeklyFluff = a girl pack beach date! Check it out on today’s Instagram story and our IGTV channel. https://t.co/wGjCf9wlCX https://t.co/kfZIO451Ra RT @ChicagoBears: Remember these??\n\nEnjoy our first #BearsPopUpVideo feat. @JHowardx24 &amp; @TarikCohen in full exclusively on IGTV: https://t… Participate in this weekend’s hashtag project: #WHPcolorpalette https://t.co/HpFDm98gTT https://t.co/fAAggFiZ3Z Watch IGTV Gold to see videos we found (and loved) this week, including this homage to color from filmmaker Daniel Mercadante. https://t.co/T1BSrmH5nr https://t.co/64r2RadOJi Hello, world! Meet today’s #WeeklyFluff: Rai, a Scottish fold cat who loves nothing more than lazing around. 😸 https://t.co/N3wDnx6ko5 https://t.co/VFVVOHw9Wy Meet Tomoro, who makes pottery using a centuries-old Japanese technique called nerikomi. 🍶 Update your app now to watch Tomoro at work. https://t.co/NpSCKHngCo https://t.co/mlKkbtA7FU “Kawaii is about accepting diversity.” —Haruka Kurebayashi 🍭 Update your app now to watch our IGTV channel to see Haruka’s colorful kawaii world. https://t.co/HU3a6FMLqu https://t.co/pISQ8f6tHL Today, our co-founder and CTO @mikeyk has an update on 3 important steps we’re taking to keep Instagram safe. https://t.co/72cAYCiLGO A collection of “splendid things” from around the world. #WHPstudy https://t.co/WwSkTySKEx https://t.co/8TA3WsFgwG Uh-oh. We’ve fallen in 😻 with this #WHPstudy buddy. https://t.co/ssDaENuuQ5 https://t.co/V68ds9qcrj 🌅 + 📖 - 🌬 = ❤️ #WHPstudy https://t.co/XxxFPhL6yW https://t.co/nUOBO3AnIp “I can just be my authentic self when I’m at Afropunk.” —@JanelleMonae 🎵 Check out today’s story to experience Janelle’s weekend at the festival. https://t.co/noT34wM8MN https://t.co/UQlMrwLVwo We’re back with another round of templates from artist @jessweymouth 🦊 Head to our story to screenshot and share animals of the world. https://t.co/ZkkTDosSNm Participate in this weekend’s hashtag project: #WHPstudy https://t.co/ef9OODmF1H https://t.co/N8XAluEUNQ Head to the German countryside for a gluten-free picnic 🍰 today on our story and IGTV channel. Update your app now to watch IGTV. https://t.co/LWglLj3V4c https://t.co/OuIQcuz72p Instagram: What’s your favorite color? Coco: For now, light purple. Update your app now to watch our IGTV channel and see some of this 7-year-old fashionista’s favorite looks. https://t.co/1D6DHHiWAx https://t.co/wyslXXuALO RT @nypl: We're bringing some of the world's most incredible stories to Instagram Stories with #InstaNovels. Follow @nypl on Instagram to s… Millie and Chloe aren’t just best friends — they’re also cousins and video creators. Watch them make some of their favorite back-to-school snacks on our IGTV channel. https://t.co/f4UOdcfykt https://t.co/YLf3v59aBC Crinkle and Wrinkle take a few laps for #WHPcircles. 🐱 🐱 https://t.co/SWNLOmvRMA https://t.co/M0NVUDOxSh A city scene of circles — say that 10 times fast. #WHPcircles https://t.co/suaTGXsRUY https://t.co/gKTE6beMGw 💕 Love bubbles up for #WHPcircles. 💕 https://t.co/tORxWsFI6w https://t.co/NDlnbqyx4O A timeless toy for #WHPcircles 👀 https://t.co/HD9ra0ULtv https://t.co/2hTU9OZJL9 There’s nothing better than a circle of friends. #WHPcircles https://t.co/I8Rhi429Qy https://t.co/6E8MXg3b5J Mind = blown. #WHPcircles https://t.co/N4GJhEY8Kq https://t.co/98j8nRsf62 Hello, world! Meet Geordi, a Pembroke Welsh corgi with a special talent for agility training. 🐶 Update your app now to watch our IGTV channel to watch Geordi practice some of his skills. #WeeklyFluff https://t.co/sPLerOrXGK https://t.co/sywas8efZ0 Participate in this weekend’s hashtag project: #WHPcircles https://t.co/sqg0u9KYiS https://t.co/nAyRTkTwQ3 Today on our channel! Check out IGTV Gold = videos we found (and loved) this week, including this one from @remymetailler. https://t.co/WjKeuBjBJq https://t.co/IULq2t6Osu Get ready to screenshot! Today on our story: share your favorite things with hand-painted templates from artist Jess Weymouth. https://t.co/EcrdQP2EPJ Meet today’s #WeeklyFluff: two bunnies living their best cage-free life in Sweden. 🐰 https://t.co/N2HsjpCUe0 https://t.co/b6EHDyVH91 “The people are some of the most amazing collectors of not just things, but also experiences.” —@Pharrell 🇯🇵 Update your app now to watch our IGTV channel to join Pharrell as he visits some of his favorite Tokyo spots. https://t.co/nR0US6TbTi https://t.co/Rc5XwUYc4K We are aware that some people are having difficulty accessing their Instagram accounts. If you think you have been impacted, please follow our guidance to regain access: https://t.co/DfHpQuk9SJ Excellent timing, bird. #WHPhidden 👏 https://t.co/iIDwAZbC4J https://t.co/YKNFCC1ajH When the leaves are staring back at you 😸 #WHPhidden https://t.co/TYnWCK6ONt https://t.co/8At8IwlDgX Searching for hidden bunnies &gt; bedtime. #WHPhidden https://t.co/HOxhlwQ9to https://t.co/O3J38zcyps Illusionist makeup looks by Mimi Choi = inspired by Salvador Dali, digital art, textures, patterns... and sleep paralysis. https://t.co/ZcVNZGcuFF https://t.co/0g9CPI8krj Starting today, you can send a poll privately in Direct. Update your app to choose who you want to poll – whether it’s everyone in a big group thread or just your very best friend. Update your app now to try it! https://t.co/Lfr6pwPDzI That feeling when you’re juuuuust too tall for #WHPhidden. https://t.co/PWc7o9xZ34 https://t.co/2SWySncsBZ Good try, buddy! We still spotted you. #WHPhidden https://t.co/PF6qf9gAdD https://t.co/eLBXCzRDWj 🌿👀🌿 #WHPhidden https://t.co/iNoRXBblyk https://t.co/UQOF5GWpJW Celebrate #WorldElephantDay by joining photographer Ami Vitale at @RetetiElephants, a Kenyan elephant sanctuary — on today’s story and IGTV. 🐘 Update your app now to watch our IGTV channel. https://t.co/ajJvntTTEJ https://t.co/EbFInJZZHC Participate in this weekend’s hashtag project: #WHPhidden https://t.co/yRpWftGXyv https://t.co/KjzSH56q3l Love 🌻? Love 🍪? Update your app now to watch our IGTV channel and see how Lori Stern makes her flower-topped creations. https://t.co/wrWVqRa4aA https://t.co/Qra87rlF1b Hello, world! Meet Troja, an Irish setter with equal passion for adventure and snacks. 🐶 #WeeklyFluff https://t.co/qqYt2DZMIQ https://t.co/yjgBG8z1tX RT @lelepons: Thank you for the mention @KurtWagner8 !!! I love Instagram, Instagram Stories and IGTV!! https://t.co/PircjcQNLq We’re w/ @awkwafina and @henrygolding, two stars from the new movie #CrazyRichAsians. Tune in to our story and our IGTV channel now to hear them chat about the craziest things they’ve done for love https://t.co/5LQ1ucpnxp https://t.co/H819gN56Si “#WHPbestfriends is a way for me to show people that the most important person you should always be friends with is yourself.” https://t.co/VjeGxmHl7q https://t.co/6BmDbjIFLR Two pups like peas in a pod for #WHPbestfriends 🐶https://t.co/22XGnKZZfI https://t.co/I81PddKxgu Even superheroes have best friends. #WHPbestfriends https://t.co/CzuLneeESJ https://t.co/bWXmTOeAap 🎶 Today on IGTV: watch @chelseacutler perform at our NY office 🎶 https://t.co/a8GUV8wDlH https://t.co/JmpTsrNBBR Isn’t it the best how hanging with your BFF can lift you up? #WHPbestfriends https://t.co/UFMkhjFgZP https://t.co/4qTwF9O0rS Caution! #WHPbestfriends might cause dizzying levels of fun. https://t.co/zKUa2GIX3l https://t.co/oBnGBc0wXE “Sometimes all you need is a hug from your best friend.” 💞 #WHPbestfriends https://t.co/7rOyO1KWQU https://t.co/0is4VjEsIu Today on our IGTV channel: see anime artist and student Patricia’s process https://t.co/9d2MfQJReI https://t.co/2aXEghA7b4 “Being low to the ground has a lot of advantages!” 😻 Update your app now to watch our IGTV channel and see these two cats put their lil’ legs to work. \n\nhttps://t.co/QoaCPRgX1x https://t.co/8KMsJjbDQ9 Participate in this weekend’s hashtag project: #WHPbestfriends https://t.co/kvATEezrrz https://t.co/SURY196ZmN Crunchy soap curls galore — today on our story and IGTV channel. 🛁 Update your app now to watch. https://t.co/zwKqNiz3lV https://t.co/psD0E91ooJ 🎂 🎉 🎂 https://t.co/1OSHEgWGHm 🥢 + chores + @_fruitypoppin = 😂 Update your app now to watch Karen do some work around the house on IGTV. https://t.co/vFDgSWIdNQ https://t.co/vWbUerHqUE ❤️ Today we're celebrating two years of Instagram Stories! ❤️ https://t.co/Rc7YgbramP Ever heard of a “flair”? It’s a 180-degree backflip, and Anthony Cataldo shows us how it’s done. Update your app now to watch our IGTV channel to watch some of Anthony’s scooter tricks. https://t.co/B7wuzFZ2tw https://t.co/MyRFN9tjQg In the coming weeks, we'll be rolling out new tools to help you manage your time on Instagram and Facebook: an activity dashboard, a daily reminder and a new way to limit notifications. https://t.co/Gti8ztX6kj https://t.co/4LzkI3mjms We’re flipping out for this sunrise #WHPlight submission. https://t.co/zaIAKlvIWh https://t.co/jXrKlGFFdq “Lights will guide you home.” 🤗 #WHPlight https://t.co/AkfH07Yvui https://t.co/LTt49as06B “What? Is there something behind me?” 😳 #WHPlight https://t.co/GIs0HPFrmI https://t.co/IOYPsziQBy 💋 https://t.co/SOmiB5ivdO “Sometimes it’s good to let things go, but just in case, always keep your camera ready.” 😅 #WHPlight https://t.co/wVaWeoCvSP https://t.co/FfVDHuTFPb Grate timing! #WHPlight https://t.co/DwSyZg8hp0 https://t.co/Lgd1ZaMSut Sunset, meet waterfall. We think you’re a match made in #WHPlight heaven. https://t.co/xMFWtJWn5i https://t.co/8SWyrrwc98 Hello, world! Meet seven guinea pigs with a special skill for playing “floor is lava.” 🔥 Update your app now to watch our IGTV channel to spend a day with these piggies. https://t.co/Tw9koxOPrO https://t.co/zNSOIoU4v9 “It’s [Instagram] a place where I can go for much-needed reminders that, despite what mainstream media might suggest, my kind of beauty matters. It’s where I can lose myself in photos that prove there’s a place where I belong.\" 🙌 (via @nytimes) https://t.co/l0PNBgWTeW Check, check, check 🎤🎼 Tune in to our story today to hang with @NERDarmy at @fujirock_jp \nhttps://t.co/MVfsLCHxDa https://t.co/RbFyCvnLKv Participate in this weekend’s hashtag project: #WHPlight ✨ https://t.co/3SAGIcAtac https://t.co/sXL37XvgZW “Color is representative of me accepting myself more and pushing away from all that negativity.” —Photographer Arielle Bobb-Willis 📷 Update your app now to watch our IGTV channel and see some of Arielle’s work. https://t.co/UAZOHgjguD https://t.co/lsqJ7ctMUv “My dream landscape is sitting in front of a campfire next to giant sequoia trees.” —Jess Weymouth 🏕 Today on our story: screenshot and share Jess’ drawing templates from the natural world. https://t.co/cBrYxOv82H https://t.co/Lsirs03Gwy “I hope that I can prove to people that it’s okay to stand out, and that you are never too young to pursue your dream.” —Semsi Salvino, showing off some of his favorite streetwear looks on today’s story https://t.co/w0gmUJDSBP https://t.co/JbVRGq5c21 “Pencil carving is an extremely intense and time-consuming process.” —Artist Salavat Fidai ✏️ Update your app now to watch our IGTV channel to see more of these carved graphite creations. https://t.co/PCK1Ld9bJR https://t.co/dCpvmKeVy4 Meet the zancudos. #WHPlookup https://t.co/Nt4RvZ9Rai https://t.co/uY57npLRAW When a skyscraper and the sky become one ☁️ #WHPlookup https://t.co/W8apnNuZ7a https://t.co/9K4WYHcAjY Who knows what you’ll encounter when you #WHPlookup? 🦒 https://t.co/SicuGrwDsU https://t.co/vCkY8fYNL9 “I like the soft texture of the sand — and the crunchy sounds.” Update your app now to watch our IGTV channel to watch Kinetic Sand in action. https://t.co/wK5NpUtYM1 https://t.co/lJ0V9xRdSt Painting with a flashlight for #WHPlookup 🌳🌈 https://t.co/253llrkyFn https://t.co/mbkcOV7i50 Step 1: Look up. Step 2: Discover the magic of the natural world. 🦋 #WHPlookup https://t.co/dzs2FqphVN https://t.co/BRqg2KvTCG Things are looking up in Australia. #WHPlookup https://t.co/cKSfiXz4So https://t.co/Z81i6jNujw Participate in this weekend’s hashtag project: #WHPlookup 👀 https://t.co/1mm1k1CFjc https://t.co/AjQBraOdpA Dramatic love story or normal day with Pacific parrotlets? You decide. 🐥 Update your app now to watch our IGTV channel.  https://t.co/41j9Ik27YO https://t.co/RjlDwA7Qxt “My drawing and makeup slowly merged into one stream of this really weird makeup style that I don’t have a name for.” —Artist Juliana Horner 🎨 Update your app now to watch our IGTV channel and see Juliana create a new look. https://t.co/UtHnwLlKk6 https://t.co/XG0pe0fEm3 “That is what art is there for: to show how common we all are.” —South African artist Nelson Makamo, celebrating #MandelaDay https://t.co/SGlaKorIT0 https://t.co/bNjYglKxyF Crunch, crunch, crunch! Update your app now to watch our IGTV channel and hear more of this crunchy slime from South Korea. #ASMR https://t.co/LDwpl83LpU https://t.co/8NRc384ljz Just a 3-year-old and her 💐 for #WHPflowerpower. https://t.co/WmH0vEcB9E https://t.co/WCdxPJWyOn “It feels like being a little ant that sits on one of those flowers, looking toward the mountains.” 🌼 #WHPflowerpower https://t.co/aa4JX5yTTu https://t.co/GMEtwWkEVt If these flowers could talk... 🌷 #WHPflowerpower https://t.co/4YljZCjsEb https://t.co/AXihamDBR9 “I love the idea of art moving and breathing. It doesn’t just sit on the wall. It lives.” —Makeup artist @GeorginaRyland, today on our story 🎨 https://t.co/dVEbEJtbk3 https://t.co/WxLe9vuOUg Caution: #WHPflowerpower can result in new growth. 🌞 https://t.co/UPgQNWGUMX https://t.co/dQOM9zFDhv Pollen’s on the menu tonight! 🐝 #WHPflowerpower https://t.co/x65VVu0dYo https://t.co/o1QMno9VDR Getting lost in #WHPflowerpower 🌹 https://t.co/0Ipt0Qnvai https://t.co/Qb35LDjGW8 “There’s nothing simple about simple.” —Master potter Eric Landon. Update your app now to watch our IGTV channel to watch Eric throw a vase in his Copenhagen studio. https://t.co/9QYI0KElOh https://t.co/oz1PladdyX 🌻 Participate in this weekend’s hashtag project: #WHPflowerpower 🌻 https://t.co/wqApCOuogc https://t.co/4BJ76Uvw2P We're aware that some users are having trouble accessing their Instagram accounts. We know it's frustrating, and we're working quickly to fix the issue! The world needs your TV and movie recs. (It’s time for an entertainment GIF challenge from Martina Martian.) 🎬 🌟 https://t.co/Xty65RAcQ0 “A bike is the perfect way to see the world.” —Photographer @jeredgruber, who’s taking us on a ride through Italy’s rugged Dolomites on today’s story. 🚵‍♂️ https://t.co/zXdSQHP2eQ https://t.co/f4OUqH6Oob Meet @lilicanteropy, who hand-paints custom cleats for the world’s biggest soccer stars. (Ahem, Leo Messi.) ⚽️ Update your app now to watch our IGTV channel and see inside Lili’s art studio. #WorldCup https://t.co/XCuY9SGeJN https://t.co/k0BY8V9Tmg Don’t mind us, we’re just finding design inspo in Joshua Tree National Park. 🏜 #WHPjourney https://t.co/PgBJ1uviys https://t.co/LoLKvXxmde ✈️ #WHPjourney — coming in for a landing! ✈️  https://t.co/JDmSTaj3Wk https://t.co/AxDjHbQQaj Dear #InMyFeelingsChallenge we. 😍. you. https://t.co/Hmuh5R5uUD Rainbow tips, anyone? 💅 Update your app now to watch our IGTV channel and see some of @wahnails’ nail art. https://t.co/A052i3Y74l https://t.co/H31u2zp0CI New today: a sticker in Instagram Stories that lets friends ask you questions! Learn more here: https://t.co/Hm71kpOu3y https://t.co/Xy60NAogDA It’s the #WHPjourney, not the destination, for “the Himalayan cowboy.” 🤠 https://t.co/6NOp8owX4C https://t.co/vhvXE90EDY Not all journeys require planes, trains and automobiles. Some just need art. 🎨 #WHPjourney https://t.co/7sv5Tcgtaz https://t.co/QnFZUM059C Destination: Earth 👨‍🚀 #WHPjourney https://t.co/8FjrfF3YzH https://t.co/cf9od2RT5r RT @TIFF_NET: Our #TIFFxInstagram Shorts Festival, celebrating the best 1-minute films in the world, kicks-off tomorrow. Watch + vote ❤️for… Puppies that travel together, stay together. 🐶 Update your app now to watch our IGTV channel, and head to southern France with Max and Louise.\nhttps://t.co/sWeUF1qmdT https://t.co/5ESNxXL6Dz Go for a skate with roller dancer Oumi Dieng — on today’s story! \nhttps://t.co/u8YXFGfHGT https://t.co/4SemMONyEE Participate in this weekend’s hashtag project: #WHPjourney https://t.co/0jsrVvTCBo https://t.co/YKmqOAQeBZ What happens when the @LegendaryShots team combines slow-motion video, water balloons and a baseball bat? Trick. Shot. Magic. https://t.co/ubQb1FDvYH https://t.co/eKw6GANXJE It’s time to “rice to the occasion” with “shadowologist” @vincebal. See more of his art giving objects a second life on today’s story. https://t.co/tOhULvRPxt https://t.co/iixbh9BG6U Gotta catch ‘em all. #WHPrelax https://t.co/gichJhP8ho https://t.co/MeiOkq7fME Just a quick break from the urban hustle and bustle 💃 #WHPrelax\nhttps://t.co/MajCQUhid7 https://t.co/4aWSGxKZjE Hello, world! Meet today’s #WeeklyFluff: Coogi, an 8-month-old shar-pei with rolls on rolls on rolls.\nhttps://t.co/BQW692m4Ej https://t.co/DpiJYTh0Pp ✈️ TRAVEL ALERT: We have a new GIF challenge from Martina Martian ✈️ https://t.co/ntyeJRqfzw Kicking back in the great outdoors for #WHPrelax 🌲\nhttps://t.co/ruunQFefXl https://t.co/sX2ErRxupG Because the ocean’s crashing waves have surprisingly calming effects 🌊 #WHPrelax\nhttps://t.co/uVpxNHh5dv https://t.co/P3gMAvTIRL So, we found a new squad. 🐶 #WHPrelax\nhttps://t.co/2tVnmw6iqz https://t.co/uzXXzaOtet All we have to say is 🤤🍩. Update your app now to watch our IGTV channel to see how @vickysdonuts makes her classic s’more doughnut. https://t.co/GDfqvzznmX https://t.co/vagJtJ06Py “Calligraphy is a really meditative thing. I get a lot out of my work purely from the experience of creating it.” —@masgrimes 🖋 Update your Instagram app now to watch David’s elegant script come to life — today on our story and on our IGTV channel.\nhttps://t.co/fac341EZ3a https://t.co/2CUJJRdZPu It’s time for slime! Check out our IGTV channel today for a DIY slime tutorial. https://t.co/YNS4fCtaAu https://t.co/kko0i2jpof Participate in this weekend’s hashtag project: #WHPrelax https://t.co/gLpvqQrjG8 https://t.co/7lx6aznEkn Love at first flight. 🐶 🚁Update your app now to watch our IGTV channel and take the ride of your life with Bentley. #WeeklyFluff https://t.co/zlm7qNKJXi https://t.co/kJmp6NjiHl “I want to be the person that I needed when I was in the closet, struggling to believe I could be anything I wanted to be.” 🌈 —American skier @guskenworthy, today on our story #Pride https://t.co/RtrMAWzBP6 https://t.co/43AsbiZosa Om nom nom! 😋 Share all your favorite snacks with this delicious new GIF challenge from artist Martina Martian. https://t.co/F1pZhAVgFc “I could eat noodles all day, every day.” —June Quan of @StirandStyle\nhttps://t.co/1AFOABmceU https://t.co/2sslbJWrUr When two (pieces of art) become one. #WHP🌈  https://t.co/5gN2ghAYXd https://t.co/wT1Wc7DhD1 We’ll take all-rainbow everything, please. #WHP🌈https://t.co/kOI0fG1H7e https://t.co/5XEsXCM6sR A well-timed bubble for #WHP🌈 https://t.co/WeaUVpr6oy https://t.co/gV4b9IWjzW You can now video chat in Instagram Direct, either 1:1 or in a group. Learn more here: https://t.co/UxH6D2B7Xa https://t.co/uJ8p7kG6aU Today we’re introducing topic channels on Explore. Now it’s even easier to browse through posts you want to see and accounts you want to follow. Learn more here: https://t.co/UxH6D2B7Xa https://t.co/YEGCDALhFM Fingerboarding: it’s way more than just skateboarding in miniature. 🤙 Update your Instagram app now to watch Cass’ fingerboarding tricks — today on our story and on our IGTV channel. https://t.co/2mDus0jLt3 https://t.co/HFZPle9GXY Puppy love is love. #WHP🌈 https://t.co/7pGltiCDhE https://t.co/6N0NLETAqa “Isla loves that the rainbow symbolizes love in all its forms.” #WHP🌈 https://t.co/xZX8R9opwe https://t.co/P7HwV1yCgo Color pours down Niagara Falls for #WHP🌈 https://t.co/9lu0isRKSe https://t.co/3q7P3FJzOA Head to @rockinrio in Portugal with Brazilian singer @Anitta — all on today’s story 🎶 https://t.co/WkfgKkXXcZ https://t.co/ckPFq4ZJZH We're hopping around (and hanging out) with the Puffytails Trio on IGTV. 🐰🐰🐰 https://t.co/BMRm1NuwC1 https://t.co/MsG3ZU4mVz Head to Southern California, this weekend for @VidCon with creator @TTLYTEALA. 🎥 Update your app now to see what she’s been up to — on today’s story and on our IGTV channel. https://t.co/2DjTq4oaZS https://t.co/vRzBaoFYfY Participate in this weekend’s hashtag project: #WHP🌈 https://t.co/lsw3X2MYs2 https://t.co/XnZ1I1f4Qs @lhwaldron @ProPublica Thanks for bringing this to our attention @lhwaldron. The videos are back up, and we're sorry for our mistake. Meet Nelly, who’s just looking for a way to cool down 😻 🍉 #WeeklyFluff https://t.co/HaUUKBenfx https://t.co/EFhJjsQU5e You’re really testing our fear of heights, @chrisburkard. 🏞 Update your app now to watch our IGTV channel, and see Chris’ Yosemite adventures https://t.co/2GRCxJyEh0 https://t.co/0uymf2nga4 Yep. #NationalSelfieDay is better with Manny “The Selfie Cat.” 😼👅https://t.co/vIqisEiJJ4 https://t.co/Gb5TLyAe6h “Soon, you don’t even see me — it becomes not about the selfie, but about the scale of the environment I’m in.” —Traveling drone photographer Renee Lusano. Update your app now to watch our IGTV channel, and experience Renee’s drone selfies. Link here: https://t.co/psTxjnKDqY https://t.co/NNfWTCIBpc Watch @KimKardashian share three of her top beauty tips on IGTV. Update your app now to watch our IGTV channel ASAP. https://t.co/6UEsZWMWMw https://t.co/u23I47TxWB (Good thing Josh quit his day job.) Update your app now to watch our IGTV channel, and see Josh show off three of his records. https://t.co/A62bHQYS82 https://t.co/8aRa6LYv1O Crayons, lipstick and marshmallows — meet #ASMR. Update your app now to watch our IGTV channel for a quick brain massage from 24-year-old art student and #ASMR creator, Laurel Driskill. 🔥💄 Link here! https://t.co/LFef24yXBp https://t.co/za4NQMO2YA Introducing IGTV, a new app for watching long-form, vertical video from your favorite Instagram creators. https://t.co/7aSMmmAsyB https://t.co/Py8QI1rS23 We're LIVE on https://t.co/0ZMkk1ACV4 with @kevin to share some exciting news. Tune in now! 🎉 RT @kevin: Rolling into our big announcement today at 10am… https://t.co/7Ghjq0ryOC What better backdrop for some impromptu yoga?🧘‍♂️ #WHPplay https://t.co/8TekT5ulK3 https://t.co/JDWRaDjOJX Staying young at heart through ⚽️ #WHPplay https://t.co/aLokC1ZqTd https://t.co/bk7UkXIeSJ Watching the ⚡️ play with the Chicago skyline 😍 #WHPplay https://t.co/Wr4sVB0KR0 https://t.co/X314f2iQqE Catching air for #WHPplay 🤙 https://t.co/kMUB6iD6o4 https://t.co/jM5ksniVgM Shadow play on a colorful court for #WHPplay https://t.co/5UYDrzDckH https://t.co/eHVUIZ3SyO Jumping into #WHPplay with a splash 🐶https://t.co/cc79pa7AUb https://t.co/wrB8KlNbUC Today is #FathersDay in many countries around the world. We’re with David Beckham and Brooklyn Beckham at home to celebrate. Check it out on our story now! https://t.co/WgAgp5ubSM https://t.co/Uj3oRoeBq3 RT @TIFF_NET: Calling all filmmakers with #TIFF18 dreams and an Instagram account: Submit your 60-second short to the third edition of the… Participate in this weekend’s hashtag project: #WHPplay https://t.co/eHVknRc5uG https://t.co/lu5Re0X4xo Hello, world! Meet today’s #WeeklyFluff: Ida, a spotted shepherd with a need for speed. https://t.co/DOSyPYuhwj https://t.co/osk19rd8bJ Here is the FIFA #WorldCup lineup with the most Instagram followers in the world! 🌎 https://t.co/aeHLPDUcwu Today on our story: Meet soccer freestylers @Lisafreestyle @LivCookefs @danielgothits 🤯⚽️ https://t.co/kN69E32uP0 https://t.co/eWD9qkDVG1 “I have an obsession with clear compositions and geometric shapes.” #WHPshapes https://t.co/bzdONTFyVE https://t.co/UqDnVYdIBo Shapes on shapes on #WHPshapes 🔺https://t.co/DznteiG4ws https://t.co/6MIm589wAr The call of the 🎾 was strong for this one. #WHPshapes https://t.co/8JpfTg0TPZ https://t.co/vL6ZSp0akD “The land has always been the thing that always draws me in.” —Photographer @kiliiiyuyan 📷 Tune in to our story to see scenes from Kilii’s travels documenting the Iñupiat people in Alaska. https://t.co/WbpDWs318g https://t.co/pXcxTox4LB We're aware that some users are having trouble accessing their Instagram accounts. We’re working to resolve the issue as quickly as possible! The long and winding road was (definitely) worth taking for #WHPshapes. https://t.co/4ytKpSrI7l https://t.co/cQxwWXWIv9 Just a girl in her bubble #WHPshapes https://t.co/8K1nagTIsn https://t.co/F3OMaqBUvB Who knew Kiev looked like a puzzle from above? #WHPshapes https://t.co/wh8i3OdmAs https://t.co/QFAnvLkMNW “Making a living from drawing is still mind-blowing to me.” See the work of artist T.S Abe on today’s story 👀https://t.co/LP117oXend https://t.co/qoJyi1uTcv “At first, I just wanted to share my creative world. Now, I get messages from black women telling me how much I have helped them accept their natural hair!” —Hair sculptress @laetiky, on today’s story https://t.co/dvpynVK5Ca https://t.co/6FUMR3PYJd ☀️ Check out today's Instagram story ASAP. There's a new GIF challenge from @martinamartian_ — just in time for the weekend. ☀️ https://t.co/yDhIU3dptD Participate in this weekend’s hashtag project: #WHPshapes https://t.co/eDaYDfYNjD https://t.co/Ljoznzf70J Nothing to see here: just @wat_ki, an unlikely pack of 🐶, 🐶 and 🦔 enjoying the great outdoors #WeeklyFluff https://t.co/C2y3xXasnn https://t.co/xYqpV2yNTq “I just draw what I like, and I’m lucky that a lot of people like the same stuff.” —Graphic designer + basketball fan @MichaelWalchalk 🏀 #NBAFinals https://t.co/XyVgzPEB2B https://t.co/cErsmWBtjH Shedding light for #WHPshine ✨https://t.co/6OiI8YvTGz https://t.co/x8R7C1tuzS Shake it, Elsa. 🐶 #WHPshine https://t.co/wOJROCoOtP https://t.co/7EIY8NAob8 I spy...some amazing underwater light. #WHPshine https://t.co/iCPeNbCnQI https://t.co/PU8dtbZIo0 “Some people even ask if we get each other mixed up when we look at ourselves in the mirror.” —Dancing identical twins Sofia and Anastasia, today on our story 👯‍♀️ https://t.co/GDso9fSRnK https://t.co/S2tsCG9bn4 Yesterday, there was an issue causing the Instagram app to crash on Android devices. We're sorry, and things are resolved! If you're still experiencing problems, try reinstalling or updating your app. Like a scene from an old-time movie set — but for #WHPshine 🕵️‍♂️ https://t.co/vzRgQlHdsP https://t.co/6XQSdfHlBG Warmups ✔️\nPre-performance huddle ✔️\nOpening night 💃 #WHPshine https://t.co/JyAFKEUDdH https://t.co/LK6XVB7cnq Movement, magic and light along the Napali Coast. 🐬 #WHPshine https://t.co/J8qkHPVje6 https://t.co/ybwUSr2OqI RT @guywilliamsguy: \"Not all those who wander are lost” is code for “this instagram is going to have a lot of photos of waterfalls”. Celebrating natural hair on the streets of San Juan, Puerto Rico, with Valerie Moreno\nhttps://t.co/2EJmdGvvVi https://t.co/0mIRmms7CV RT @PlayersTribune: Instagram co-founder @mikeyk sat down with @HBarnes to talk about the platform’s future, why its ads are actually prett… Artist first, candymaker second.🍭 Meet @MaayanZilberman on today’s story. https://t.co/p07D7V3jyr https://t.co/AtXxdRcEvS We’re celebrating #Pride2018 with photographer Jason Rodgers. 🌈 Mention your #RoleModel in your Instagram stories, and share how they inspire you. https://t.co/aTgj7ZUodA https://t.co/yZhhR1gbjh Participate in this weekend’s hashtag project: #WHPshine https://t.co/m1K93nd1n8 https://t.co/U5nwaRHfUs RT @BuzzFeedLGBT: 5 Young LGBT Leaders Got Surprised By Their Own Queer Role Models https://t.co/JZRa2BA0AX And they’re at it again! Check out our story to see the @warriors and the @cavs face off in Game 1 of the @NBA finals for the fourth consecutive year. #NBAFinals https://t.co/ys7iO57mw2 https://t.co/kVLJKihrMi Hello, world! Meet Hosico, who’s constantly having his mind blown. 🤯#WeeklyFluff https://t.co/PKh3WWq1c6 https://t.co/8inqdXiXfb RT @TIFF_NET: Calling all emerging filmmakers with #TIFF18 dreams and an Instagram account: Submit your 60-second short to the third editio… RT @Complex: These are the most-Instagrammed lyrics for Drake's \"Nice for What\" https://t.co/SHuoC5DSVC https://t.co/AoM4WozHjX When architecture and a really great outfit become one. 🙌 #WHP🙂https://t.co/cK0LrCXwkt https://t.co/cOAM9ddDM3 Who’s that? Just Samson the goldendoodle, hiding from the end of a long weekend. #WHP🙂 https://t.co/u7iQDgeYE1 https://t.co/tjfrkRSu7N #WHP🙂: making doing dishes more fun since... last weekend. https://t.co/KVwwghDCai https://t.co/xxQNHfIdWj We’re celebrating @kendricklamar’s #Pulitzer win with London-based artist @iLLESTration_. See her process on today’s story. https://t.co/UOJnh6sWlf https://t.co/dcV2107xkB Pics or it didn’t happen #WHP🙂 https://t.co/y9RQ1iZKPT https://t.co/LkZhKKfI4x Happy place = found #WHP🙂https://t.co/bwX9My5SRc https://t.co/Zylku4oafa Celebrate #Ramadan with writer and artist @Noor_Unnahar on today’s story 🌙 https://t.co/pEIf2aRgtX https://t.co/PoGbFFdKzM Look no further for #promhair inspo. 🧝‍♀️Braids, twists, waves and updos ➡️https://t.co/SndgvzjrKs https://t.co/w31hSECIc2 Participate in this weekend’s hashtag project: #WHP🙂 https://t.co/O7YxtGLOVG https://t.co/IizhE0nZDg “I want people to get to know me and my perspective: that religion should never be a barrier to expressing myself.” —#MUA @hanihanss, showing off some of her favorite looks on today’s story 💄https://t.co/4kWpykRbM9 https://t.co/Lj3oCZTcBg When crayons, lipstick and marshmallows meet an #ASMR fan, this ⬇️ is what happens. Watch today’s story to see more. https://t.co/uwtF45e9yV https://t.co/Wft5Yw1oTI “#WHPgetlost could be my personal theme — I’m always trying to find lost places, hideaways and strange locations.” https://t.co/2t43jxm1vW https://t.co/pIWxPYH5HH 🌾 #WHPgetlost in your own thoughts 🌾 https://t.co/5coxZUPIz6 https://t.co/vdUraE2Lqc Good girl, Nelly! #WeeklyFluff https://t.co/Eo5sClHZeh https://t.co/j5ZVzqHVHd Rocky Mountains or another planet? 👽 #WHPgetlost https://t.co/iK8YfibeS4 https://t.co/QvuqwjD1d6 “Isn’t life just a-maze-ing?” #WHPgetlost https://t.co/3P3ELQ5iuu https://t.co/MiVTMXVZH8 We’ll take a helping of fairy tale forests for breakfast. Please. #WHPgetlost https://t.co/dPSKTUvlw0 https://t.co/61oLBcteQA We see you, @ShekuKM 👑. Meet the cellist from the #RoyalWedding, today on our story with @KensingtonRoyal https://t.co/wwxuoCWSzy https://t.co/S2z8EPCiKT It’s #EndangeredSpeciesDay. On today’s story, we’re with @pauljhilton in Sumatra’s Leuser Ecosystem, “the last place on Earth” where endangered Sumatran elephants, rhinoceroses, tigers and orangutans share a habitat. https://t.co/rtPbAvTuS5 https://t.co/x278RPyTp8 Participate in this weekend’s hashtag project: #WHPgetlost https://t.co/EEk2tluVHV https://t.co/VKBtmbRBGL 🍖? Yes. Face masks? No. #WeeklyFluff https://t.co/d5UbU6c4YM https://t.co/acOt6yjkuz “Most of all, I want to give hope to young black women and show by example that anything is possible.” —@Assasyllaoff, today on our story from the #CannesFilmFestival red carpet. #NoireNestPasMonMetier #MyProfessionIsNotBlack https://t.co/bhgTzTuvhj https://t.co/qZzQn2qLkR “It’s been over two years since I created MH Stories, and I don’t feel alone.” —@kay_ska, founder of @MH_Stories_ 💕 Check out today’s story to learn Kay’s top tips for self-love. #MentalHealthAwareness https://t.co/I1ZNoIFkTW https://t.co/nJli4djRVY With the right amount of #WHPimagination, maybe the shower curtain will turn into real fish... 🎣😻 https://t.co/PIy1Ns6HPz https://t.co/W7FoA2Ll7F RT @kevin: This extends all the work we've done trying to make everyone's experience online more positive through increasing kindness and e… RT @kevin: Understanding how time online impacts people is important, and it's the responsibility of all companies to be honest about this.… RT @kevin: We're building tools that will help the IG community know more about the time they spend on Instagram – any time should be posit… RT @kevin: It's true. RT @TechCrunch: Code buried in Instagram’s Android app reveals a “Usage Insights” feature that will show users their… “I thought about #WHPimagination and said, ‘Let’s get weird.’” 🌼 https://t.co/HWHRaRsy9N https://t.co/4WZpEpnKJX “These collages are my imaginary world.” 📸 #WHPimagination https://t.co/K1wsxMgWX6 https://t.co/7XNhGftROF RT @CloeCouture: What do you hear?! Yanny or Laurel https://t.co/jvHhCbMc8I “The cast of @CW_Riverdale takes Instagram very seriously.” And we like it that way. ☺️https://t.co/8gyDDcuXKm The cloak, the stone, the wand, the #WHPimagination ⚡️ https://t.co/fGCe6Cun2I https://t.co/TeXaaYptrj Playing with perspective in Berlin 🤸‍♂️ #WHPimagination https://t.co/z1JViNoIcL https://t.co/1CQ6fCIzEF Welcome to the wolf pack, Keaton 🐶 #WHPimagination https://t.co/BrzbgxjtmT https://t.co/VQYG4zn7Py Flowers, daughters and unconditional love. Happy #MothersDay! 💐 https://t.co/NhpYTsHIoT https://t.co/JoTLB3kJUn “Kids are so forgiving. They can learn through our mistakes that you’re still going to be loved when you do things wrong. Because my kids love me even when I’m not a perfect mom.” —Oakley Peterson #MothersDay https://t.co/w1jzu9IVdN https://t.co/9LTC2tBLNn Participate in this weekend’s hashtag project: #WHPimagination https://t.co/b24nGkv0Oc https://t.co/0IY4VIC5rv RT @FastCompany: .@Instagram’s new “emoji slider” is a fresh take on polls https://t.co/FgL9r6ZJle “I was born this way — and Mom brushes me every morning after I eat my breakfast.” —Barnaby the Persian cat 😻 #WeeklyFluff https://t.co/YQMeSbnOMO https://t.co/hlIFvYP185 “I had an idea: I’ll pair people up, like a buddy system, and give them a supportive friend.” —@gabby_frost, founder of @ProjectBuddy, today on our story ❤️ #MentalHealthAwareness https://t.co/PPEco1wyFV https://t.co/LisXfAzbGX Today, we're introducing the emoji slider sticker — a fun new way to interact with your friends on Instagram. https://t.co/cyJOfYJQ8Y https://t.co/9BQtsyR7oa Note to self: weekend beach getaway &gt; staying home 🏖 #WHPcolorpop https://t.co/b6iaqcFMDm https://t.co/dBFmB6LaPI #WHPcolorpop: interplanetary edition 🚀 https://t.co/cvMfNWYVPv https://t.co/ZtIGyqUfS7 🌞, 🌈 and a bright blue sky for #WHPcolorpop https://t.co/RlEp8lK65l https://t.co/WD5T9FKOVQ Be banana yellow in a sea of gray. #WHPcolorpop https://t.co/1SKdaPRnbQ https://t.co/JtP877dGOl #WHPcolorpop is coming straight for you 🎆 https://t.co/Re4NhBWx8q https://t.co/gscDFcNVad 🐥 or Cookie Monster? #WHPcolorpop https://t.co/xq6s9vKE3U https://t.co/8Qh33KRQMY Our most-liked photo on Instagram from this year's #MetGala: a big night out for @KylieJenner and @trvisXX 😍 https://t.co/YlZVNHZtmT https://t.co/1OQgM6UaDU Hi. YES. @Rihanna. #MetGala https://t.co/zXOe0oGUJL https://t.co/3ejtD7eLyA Watch our story to see the one and only @lizakoshy get ready for her first #MetGala ✨ https://t.co/zeltbVRkZm LIVE from the #MetGala: Tune into https://t.co/0ZMkk1ACV4 right now to see @kevin and @mikeyk on the red carpet. “Being kind to me is an act that should be fluidly practiced, not just acted upon when it’s convenient for you.” —16-year-old Riele Downs #InstaProm https://t.co/eYZhkdT0BY https://t.co/G15TUh9xWK Practice makes perfect — and colorful eyelids. 🌈 Meet 18-year-old #MUA @alicekingmakeup, today on our story 🌈https://t.co/KiUHlSqWaX https://t.co/yGG5m3RkuN “I was drawn to big water, big trees and wilderness, and I needed to move west.” —Photographer Michael Hanson, today on our story 🏔 https://t.co/Y1m3pRCZfA https://t.co/Jn44qKGpzw Participate in this weekend’s hashtag project: #WHPcolorpop https://t.co/we0ZyROJg3 https://t.co/K3BvB8UBTo #MayThe4thBeWithYou, Yuki. Always. https://t.co/y5gd1nrP5p https://t.co/OjUc7p36bF On today’s story: @TheChainsmokers share their favorite songs. 🎵 (Did you know you can now share a sticker of what you’re listening to from Spotify to Instagram Stories?) https://t.co/zRotoYPRe7 Who’s a good boy? Squish is. #WeeklyFluff https://t.co/RAn2zYizL4 https://t.co/xWNuZJIIkR RT @nytimes: Instagram has unveiled a bully filter to weed out offensive comments https://t.co/LNjf8uUKpu On today’s story: Learn all about incoming #AU freshman and education activist @TamirDHarper and #CollegeSigningDay. https://t.co/RUuFTPsHdg Who knew paint mixing could be so therapeutic? 💗 #WHPoddlysatisfying https://t.co/2KxPcudmbx https://t.co/J4jTPDH2pn “Bakers gotta shake!” #WHPoddlysatisfying https://t.co/2P7LYOPz83 https://t.co/h4JwPhxeQx “I like that a simple wooden frog can create a sense of magic.” ✨🐸 #WHPoddlysatisfying https://t.co/aSDJswKuS6 https://t.co/ILWH7xtN9R Starting today, you can share what you’re listening to from Spotify to Instagram Stories. 🎵 https://t.co/raDHW38Fjl https://t.co/zZXyumHC1b We're about to go LIVE from #F8 with Instagram co-founders @kevin and @mikeyk to talk about new product features. Tune into https://t.co/0ZMkk1ACV4  @ 11:15 PST. Starting today, Instagram will filter bullying comments intended to harass or upset people in our community. Learn more here: https://t.co/uN5IgfhoeF https://t.co/p9mC8auaWF When everything you touch turns to 🍦 #WHPoddlysatisfying https://t.co/2lOis9du31 https://t.co/waV9EInQb0 [Drops phone, sprints for nearest bag of chips] #WHPoddlysatisfying https://t.co/vVhZFG324b https://t.co/ehBeXHaPEL Fishbowl, noun: an ooey, gooey, extremely #WHPoddlysatisfying slime made with pebbles from a fish tank. https://t.co/39vJytgQwa https://t.co/bzY8StiW1c Today on our story: how two woodworkers are preserving Detroit’s history. #SmallBusinessWeek https://t.co/wnlS2Fay0G https://t.co/RMeuIUytKg Paint + water = ❓ Visit artist @kimkeever’s Manhattan studio on our story 🎨 https://t.co/AMi6lcjQy3 https://t.co/KDOI7s4nFC Participate in this weekend’s hashtag project: #WHPoddlysatisfying https://t.co/nnGN1V0gLN https://t.co/dLPPtiGrQA Sound on, everyone! #WeeklyFluff https://t.co/4WxIlkkLlG https://t.co/ugHPt8gtPK RT @Cosmopolitan: The 1 Instagram Feature That Will Make Your Day Drastically Better https://t.co/uwb8lz9SGX https://t.co/sVqCSeaq8W Soap, slime and sand, oh my! #ASMR @mashable \nhttps://t.co/FDyAIPxeK8 “I am interested in people’s stories, cultures, livelihoods, struggles and how they overcome them.” Meet Afghan photojournalist @Farshadusyan, today on our story. https://t.co/XeSwhzk0M3 https://t.co/yCfImVO6eu Any gnomes down there? #WHP🌲 https://t.co/VDq4QJA50Q https://t.co/g473k8EbmV Hey, Canada. Snow looks good on you. #WHP🌲 https://t.co/oz4NXaSgZq https://t.co/MeHoXbH8yA “Everything in this photo came from a tree — except for Martha.” #WHP🌲 https://t.co/c64Do3Ffdx https://t.co/N7UgIOmZJZ On #EarthDay, you:\na) Went barefoot ✔️\nb) Wore shoes\n#WHP🌲 https://t.co/qWHJAnAkAc https://t.co/IriQDkGeiG Nature &gt; concrete #WHP🌲 https://t.co/gKEsjQV2XA https://t.co/PsV2RRWuFE Inspiring ❤️ for Mother Earth, one play date at a time. #WHP🌲 https://t.co/Tci6pyloac https://t.co/pTuAfxdNZl The most-liked Instagram photo from #EarthDay? It's @iansomerhalder. In the laundry room. Spreading the word about energy efficiency.  https://t.co/xqDFWcAQ8p https://t.co/PUNeP50N1s Today, we’re behind the scenes with @kelly_clarkson at @NBCTheVoice 🎶 https://t.co/ZUQS9MFxcj https://t.co/R8v6v9UbQK “Ethical fashion can be fashionable,” says 17-year-old @TollyDollyPosh. We’re celebrating #EarthDay with her on our story right now. https://t.co/M0hk1KEOF4 https://t.co/mmIvSFgty1 RT @UN: On Sunday's #EarthDay we asked young people from around the 🌍 about their climate actions. Get inspired by them in our latest @Inst… Today on our story: join @TibbettsPhoto on a mountaineering expedition in the European Alps 🌬 https://t.co/q3Qe6KfN6F https://t.co/1YgPJnQCSB Participate in this weekend’s hashtag project: #WHP🌲https://t.co/Ie1PKBQkJK https://t.co/4hsmxhFG5T RT @UNICEF: We’re going LIVE with @instagram, @teenvogue and young climate activists Sonny 👨‍🎨 and Sona 🎨 for #EarthDay 🌎.\n\nTune in at 4pm… “One morning I woke up and said to myself, ‘From this moment on, I will never think about what I can’t do, but I will excel at the things I can.’” —Photographer and chef @gilesduley, today on our story https://t.co/o5TvqjPpMU https://t.co/kHpUZnTEUp “I think the most important thing is that people feel comfortable and safe to express themselves on Instagram, and that’s something the team takes really seriously.” — @evachen212 \n\nhttps://t.co/jaQv8ZWduX Meet Olive the 🐰, who loves all things green and leafy #WeeklyFluff https://t.co/yDcVL138TT https://t.co/Xiks9QIFzs \"Most of all, these fishing enthusiasts were eager to describe how social media helped them document their pastime so they could share it with others.\" 🎣\nhttps://t.co/VJYH2DA5D1 On our Instagram story now: get set for #EarthDay with story templates from artist @martinamartian_ 💚 🌏 💚 https://t.co/x1rZ60e91Q Let the wild rumpus start! #WHPwildthing https://t.co/3Xf0kbxzxQ https://t.co/vrmmRowXSl Why did the chicken go up the stairs? To get to the other side. #WHPwildthing https://t.co/RADKXXJpEv https://t.co/O0UFY4hd6C “My heart smiled, watching her being herself.” 💗🐞 #WHPwildthing https://t.co/nusQL9hdRR https://t.co/dw8mIcVogr Our top trending #Coachella hashtag on Instagram? #Beychella, of course. \nhttps://t.co/6knHouDy2r https://t.co/voTWQRsBHu The top emoji on Instagram from #Coachella: 😍\nFollowed by:\n🔥\n❤️\n😂\n😭 And the most-liked photo from #Coachella is from this really cool mom: \nhttps://t.co/OfG8eFFrMS https://t.co/DqoyHIOqMM Hanging out with a few cool cats in Tehran 🐾 #WHPwildthing https://t.co/15YUyCwCuF https://t.co/JMHPEGZ1ji Woods &gt; Wi-Fi for #WHPwildthing https://t.co/dzaq2FO1IZ https://t.co/8OHDckp3PO “SNOW!!!” 😍 #WHPwildthing https://t.co/dwzloCsRID https://t.co/Zuaxabh2aY Chloe + Halle (@chloexhalle) = sweet sisters, best friends and first-timers at #Coachella. 🌴 ✨ See their onstage and offstage adventures from the weekend in Indio on today’s story https://t.co/07ApFbSP0D https://t.co/6UsYlpVpy3 Today, we're introducing a new account exploring design and craft from the design team at Instagram. https://t.co/9Cd6NAFfs8 https://t.co/WWTVwNhrGN Participate in this weekend’s hashtag project: #WHPwildthing https://t.co/ChqZmXIN02 https://t.co/hr0LuKyv6Y “It’s hard to say whether Pickles is more of a dog or if Dill is more of a pig.” 🐽 #WeeklyFluff https://t.co/a1GJqv9WrC https://t.co/MlCE61DWo8 RT @NatGeoChannel: Will Smith is joining @NASA @Astro_Feustel for the first ever Instagram Live from the @Space_Station TODAY at 11:45am ET… “We are all humans, just evolving and growing into ourselves.” —Documentary photographer Ali Lapetina, showing us around Banglatown on today’s story. https://t.co/fHNYqMitrX https://t.co/6CawiHOxEJ A self-portrait a day keeps the boredom away. #WHPimbored https://t.co/ej9WtOiSiX https://t.co/FSc6RvGEhu “I tried to find a marker that was easy to remove, but it didn’t go that well.” 🌸 #WHPimbored https://t.co/yqqVOpDz05 https://t.co/5TQP2nqUc6 There's been a shift in the Insta-landscape! 👋@NicoleKidman https://t.co/WhZ8sVaziJ “From boredom comes true creativity.” #WHPimbored https://t.co/6GwVa3A3va https://t.co/erwqbD3LkL Now you can easily capture beautiful portraits of yourself or friends with the new “Focus” camera format. 📷 https://t.co/TgN3JxUFd1 https://t.co/EHzWu6Mud4 This must be what happens if you sit still for too long. #WHPimbored https://t.co/qVtGPAl1fB https://t.co/YPPcjFNBf6 You: “I’m bored. What should I do?”\nBrain: “Well, we have these googly eyes and a camera.” #WHPimbored https://t.co/fZlH5TDsje https://t.co/gICz3gwa18 Can we go play already? 🐶 😴 🐶 #WHPimbored https://t.co/jyfiC8DDzi https://t.co/VddcQPlc6b Participate in this weekend’s hashtag project: #WHPimbored https://t.co/YWpYpfzXSH https://t.co/uXAObJQM4f “I really have no idea where I’m headed — but I do want to continue working on my art.” 🎨 On our story: the illustrations of 18-year-old Zephani Jong https://t.co/N7wauJBAuG https://t.co/NqmCl24q0K RT @POPSUGARFitness: .@lizzy_howell3 is SUCH a talented dancer — with an important message to share. #CaptureConfidence @Instagram https://… “That’s the most rewarding part for me — being able to change someone’s day, their mood and the way they look in just 30 minutes.” —Men’s hairdresser Jonathan Erik, today on our story. ✂️ https://t.co/Ok7Xdn314i https://t.co/mjDvgmui7I The cat IS the hat. 🐶 😻 #WeeklyFluff https://t.co/QqPBSkkmvo https://t.co/RaXdlrOhgX Two hands? Two simultaneous drawings. What a #WHPshowoff. 😉 https://t.co/dhmmlIPGnk https://t.co/aaLErA5Rnq Fighting perfectionism, one broken Easter egg at a time. #WHPshowoff https://t.co/nj3An4r8On https://t.co/V7W63Dinfh From everyone at Instagram, we are deeply saddened by today's events at @YouTube. We are sending our love to the YouTube family. A lot of sand was eaten in the making of this photo. 🤸‍♂️ #WHPshowoff https://t.co/eHT5suMPEp https://t.co/h9a1n2ikbM Happening now on our Instagram story: how to use new GIF stickers! https://t.co/bQckrM6N5V Players showing off their skills, or a court showing off its colors? You decide. #WHPshowoff https://t.co/C6s2GkACKQ https://t.co/O2tYCFD1PV Did someone say T-R-E-A-T? 😛 #WHPshowoff https://t.co/ufmRq7W79y https://t.co/t1XmMjuHuF There goes nature, strutting her stuff again 🌸 #WHPshowoff https://t.co/Mzz1ZK005B https://t.co/iD7HvhBxyw RT @GMA: We're launching the hashtag #CaptureConfidence with @Instagram &amp;authors of \"The Confidence Code for Girls\" to celebrate how confid… Participate in this weekend’s hashtag project: #WHPshowoff https://t.co/b5PYNpkUwK https://t.co/oCjxBZGeJk Confidence looks different for everyone. Watch our story to meet photographer Blair Brown and five other inspiring young women who #CaptureConfidence every day on Instagram. https://t.co/KHWuo0FRq9 https://t.co/kswONObg4e “We like to say Viktor is physical and Yōji is intellectual.” #WeeklyFluff https://t.co/f1fUEyftfe https://t.co/7avYzVFtOD “It’s part of our DNA to explore. Launching ourselves into the cosmos is no different than setting sail across the oceans.” —Photographer Andrew McConnell https://t.co/Zct8UJ9RIN https://t.co/wt8qhhVdGG Microadventures FTW 🤙 #WHPawaywego https://t.co/0nPANDjikl https://t.co/Iex3oCgS6A Buy the ticket, take the ride ✈️ #WHPawaywego\nhttps://t.co/xyEalumthd https://t.co/iBRQh0LycU Yep. We are into playing with food 🍊 #WHPawaywego https://t.co/aC4SSOxKQj https://t.co/xsapmMxjxw “You’re allowed to have your days, and that’s perfectly normal.” —Style blogger and body positivity activist Jessica Blair. (She’s on today’s story.)\nhttps://t.co/kKxPr5TXjL https://t.co/AdxDrjMfC0 Everyday magic and motion for #WHPawaywego https://t.co/PPNUndPfra https://t.co/8PFSTbKa0E “Nobody can be uncheered with a balloon.” —Winnie-the-Pooh🎈 #WHPawaywego https://t.co/BYh59bUwUB https://t.co/uLjqmlIxFC Nothing but blue skies ahead #WHPawaywego https://t.co/CCyAKtLDrH https://t.co/tRMntvVd7u Happening now on our Instagram story: how to use new Type mode! https://t.co/fBd2E9fSsF See the most liked photo on Instagram from #MarchForOurLives in DC: https://t.co/ho4oqV0i78 The most liked photo on Instagram in support of the #MarchForOurLives movement is...  https://t.co/ys04LXBTuC Today, we’re following next-gen storyteller @ClassyMalick in Washington, DC, for #MarchForOurLives.📝 Tune in to our story to see more https://t.co/WzS1Hqnkr4 https://t.co/TStHm2hPqk Participate in this weekend’s hashtag project: #WHPawaywego https://t.co/nCHHTRdGz8 https://t.co/SkEaPBoSAc Instagram: How would you describe your personality? @jiffpom: Social butterfly. 🦋 #NationalPuppyDay https://t.co/dHJzN0fihK https://t.co/jMPTcPEs1L “How do you show the human face of climate change?” Today on our story, join photojournalist @CirilJazbec in the snowy reaches of the Arctic. https://t.co/F6TyRQ6Xtt https://t.co/afpJxqluNA Hello, world! Meet Rexie the Cat #WeeklyFluff https://t.co/qWQkkLTxXo https://t.co/D6GzG8vasI You can now link to hashtag pages and other profiles in your bio. https://t.co/kmjhyGVtOZ https://t.co/iGsZ9BPQ2F Reframing a look on life for #WHPblackandwhite https://t.co/4jtnVRwq7h https://t.co/GuYAC7Uocg Leaping lovers #WHPblackandwhite https://t.co/ini01q7fjJ https://t.co/TtcowFdMjw ⚡️🌈🤪#WHPblackandwhite https://t.co/roQsL078Wm https://t.co/EACDAKN2GU Check out our story for a taste of Yeon-a Kim’s delectable Korean cooking https://t.co/MqWJzietNx https://t.co/fniif2ubSp Standing on top of Chicago (in the perfect pair of striped pants) for #WHPblackandwhite https://t.co/CWf8QQ9hHf https://t.co/51ejy6F8Up Throw your wings up for #WHPblackandwhite https://t.co/JWJox1wbWz https://t.co/TVWVz6vJVn Happening now on our Instagram story: how to use new Superzoom effects. (Sound on!) https://t.co/4jBe0DmYWG Participate in this weekend’s hashtag project: #WHPblackandwhite https://t.co/LPO8ZSlCid https://t.co/pV01OwkfAC The ⭐of today’s story = Steller sea lions filmed by @PaulNicklen @Sea_Legacy https://t.co/PDT90yZpRw https://t.co/acHnYj24jM Say it 10 times fast: “A pair of Pacific parrotlets.” 🐦 🐦 #WeeklyFluff https://t.co/3kwV5xpcBL https://t.co/Lm1WDZRaTh “To be able to stay motivated, put in hours of training, make daily sacrifices and truly be passionate about what you do is rare.” —@PaulRabil https://t.co/9KxUV63e7f https://t.co/QZjOFO2Jqm RT @vogueaustralia: These were the most buzzed-about shows of the season. https://t.co/LwLkjgFlvX RT @SInow: Think you know who's winning every first round game? Vote on all 32 in our @Instagram story! Follow sportsillustrated on IG http… When patience and good timing are on your side, #WHP🦄 happens https://t.co/1G1f5Qz49g https://t.co/JXYNNpq9oG Leticia = #WHP🦄 https://t.co/0P44r4Rg4N https://t.co/F429kMvsmR Lunchtime prep transformed for #WHP🦄https://t.co/VWcxfKGuKP https://t.co/I7eB7gaho9 The only thing better than a spectacularly pink Arizona sunset? Steve the Unicorn. #WHP🦄 https://t.co/aYPanQdJL3 https://t.co/clPMmovYFU Meet Maria — “an expert in unicorns and a just really awesome girl.” #WHP🦄 https://t.co/mB41FWQSiZ https://t.co/XdaNfEao0S “If you’re lucky enough to be different, don’t ever change. The world needs more unicorns.” #WHP🦄 https://t.co/I1UHcnvChI https://t.co/3fGW0hWU76 Participate in this weekend’s hashtag project: #WHP🦄 https://t.co/vnUItLBhZi Half-court shots, spin moves and selfie dunks. 🏀 🔥 Watch our story to get your fill of trick shots with the @Globies nhttps://www.instagram.com/p/BgHfTYIBgIy/ Full moon fever for #WHPlandscape 🌝 https://t.co/k0kBXqMhas We’re celebrating #InternationalWomensDay with @ChristieHKlok and other members of @womenphotograph. Check out today’s story to learn more https://t.co/gJkexgWsQY https://t.co/6npTLsCyCi RT @NatGeoPhotos: In celebration of #InternationalWomensDay, we invited a special guest to choose the pictures she loves.\nhttps://t.co/KFwS… Follow the Rainbow Road 🌈 #WHPlandscape https://t.co/i44LjWAVcY “I spent many hours here waiting for a sunset that never came, but I fell in love with the light anyway.” 🌻 #WHPlandscape https://t.co/k7ILdGu7Dt “Sometimes it’s the small landscapes we see every day that are the most beloved.” #WHPlandscape https://t.co/GNvw3mVbt6 7 a.m. in Shanghai = the perfect time to reflect over some martial arts #WHPlandscape https://t.co/oBcAZ6I4NO Looks like we’ve found the end of the 🌈. https://t.co/9YikDF0XyV Featured submissions from this weekend’s hashtag project: #WHPlandscape https://t.co/ihxCAv1tSo Heading to the #Oscars is an exciting experience for any actor, actress — or even superhero. Watch our story to join @TomHolland1996 — aka Spider-Man — on the red carpet 🤩 https://t.co/36ZMjc3lxC Today on our story: transport yourself to the front row of #PFW in the City of Light ✨ https://t.co/RJuljNNuKE Diving paws-first into the weekend like 😻 #WeeklyFluff https://t.co/uuSIn1Ah6N Participate in this weekend’s hashtag project: #WHPlandscape https://t.co/XbzxlerpGp How Instagram conquered the NBA https://t.co/t7xchknN8X via @SINow “Pursuing a relationship with yourself, your body and food in self-loving ways is such a journey that’s forever.\" —Kelly Uchima #NEDAwareness https://t.co/yHz5qkJQZX https://t.co/yrVRci9OOP “Our parrot Tango has a serious case of FOMO.” #WHPtwinning https://t.co/tWfi4sH0V8 @SELFmagazine's IG is going LIVE with @NEDAstaff, @BingeConfession, @jocelynrunice and Instagram's Carolyn Merrell today at 3:30PM ET to talk body positivity and self-acceptance in celebration of #NEDAwareness. When hair = the Sydney Opera House #WHPtwinning https://t.co/0fQmmv70si When #WHPtwinning gets literal 👯‍♀️ https://t.co/YXpS58JcQ2 Check out today’s story to learn about Australian photographer @SarahPannell https://t.co/bAzbfNcAGK https://t.co/CJPvUW23Zy Which fluff is the real Leo? 🐶 #WHPtwinning https://t.co/4LeKjvwzHT A #WHPtwinning submission months in the making 🌊https://t.co/CL0oYfbYZr A happy coincidence of #WHPtwinning in a Tokyo intersection https://t.co/SlouOWknts Featured submissions from this weekend’s hashtag project: #WHPtwinning https://t.co/UDjUMwqg3k Watch our story to walk the runways at #MFW with Italian model Vittoria Ceretti 👠 https://t.co/x5ijdFJK5T \"I love the thrill that comes along with the speed.\" —South Korean speed skater Seunghi Park #Pyeongchang2018\nhttps://t.co/5BvV01OOWz Body builders, athletes and acrobats, oh my! #WHPmoveit https://t.co/a6W2PpEtUR Participate in this weekend’s hashtag project: #WHPtwinning https://t.co/TFLqfb6KLh On today’s story: we’re hanging out with author and educator @NifMuhammad in Ohio https://t.co/FLcnpxpeAB The joy of a carousel ride, captured for #WHPmoveit https://t.co/MMIwqFvBkZ Getting close to the action for #WHPmoveit https://t.co/JcwtFXmLwT “After the Olympics, I’ll probably take a short break from skiing. But I’ll soon get back to practicing. I can’t go too long without it!” —French slopestyle skier Tess Ledeux 🇫🇷 #PyeongChang2018 https://t.co/XKp8RtgLEa On today’s story: we’re with artist and educator @naimapatrice https://t.co/0k0wnnCTYT https://t.co/TF0ogwHCgm Sliding into your feed like 🍕 #WHPmoveit https://t.co/cmlzl4ecEe All it takes is a couple of friends and a sunny backdrop #WHPmoveit https://t.co/q9UusgDTB0 On today’s story: university student and freelance photographer Shaista Deen https://t.co/CNV5FRqdaj https://t.co/QS0UlMSc3F What do you get when you add dancers to a soccer field? #WHPmoveit. ⚽️ https://t.co/cSbdpGnATT Featured submissions from this weekend’s hashtag project: #WHPmoveit https://t.co/ORc4mgzu65 Today on our story: “Glitter against gloom” with fashion designer Ashish Gupta ✨ #LFW https://t.co/pIkyECygdU Participate in this weekend’s hashtag project: #WHPmoveit https://t.co/fXRzJgfuOz Meet the @ShibSibs, the brother-sister ice dancing duo going for gold at this year’s Winter Olympics 🇺🇸⛸ #Pyeongchang2018 https://t.co/ffqgSEoiLJ When mountain bikers and hikers come together = #WHPwithlove 💞 https://t.co/bONr0lq8WH On today’s story: We’re celebrating #LunarNewYear with author and baker Susanne Ng &amp; a zodiac-inspired cake\nhttps://t.co/TTur8uP5xJ Matching hair, matching hearts ❤️ #WHPwithlove https://t.co/mrAfkgq3gp Paul the Corgi: “Who’s a good boy? ... I’m a good boy. 😌” 🐶 #TheWeekOnInstagram https://t.co/7JvkNaJbFH “Behind all the fluff, I’ve got a big heart and lots of love to give.” —Coby the Cat #WHPwithlove 🌹😻 https://t.co/AmKqRoieLi Happy #ValentinesDay! Get in on the 🍕❤️ action at @lilfrankies on today’s story https://t.co/wRUaYpfqSC A serene moment in the snowy Czech Republic for #WHPwithlove https://t.co/mgzB7wgSi4 Gnome is where the heart is. #TheWeekOnInstagram https://t.co/NC2Lu8PuYP In love with a mean machine 🏍💗 #WHPwithlove https://t.co/0NMDEOGqco Head over heels for hearts 💕 #WHPwithlove https://t.co/vMs4CQGeHV Sorry snow. You won’t stop these soccer stars in Iran. ⚽️ #TheWeekOnInstagram https://t.co/FCvI3iho2v Featured submissions from this weekend’s hashtag project: #WHPwithlove ❤️ https://t.co/MmQdGhj19K Runways, fittings and parties, oh my! Watch our story at #NYFW with model @golden_barbie https://t.co/2OJcrIlxpK RT @nytimes: Could your dog be an Instagram star? Cuteness counts, but so does the breed. https://t.co/md2K3BRj4d https://t.co/VQdqBFu9MI The Week on Instagram | 321\nhttps://t.co/GnQpa46A4I Participate in this weekend’s hashtag project: #WHPwithlove 💘https://t.co/o4CXp9dRz7 On today’s story: Carnival fashion from costume designer Alexia Hentsch https://t.co/EvQofXAWu4 Seun Adigun is taking the first Nigerian athletes to the Winter Olympics 🇳🇬 #Pyeongchang2018 https://t.co/sLaSErgX0X Look a little bit closer to see the #WHPillusion 🎧 https://t.co/8GKx2YfDF1 On today’s story: portraits across the Middle East from @cheb_moha https://t.co/rskzPfMLHZ RT @museummammy: taking over @instagram for #BlackHistoryMonth - so excited to start with #NoSesso - queer, brown and taking the world by s… Classic car dreams do come true #WHPillusion 🚙 https://t.co/ZWOBxTCImX When a mirror meets a French alleyway, #WHPillusion happens https://t.co/SJDlt9J76T On today’s story: making moves with dancer @yoe_apolinario https://t.co/gDyw5Xm85S Stacks on stacks on stacks #WHPillusion https://t.co/OEupQLuQy0 Playing with scale in Singapore #WHPillusion https://t.co/4FO8U60Mei On today’s story: behind the scenes with Los Angeles-based brand No Sesso https://t.co/ADV4Vp8OUf Blending in with sea and sand for #WHPillusion 🌊 https://t.co/LgeYMYb316 Featured submissions from this weekend’s hashtag project: #WHPillusion https://t.co/gcBfBxAIXG Happening now on our Instagram story: how to use new Type mode! https://t.co/Hw42qUGtqG Tiny characters on big adventures! Learn more about Renan Viana’s world on today’s Instagram story https://t.co/t3Mh68XhHg https://t.co/AYxBqpVW41 A forest of pure, untouched snow stars in #TheWeekOnInstagram https://t.co/oxUtv0Qi3f MaoMay the cat takes over the Notre Dame in Paris 🐱 #TheWeekOnInstagram https://t.co/D584BV9nLK A storybook scene in Japan 🦌 #TheWeekOnInstagram https://t.co/2IW5QCDMcR The Week on Instagram | 320\nhttps://t.co/d2qoxKYYPO Participate in this weekend’s hashtag project: #WHPillusion https://t.co/9k1CrIM4Rg On our Instagram story: dancer Jung SungKap shares his tutting skills https://t.co/5vkRF2BM4G Watch today’s story to learn all about the LA-based clothing brand Kids of Immigrants  https://t.co/WEEF6hyDTr Introducing “Type” mode in stories, a new way to share anything that’s on your mind! https://t.co/35A1nupNtf https://t.co/JXLz7iG5UE In Seoul, Lee Kang-bin makes delicious art you can drink. Watch our story for more ☕️ creations https://t.co/cufRJDFckX Windup teeth and a well-placed light for #WHPsmile 🚗 https://t.co/DEbayvrxdO Beach day bliss captured for #WHPsmile 🌊\nhttps://t.co/3E7WpYUiAU “Mona Lisa” gets a “natural” remix for #WHPsmile. https://t.co/SleY5hTeeq Cheesing underwater for #WHPsmile https://t.co/bBJq5FxzCK Seeing faces in unexpected places for #WHPsmile 😃 https://t.co/RibUBU7qWR On our story: Meet Leia, a therapy dog-to-be and today’s #WeeklyFluff 🐾\nhttps://t.co/SDawoPDojw “You truly put a smile on my face every morning.” ♥️ #WHPsmile https://t.co/LURMPtXcrZ Featured submissions from this weekend's hashtag project: #WHPsmile https://t.co/Q2yjYcMfAP You know what’s better than one Pomeranian? 🐶 #TheWeekOnInstagram https://t.co/qZvux33t6j “Some divers have gone 200 meters deep and still haven’t found the bottom.” #TheWeekOnInstagram https://t.co/sHrq7w929v On our story now: getting ready for the #Grammys with @Logic301 🎶 https://t.co/tTsIFtrMJp Snowfall in Tokyo ❄️ #TheWeekOnInstagram\nhttps://t.co/EWHnjWZksR Never wanting the ski vacation to end #TheWeekOnInstagram \nhttps://t.co/wqVnk7Xb3Q Happening now on our Instagram story: how to use new GIF stickers! https://t.co/tsUqrjbSzz A very introspective #BoomerangOfTheWeek 👀 ❤️ https://t.co/9NFsN6mL9v Participate in this weekend's hashtag project: #WHPsmile https://t.co/8hYd8Qsv7F On today’s story: surfing champion Davi Teixeira de Aguiar takes us out on the waves 🏄 https://t.co/fhMIfk7F7i https://t.co/3Ksslk9qcf Windows to the past #WHPwindows https://t.co/g64wgL3z8S Paper plants spring to life in this #myinstagramlogo https://t.co/wu6sGndKt5 Happening now on our Instagram story: how to use new Superzoom effects. (Sound on!) https://t.co/ofmjOvHRjv A stroll through the Norwegian countryside for #WHPwindows https://t.co/STVtW8EFxb Playful geometry makes for a surprising street snapshot in Iran #WHPwindows https://t.co/FnR7p26oUa On today’s story: finding new limits in the great outdoors with @timmatsui https://t.co/ajN53Txm7R Spotted in the reflection of a bell jar: a window looking out onto Paris #WHPwindows https://t.co/XfObXQQU18 A glimpse into daily life in Portugal #WHPwindows https://t.co/SrlSTRtB8I Brunch at home, favorite TV shows and window art made up a slow weekend morning #WHPwindows https://t.co/LwKUcL38g6 RT @GIPHY: Wait, you can add GIPHY Stickers on #InstagramStories now? That’s cool…😏 ✨\nMore on @instagram's blog post 👉https://t.co/xJ8o4ImV… Now you can add fun, expressive GIF stickers to any photo or video in your story \nhttps://t.co/5aYgnHmAvq https://t.co/uYjtz0hRK1 Featured submissions from this weekend’s hashtag project: #WHPwindows https://t.co/r6KoIJbek3 For @Jenisplendid, FLAVOR = EVERYTHING. 🍨 Learn more on our Instagram story. #CreateCultivate100 https://t.co/KV7Ddbe8uF Daily life in Turkey — in low, beautiful light #TheWeekOnInstagram https://t.co/spXZ0nBPPC Everything in its right place for #TheWeekOnInstagram https://t.co/tcwMkYNPZ6 Two sweet cats from Japan have taken over our Instagram story https://t.co/OVhxTCgSVJ 15 minutes + -52 degrees Fahrenheit = frozen eyelashes in Russia #TheWeekOnInstagram https://t.co/MtWTKXyDbq Puffins: “the most comical, clumsy and chilled-out animals.” #TheWeekOnInstagram https://t.co/T4eLEAPnlO Right or left? #BoomerangOfTheWeek https://t.co/ydmZOW924n Participate in this weekend’s hashtag project: #WHPwindows https://t.co/kz4BnyjTje Today’s story stars parkour and freerunning athlete Hamy Pratama. Check it out now! https://t.co/kYfCXaejdU An expressive portrait captures a sense of effortless style for #WHPmystyle https://t.co/yBU7e80tWU Today’s #WeeklyFluff = a dynamic duo of adopted doggies https://t.co/zHMGHcCx11 A little bit rock ‘n’ roll 🎸 ❤️ #WHPmystyle https://t.co/8NLMk4TMU8 On today’s story: with @Camila_Cabello in Los Angeles celebrating her debut album, “Camila” 🎶  https://t.co/pwzWABbRLv https://t.co/Aq6CH9wC94 “Brego knows how to wear the latest fashion trends, don’t you think?” #WHPmystyle https://t.co/fbGoukEhow Out with the old, in with the new 🌲 #TheWeekOnInstagram https://t.co/mE7pvWp5rn #WHPmystyle means boosting the shine factor ✨ https://t.co/DogehDsSst On today’s story: scenes from around the 🌍  with #everydayclimatechange and @jameswdelano https://t.co/37QU8hX6wQ https://t.co/CdgQlz9wBC Finding colorful inspiration in nature for #WHPmystyle https://t.co/njSCaPBoet Featured submissions from this weekend’s hashtag project: #WHPmystyle https://t.co/XwYNL1brJX “I waited. I waited a lot.” 🦌 #TheWeekOnInstagram https://t.co/FDXnbEGnX4 Late afternoon light, good friends and the ocean 🙌 #TheWeekOnInstagram https://t.co/PVAH878wBA Making space for new heroes and heroines with @365Ken https://t.co/tUhj4ZxNyB The Week on Instagram | 317 https://t.co/5tWKNDtEeI Participate in this weekend’s hashtag project: #WHPmystyle https://t.co/YQXkw1rUWV Reflecting on the new year #TheWeekOnInstagram https://t.co/qJdJUEIwaG Two horses drink in unison for #WHPspontaneous https://t.co/rw4HXtTnDd On today’s story: We’re on a food tour in Singapore with Jasmine Tan https://t.co/C7ZKEMyOGA https://t.co/EZHjBacgWH “I don’t know what the final result will look like, but the thrill of seeing it is very satisfying.” #WHPspontaneous https://t.co/ccT87xlDp1 High noon shadows in Dubai 🐫 #TheWeekOnInstagram https://t.co/swvywnEgra Noodles and a photo-bombing cat for #WHPspontaneous 😻 https://t.co/09X9K2T3hu Check out our Instagram story to see a bird’s-eye view of Argentina with photographer @christian_foto https://t.co/GNLCu4cX8g Catching air during an impromptu icy ride in Norway #WHPspontaneous https://t.co/ZseR1QetKb 🐱 peekaboo on the streets of Brittany, France #TheWeekOnInstagram https://t.co/ztlBBCMUV9 Spontaneous by nature 🐦 #WHPspontaneous https://t.co/zOajruvBFw Whether you were rooting for #RollTide or cheering on #GoDawgs, tune in to our story to see the action from the sidelines of the college football championship in Atlanta 🏈 https://t.co/YB90xSfs7y “Sometimes the best moments are the ones you don’t plan for.” #WHPspontaneous https://t.co/PZPkxwdPMQ Featured submissions from this weekend’s hashtag project: #WHPspontaneous https://t.co/8pGyd96z2E A diver takes flight in Cape Town #TheWeekOnInstagram https://t.co/ahXDmcKc5f Watch our Instagram story to spend the day with actress @lauramarano, from the red carpet to the awards #GoldenGlobes https://t.co/BzIEGmzXxk Tune in to our Instagram story to tag along with @DoveCameron for a night of Hollywood glamour. #GoldenGlobes https://t.co/kuN3WPVf9a The Week on Instagram | 316\nhttps://t.co/d36IQDq3pn Celebrating the first week of 2018 with a double high-five #BoomerangOfTheWeek https://t.co/bBwx2jejTi Participate in this weekend’s hashtag project: #WHPspontaneous https://t.co/FU70R1rb7A Now on our Instagram story: how to make custom colors for text and brushes! 🌈 https://t.co/hFSfZhqBDT RT @InStyle: The 7 Most Buzzed-About Golden Globe Nominees on @Instagram this year! https://t.co/DihjkuM5Kp Mapping out new adventures #WHPresolutions2018 https://t.co/9uxeOVOX1A On today’s story: the intricate paper art of RIU ✂️ https://t.co/yZLNGncwrd https://t.co/x6oHQr9hXB Crossing into a new year with high hopes #WHPresolutions2018 https://t.co/aQYX1NN4HL Cherishing the little things for #WHPresolutions2018 https://t.co/8Pr5FbSLfF Today’s story features a real-life gem sorceress 🖤🔮 https://t.co/YqCCnyCuWy https://t.co/vgrxFMo26w More patience, more laughter and an open mind #WHPresolutions2018 https://t.co/ncRmiIARXW Featured submissions from this weekend’s hashtag project: #WHPresolutions2018 https://t.co/lud8SWHmqm On today’s story: we’re on the road with Suki, an adventurous Bengal cat #WeeklyFluff https://t.co/nr1CztRYTk On our story: We’re welcoming all the possibilities 2018 has to offer with artist KangHee Kim https://t.co/6Ulr7O91ls Ringing in 2018 with a festive #myinstagramlogo 🎁✨ https://t.co/8fAt0tUwBY Participate in this weekend’s hashtag project: #WHPresolutions2018 https://t.co/kM8o4x5isH Now on our Instagram story: how to upload from camera roll https://t.co/4lJ5azlyGd A boy and his tree 🎄 #TheWeekOnInstagram https://t.co/ZgeXLxKUSK “The itty bittiest Christmas tree.” 🎄💕 #WHPcelebrate https://t.co/QrQvgIq6Ll A really good hug for #TheWeekOnInstagram 💦 https://t.co/smnJhH3EgP Try our new Kwanzaa stickers! Available now. https://t.co/DVEpsqMKvz Decking the halls — and two Christmas cats — today on our Instagram story https://t.co/w3sdGIXznz https://t.co/X0TbcRXCky On today’s story: We’re hanging out with @arcticreindeer. (No, seriously. We are.) https://t.co/BFvo3GgvpM “You never know when a magical moment can happen.” #TheWeekOnInstagram https://t.co/ua0vXL2zyT Participate in this weekend’s hashtag project: #WHPcelebrate https://t.co/29AVF3f3a1 On today’s story: We’re on an Alaskan adventure with a sassy shiba inu ☃️ 🐾 https://t.co/xavmBabHCf Risking a phone for #WHPstripes https://t.co/kWbGV0SdXo On today’s story: We’re in the kitchen with award-winning French pastry chef @CedricGrolet https://t.co/J2tqQRT5PB You can now send live videos you’re hosting or watching in Direct https://t.co/ejp0cjN1ff https://t.co/YedVqvY0CI “I feel a bit like Little Red Riding Hood between all those black and white stripes.” #WHPstripes https://t.co/fPyy3KTDo3 Feeling the rush of the holidays for #WHPstripes https://t.co/4qlD64dfse On today’s story: in the studio with photographer and activist Delphine Diallo https://t.co/j74xHCjgqQ “Winter vibes at the tea plantation.” 🍵 #WHPstripes https://t.co/r3YYCw6CX1 Two sets of stripes are better than one [books emoji] #WHPstripes https://t.co/WGf75iid6x Watch our story now to see a #flowerflash come to life in New York City 💐 https://t.co/Qv1IxDv9Wu The perfect red light for #WHPstripes https://t.co/UE65v4CB8E Featured submissions from this weekend’s hashtag project: #WHPstripes https://t.co/AiWyeBK1FL On our story: building communities of support on Instagram #IGYearInReview https://t.co/xfyyti6oQB https://t.co/AyPlI42CN4 On today’s story: We’re in the kitchen with @ChefEitanB for #Hanukkah https://t.co/VCJqx41eOD https://t.co/lBvqD6acPy The Week on Instagram | 314 https://t.co/z4vKRs1i9J “For a moment, I felt like I had scored the winning run for the home team.” #TheWeekOnInstagram https://t.co/fjKHg23mOY Now on our Instagram story: how to make a selfie sticker! https://t.co/w4BGAfgtDS Dashing through the snow ❄️ #TheWeekOnInstagram https://t.co/n20RYN7UH6 “When I saw this tree, I fell in love.” 💚#TheWeekOnInstagram https://t.co/hBqK5UJrEH “Friday mood and epic jacket.” #BoomerangOfTheWeek https://t.co/x7ud2p4M9F Participate in this weekend’s hashtag project: #WHPstripes https://t.co/uZP9yPKodA On today’s story: what life is like at Fuzzy Fawn Wildlife https://t.co/zp5zeFmaIT Dogs will be dogs #WHPclassic https://t.co/mEYgBjeN1u Five dogs, one pig #WeeklyFluff https://t.co/HvFLo8Tt7W Adventures in the forest on a “real-life” 🦄 \nhttps://t.co/nTI3wwQwCm An homage to slime #IGYearinReview https://t.co/X0ll6Owupf Celebrate the season and get into the holiday spirit with new Superzoom sound and zoom effects, face filters and stickers! https://t.co/LgS21jFCPh The circus is coming to town #WHPclassic https://t.co/pZ4tYkpaEb Racing to the mountain for #WHPclassic https://t.co/eobMCjuoS3 Discovering new ways to play with paint with artist @Labedzki_Art 🎨 \nhttps://t.co/enIQFtLEo0 The eyelid = the 2017 canvas of choice #IGYearInReview  https://t.co/CN1dbEZIOz An eye-catching play of patterns, spotted in Kyoto #WHPclassic https://t.co/5Ov6BSDUcf RT @MTV: Beyoncé and Selena Gomez are the queens of Instagram in 2017: https://t.co/VCYzdTlfCA https://t.co/yIRPlAY1RT Inside a historic Munich theater #WHPclassic https://t.co/QGNBZNtose Some twins finish each other’s sentences, @Impactbrothers1 finish each other’s flips https://t.co/vIB8dPPqSI New today! You can now follow hashtags on Instagram. https://t.co/RXOHsT9ATC https://t.co/hkCT9BiS9b A firm believer in snail mail #WHPclassic https://t.co/hwIuCmCO5S Happiness captured at a French roller disco #TheWeekOnInstagram\nhttps://t.co/0xidfECsF6 On today’s story: celebrating all things 🌈🦄  with @flourshop #IGYearInReview https://t.co/N3zN5A56Mi A swan passing through interrupts the symmetry of a tranquil lake view. #TheWeekOnInstagram https://t.co/rabC6xVtXk On today’s story: beauty content creator Cheryl Raissa https://t.co/N6g3ezWYxv Friends with flashlights bring an inky night to light #TheWeekOnInstagram https://t.co/QXJOyWzNP2 Participate in this weekend’s hashtag project: #WHPclassic https://t.co/us6yBVpDDm On today’s story: reimagining ordinary objects with visual artist Helga Stentzel https://t.co/UzW3R0yfMd Love, cleverness and smiles — and a mid-air yoga pose #WHPinspired https://t.co/VvVmNnC7p8 Meet our #WeeklyFluff: a strong and patient Staffordshire bull terrier hailing from snowy Oslo, Norway. 🐶 Meet our #WeeklyFluff: a strong and patient Staffordshire bull terrier hailing from snowy Oslo, Norway 🐶 https://t.co/QUCLwqcFXc Watch our story to head into the studio with musician @cacalazzari\nhttps://t.co/sUoH22gNDZ “This spiritual connection is what drives me to hang out at the beach and immerse myself in the surf culture.” #WHPinspired https://t.co/Dvazb5NlF9 The final piece of the puzzle for #WHPinspired https://t.co/cIwalwc6sK Enter the world of kindergarten student and fashion influencer @zooeyinthecity — on our story today https://t.co/rcp3eo9SuS Fall and fog for #WHPinspired 🍁 https://t.co/SFUFhQ0VRA No need to look farther than your bookshelf #WHPinspired https://t.co/TT3oEeeMGZ Polar bear plunges in Coney Island for #WHPinspired https://t.co/nKfGyaxdB7 Two new tools to help you hold on to your favorite Instagram moments: Stories Highlights and Stories Archive: https://t.co/KOTqFp91Cm https://t.co/YDhpiNzBfc Featured submissions from this weekend’s hashtag project: #WHPinspired https://t.co/xZ2ynFIUlR “Telling my story through my dancing is really important to me.” —Ashley Lew 💕  Learn more about her life on today’s story. https://t.co/qXJl1A7HpL ¡#Felizsemana! ¿Cómo pasas tu lunes? https://t.co/QdrDEi9MXO “We need to realize that entire ecosystems are connected, from the very top to the very bottom.” —@PaulNicklen #WildlifeConservationDay https://t.co/sAIxDNToGo You never know who you’ll catch in — or on! — the train. 🚄 #TheWeekOnInstagram https://t.co/braHZ8bs0U The Week on Instagram | 312\nhttps://t.co/7Nytti80hW No birds or planes in this Ponta de Humaitá sky. 😎\nhttps://t.co/K5l7cGYBof The best photobomb ever? 🐒🐒🐒 #TheWeekOnInstagram https://t.co/Gqd0VNP13S “It’s important that young girls can see themselves in women who are placed in positions of power without having to sacrifice or hide or disguise certain parts of who they are.” —@ElaineWelteroth. #TeenVogueSummit https://t.co/eOg3iOr0mz Breakfast bowls (almost) too pretty to eat #BoomerangOfTheWeek https://t.co/8eeltxlpdW Participate in this weekend’s hashtag project: #WHPinspired https://t.co/TfKyXonXEP On today’s story: textures and colors from fiber artist @elizabethpawle https://t.co/lvPQIwHXiT https://t.co/W6FtwJfZ14 Catching a magical sunrise in Norway’s Lofoten Islands #WHPlikealocal https://t.co/PBTC79wPrG “I now cannot imagine my life without Instagram!” —Artist Salavat Fidai #myinstagramlogo https://t.co/5Go2Xs5tDc .@Radianthuman captures vibes with her aura photography. Watch our story to learn about her process.  https://t.co/d0EBtH9eE8 https://t.co/g66DWnP5KN Both an outsider and a local in Lisbon, Portugal #WHPlikealocal https://t.co/3YBmrZzuVu Today’s #WeeklyFluff = a self-proclaimed drama king and blueberry aficionado 🐰 https://t.co/mFfs6G3z4L A hot air balloon, a 💍 and a small Mexican town #WHPlikealocal https://t.co/rLFw7k5Xwc And the top Instagram hashtag of 2017 is... https://t.co/AgFk3hnxh1 Wandering the California highways for #WHPlikealocal https://t.co/ekBKfwH4X9 We’re LIVE with @CBSThisMorning to talk about the top moments on Instagram in 2017. 🎉 Get in on the fun here: https://t.co/0ZMkk1j23w #IGYearInReview RT @CBSThisMorning: WATCH: @Instagram has released their most popular accounts, photos and hashtags of 2017. \n\n@NorahODonnell will take a c… Just another day on the Dal. 🛶 #WHPlikealocal https://t.co/D5sgfTSnGL New in Direct! Remix your friends’ photos with stickers, text and drawings — then send them back! https://t.co/jDzDCgYZgE On today’s story: sparking distraction and connection with street artist @RAE_BK https://t.co/hjdbp3ymyA https://t.co/Lfa0saDM5i “They run the show and go home.” 🐫 #WHPlikealocal https://t.co/uTQsr5ODTw Featured submissions from this weekend’s hashtag project: #WHPlikealocal https://t.co/VCGAm3tv3R RT @HarvardBiz: How We Reorganized Instagram’s Engineering Team While Quadrupling Its Size https://t.co/8QsvwaMKOz Now on our Instagram story: how to make custom colors for text and brushes! 🌈 https://t.co/BcevzU8qLJ On today’s story for #SmallBusinessSaturday: in the @LamonLuther wood shop https://t.co/o7InLVJzep Participate in this weekend’s hashtag project: #WHPlikealocal https://t.co/P1znFyw80n Cherishing the moment on a beach in New Zealand 🏄 #WHPthankful https://t.co/hlf4vCT3u4 On today’s Instagram story: in the kitchen for #Thanksgiving with 16-year-old chef and health activist @hailevthomas https://t.co/9Txas6tEes Thankful for this autumn bounty 🍁 #WHPthankful https://t.co/xKkAbubaZx On today’s story: portraits by 20-year-old photography student Malike Sidibe https://t.co/xzIpA2Gr14 In Japan, it’s the season for rainy days and yellow ginkgo leaves #TheWeekOnInstagram https://t.co/dUN8ePXj5a “#WHPthankful inspired me to slowly look around and see what is really important in life.” https://t.co/dzXkZseFOZ Taking in the sunrise from high above the clouds ✈️ #WHPthankful https://t.co/bI4K839LJq Like two peas in a pod 👭 #TheWeekOnInstagram https://t.co/xrXBQOjHzb “I have experienced hundreds of adventures, met amazing people and visited the most distant places.” 📚 #WHPthankful https://t.co/L26adEW4oE Today’s #WeeklyFluff is shockingly relatable 😱 https://t.co/oe8LgZvhNz New! When watching a friend’s live video, tap the “Request” button to let them know you'd like to join in. https://t.co/Xb6S969YJU Thankful for four-legged friendship 🐶 #WHPthankful https://t.co/iyUFtRrdDg Featured submissions from this weekend’s hashtag project: #WHPthankful https://t.co/Q7IUryMCMj We’re all smiles seaside for the #TheWeekOnInstagram https://t.co/s2okwjwILa Tune into @ukwomenshealth tomorrow for an #InstagramLive panel all about mental health. It's happening at 4PM GMT #MYSTRONGMIND On today’s story: a @laura_makeup tutorial just for us 💕 https://t.co/8CKLSZb9oV On today’s story: yo-yo stars show off their skills in Singapore 🌀 https://t.co/JelX3FbGzd The Week on Instagram | 311 https://t.co/piBrCaXvPD We’re jumping for joy with today’s #BoomerangOfTheWeek https://t.co/eRlcYJ5YYL Participate in this weekend’s hashtag project: #WHPthankful https://t.co/ryH6bisshb On our story: last night with @maluma at the @LatinGRAMMYs 🎶 https://t.co/GlHdTazPKD RT @FastCompany: The no-filter leadership style of @instagram COO Marne Levine https://t.co/QZfC7qNYLT https://t.co/bcx9v2uC4L Golden hour in South Australia for #WHPfindthelight ✨ https://t.co/8kVTSBYvdv Our #WeeklyFluff = an exotic shorthair 🐱 from Japan https://t.co/qA6NW6ARpG https://t.co/FDTqjvoe4K The glow beyond the glass #WHPfindthelight https://t.co/DEGYxeaXS2 “It was just a case of waiting for the right moment.” 👒 #TheWeekOnInstagram https://t.co/TY1hXLc5rx Three types of movement for #TheWeekOnInstagram 🕺 https://t.co/D7zCxTqPnZ Waiting patiently in the shadow for #WHPfindthelight https://t.co/t7iVOQ9Qwa On today’s Instagram story: bringing visibility to Latin American ballet dancers with @OmarZRobles https://t.co/stLXW62ZnU A photo-worthy everyday New York City scene #WHPfindthelight https://t.co/mv4DvAXWGD “I like the color. I think it tells the story.” #TheWeekOnInstagram https://t.co/0S0fJtTKUc “The crazy sun flares often come out for him.” #WHPfindthelight https://t.co/7m82XapBob The perfect beam for #WHPfindthelight https://t.co/emImr8QCwD Seeking new heights for #TheWeekOnInstagram https://t.co/iT4OUZD8Dn Featured submissions from this weekend’s hashtag project: #WHPfindthelight https://t.co/6595MBcKYg On our story: models — including @Kinglimaa — share their favorite #KindComments for #WorldKindnessDay ❤️ https://t.co/48sX3VUep3 On our Instagram story: illustrator Karina Doniho paints with watercolors 🎨 https://t.co/nOoiznJgHJ The Week on Instagram | 310\nhttps://t.co/eM5hpPw6i3 On today’s story: the secret lives of African elephants with Connie Allen https://t.co/by7ItK7K4m Gary the Cat stars in our #BoomerangOfTheWeek https://t.co/EOUYJPLY0K Participate in this weekend’s hashtag project: #WHPfindthelight https://t.co/tfttT0AGI7 Tune in to our story to hang out with @taylorswift13 — and her cats 😻 https://t.co/XBDxtNXhE3 Foggy weather on the coast + a chance encounter with wild horses = #TheWeekOnInstagram https://t.co/DnbTLKDcEV Today’s story: American veteran @AstroZed186, then and now https://t.co/0FWFA0PaqC Say hello to Tachi the shiba inu #WHPpetproject https://t.co/2DW9r94qAi A cohesive pack for #WHPpetproject ❤️ https://t.co/KcGwBJF5jx Watch today’s story to catch up with @johngreen on his latest book tour 🐢 https://t.co/cU0qnkvW9n 🐎 &gt; 🚎 for this little birdie. #WHPpetproject https://t.co/PGBfDKycuc “Exploring is about seeing things from different angles.” #TheWeekOnInstagram https://t.co/aIYb9t9yuL A French bulldog with a view #WHPpetproject 🌊 https://t.co/ddluBkap2j Dive into today’s story with synchronized swimmers Sirenas 💦 https://t.co/HnxaxYyqak A small + a medium + a large pup, all in a row for #WHPpetproject https://t.co/hDkZ5YsUtR A friend who has your back 🐶❤️ #TheWeekOnInstagram https://t.co/yJzSknMBsL Featured submissions from this weekend’s hashtag project: #WHPpetproject https://t.co/euRP1I34Yi Tune in to our Instagram story to go behind the scenes of the @NRJhitmusiconly with French singer @louane 🎤 https://t.co/OqXQY9Ybrc The Week on Instagram | 309 https://t.co/lQlgA2hwm3 On our story now: the 2017 #GettyImagesInstagramGrant recipients and honoree Nora Lorek https://t.co/6DR53BzZI2 A boy and his ⚽️ = inseparable #BoomerangOfTheWeek https://t.co/kNNXiOIEG3 Participate in this weekend’s hashtag project: #WHPpetproject https://t.co/JBKkodiBSS Happening now on our Instagram story 👉 how to make a Superzoom! https://t.co/BFZcVnnMuF “I love creating weird things!” —@BananAlawneh\nhttps://t.co/9H4bFEgRUB Tune in to our story with @TheMandyMoore on the set of @NBCThisIsUs ❤️ https://t.co/DNmQFMmmfC Today’s #WeeklyFluff = even better than a pot of gold 🌈 https://t.co/NXwjcgBNgN On today’s story: celebrating Día de Muertos with @Artelexia 💀🌹 https://t.co/X1zwKJAYY7 A ghost in the curtains for #WHPpretend https://t.co/hDdr9iA5Ui Standing out for #WHPpretend https://t.co/1YaWOKw9Z9 Happy #Halloween! Share your story with spooky face filters and stickers 🎃 https://t.co/n4G4tRb7Wp Instagram is now available in three right-to-left languages on Android: Arabic, Hebrew and Farsi. https://t.co/cyEKCLmK3p https://t.co/wB8ZQbVUJM Dreams do come true #WHPpretend https://t.co/e8HSgglYy4 Osaka’s color and speed 🚕  #TheWeekOnInstagram https://t.co/ppD8A28hSF Featured submissions from this weekend’s hashtag project: #WHPpretend https://t.co/ONbssxJubC Up, up and away! #TheWeekOnInstagram https://t.co/4thcbA7fTm These are not your average 🎃. Watch our Instagram story now! https://t.co/aGEq7kg2n5 https://t.co/tDZ6AUe7pj Foggy woods lend themselves to self-expression for #TheWeekOnInstagram https://t.co/9FBoQoZFIr Today's story: at the #FestivalOfRainbows with makeup artist @DanielzROTFL 🌈 https://t.co/ayAYBljrZW The Week on Instagram | 308\nhttps://t.co/jvEVkBRFnW On today’s story: in the kitchen with baker Chelsey White 🕸 https://t.co/K9QiLk5bwi Participate in this weekend’s hashtag project: #WHPpretend https://t.co/GUM7Enev0o On today’s Instagram story: illusionary body art from Dain Yoon 👀\nhttps://t.co/6d3kDSfIrM “They just decided they wanted to play with us.” 🐬 #WHPperfectpair https://t.co/muavZyU0eC Zoooom in on your friends with Superzoom, an easy way to record a funny video with dramatic sound! 🎵 📷 https://t.co/LVzku13qmO On our story: costumed pups from the Tompkins Square Halloween Dog Parade 🐶❤️🎃 https://t.co/u7K2L6VAr3 Get spooky with our new Halloween face filters and stickers! 🎃 💀\nhttps://t.co/qxBfvrhxgW https://t.co/U4OdP9N6kw Two “royal” brothers #WHPperfectpair 👑 https://t.co/iDwgFXSDIO Rain at twilight set the scene in Tokyo #TheWeekOnInstagram https://t.co/ptXKT1Z0bN The countdown to #Halloween begins! 🎃  Watch our Instagram story with @mabgraves now #MabsDrawlloweenClub https://t.co/c2BI0plaLw A man and a museum are the perfect match for #WHPperfectpair https://t.co/YizaMJSaD6 This is @ninarobinsonnyc’s Arkansas Family Album #GettyImagesInstagramGrant https://t.co/3ccw5l2oi2 Even the best duos can be out of sync. #WHPperfectpair https://t.co/wv0FhlMOJY Photojournalist @saumyaphotos documents the reality of child brides #GettyImagesInstagramGrant https://t.co/KSwIvDJaNg A sunset, a donkey, a memory. #TheWeekOnInstagram https://t.co/5WvSfMURCT RT @ABCWorldNews: Check out @DavidMuir on @Instagram -- his first Instagram story is LIVE -- find out where David ended up today... https:/… No two kitties are more of a #WHPperfectpair. 😻 https://t.co/jvlOX5T2Ry We’re live on Instagram NOW with @KingBach. Ask a question: https://t.co/0ZMkk1j23w Starting today, you can go live with a friend on Instagram. Learn more here: https://t.co/mFZPyWh8Ih Two times the 🌊🌞 for #WHPperfectpair https://t.co/wun1I03mRJ Featured submissions from this weekend’s hashtag project: #WHPperfectpair https://t.co/TiEmqU8bcI Today’s story = a seaside adventure in Rio with highline athletes https://t.co/6VNsYbUf9V Nico the golden retriever + golden light over the Dolomites = #TheWeekOnInstagram https://t.co/SlXRSmfMLx The Week on Instagram | 307\nhttps://t.co/4p836Rn9Dd On our story: a savory cake that’s a work of art 🍜\nhttps://t.co/oWRVf7SHti Anastasia from Moscow ... or a modern-day Alice in Wonderland? 🐰 #BoomerangOfTheWeek https://t.co/sh5zqbhCGC RT @MRPORTERLIVE: The many stories of @instagram's billionaire founder: https://t.co/sqoRdShSyC https://t.co/i6JFMGkX3D Participate in this weekend’s hashtag project: #WHPperfectpair https://t.co/AVC44q1Qpp On our story: a day in the life of dancer Angelnae Randalle\nhttps://t.co/467ql30w8G Round and round we go 🌀 #TheWeekOnInstagram https://t.co/K6dcdxP7Do Friends + photos = #WHPmyeveryday https://t.co/495iWR2GCY Despite stage 4 breast cancer, Brittney Beadle thrives #BreastCancerAwareness https://t.co/oqOcjraCyH A boy and his great-grandmother ❤️📷 #WHPmyeveryday https://t.co/X3YWC9efdI Perfecting her form for #TheWeekOnInstagram 🏊 https://t.co/AxCUcjvlSa Downtown Los Angeles vibes #WHPmyeveryday https://t.co/9JyvEHk3hy On our story now: #Diwali celebrations from all over India\nhttps://t.co/zuFZz18ELv Poetry as daily inspiration 🕊 #WHPmyeveryday https://t.co/pvQjvfNWrR RT @GirlUp: Oct. 17 is Body Confidence Day and together w/ @seventeen &amp; @instagram we want to know what makes you feel your best by using #… RT @seventeen: Body Confidence Day is Back! https://t.co/zXvi0TXVye https://t.co/SuCKjZuHpk Wise Words from 13-Year-old Leia Immanuel #NationalBodyConfidenceDay #PerfectlyMe https://t.co/kAwhFr0Wlt A daily visit to the bus terminal for #WHPmyeveryday 🚌 https://t.co/WetBTeGJ79 Flowers brighten up the weekend in Brazil 💐 #TheWeekOnInstagram https://t.co/vhFOP7qjNg Featured submissions from this weekend’s hashtag project: #WHPmyeveryday https://t.co/VnWb5UAPFm .@milkwoodfarm teaches others to build sustainable systems #WorldFoodDay https://t.co/SHXEoU71ZB One of these things is not like the other… 🐑  #TheWeekOnInstagram https://t.co/YKG7ZMo8oP Get to know the world and colorful style of @cocodavez on today’s story! 🎨 https://t.co/MAEMLJ2Huk The Week on Instagram | 306\nhttps://t.co/npb7hd2eV2 A weird (in a good way!) stress ball #BoomerangOfTheWeek https://t.co/YGPljd8pwl RT @CBSThisMorning: .@Instagram's COO on creating \"technology for kindness\" \n https://t.co/5iKEEortfY #KindComments https://t.co/T6QijR0itJ Participate in this weekend’s hashtag project: #WHPmyeveryday https://t.co/A3oiVzvA8Q Head to our Instagram story now: try the new poll sticker! https://t.co/IoMMOm4n8W A pop of Norwegian autumn against the mountains for #WHPseasons 🍁 https://t.co/4UvMkW0wBm “Time for broths, soups and spicy curries.” 🌶 #WHPseasons https://t.co/KMfNnxIUZc “Just be yourself.” —18-year-old @ShaliceAder 💪 https://t.co/6UmbjX0s4q We're live on Instagram NOW with @AnselElgort. Ask a question: https://t.co/0ZMkk1j23w A day at the beach in the off season for #WHPseasons 🌧 https://t.co/pRu2Qur8w5 We're about to go LIVE on Instagram with @AnselElgort. Be sure to tune in! Meet @dallasclayton, one of the #KindComments muralists https://t.co/0MEGurzq66 RT @washingtonian: Instagram’s #KindComments Campaign Is Coming to Union Market With An Inspiring New Mural\n\nhttps://t.co/VaRuGN4iu5 https:… 🍁 &gt; 👧 #WHPseasons https://t.co/HZLHWEWmym A fall bounty — made with paper #WHPseasons https://t.co/BuDHcaqsdO Today's #WeeklyFluff features two pleasant piggies 🐷 🐷 ⚡️ https://t.co/BSG0YMGrah Autumn's golden light = 🙌✨ #WHPseasons https://t.co/8t71ySK9eU Featured submissions from this weekend’s hashtag project: #WHPseasons https://t.co/9XiC7vfDCg Explore St. Moritz with Fabio Zingg on our Instagram story right now ⛰ https://t.co/4IGlfcKVpp Driving home with the beach 🏄 #TheWeekOnInstagram https://t.co/od8UBfL3Xj Oh, hello Liouba the cat. We didn’t see you up there. 😸 #TheWeekOnInstagram https://t.co/RljC5dnNLP The Week on Instagram | 305\nhttps://t.co/jLYH93yx0h “The sunset. The ocean. The dress. My beautiful wife on the pier.”\n#Boomerang by @backmango https://t.co/uom3RkX7QI Participate in this weekend’s hashtag project: #WHPseasons https://t.co/12UGv6cv0w Nature, literature and photography collide #myinstagramlogo https://t.co/Rjy435Rk5j 232 toy cars work together for #myinstagramlogo https://t.co/QJ3hr9veos A sweet treat born from a creative block #myinstagramlogo https://t.co/MXjRsGrGAE Free as a bird 🕊 #TheWeekOnInstagram https://t.co/QCeaDRwf33 Today’s #WeeklyFluff is a crew of three canines that hail from Minnesota https://t.co/A6YJovviC3 From a small English town, @gullyguyleo is king of unique British fashion\nhttps://t.co/ol5iOWKy2l RT @InStyle: Watch Jessica Alba, Candice Huffine, and more take part in @Instagram's #KindComments campaign! ❤️  https://t.co/nG5MSap0JF Friends, photography and the 🌅 #WHPdayoff https://t.co/eClPDwMN3C Brighten up the moment with our new face filter! ☀️ https://t.co/ON9UO28ZFr A true harvest 🌽 #TheWeekOnInstagram https://t.co/8W33ke2KZH A lazy afternoon + favorite armchair = #WHPdayoff 🐶 https://t.co/IkGFB3bs7Q There are two new creative tools for Instagram Stories: a color picker for text and brushes and an alignment tool for text and stickers. https://t.co/d5rGKRQY23 Perched 🐦  #TheWeekOnInstagram https://t.co/PZMndq489y Creating meaningful experiences around food with 14-year-old @ChefJoshR 🍜 \nhttps://t.co/2lg2E9IXY4 Catching the day’s first light for #WHPdayoff 🤸‍♂️ https://t.co/FFpdzy7h4s Introducing an interactive poll sticker in Instagram Stories. What will you ask your friends? https://t.co/XvkDD0l9aH https://t.co/5Tbg5ozKP7 Featured submissions from this weekend’s hashtag project: #WHPdayoff https://t.co/Hm6aUunRiU RT @FastCompany: How Instagram became the music industry’s most powerful weapon https://t.co/f6bvjaqTep https://t.co/9i0EQs6RQ5 On our Instagram story: skateboarding in Jakarta https://t.co/vlDC21yKvi Wild higanbana mark the beginning of fall. 🍁 #TheWeekOnInstagram https://t.co/QlM3fy38Bn The Week on Instagram | 304\nhttps://t.co/A1BW9ruUFa Watch our Instagram story now to see the world through Tasneem’s 👀 https://t.co/AeTp7riHZt Participate in this weekend’s hashtag project: #WHPdayoff https://t.co/eUYwtvDa8a .@LaGuelaguetza puts family — and Oaxacan pride — first \nhttps://t.co/hJUsYyXFZX Today’s #WeeklyFluff = a teeny-tiny vacuum cleaner 🐹 https://t.co/ekI3r9xaxY A ring of 🔥 for #WHPdynamic 💫 https://t.co/CWiuoGzqGw Put on a pair of shades and transport yourself to locations all over the world with our new face filter! 😎🌍 https://t.co/mcctbEy3mT RT @BuzzFeedNews: Instagram now lets you limit comments just to people you follow\nhttps://t.co/27HHBpEohn Taking the leap 🤸‍♂️ #WHPdynamic https://t.co/Dms0cuYVdm RT @glamourmag: This new Instagram feature helps users dealing with mental health issues: https://t.co/zgHkI2CbbN https://t.co/FMIXHCUTui RT @Cosmopolitan: Instagram Rolled Out an Awesome New Feature to Counter Trolls https://t.co/L2tF6X61zX https://t.co/GLd5jPJJGC RT @TeenVogue: Chella Man opens up about #kindcomments on Instagram ⬇️ https://t.co/r998eYxqOJ Laundry time! #WHPdynamic https://t.co/hQ4ql3AW4S Blue hair. Blue eyes. 💙 Watch @TheNaomiJon on our story right now https://t.co/9Zol5IiDfF .@sweetllamita’s greeting cards aim to celebrate everyone ✌️https://t.co/Eck9f0JN2B #HispanicHeritageMonth Light and dust create a cinematic scene around this spinning motorcycle. 🏍 #WHPdynamic https://t.co/NE0YkdIeUh “Ear-resistible!” 🐶💕 #WHPdynamic https://t.co/3qhf9wBK72 Meet @lakwenamaciver, one of the #KindComments muralists https://t.co/w9wwftLGwm A soaring skateboarder + a peaceful landscape = #WHPdynamic https://t.co/0m4RlFaHWL Today, we’re releasing new tools to help manage your comments experience https://t.co/wHmg7LJCKb “The Paykan is an old and memorable car for most Iranians.” 🚘 #TheWeekOnInstagram https://t.co/0x6MS4kUQC Featured submissions from this weekend’s hashtag project: #WHPdynamic https://t.co/x7fRdAbLjL Extreme unicyclist Pierre Sturny wants you to know that his sport is not just for the circus https://t.co/54Khi42exi A feeding frenzy + fleeting summer = #TheWeekOnInstagram 🌞 https://t.co/esbq28mVGz An unexpected third party 🐍 #TheWeekOnInstagram https://t.co/MAJxPxsLLD An early morning scene in Ukraine’s Carpathian Mountains 🐴🐴 #TheWeekOnInstagram\nhttps://t.co/HmZnqM9gLJ Watch our Instagram story to see Jayde’s coverage and illustrations from @gucci at #MFW https://t.co/buH9XiXiuj The Week on Instagram | 303\nhttps://t.co/8915CRn6zb Cultivating talent and preserving traditions at @penumbranyc https://t.co/zkmmvTlCw4 Seeking fields of gold 🌻 #BoomerangOfTheWeek https://t.co/fR7vSG7Bsy Participate in this weekend’s hashtag project: #WHPdynamic https://t.co/CpUJRKdPOX Photographer Elias Williams aim = capture people’s complexity through portraits https://t.co/ptKHGSMpay Introducing new stickers to help you celebrate the changing seasons. https://t.co/bfPMxG7EeQ Exclusive, new face filter in live video! Tap to change the “scenery” 🕶 🌎 https://t.co/Lj1dGQsRAo A family love for food and 🚲 = #WHPmadewithlove https://t.co/Z1igLlm56Z Meet today’s #WeeklyFluff: a 🐰 whose twitchy nose, perky ears and chubby cheeks have us feeling all kinds of 😍  https://t.co/mmFMIMH6jL Starting today, you can play with face filters while sharing live video! ✨\nhttps://t.co/YY2xeHfLPi https://t.co/O79lGe4rlc A toy taxi enters Manhattan's fast lane 🚕 #WHPmadewithlove https://t.co/8HFXJAJbfV 🍯 &gt; ink for Hebrew typographer Enon Avital https://t.co/HLv33JCm2a Watch our Instagram story to join fashion blogger Susie Lau in the front row of London Fashion Week https://t.co/jUsn1SGjJl Soap bubbles = always a good idea ✨ #TheWeekOnInstagram https://t.co/kp1C2ccW3f Watch our Instagram story to spend the day with @jtimberlake at @rockinrio 🕺 https://t.co/oRD8P7RzCv Alone with nature🌲 #TheWeekOnInstagram https://t.co/sTBaZcR9qP The ingredients for knitting a long scarf with a curious cat: a lot of yarn, patience &amp; a bit of ❤️#WHPmadewithlove https://t.co/MakUAl0Ohj Turning roadside tansies into art 🌼 #WHPmadewithlove https://t.co/2usQFlMXYM Light, love and a long exposure for #WHPmadewithlove https://t.co/66AGG1I1l2 “The image suggests it was quieter than it really was.” 🏠 #TheWeekOnInstagram https://t.co/AWdV3Cv07G Tune into our Instagram story to hang with @YaraShahidi at the #Emmys ✨ https://t.co/pOzTjUntYS Talking comedy with #Emmys host Stephen Colbert of @colbertlateshow https://t.co/S5bYwqfpMm The Week on Instagram | 302\nhttps://t.co/5UQOKcTCci “My boys wanted their car to have a roof, so I quickly drew it in ... in stories!” 🚗\n #BoomerangOfTheWeek https://t.co/LrZRgTxuWf Creating inclusive Latino communities one denim jacket at a time with @hijadetumadrela #HispanicHeritageMonth https://t.co/9BxkWEy1uY Participate in this weekend’s hashtag project: #WHPmadewithlove https://t.co/zpSOxBf2dX A heart-filled image from Russia is this month’s #myinstagramlogo ❤️ https://t.co/4o3RlzHEwV Happening now on our Instagram story: how to make rainbow text in stories! 🌈 https://t.co/B4f9VXqHPx Discovering a love of portrait photography in Japan during #WWIM16💌\nhttps://t.co/3Zk8mEAwF9 New in Direct! Text reply with a photo. Simply type your message and tap the camera. On Android today, with iOS coming soon. https://t.co/n1h1ZUy9tZ Meet Serena and Donatella, two smooching golden retriever sisters #WeeklyFluff 😘 🐶 https://t.co/aCfXa4R84s Watch our Instagram story now to check out #NYFW with the creative directors of @OscardelaRenta and Monse. 👠 https://t.co/favdZJoRGx Grab a friend and set out on an adventure with our new face filter! 🏍 🌈 https://t.co/Ml7wbdAPwj On the cliff’s edge with a canine companion #TWOI https://t.co/vx4XWuTmQ4 An epic selfie in Mexico City #WWIM16💌 https://t.co/nSF5mg5PYv A circle of love from Indonesia for #WWIM16💌 #KindComments https://t.co/snKac7LJsF Watch our Instagram story to look behind the scenes of photographer Luisa Dörr’s portraits for @TIME “Firsts” https://t.co/BH4JgdmSAD When you discover a story you want to share, tap the direct icon, select who you want to share it with and hit send. https://t.co/Gj9xxZlHv4 Now you can share stories with friends in Direct! \nhttps://t.co/CI63tDxruE https://t.co/hHzykk5X5k One way to celebrate community: gather your friends together in a sweeping, coordinated pose #WWIM16💌 \nhttps://t.co/fOgMfRmPcY Industrial grays and bright billowing ribbons in Montreal #TWOI https://t.co/t2fCfgqmBv Watch our Instagram story right now! We’re jet-setting around the world for #WWIM16💌 #KindComments https://t.co/JVru39kS9N You’ve got mail from Banda Aceh, Indonesia! #WWIM16💌 #KindComments\nhttps://t.co/9BM5rNzXEI Summer’s end, sunset and a waterslide at the Opatija Riviera #TWOI https://t.co/YwhcCK1ART Turning custom kicks into a business with @vintagewavez 👟 https://t.co/WLtVpTqsN6 The Week on Instagram | 301\nhttps://t.co/n6qgMidr0w Watch our Instagram story to see this 17-year-old’s fingerboarding tricks ✌️\n https://t.co/NC4CXn906c “I try to do at least one good deed every day.” —@Soraky118 #WWIM16💌  #KindComments https://t.co/fM5MezfJ40 Taking in the morning mist 🦌 #WHPgreatoutdoors https://t.co/pDEObUMyXd Worldwide InstaMeet 16 (#WWIM16💌) is happening this weekend, September 8-10! https://t.co/fwGOBLIkbI Making mail awesome and sending #KindComments with Lucy Halcomb #WWIM16💌\n https://t.co/QRQT9K4pKx A young fisherwoman heads home in Iran #WHPgreatoutdoors https://t.co/l1C6vpLoQB The path to a peaceful future ☮️ #WHPgreatoutdoors https://t.co/ZND9fkELjJ Watch our Instagram story now to catch up with the cast of @DearEvanHansen in New York City #WWIM16💌 #KindComments https://t.co/mpL0D3WKOd A first-time visit to Niagara Falls for #WHPgreatoutdoors 💦https://t.co/2Ym2Nwuund Limestone caves + midday sun = 🙌 #WHPgreatoutdoors https://t.co/jbCSW854HD Meet Gracie, a refined rescue cat living with two adorably feisty rescue kittens #WeeklyFluff 😸😸😸 https://t.co/icJUShAQJt Watch our Instagram story to see @JacobFrerod’s stop-motion videos —celebrating WWIM16.  #WWIM16💌  #KindComments https://t.co/6un5W6fde8 Taking a cool leap into warm Indonesian waters #WHPgreatoutdoors https://t.co/b0Bo190oGg Featured submissions from this weekend’s hashtag project: #WHPgreatoutdoors https://t.co/gkWg1Sx3d0 Watch our Instagram story to see colorful looks from a makeup maestro 🌈💄\nhttps://t.co/5bngVgVkGu Watch our story now to see coverage from this year’s hajj by @AhmadMousaQ and @mastirham https://t.co/MK41A8d4RB Standing guard 🤖 #TheWeekOnInstagram https://t.co/3djkYwl3Pn Watch our Instagram story now to join @AmandaCerny and @PrillyBie for an afternoon in Jakarta 💃 https://t.co/LFqWfv2Bf8 The Week on Instagram | 300\nhttps://t.co/Pn7RUl7C5r Lights, shadows and one lazy kitty 😸 #BoomerangOfTheWeek https://t.co/5Xwj6mNYHJ “This photo is about how random and crazy we both can get when we are together.” 🙃 #TheWeekOnInstagram https://t.co/3BqCFG9383 Participate in this weekend’s hashtag project: #WHPgreatoutdoors https://t.co/6dHa3K1OoJ Watch our Instagram story to see competitive cheerleader @KylanaWhitley hit the mat 🤸🏿‍♂️ https://t.co/L42ewK7Pto Symmetry from above in Mexico City 💞 #TheWeekOnInstagram https://t.co/RqTzyFTDqH “Impossible is just an opinion.” 😇☁️ #WHPimagine https://t.co/zQxZtFLo37 Merging online and offline worlds with @helloluckycards #KindComments 💌 https://t.co/hiI8Lm0qk2 Share your #mood with our new weather-inspired face filters 🌤 https://t.co/FJ5UlbY8BW Surrealist-inspired photos = #WHPimagine https://t.co/6XBs5W6BZd An unexpected rainbow and a sweet embrace 🌈 #WHPimagine https://t.co/c3e9osJNOe Meet today’s #WeeklyFluff: Munji the cat, a regal and eccentric bundle of white fur 👑\nhttps://t.co/gSKvM0z2uC “I’m seeking out threads of color and veins of light that play with each other.” —Madz Rehorek #WhereIComeFrom https://t.co/q9e6ZxKj7Q Sunlight turns an average park into an otherworldly scene #WHPimagine https://t.co/VEXqYXYCX0 “Listen to the water.” #TheWeekOnInstagram https://t.co/v5dRc4AkL3 A view over the water + daydreams of adventure = #WHPimagine https://t.co/oRQp8QOVYG “I hope that people see my photos as a form of escape — a sunny, blue escape.” —Photographer Demo Zervoudakis https://t.co/LJo710KR01 Starting today, you can choose landscape and portrait formats when sharing multiple photos and videos in one post. https://t.co/Lg1wiuRzxT When reflections and reality meet 🎊 #WHPimagine https://t.co/JLcsKd0qpo Kuzma the cat + life lessons = #TheWeekOnInstagram 😸  https://t.co/wS9Ku0vDWG Featured submissions from this weekend’s hashtag project: #WHPimagine https://t.co/Mjiv8a96pV “It was like I’d seen the whole movie already and we just needed to film it.” #TIFFxInstagram 🎥🤳 https://t.co/8sVRwR2JrW RT @TIFF_NET: Congrats to all this year's #TIFFxInstagram films 📺 Catch-up on these amazing 60 second digital shorts here.  \n\nhttps://t.co/… RT @TIFF_NET: Natalia Gurkina's CONFESSION is the #TIFFxInstagram Jury's Choice by Isabelle Huppert @AshDSanders @idirectorx @karanjohar &amp;… “They looked how I felt — in awe.” 🌞🌝 #TheWeekOnInstagram https://t.co/90kZF43lVR Watch our Instagram story now as we go behind the scenes with @FifthHarmony at the @vmas 🎤 https://t.co/fWfwhnRW7t https://t.co/sSihyrttnQ The Week on Instagram | 299\nhttps://t.co/Iha3OSsW97 Watch our Instagram story now to experience @afropunk with @sza https://t.co/u5UO29AU7Z How fun it can be to change what you see #BoomerangOfTheWeek 🌱 https://t.co/7muizPzhlq Participate in this weekend’s hashtag project: #WHPimagine https://t.co/HWIekgoVuq “To form my own narrative, I learned the stories of my heritage.” —Artist @kaylabriet #WhereIComeFrom https://t.co/53P81e3X0K Low temperatures and high winds can’t stop these surfers. 🏄 #WHPadventure https://t.co/crJZAFHXmz “Our mission is to be a catalyst for women to claim their power.” —@pieraluisa for @Refinery29 #WWIM16💌  #KindComments “In darkness, there is always a light.” #WHPadventure https://t.co/sf9alUgoL2 In Japan, summer is a time for suikawari 🍉 #TheWeekOnInstagram https://t.co/kriqu7B73x Meet today’s #WeeklyFluff: a French bulldog living his best life🍴😴 💩 https://t.co/mQfwYlMMkS An ordinary — yet extraordinary — evening at the beach 🌊 #WHPadventure https://t.co/edHvGYw5yf Tap on our new rainbow filter to brighten up your day 🌈 https://t.co/Va0tdjJxwe “We are only a small part of the universe.” #WHPadventure https://t.co/qdM0mF8l4H “This scene looks very unreal, and that’s what I like about it.”  🌬️ #TheWeekOnInstagram https://t.co/NrV9iS53zR Finding adventure on the daily commute 👀 #WHPadventure https://t.co/MrPCI3u0qB “Zero to not-quite-seagull-speed in 60 seconds.” #WHPadventure https://t.co/41RFLbZkgX A moment of stillness in the Brazilian countryside 🌼  #TheWeekOnInstagram https://t.co/vWYGKfa5bW Watch our Instagram story featuring @BillNye now to see scenes across the United States from today’s #SolarEclipse. 🌞 🌝 https://t.co/RzgJwGyXvD “Seeing the sky go dark and a ring of fire suddenly appear was an extraordinary experience.” —@dave_krugman https://t.co/HdwPsiuEk1 RT @nytimesphoto: We asked people along the path of totality show us how they watched today's eclipse. The view across the country: https:/… Featured submissions from this weekend’s hashtag project: #WHPadventure https://t.co/KoB8mzShmi A majestic feline takes a leap of faith in Japan 😸   #TheWeekOnInstagram https://t.co/grBat5l9Mx @peachystudy shares the beauty of organized homework on our Instagram story 📓\n https://t.co/RD53TJZLa0 The Week on Instagram | 298\nhttps://t.co/rNpDPqTGIP Introducing three new stickers to celebrate the upcoming total solar eclipse! https://t.co/qixXvNh4F7 We’re diving into the weekend with this #BoomerangOfTheWeek 💦 https://t.co/z5zQGn4rQg Participate in this weekend’s hashtag project: #WHPadventure https://t.co/7heObRqkg8 RT @TIFF_NET: #TIFFxInstagram Shorts Festival wraps-up on August 20. Watch + vote for your favourites by liking them 💙📲 now: https://t.co/H… “The greatest victims are the families who try to survive surrounded by war.” —@felipedana #WorldHumanitarianDay https://t.co/2HRBPIGWie RT @NASA: On @Instagram? Celebrate Monday's #Eclipse2017 with new camera stickers showing the Moon blocking the Sun: https://t.co/Gl0JYJaiv… Bath time, anyone? 🐥 #WHPmini https://t.co/lUeHukFZfH “A day without books is a sad day for me.” —@emiibook 📚\n https://t.co/GJgaocFZ7a New! Reply with photos and videos to specific re-shares, photos and videos in Direct. https://t.co/ADJTw3uEcv A Malaysian architect reinterprets a local coffee shop for #WHPmini ☕️ https://t.co/YbG23CiHUL Traveling through time in Mexico ☔️ #TheWeekOnInstagram https://t.co/kffsocGSdv Drones have a knack for making everything appear small #WHPmini https://t.co/Td3WcJ8WrO Meet today’s #WeeklyFluff: a curious and cuddly parakeet named Ziggy. 💚 https://t.co/CW2dV8JbE2 Try our new, customizable face filter that celebrates 1960s style. Tap the accessories to mix &amp; match your look! ✌️ https://t.co/CuPHJHvmEe https://t.co/IciItfvvEs “I try to look at my identity as a piece of art I’m creating — hair, makeup and styling are my tools” —Toshada Uma https://t.co/gY6v3zVJKt “Growing up in the countryside, I’ve always been inspired by our garden and flowers.” —@amybethellice 🍰 https://t.co/1REsOJ7ujf Heading back to school? Make your stories even more expressive with new stickers and a chalk brush. https://t.co/VOlwBISytm “When you’re a whole lot smaller than your 6’4” brother” = #WHPmini 👶 https://t.co/AXTCQMRAlu Maté, sunsets and horses #TheWeekOnInstagram https://t.co/vCmnzIxx5s Miniature (paper) yellow rain boots for a rainy weekend ☔️ #WHPmini https://t.co/fNb5bq9GHs Watch our Instagram story to take a look inside the world of @Harper_Watters: classical ballet, with a twist 👠 https://t.co/pO1gsKgPjK Featured submissions from this weekend’s hashtag project: #WHPmini https://t.co/NNv8GM4KAL A tiny, leaping frog for #WHPmini 🐸 https://t.co/BpUZHxypXq “I wanted to show the color of summer.” 🌻 #TheWeekOnInstagram https://t.co/7hYU3ZXef3 #SchoolOfHustle is officially in session! Tune in to https://t.co/BWbm44OPVE to see more from the event https://t.co/5bklOpfRpI Start your week with this #myinstagramlogo, built brick by brick https://t.co/4jLfYLVlWi RT @WIRED: NEW ISSUE: Instagram wants to be the nicest place on the internet. But should it be? Read our brand new cover story→ https://t.c… Watch our Instagram story to see artist @jonburgerman’s doodles come to life 👀\nhttps://t.co/tCt76gsLD4 Coffee, a husky and sunrise over a lake = a perfect morning ☕ #TheWeekOnInstagram https://t.co/GIXhI1i1b3 A recipe for beet pappardelle transports us from Russia to a Tuscan villa. #TheWeekOnInstagram https://t.co/Hal50GUZNc Always on the lookout for flamingoes #TheWeekOnInstagram https://t.co/FUr6fGvppu Watch our Instagram story to see @JasMeannnn get ready for @BeautyconTweets 💋 \nhttps://t.co/kmMIQ5vcJk The Week on Instagram | 297\nhttps://t.co/DBxvPICC8G https://t.co/MGrHg971q2 Two French bulldogs in perfect sync for our #BoomerangOfTheWeek 🐶 🐶 \nhttps://t.co/VYhVRi82xp Take a look inside the colorful journals of 19-year-old Lina Doerwald 📖 #WWIM16💌  #KindComments https://t.co/FZHcxhsKMX Participate in this weekend’s hashtag project: #WHPmini https://t.co/gRrufEeUcr A young queen enjoys her breakfast 👑 #WHPinthekitchen https://t.co/WkiM7lqg6f On our Instagram story now: Watch @wahnails paint fingertip canvases! https://t.co/5A3g1HcHcq .@wahnails:  Relevant and fresh nail art that’s high-tech https://t.co/mwTsaifKri Picking plums at a 17th-century villa. #WHPinthekitchen https://t.co/d1RaBdRsTK Steady on a cliff at sunset in Jasper National Park #TheWeekOnInstagram https://t.co/yWxG48FyTa Chefs as scientists for #WHPinthekitchen https://t.co/vJksEbUnqi “Nothing is posed or calculated, but reality is not the purpose of my work.” —Photographer Katja Eshkileva https://t.co/RTTNGYMhkC Waffle pops, anyone? #WHPinthekitchen https://t.co/3inD8pG17B A quiet sunset scene highlights a traditional dancer at a Tokyo festival #TheWeekOnInstagram https://t.co/B3b6RCLWA6 Not your average table setting. #WHPinthekitchen https://t.co/lEKrl2NT8O Watch our Instagram story now to meet @RojoTheLlama and his herd https://t.co/6pZVF0rC4X Cooking with kids = ending up wearing the food. 🍄 #WHPinthekitchen https://t.co/9qfIRMaYWr Featured submissions from this weekend’s hashtag project: #WHPinthekitchen https://t.co/wVhQduWPM2 A suit &amp; a swing on the Croatian coast #TheWeekOnInstagram https://t.co/2D0dFLgngH “You’re on your own with no brake in the middle of the road surrounded by nature” —Longboarder Cristina Verdú\nhttps://t.co/iIEknoOGyK Happening now on our Instagram story: how to open your Instagram Stories camera! https://t.co/0Qa01BB71W The Week on Instagram | 296\nhttps://t.co/NhR5xwx3UX Watch our Instagram story now to see @OliWhiteTV’s favorite summer pastimes in London 🍦 #SiTC2017 https://t.co/Id8OLZQSzh We’re jumping for joy at this #BoomerangOfTheWeek https://t.co/ybZbhAzL19 Participate in this weekend’s hashtag project: #WHPinthekitchen \nhttps://t.co/KSZnaAZcCX Watch our Instagram story now to see illustrator @karabo_poppy at work 🎨\nhttps://t.co/CeSrmbLGC7 Try out two new face filters today! ✨ 🐱 https://t.co/TJiWRJKLA3 SukkhaCitta sells contemporary batik textiles that help Indonesian artisans move out of poverty https://t.co/QGTwdkgtfo Interested in hosting an InstaMeet or finding one near you? Check out https://t.co/F5zQ2NPMcx https://t.co/TbfZy7rU8s RT @instagrameng: @instagram Stories launched 1 year ago today and 250m people use it every day! Read about the eng team behind it: https:/… Confident toddlers and fields of sunflowers for #WHPtalentshow 🌻 https://t.co/I5NSKLa5QW RT @Entrepreneur: How @LanaElie Used Instagram to Turn Her Love of Flowers Into a Blooming Business | by @NinaZipkin https://t.co/FOz8GNKCOw Announcing Worldwide InstaMeet 16! #WWIM16💌 #KindComments https://t.co/E7RrvdqVgM Landing a new pogo move for #WHPtalentshow https://t.co/5L8VFGnelm Even adults love hula-hooping #WHPtalentshow https://t.co/2DfPVUkfyL Time to meet today’s #WeeklyFluff: two sleepy kittens from Japan 😻 😻\n https://t.co/qC8t8Sjx1v Celebrating one year of Instagram Stories https://t.co/GTJaFW7KdW Introducing new stickers to help you celebrate birthdays and any special occasion https://t.co/pvOEEMB6bS Slip into summer with this paper dress for #WHPtalentshow\nhttps://t.co/xRdDzpgNUA Every movement has connection #WHPtalentshow\nhttps://t.co/P9BqKmUCAS Wally the Welsh corgi’s spinning skills are on the nose #WHPtalentshow\nhttps://t.co/LzDw4g0j1h A little rain didn’t damper the fun at @fujirock_jp for @LukasGraham last weekend https://t.co/ha1gJMOHAE Watch our Instagram story now to see 18-year-old Debangshu Moulik illustrate in action https://t.co/lk5EaciOsv Debangshu Moulik communicates through the universal language — art https://t.co/1XDgWqXzng Watch our Instagram story now to see the @FCBarcelona players gearing up for El Clásico Miami ⚽ \nhttps://t.co/0U3zvW1GyT The Week on Instagram | #295\nhttps://t.co/BU47OxG7we Participate in this weekend’s hashtag project: #WHPtalentshow\nhttps://t.co/6hF5gI4yvK “I believe in creating arrangements that have the movement they would have in nature.” —@tulipinadesign https://t.co/QUim52EBds A California native spotted surfers in Munich for our #BoomerangOfTheWeek https://t.co/SwS1UfhjPQ Leap into today’s #WeeklyFluff with Birch the goldendoodle 🐶 https://t.co/VrvEiDr6qT RT @NYTStyles: Got goats? Share your photos with us on Instagram using the hashtag #NYTgoats https://t.co/Aeep5Xf3y0 A fireworks display for one in Japan’s Aichi Prefecture #TheWeekOnInstagram https://t.co/Jvl1mbngzU A quiet moment of sibling bonding #WHPmood \nhttps://t.co/kbrUTT4Cjd In pursuit of home with Egyptian photojournalist @elshamyme #WhereIComeFrom https://t.co/esMI4GFjGD Watch our Instagram story now to see @vickysdonuts’ doughnut decorating in action! https://t.co/bH3K0sLtL2 .@vickysdonuts: Vibrant doughnuts with some creativity sprinkled in https://t.co/DIlMdGykvQ RT @TIFF_NET: Emerging filmmakers with #TIFF17 dreams: submit your short to #TIFFxInstagram for a chance to join us in September. https://t… Making perplexed faces and giggles for #WHPmood \nhttps://t.co/9JFrpoBIep A timeless moment captured serendipitously in Drvengrad, Serbia #TheWeekOnInstagram https://t.co/dGE078Srwa Feeling reflective in the streets of Havana #WHPmood\nhttps://t.co/8yEwgSJfAO From shark attack survivor to shark advocate with Mike Coots https://t.co/SiP36CY8Je Watch our Instagram story now to see how stylist Kayla Boyer creates rainbow-colored hair 🌈 https://t.co/2UTeqijS3K Current mood: A silly moment with a friend. #WHPmood\nhttps://t.co/5e0zTvIz85 A summery state of mind and a pink picnic to match #WHPmood\nhttps://t.co/QbnavLaD6K Playing with scale in Balaklava, Ukraine #TheWeekOnInstagram https://t.co/EJBHRobuz6 In Jakarta, that familiar feeling of just hanging in there #WHPmood\nhttps://t.co/d8WtZ6DCac Watch our Instagram story for a behind-the-scenes look from @tomorrowland https://t.co/KcjdXtvicb Meet the Valais blacknose sheep of Switzerland #TheWeekOnInstagram https://t.co/dWXHKUJfi0 Poetry, theater, art and activism with 18-year-old Sejahari Saulter-Villegas https://t.co/sWCd8aiuQO A stroll down a dock at Toronto’s Sunnyside Beach brings us our #BoomerangOfTheWeek https://t.co/FZXtZ9L7Tm Participate in this weekend’s hashtag project: #WHPmood https://t.co/IbHaqo4FRC Watch our Instagram story now to see cosplayer @kieraplease’s characters come to life. https://t.co/Gl06tQ8Wp8 Finding self-expression through cosplay with @kieraplease https://t.co/qqCVpooUIr A young woman catches the camera’s eye in Japan. 👀 #TheWeekOnInstagram https://t.co/QIJr7S6Tor Today’s #WeeklyFluff = a squeaky-clean Himalayan kitty from Japan 🛁 😺 https://t.co/ql0YGfZpRN “I love the diversity in Edmonton — not just in ethnicity, but in crafts.”—Style blogger Lady Divine Tugade #🇨🇦❤️ https://t.co/eahRUX2H6b Turning an emoji into a polymer clay mosaic = 😻 #WHPISpyEmojis\nhttps://t.co/ddKgWjtUZK Just a normal day at the pool. #TheWeekOnInstagram https://t.co/BfrmfIeXPN “If I could send one emoji to my dog, which one would it be?” 😘 #WHPISpyEmojis\nhttps://t.co/RcUARayMQM “Afghanistan is an immensely fascinating place to report from.” —Foreign correspondent @SuneEngel https://t.co/G9TAS3LIwZ This little monkey-pup sees, hears and speaks no evil. 🙈🙉🙊 #WHPISpyEmojis https://t.co/snjmJxXMdQ Coming in for a landing 🐝 #TheWeekOnInstagram \nhttps://t.co/xebPyN8eFJ Searching for simple structures Ⓜ️ #WHPISpyEmojis\nhttps://t.co/zAiPfUoRRX 🌀 marks the spot. #WHPISpyEmojis https://t.co/3BCmzEGa2l “I see a lot of beauty in the things I find dark and scary.” —Photographer @brookeshaden https://t.co/2ncZXPJrSr “I knew immediately I had to do an emoji.” 🙂  #WHPISpyEmojis https://t.co/wOQPEsAtkR A fluffy cat enjoys a beach day in the UAE 😺 #TheWeekOnInstagram https://t.co/GPtKNnAmNs Featured submissions from this weekend’s hashtag project: #WHPISpyEmojis 👀 https://t.co/fjOMBswrDm RT @Refugees: Check out our @Instagram this week, where @ghazalmia is taking over as part of the #GenInstaTakeover! https://t.co/Hsu2gSla8s… A sideways glance in the south of France = 🙌 #TheWeekOnInstagram https://t.co/yrXziCUAaR Living “a creative shuffle” with @priyankachopra https://t.co/DtYCs4xfO3 Laundry swaying on the line caught our eye for this #BoomerangOfTheWeek https://t.co/qiq4jQFnJO Participate in this weekend’s hashtag project: #WHPISpyEmojis https://t.co/wUnrFPDlw2 Meet today’s #WeeklyFluff: @yogalgo, a shy and lovable Spanish greyhound https://t.co/LbwGBSMuL0 Watch our Instagram story now to take a look inside the @globemakers studio. 🌍  https://t.co/dQ6FUaXYsj Speeding through light and shadow 🏃 #WHPmultiply https://t.co/NdBwZrZIMr A drone’s-eye view for #WHPmultiply https://t.co/zHLZWQb4yy Fairy tale photos with photographer Constantina Schmid-Mprigou\nhttps://t.co/96hyFmKPFc “When we have the right lighting in the right moment, we just create.” 🎈🎈 #WHPmultiply https://t.co/kAyrVZtuJr Three’s company 💚 💛 ❤️ #WHPmultiply https://t.co/VjyQenKz5e “I plan to keep fighting for the next 20 years of my life.” —@Malala https://t.co/PDf4GXSnfF Watch our Instagram story, featuring documentary photographer @malinfezehai, to celebrate @Malala’s birthday with her new friends in Iraq. https://t.co/sf6cWaGGMC RT @TIFF_NET: Announcing the return of #TIFFxInstagram Shorts Festival presented by @Uniqlo_Canada. Submissions open until July 30 https://… Taking the plunge 🏊 #WHPmultiply https://t.co/C0hSPxxaiu “Most involve a meal, a fresh shower and getting my hair right.” Pre-All-Star Game rituals with @Bharper3407 ⚾️ https://t.co/8IaaGtTtyl Happening now on our Instagram story: how to reply to stories with a photo or a video! https://t.co/utl61h2LHJ A shower of hats for #WHPmultiply 🎩 https://t.co/5triiQKORv “A magical place during an unreal night.” #TheWeekOnInstagram https://t.co/yrWnen2kn3 Featured submissions from this weekend’s hashtag project: #WHPmultiply https://t.co/DeCSc5saIP Glue, borax and food coloring came together to create the slime for this #myinstagramlogo https://t.co/54wN0DPJCh Foggy bonds in Japan for #TheWeekOnInstagram https://t.co/ojr1MgeTAC Sunbeams dancing in the water for #TheWeekOnInstagram https://t.co/ZQFfYhfecc The Week on Instagram | 292\nhttps://t.co/tbX3IXXu1R Bubbles and pugs for our #BoomerangOfTheWeek with @urbanpugswag https://t.co/l3lKYmuqMS Participate in this weekend’s hashtag project: #WHPmultiply https://t.co/uxXm7bumIA Watch our Instagram story now to see a few “drone selfies” from Renee Lusano’s travels https://t.co/8NjtQDMXxG Try out the new face filter today! ❤️ https://t.co/UjUj9xqqJZ Delectable dreamlands from a kitchen in Tehran https://t.co/N9CvnSUHDs A special edition #WeeklyFluff for #internationalkissingday: Kingston the pup always finds time for a few kisses 🐶  https://t.co/lShEMI1pzk Now you can be even more fun and playful when you respond to friends. Reply to stories with a photo or a video! https://t.co/7LruHZz2AF https://t.co/kzTSDU4Ygr Adding sunshine to art for #WHPsparkle https://t.co/iWv51Mri8D Starting today, you can reply to stories with a photo or a video! https://t.co/7LruHZz2AF https://t.co/Dv91lVO94w It’s sparkler season #WHPsparkle 🎇 https://t.co/k0X5wJgQWs Watch our Instagram story now to see the action at @Wimbledon 🎾 https://t.co/xM58zjV4Me Twinkling fireflies add light to dark woods #WHPsparkle https://t.co/LLBvmXeVik An artist’s hand metamorphoses into an iridescent butterfly for #WHPsparkle https://t.co/430lOOekIo “By putting Mexican food in this minimalist, colorful setting, it puts the spotlight on the food.” @ChicanoEats https://t.co/EBx5yZkFZ4 “Rise and sparkle.” #WHPsparkle ✨ https://t.co/iuIFrvW5hx .@instantdotme’s #NewFameList honorees came together at VidCon to read #KindComments on Instagram. Spread the love! https://t.co/yAK8ItXmEA Featured submissions from this weekend’s hashtag project: #WHPsparkle https://t.co/Od9WwU0XrS “They can be a bit ornery — but they’re truly magnificent.” —Bird educator Paige Davis 🦅 https://t.co/ccGaWjzrZo Watch our Instagram story to meet music man @AcousticTrench and his loyal friend Maple 🐶 https://t.co/RXAHNP78lr Get ready for the 4th of July with new stickers to celebrate the holiday! https://t.co/o0rMqKictT A daily scene with deeper meaning in West Bengal, India #TheWeekOnInstagram https://t.co/YJmZlCmr4L A sunset bath for a rubber ducky in Catalonia #TheWeekOnInstagram https://t.co/Ns26DvuDqB Celebrating Pride Day in Madrid with blogger and artist @iricosmopolitan #Pride2017 https://t.co/FKndae2MN3 Watch our Instagram story now to explore Halifax with @misslionhunter #🇨🇦❤ https://t.co/WWlwU6dAOr Disco ball + flowers = our #BoomerangOfTheWeek 💐https://t.co/HErd96YPKz Participate in this weekend’s hashtag project: #WHPsparkle https://t.co/0YvppPRx2F Watch our Instagram story now see some of @izzy_wheels’ colorful designs ✨\nhttps://t.co/SfnSSestyk “Now, they have agency over how they are seen and heard.” —@love_is_illegal #Pride2017🌈  https://t.co/35lMKL9r56 Turning baby bumps into works of art with painter Fátima Carrión 🤰\nhttps://t.co/Q9YyS9PyuB “Love always wins, no matter what.” #WHP🌈 https://t.co/qcUDxEdg2d Watch our Instagram story now to see artist Mikhaela Cherry Virginia Chandra work on her creations 🎨 https://t.co/SzB5KCCO9n Never take a rainbow wall for granted. #WHP🌈 https://t.co/fBRV0DsRMa RT @WIRED: Instagram just launched an AI that will block mean, hostile, and harassing comments from your feeds https://t.co/uBvGyDhbMr Learn more about our two new tools to help keep Instagram a safer and more welcoming place for self-expression. https://t.co/2ZzMpGyFHN https://t.co/vyE3c372ha Two girls put their heads together to create the colors of the rainbow. #WHP🌈 https://t.co/DoNm3IZZrB Meet today’s #WeeklyFluff: three Weimaraner pups living it up in Sweden. 🇸🇪 https://t.co/ePa8Nmvi0s Check out the playful paper art of @AurelyCerise 🍒https://t.co/fQxApNDKRj “I know I’m going to be skateboarding my whole life.” —Masha Zakirova https://t.co/Vbb8lTesQQ “A day filled with sunshine and rainbows.” #WHP🌈 https://t.co/5IxUKII9wt “From the rugged cliffs to the long range of mountains, everywhere screams adventure.” #🇨🇦❤️  https://t.co/tbC99N5OJV Finding the end of the rainbow for #WHP🌈 https://t.co/v6JA9Qke0t Watch our Instagram story now to learn some flexing dance moves with self-taught dancer Kaner Scott https://t.co/l13WLFAaCJ Rainbow flags fly proudly in Dublin #WHP🌈 https://t.co/HVEK0EinC1 Featured submissions from this weekend’s hashtag project: #WHP🌈 https://t.co/57thElqh4I “We all benefit from accessible, inclusive spaces.” —@AccessNowApp founder @maayanziv. #🇨🇦❤️  https://t.co/hSuYBPjbHJ Celebrate summer with a new set of stickers available in the Northern Hemisphere. https://t.co/g7Rd2KWnov Accio Potter fans! We’re celebrating #HarryPotter20 with illustrator @taryndraws ⚡ https://t.co/oUABqwSQ6i A ride through the past in Russia #TheWeekOnInstagram https://t.co/UHouJDPp3e A birdhouse = the perfect place for a catnap #TheWeekOnInstagram https://t.co/rZrFxkyltJ Running through sprinklers at sunset in Catalonia #TheWeekOnInstagram https://t.co/qdDzkLuyy8 Indonesia comes alive during Eid al-Fitr with photographer @mastirham https://t.co/XspXgMGh2x “It shows the dedication he has with his car and all the stories that they must have together.” #TheWeekOnInstagram https://t.co/Duvc1X4ibt Exploring the countryside outside of Bogota with a pup named Milo #TheWeekOnInstagram https://t.co/aKC3AaYSq9 Celebrating Iceland’s National Day with the “Lady of the Mountain” #TheWeekOnInstagram https://t.co/ZJ9hP1ykhQ Street photography in the Bavarian mountains #TheWeekOnInstagram https://t.co/TRP2C5jGtt Watch our Instagram story now to check out the action at @VidCon with some of our favorite creators https://t.co/vJ9fMbL9KG Now you see it, now you don’t, in this #BoomerangOfTheWeek 🐈 🔥 https://t.co/8qgzY44sNS Participate in this weekend’s hashtag project: #WHP🌈\nhttps://t.co/KMSkGKNLia Meet today’s #WeeklyFluff: a house-trained piggy with an adorably squishy nose 🐽 https://t.co/QOPOaHX4eZ We're about to go LIVE! Head over to Instagram to watch our co-founder Kevin Systrom chat with @lizakoshy at @VidCon. A puddle transforms an ordinary city scene into #WHPstandout. https://t.co/Z0uxiM16hz Get up close and personal with Annie Flanagan’s intimate portraits #Pride2017 🌈 https://t.co/VV9ji1ywUM “I’ve been looking forward to this since I was a kid.” Head into the #NBADraft with @AhmadMonk 🏀 https://t.co/aKz8vR8zjf Googly eyes for the win [eyeballs emoji] #WHPstandout https://t.co/uZ1HGtYgom Cloudy sleeps closest to the AC. 🐶 #WHPstandout https://t.co/WN7RJgYk2c “We try to showcase the normal, day-to-day aspects of being teenagers.” —Video creators @BrookAndBailey #VidCon https://t.co/8wtXyvIZPa “We’re changing that way that society sees indigenous people.” #NationalAboriginalDay https://t.co/I2tOizGk9I Catch your friends up on what they missed! Share a replay of your live video to Instagram Stories. https://t.co/UradhWGPbU Optical illusions and beach days #WHPstandout https://t.co/TweO05mVXo 👨 + 🐟 = #WHPstandout https://t.co/17w5UJ9zbY “You go from quadratic formulas to dramatic death scenes.” —Actress @isabelamoner on balancing acting and school https://t.co/68EuhQ5ELp “I’m just a normal guy with a bunch of dreams.” —Video creator @villalobossebas #VidCon\nhttps://t.co/5BgFvyHt8a RT @Refugees: Join us on Instagram today where the wonderful @GhazalMia has taken over our feed for #RefugeeDay https://t.co/PP68qnicHF #Wo… Now you can share a replay of your live video to Instagram Stories! \nhttps://t.co/47NXOwuVb0 https://t.co/zHp3Elxse4 From Romania to Canada, photojournalist @DianaZAlhindawi tells her family’s story on World #RefugeeDay https://t.co/6OVnNCTE9k Featured submissions from this weekend’s hashtag project: #WHPstandout https://t.co/LqKjaKmdwv Talking baked goods, on-camera comfort and VidCon with @RosannaPansino 🍰 \nhttps://t.co/1HbqZ436GQ “People were showing me great acceptance. It brought tears to my eyes.” —@TrevorMoran #KindComments #Pride2017 🌈 https://t.co/VqeUixoULv #KindComments and high-five emojis with actress @kyladrewatla https://t.co/tWsJ5UJoP3 Sharing #KindComments with actor @coreyfogelmanis https://t.co/HjYTqWv2Uc We’d be excited about a kiddie pool in summer, too #TheWeekOnInstagram https://t.co/g67vXXwACT Ushuaia, Argentina — where the June moon shines twice as long as the sun. #TheWeekOnInstagram https://t.co/EDiMgFKFeO Tasty food + cute babies = 🙌 Watch our Instagram story now to eat some treats with @foodbabyny this #FathersDay https://t.co/a7kI2S57rL “It’s about the decisive moment.” —Photographer Rob Yaskovic on work, fishing and fatherhood. #FathersDay https://t.co/iIX4XQ0JOK Stop and smell the hydrangeas #TheWeekOnInstagram https://t.co/LIlrD3bZsa “Whenever I get tired of the city, I take refuge in the suburbs.” #TheWeekOnInstagram https://t.co/PSNB32RVaj Watch our Instagram story now to explore the studio of San Francisco textile artist @hernalexart #Pride2017 🌈 https://t.co/3LNPQ0LSIq We’re launching a handful of stickers to celebrate Father’s Day. They’ll be available this weekend in several countries around the world. https://t.co/d9gG5oVpt3 We’re sliding into the weekend with this #BoomerangOfTheWeek from northern Michigan. https://t.co/NZHjLUJK5z Participate in this weekend’s hashtag project: #WHPstandout https://t.co/YTXhDGMhzC Watch our Instagram story now to throw the perfect summer party with @Mylittleday 🎉\nhttps://t.co/7B8ApKor1v A lesson in being yourself with trans model Ariel Moura #Pride2017 🌈https://t.co/jgBYuyemY3 Girl + dog = worst enemies. And best friends. #WHPfriendship https://t.co/Z2YBrCJ9hU “If I make a fancy dress, what am I going to do with it? Just take pictures?” —Teen designer @bluexheeta\nhttps://t.co/dLekcR4BG3 Celebrating graduation hopes, dreams and memes with @KimsCustomCaps \nhttps://t.co/AfC3CArqri New face filters alert! Bring along a friend for the road trip filter 🚘 or try on a sleep mask 💤 https://t.co/L52LYCBXoo Just keep swimming 🐟🐟 #WHPfriendship https://t.co/zOJjdFPWH1 “It’s a project that saves lives. Now that I know that, I can’t stop.” —Photographer @trittscamera #Pride2017 🌈 https://t.co/z4UNhX2t0v RT @HRC: Over the weekend, photographer @JeffVespa used @MeganGecklerArt's rainbow-hued backdrop for portraits. See more at https://t.co/y4… RT @verge: Instagram profiles are the new homepage https://t.co/k5qVDhGOmV https://t.co/585voPZUOc Living in the moment for #WHPfriendship 💞 https://t.co/Fh5erHCrjB Meet today’s #WeeklyFluff: a big-eyed, sleek-haired Singapura cat named Malt 🐈\nhttps://t.co/TNzS262Lof Watch our Instagram story now to join Alok Vaid-Menon for a day leading up to a performance. #Pride2017 🌈 https://t.co/btXrMwSw7R Playing in the waves in Indonesia #WHPfriendship https://t.co/fxXFfiaVqp Friends who braid together, stay together. #WHPfriendship https://t.co/SkECnTYe0G “People who are unapologetic about who they are inspire me.” —Photographer Laurence Philomène #Pride2017 🌈https://t.co/7mDgg4o8vB On our Instagram story now: the bright, happy styles of French-African brand Maison Château Rouge https://t.co/8cG9RzsD9E Introducing Archive—a new feature that lets you move posts you’ve previously shared into a space visible only to you https://t.co/CD6rMRpIGP Butterflies dance for #WHPfriendship 🦋 https://t.co/2UV8DetbFZ Featured submissions from this weekend’s hashtag project: #WHPfriendship https://t.co/nFIXbb2Xbx RT @NYTStyles: The body-positive movement is carving out a digital space where everyday people can find affirmation. https://t.co/PyctvSN1Yh Watch our Instagram story now to choose your own adventure with @tristantales https://t.co/ix9ONXa2GY Badminton is better when played without rules #TheWeekOnInstagram https://t.co/uEVxASlGJu “The joy and magic of childhood is in this very moment.” #TheWeekOnInstagram https://t.co/rSIZEMxk7Q Casting shadows during an InstaMeet in Hamburg, Germany #TheWeekOnInstagram https://t.co/P5uVCc9F3X On our Instagram story: skateboarder @Lizziearmanto takes us on a CA adventure\nhttps://t.co/QXmhIyvZUD A flock of ducks meet their faux counterparts #TheWeekOnInstagram https://t.co/8Tnp2owdyo Dog + lavender fields = an evening well spent #TheWeekOnInstagram https://t.co/ijhIotpKHW “I love trying to make layered photos that you can keep exploring.” #TheWeekOnInstagram https://t.co/4lnOWDCvdf Watch our Instagram story now to see how oddly satisfying gooey slimes are made.\nhttps://t.co/RG6pyUWeNd Three surprised kittens from Hungary are the stars of our #BoomerangOfTheWeek 🐈 🐈 🐈 https://t.co/ZWYLtSwAl1 Participate in this weekend’s hashtag project: #WHPfriendship https://t.co/Pbid3q3IjL On our story now: a textile-sourcing adventure in Morocco https://t.co/YrljjjAPfn Hand-painted paper petals came together for this week’s #myinstagramlogo 🌸\nhttps://t.co/lNglbdsfJU Making a splash for #WHPgetaway along the coast of Wales https://t.co/m25TftWFfW “The ocean is the most magical place I have every visited.”  —@mishkusk #WorldOceansDay 🌊 https://t.co/h14p0Fjq0M RT @wmag: . @AndersonCooper taught his mother, the 93-year-old artist Gloria Vanderbilt, how to use @Instagram: https://t.co/Tn8EpDpJRj Finding mindfulness through healthy recipes #🇨🇦 ❤️  https://t.co/6CmmijRoKh Escaping into the past for #WHPgetaway https://t.co/Qv63X6JuVX On our Instagram story now: observing Ramadan around the world https://t.co/7T2HMZ9WMR Lake + child-size pool toy = #WHPgetaway https://t.co/4J0up9C17t Time for your dose of #WeeklyFluff: a mini goldendoodle with a major love for dressing up https://t.co/1R4SLtO7DX"}