{"tweets": "1-2 punch 🤜🏼👌🏼 https://t.co/jmnOL8QktY RT @ASICSTennis: How does @DjokerNole remain calm ahead of every opponent he faces? #PlayTheUnplayable #ASICSTennis #NoleFam https://t.co/y… #TeamDjokovic idemooo. Nihon no minasan o-yen arigato gozaimasita https://t.co/zQnq4bvZ4M @B6W1CtxV9llKHlW 🙏🏼 Need your help #NoleFam, how do I say “thank you for your support” in Japanese?? Let’s go 💪🏼 #rakutenopen2019 #finals https://t.co/S1uusA9ZAv RT @atptour: Poetry in motion. 🤩\n\nThe @DjokerNole return of serve is just art 👌 \n\n@rakutenopen https://t.co/39ymhSFsIS Looking forward to semis tomorrow #idemooo #nolefam #rakutenopen2019 https://t.co/cbX2nJP6xv Ovaj momak me je totalno oduševio. Inspirisan mojom sezonom 2011 godine, pitao je oca da li može da ide da živi u Srbiju. Otac ga je pitao da mu pokaže strast... https://t.co/XfmMLNxs43 https://t.co/6Yy9VYriEO This guy made my day. His father allowed him to live in Serbia because he was inspired watching me in 2011 season. He spent 4 years in Serbia playing tennis learning our language and hoping he can meet me one day... https://t.co/wSDgZyS5w0 https://t.co/gLffTkyFNb RT @LACOSTE_JAPAN: ブランドアンバサダーのノバク・ジョコビッチ選手が楽天オープンの試合直後、ラコステブース(非公開)に立ち寄ってくれました！今大会の着用モデルシャツや、等身大パネルにサインしている #ジョコビッチ選手、別れ際に日本語で「ありがとう」、嬉しいです… Idemooo 💪🏼 #rakutenopen2019 https://t.co/M2OPCcCg2X 👋🏼🤪🤳 https://t.co/QXIlx6VSdV RT @ATP_Tour: Just too good 😂 \n\nWell played, @DjokerNole 👏 \n\n#NovakGoesSumo 💪 🇯🇵 https://t.co/FE75NjoQl7 Thank you Tokyo for honoring me with the experience of your sacred sumo sport 🙏🏼😃🤼‍♂️ #NovakGoesSumo https://t.co/ZfyDVCcXmT https://t.co/WBVqar0kS2 I see you @seikowatches 👀 https://t.co/rIpRRvJtxR #rakutenopen2019 https://t.co/yX0g1Ody86 RT @rakutenopen: ジョコビッチ選手来日！！\nNovak Djokovic in Japan!!\n\n#rakutenopen #rakutenopen2019 #楽天オープン #テニス https://t.co/OKWmJL7D1q Kon’nichiwa 👋🏼 https://t.co/wSXFl0yZit This was our stop at Lake Como yesterday on my way to Tokyo 🇯🇵 https://t.co/3iF5FCV5ef Da li ste ikada videli srećnijeg kampera? Deca podmlađuju 😂😂🤙🏼 @novakfoundation @jelenadjokovic #Drugarijada2019 https://t.co/0MCtAwMwOR #Drugarijada2019 @jelenadjokovic @novakfoundation https://t.co/G6C5f2vXx5 Still celebrating our 7th Friendship Games last week 🕺🏻🤪🥳😎🙌🏼 So proud of our @novakfoundation staff, volunteers, and teachers that make this special kids’ camp possible each year in Serbia for our underprivileged community. https://t.co/3oKmbGhMoo \n\n#Drugarijada2019 https://t.co/rUTuVKdTpk Serbian @DavisCup team training in Belgrade. Srpski Dejvis Kup tim trenira u Beogradu. Idemooo https://t.co/5Ejz81X3jv Zahvalan sam na iskustvu koje sam doživeo u Brzeću. Ljudi iz ovog kraja su veoma prijatni, ali u isto vreme i jako vredni, a svako od njih ima neku autentičnu i interesantnu priču. Srce mi je puno što oživljavam… https://t.co/1vkgBWMvNL IDEMOOO @Dutzee #TeamSerbia https://t.co/1jiqUbd4c8 Hvala vam svima na velikoj podršci i interesovanju za stanje mog ramena. U procesu sam rehabilitacije i nadam se da cu biti spreman vec za sledeći turnir u Tokiju. Svakako vam se javljam sa novostima. Hvala vam još jednom 🙏 I’ll keep you posted on my progress and thank you for your wishes for fast recovery! Sorry for keeping you guys in the dark these days. I‘m having a wonderful time with my family and actively working on my recovery so I can be ready for the Asian swing. My health is always top priority and as soon as I’m ready, I’ll be back. @novakfoundation @CNBC ❤️❤️❤️❤️ RT @ORGNLmagazine: Ne znamo za vas, ali mi smo se uželeli naše #Original zajednice. I jedva čekamo da se susretnemo ove jeseni - da vidimo… Idemoooooo!!! #FIBAWC @KSSrbije https://t.co/8H60Hapiy2 Congrats to Rafa for creating more history in our sport and showcasing amazing fighting spirit. And congrats to Daniil for an incredible summer on hardcourt in USA. You should be proud of yourself. Great things to come for you. Well done boys &amp; thank you 🙏 for fantastic match. https://t.co/dpCJA0UFt6 I visited Tesla Science Centre in Long Island. I want to thank the wonderful people who welcomed me and showed me around. It was so impactful walking around the grounds... https://t.co/nu1URQ0M78 #Tesla https://t.co/ItKJiJltSr 💪🏼 #USOpen https://t.co/myPn98ONQl RT @WIRED: What does Novak Djokovic eat for breakfast? When did he start playing tennis? @DjokerNole answers the internet's most searched q… RT @usopen: Defending champ dance 🕺\n\n#USOpen | @DjokerNole https://t.co/nZ6H7nxKrx @usopen 🕺🏻 Let’s gooo #idemooo #NoleFam #USOpen https://t.co/87baPIoz0Y Zadovoljstvo je bilo trenirati sa Laslom danas na centralnom terenu US Open-a. Srećno na turniru #USOpen https://t.co/8Cw3FPypPn RT @ATP_Tour: The multi-talented @DjokerNole 😂🎹\n\n(🎥: Lola Astanova on IG) https://t.co/MKzxU3jDNX RT @ASICSTennis: Novak is ready #PlayTheUnplayable all over again in New York in the #COURTFFNovak and its all new blue and white colourway… Ready to #PlayTheUnplayable. #ASICSTennis #USOpen https://t.co/Fiwjb7USEj #ArthurAsheKidsDay #USOpen https://t.co/UevUmKxbnO 🕺🏻🤪 https://t.co/Q23x3TWjFX #USOpen https://t.co/bYo5llCvFn Great to visit these champs! Thank you guys for having me 😃💪🏼🙏🏼 https://t.co/3HG006Qc8D See you guys at #ArthurAsheKidsDay! @usopen #USOpen https://t.co/UYqKr495v8 RT @novakfoundation: \"Great strength and power come from an object such as pen\", says @DjokerNole , and we couldn't agree more!🤗 \nThats why… Heartbreaking 💔💔💔 #PrayforAmazonas https://t.co/a46W8wArpT Great to see everyone out at the @seikowatches event tonight 😃🙌🏼👍🏼👍🏼 #NoleFam https://t.co/nM1tVS0EtK Walking into first practice @usopen 🤙🏼☀️ https://t.co/NMQx2sqiAl Anybody want some Djoker Balls? 🤣🤣🤣👌 #foodprep https://t.co/LtlaX8rpsh This brave kid survived neuroblastoma cancer.. he was diagnosed when he was only a 10 day old baby !!! He survived and now he rightfully wears the T-shirt that says CHAMPION 🙌🏼 #CincyTennis ⁦⁩ https://t.co/V1i5d3Mdr9 Talking 🏀 strategy https://t.co/0IPjOwaset RT @ATP_Tour: Never stop growing 👊\n\n@DjokerNole | #CincyTennis RT @TennisTV: Talking bout passion... 💪\n\n@DjokerNole \n\n#CincyTennis https://t.co/wK8XE6OVPs 💪🏼🎾🤪🔥 #CincyTennis https://t.co/fMmky7t3UR Ulysses specialty. Chinese traditional medicine herbs on acupuncture needles. Not always pleasant but effective 😃 https://t.co/c9obJApR8y First #CincyTennis practice! https://t.co/S4oURxp7mh Point of the week 🤣🙌 https://t.co/NIWKl504kn Kayak team #tbt 🚣‍♀️😎❤️❤️❤️ @jelenadjokovic https://t.co/AbHnirJBna 🤪☀️💪🏼🎾 @DjokoMare #Marbella https://t.co/8TT6FfVWMj Congrats @UltimateHCM! 👏🏼💪🏼 https://t.co/KCknTFYrVc 🦋🦋 @jelenadjokovic https://t.co/tIxU3dGbhN Grateful to spend quality and special time with Jelena in Croatia. Singing with klapa group from Korčula island. Wonderful experience. #iambetterattennis 🎼😃👌 https://t.co/T5AndGDJJI RT @LaureusSport: \"He made the world better. We should make the world better too\" \n\n@rogerfederer, @serenawilliams, @cristiano, @DjokerNole… Happy Birthday to my little brother Djordje. Last night we celebrated. Very proud of you. Love you 😍 https://t.co/llFcGnbsBw RT @ATP_Tour: The five-time @Wimbledon champion is now BACK at the #NittoATPFinals 🙌\n\n@DjokerNole has qualified for London after winning Th… It was a match to remember forever. Match that had everything in it. Match that transcends our sport. I am eternally grateful to be part of it. Major respect to Roger for a titan fight. It has been quite a tennis… https://t.co/X9zQ2sEaDR @LACOSTE @ATP_Tour 🙏🏼🐊 RT @WTA: .@Simona_Halep poses with @DjokerNole for the @Wimbledon Champions portrait 🏆 https://t.co/j0sUG9apdJ Thank you #NoleFam for all the support 🙏🏼❤️❤️ https://t.co/hHExkGNkVl 🏆5️⃣🙏🏼 #Wimbledon https://t.co/inKPphJrTS An honor.. @KensingtonRoyal #Wimbledon https://t.co/3h37JNbjUe Tradition 🌱😃👐🏼 #Wimbledon https://t.co/u3OLTHwre4 ☝🏼🙏🏼🎾❤️❤️❤️ https://t.co/OPhmZejCTO #gladiator moment ☀️🌾 https://t.co/Z418Ru27yh Asked this legendo for a picture yesterday after my match 🙌🏼👏🏼 #josemourinho https://t.co/ZoOBEqBrQb Serena, your champion spirit keeps on inspiring and amazing. Thank you 🙏🏼 @serenawilliams #Wimbledon https://t.co/OSQKqeu0sp Congratulations Simona! A tremendous win you deserve! @Simona_Halep #Wimbledon https://t.co/wbPPPdqsjJ A battle today, lots of respect for Roberto 🙏🏼 @BautistaAgut \n⠀⠀⠀⠀⠀⠀⠀⠀⠀\nI’m very proud to play again in Sunday’s #Wimbledon final. What a journey being back! Idemooo LET’S GO 💪🏼 #TeamDjokovic #NoleFam https://t.co/EjbD7RO235 RT @ORGNLmagazine: - Nek budućnost pokaže istinu i oceni svakoga pre sopstvenom radu i zaslugama. Sadašnjost je njihova, budućnost, za koju… Yesterday we celebrated the birthday and ever present spirit of genius #NikolaTesla who inspires me daily 🙏🏼🙌🏼👏🏼⚡️ https://t.co/0Ke9aLM1er https://t.co/lXqsQ4hGZL @NoleLondon ❤️ Haha 😜😎🤙🏼 https://t.co/qsHXHk3MEx @head_tennis 💪💪💪 Idemoooooo 💪🏼💪🏼 #Wimbledon https://t.co/rFYQGmC4NA RT @novakfoundation: In preschools in Serbia, there is simply not enough space for every child. For that reason, we have teamed up with @Ex… Let's join forces so that every child has a chance to attend preschool! 💪🏼 @ExitFestival @Exit_Fondacija @novakfoundation @jelenadjokovic \n\nJoin us: https://t.co/dttsGYu9Sc https://t.co/q0JojgTNcW 2R let’s go!!! 💪🏼👍🏼😤😜🌱 #Idemooo #Wimbledon @ Wimbledon https://t.co/tnWvWDGfca #TeamDjokovic 👍🏼🎾 https://t.co/gg08vi5zv1 https://t.co/fx9K7HWkNT I’m clearly taller 😉😜 great hit today my man @karenkhachanov #Wimbledon https://t.co/x0XUcJ2HWk @CP3 @gcmovie 💪🏼 The Game Changers film is very inspiring to me personally and professionally. Proud to be on the team and can’t wait for you guys to see it this September 💪🏼 #changeyourgame #thegamechangers @LewisHamilton @CP3 https://t.co/9rbYLam8rq Welcome back my friend #AndyMurray https://t.co/RWAlnGgFII Ahh we’re backkk!!! Most sacred court in the world 😃😍😎🎾🕺🏻🙌🏼🇬🇧 #Wimbledon https://t.co/Z9GfHM1xpx RT @KrisSekMNT: Novak practicing with Klizan on day 2 of @TheBoodles https://t.co/hHlzl5y2F6 Excited for Tokyo! 🇯🇵😃🎾🎾🎾 https://t.co/7dFWNJyvdS RT @ukinserbia: Renovirani teniski teren Britanske ambasade u Beogradu 🇬🇧 nosiće ime šampiona @Wimbledon Novaka Djokovića\n@DjokerNole 🇷🇸🎾 h… I was honored to attend the opening of the renovated courts at the UK Embassy in #Belgrade with @novakfoundation. Thank you to HRH The Duke of Kent for the great privilege. See you all at #Wimbledon soon 🎾🇷🇸🇬🇧 https://t.co/h0YR0YHIjm RT @TheBoodles: BREAKING NEWS @DjokerNole confirms he will play his only pre @Wimbledon warm up matches at #theboodles on Tue 25 &amp; Wed 26 J… How good it feels to be home 🇷🇸🤗😎👋🏼👐🏼 #Belgrade #Serbia https://t.co/NR51cKDEjp 🇷🇸🎙 #pressday #belgrade https://t.co/Yo0jnAJaoT Happy Birthday Jubičak! Another year to remember. Our kids and I are grateful to have you in our lives which you fill daily with love ❤ and compassion. Thank you for striving to always be the best version of yourself. We love you with all we are @jelenadjokovic https://t.co/2p5F1KGqSS Srećan rodjendan Jubičak! Još jedna godina za pamćenje. Naša deca i ja smo zahvalni što te imamo u našim životima koje ispunjavaš svakodnevno sa puno ljubavi i saosećanja ❤🤗 Ljubimo te i volimo iz sve snage @jelenadjokovic https://t.co/wTICNmaD77 Our Tara teaching Tesla and I something new today 🥰 https://t.co/uZOneiD4WS Happy belated birthday 🎉 https://t.co/o6QrCOKaJa In this last episode of #NovakForReal, I finally met 7 fans at @rolandgarros 😀 Thank you again for your gifts 🎁 and for this memorable meeting #NoleFam @LACOSTE https://t.co/zpW3wOmobc https://t.co/vxvXFlakV7 Idemo 👊🏼💪🏼 #RG19 #uli https://t.co/kV3g4FWfWu RT @Eurosport_UK: About that picture of @DjokerNole and @TheBorisBecker dressed up for Halloween 👀😂\n\nThe World No.1 talks us through his In… Intense focus on the knitting 🧶 during rain delays 🤣 @jelenadjokovic @rolandgarros https://t.co/ZUfNUbgLkT My favorite places in Paris with @lacoste #NovakForReal 😍👉🏼 https://t.co/yLssxpD1EK https://t.co/5cMgGEECrl Birthday goal achieved! 🎉 My family is matching your $32k donation to build a 2nd preschool in Serbia. Thank you for dreaming with us 🙏🏼❤️ #Care4Kids @novakfoundation @jelenadjokovic https://t.co/4NmQ2BxZ1D 🇫🇷😆💪🏼🙌🏼🎾☄️ thank you for your love and support!!! #quarters #RG19 https://t.co/PcrWIxYL5I It was awesome to spend some time with great fans at @rolandgarros. Thank you all. #NoleFam\n\nI hope you enjoy this 1st episode of #NovakForReal! 😃 @Gentside @LACOSTE https://t.co/tIPTdGaGOY 😃👐🏼👐🏼👐🏼 #RG19 https://t.co/VGj6a754yC RT @jelenadjokovic: First time ever. Danas je prvi put gledao svog tatu uživo ❤️ @djokernole #teamdjokovic #rolandgarros https://t.co/LyXa1… IDEMOOO @Dutzee @filipkrajinovic #laslo https://t.co/nY8X9DEkya We’re so close to the finish line 💪🏼💪🏼👏🏼 we can do it!!! #BelieveinTheirDreams https://t.co/DbjvbwTkPg .@jelenadjokovic and I preparing elderberry flower for homemade elderberry syrup recipe 🥰🤗💑🌸🍀🌱🌳🥤#nottoobad #familytime https://t.co/jfFC07NjN2 🐊🐊😁🇷🇸 #fernandoandfilip @filipkrajinovic #RolandGarros https://t.co/vNnkBYVBpb Just fyi I left Paris for several days until the investigation is completed.. my participation at RG is maybe under review? 😆🤔🚧 Today warming up in the gym before my practice I used a medicine ball by slamming it on the floor pretty hard. As a result, I wrecked a wooden floor. @rolandgarros please forgive me! https://t.co/Cao8I0dopS @saradjokofan1 @jelenadjokovic @NovakFanClub @SanjaSkipy @Slavica_NoleFam @NovakIndiaFans @CristinaNcl @lovelynole @NivesCapo @djoker4life1 Happy bday! Bonjour new Chatrier 😍 first practice in Paris with @cilic_marin #RolandGarros https://t.co/tAXxpzSCqb @ATP_Tour @rolandgarros #idemooo @crvenazvezdafk 🙏🏼 @ASICSTennis 💪🏼🙏🏼 @TennisTV 🤘🏼 @Wimbledon 🥳🙏🏼 @jelenadjokovic @novakfoundation Wooooo 💪🏼 @head_tennis 🙏🏼 Thank you team! 😃🙌🏼❤️ https://t.co/Io2rySR36h https://t.co/KS88599WQL Come celebrate my birthday with @novakfoundation! Join us at the link in my bio to help build 1 more preschool this year 😃🥳 (Thank you for all the well wishes, let’s make the world a better place, together 🙏🏼) #BelieveinTheirDreams #NoleFam https://t.co/SrdCV59a5a Whatever the court, whatever the surface - Ready to #PlayTheUnplayable in the Court FF Novak with @ASICSTennis https://t.co/5ypeLuFo2q 🙏🏼🙏🏼🙏🏼 https://t.co/9OcRGXPDPb 😃🎾👍🏼 #finals #roma #ibi19 @InteBNLdItalia https://t.co/pFTAQywXlY @dieschwartzman Gracias Diego! Always a pleasure to play with you amigo 🙏🏼 🤝😃 very happy to see you back healthy and playing well, amigo @delpotrojuan. Wishing you best of luck at Roland Garros https://t.co/PmTaXz917r Forza Roma! Grazie mille! 🇮🇹 #ibi19 https://t.co/EHKIVRx4nk Very proud to be a part of #LacosteSaveOurSpecies 🙏🏼 https://t.co/rCwVMD5dhA @TennisTV Forzaaa RT @InteBNLdItalia: 4 times Rome's Champ. Say hello to 🇷🇸 N O L E 🙌 #ibi19 \n@DjokerNole #djokovic #nole https://t.co/t6SX9wVumo https://t.co/dnn4zzb0ic RT @ATP_Tour: How can we make this photo better? 🤔\n\nWhat about a ❤️, @DjokerNole? 😂\n\n#MMOPEN https://t.co/VK2oTKxpKh @MutuaMadridOpen 😘 😁🏆💥‼️ #MMOPEN https://t.co/j5hvthFQHm RT @repubblica: Oggi su Rep: 👇🗞 Djokovic: “La mia vita saliscendi: più che dal tennis ho imparato dai bambini” https://t.co/K87w0Wk8i3 #Vamosss #Idemooo #MMOPEN https://t.co/rmNUaS6baR At #Celisioso with Marko and our dear friend Santi who owns the place 🙌👌 https://t.co/XWJDs8ZQNH @MutuaMadridOpen 💪 Great to see these guys @lukamodric10 @NavasKeylor 🔥⚽️ @realmadrid https://t.co/oCgkxcFoMe 😃😁👍🇪🇸☄️ #MMOPEN @MutuaMadridOpen https://t.co/fKGd9tmY72 @ATP_Tour ❤️ RT @MutuaMadridOpen: ¡@DjokerNole se ha entrenado con @keinishikori para preparar el #MMOPEN! 👯‍♀️ https://t.co/J1oYnwqlEM Hristos Voskrese. Srećan Uskrs svima koji ga danas slave. Želim vam puno ljubavi i mira 😃🐰❤️ https://t.co/dPxTIb8DqV 😃👏🙏🥰🎉 #NoleFamEverythingIsPossible https://t.co/X4WRWVix6W All my love to #NoleFam and our special community together ❤️❤️❤️ https://t.co/MSwZrVWVPw RT @ATP_Tour: THE RESULTS ARE TURIN 🇮🇹\n\n2021 – 2025 \n\n#ATPFinals https://t.co/M4l6zDLnRO Amazing week for both of these guys. Congratulations to @dutzee for making his first 1000 final and playing some of his best tennis ever. He absolutely deserves this success. One of the… https://t.co/WJSdGhfIJZ On to quarters 👐😃🙌💪 #RolexMCMasters https://t.co/cE3SJ5DK0N #Idemooo #NoleFam! 😍🇷🇸 https://t.co/5RkTSRTL0r 🙏😜 https://t.co/rtWdVafM2p RT @tdnewcomb: What @DjokerNole has to say about working with @ASICSTennis to create the new Court FF 2 on-court #tennis #sneaker. My @Forb… Who’s excited? 🇯🇵👀 #Tokyo2020 https://t.co/6XtOvC5axL RT @worldolympians: Welcome to the #OLY family @DjokerNole 😊\n\nFantastic to see IOC President Thomas Bach presenting 3x Olympian and current… 😁 https://t.co/LErHVlmwZE @novakfoundation @UNICEF 👏🙌 At the @novakfoundation, we join @UNICEF in believing that when we invest in our children’s education, we invest in a better world. 🌍 @jelenadjokovic \n\nLearn more about their latest case for investment in pre-primary education here: https://t.co/U5pqmTF8ji #EarlyMomentsMatter https://t.co/MnTHjKtl4S WBC boxing champion @HASSANNDAM 💪💪👊🥊🔥 https://t.co/9VbpTsjgnK @usopen Lol RT @jelenadjokovic: Almond harvesters 🥰🤓😊❤️ @DjokerNole https://t.co/fhc4i7t5Ei Jungle hike squad 😃🌴🤳 before traveling home, we ate fresh coconuts and almonds directly from Mother Earth.. doesn’t get more sustainable than that 🙏🥥 #larepublicadominicana @jelenadjokovic https://t.co/jOI5AC4iuf There were no rain delays in DR 😜💦 https://t.co/AEyWXSrH2E Very proud to announce I've officially joined the @UltimateHCM family 🙏🎾 https://t.co/jeqdbUJ258 👏👏👏🙌🙏💪👐 #IDSDP https://t.co/jKorpkJRaa RT @IvanaSpaNOv1c: Veruj sampionu u sebi. 🙏❤ @novakfoundation \nU susret medjunarodnom danu sporta. https://t.co/3bwEBjzfMw .@novakfoundation celebrated the brilliant power of sport yesterday with many little champions 👏💪🏅🎾🤸‍♂️ Happy International Day of Sport for Development and Peace! #IDSDP @jelenadjokovic https://t.co/ZJzGKpW6dC @MutuaMadridOpen 👏👋 RT @novakfoundation: ''Winning trophies turned into a different kind of passion. My victories are no longer only mine. I use the means, the… ❤️ https://t.co/60sz1iOh2G https://t.co/Rd0xcBOcX8 Happy Birthday Coach 🥳 @VajdaMarian https://t.co/mBTgrapb2x Reflex training with help of a friend 😜 https://t.co/6OYnXLYqiH 😜 @Cristiano https://t.co/3NlD4J6ltW I feel Spanish in this photo. Yo me siento un poquito Español in esta foto 💪😍 @Carles5puyol @GarbiMuguruza https://t.co/3NQxOZisKu RT @novakfoundation: Jelena Stojković is a lady whose childhood dream was to become a doctor and help people! Today she is on her way to fu… Warm ups in Miami with my friend Tad 😃🙌👏👏 #Idemooo #MiamiOpen https://t.co/8gaq9C0o1O 😂 call me https://t.co/IYzTdmKyFx With legendary @Martina and her cute dog Lulu 🤗😍 https://t.co/kLZ168lcWP What a day https://t.co/oTsDfG7wXP @alyroe @BNPPARIBASOPEN 🤙 RT @BNPPARIBASOPEN: While playing doubles with Pete Sampras, @DjokerNole tries out his new \"split\" technique 😂🙈😬 \n\n#BNPPO19 https://t.co/q9… It’s never too early to practice for @Wimbledon https://t.co/ZB4lyyNQsg Good to see this guy at IW 👍 @LewisHowes https://t.co/AWnxsIrZPQ @carole_bouchard Unreal to have him watch me play now @TennisTV Lol Very special to have my idol watching tonight 🙏🙏🙏 #50 #BNPPO19 https://t.co/7mnVjDcGxz @ATP_Tour @felixtennis Family 🙏 @nenadzim @ZenyaraRetreat 😃👍 @jelenadjokovic 😍 👐👐 #djokognini @fabiofogna #idemooo #BNPPO19 @TennisTV https://t.co/XaHwbka1Dy RT @fabiofogna: Partner in crime... IDEMO NOLE @DjokerNole 🇷🇸🇮🇹 #djokognini #fogovic https://t.co/VQgasIOi0L RT @novakfoundation: Important notice for all donors: Someone has been impersonating Novak and requesting funds via @facebook Messenger and… https://t.co/zZwYTXhyNI Realizing how good this photobomb is when we stopped in LA. Tag this guy if you recognize him hahaaaaa @ Lacoste https://t.co/Nxx0ZO0EVe First practice in paradise 🎾😃🤙 @dieschwartzman #BNPPO19 https://t.co/bgZ3we7xfa Nice view from above #BNPPO19 https://t.co/zdEXLgK26l Sa dve legende. Kareem i Tabaš.\nMe with two legends. Kareem and Tabash. @NBA https://t.co/EZzHTZHxLW RT @ESPNLosAngeles: All love from @DjokerNole for Lakers-Bucks! 🎾🏆 #LakeShow https://t.co/MBQO8ILH2x https://t.co/f4HaHm0j1f When life gives you lemons.. don’t wait for the lemonade 🍋🤤😃😂 https://t.co/g3Mv7iaMUj San Diego 🏖 fitness time. Good to be back California 🤙 https://t.co/RDeQha7Ukm Veliko je zadovoljstvo provesti kvalitetno vreme u Srbiji sa familijom,prijateljima i narodom. Hvala ti draga Srbijo što u meni izazivaš pozitivne emocije kada god te posetim 🙏❤ https://t.co/ZU0H3f2YyR Working on new “up side down” strategy with Mihailo. Making sure he gets it before I leave to California 😂 @MihailoTopic ⠀⠀⠀⠀⠀⠀⠀⠀⠀\nMihajlo i ja radimo na novom “naglavačke” pristupu 😃… https://t.co/wXPkXos14d https://t.co/ZNcE0xTEAl Huge congratulations to Laslo for his amazing win at @RioOpenOficial &amp; his maiden @ATP_Tour trophy. You have demonstrated a great deal of resilience &amp; fighting spirit in difficult times. Thank you for your honesty &amp; transparency in sharing your emotions about your parents 🙏❤🇷🇸 https://t.co/8ozI498Lqs @RioOpenOficial 👏👏👏👏👏👏👏 Podrška, ne perfekcija 👐 @novakfoundation @jelenadjokovic https://t.co/sjmFsoE9g3 https://t.co/gXNLMYwVyF 🤪👏👏👏 @NovakCafe https://t.co/zwTnIevP1E This was a celebration toast, the healthy way 😂😂😂🥂 #Laureus19 https://t.co/hydDlxpMx4 👋🤙😃 https://t.co/CAq5j9QdZV The bros! #tbt This is back in Belgrade 100 years ago when... https://t.co/jz3jVOlNdh https://t.co/gwtSf6A3y4 @ORGNLmagazine @NewMediaTeam @jelenadjokovic @novakfoundation 💪💪 RT @instagram: “Sport has inspired me in my life, and it inspires people all around the world.” @DjokerNole 🎾 #Laureus19 🌟 https://t.co/8A9… @instagram @BasiaID 🙏🙏🙏 @MissNicollet Thanks Sharmila! 🙏 @ASICSFrance @ASICSTennis @LaureusSport Merci 🙏🙏 https://t.co/5Fwz3XMMNk 😃🥳🎾🇷🇸🙏 https://t.co/yByWHGXIsw @Naomi_Osaka_ Congrats! @crvenazvezdafk 🙏🙏🙏 @ITF_Tennis 🙏 @NoleSwedenFans @usainbolt Thank you guys! Honored to receive the Sportsman of the Year award 🙏 Thank you @LaureusSport for a wonderful evening celebrating our journeys and the power of sport to change the world. #Laureus19 https://t.co/HNFPWNbQgV @novakfoundation @LaureusSport Thank you team 🙏 RT @LaureusSport: Welcome to #Laureus19 @DjokerNole 💋 https://t.co/9zixe31T9a https://t.co/FqmXFY3pae RT @SkySportMotoGP: 🎉 Gli auguri di @DjokerNole a @ValeYellow46 🎂\n#SkyVale40 #SkyMotori #MotoGP #ValentinoRossi #Rossi40 @MotoGP https://t.… Cool Katie! Thank you! https://t.co/bRoxJ4v5bC @AngelOnSong #fashion Tennis camp days 😎😂 #kopaonikmountain #fbf https://t.co/XuYRJDYgBZ Bravo 🙌👏💪 @novakfoundation @jelenadjokovic @Blic_online https://t.co/ByGoHPKJEH RT @QueensTennis: ❤️❤️❤️\n\n#ValentinesDay @DjokerNole @ATP_Tour https://t.co/nUBPOysrVp ❤️ #happyvalentinesday https://t.co/jsLplx26bz RT @novakfoundation: In the presence of our founders @DjokerNole, @jelenadjokovic and our dear partners, yesterday we opened the first kind… When @jelenadjokovic and I first chose early childhood education as our mission for the @novakfoundation we dreamt of moments like this.. our 43rd kindergarten opened this week in… https://t.co/2gOcAORXf2 Hey Michael thanks for the invite! Can you DM me the details? @pmouratoglou https://t.co/4j7aktj13M Life of a tennis dad 🤣🤪👍🎾 #dadlifeisthebestlife https://t.co/ZsBfPRx5Zw RT @MihailoTopic: Traditionally we reunite and celebrate won championships! Love you so much @djokernole 🏆❤🙏🤗\nVec je postala tradicija da s… Hero 🙌🙏 “No arms. No legs. But anything is possible!” @TCurin @hitwithme #MondayMotivaton https://t.co/mGk3aIpn3z Da sam pauk, mali pauk 🎼😆 https://t.co/CEVFSeZ3Gw I’m live with @jelenadjokovic right nowww. Come say hi on her IG 👋 https://t.co/67vupUDgsd @novakfoundation @jelenadjokovic 📚🙏💯🤓 Cowaabungaaaa ☃❄️⛷🙌🤙😃 https://t.co/siz5lI0J8K Dejana... Volimo te svi puno i čestitamo ti na istorijskom dostignuću ❤️❤️❤️ HVALA ti u ime svih nas na koje zračiš svojom toplinom, pozitivnošću i borbenošću 🙏 Zahvalan sam ti na životnoj inspiraciji koja ima ogromnu pokretačku snagu i energiju ❤️ https://t.co/IvgXl6UOjr RT @ORGNLmagazine: Imaš između 22 i 30 godina i želiš da razgovaraš sa HR-om vodeće kompanije u Srbiji? Hoćeš da saznaš kako da napišeš CV… RT @novakfoundation: \"Most importantly, you should love what you do.\" - @djokernole 🙌🤪🎾 Who agrees?! #KeepClimbing #BelieveinTheirDreams ht… #vacationmode ✔️ https://t.co/PxtxMguVzD RT @jelenadjokovic: #Family snow time! Just what we need - lots of fresh air, beautiful landscape and outdoor activities 🥳❄️⛷ @DjokerNole… Wishing everyone a happy #LunarNewYear! #ChineseNewYear My most prized trophy is the dad life 💯🧸🦖🦎🤪😎 #stefan #tara @jelenadjokovic https://t.co/C5O4tPFsU6 3...2...1...❤️🥳🎉🎊 thank you for all the confetti @lacoste 😜 @jelenadjokovic @ Monte-Carlo, Monaco https://t.co/7RKHxzmScG Thank you @LACOSTE family 🙏🥳 https://t.co/KxPoDD5SLq Wow guys we did it #TeamDjokovic #AusOpen #15 🏆 #marian #uli #gebhard #miljan #ele #edo @jelenadjokovic. There aren’t enough words to express my gratitude for this group of people... https://t.co/RkIFT403x8 https://t.co/9847BfN9hb La famiglia ❤️ #TeamDjokovic #AusOpen https://t.co/o3sUoIR6sm https://t.co/WagYOrSNF1 RT @AustralianOpen: Proudly Serbian 🇷🇸 🙌\n\n@DjokerNole \n\n#AusOpen https://t.co/euZNEugTgq https://t.co/Ji8riCQwls Congrats guys! https://t.co/SFTPbPg288 Marian at his best 😂😆🤣🙌 https://t.co/HUabM38QdJ Conservative pre-final bike park fun 😂😆\n\nOprezna zabava na poligonu sa bajsom pred finale 🚲 https://t.co/BZ1rtNyPIv 7 years ago. Let’s go! Idemooo!! #AusOpen https://t.co/4k6psOvvYg Açaí bowl in its delicious form 😋 Of course, topped with fruits and some cacao nibs 😍 #goodonyamate https://t.co/yQTrG8YQiq https://t.co/SznqStXs3X This one is very important to myself and our entire team @novakfoundation @jelenadjokovic @HarvardCenter #DjokovicFellows 🙏 Thanks @BBCNews https://t.co/wgl8QiQSfg Before the season, this is where my body, mind, and soul recharged, found their balance. Synergy between these parts has always been key for me 🙏 #tbt\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\nWishing @keinishikori a… https://t.co/Pa3Mu62pgt Game face #AusOpen https://t.co/eiI79Utjm6 @KrisSekMNT @Maja_Nole 😍🙏 Water gymnastics on the program. Working on muscles and loosening the joints #AusOpen https://t.co/fECLOPKo72 Bow down to all the mamas! @serenawilliams @vika7 @jelenadjokovic https://t.co/av8VH4X4JF Australia’s beautiful creatures.. does anyone know what kind he is? https://t.co/XmUuPTGF0x Hvala svim prijateljima i sunarodnicima koji mi pružaju veliku podršku. Ovu zastavu sam dobio na poklon,ovde u Melburnu,od dečaka po imenu Novak. Kako je samo lepo to ime 🙏❤😃🤣 https://t.co/uIv71sbAhn https://t.co/jiGA41C1GK Hvala Karen 👍🇷🇸 https://t.co/1hnzy1KSlS RT @novakfoundation: To us, #FriendshipGames means happiness, love, and care 🤗❤️🌱\n\nAnd in celebration, we're finally premiering our video f… R3️⃣ #AusOpen https://t.co/bHKmtcAGKU An honour to be named beside these prestigious and accomplished gentlemen. Thank you, @LaureusSport 🙏 https://t.co/aDOVugVT8F @FabianC__ @AustralianOpen Hahaha #10YearChallenge modeling vs losing a bet to your brother 😂🤣🤷🏻‍♂️ https://t.co/qh20ezhsY9 Was a pleasure visiting with you guys here in Melbourne 👍👍😃🎾 @seikowatches https://t.co/OoqDGRuVI2 ➕5️⃣0️⃣ #AusOpen https://t.co/exJeNRT56M @AustralianOpen Yaaaassss https://t.co/DeAyiI8NIa RT @Eurosport_UK: You've seen him play this shot a thousand times 👌\n\nSo we asked @DjokerNole for his tips on how to master the art of the s… Sharing the love ❤️ https://t.co/TRP2zyHtw2 Thank you @SInow 💪💪 https://t.co/698ghRhUHW @ATP_Tour 😁😁😁😁😁 The Rocket’s 50th anniversary 🏆 @rodlaver @australianopen 🙌😁😆🚀 #AusOpen https://t.co/V8RSNZL5s3 RT @rodlaver: 50 years ago a Slam, now a witness to incredible tennis scenes at the Australian Open. I never thought I would be doing this… Happy birthday!!! https://t.co/WBKWFa4a5g RT @ASICSTennis: Novak is set to #PlayTheUnplayable in 2019 in the all-new #COURTFFNovak. We take a look back at the launch at the ASICS Fl… @bgtennisnation 🤙 Post training, thank you dear sprinklers 😅😂🤣🚴‍♂️🚿 #AusOpen https://t.co/r9hN6yNYcI RT @AustralianOpen: \"They call it the Happy Slam for a reason. There's a lot of good vibe, good buzz around the city. People of Australia l… @novakfoundation 🦸‍♀️🦸‍♂️💪👏🙌 Oz practice today @KAndersonATP 🤙😃🎾 #AusOpen https://t.co/b3c3la3LTh Tarbes, France 2001\n“Les Petite As”\nFirst time we met and played. Something was telling me back then that we would have an amazing rivalry and experience of playing each other on the… https://t.co/nhjU8m84c3 Ready for the start of the new season and to #PlayTheUnPlayable in my all new ASICS Court FF Novak shoes – the best in speed and stability and available in limited quantities worldwide from today! #ASICSTennis https://t.co/I34s4wIpgy RT @novakfoundation: Imagine the world where every child has an equal chance to attend preschool. \n\nThanks to donations like yours, 200 chi… @stu_fraser 👍👍 Djoković in Melbournić 👍 https://t.co/Z6baPgFdlJ RT @AustralianOpen: Back where he belongs.\n\n@DjokerNole on Rod Laver Arena 🙌 https://t.co/UDmnAHpPxs Are you ready to #PlayTheUnplayable? During 2019 you will be challenged to share your Unplayable shots or moments with #ASICSTennis so keep an eye out as the first challenge is coming your way soon! 🎾 https://t.co/pA30clahjl Good to be back Down Under 🐊🐊🐊🐊 #TeamDjokovic #Idemooo #NoleFam @AustralianOpen #AusOpen https://t.co/lredFDARkj 👋 @AustralianOpen #AusOpen https://t.co/8GKg2LfxaH @jelenadjokovic ❤️🙏 Almost to our goal! If you’ve already given, thank you 🙏 Help us past the finish line today and tell your friends to tell their friends!!! Every little counts #NoleFam #MerryChristmas #SeasonofGiving https://t.co/ctTyF8XcTZ Merry Christmas!!!!! ❤️❤️❤️ https://t.co/qkuzJByxas Mir Božiji, Hristos se rodi 🙏🎄❤ https://t.co/lmQ6sdFoyW RT @novakfoundation: We're so excited!!! #Christmas is almost here!! 🎄💫🎁 One of our favorite last minute gift ideas is to spread the gift o… Thank you ATP 🙏😃👏 let’s celebrate our kids and support them however we can. Donate to our #SeasonofGiving here through Jan 8 https://t.co/Ql9rNjccjq https://t.co/6u1hcvhIRV Using Qatar to reflect, learn, grow. This was my favourite moment, lucky enough to play with Djusko djokomare. Team Djokovic is now on our way to prepare for Melbourne - let the grand… https://t.co/zmhLxsV9HI @alexisohanian @IAMMEAGAN__ 😍 I think this is the winner 🤔 https://t.co/82liIbCiQz Djuskoooo idemooooo!!!! Let’s go brother!! 💪🙌👊🤙🔥☄️ #semifinals #djokobros #doubletrouble https://t.co/vRq7re4Ia0 .@jelenadjokovic and I are still matching donations for @novakfoundation’s Season of Giving!! Small or big, every donation makes a difference in a child’s life. Retweet if you’ll join us 🙏😃🎁 https://t.co/oA49Td7kry Rocky 4 in the ring 🥊👋😜 big solute to fucsovicsmarci for his impressive playing on court. First quarterfinals of the year let’s gooo #idemoooooo #qatartennis @ Qatar Open https://t.co/FqLi9EFsab Any team names suggestions? https://t.co/gJskghmQ7T Classic apples and stones https://t.co/E4Q3XkrzWw Chest bumping into 2019 like..... https://t.co/uSTmNJyFVp More ⚽️ in 2019? 😂🤣😃 https://t.co/ROdzk2Wv0m RT @stanwawrinka: 🇶🇦👳🏻‍♂️🐪☀️@DjokerNole @karenkhachanov @ThiemDomi @ATP_Tour @QatarTennis https://t.co/SPBjo9tDrd @justinfrederic @ATP_Tour More hats in 2019? Let’s do it again https://t.co/WYVwo5WpHX @NoleFamUSA @ATP_Tour Jelena starting her site!!!! @NoleLondon @ATP_Tour 👍👍 @ela981 @ATP_Tour Unforgettable is right Thank you guys for all the love and support in 2018! Awesome to experience this life journey with every last one of you. Where are you celebrating New Years??!!! 😄🥳🎊🎉 #2018bestnine https://t.co/6jZbzcS7tG Reflecting back on 2018 feeling grateful &amp; blessed. What were your favorite moments? 😜🎇🎾 #ATPTour https://t.co/fh7JiD6mzY Doha!! 🐪🐪👋 #salamalaikum #qatartennis @ Doha https://t.co/SDUUNdbMDd 🐪👋😃 https://t.co/lrlm6vz7yp @Mubadala @KAndersonATP 🙏 RT @head_tennis: An incredible year. What’s been your favorite @DjokerNole moment of 2018? https://t.co/hTOA11vfws @NovakIndiaFans 👋❤️ @TanjaNole Happy belated bday! 🎉🎉 2019 here we come #TeamDjokovic https://t.co/9YqjBHh0C9 @ReemAbulleil 🤙🤙🤙 @KAndersonATP @MubadalaTennis Always great to play with you Kev 🙏 Thank you everybody! Great start in Abu Dhabi 💪 #MWTC #NoleFam https://t.co/lrRzHpqq8e Little champs everywhere, I love it 😁😄💯🎾 #Idemooo #NoleFam!! Let’s go!\n_\n#repost World No #1 has a soft spot for the little champs! We saw some incredible moments today at the autograph… https://t.co/uuJfYyw3YY Who’s ready? https://t.co/AHoNqdjzOk @AustralianOpen 👀 @TennisTV https://t.co/raRcMV8ILY RT @HarvardCenter: Attn @Harvard doctoral students: Apply for the Djokovic Science &amp; Innovation Fellowship by January 2. Be part of a new g… @ATP_Tour 🕺🎄🤪 Happy Christmas Eve to friends celebrating tomorrow 🎄😛 https://t.co/b8fPQdPSrK Marhaba #AbuDhabi! I am so grateful and blessed that I have my whole family on court with me 🙏❤️ @ Abu Dhabi, United Arab Emirates https://t.co/E3lgq2FoBY @serenawilliams 🥳 @mrsaadramadan @MubadalaTennis 🙏 Marhaba! Excited to play at @MubadalaTennis this week and ring in the new year with UAE 🙌 #MWTC #KifakNovak https://t.co/LMejMmDrfc 👏🙏🇷🇸 Iskrena zahvalnost OKS za priznanje i poverenje koje mi je ukazano. Biti deo Olimpijskog tima Srbije je uvek velika čast i zadovoljstvo. Radujem se novim izazovima koji će prethoditi Olimpijskim Igrama u Tokiju. #TeamSerbia #Tokyo2020 https://t.co/0vEq7Oj9dH Stefan and I visited a very special Serbian church in Nice. It’s a small place where the Serbian community and culture are nurtured. Families get together every second Sunday and spend… https://t.co/C6qjGlhI1N 🙏🙋‍♂️🙋‍♂️🙋‍♂️🙋‍♂️🙋‍♂️🙋‍♂️ https://t.co/SHuJbDfgWY @jelenadjokovic 🥳🎉🎉 @star_991 🤪 @Catheri70427878 Hey Catherine, high five! 👋🤚 @AnicaRnic Coincidence?.. or not? 😉💁‍♂️ Thrilled to be meeting all my supporters in the UAE once again. See you at @MubadalaTennis starting Dec 27! #MWTC #KifakNovak https://t.co/UlfiGE4DWb Oooooooo 🤔🧐 https://t.co/pz6lTBPdfO RT @ATPWorldTour: #ATP Best Of 2018... ATP Coach of the Year 🏆: Marian Vajda (coach of @DjokerNole) \n\nCongratulations, Marian! 👏\n\nRead &amp; Wa… @LeneMostert @novakfoundation This is great Lené thanks for sharing @jelenadjokovic @novakfoundation @NDjokofan 🤙💪 Best ever hahahahahhaha @ATPWTAMemes https://t.co/PAtmf7WA77 Oduševljen! Hvala mom @crvenazvezdafk što sa mojom @novakfoundation podržava male šampione! Idemooo!! Još 21 dana! Link za doniranje je u biografiji https://t.co/DYBFiYfpY4 So excited to continue this campaign for the kids. Learn more at link in my bio 💪😍 #SeasonofGiving @novakfoundation @jelenadjokovic https://t.co/KOJ4gWo5TS 😃😃😃 https://t.co/PCtQSj6JTM @CincyTennis 🖌 #mondaymotivaton thanks for the reminder Elena 👍 https://t.co/PlViq2THhG RT @KelseyOAnderson: Who is your 🐐? #federer #nadal #serena or #djokovic? We have amazing signed merchandise from all  4 at https://t.co/fO… As the sun rises and we gaze into it, we marvel at its healing energy that sets up the course of the day with clear intention. Every time I’m grateful to experience such a divine natural blessing 🌅🙌❤️ This one is from my holiday with @jelenadjokovic 🙏 https://t.co/ijNawKP8P2 Zia!! Go watch this video and see how big her heart is.. https://t.co/FgJ6lyHRaN Preseason 🤙😃 https://t.co/yGrvF0e2NO @Simona_Halep @ITF_Tennis Congrats Simona!!! 👏 Honored and so very grateful. Thank you @ITF_Tennis 🙏🇷🇸 https://t.co/FUUeSjmAlG Fresh air, sun is shining, healthy bodies. We are blessed. Thank you God 🙏❤🙌 https://t.co/AlT8tWP2PQ RT @MihailoTopic: Overwhelmed by joy and pure happiness! This is how we celebrate No.1 in the world @djokernole and my second tournament wo… Abu Dhabi in less than a month. Excitement level: MAX @MubadalaTennis #MWTC #KifakNovak https://t.co/sJogHWKBqQ Idemooooo! #fkcz @crvenazvezdafk https://t.co/89tLJmi1g4 RT @novakfoundation: Human rights are universal and eternal. We support #HumanRightsDay for a better world - one community, one family, one… Family hike ❤️❤️❤️ @jelenadjokovic https://t.co/oXFHU2Rcmu Me when I smell air fresheners in the gym 😷🤢🥴 https://t.co/Mb3UYWAAyV Sve čestitke dragom Luki Modriću na osvojenoj Zlatnoj Lopti. Apsolutno zasluženo. Ponosan trenutak za naš region koji je dobio najboljeg fudbalera sveta 🙌👏 #BallonDOr https://t.co/JMTpGJAftu Congratulations @lukamodric10 for winning #BallonDOr. Very well deserved. Proud moment for our region to have the best football player in the world 🙌👏 https://t.co/ErCnqrNOQ6 Back to business🕺#saliflasource https://t.co/VbfxD5UV6N 😃🙏👍 https://t.co/cyj1tB6dvh RT @jelenadjokovic: Ljubavno gnezdo 🥰🥰 @DjokerNole https://t.co/Z6PFIv4K8v Can’t get away from #Zverev brothers 😃🤙 https://t.co/RfFudKWAOW All day every day 🙌🍊🍓❤️ https://t.co/ruemI3t7ae .@jelenadjokovic and I are excited to announce we will be matching all of your generous donations during @novakfoundation’s Season of Giving through the 8th of January 🙏 Retweet to spread the word and read our full message on my Facebook here https://t.co/3h0QcoENEb #fbf Julie has a tattoo of my logo on her arm 😃👌 it’s an honor! Grateful for all the love and passion I get from my #NoleFam! Love you guys ❤️👏 https://t.co/EMbjYjVA5x RT @novakfoundation: You guys are AMAZING! We raised over $16k towards our #GivingTuesday goal! While we’ve made serious progress, that doe… There's a $7M match available via Facebook fundraisers for #GivingTuesday starting 8am EST / 2pm CET.\n\n@novakfoundation and I are raising funds to send even more children to school! Help us hit our goal today and there may be a live Q&amp;A in the future.. 😜💪👏 Oh boy, did I tell you her biggest secret? She can hit, too. Sorry, she is already booked as my mixed doubles partner (for life 😛) @jelenadjokovic \n⠀⠀⠀⠀⠀⠀⠀⠀⠀\nPartnerka za mix dubl zauvek 💪😍\nKako dobro igra, vrti se kao čigra 🤣 #MondayMotivation https://t.co/Y0WP1oaMyP Congrats #Croatia for winning @DavisCup title. These guys are great tennis players but more than that, they are really great human beings I admire &amp; appreciate. Wonderful photo of both teams together post match tie is a sign of great respect 🙏👏 That’s what sport is all about ✊ https://t.co/chqqwqbtuJ Ovo pokazuje svu lepotu i moć sporta ✊ Čestitam Hrvatskoj teniskoj reprezentaciji na osvojenom Dejvis Kupu! Ovi momci su vrhunski teniseri ali i više od toga sjajni ljudi koje izuzetno cenim i poštujem. Divna fotografija obe ekipe nakon završenog duela pokazuje veliko poštovanje izmedju timova 🙏👏 #DavisCup https://t.co/8bvoIdOIec RT @novakfoundation: Join us in providing a BRIGHT START to a child's life and endless laughter in their future 🌟\n\n@DjokerNole &amp; @jelenadjo… Sometimes, I’m a Samurai and I take this role very seriously 😁 Especially after a relaxing Watsu water therapy 🙏 https://t.co/rHPsOKg7oz In our happy place together @jelenadjokovic 🙏 The water, the sun, nature’s marvelous energy.. simply the best https://t.co/vFPV1HKB6N @jelenadjokovic @ATPWorldTour ❤️❤️❤️❤️❤️❤️❤️ Great start to our journey together #ASICSTennis 🤙 https://t.co/9975Kj5D6n @QueensTennis 🕺 @TennisTV Secretsss I want to thank my team. This match wasn’t a great day for us, but if we put things into perspective it was an amazing year, an amazing comeback.\n\nThank you all #NoleFam. Now off to vacation 🤪🙏👍👏 https://t.co/Umk4LGTBQi Congrats to Sascha on his performance yesterday. You deserve it. Happy to see you capturing the biggest titles in sport 🙌 Hopefully I'll play many more years and see the ATP Finals again in the future. https://t.co/OBlNwvYG0O 🎾👍💪 #NittoATPFinals https://t.co/N8kie5DNYa Morning rituals before the finals 👋 #NittoATPFinals https://t.co/iWWUd4u0z0 #TrevorBayliss @englandcricket, you should keep your eye on Imran. I think he is a strong candidate for your team 👍🙌😁🏏 Imran Bashir (my chauffeur for the #NittoATPFinals) has been part of #TeamDjokovic for 10 years! He is also a famous batsman for his local #cricket 🏏 team. He received this trophy for best batsman of the year and we need to get it out there! 👏😀 https://t.co/yrRQCjtlis Let’s go! 🤙🙌👍❤️ #NoleFam https://t.co/1Rno4uwJH1 💪 #NittoATPFinals https://t.co/KoY2bHsBzA @LACOSTE @Disney https://t.co/xtwAcptcKV MICKEY 😍😍😍 https://t.co/24Mqbgb33x @Nick_HagueB2B @ATPWorldTour @Olivernhague @teamcheadle @BoltonTeam Great to meet you and the boys! @Olivernhague @novakfoundation 👍👍 Always choose kindness. #WorldKindnessDay RT @crvenazvezdafk: Na današnji dan, pre tačno 100 godina, okončan je Prvi svetski rat. Godišnjica potpisivanja primirja prilika je da iska… Natalijina Ramonda. Cvet koji simbolizuje dan primirja u velikom ratu. Molitva za sve žrtve velikog rata. Neka energije mira i ljubavi koje emituje ovaj ljupki cvet ispuni život svakog čoveka 🙏🌺❤🇷🇸 https://t.co/swLsw9WnxE 🙏 @ATPWorldTour #TeamDjokovic #NoleFam https://t.co/RZocWyeOqm Biggest believers, thank you #NoleFam ❤️ Hvala 🇷🇸 https://t.co/3BBpYCcsVr 🤙 #ATP https://t.co/iCbi4DSzzw RT @ATPWorldTour: Jumping into the weekend 🐸 \n\n@DjokerNole #NittoATPFinals https://t.co/6rPsgTJgaw Special to have Serbian family everywhere I go 🇷🇸 #NoleFam https://t.co/d4UzZ0rMP2 @ATPWorldTour https://t.co/cAJkiaHpdt Best shot of the day from #coachoftheyear #ATP @ATPWorldTour https://t.co/9JOn33gSSD Winner lol 🤣 https://t.co/IzCPBWYO3m Explain dapper in a GIF https://t.co/V5ACj3iGJE RT @JRossShow: Wow, what a line up! We have the @spicegirls - @MelanieCmusic, @GeriHalliwell, @EmmaBunton, @OfficialMelB on the sofa, as we… @ASICSTennis @GettyImages @ASICSamerica @ASICSeurope @ASICSUK @ASICS_JP @ASICSItalia @ASICSFrance @ASICSspain @ASICSaustralia @ASICSmexico Idemoooooo @jelenadjokovic @WebSummit @CynthiaLIVE PROUD! Can’t wait to see video Happy happy #Diwali!!! 🎇 https://t.co/jJSYxxS5LU Historical win for @crvenazvezdafk! Amazing achievement. Well done boys 🙌\n\nIstorijska pobeda Zvezde nad velikim Liverpulom. Hvala momci na fantastičnoj igri i navijačima na sjajnoj atmnosferi. Dokaz da se sve u životu može kada je neko posvećen 🙏💪👍👏 #fkcz https://t.co/DFtXHUzYtb Back to London again. Back to number 1 again. Let’s do this #Nolefam. One more to go! #Idemooo #NittoATPFinals https://t.co/crhC9cKSzA Sending my best wishes and hopes for fast recovery after surgery my friend 🙏 https://t.co/NZLWrtJ6j7 I'd like to express my thanks to Paris and #nolefam for this part of an unforgettable journey. An honor to play in @RolexPMasters finals once more. Congrats to @karenkhachanov, big matches to come from him.\n\nOn to the next challenge in London, see you guys there 💪 #Idemooo https://t.co/xDTIxjxEFW Yesterday was, as always, a pleasure playing with @cilic_marin, a true fighter and role model on tour. Congratulations my friend on the launch of Marin Cilic Foundation supporting kids 🙌👏👍 #Idemooo https://t.co/kIgitCfHeu 🎾👀😜 https://t.co/iq9HNO0JDj Believe in yourself. Every. Single. Day 👶 #tbt https://t.co/4sDSBsxraZ 👍 good vibes in Paris! All my love to #NoleFam ❤️🙏 #RolexParisMasters @RolexPMasters https://t.co/6dwEexFaPZ #Transcendence by @FoodMattersFilm brought together minds from the world of wellness to talk about improving people’s lives. I share some of my own personal struggles on and off the court. Join us for the Nov 1 premiere!\nhttps://t.co/V4SLWkAtsi\n\n#livelifebeyondtheordinary #fmtv https://t.co/ho754GJuMy Bonjour Paris 👋💪🤛🐊🎾 #TeamDjokovic #RolexParisMasters @RolexPMasters https://t.co/PjyMlJXwII @RolexPMasters 👋👍👍 Paris t-minus 3 days 🏃‍♂️🎾 @RolexPMasters https://t.co/UFeGdwemeY Looking forward to a balance lesson my friend 😃😉🤙 https://t.co/rgyOhyfVkN 🔄🔄🔄 https://t.co/SqOhzaE4uM The quote my US family goes by this month seems appropriate for this video: I’m comfortable being uncomfortable 💪💪🤪 #balance @Andriragettli https://t.co/8FrPpPSzo7 Day or night, keep those legs light 😉 https://t.co/gvM6TgXxgj Haha I see it, we are☝️😍 https://t.co/PhIa5QkSoc RT @ASICSTennis: Another superstar will join #TeamASICS tomorrow. He doesn’t play tennis - who could it be? Here’s a welcome message from @… Best Man warm ups from Saturday 😜 https://t.co/vRCeUwqzSZ Blue skies, fresh air, and lots of love to go around 🌳 @jelenadjokovic https://t.co/PHEdwdVvQK RT @jelenadjokovic: Welcome to Kissington! 😘 We only spread love, kisses and hugs around here 😍🤗❤️ No wonder kids grow so fast in our town!… You have been a blessing to all since you arrived. I am so grateful to have you as my son, my brave falcon 🦅and knight🛡 You shine light &amp; love ❤ on our souls. Thank you for teaching us how to be present, enjoy &amp; smile, forgive &amp; move on. Happy bday my dear son 🎉 Love you ❤ https://t.co/1kS3FpuJhQ Radek has been a part of my life in many different stages, but the most cherished way will be as my lifelong friend. Cheers to your tennis career @stepec78. We are blessed to celebrate all you have achieved and all that awaits you on your new journey 🙏👏🎾 https://t.co/KCl3fDGQlh @NBA Just wow Points if you can name the dance move in this video? Extra points if you follow us at @novakfoundation - let me know if you think we should do more clinics like this when I travel #Care4Kids #BelieveinTheirDreams @jelenadjokovic https://t.co/b9voDQG9Im @ASICSTennis 🤙🤙😄 Should I do more podcasts? Could be fun 🤔 https://t.co/QtjesxBwsN @CarriGeer @harrisonkeely Very impressed A little fun for @stepec78 🤙👍🎾 #Prague @TommyHaas13 @F1MikaHakkinen @AndreAgassi https://t.co/geMlfeRXQ5 Aww you guys joined us a bit late 😜 All food disappeared 💁🏻‍♂️😂 \n\nThank you #Prague for great time! Happy to be together with #family ❤️ @jelenadjokovicndf https://t.co/9XE2XwgnW8 Reading comments 🤙 #NoleFam you guys are the best on Twitter https://t.co/rMAFrDG08d RT @ATPWorldTour: 2018 Comeback Player of the Year Nominees\n🇷🇸 @DjokerNole \n🇦🇺 @JasonKubler \n🇦🇺 @johnhmillman \n🇯🇵 @keinishikori\n#MoetATPAwa… @jelenadjokovic 😴👏 Can’t wait to celebrate my good friend @stepec78 in #Prague. Who will be there this week?? 🤙 https://t.co/GNmZi6IBEl 🇷🇸🇷🇸🇷🇸🇷🇸🇷🇸 https://t.co/9gaX5gjDqS RT @SH_RolexMasters: \"Maybe I was Chinese in the past life. I wouldn't be surprised, to be honest, with the way I feel here. There is somet… https://t.co/QamzcjMBTy Believe. @SH_RolexMasters #RolexShMasters https://t.co/meMbqvpdUs Sharing all 1000 with you ❤️ #NoleFam https://t.co/ZhXahl9jsY These fans were waiting outside for me last night. Always an amazing feeling 🤗🤪👍 #NoleFam #RolexShMasters https://t.co/Frkgfmq6Bz @head_tennis @SH_RolexMasters 💪🏻💪🏻 @ASICSTennis @GettyImages 😁😜 “Never say never because limits, like fears, are often just an illusion.” @Jumpman23 \n\n#RoadTo1 #Semifinals #RolexShMasters @SH_RolexMasters https://t.co/lw3BRM6HFI Thanks Kelsey 🙏 Always a pleasure to be on court with Kev. Safe travels to the family and say hi to Lady Kady for @jelenadjokovic and I https://t.co/NJpdhIrP4y How did I do? https://t.co/t1xmYPdWFY @rnadalacademy 🙏🙏🙏 RT @ATPWorldTour: 🗣@DjokerNole has a message for those affected by the recent tragic events in Majorca. https://t.co/IwW1v3r1Hp Xie xie #NoleFam 👋👍😄 @SH_RolexMasters #RolexShMasters https://t.co/X02AqdOrkE @Kiki_LoveNole 😁 Connecting with the tree first and asking for permission to water it from this old well 😌 https://t.co/M4wgNIN3BH Ancient Chinese tradition of watering this powerful and wise tree for good luck with water from the old well 👍🙏🌳💦 #RolexShMasters https://t.co/mJqmyH7qYL Squaddd we ready 👊 #Idemooo #TeamDjokovic #RolexShanghaiMasters https://t.co/OH5N7bttHy Wow feelin the ❤️ in China #WheresWaldo #NoleFam https://t.co/I5eto4V1Ct Top Gun 2? 😎😂😜 https://t.co/FfdO8KW4S3 Looking forward to playing and visiting this beautiful country. Thank you for the invitation, see you guys soon! https://t.co/0ZgSLnLgQu RT @ATPWorldTour: You guys 😍\n\nA Shanghai welcome to the warm-up court for @DjokerNole https://t.co/wa1N0T1xUH I will also keep this story in my heart! Thank you Valtinho and everyone that came to Chicago 🙏❤️ https://t.co/Mag9psnmoV It’s always #WorldSmileDay in China 😁😆😄😃😀😂 https://t.co/YzX2INFXlv I received the gift of my Chinese name in #Shanghai today. Beautiful present that I will cherish. Sincerest thanks to my @asicstennis family 🙏\n\n#ASICSTennis #IMoveMe https://t.co/z3LwczAh7Y Workout time outdoors. I love this kind of training. Always recharges my batteries and connects me more to Mother Nature 🙏🙌🦆🐝🐟🌳🌱\n\nNajlepše su vežbe i treninzi u prirodi. Uvek mi napune baterije i povežu me još više sa Majkom Prirodom. #nature #outdoors #training #shanghai https://t.co/ptAsQdU9K7 👋🎾 Shanghai idemoooo https://t.co/4BcqA3De6C @ATPWorldTour This is awesome hahahaa 😏😂🕺🕺🕺 https://t.co/f9k6igWb5F On my way to #Shanghai I reconnected with an old friend. We talked Universe, intelligence, frequency, energy.. You know, the usual “stuff” 😎🙏😃🙌 https://t.co/O7EX6x2lIu #TeamDjokovic training in the water before Cincy win 🚣🏿‍♂️🤙 #tbt #goodtimes #goodteam #goodshorts https://t.co/ama0HWHm4N About last night.. 👌👍😊🎾 #chocolate #dessert #glutenfree https://t.co/ETU1FiWOfy ☀️❤️🙏 Who else has listened to this one? #light #love #happiness https://t.co/9sJ5GiDSdn Proud husband! 🙌🤩 Congrats on the fantastic success of #DareToBeOriginal Conference so far @jelenadjokovicndf and team! @orgnlmagazine @novakfoundation\n\nBaš sam ponosan! Jučerašnji deo konferencije #DareToBeOriginal je bio fantastičan, čestitke Jelena i timu! https://t.co/erxqWQjFbH RT @Slavica_NoleFam: To succeed in life, you need to sacrifice a lot. How much you sacrifice,that's how much you want it.😊 Everybody has ri… RT @ORGNLmagazine: “Koliko ste spremni da se žrtvujete za ono što želite?” — @DjokerNole \n\n#DareToBeOriginal https://t.co/1ygFLvOp5o #Live 📹 @ORGNLmagazine Instagram! 👉 https://t.co/tMs5LCNJQC\n\n#DareToBeOriginal 上海 https://t.co/LWTBMomYo5 Sjor Niko. Moj teniski otac. Mentor. / Niki Pilic. My tennis father. My mentor.\n👉 https://t.co/rdB5de5tFd https://t.co/ZSVtRWVrs4 Played a little tennis with all the kids that were around watching my practice yesterday. The future 👍🎾 #CoachNole #NoleFam https://t.co/EFgXKZtBWz Prijatelju, lepo je bilo videti te. Hvala ti na podršci i što si bio na treningu sa Filipom. Videćemo te uskoro na stazi i znaj da smo svi uz tebe 💪🙌🙏 https://t.co/sSHs4pExJO @jelenadjokovic @ORGNLmagazine @novakfoundation Go team gooooo This is awesome Lené. Heard your class is doing great things in #Care4Kids FB group 👏 Tell the kids I say hi and to keep up the good work, keep believing! @novakfoundation https://t.co/Rm6Is6yzRq Big smiles for the kids back home in Serbia 🇷🇸😁\n\nThank you @RSMUSLLP, @rogerfederer, @rodlaver, and our many other supporters for joining the @novakfoundation‘s Breakfast of Champions last week. We can’t share enough gratitude 🙏🙏🙏 #EarlyChildhoodEducation @jelenadjokovic https://t.co/yyIX0RdWL2 .@OmarMiller got game. Welcome at any @novakfoundation kids’ clinic https://t.co/iVHjro6MBc 12 years! Never give up on your dreams!! Nice to meet you Elena https://t.co/0fahbu98q3 Ponosan sam na Mihajla koji je osvojio svoj prvi i jedini turnir na kojem je do sada učestvovao. Kada god sam u Beogradu, igramo tenis, pričamo o tenisu i životu i trudim se da mu pomognem u ulozi mentora koliko god mogu. Bravo Mihailo 👏🙌🎾 #CoachNole https://t.co/0B6gAvFczL RT @novakfoundation: ✅More than 3,200 @Prizeo entrants\n✅A once-in-a-lifetime-opportunity to meet and play with @DjokerNole \n✅$123,000 raise… @KAndersonATP @LaverCup @NickKyrgios @JackSock @FTiafoe @PatrickMcEnroe @JohnIsner @NicoJarry @dieschwartzman @kennykim Same Kev Love my #NoleFam. Cool finding you guys in Chicago https://t.co/T81d85jfeS @LaverCup @rogerfederer @JackSock @KAndersonATP @JohnIsner @NickKyrgios @dieschwartzman 👌 Next time I’ll make @rogerfederer wear hockey pads #physio 😅 https://t.co/uAQfZgl4uk We are some lucky guys @rogerfederer https://t.co/rqZUBfaWKq These boys brought it home! 🏆🤟🇪🇺\n\n@lavercup it was a pleasure! Epic to share the black court with some of the best players and guys in our sport both on #TeamWorld and #TeamEurope⁠ ⁠ https://t.co/2Z4io5Nh1t 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥 @David__Goffin #TeamEurope Yeaaaa man you got this @kyle8edmund #LaverCup #TeamEurope C’monnnn let’s get it @GrigorDimitrov 👊 Idemooo #TeamEurope The man, the myth, the legend #Edo https://t.co/UxVDVCn2MX Awesome time at my first #LaverCup Opening Night. Lots of laughs and in good company at @NavyPier 👌🔝\n\nPhoto Credit: Clive Brunskill https://t.co/8Zogib3nSM The boys ✔️ @lavercup\n#TeamEurope2018 #LaverCup https://t.co/z589egLeWZ Thank you for a fantastic first welcome #windycity! I love the energy here in Chicago 🔥🙏😆 #TeamEurope2018 #NoleFam #LaverCup https://t.co/qfWO6bGWB7 @LaverCup @rogerfederer @JackSock @KAndersonATP https://t.co/MPyPOX3APt TEAM EUROPE lineup 🔥🤟😎🇪🇺 #TeamEurope2018 @LaverCup #LaverCup https://t.co/LSU3pPCC6m RT @kyle8edmund: Team Europe 📸 #LaverCup https://t.co/7uTwvrmTkN #teamspirit #squadgoals #djogerzveritrovffinmundy? https://t.co/yGV4fEaLvb RT @LaverCup: #TeamEurope2018's @DjokerNole feeling the love and returning it with his famous forehand.  \n\n#LaverCup https://t.co/AHc26Y2vje RT @novakfoundation: “The most important thing in life is to love what you do and never forget that you are never alone.\" @DjokerNole #Wedn… @novakfoundation @LaverCup 💪😃 @meokee @rogerfederer Lol this is awesome Or @rogerfederer how about this for #TeamEurope ? https://t.co/9KdK3u11S6 I’m in https://t.co/3bGj1Tnqig We are very excited to have you with us, Andy. See you tomorrow 👍 @novakfoundation https://t.co/RJHOAdDpV9 @LaverCup @David__Goffin 🤙 We are here Chicago! Let’s rock n roll guys! 📽🎾🏙 @LaverCup #TeamEurope #Zverev @David__Goffin https://t.co/dVGUupNdcR @espn @usainbolt ⚡️⚡️⚡️⚡️⚡️ @zagatam @NoleFamUSA Haha caught us 👀😆 @ATPWorldTour @JelenaRisticNDF @novakfoundation Very special, thanks guys 🙌 Food goodness 🍈🍉😃 #fruitlove #healthybody #healthymind https://t.co/VMA8lHZjNm RT @LaverCup: Honouring @RodLaver, and his fellow tennis trail-blazers.\n\n@DjokerNole #TeamEurope2018 #LaverCup https://t.co/7i2lFbXvCf @crvenazvezda_en 😁🤙 RT @crvenazvezdafk: Pred početak meča sa Radnikom igračima je sreću u Super ligi i Ligi šampiona poželeo Novak Đoković #fkcz https://t.co/B… Baš dirljiv momenat. Od klinačkih dana navijam za Crvenu Zvezdu i radujem se i nerviram uz njih. Momci, imate veliku podršku za dalje borbe i veru svih nas navijača da možete da pomerite granice! #Idemooo 🔴⚪️ @crvenazvezdafk https://t.co/XJvZQ7W7gm Can we agree this is one of the best we’ve done @head_tennis? 🤙👏🕺 https://t.co/SXc310E1U7 “...To keep me from getting to you babe”🕺 Volim te @JelenaRisticNDF https://t.co/iLroPNFScN RT @LACOSTE: A crocodile lasts forever. Well done @DjokerNole on your great victory.\n14th Grand Slam win. #NovakXLacoste #TeamLacoste #NYC2… So so glad we could say hi to the dinos before heading home, thank you guys. Stefan’s favorite 🦕🦖😄🙏 https://t.co/TIkRyzVXdY This guy! 👏👏👏👏 https://t.co/T5bcu6PTX6 @TennisHalloFame @NovakFanClub 🤙🤙🙏 RT @BrainGameTennis: Fight!!! 🇦🇺🇷🇸💪👊\nCongrats mate! Such a pleasure to work with Marian Vajda &amp; #TeamDjokovic to help guide   @DjokerNole t… RT @NovakIndiaFans: .@DjokerNole: \"I would like to congratulate Juan Martin. What he has done in the last 4-5 years with his wrist injuries… Much love to my #NoleFam. Heartwarming to read all the positive feedback.. very proud to have you guys with me on this journey https://t.co/5OfWobMG7t THANK YOU 🙏 https://t.co/YEJb7y4Xy8 https://t.co/FcWki3TYLf @novakfoundation 🙌🙌🙌 @novakfoundation @usopen #VerujemoUNjihoveSnove ❤️ RT @ATPWorldTour: PHOTO CAPTION CONTEST 👇 https://t.co/DRIvxpwegH 📸😜😘😁 @LiveKellyRyan https://t.co/9UlOmIvOFF @ToniKroos Thanks man 🙏 My #floss dance is no good 😂🤣 Thanks for a fun morning, friends @KellyRipa @RyanSeacrest #kellyandryan https://t.co/IHca1ekUUC @TODAYshow @Naomi_Osaka_ @alroker @hodakotb @SavannahGuthrie Thanks for having me guys! Always a pleasure Not my kind of breakfastbut lots of laughs with @TODAYshow!! 😁👋 https://t.co/vHrFITm9fY Another dream come true 🏆 @usopen https://t.co/eYr6OogSXE Roaring for my sport, my wife and kids, my whole family, my people 🇷🇸🙏🎾 Love to everyone. It feels good to be back.. #Finals #NoleFam #Idemooo @usopen #USOpen https://t.co/EZpXkwlVzn Jumping into semis like... #USOpen https://t.co/CaXKTHW8Tx Hard fight under the lights.. much respect to @johnhmillman last night. See you guys at #semis #USOpen https://t.co/gOwR6QMA4K 🙏💥💥💥 https://t.co/vIZlTQlfHp @espn 😂🦖 @ASICSamerica @corinnedubreuil Thanks guys, see you out there! Guys there’s only 2 hours left to join the @novakfoundation @LaverCup lottery to hang with me in Chicago. C’mon I’m fun. Go go gooooo 🏃‍♂️🏃‍♀️🏃‍♂️🏃‍♀️ https://t.co/W2wGO1TftD https://t.co/YGZGoJAxfQ Who handed this guy a mic???!! 🤣🎤 #goodcoaching #revolutionarypracticesession #marianvajda https://t.co/czPbUZPvnh Everybody believes in something.. Most of all, we should believe in ourselves.  \nhttps://t.co/nBNhwCQRkA\n📹 @espn #USOpen My favourite kind of press conference 👍😜 #NetGeneration https://t.co/0ORDAEqRjk Quarterfinals ✔️ @usopen #USOpen https://t.co/y242Pp1oLD @head_tennis 🔥 1️⃣ 👨‍👩‍👧‍👦 ❤️ https://t.co/ChXoGGQbTo @M_Weatherly 🤙 Ice cream 🍦, dinosaurs 🦖, finding my mojo.. we cover everything but naked ice baths haha. Big thanks to @espn and Michael Steinberger for this special interview 🤙\n\nhttps://t.co/bQlBNPAVjE https://t.co/zj4F5AlZ8b Ready, set, go! 👨‍👦#familytime #nyc #asicstiger #asicstennis https://t.co/tZNgYcpLGD 3 days left to enter.. let’s gooo #NoleFam https://t.co/W2wGO1TftD RT @JelenaRisticNDF: I see this was quite a philosophical discussion you guys had. Something @DjokerNole loves the most :) Great article by… Fun fact: crocs can fly #USOpen https://t.co/eWt7rxtTLd Bravo momci, bravo Zvezdo! Lavovska borba, za svaku pohvalu! 🙌👏 Čestitam na istorijskom prolazu u grupnu fazu Ligu Šampiona! Idemo crveno beli @crvenazvezdafk @ChampionsLeague #ChampionsLeague 🔥🔥🔥🔥🔥 #USOpen @usopen https://t.co/ST5QcubCHM A new chapter begins.. see you guys out there 👍 #NoleFam #USOpen https://t.co/WAa36UWtOf Veliko Hvala ski klubu “Rtanj” na divnoj poruci koju su veoma kreativno stvorili u veličanstvenoj prirodi najdražeg Kopaonika. Volim vas puno i pozdravite mi Pančićev Vrh 🙏🌲🏔 https://t.co/iMd50x779l Had a blast at Kids’ Day with some old friends, some new friends 🙌🤟Thanks for having me, @usopen 😁🕺🎾🎾🎾 #ArthurAsheKidsDay #USOpen https://t.co/76pMpAaduY Kids’ Day continues! 😂🦖🦖 https://t.co/gHJ4lQjac0 👋😜 #ArthurAsheKidsDay @usopen #USOpen https://t.co/T3k3jFqvat Thanks #NoleFam for stopping by the @LACOSTE boutique at Macy’s Herald Square last night 🐊😁 So cool to see everyone in NYC - you guys are rockstars and it’s awesome to have the support heading into the @usopen 👏🤙 #TeamLacoste #USOpen https://t.co/RToYtT4fcd See you tonight #TeamLacoste 😁🐊 https://t.co/cxu9gyhQWz RT @stanwawrinka: When you need only 1 🎾 for a drill with @DjokerNole !!🏃🏻‍♂️💦🤷🏻‍♂️ @usopen https://t.co/XQ4GIMQiG0 Undiscovered singing talent..... 🤔😂 https://t.co/xFrq9yq5OH @LeoDiCaprio Incredible @KAndersonATP 🤯 @kyle8edmund @LaverCup @rogerfederer @David__Goffin @GrigorDimitrov @rodlaver Let’s goooo! RT @ORGNLmagazine: ➡️ORIGINALCI, PAŽNJA! ⬅️Imaš super ideju? Predstavi nam je do 10. septembra i možeš osvojiti sjajne nagrade koje će ti p… Today #NoleFam, don’t forget to enter our @novakfoundation lottery for the chance to hang and practice with me in Chitown 🎾🎾🎾 #LaverCup #Care4Kids\n\nhttps://t.co/W2wGO1BE53 Got the team on lock 🔒 @rogerfederer #zverev @GrigorDimitrov @David__Goffin @kyle8edmund \n\n#TeamEurope @LaverCup https://t.co/YPXyAUbbUn 🙏 https://t.co/EA3HHgC2kb Guess who 🤙 @LaverCup #TeamEurope https://t.co/vym2Y35Amf @SavannahGuthrie 👍👍 RT @TODAYshow: .@DjokerNole tells us how he’s getting ready for the #USOpen! https://t.co/bWphNsQ0uO Ciao, NYC 🕺🍎 @TODAYshow https://t.co/FzzZftMWBH Wow so nostalgic.. 💯 https://t.co/wDYfhkKH7D @rennaestubbs @PatrickMcEnroe @usopen 🤙 @BenRothenberg Did I miss anyone?! Hahaha thank you very much partner. We should still give #Djokerson a try for doubles World Tour Finals. You never know 😉🤙 https://t.co/VpcpzI7bmy RT @novakfoundation: Do you know what dreams are made of? Hard work, determination &amp; self-belief that even when things seem hard, you can r… @ASICSTennis @CincyTennis @GettyImages @ATPWorldTour @ASICSamerica @ASICSUK @ASICSeurope @ASICSaustralia @ASICSFrance @ASICSmexico @ASICS_JP @ASICSspain Thank you #ASICSTennis! 👟🙏 This one is for you guys!!! #NoleFam 🇷🇸❤️😄🤳 https://t.co/WBYIEgIGTe @LaureusSport @ATPWorldTour @CincyTennis 🙏🙏🙏 @TennisTV Very special day I’m proud to share this trophy with #TeamDjokovic and #NoleFam. Thank you God. Thank you Angels for guiding me through this wonderful journey of Life. I feel your presence in everything and I am eternally grateful 🙏❤🙌 https://t.co/NBMXERNkcs\n\n#CincyTennis #GoldenMasters https://t.co/Sv9Ng6qqOd A dream come true 🙏🏆\n@CincyTennis #GoldenMasters https://t.co/nb9XL7nw2W RT @LACOSTE: Moving on to the Cincinnati final!\n#TeamLacoste #NovakXLacoste #CincyTennis 👍🏻🐊 https://t.co/UyIcL8WhMj @CincyTennis 🐊🐊🐊🐊🐊 @lacoste Always a pleasure and big challenge playing a great person and player @cilic_marin. Big respect to you, my friend.\n\nUvek je zadovoljstvo i veliki izazova igrati sa sjajnom osobom i igračem. Veliko poštovanje prijatelju. https://t.co/t9JWOdin1d Energized, pumped, ready to rock n roll 🤟 #semis @CincyTennis https://t.co/L5hr2filGX RT @head_tennis: Semi-final is calling for @DjokerNole in Cincinnati 💪 #CincyTennis https://t.co/o0m7YpGX8l MAMMA MIA https://t.co/GHIkcIiOWy Cincy, the ❤️ is mutual #WheresWaldo #NoleFam #CincyTennis https://t.co/vx8sk3gsBN A new kind of training... #CincyTennis https://t.co/tDHbZlLegH Woooo idemooo 🙌🐊 https://t.co/CFzFakPCO5 One step at a time #CincyTennis\n\n📷 @bensolomonphoto https://t.co/Muvdcg4YAw My team prays for #Genova today. Our hearts are with you ❤️ @CincyTennis ON WE GO #NoleFam Guys, very important question: Have you joined the @novakfoundation #LaverCup lottery yet?? Who will meet me in Chicago? 🧐 #TeamEurope\n\nEnter here: https://t.co/S88cSpQsXu https://t.co/EOCA612UKW #TeamEurope looking goooood https://t.co/B5muQzwiDh @novakfoundation 🙌🙌🙌 Rain or shine, selfies must go on 🤳 @CincyTennis https://t.co/aG0zugBKtZ @LaverCup @GrigorDimitrov @David__Goffin @rogerfederer 🔥 Want to win a trip to Chicago to practice with me before the @LaverCup? With a $10 donation to @novakfoundation, you will earn 100 entries to practice with me on Tuesday and then attend the entire tournament that weekend! #LaverCup\n\nEnter here: https://t.co/S88cSpQsXu https://t.co/dMOccXsAxR Sounds like a #Djokerson reunion is already in high demand 🇷🇸🇿🇦🎾... Really grateful to have played together this week, @KAndersonATP. See you next time, Toronto 🙏 @rogerscup #RogersCup https://t.co/5jGj3yu7Ge Team #Djokerson at work. Good luck to @KAndersonATP in singles and see you all later for doubles 💪 #Idemooo @rogerscup https://t.co/iah0UfSpIA @KAndersonATP @rogerscup Let’s goooo #Djokerson RT @KAndersonATP: #Djokerson into the QF! 🤜🤛 @DjokerNole @rogerscup https://t.co/uz8UR7BYzF R3 starts now 👀🎾💪 #Idemooo #RogersCup https://t.co/7zsGpErTbN @rogerscup #Idemooo RT @rogerscup: In case you didn't know, @milosraonic and @DjokerNole take the TTC to #RogersCup. Shouldn't you?? 🚇➡️🎾🏟️ https://t.co/nWEV27… Going live on FB with @rogerscup in about 5 minutes. Come say hey 🤙 #RogersCup #Idemooo https://t.co/mzOsUIORHQ #Djokerson ✅ @KAndersonATP https://t.co/M2zKPWIz0J Sacred geometry on the Centre court. People drying the courts know what they are doing 😃🙌⚡️🌀 #RogersCup https://t.co/XffCuAJOG6 A couple of crocs on practice court 🐊🎾🇷🇸 #TeamLacoste #RogersCup @filipkrajinovic @LACOSTE https://t.co/CLcY7mfX3W #NoleFam help me and @KAndersonATP out... what’s our squad name for doubles? #RogersCup Looking forward to it @KAndersonATP! 🤙 #RogersCup https://t.co/dmjIEjHUA5 This is what a Coach-Player relationship looks like in reality 😂💪✌️Vajda is light as a feather 😅 #TeamDjokovic #Idemooo #RogersCup https://t.co/jHr52st1bS @JelenaRisticNDF ❤️❤️❤️ One of my favorite events: #ArthurAsheKidsDay at the @usopen! \n\nCome see me play for the @novakfoundation on Aug 25 👍 #NoleFam \n\nInfo/Tickets: https://t.co/CyrNHVkdq3 https://t.co/iH7C2hfgZ7 So.. is beard 👍 or 👎? Nole incognito lol 😂 #training #tennis #spain https://t.co/m0TaK3jEmo Catching up with my boy but he seems to be getting faster. So blessed to spend quality time with him outdoors ☀️🙏👨‍👦 #familytime #nature #Care4Kids https://t.co/bsp2V3pDT3 #tbt to @Wimbledon #ChampionsDinner. I don’t know if you notice, but these 3 men around me remind me so much of The Godfather film characters 😂😂😂 Can you guess who’s who? https://t.co/UDtWcjdVOC RT @head_tennis: Did you blink? @DjokerNole explains all. #BlinkAndYouMissIt https://t.co/tEouctqJfH https://t.co/sPdfh061gq @novakfoundation @JelenaRisticNDF Bravo! Check out @head_tennis tomorrow \rat 3pm CET to see my new film.\n#BlinkAndYouMissIt #DjokerIsBack https://t.co/bEtkPybE2x Dear Friends &amp; Family... https://t.co/Ob83np38AS https://t.co/IaWVkfVNwW @LACOSTE @ATPWorldTour 🏆🏆🏆🏆 🏆🙏 #TeamDjokovic #NoleFam #Wimbledon #TakeOnHistory https://t.co/ilpmalLwPq Until tomorrow @wimbledon #Idemooo 🎾👍👍 https://t.co/oKYV0pScUP The Croc moves on 💪🐊 merci @LACOSTE #TeamLacoste #wimbledon https://t.co/kPlGN0dMLE Let’s goooooo thank you @ASICSTennis #Wimbledon #IMoveMe 🙌 https://t.co/h0SsvmTe2c 🙏💪 @head_tennis #wimbledon https://t.co/5igEKFt7mg Grateful 🙏 pumped 💪 idemooo #nolefam #teamdjokovic #wimbledon #takeonhistory @Wimbledon https://t.co/thWkizkZQU 4th anniversary of our marriage today. So much love for my soulmate. Thank you for sharing this wonderful journey of Life with me and our children. And thank you for sharing this trip to the city of London on the tube ❤️🚇 @JelenaRisticNDF https://t.co/XIONmR5iJE 🙋‍♂️🐊 #Wimbledon #TeamLacoste https://t.co/Ua4GWcVnfm Here to stay @Wimbledon #Wimbledon https://t.co/77xZZvyIBP RT @Wimbledon: Roaring into contention.\n\nPure emotion on show from @djokernole at #Wimbledon https://t.co/j7ApNWNhX4 Can’t stop, won’t stop #juicebeast 👊🥦🥝🍐 #wimbledon https://t.co/HHZK90Sk7Q RT @Wimbledon: Nice touch, @DjokerNole 🎾\n\n#Wimbledon https://t.co/xosxyktxL4 😁 #tbt @HoracioZeballos #Wimbledon https://t.co/QLwVTCGQ9z Was a good day in London Town @Wimbledon 🍓🎾 #R2 #Wimbledon #TakeOnHistory https://t.co/Nr4w6zFHxZ @TennisChannel @TennysSandgren 👌 @LACOSTE @ATPWorldTour 🐊🐊🐊👌 RT @LACOSTE: Delivering fresh energy for London’s biggest tennis tournament. This collection is designed to shine, from the court to the st… RT @head_tennis: It’s the start of the tournament for @DjokerNole today. Let’s make sure the equipment is on point 💪. #Wimbledon https://t.… Ready @head_tennis 💪🎾 #Wimbledon https://t.co/6nPPz9pyLm @LaverCup 💪💪 Back to @Wimbledon business 🌱🎾 #wimbledon https://t.co/jVlMSbtgUZ @novakfoundation @JelenaRisticNDF @WebitCongress 👏👏👏 It was a humbling feeling to celebrate 800 with Stephen Farrow and everyone at @QueensTennis. A career milestone I will not take for granted. Thank you guys for celebrating this moment with me #NoleFam 🙏💪\n(Look at this gluten-free masterpiece 😁🍰🍓) https://t.co/qAczTKnvae @QueensTennis, it was a pleasure being back and congratulations to @cilic_marin. A tough loss for me today, but there’s no doubt I’ll play again on this grass. #QueensTennis #NoleFam https://t.co/O7VLsooWJY 800 and counting 🙏 https://t.co/m9XokbYbqd #WorldCup2018 fever got me like... https://t.co/FuUObTbHGe I forgot how much I missed the smell of freshly cut grass… 😉💪 #airborne #fevertreechampionships @QueensTennis https://t.co/TP1gR7ZtIC @QueensTennis @WeAreTennis 💪💪💪 RT @ATPWorldTour: Did you know that the @novakfoundation supports a fellowship @Harvard? 🤔\n\nOne '18-'19 Djokovic Science &amp; Innovation Fello… RT @JelenaRisticNDF: Join my @novakfoundation birthday fundraiser and help us support the professional development of teachers in Serbia! E… https://t.co/k3lZof6sOT @JelenaRisticNDF Back at Queens tournament, first time since 2010. Happy to be here. One of the most beautiful Centre courts in the world #fevertreechampionships https://t.co/ULWUCP9BQr Feels like a good time for grass season, let’s GOOO.. 🎾💪 #fevertreechampionships #queenstennis https://t.co/zZQnfn9MuA Congratulations to Marco on his strong performance. Thank you Paris, thank you @rolandgarros 🙏❤ https://t.co/LAVNSHzjN0 Post match celebration 😆 @daddy_yankee https://t.co/DQpWjMaZR5 R4, see you Sunday 🤙 #RG18 https://t.co/C6VYtJO4FS Running with #RG18 ball boys and girls before the stadium opened today. Very special tradition in my heart 😄🏃‍♀️🏃‍♂️ https://t.co/cz3lldVIKy Celebrating 85th Anniversary of @LACOSTE 🐊 #TeamLacoste #Lacoste85th https://t.co/0RXzHCA6H4 @rolandgarros Let’s gooooo 💪 My real job. On rainy days. Shout out to all the grounds people who are working hard to make sure we have the best possible courts to play on 🙏🙌🎾👍🔝 #RG18 @rolandgarros https://t.co/vOhjmiGMh8 The world on your wrist. #SeikoAstron #SeikoFam @seikowatches https://t.co/hG3Viumk2F Future champion!! Welcome back to your strong and fearless mom, @serenawilliams 💪👏👊 https://t.co/8FgygpwAWE #Rafole or #Nolafa? Haha @RafaelNadal https://t.co/WPYHd5uyjz Serbian fans in Paris. Idemooo 🇷🇸 https://t.co/5Foykbr5nI @rolandgarros I’m always watching 👀♻️ These kids were too good 😂😂😂 #RG18 https://t.co/14dXvZmTaz I have a passion for tennis and I want to pass this on to aspiring athletes all over the world. #IMoveMe @ASICSeurope @ASICSTennis https://t.co/HfVvjPp6g4 The #RolandGarros version of my #GELResolutionNovak is available now - providing ultimate stability on court. @ASICSTennis #ASICSTennis #IMoveMe #RG18 https://t.co/jURcNhHGHW See you there today 👍😁 #RG18 https://t.co/rrAmgDkGqj @usopen @BasiaID 🙏🙌 So grateful for the well wishes - thank you, US Open! @Olympics @BasiaID @OKSrbije Great memories. Thank you, guys! @rolandgarros @BasiaID Merci, RG! There was a lot of gluten-free 🍰🤙 @gugakuerten @BasiaID Thank you, Guga!! @LACOSTE Thank you, @LACOSTE! 🐊🐊🐊 👍👏🎉 @novakfoundation #BelieveinTheirDreams https://t.co/BEaprIfcTv We reached our $31k goal today! 🙌 I want to share my love and appreciation for everyone’s support and trust in the good we do at the @novakfoundation. Tag me in your campaigns so we can continue providing access to #childhood education! Thank you! 🙏 #Care4Kids https://t.co/gTKNgJzNY7 Live on @facebook! Come say hi 👍 The most rewarding part of my day.. #bestfriendswithnature #familytime #paris https://t.co/mgI2Eb48Gw Humble beginnings. #ASICSTennis #IMoveMe @ASICSTennis #RG18 https://t.co/mmrze8xu6q Radujem se što je knjiga od Karol dostupna u mojoj zemlji na srpskom jeziku 👍 https://t.co/YUGx6uYtst #TeamDjokovic practice 🤟 #RG18 @rolandgarros https://t.co/3iOsF0OZHX Beautiful day on Champs-Élysées with my HEAD family. Proud to continue working with Johan. Thanks to their team for the continued support 💪🎾 #RG18 https://t.co/oexSiaZ1Nh My birthday present to myself. Uphill sprints. @rolandgarros see you soon 💪 #RG18 #training #birthday #fun https://t.co/w3eAj5eWJI Today is the big 3-1! This year I’m dedicating my birthday to the @novakfoundation and #earlychildhood education. Head over to my Facebook page to come take part and help raise funds to send 442 children to pre-school 💪🙌👏 #Care4Kids #BelieveinTheirDreams (link in bio) https://t.co/VU7boWQd1q Roma, I‘ll keep coming back every year to this special place. Your energy will carry me to the next challenge. Thank you for your love and support! Ti amo! 🙏🇮🇹 https://t.co/7X2RMTpvrU Plenty of progress and passion to take with me to RG. Thanks everyone for your continued support. See you back on court next week 🙌 #ibi18 https://t.co/MId0tYNpBv This guy! Srdjan Novakovic was my opponent in my first match ever at Belgrade Tennis Club in 1995. So nice to reconnect with him last night in Rome after 20 years 😁 #oldfriends https://t.co/k3SM8g2bfW FORZAAA #semifinals #idemo #grazie #ibi18 @InteBNLdItalia https://t.co/YGw2jT1pzO RT @head_tennis: Grande @DjokerNole 💪 semis, here we come! #ibi18 https://t.co/HcMd9n5Jwr 🏃‍♂️ https://t.co/FjmjFTYYlE RT @LACOSTE: Greatness awaits. \nEvery inch of the court under control to reach his first semi-final of 2018. \n#TeamLacoste #BeautifulTennis… #NoleFam!!!! Incredibili! Grazie a tutti 🙏😆💪#ibi18 @InteBNLdItalia https://t.co/AQLlKPKF69 #KidsDay in Rome was 🔥... https://t.co/0td7NxmJfm ❤️❤️❤️ https://t.co/9fAh7gSCe9 💪💪 Roma, ti amo ❤️ #ibi18 https://t.co/hxurGaUD0h Thank you for the continued love and support #NoleFam. So grateful to play on clay here at @internazionalibnlditalia. R3.. AJDEEE 💪☄️ #ibi18 https://t.co/gKQkAARToo Game face 🇮🇹🏋️‍♂️ #ibi18 @InteBNLdItalia https://t.co/KXbmbnkJoE Back home making new friends 😆👍👍 #NoleFam https://t.co/dbNkhKbSID @ASICSTennis @MutuaMadridOpen @GettySport Let’s go! My friends that make it all happen! Thanks for letting me get a pic 😁✌️@ATPWorldTour @MutuaMadridOpen #MMOPEN https://t.co/y4ZYeCss8f You’re welcome, man! Thanks for the support 🤟 #NoleFam https://t.co/cf5bV7AiMN @fabsantoro72 @TheRealPatCash @ATPWorldTour Haha challenge accepted bro! @MilosTeodosic4 #Teo4 stižem. Da ponesem reket? 😂 za one palačinke zbog kojih smo svi počeli da se bavimo sportom! 😃👌 .@MilosTeodosic4, @LeaderOfHorde, @JokicNikola15 what do you guys think? #TeamDjokovic is ready for some street basketball 🏀 (European maybe) 😃 not even... 🤔 https://t.co/ez76qlUTZ5 💪💪 #MMOPEN https://t.co/ycIYASmyJU Seguro es el más especial. Gracias, Manolo 🙏 https://t.co/MiP7kr4Q0F Good to be here, @MutuaMadridOpen. Let’s play some tennis 🤙🎾 #MMOPEN https://t.co/qfxMqSkliq Sometimes you gotta use your feet 🤷‍♂️💃⚽️ #MMOPEN https://t.co/BvNfKO4tft Come on @andy_murray. We can’t let them speak about our matches as “a long time ago” 😂🤣🎥 May the Force be with you in recovery, my friend! #StarWarsDay https://t.co/eDjcKsTl5K A little time at home before Madrid 😁 #familyreunion https://t.co/s7QKY5I2kg Uphill biking 🚵‍♂️... https://t.co/abWLzUF4O0 Taking these down the line 🔝➖✅☄️ https://t.co/CRPrQ5I37z Stretch partner (yesterday) @MihailoTopic 👍 https://t.co/IIbZMqWDgb Today's training challenge with Marko was... https://t.co/wvvmWgS2u2 April u Beogradu. Lep uvek a najlepši na proleće. Zahvalan sam što provodim kvalitetno vreme sa braćom. / Spring makes this beautiful city of #Belgrade look stunning. Grateful to spend quality time with my bros #family #brothers #serbia https://t.co/mofxSubOEL Happy 5th anniversary #NoleFam 🙌❤️ Thank you for the unwavering support year round.. sending lots of love and well wishes to everyone. See you on court! 👊 #NoleFamDay @novakfanclub #NoleFamCam #bcnopenbs https://t.co/OpgSf4eR92 #EarthDay reminds me that some of my most favorite memories are... https://t.co/ZW30lNzGC5 Today’s practice squad 👌☄️ #montecarlocountryclub #atp #bcnopenbs https://t.co/0JQEbsPycM 🙋‍♂️🎾💪 It’s been a while Barcelona... see you soon! #bcnopenbs https://t.co/ha1enL8oiX Keeping the energy high and my mind in the game 💪🎾 We can do this #TeamDjokovic https://t.co/PwImacl5pc Feeling good 🙏💪 Thank you for the love #NoleFam https://t.co/BKdOt1Nxsn Great day yesterday at the #PrinceAlbertFoundation charity exhibition 👍🎾😎 Tomorrow it’s our turn to play #NoleFam. IDEMO https://t.co/E83BRMGe8w I wanted to share something simple I always try to remember. No matter how good you are at something, there is always more to learn, more to improve, more to explore... so keep your head in the game. I know I gotta keep mine. Monaco bound! #idemo #letsgo https://t.co/BboyW8BwOa Tough business today 😂🏋‍♂ #whenthegoinggetstough #trainhard #mondaymotivation #ithappens https://t.co/QbFagaDaQg Hristos Vaskrse, srećan Uskrs svima koji ga slave! Želim vam radost i toplinu familijarne atmosfere. Kada je cela porodica na okupu, ostane samo jedno jaje- neka bude čuvarkuća😃 Today, Orthodox Christians celebrate Easter. Wishing you all blessings of health, love &amp; prosperity! https://t.co/QGvCVWZ8BO Back on clay! Let’s get dirty! 😂😜 https://t.co/nybinxIDzJ Happy International Day of Sport, guys! 💪🤸‍♀️🎾 Don’t you think sport has the incredible power to change our 🌎? I’m so lucky to play every day and we want all children to experience the same magic. Get out there, make friends, and play hard! @novakfoundation #IDSDP2018 https://t.co/FELHFp1wSM https://t.co/Yxgw4Xky8m Happy Easter weekend everybody! Hope you are enjoying with your loved ones ❤ https://t.co/T4koq20xmm Happy to meet nice guys and great football players from Croatian National team. Srećno momci @HNS_CFF https://t.co/vXp7JQIwbg Great seeing you today, my friend @FerVerdasco 🤙🏼 @MiamiOpen https://t.co/z1lYlg9C8S The world should have more places like @MiChiMu. I took Stefan with me today and had a wonderful chance to read Pete the Cat to these kids. Children are our everything 📚 #NoleStoryTime https://t.co/sZfRXCGQ2y Miami! Good to be back 🎾👌 https://t.co/Bfz0cGpAy6 IDEMOOOOOO #BNPP018 #TeamDjokovic 👏 https://t.co/KfT2S1ez2Z Who else is ON FIRE this weekend? @D_Copperfield I know your trick and I have more up my sleeve. Coming to steal your show in Las Vegas. Be ready. 🔥 #noleonfire https://t.co/NX3Ckhw78g Your guy is BACK (and more flexible than ever). Tomorrow. Let’s get it 👊🎾 #NoleFam #TennisParadise #FullBloom https://t.co/wVDWueoZUH Celebrating all of the wonderful women in my life today. Admiring their strength, persistance, passion, love, kindness, generosity... and everything started for me with this one. My mom! Happy #InternationalWomensDay to the many, many amazing women out there!! https://t.co/fqIgB9u2IC What a humbling place to visit and recharge before practice ⛰☀️👌 #grandcanyon #indianwells https://t.co/RJtP1VQ7k4 Back in the office with @filipkrajinovic #TeamLacoste 🤙🐊🎾 https://t.co/MS9mKYfH3t Always nice talking to you @carole_bouchard. Glad I can make you laugh too 😂🎾 #djokeralways #livelaughlove https://t.co/8AtiGUKM71 Here you can support Carol’s work and read exclusive interview we did while I was stretching on the airport 🤣🤸‍♂🥁✈️ https://t.co/aUl6eLIATB Feels good to be outdoors in the sun and hitting the ball again. Day by day... #nevergiveup ☀️ https://t.co/ccIqyKTm8v Vivaaaa Las Vegas, baby. Idemo🕺 https://t.co/QrGsHdHwTN Making the most of every situation and space 😂✈️🚌 #stretching #travel https://t.co/cGVYdwGYXH Great to have a day on court with you guys! https://t.co/Fk65YNOl02 WOW, snowed all day in #monaco yesterday ❄️😛#anythingispossible https://t.co/YgO7imT7I9 😂 @pierre_vaultier let’s make it happen. See you at RG! And congratulations on your Olympic medal(s)! https://t.co/m7HSoda6Vu That was an incredible performance #Chung! Keep up great work. You’ve got this! 👏 #AusOpen https://t.co/GjCwmnhXOd At the end of the day, these are the moments that mean the most #DreamBig #AusOpen @Eurosport https://t.co/6QLy8uLdOi And here’s my favorite part of my training session #DreamBig https://t.co/PMBt6I8zm9 Another hot day ☀️😵💦♨️. Good luck to everyone playing today! https://t.co/kxtlrPv5kF It's like he wrote... a hot day at the office. 😵 https://t.co/DH2S1wdq7h RT @ASICSTennis: Back with a bang! Novak Djokovic is up and running at the #AusOpen and looking sharp! Nice new shoes too 😉 #IMoveMe #AusOp… Back after six months, it feels so great. And no better place to be than here in Australia 😁 #AusOpen (Photo credit: Ron Angle) https://t.co/a67fAdVW2S Very happy to be back on the blue court and with the full support of a great coaching team. https://t.co/Vxio50sdAY Really looking forward to #TieBreakTens Melbourne Jan 10. Excited to try out this new fast paced format. It’s a great line up and I can’t wait to get out on court! Are you ready? @RafaelNadal @stanwawrinka @tomasberdych @ThiemDomi.. 😉 #EveryPointCounts https://t.co/ZSc3bUkICA RT @tiebreaktens: Just 4 days to go! We've got a few remaining tickets left. Don't miss out on the first #TBTens Melbourne. With players li… Finally back in the land down under. I feel ready! Idemo!! #AusOpen https://t.co/HFvpn3U5I1 An update here from my team: https://t.co/VJKakhY3bq Unfortunately the situation with the elbow has not changed for better since yesterday. I still feel the pain. Therefore, I will have to withdraw from ATP tournament in Doha https://t.co/iD0bOR5xkT I am terribly disappointed that I am forced to withdraw from the Mubadala World Tennis Classic. Thank you all for your support 🙏 https://t.co/2ZhtrADXzl Merry Christmas 🤶 ❤️ 🎉😗 https://t.co/jUoPe7USS6 Great practice today with Thomas Fabbiano 👍👊😁 Idemoooo #NoleFam https://t.co/SsJcWKUHM9 Congratulations on your jersey retirement @kobebryant. One of my favorites. #Ko8e24 🏀 https://t.co/pxPp29GFlq A #czech sandwich 🥪 style practice with @tomasberdych and @stepec78.. 😂 https://t.co/5wktDFoXOm Can you beat the machine 🤖? We killed it playing this game meant for enhancing eye-hand coordination. #Zverev https://t.co/VhlQivXhkJ Lots to be done, but we embrace it with lots of excitement 💪👌. Practice today with @andreagassi and @stepec78 https://t.co/skcyuZKXxT We have a new official member of the #TeamDjokovic guys. #NoleFam please welcome Radek Stepanek to our team 👏 https://t.co/jQR46FQyvV Who wants to Instagram live 🤨? Join me there in 30 min everyone ☺️ Our children.\nOur future.\nThis #WorldChildrensDay, my @novakfoundation and I are joining @UNICEF to make children’s voices heard across the 🌎 → https://t.co/DhQFOUrvkh https://t.co/tEvJBPAlSW For us, kids mean HOPE, a promise for a better tomorrow! We celebrate our children not just today, but #everyday #WorldChildrensDay #Care4Kids https://t.co/hBRylbD0xk Almost hit @jkcorden’s head! 😬 Here’s me  doing 🎾 target practice on the #latelateshow https://t.co/vAPKeJNDK7 On the @latelateshow with @jkcorden tonight! Turn on your tv 📺 for some funny moments with these guys. 😆 #latelateshow https://t.co/k51CA6BqXU RT @ScottiePippen: Ran into a tennis GOAT and a favorite of mine at lunch yesterday @DjokerNole https://t.co/voiAHPFjL2 Stopped by to say hello to the amazing @RolexPMasters crew! 👏🏼😁 Great to see u guys!! https://t.co/2yAjqF1lYL China 🇨🇳, forever one of my fave places to play. See this video from @TennisTV: https://t.co/QHPHNJdic4 Girafficus, good job for coming in the jeans to the gym 👌😂👏👍 https://t.co/3mhQsI88Iw The people of the Caribbean need our help - watch this emotional #helphopehurricanes video and support the cause 🙏 https://t.co/afSYQArqS4 Wow, we have come far on our #MeetNoleFam tour! 🌎👏❤️ Now for the final interview, we return to China 🇨🇳: https://t.co/q4tAoiaoV4 Taking a break in Paris to check out the #LacosteSS18 🐊🐊🐊 runway collection! https://t.co/7UOifKJTTW I wish I was with these amazing kids on #FriendshipGames2017 right now! They're having so much fun! :) Great work, NDF team #proud https://t.co/qgMh3Bicsc A living legend, an inspiration and a #sport father to us all, Dušan Duda Ivković! Hvala Ti! #ThankYouDuda 👏🏆 https://t.co/S95kiAYsYh Idemoooo momci!! Forza fratelli di Serbia e d' Italia #TimSrbija🇷🇸 #EuroBasket2017 https://t.co/60vGyDbXAM I love this baby crocodelle!! Thank you @LACOSTE for supporting me and celebrating this new life with us! 🤗🐊👨‍👩‍👧‍👦🎊 https://t.co/EVGQ6ULUtJ @UNICEF Thank you! We all should be their champions and role models, believing in their beautiful dreams 🤗 @head_tennis Thank you #HEADfamily 🙏🎉 @usopen @JelenaRisticNDF Thank you #USOpen She is lovely ❤️🙏 Thank you for all your messages &amp; love for Tara 🙏  We love you all ❤️👨‍👩‍👧‍👦😍 #NoleFam https://t.co/MGgdUy2vUk Idemoooooo 🙏👏🏻 #EuroBasket2017 https://t.co/JXE1ydYbLA Thanks for being an inspiration and make me who I am today. Even in more difficult times, I reflect &amp; realize how lucky I am 👏🏻 @jacobscreek https://t.co/N139chpCyK It is my favorite part of the month again! Time to #MeetNoleFam and learn more about @NoleSwedenFan ❤ https://t.co/DX0Lm44WOS I know you can! Just put a smile on your face 😁⛳️👐 #NovakChallenge https://t.co/7WZdvI8aVj Love is such a powerful force and emotion. Having Jelena in my life, &amp; her love, has made me a better man ❤️ So, who makes you? @JacobsCreek https://t.co/I9wd4KsA2k I am so excited!! My new website &amp; mobile apps are live!  😁 👏 Hope you'll like it #NoleFam 🙏 https://t.co/mKz48IxRLM Love that I feel for my brother is unconditional! I will always feel inseparable to him 🙏🏻 ❤️ Who makes you my #NoleFam? @JacobsCreekAU https://t.co/TUCVyfE6Mg It's that time of the month again! Time to #MeetNoleFam 🙏🏼❤ Follow the link to meet Priyanka from @NovakIndiaFans https://t.co/vBBKYXlcrd @Wimbledon Thank you 🙏 Thank you. I'll be back soon! 🎾 https://t.co/KU99n9g08E @AustralianOpen Thank you and see you soon! @rolandgarros Merci beaucoup mes amis! @usopen Thank you &lt;3 Crocodile never gives up 🐊 Thank you #grateful https://t.co/qL6yTr8gVz I took time to make a decision about my recovery. Sorry for keeping you in the dark these days. Read more here https://t.co/tCSw46TOL2 Thank you all for patiently waiting for the news about my recovery. Join me on FB live at around 14:15 CEST to hear more about it #NoleFam I feel for u and wish u fast recovery @BMATTEK So sorry that you are going through so much pain. Glad to see many people sending u love ❤ Happy to meet my friend @PKSubban1 and have him watch my match at Wimbledon 😃👌 https://t.co/3ZZESdKbfk Sometimes seeing is more effective... #gameanalysis #gettingready #wimbledon https://t.co/mOoaTtxKPx The time has come to #MeetNoleFam👏🏼 Join me on my virtual trip to 🇨🇳 and meet Alex Zeng who manages Fan Club China https://t.co/rQDHPhajuO The first practice had to wait today due to rain ☔️. But you know what they say... No rain, no gain. Or was it something else? 😂 https://t.co/W9cXwpUqv2 See you in a few days Eastbourne! https://t.co/EZ92rGRyR7 Great #DayAtWork guys! Had a lot of fun and amazing practice today! How was your day #nolefam? 😤😁💪🏼 https://t.co/M0cz9oDcrr My Belgrade from the sky. Warms my heart and soul each time. https://t.co/BFpWBGAWJr Wow sounds amazing! Thank you #NoleFam I'd love to see your #NoleRG17 videos 👌🏼😃🎬 https://t.co/Ybd9v38HwM I'm so excited! 🙌The 2nd #MeetNoleFam interview is live. Thank you my #NoleFam from the Balkans. 💪🤛 You are amazing! https://t.co/6I53FL20Wa 2 vs 1 and I and I am still standing tall. Anyone want's to try? 💪😜 https://t.co/pYz1mGFqYK New gear, new coach, new start. How exciting! #NoleFam please welcome our new member @AndreAgassi 👏🙌👍 https://t.co/aE53GeEw98 Had so much fun with the @LACOSTE team. 🐊😀And you know me... I like to keep up the good spirit.🙌 #NewCroc2017 https://t.co/qOB6H45ai0 @UNICEF Thank you!! 🙏❤️ Yes, madam, already! 😊🤗 Thank you so much! https://t.co/nD0xz7qzyV Thank you!!! 🎉🎊 https://t.co/Z3m2hQ7kyM Thank you! https://t.co/1H3dMbRajU Wow! This is amazing 🤗 Thank you for this, I am speechless 🙏 #NoleFam https://t.co/RXOGwBZADm 🙏 Thank you #NoleFam https://t.co/kBwDAw8y9a @Oliviahsiao0418 @JelenaRisticNDF @NovakFanClub Hehe love you back &lt;3 Thank you! Proud to be part of this revolutionary @LACOSTE story, that still lasts till this day. I'm proud to be the new Crocodile. 🐊 #NewCroc2017 https://t.co/3MH3v15hGx #tb to @rolandgarros 2016. What a journey! I will never forget it. Thx for these series of videos🙏Tune in 🔛 https://t.co/vQQr3GVrvZ for more https://t.co/XGpINCEhmT Look who stopped by to join me and the boys for a training session in Roma! @OfficialGoran 🎾 https://t.co/zypFNRJOoo Not an easy decision @keinishikori but health is priority. Wishing you fast recovery and hope to see you in Rome! Always good practice with Stan the man @stanwawrinka! 👏🏼💪🏻 Who looks more tired? 😂 https://t.co/8hq0eBshB0 It's great to be back! Hello Madrid 😃 #FirstPractice at @MutuaMadridOpen https://t.co/7wI1D3AYPQ I have news that I'd like to share with you. https://t.co/ffMD5LZi5V I'm so proud of the @novakfoundation's partnership with @HarvardCenter! Let's wish the 4 #DjokovicFellows all the luck in their research! https://t.co/pWjP0bFOCN Working hard on international  workers' day 😂👌🏼 https://t.co/5a4mG0Hvmr We had so much fun on that day with @head_tennis! Hope you enjoy this “behind the scenes“ video #nolefam as much as I did 🎥😂. #PlayersOnly https://t.co/JUlRrkeYdF The 1st #MeetNoleFam interview is live! I'm sooo excited to unite @NovakFanClub for the 1st time in a photo 😃👌\nhttps://t.co/v7qKEZZPmO https://t.co/FMqk2qH9zG THANK YOU my #NoleFam! I want to share with the whole world how amazing you are!! #MeetNoleFam #NoleFamDay &lt;3 https://t.co/5VeLTHuyLV @KK_Ainrye Thank you 🙏🏻 Best way to warm up for work 😂🚲 https://t.co/JkCDXStH1y Wanted some @EqvitaRes refreshments and got a triple surprise! 💚Join @novakfoundation 's #Sportin1Word campaign! https://t.co/j18VDXVbrH https://t.co/6ZrhzjjpTD We all have our habbits &amp; funny rituals, don't we? 😂 Today my #PlayersRoom ritual is revealed #NoleFam!!! Alive &amp; kicking 👉🏻🕺🏼🎶🎵👏🏼 https://t.co/AD9fXzmtPL Always a pleasure, Stan the man! 🤗🤜🏼🤛🏼🎉😃 https://t.co/LLzV4TZjI0 Playing Tennis for a good cause? I love it! We had a great time today at @MCROLEXMASTERS 👏 https://t.co/OCAWgHOrly Working that clay with @cilic_marin 💪. Feels great! https://t.co/zKQPpHgRgS Ready to fly over to Monaco for a game or two? But you cannot use your claws on the court.. or can you? 🤔😆 https://t.co/lbXKuXwZVr One of my favorite #NoleFam videos! So powerful &amp; so inspiring 🤗👌🏼💪🏼 Thank you for capturing all those fantastic moments @tanis95 ❤ https://t.co/ceEKDhHYkV Sjajno vikend štivo! Bravo #ORGNLmagazine! Bravo Originalci 👏🏼📰❤️ https://t.co/kxivq6tKG6 Pleasure, determination, community, self belief, passion, trust.. OMG guys you are amazing!! Keep sending your #Sportin1Word! Love it 😍👏🏼 Idemoooooo #TeamSerbia #TimSrbija🇷🇸 👏🏼👏🏼👏🏼 https://t.co/7BCohKE6mD Today's practice.. #TeamSerbia🇷🇸 Idemooooooo https://t.co/g2sb8LyIbB So exited about this @NovakFoundation campaign. Share w/ us your #Sportin1Word. Watch the video &amp; lets have some fun #NoleFam https://t.co/y5Pes5S3Ct April 1st and my 1st training on clay... Going strong 💪. Belgrade here I come 👏👍 https://t.co/pBsM8fJZFN I see you miss me #NoleFam Is that why we are on a quest of finding #DjokoTwin?! 😀 This guy looks great, haha https://t.co/ImgmxTKkAK I apologize to my fans and ppl who purchased tickets to watch me play live at @MiamiOpen. Sadly, I'm injured and won't be able to compete. Always a pleasure seeing you @NikolaVucevic. Thx for stopping by! https://t.co/18CBUTvUGG Tennis in every form - I love it, especially if I can play with my fans. 🎾🏓 Stay tuned to see how I did. 😜 https://t.co/SiA8IrGTrO Proud of you guys! 💪 #LasloĐere @nikolam1995 #MarkoTepavac @krstin_pedja @filipkrajinovic #MiljanZekic https://t.co/XLilF1H9hM Hello from #IndianWells 👋🏻Great practice today w/ @David__Goffin How was your day #NoleFam? https://t.co/x4grGIAOya Group selfie with my #NoleFamMexico who were waiting for me after the match ❤ Thank you for your support, it means a lot to me. https://t.co/IEyNMJQu1W Ready? Let's do this #NoleFam #acapulco #mexico 🇲🇽 #teamdjokovic https://t.co/6BibUSKJf9 What a welcome! 🤗🙏😃 Thank you my #NoleFam 🇲🇽 https://t.co/SGR4I1o8yV Great news! You'll see me back on court next week in Acapulco at @AbiertoTelcel Did you miss me? 😜 https://t.co/3zBXTrDtnt Exciting day for Children in Serbia! We're one step closer to ensuring quality #ECE for all of them... and beyond 🙏 #Care4Kids https://t.co/Z6VARkdxtr Me vs Marian, GG and bag of balls #rockNroll #intervals 😂👍🏼 https://t.co/Sz0J3NnUpk I'm really proud of you! And I saw that kids and parents share the same opinion 👍👏 https://t.co/h84PABuIFI Nice one! #AusOpen in my favorite color #LoveGreen 🍀😄 https://t.co/mX6j9FlkjE Thank you for your support #NoleFam 💪 https://t.co/0s1SRSPAAl Do I really look like that? 😅 https://t.co/PqRZ6MWROw Who remembers this nod to the French Open in 2014? Let's hope the rain holds up at #AusOpen 😬☂#keepmoving @ANZ_AU https://t.co/xb346iF8Q4 We only have this moment, so we better make it worth! Ready for #AusOpen? I know I am 💪 #KeepMoving  @ANZ_AU https://t.co/YtVFhi5XEc First practice on the Rod Laver Arena this year... feels good to be home! 👏🎾 https://t.co/76tuBBJ6is It looks much easier when champ @DylanAlcott does it! :) Thank you, mate! #nightwithnovak https://t.co/IASfyXjSnX A HUGE thank you for the amazing energy tonight from me and the whole @novakfoundation team! &lt;3 https://t.co/7rYnVQNKRe Vielen Dank! 👏🏼🤗 https://t.co/DDIwiKHUB7 Thanks guys! It was great meeting you today 👏🏼 @FCBayern https://t.co/oqzuqjTPs6 Had a great warm up with @andy_murray today 💪🏻 https://t.co/hM2sV06iSR Hehe nice shot. Gracias amigo! 🤗👏 https://t.co/WGppLMs1M3 The best way to start a year 😁🎾👌🏼#Happy2017 #Nolefam https://t.co/CQxuo8k7n1 AO we see you! #AO17 #AusOpen @milosraonic https://t.co/upBbbBTjOx Great practice yesterday at @MouratoglouAcad #hardwork https://t.co/K7CrC4va7L Thanks for keeping me on time all these years @seikowatches ☺️👏🏼 I look forward to another 4 trips around the Sun with you guys! #honoured https://t.co/IeNGWOKP8Q One photo from my office. How was your #dayatwork? https://t.co/q9bzakTrOn Thank you @HarvardCenter for partnering with us 👏🏼#proud #care4kid https://t.co/Bh8xuAqIlE Help keep children safe ❤️🙏❤️ https://t.co/C7PgCOVPrN Thanks for the warm welcome @ATPWorldTour  🤗 https://t.co/nch3k9T7hI #workinprogress #rockNroll 🎾🤘 https://t.co/bs3g6BHEJV Eyeopening &amp; so powerful documentary by @LeoDiCaprio #BeforeTheFlood Thank u Leo! We do need to wake up! 🌍🙏🏼 https://t.co/XgvoAfkUTe Thank you #NoleFam for your support! You are amazing!!!! See u in London 👏🏼😁💚 Congratulations @andy_murray Well deserved! I am really happy to be in the same era with you 👍🏼 It's great to be back 👍🏼#BNPPM #LoveParis w/ @nenadzim https://t.co/1yyBl5SkvR After good workout, we bring some smiles for recovery 😁 https://t.co/mqtprCTh68 This is such a great initiative! Can't wait to put together my first computer! https://t.co/8GoWb7Eqy5 Stefan's 2nd birthday! Balloons and face paint :)) https://t.co/r8WWtSoTWK I had a great time having a hit with Aston and Caillie from @ANZ_AU Tennis Hot Shots! https://t.co/9HCzwZNu78 Love to be here! Thank you #nolefam #Shanghai 🇨🇳💚👏🏼 https://t.co/B1yxGQyvPH Nature, sport, the Sun and friendship for a lifetime 👉🏻 #FriendshipGames #Drugarijada 😀👍🏼 https://t.co/SIzxhRixK5 Ponosan! Hvala svim ucesnicima na inspiraciji! https://t.co/WGKcJu8TyG Warming up with GG in my club in Begrade. Feels good to be here! https://t.co/nOXtjfMKLl Can't wait to play with my shiny new Head Speed racquet during Djokovic and Friends event tomorrow @head_tennis 👌🏼🎾 #excited #care4kids https://t.co/A0Dn3nUj8j Not too bad for a 22m old, ha?😂 Tennis on TV, massage... Life is good! Love this little man so much! https://t.co/RFmOZ5wlxv RT @DriveToTennis: Follow @DriveToTennis and RT this tweet to win @DjokerNole’s tennis racket! #DriveToTennis https://t.co/8Ew28rkzqS RT @UniqloUSA: Help inspire the kids of @NYJTL! Cheer @DjokerNole on using #BringTheLove &amp; we'll donate $1! https://t.co/ZsIYREBTey https:/… Happy to announce I'll be back at @AAKidsDay this year, with @AnselElgort &amp; more!\nTickets: https://t.co/CYUhFpszsa https://t.co/xqA79PFrfN Nice to have time to catch up with friends and enjoy the concert of a great performer and artist @enriqueiglesias 😄🎤 https://t.co/lpNH1WvaCP Amazing athletes, energy and pride we all share with each other promoting the best of the game = @Olympics ❤️💪 https://t.co/PqH1ReNMVA Hanging out with @Vin Diesel double in Toronto Gym 😂 #SlavenHrvoj https://t.co/PbHFmI0ffB Always an honour and a lot of fun seeing you sir @richardbranson 👍🏼 https://t.co/zxnVyBIXK2 Meet ball hockey #teamDjokovic 🏒😃 We had so much fun at #RogersCup yesterday! https://t.co/kNiynktQXu Sleepy me forgot that security doesn't let us pass through w/ food, so I camped and ate right there! #5amwakeup https://t.co/SseB12nXpW It only takes two 4 tennis so when I need a hitting partner, bro, best man, boy or a girl watching could join me 😜 🎾 https://t.co/KYjT2iLbxK @serenawilliams loves being 22. So young and successful :D Well done Rena! Excellent cooked variation of my favorite raw dish made by @JacobsCreek at 'Our table' dinner https://t.co/IQO2VNRrte #JacobsCreek Let's bring together love, luck &amp; (com)passion 4kids! #Bid4kids to get my @rolandgarros kit &amp; help @novakfoundation! https://t.co/28MEpE8u10 Me and #NoleFam have a role to play in launching #Wimbledon emoji. We are passionate, let's show some emoji-ons :) https://t.co/um3J7ii38B If you thought babies make the most dirty laundry... In our house, I'm the record holder! https://t.co/gThanhKUvA I'm officially a Londoner. Best way to avoid the traffic :) https://t.co/3aVtYDKvO7 Dream big &amp; always believe in your dream @bagirica . Pleasure to meet you 🤗 https://t.co/TH3ZIqCrDV Would you like to join me and open  @EqvitaRes live with me?! Stay tuned, I'll be live on Facebook in a few minutes 😀 💚 🎬 #Eqvita Join me in a few minutes on my Facebook page 😍 I want to share my happiness with all of you- live! 🎉🎉 RT @DriveToTennis: Want to win @DjokerNole’s signed outfit? It’s easy: follow @DriveToTennis and RT this tweet! #DriveToTennis https://t.co… This is what I call a perfect morning warm-up at #RG16 ☺️🎾https://t.co/Go2wJpCxGQ https://t.co/MR58BmyrpX Portuguese sounds much easier when amigo @gugakuerten speaks it 🇧🇷🤓🇷🇸#RoadToRG #RG16 @RoadtoRG #Peugeot https://t.co/VcuP2pE3EH … Thank you @TanjaNole @ArryciaRee #Faiyaz @morann01 Love you all so much! ❤ #nolefam Thank you @NovakDjokerFans @AisyahRwahab @ela981 @DjokerNoleIndia @NovakSupport @SanjaSkipy … ❤ #NoleFam  https://t.co/R8061khBhU My little Micaela, I am your biggest fan! Thank you, I love it! 😘 #NoleFam  https://t.co/CeZL7C0KU2 Thank you #NoleFam You are amazing! Roller coaster Nole is my fav 🎢 😅 Idemooooo https://t.co/degCvinu4j Hahahahah sharp &amp; determine 😜👌🏼#GugaHairStyle! Thanks 😃 https://t.co/mvwtUqNCf7 @rolandgarros Merci beaucoup 😉 @AustralianOpen Hehehe it sounds much better when I sing it with you guys 😄🎶🎵 Thank you all! @UNIQLO_France @rolandgarros Sweet of you 😋 Thanks a lot! #BringTheLove @LaureusSport Thank you 👏🏻 @usopen Thank you 👍🏻 @DavisCup Thank you! Thank you 👏🏻 https://t.co/h8iuTijn1q Find your favorite \"instrument\" and play it with lots of love 💚 😃#dayatwork #RG16 https://t.co/nO0NKkywbO Have you ever tried violin lessons? Because I did 👍🏼😀 Check out how it ended #DriveToTennis @Peugeot https://t.co/pcePSdi5kz I wish I could have spent a whole day with my amazing fans! This was fantastic 😃 Thank you! https://t.co/cWlXTuzuwU .@andy_murray really grateful and honoured to have witnessed your sportsmanship tonight. Tennis is lucky to have you as ambassador.Thank you Thank you #NoleFam! I heard you loud &amp; clear :D Next stop &gt;&gt; Roma! Idemooooooo #MMOPEN https://t.co/1DILlmpxx5 Look who returned a visit and came to support me today! 😃 Thanks man! @ToniKroos https://t.co/B9XdBCFWmI Got a chance to watch  @ChampionsLeague semis last night and met @Ronaldo = a perfect day for a football fan ⚽🎉💪 https://t.co/TZ1LtK9qNq I got a chance to spend some time w/ #MMOPEN ball boys &amp; girls! Thanks for sharing your amazing energy with me 👍🏼🤗 https://t.co/svmddsBD57 Hello from Madrid! 🖐🎾 #MMOPEN https://t.co/gXVNLsrCJE I'm Guga! No, I'm Guga! Hehe amazing day at work w/ @gugakuerten Thanks @Peugeot ! 😎👍🏼 https://t.co/MGwzXXC4jW We need nature. Think, love, care, celebrate. #EarthDay every day. https://t.co/lJWZxtBPLU @Kaca_Nole sa zadovoljstvom Katarina! RT @ananolelove: Happy #NoleFamDay😍. I'm proud because I'm part of #NoleFamily😘  \nLove you @DjokerNole , thank you for everything 👑🎀💙 https… Hvala Milice!  https://t.co/J19m6qWh1X Wow! It's amazing! Thank you Arrycia &lt;3 https://t.co/txgniy34lo RT @NovakFanClub: Happy #NolefamDay from Elli. We love her posters ❤️ https://t.co/isnrJDb530 Happy #Bday #NoleFam I'm so lucky to have you! 🤗😛 #NoleFamDay https://t.co/JEPJAiwM05 It was our great pleasure to visit your incredible museum. Thank you for your hospitality!See you again w/ our boy! https://t.co/969gu67a9t What a wonderful, emotional night! So grateful and honoured. Thank you @laureussport  https://t.co/CHeVDlNBIW @JelenaRisticNDF ❤️ Excited! So many great athletes will be at the @LaureusSport awards ceremony. Always wearing #SneakersforGood https://t.co/CHUFr1VH8F Really excited to visit Berlin for this year’s @LaureusSport Awards! #LWSA16 https://t.co/gYXbO3CeAM You know that we have important #Bday in less than 10 days #Nolefam?! On 25th I think 🤔☺ 20 years at the top. Incredible to witness you in action. Good luck @kobebryant 💪🏼👍🏼 https://t.co/zeJVqYlld0 RT @EqvitaRes: Hello world. This is our first eqvitastic tweet:\n\nEat your breakfast!\nFollow your dreams.\nThan, follow us.\n#Eqvita https://t… RT @EqvitaRes: Always happy to host friends! @tomasberdych welcome to our piece of nature. 💚Eat good, stay good! cc @DjokerNole https://t.c… RT @EqvitaRes: Lots of love, lots of positive energy @ #Eqvita party tonight! Welcome @andy_murray @tomasberdych @GrigorDimitrov :) https:/… First @EqvitaRes selfie! Party time &amp; presentation of our #Eqvita restaurant. Fresh, healthy &amp; with lots of &lt;3 https://t.co/LEpNGRoCSR Passion, love, fair play and respect #sport #IDSDP2016 :) https://t.co/1BiNV5yWyZ I wish we could all fit in a photo. #TeamDjokovic is pretty big! #grateful https://t.co/1H2imY71db @djokovic4ever Thank you for your support :) @NoleFamUSA Having you by my side makes it all more special #NoleFam Check out who I was talking to https://t.co/gaiGSeHr9j #NoleFam knows ;) https://t.co/dqABeFcJml @dusanVemic Hvala Machak! Idemoooo Hard work pays off! Thanks for having my back! https://t.co/3FBCdar4Yp Miami heat and I do get along quite well :) Thanks!  https://t.co/5V3izmI1zq Thank you guys! We were both \"dressed to impress\" :) https://t.co/r0hnFxTULc @MiamiOpen I did leave, but I'll be back :) I like it with you guys! Thank you #MiamiOpen, thank you #NoleFam! https://t.co/RjSyZJ0Vu2 Took the opportunity to go to the beach yesterday with @dusanVemic https://t.co/RCT4uy28zX We need to work together to support their dreams! @novakfoundation #Care4Kids https://t.co/MwfpBRZa4V I must reconsider my proposal after I saw how easily you smashed my face :) https://t.co/5q9bhtlNQf Always an honour. Love that we share the opinion of using the sport as platform for good https://t.co/dps1ysX8hB Better game for all! https://t.co/cyzK45HhJ8 Every one of us should be their Champion #Care4Kids Very thankful to HRH The Duchess of Cornwall for her visit!  https://t.co/4nX3V3urwY Enjoyed my first practice in Indian Wells #BNPPO16 https://t.co/QUKESKdGMm Great things can happen when superb technology meets human needs 👍 https://t.co/CMq2D5DmCl Lots of love to all my 5M followers ❤️ let's use our voice to do good for this world! 👏💪 Thank you #NoleFam https://t.co/Rpr20aFT7n It was an honour. #GoLakers #NoleFam #RockTheRed  https://t.co/2iUQbRqd7i It was a great game! Thanks for having me! 👍 #GoLakers  https://t.co/UtTBZzjrkA #equalfuture for boys and girls! Because this world equally belongs to us!  https://t.co/owzq44azWe #HappyFans and #Happy me 😂 https://t.co/ZTZCmcu9CI What a wonderful journey! I'm enjoying every moment and every milestone #Nole700 #LoveMyJob https://t.co/oK9QcHFJCH RT @DDFTennis: \"When you're no 1 you need to work twice as hard &amp; dedicate yourself to the lifestyle.That's what I do\" @DjokerNole https://… I know you missed me on court :) Get ready for more action..   #DDFtennis https://t.co/n3rfbGH57A Love is a powerful source of energy, motivation and inspiration. Love yourself, your family&amp;friends, love your life! https://t.co/RY5zz5ehMX That feeling of coming back to your country.... #proud #excited #Serbia #BelgradeAirport #NikolaTesla https://t.co/f6PUWcqeEV If you ask me this is a perfect way to celebrate victory with @MelbCityMission :) #photomemory #care4kids https://t.co/By18v6FcT9 Thanks #nolefam for being part of #HeadbandForGood. You helped to raise $100,000 #charity https://t.co/lNcvY5oDlo https://t.co/9JJO1k8lcI Starting the countdown... 2 more days #homesweethome #mywholeworld https://t.co/v7EPI9sOAs @djokovicAUS No problem, you brought me luck mate :) See you next year! They had my back for the past 2 weeks. We are in this together win or lose ;) #grateful #jointheparty  https://t.co/y03zSoa8A4 ...and I'm grateful for all your love and support! #NoleFam  https://t.co/mzHYpOGpjl We did it!! Thank you!!! https://t.co/SSsWnkO2uJ A moment to cherish. Really lucky to have you @BorisBecker as #TeamDjokovic and #NoleFam  https://t.co/h1OI0QVHfA We, young generations are standing on shoulders of giants (you). Thank you for your kind words of praise.  https://t.co/ZLFNFCgdhS Thank you! Hope we will have many people join us in wearing #Headbandforgood  https://t.co/SmfGg99ZTZ Thanks! I'm waiting for a new falcon on my bag ;) #keepingyoubusy  https://t.co/JKjmtWFmrN \"A moment to remember\" indeed. Thank you for documenting it!  https://t.co/aURBlekFUP Thank you guys for being my lucky ride! 😀 https://t.co/QCuHfreSUG You better send me some new ones, lucky fans are now admiring their perfection and I'm going back home barefoot :) https://t.co/q7G2cMKHrj What a journey. Really grateful for everything. I'll keep working hard. Love is the key! https://t.co/CrT7TYRL3O Flying back home barefoot, but with a trophy. Not complaining!🎾🏆👟 Giving back to my #NoleFam https://t.co/pk2HBS823u Great 2 weeks are behind us. Great job @AustralianOpen for making us feel at home. Congrats to @andymurray and his team.\nKeep up good work! Big thanks to everyone who cheered for #TeamDjokovic in the past few weeks. We heard you! 😉#NoleFam https://t.co/ap7YvHskKM What a final girls @serenawilliams &amp; @AngeliqueKerber Great sportsmanship! Well done to both. Congrats to Angelique for her 1st GS #AusOpen Help me bring attention to the most important cause in the world - children! #NoleFam #ECD  https://t.co/A8F3McICAo Trust me, doing #yoga pays off big time in every part of my life :) https://t.co/FI56mZGq4T It was just what I needed. Thanks for helping! :) https://t.co/2AsQ6i91sf Will do my best! Thanks for your support!  https://t.co/8qqubHp5yW That's how it goes… :) https://t.co/PhdszBIOTQ Wow how many of you have this \"I'm team Djokovic\" #AusOpen decoration on FB! I like it so much! Thank you #NoleFam https://t.co/tZ0BNyYsCz Loved this energy I've got from them just before my #ausopen start. Thanks @ANZ_AU https://t.co/7cvuJ8M86m I  was practicing with Haase today. You remember this game #NoleFam? 😉 https://t.co/QNJZw9jHUK Posted your #HeadbandForGood pics yet #Nolefam? $2 to @WorldVisionAus from @anz_au for every pic https://t.co/I5QfftWCY7 #NoleFam make your predictions on the #AUSOpen and win my outfit on https://t.co/ECtYUragma #TennisByPeugeot Traditions have a way of shaping you, you always remember the family moments around the dinner table #JacobsCreek https://t.co/38cX8JJ6UA Hey #NoleFam, how skilled are you with chopsticks? :) https://t.co/rIKoKj8vPA Draw Ceremony at #ausopen got us really nice supporters. Is there any #NoleFam from #SwanHill? https://t.co/Gf8U8Z8fUO Our first date didn't go to plan, but @JelenaRisticNDF and I always laugh about it. Check out why #JacobsCreek :) \nhttps://t.co/BKA3jURrDW Always happy to be back here in Aussie land #AusOpen. Idemooo #NoleFam 💪☺️☀️ https://t.co/ESyCm1fVkN #NoleFam, get creative for a cause! Post pics with headband #HeadBandForGood &amp; @anz_au will donate $2 for every shot https://t.co/fyl5FuRbpw Мир Божији, Христос се роди. ХР | ВР https://t.co/nwfuyR2HCm Wind can't stop Rafa and I from having a good time at beach-tennis shooting #QatarOpen https://t.co/wM7i3COqSt I bet you didn't use rowing machine in this way yet ;) #gym https://t.co/zGlucLvot5 Happy New Year #nolefam! I wish you an amazing year full of love #HappyNewYear https://t.co/5oqcKT5RDx #Leadership is about taking on #YourWorldYourWay and I’m proud to work with @ANZ_AU to share my insights on this:https://t.co/qmVAEyYjDX Merry Xmas :D Best wishes from @JelenaRisticNDF, Stefan &amp; me! https://t.co/Bj6prS3HWZ Taking on #YourWorldYourWay, needs #energy – watch my latest video with @anz_au where I share what energizes me https://t.co/K73NR5a9od Enjoying our wonderful vacation together...still can't get a racquet out of my hand 😊  Hi to my #Nolefam https://t.co/6oOKeoJo1E RT @novakfoundation: \"Kabineti za neke nove Tesle\". Hvala @Blic_online na objavi! https://t.co/MVZ45DP33A Congrats #teamGB on DC win! @andy_murray Seeing ur reaction after winning made me relive again how it was 4 us in '10.Well done,u deserve it Thanks for your support...I am proud to be a Peugeot brand ambassador https://t.co/d2PMQfrx2m Had a Great time with Jake...Thanks #Peugeot https://t.co/7tIzOJ5q9g Thank you to my wonderful wife for inspiring me everyday...you made this the best year of my life😅 https://t.co/6VMrMAh65Z Very Excited to be in the Finals today @ATPWorldTour and plan to video chat live with #NoleFam right after my match @NovakDjokovic on FB Join @novakfoundation &amp; @UNICEF to #FightUnfair and help kids learn https://t.co/202vpJ90Rm https://t.co/xa2hbTcn2d Thanks for your support - I'm excited to be in the semifinals https://t.co/LzxnReIeZj Enjoying dinner with my travelling family😊. We miss BB here (he is on family duty tonight) https://t.co/HpePcOco3e Shocked, saddened, horrified, speechless. My prayers go to all the families and victims. #PrayersForParis Love how my boy reacts on violin concert of @NemanjaRadulOFF 🎶😀 https://t.co/iIIYFcpl0x So proud of my club in Belgrade. Thank you @tctennnisography and @tennischannel for making this great video https://t.co/Thga6mpfnp :) @NehaShrikant Thanks team for your support Stopping for a selfie with #NoleFam before my match at #BNPPM https://t.co/7i5oC5O9Ar RT @Peugeot: Peugeot and @ATPWorldTour announce a global partnership! #RoadToTennis #TennisByPeugeot\n&gt; https://t.co/U1qZoFmSSY https://t.co… .@andrewcnn hit me with some seriously interesting questions in this #TalkAsia interview. #NoleFam watch tomorrow 😎 https://t.co/hCeos5Ktex #allezparis...feels good playing my first match #BNPPM https://t.co/Tez73AKbKX My #NoleFam, I was live today at @Peugeot event on #Periscope Peugeot is on the #RoadToTennis 🏁🚗 https://t.co/7VdHRLbfeY happy halloween! I'm always game when it comes to having fun :) https://t.co/gJQs6Sh1Bn Spectacular #MTVEMA Happy to be part of the ceremony that celebrates music! 🎶🎉😀 https://t.co/5dGU7BJRf2 Io e mio amore @JelenaRisticNDF at the backstage. Getting ready for #MTVEMA https://t.co/IKo8VF7y2c Ciao Milano, I am here :) #MTVEMA awards tonight. Are you watching? 🎶😎 Enjoying romantic Venezia with my wonderful wife @JelenaRisticNDF https://t.co/UCYk8ju6TB Thank You #Nolefam for your kind words https://t.co/JfxuAPZwlb We all thank you for your good wishes https://t.co/2t3nkn0tky Enjoying my raw, vegetarian lunch 👍😀 https://t.co/51IjR7tTPj We did it, thanks #adidas All nine with The One, my #barricades :)  https://t.co/adQlR8xynG Thanks @Adidas for your \"support\"...lol https://t.co/NTdFlnzcY2 Thanks #Headtennis https://t.co/Ui74grek1S I'm looking forward to seeing you guys next year:) https://t.co/KEw9au0QOC yes we did -  thanks #NoleFam https://t.co/KuTlw9lIJE Relaxing with team after a good day in the office 📎💪🏻😉 http://t.co/IYgABmiwgl I had a great time with ANZ Junior Tennis participants at the Shanghai Rolex Masters tonight :) Thanks @ANZ_AU! http://t.co/9EzsJRK8hF Plenty of fun to be held here at @ANZ_AU at the Shanghai Rolex Masters! Me like :) http://t.co/BJVPReBuT5 As you can see i get treated very well :) thanks #uniqlo http://t.co/2te1KGfwQR Thanks to my friends in the locker room who take good care of me:) #chinaopentennis http://t.co/oL4S4GSv63 And she is Jelena Djokovic on @instagram, cool 😎 https://t.co/I8G7nOjGoB Hiking the great wall with family &amp; friends..awesome &amp; inspirational visit..thanks @chinaopen for making it happen http://t.co/Dy1ajAPQRs @aaenaaa @djole_djokovic i was so excited I forgot the _ ...thanks:) We both wave waited a lifetime to team up. I'm glad I get to have you @djole_djokovic on this side of the net :) http://t.co/iDGEyHXCO2 Enjoyed this great @JacobsCreek event today! http://t.co/AwnaLwDFqE Ready to start #ChinaOpen Are YOU ready my #NoleFam? http://t.co/0qwrQDebr0 Glad to have my brothers @DjokoMare @djole_djokovic here with me #solucky http://t.co/tN4F7lyRd6 Today at Charity Promotion event with my young friends! :) The best way to start #ChinaOpen don't you think #NoleFam? http://t.co/nvaGULLgTX Thanks #teamdjokovic for making my day:) http://t.co/R6eTlfU7TQ Thanks for the warm welcome :)  https://t.co/25671MRdlk what a wonderful culture https://t.co/sZfCx6OJw8 Enjoyed my practice with players from the thai tennis federation today😃 #thailand http://t.co/eMeOARoD8m Thanks #NetJets had a great time https://t.co/ZQETNTzaiT . @TSSRBIJE @TheBorisBecker Hvala vama :) Ima izazova, ali ima i toliko mogućnosti za naše mlade tenisere! Samo napred! RT @JelenaRisticNDF: Celebrating great night &amp; launching of #originalMG 4 students @LeaderOfHorde @DjokerNole @TheBorisBecker @tabashbgd ht… Learn, believe, work hard and never give up! My takeaways from last night's talk by @TheBorisBecker #novakfoundation http://t.co/UfSoNE7Xb8 My memories from fantastic 2 days at #Drugarijada2015 Thank you little people, you were so big! cc @JelenaRisticNDF http://t.co/9smRgAsuQN We are celebrating today! It's our anniversary #10years with my love @JelenaRisticNDF &lt;3 http://t.co/KRZGksw0ew Uz vas smo Orlovi! Idemooooo #EuroBasket2015  https://t.co/SEXq5xKM4Y Ha...you're good!! https://t.co/ILl56hn9J8 Back home going through plans with #headtennis...cool projects coming in 2016:) http://t.co/eL8KXRXhZh Bio sem deo uredničkog tima današnjeg izdanja Blica :) Kako vam se dopao?  https://t.co/S03zHtGql7 Thank you @JacobsCreek...I appreciate your support! https://t.co/t7W4AjChEW Thank you very much for your kind words...I appreciate your support https://t.co/mWyRL6pdAu HEAD Post-final interview with 2015 US Open champion Novak Djokovic https://t.co/Sx9unaw1iQ via @YouTube Thanks @Adidas for keeping my feet on the ground https://t.co/2LYOGhlqUr Thanks @UniqloUSA for your support https://t.co/GOwH7UYVhl Cleaning out my locker after a great USOpen...looking forward to #2016usopen #noleday http://t.co/ByxZXwxJz3 Obrigado Guga!! https://t.co/M5qa2YDIxY its been an amazing 24hrs #nolefam...want to see? #noleday http://t.co/vlrK88od3d Bet you guys didn't know i had a tough doubles match today...thanks @MJEREMIASZ @lapstar11 #myheroes http://t.co/iFudTW6VeL my special recipe is banana, coconut/rice/almond milk, cinnamon, chia seeds, protein powder, flax seed, cacao powder https://t.co/gcGqSNTTvY Thanks for the good thoughts my friend https://t.co/8kZY8wkiUv If there ever is an incentive to play well tonite...this is it :) #familytime http://t.co/qpW6MckKAL Starting my preparation for tonight #stayhealthy #2015usopen http://t.co/pxiw5f4PpH Beautiful night out with my wife and @TheBorisBecker ....a little asian fusion cuisine and a lot of laughs:))) http://t.co/OVDPOyDjsR Would love to hang with you guys all day...but i have to run see my boy #NoleFam http://t.co/W3AvMBvVms Finding my rhythm in glorious #ashestadium #2015usopen http://t.co/243zQPZoic Let's fight this battle together #redrally http://t.co/nvBQCgUQcL I was honored to be part of such a special day https://t.co/y1OO2wXQBw Glad to get through my first match @2015usopen... stopped by the cool #espn set http://t.co/X2xyNcDX5B i enjoy his company during these moments #mickeymouse #2015usopen http://t.co/FqtUYUCg8f This was a very good start of the day. I'm off to practice now - happy and inspired! .@JelenaRisticNDF So glad to have you and our great @NovakFoundation team on this road. We can do this #nevergiveup #ServingECD RT @novakfoundation: Congrats to .@DjokerNole who has become a Global Ambassador for #ECD \nWe continue our #mission to #helpchildren https:… Honoured to become a global Ambassador for @UNICEF We can make a difference if we believe in children's dreams. Together :) @yokabrandt .@UNICEF  I'm honored to join your big-hearted mission #servingECD #NovakForChildren Thanks to this partnership much more will be done for our kids! #ServingECD  https://t.co/p4vF4VNScm RT @WorldBank: 150 million children under 5 don't have access to early childhood education: http://t.co/8DJEDmJPwZ #ServingECD http://t.co/… .@JimKim_WBG  I am privileged to be in a position to help and excited to join our forces together for #servingECD Thank you! Looking forward to having a great time @AAKidsDay this Sat at the #USOpen…check out http://t.co/mjANN1OEbf http://t.co/l6zFeXnkz1 What do you guys think of my new tweet serve? #uniqlo #2015usopen http://t.co/uQ2jPmny7B heading to my @espn @SportsCenter interview at 6:30pm EST...let you know how it goes #NoleFam Had some great challenges heading into the US Open...excited for the coming weeks...thank you my #NoleFam What a welcome from my #NoleFam You are amazing! Thank you :) http://t.co/PAtsI8j36l Love it! @JelenaRisticNDF: Beautiful Serbian countryside,history...My favourite song of all! RT https://t.co/oCVDAedquJ Congratulations on a great initiative to promote equality @ANZ_AU #equalfuture http://t.co/8u0dIYhM9U Team... Waiting for my match #RainDelay http://t.co/YZqxPYCXOb Marian wishing he had a reason to sit in this chair. Atleast God gave him a good sense of humour and I got the hair:) http://t.co/iWWFeaaUo6 My team enjoys the popularity here :) 🇨🇦 http://t.co/7c1wKrJPyn Bravoooooo šampioni! #Serbia #FINAworlds #champions #waterpolo After my first practice today with Philip Bester in Montreal with the team playing a little game together http://t.co/eooPHxVLiF With/without medals you are our champions. So much to learn from all of you! #spirit #determination #love #joy  https://t.co/gesWBz0oQK Ready for Ryder Cup 2016! Captain of @RyderCupEurope, don't hesitate to call us 😄 http://t.co/ajmL5mQwZi One of GG's favorites 🚵 #Uphillintervals http://t.co/6KuTtX2vId Yep!! :) Thanks for playing everyone. We'll do this again soon! 👍🏻 https://t.co/jViQfBtNMF Almost!! Lol https://t.co/9Wvr7qLZG6 Close...😀 https://t.co/OEz5wBiB6c S__🌞 R__🏃🏻 W__🌳 S__😎 P__📷 #FillInTheBlank 😉 http://t.co/KtXMIGZ6J1 Sasha gained a few extra pounds for the summer holidays. He is quite the heavy weight! :-) #StairsTraining 💪🏼 http://t.co/QExM9hCqp3 Preparations for the @USOpenSeries have started! Me and @troicki_viktor practicing together on a 🌞 day in Monaco. 🎾 http://t.co/JEhPSeSXL1 Thank you for a warm welcome! It was nice to see you all again. I have wonderful memories from Umag!  https://t.co/oBohcIejvQ Good luck!! https://t.co/YyGYqmnacj Thank you! https://t.co/uOxzCDAKTX Such an overwhelming experience to have won #Wimbledon 3 times! See my Wimbledon story here #MadeBy @JacobsCreek https://t.co/LIurglE4Ye Thank you! https://t.co/dXn3SitRi2 Thank you! https://t.co/vuxA8hQgIV RT @adidastennis: The perfect match. #Barricade X Novak. #Wimbledon #ImpactTheGame http://t.co/8U45WXKCwo RT @Peugeot: Congrats @DjokerNole for this 3rd #Wimbledon title: on every surface, sport gives us our best emotions! #NoleFam http://t.co/a… 👍🏻 https://t.co/fOLjc6xGKF Great bringing back the tradition of the Champions' dance to @Wimbledon. Thanks for the dance @serenawilliams!! ;) http://t.co/izzzAw2twJ Thank you to my team, to my #NoleFam and to all the people cheering and supporting me here @Wimbledon. Ideeemoooo! http://t.co/G1KvjKh1D9 :) https://t.co/xRcNI96qab Thank you! https://t.co/k47Jij3AS5 Haha. Thanks! https://t.co/eEkEJByVKM Thanks bro! https://t.co/joUrTLhuJ6 Not to forget on this day a great man was born. He never gave up on his dream! #NikolaTesla http://t.co/mUhxC6IIq2 Appreciate it https://t.co/yYoN8HU6iH Thanks! https://t.co/YUPOkTGveE :) 🙏🏻 https://t.co/R5PxwKXdPe My little Simba! :) #TheLionKing #Proud #Familytime http://t.co/6cHkH01vHW In case you missed it earlier this year, see the story behind my determination to win Wimbledon #MadeBy @JacobsCreek https://t.co/O3ZbDXrKMC Everything is way more fun when in good company! With my team today watching some 🎾 🌱 #Wimbledon http://t.co/AxeKKrtLlo Good chat with the @espn crew after todays match... http://t.co/YzG49eoZtm RT @Wimbledon: WATCH Nice moment on Centre Court as Djokovic claps off Jarkko Nieminen who was playing in his last #Wimbledon   http://t.co… :) https://t.co/OPUz1Hh73r Thanks! https://t.co/J1JLMjNbEB 👍🏻 same here! https://t.co/u45WvvrKd3 I am beyond words after watching this: http://t.co/pePVz13ndc. Very honored and humbled by your work of art. Well done! @Zuzanna_Szyszak Thanks! https://t.co/A3g0gJop75 I promised I was a nice guy! 😄 https://t.co/GezRHJ5nVB RT @BasiaNF: .@DjokerNole #Wimbledon #day1 /efe/ http://t.co/w5pmrBP2C0 Anytime buddy! https://t.co/imHK0qP1tb Thanks! Good to see you out there bro!  https://t.co/k2a1y5bDbD Bravoooooo devojke!!! Serbia is European Basketball champion thanks to our unbelievable girls!!!! So proud! Ideeeemoooooo!!!! 🎉🎉🎉🎉🎉 Spent yesterday evening in the kitchen with my good friends @JacobsCreek - see what we got up to. #NoleFam #MadeBy https://t.co/XvrMTVJqDi Trying to look like 'ah yeah, I do this all the time' ;) http://t.co/PrOTbdy7c9 First practice on virgin grass @Wimbledon...VERY hard work! 😂 http://t.co/lgwvSBxTyJ For all the dads out there, happy fathers day! Here was me and Stefan hanging out today :) #daddytime http://t.co/hmFKcCr07z So proud of our young football team. #Champions of FIFA U20 World Cup!!! Braaavo momci!!! #U20WC #Serbia http://t.co/1NxVZi193C Working peacefully in the nature with my brother @DjokoMare 🎾🌱 http://t.co/c9L27XRr33 @stefbojic 👏🏻👏🏻  https://t.co/cq2lgwQB5k Hladne glave, vrelog srca. Srecno momci! :) #Orlici #U20WC This is it. \"Life lived that matters is not out of circumstance but out of choice.\" #DyingToHaveKnown #Documentary http://t.co/iINr8gtQpH Thank u all for believing in me and cheering for me. Congrats @stanwawrinka on an amazing performance! Well deserved. http://t.co/2EhDNyFT50 @beINSPORTS_MENA thanks for the great chat earlier! Btw #NicePic ✏️👍🏻 http://t.co/lx0AP65iiu Fun interview today with @FOXSportsAsia  Can you guys name the song I was singing? ☺️ http://t.co/k21FV9Dg7a Thank you all for your support! https://t.co/Gh57NkNo2v :) https://t.co/2Dmh2VW8b4 Hvala, momci :) Čestitke na pobedi i srećno! https://t.co/dwE0ynsvMR Hvala ti legendo! https://t.co/cQD9PYkXa8 How about a cup of tea to end a successful day? Thanks for ur love! http://t.co/Bwfj7wFoNx 😁 https://t.co/W20RVriD43 Happy #TeamUNICEF day at @rolandgarros! Excited to support @UNICEF France @teamunicef.fr and all their great work! 👏🏻 http://t.co/Qfk8X1OQit Me too :) https://t.co/hFQZn7FLmz Trying to keep up with reading all your messages of support #NoleFam. There are so many...Thank you! https://t.co/NgcMzVJNa2 Appreciate it! https://t.co/fmS5F8hZNa Thanks :) https://t.co/xHr9tOXbZk Thank you https://t.co/NoPbq8OxrY 👍🏻 https://t.co/bDl7QKtLFT Merci @francetvsport @Eurosport http://t.co/wmaf45DMYQ Appreciate the support today! #Nolefam https://t.co/MJNfGt03Tp :) good luck! https://t.co/y7EXN6CE87 :) https://t.co/8vFSUea7rJ :) thanks for the support today https://t.co/AnFgimh8up Today I was inspired by our future 😊 https://t.co/OHhj28mG3u My boy's first horse riding lessons lol 👶🏼👨🏻 #DaddyDuty http://t.co/q7qvvEx43r Thanks :) https://t.co/o2jTjA3k2h Thank you! https://t.co/802ol3nrot Thanks for staying up :) https://t.co/qyTsNZcWqv RT @AgathaClaireS: Go Nole ! @DjokerNole :) #RolandGarros Happened today and never again I hope https://t.co/Y5y40yTUeJ .@Ibra_official Hvala na podrsci druze! https://t.co/2aYRFXPeVv RT @Peugeot: .@DjokerNole is back ! Get ready for #BetterSensations #RG15\nhttps://t.co/10KtEyQNfE RT @bobsinclar: This is for children's smile I do it every year 👦👧🙌 @rolandgarros 🎾🏆🇫🇷 #TBT @Cyrilhanouna @DjokerNole #RG15 #ATP http://t.c… :) https://t.co/xmDDCSbZZa Got a good warmup and practice in today. As for Boris? Idk. 🙈 lol http://t.co/MhHpzFN5eI Good win today. Thanks everyone! :) https://t.co/qeishddGdA Merci 😉 https://t.co/vGwlnymQB0 Thank you! #NoleFam https://t.co/I9Ps6Xjtnb Thanks! https://t.co/aRYC2duTgn Stretched it out this morning ⚽️ before practice 🎾 #GoodDay http://t.co/2SvlXyEwA7 RT @PeugeotFR: #MeetDjoko @DjokerNole en plein échange avec nos fans @rachouxb_ @BeInAlex cc @RoadtoRG #RG15 http://t.co/o98bB6Qkyr RT @Peugeot: The chinese upcoming champions with the world's number one, @djokernole #RG15 http://t.co/tWqXCv73Lt Watching #Eurovision2015 with Edo, Ele and Jelena. We have 2 votes secured from #ITA to #SRB 😜👍💪 #VoteForSerbia http://t.co/053wkJKloV Ideeemoooo!!! #SRB #Eurorvision2015 @BojanaStamenov #beautyneverlies  https://t.co/McxGk8JmMZ Guess where Im headed now?! 🎶 http://t.co/AcrNen48Z1 http://t.co/40qfoxGL07 I celebrated this evening with my family, friends and team. Thank you guys! http://t.co/4r8lkQMOJ8 Thank you! https://t.co/vHRoiMITAX Thank you guys! @rolandgarros had a gluten free, sugar free cake for me 😋 https://t.co/HZGyxYewni RT @NoleChampion1: @DjokerNole HAPPY BIRTHDAY NOLE, ALL THE BEST AND MUCH SUCCESS IN LIFE! ❤ http://t.co/pmNgTqyLDR Thank you! Yum! https://t.co/kX6eaILIan Thank you! 😄 https://t.co/F5N6kcbEGi Thank you! ☺️ https://t.co/oKQY12X8C6 Thank you! :) https://t.co/Ntwxiy8HNm Good practice today with @feliciano_lopez 🎾🇫🇷 http://t.co/1TEk1kr4wP RT @NovakIndiaFans: .@DjokerNole met Amelie Mauresmo and Andy Murray before training. (Photos © FFT) http://t.co/OseDwdg40U Great event today @UNIQLO_France for the launch of the Mickey Plays UT T-shirt collection! Had too much fun #NoleFam http://t.co/IR1T4Dx03w Thank you @UNIQLO_France @DisneyFR for the great cake! 😋 🎂 http://t.co/4qwBbRBli3 http://t.co/13G9Dunvxt RT @DisneyFR: Le tennis, @DjokerNole le joue aussi en jeu vidéo chez @UNIQLO_France pour le lancement de la collection#MickeyPlays http://t… RT @DisneyFR: On a hâte de voir arriver @DjokerNole ! #Mickeyplays http://t.co/PBHOlkA3Y2 Feels good to be back here. Bonjour 🇫🇷 http://t.co/lwjNP3GHTI They subbed me out! lol. Coach wanted 'fresh legs' 😉. Good luck guys! ⚽️#TeamPrinceAlbert http://t.co/WfkoDVnyaH We're up 3-0 at half! Dont get too excited kids 😄 still another half to go ⚽️ http://t.co/EkuCrw037b Im about to play a match for Prince Albert ⚽️ team as captain and wearing 🔟. Probably good idea to warm up! 😮 http://t.co/73tfPD8U7A RT @Cvijeta95: Nole with kids...OMG!  😍 RT @BasiaNF .@DjokerNole #Milan #Expo #Djokolife /LaPresse/ http://t.co/4NUAvSnaAc Another winning day in Milan :) introducing #Djokolife. Thank u all for coming by. Means a lot! #Glutenfree  https://t.co/zZC2WKB0ri This one was special Roma! Grazie mille! Until next time...Ciao a tutti!! #Nolefam #ibi15 #Roma 🇮🇹 http://t.co/Y1F7vEUmnu RT @SCR_NOLE_1D: @DjokerNole signs autographs for fans after the match #Final @InteBNLdItalia http://t.co/4bOYZkJYKU RT @Nina_Nolee: @DjokerNole with his parents. 😍❤\n#IBI15 🎾🇮🇹 🏆 http://t.co/d71FyvzPPq It's been great hanging with you in Rome bro @DjokoMare 🇮🇹 http://t.co/tyvJlOYWUF Time to unwind...taking in the beauty of Roma #Serenità http://t.co/8Xvsjbzg9N Great times #TennisWithStars with great people #Totti @Florenzi @CaroWozniacki for a great cause! #RomaCares ⚽️🎾 http://t.co/FVOVYBhyWj Wishing all Mothers a very special day and express my great appreciation for everything you do #HappyMothersDay 🌸💐 http://t.co/sZqouL0He1 Ladies and gentlemen meet Italia's finest: Schiavo and Pennuccia 🇮🇹😀 http://t.co/VCcshPiDlX Got quite a warm welcome today after practice @InteBNLdItalia. Grazie Roma! #ibi15 🎾🇮🇹 http://t.co/EL0UJhckJt @LukeAlley thanks for sharing the video Luke! Max is a little superhero! So adorable Awww this is too cute! Love it! #djoker http://t.co/fp8VfMgaFW Me and my @Peugeot family are preparing you something really fun! Stay tuned 😊 http://t.co/v9yVeMlQ5N #HappyNoleFamDay guys!!! Lots of love love to all of you ❤️ http://t.co/XBZ2BPASTH Nothing beats time with family in the nature. Recharging batteries :) #Grounding http://t.co/ON9P9Nyc1f One trophy &amp; a bag. No flights. No packing. Taking a few days off now. Thx guys!We did it again! 🎉🏆🎾#NoleFam http://t.co/eL15eowbTZ Sutra u 10h je #bgdmaraton Taman kad istrcite,pocinjem i ja da trcim svoj maraton protiv Rafe.Ajmo svi na trcanje :) https://t.co/izTeJjbMY7 Good read! Love it 👏💪 https://t.co/226qC3PU08 I had a short appearance tonight in the #PlayersParty show.Lots of laughing in the room! Great show! @MCROLEXMASTERS http://t.co/l3j6pxQKsl Really honoured for being awarded by @LaureusSport the World Sportsman of the year award. Thank you! http://t.co/WaLFkYjXht Joining you live on CNN in a few min.... @LaureusSport Here we go again. Same place, same team, same goals. Let's go!!! #MonteCarlo @MCROLEXMASTERS #NoleFam http://t.co/wavJJUZsTk So happy to see @TipsarevicJanko play his first ATP match in 17months! Idemo Jankela!!! 💪 http://t.co/6nuYqf77AH RT @novakfoundation: Vidimo se u subotu u 10h na dečijem maratonu jer - I do cilja treba znati, vrtić ce ti znanje dati! @unicefsrbija #NDF… RT @novakfoundation: Na primeru \"Školica života - zajedno za detinjstvo\" ukazali smo na značaj poboljšanja kvaliteta razvoja dece u predško… RT @novakfoundation: Together with @unicefsrbija  Srbija we will join and support the Children's Marathon http://t.co/B4pgB13gaB\n#sport #ed… Come&amp;run w/ ur family &amp;friends on Belgrade Marathon! Kids run on 11.04. to promote preschool edu @novakfoundation  https://t.co/zc6J92bu82 Jet lag go away!!!! http://t.co/WYgv8XpvWF Sport is the right answer for peace and development. #sport4betterworld #April6 @novakfoundation http://t.co/UFu1qFWjjY RT @novakfoundation: Dan posle trijumfa u Majamiju @DjokerNole nam je pričao o tome kakav je uticaj imao sport na njegov život http://t.co/… RT @novakfoundation: The day after the triumph in Miami @DjokerNole talked for #NDFblog about success that he endorses. http://t.co/H93gBRA… This little buddy is my most precious trophy! No better way to end the day than with my family :) #NoleFam http://t.co/7oO5YIFGR6 Nice to finish with a win!Really grateful for opportunity to compete in a sport I love so much.Thank you! #NoleFam http://t.co/LhThFQ7I7o It was great meeting you! Meet the @ColtonLHaynes #NoleFam :) #Arrow #MiamiOpen http://t.co/G2FRykfNX8 You better make some kids smile today! They love it and do it more than 300x a day! @novakfoundation 😜 http://t.co/TGiq8f8HJg I mean really?! Veteran?! Me?! For sure April fools joke! LOL http://t.co/dj3rFH4KtX Yes... I deserved it. 😃😂 #Nolefam #MiamiOpen http://t.co/UdZVaPNI8c @NiallOfficial buddy, you can only win vs me in tennis if you play with your guitar 💪😂🎶 Idemo momci, samo napred RT @NiallOfficial: @DjokerNole next time we play tennis, I'm beating Ya in 3 straight sets , winning over 5 last time took too long . No better way to get in the right state of mind then connecting w/ nature. Also curious to see if there were crocs 😜 http://t.co/09IGDXfJtF We are ready for tomorrow! Ideeemoooo 3rd match from 11am @TipsarevicJanko #MiamiOpen #NoleFam http://t.co/a6lT3jl3Ga \"U svetu postoji jedno carstvo...\"Himna Davis Kup tima :) Svi na okupu! Davis Cup team SRB in Miami :) http://t.co/A9ZPopRplj It looks like I know what I'm doing, right? #NoleFam #Miami #UNIQLO http://t.co/1ju1SdCn17 3....2....1....jump!!! Photo shoot with @UniqloUSA today #Miami http://t.co/LUEQENPP4O Mislima i srcem uz moj narod koji je propatio mnogo zbog NATO bombardovanja. Love to my ppl who lost a lot during NATO bombing #24march1999 Rocky Balboa!!!!! #inspiration #NoleFam #idemooo http://t.co/FO3730KM5v Happy! #BNPO15 #Nolefam http://t.co/yQrvUggn0I Juicing, juicing 👌Vitamins for body&amp; soul 🙌 http://t.co/jvYPnNpiTg Had support of my Davis Cup teammate Viktor tonight! Lucky I pulled the win in 2 sets. #Happy #Troicki http://t.co/gipXT6byxN RT @BNPPARIBASOPEN: Nothing better than my #NoleFam --@DjokerNole #IndianWells #BNPPO15 http://t.co/rLWapYkVe2 http://t.co/VLIi5n8WbE Did you know that sometimes post match press conferences are done on the street? #NoleFam http://t.co/XLLnRQDIAJ Details, details... Gotta look good out there 📹✂️😄 #NoleFam #BNPO15 http://t.co/hPHuAsKloa So good to see my friend @nickvujicic again yesterday for an interview. Always a source of inspiration! http://t.co/vWTmNzGDem Heading to the locker room after 1st win #BNPO15 #nolefam http://t.co/GZ1dcmrhBl Champion football team 😎 https://t.co/wSY0PuUUpr RT @ATPWorldTour: .@DjokerNole looks to retain #BNPPO15 title with wife, son &amp; 2 dogs in tow. Read &amp; Watch: http://t.co/kug2LDp0g7 #atp htt… RT @JelenaRisticNDF: Spying on my hubby @DjokerNole #IndianWells15 #BNPParibas #practice #NoleFam http://t.co/3vymUx7y2F @NDF_FC I will let all of you, my #nolefam, when the next #nole4u is 😁 Hi nolefam, how are you this #ff? 😜 Signing tennis balls during my @head_tennis photo shoot today #BNPPO15 #indianwells http://t.co/Kv1xKlCBL2 RT @BNPPARIBASOPEN: What does defending champ @DjokerNole's mural look like?! Click here to find out: http://t.co/vprFEGi5Mm #BNPPO15 http:… RT @LV_Sports: You can do more. You can always do more. -Dan Marino Ballet with my wife :) @JelenaRisticNDF http://t.co/y95Obmh2M4 Uspeli smo, timski i zajedno do četvrtfinala @DavisCup! Hvala vam na podršci i fer navijanju. Serbia! We made it to @DavisCup QF!  Thank you for being supportive and fair. http://t.co/8VnXenzcS4 #Womensday is just today, but we should always care for &amp; respect each other, to make every day a celebration for both women &amp; men as equals #Nolefam, today I would like for you to celebrate #womensday with me. All my life I have always been surrounded by inspiring women. RT @Sports_Greats: There's always somebody saying you can't do it, and those people have to be ignored. -Bill Cartwright #nolefam gear from the e-store! Love it Tanis. RT @Tanis95: @DjokerNole Well done Nole! Look 😍❤️ http://t.co/c9BCONgw6l Hello #nolefam, my team tells me we have free delivery right now - buy my gear, support @novakfoundation: http://t.co/9pxjjFXuJi @NovakFanClubRS @ddftennis hvala #DDFTENNIS Semi-finals, idemmoooo! @DDFTennis http://t.co/0oLZvszJ7l RT @BasiaNF: Wow :) @DjokerNole (DDFTennis) http://t.co/lzj7ahyGH6 RT @TomPerrotta: Novak Djokovic on cover of WSJ Magazine. We talked tennis, family, clothes, germs, greatness. http://t.co/P1heFDEq7M http:… Interviews in Dubai. Ready for ddftennis! #ddftennis http://t.co/ca7ahHsmDV RT @novakfoundation: Take a look how good it was at yesterday's opening of the kindergarten 'Dečija radost' in Svilajnac http://t.co/8bOWm5… With help from my #nolefam &amp; sponsors, the @novakfoundation has successfully reopened a kindergarten in Serbia: http://t.co/oVkncIH5s0 Practicing in Dubai for @ddftennis. So windy we had to wear masks @kohlscribbler @rogerfederer @tomasberdych http://t.co/7YXUSXFtgZ RT @Ibra_official: 805 million people suffer from hunger. Make sure the world knows. #805millionnames w/@WFP http://t.co/H7VPUL6spJ Honored to once again be nominated for the @LaureusSport World Sportsman of the Year award! http://t.co/iUQmhEOAXp #Laureus #LWSA15 Snow time!!!! #happy http://t.co/UELYroXEHQ RT @head_tennis: @DjokerNole raised his game in #AusOpen final to capture his 8th Grand Slam title. Find out now what it means to him: http… Thank you everyone for your support. #AusOpen\n#Nov8k #gameraiser #rallyforgood #dothenovak http://t.co/hqQag89Vh3 @NiallOfficial 🙏 When will we get another practice match in again? 😉 @NovakDjokerFans hello #nolefam ;) RT @seikowatches: Congratulations Novak Djokovic on Australian Open! It was his fifth win in this, tennis’ first Grand Slam of the... http:… RT @JacobsCreek: Congrats @DjokerNole on winning the 2015 #AusOpen.\nSee how Novak is #MadeBy determination at http://t.co/YtPmyUUwRL http:/… RT @Peugeot: Congrats @DjokerNole, our brand ambassador, who won the first Grand Slam Tennis tournament of the year! #Peugeot http://t.co/U… RT @NiallOfficial: @DjokerNole congratulations on playing insane tennis and winning your 5th australian open, incredible athlete and role m… RT @adidastennis: Greatness unleashed. Congrats to @DjokerNole, the #AusOpen 2015 Champion! #Barricade #Nov8k http://t.co/nqX3zizkqT Ok who caught this? Haha @AustralianOpen https://t.co/2vKvW3hLPp RT @head_tennis: Congratulations @DjokerNole – 5 time Australian Open champion. What a final! #gameraiser #AusOpenFinal #Murray http://t.co… RT @ANZ_AU: It’s official-he’s King of the Court! Congrats @djokernole on your #ausopenfinal win! #YourGameYourWay #nolefam http://t.co/EU7… @BillieJeanKing thank you!! Today is the day, my #nolefam. Will you cheer for me? From home using #nolefam or on the court, I hope you'll share your energy with me. Always there for me 😍 RT @JelenaRisticNDF: Yes we are watching. #NoleFam #AusOpen #teamdjokovic 💪💪💪💪🍀🍀🍀 . @NiallOfficial haha thanks bro. If you can watch tomorrow give me and your #nolefam fans a shout to cheer me on RT @NiallOfficial: Different league of tennis tonight ! Jesus Christ ! @DjokerNole and @stanwawrinka were incredible ! Congrats nole ! Fina… RT @adidastennis: Dominate the court, claim the victory @DjokerNole. #AusOpen #Barricade http://t.co/DQVRBSBgaE #Nolefam: #AusOpen finals weekend @anz_au will donate to #TennisCares &amp; @RedCrossAU for each #rallyforgood pic/video http://t.co/f7G9kFOL2W #Thankyou to all my #nolefam who have already so far kept my positive sentiment so high for #AusOpen. #Nolefam! Are you ready to watch my match tonight? Let's knock out the #AusOpen leaderboard. Tweet #Nolefam &amp; words of encouragement #Idemo! Birthed from Serbia. Shaped by Jelena. Inspired by dreams. Watch the full #MadeBy film series here: http://t.co/ZdERhmeJ2x RT @JelenaRisticNDF: Ajde tatice! Come on daddy! #NoleFam #AusOpen2015 @DjokerNole @AustralianOpen http://t.co/Q3UYGGLYA6 .@ANZ_AU @KeithUrban It was great :D Thanks a lot #ANZJamSlam #AusOpen RT @ANZ_AU: .@djokernole is rocking out with @KeithUrban in the #ANZJamSlam. Join us &amp; have a go at #ausopen! #nolefam\nhttps://t.co/4h7qp97… Like my #AusOpen uniform? Buy it at my e-store, deliveries start 1/27, all proceeds to @NovakFoundation: http://t.co/Ir1hy8AVPT Haha, watch for my secret table tennis move I call “The Fantasma”: http://t.co/weCgwa13v6 @PeugeotAus Thanks for the support so far, #nolefam. Watch the final chapter of the #MadeBy films w/ @JacobsCreek: http://t.co/j0t0DjvD8G Hey #nolefam, have you joined #rallyforgood yet? Take a tennis pic / vid, @ friends &amp; use #rallyforgood #TennisCares: http://t.co/lNcvY5XPl0 RT @UniqloUSA: Let's go @DjokerNole! Cheer him on in Australia &amp; shop his gear: http://t.co/Il9HaTQNRp  #AusOpen #NoleFam http://t.co/CY6pA… I got some help training with this little #nolefam fan. What do you think of his moves https://t.co/S8ydnRYdSv http://t.co/PmPNqzjuBw #nolefam #rallyforgood RT @FCNovakDjokovic: My brother :) #rallyforgood #TennisCares @DjokerNole http://t.co/m76p79JGth @djokovicAUS very very busy but enjoying my time here RT @ForTheWin: Novak Djokovic gives candy to reporters at press conference - http://t.co/RJXqzRfw4a @NovakFanClub I love it! True #nolefam fans Jelena Gencic was my inspiration. Thank you @JacobsCreek for giving me the opportunity to tell this story in film: https://t.co/9fnfVvwXgA RT @adidastennis: Game, Set, #Barricade @DjokerNole. #AusOpen http://t.co/B9a6j8lKWt TV interview for #AUSOpen. http://t.co/IwxJMxbNNB Breathe in, breathe out, focus and be a #gameraiser: http://t.co/hhsFaGTWnR @head_tennis Determination. Focus. Spirit. #AUSOpen http://t.co/W1u5Dz1qaY Fair dinkum, I'm really not that great at speaking like an Australian, mates! haha see some of my #MadeBy bloopers: http://t.co/QPpdXR4WnZ RT @VirginieKardash: @DjokerNole LOL get it Novak! http://t.co/FdBCXBLyzj haha love #nolefam #ausopen memes RT @Love__Nole: Me when someone says \"you will not meet @DjokerNole\" http://t.co/2BxE1v9KvJ @milosraonic I like it @amdymurray haha it's funny make some funny meme pics and share with #nolefam #NOLEFAM #FF @nolemylove Sweet dreams. ;) Goooood morning Melbourne. It's #followfriday here so time for some #ff The first chapter of my @JacobsCreek #MadeBy films. Our home towns influence us, see how Belgrade shaped me: http://t.co/MJtI506vnA RT @bridgetdavoren: I joined #rallyforgood to support charity. I challenge troymbuntine http://t.co/FW3fgyP4uW RT @AustralianOpen: We can count the sleeps on one hand! Can you believe there’s only 5 days to go @DjokerNole? #ausopen http://t.co/IWXV0q… Srećna Nova godina mom #NoleFam-u kod kuće i onima u svetu koji slave danas :) #NoleFam! Help raise money for charity by sharing your shot w/ #rallyforgood &amp; tag your friends http://t.co/KpPegtvD5s @NourhanAttef @FCNovakDjokovic @djokovicAUS Sorry, did not see. Did you #DoTheNovak? @djokovicAUS Just a day ago, mate ;) Very great to meet the @Uniqlo_au team in Melbourne! Thank you for the gift! http://t.co/NBkbSr2QbG Haha #nolefam have you tried to #DoTheNovak? @PeugeotAUS #AusOpen http://t.co/6wAyLQq08a Keeping mind &amp; body strong. Love is one of the secret ingredients ;) http://t.co/XWHNWSpDBf Thank you #nolefam for all your kind words and holiday greetings. Hvala. Nothing beats this. Family time on Christmas eve. Srecno Badnje vece! http://t.co/ZLQUrF6fnz Larger than life 😁 http://t.co/xmmPlunUnP #QatarExxonMobilOpen Gala dinner with @rafaelnadal. @QatarTennis http://t.co/7NP2bS58sA RT @ANZ_AU: #AusOpen is close &amp; we’ve partnered w/ @djokernole to share some inspirational stories #YourGameYourWay #nolefam\nhttps://t.co/Z… Lots of great #nolefam fans in Abu Dhabi #mwtc http://t.co/Rp5747w3EC My #NoleFam, are you ready for the first #ff in this good year? :) RT @EurosportCom_TR: VİDEO | #Djokovic, #Wawrinka'yı yenerek finale yükseldi (@DjokerNole @stanwawrinka) http://t.co/QFDGztLxDc http://t.co… RT @MubadalaTennis: Can @andy_murray dislodge the #MWTC crown from @DjokerNole tomorrow? Find out from 7pm #inabudhabi Happy New Year everyone! I’m here in Abu Dhabi for #MWTC. Idemo 2015! http://t.co/8PHTv5lQmq Happy New Year everybody! Lots of love, health, happiness and success to all of you! http://t.co/JNCBPI9pGu RT @acmilan: Two Champions met in Dubai: @DjokerNole and Coach Inzaghi! #weareacmilan #DubaiFC http://t.co/lGTkBAwvCo Ready to go! Guys night out :) on our way to  @acmilan vs @realmadriden game :) http://t.co/hCzGtoLvrR Preparing for @mubadalatennis #MWTC. Interesting, right? http://t.co/MVMyrryNiQ I love this time of year. It's a very important time to relax and be with family. #nolefam, do you do anything special for your holiday? Still looking for a gift? Buy from my e-shop. All profits go to @NovakFoundation so it is like buying two gifts :) http://t.co/Ir1hy8AVPT RT @CaroWozniacki: “@HCharara17: @CaroWozniacki Who is the funniest tennis player on tour? #AskCaro” Novak Srećna slava svima koji danas slave Svetog Nikolu! I lep provod svima :) @sebdennisberon Yes for your #noleface The time has come to do some #NoleFam follows, don't you think? :) #followfriday RT @ITF_Tennis: . @DjokerNole and @serenawilliams headline list of 2014 ITF World Champions. Full story here http://t.co/I2ofVpQzNH Getting interviewed by @TheBorisBecker yesterday! #teamnovak http://t.co/EOopYXdjsL Photo from Delhi. What a great team. #UAERoyals @IPTL #idemo http://t.co/FVpvl5DYVY RT @iptl: 💚Dubai @DjokerNole @CaroWozniacki @OfficialGoran @nenadzim @KikiMladenovic @cilic_marin @JohnLaffnie @jazirim http://t.co/4w5UaP5… RT @CaroWozniacki: Decent company yesterday 😄 @Djokernole @theborisbecker #UAERoyals http://t.co/IHnD3VYWeC Bahnoff Strasse, in the beautiful center of Zurich. http://t.co/aCX7m0prET RT @head_tennis: Great day of filming with @djokernole #raindoesnotmatter #GAMERAISER http://t.co/jtHat4jlhR Look forward to starting 2015 at #MWTC in #AbuDhabi this January! Idemo! #abudhabi http://t.co/fu2dc1Q3d8 Good practice session yesterday with @filipkrajinovic http://t.co/U5TeMOHhOH If you watch #nole4u, I ask fans to use #nole4me. #Nolefam, I would love to hear from you - what are YOUR favorite movies, books and food? If you missed #nole4u, you can watch the recording now on Youtube: http://t.co/xBh2mq1Jfh Watch now: I am going to be answer fan questions live for #Nole4U - http://t.co/xBh2mq1Jfh Hi #nolefam, running a little bit late here, will let you know when I will go on. @TahiJadoon you can watch too, I just only have so much space for a tweet ;) Today is #Nole4U day! 7PM Europe/1PM NY/2AM China Watch me answer fan questions live on on Youtube: http://t.co/xBh2mq1Jfh . @niallofficial Congrats on the new #FOUR album bro. My fans love you &amp; are asking do you have a question for #Nole4U? #Nolefam, how should I pose? Another photo with @seikowatches: http://t.co/4oniMCKoOD Less blinking, ok. How about more winking? ;) http://t.co/WLRebw4shY Earlier today, getting ready for my photoshoot with @seikowatches: http://t.co/9jeZYxTb6x WOW, so many #nole4u questions. We have a lot to talk about tomorrow at 7PM Europe time (CET). One last chance to send something in :) Excited to announce to my #Nolefam my new partnership with @JacobsCreek. Check out the #MadeBy Film trailer http://t.co/4IJviCSPH3 Any more #nole4u questions #nolefam? http://t.co/jgVQwbmxJq My team will help me pick questions and I will answer them live on Wednesday :). #nole4u #nolefam Hello #nolefam. A lot of you have been asking &amp; I finally have some time to do it. Tweet your questions to #Nole4U. http://t.co/KXZO0LwkI8 1in3 women &amp; girls experience violence in their lifetime. http://t.co/YcOotFf2pO  #orangeurhood v @SayNO_UNiTE #EndViolenceAgainstWomen Have you seen my online store yet? Buy the gear I wear, all profits go to @novakfoundation: http://t.co/Ir1hy8AVPT http://t.co/Z9XLmu3FnT Sorry we made video last week, I forgot which one made it to final ;) Nice to meet #nolefam member @dani_stromquist, winner of the @PeugeotUK contest. She had a great question! #TheFlash  http://t.co/Qwm856c34U RT @sergey_bubka: @DjokerNole @ElguerroujHicha @pernillawiberg @TeglaLoroupe thanks for great time at Kids' Rights March @peaceandsport htt… I have a great new video. Special appearance by Pierre. Are you ready? Little guy showed me his work. So great to be a champion for peace w/ @peaceandsport today, Universal Children's Day http://t.co/clsp93qkMk RT @AS_Monaco: L’Academy aux côtés de @DjokerNole pour les droits de l’enfant =&gt; http://t.co/Ebc47lpsL9 http://t.co/CVclZZ1MR1 On my way to Place du Palais de Monaco! Starting the walk at 7pm #ChildrensDay @peaceandsport http://t.co/6DkisUGher Happy to take part in the @GvtMonaco Symbolic March for Children’s rights w/ @peaceandsport Join us today @ 7pm Place du Palais de Monaco! This year isn't over... ready for @iptl! http://t.co/JPojDaDDeI #idemo #UAERoyals RT @NiallOfficial: Great to watch my brother @DjokerNole win at the O2 arena tonight ! What an athlete ! http://t.co/anrPmTxPEG RT @jamesdrodriguez: Un placer haber conocido a un fenómeno del tenis. @DjokerNole profunda admiración. http://t.co/u4IePYcAUq Goool! Got to meet @jamesdrodriguez and some of the guys from @FCFSeleccionCol. #FCFFutsal http://t.co/uUHVPBcbvQ RT @thetimes: “I have learnt to gain inspiration from what happened” @DjokerNole in today’s @TimesMagazine http://t.co/OckIpYW1eS http://t.… This morning's motivational reading in @thetimes ;) http://t.co/042Rl1v1vt #1. Thank you all, especially my #nolefam. It has been a crazy and wonderful year. http://t.co/cfyavivShl @theyouthx Cześć! @JuanHeredia18 @meokee what is real? ;) @PatrickMcEnroe Thank you :) RT @ATPWorldTour: Congratulations @DjokerNole! Watch video tribute: http://t.co/v81FIZYpGc #atp http://t.co/GnQ3o82iEn RT @seikowatches: Check out the growing watch collection of @DjokerNole on Seiko Facebook!  http://t.co/VTq4rZqx7p My coach Marian kindly asked me to borrow some of my hair that I don't \"use\" anymore 😜 http://t.co/zTFcEjCvtU On the way to the @TheO2 Arena. \"The time has come.\" Idemo! http://t.co/QTQ36qHCfO @nale_nole soon @Nic_Leigh Don't do that :) @FCNovakDjokovic Trying to read tweets, there are a lot. Thank you #nolefam @TheMagician5GS @DaniSotocalde BELIEVE. Love my fans. #IDEMOOO @DaniSotocalde Hola @KargovaLara Just what I happen to see when I have time in between practice Lara, thank you for your support @aaenaaa @novakfoundation Thank you for the interest Ana Selfie RT @tomasberdych: Championfie @rogerfederer @keinishikori @cilic_marin @andy_murray @stanwawrinka @milosraonic http://t.co/yMocrCAu9J RT @TheO2: They've arrived!! @andy_murray @DjokerNole atpworldtour's video http://t.co/9k6jicbVI2 RT @PeugeotUK: Win tickets to his match &amp; a meet &amp; greet with @DjokerNole - T&amp;C's here &gt; http://t.co/X4KZX6fWnp http://t.co/JImmnXdUkD RT @seikowatches: Seiko is honored to share the news: The Grand Seiko Hi-Beat 36000 GMT receives the \"Petite Aiguille\" award at the... http… . @DavidLuiz_4 It was an honor to have you there! Wow #Nolefam, today’s victory makes 600 career wins. No way I could get here without you! HVALA! http://t.co/kJ87bULvqI RT @adidastennis: Congrats to @DjokerNole, the 2014 @bnppmasters champion! http://t.co/Caj4rM3M6A RT @Peugeot: Congrats to @DjokerNole our brand ambassador for his victory at the @bnppmasters #BNPPM2014 ! http://t.co/0WaJc5sjHW Streeeeetch. http://t.co/0f6Q9Sn4P9 Allez Allez! Idemo! Finals, let's go! http://t.co/qnoHRYdYo5 RT @Sport_360: Look, @CaroWozniacki and @DjokerNole already synchronised ahead of @UAERoyals appearance for ITPL. A winning team? http://t.… Practice this morning. http://t.co/282CYuWevM RT @BBCSport: Novak Djokovic: “\"I feel like I'm already number one becoming a father last week\" http://t.co/jJsgNaXv52 http://t.co/rl4C6Bo1… RT @bnppmasters: Having his own parents here felt like a \"rare, special occasion,\" @DjokerNole told reporters in mixed zone #BNPPM http://t… @Kohlscribbler @bnppmasters great game, thank you! Got some great advice on being a new dad and some gifts for baby Stefan from the @fftennis guys! http://t.co/PVEWvJ0gFO Just about a month for the league to start. Looking forward to play with all the other @uaeroyals and take the best of the @iptl In Paris getting ready for @bnppmasters. The stakes are very high here for everyone, but I'm ready to do my best. http://t.co/mKhGPGRCAc RT @Peugeot: Congratulations @DjokerNole and welcome Stefan :) A special Peugeot is waiting for you! #TeamDjoko #Djokovic http://t.co/pzaAz… First practice as a dad. Not a bad hit for an old man. http://t.co/joOuGpGjYk Stefan, our baby angel was born! I am so proud of my beautiful wife Jelena! Thank you so much for your love and support. We love you all!!! Another great year in China! This is thank all of my very supportive #nolefam fans there and around the world: http://t.co/GXyPNPoBUU \"Earth provides enough to satisfy every man's need, but not every man's greed\" #quoteoftheday http://t.co/5E2qMl0dKe RT @JelenaRisticNDF: #Ideeemooo We are watching :) @DjokerNole #pierre #ShanghaiMasters #teamdjokovic #ajde #NoleFam http://t.co/zLWFgFlDrE Haha, does anyone understand this exercise? Training video from before coming to China: http://t.co/YRtYfZZxlv RT @FBaresi: MilanGlorie #Shanghai con @DjokerNole http://t.co/FQiT6LcEzu RT @ByJoeFleming: Djokovic was a winner today, 6-3, 4-6, 6-4 vs. Kukushkin (EPA) http://t.co/YmPEhWTwoy The guys of @ACmilan came show support today, thank you @fbaresi &amp; @jksheva7 http://t.co/gTHTp3Obcy I got to meet Yao Ming today. Very big guy ;) http://t.co/rnCGm4Rp5k Check out my new e-shop, where you can buy my official merchandise &amp; support the @NovakFoundation http://t.co/MzDmQCIOKh Great to meet all these young fans in Shanghai yesterday with #UNIQLO http://t.co/D8Ag0cGqla RT @head_tennis: @DjokerNole captures fifth title at #China Open with a 6-0, 6-2 win over fellow HEAD player @tomasberdych. Congrats! http:… RT @Peugeot: Congrats to @DjokerNole, our brand ambassador, for his great victory at the #ChinaOpen in Beijing.\n© AFP http://t.co/INt4lRjhoJ So #excited to share some really #GoodNews with you :) Read my blog on http://t.co/3wM8QA3Hkj #NDF #EShop We arrived very late in Shanghai (at 3am) and these wonderful young people were waiting to welcome me. I am going to… http://t.co/EdPtmpAEvl RT @ChinaOpen: Congrats to @DjokerNole winning your 5th #ChinaOpen title! 24 wins in a row and never lose a match here! How amazing! http:/… RT @adidastennis: Standing tall. @ChinaOpen title owned. Congrats @DjokerNole. http://t.co/us73edSerZ Another great year at the #ChinaOpen, you give me all your love &amp; I give you my best. Thank you for 1 more great year http://t.co/tPSaNe4hc5 Very efficient way of drying the court here in China :-)))) http://t.co/lYtcAdVRPv 22. http://t.co/QRute3dQkU Flying on the blue court. Happy to be back in Beijing. http://t.co/ftpoLUHYSy RT @BBCSport: .@DjokerNole beats Canada's Vasek Pospisil to claim his 21st consecutive win at the China Open http://t.co/WEHGNL4nrD http://… My Chinese fans are so good to me - always there to greet me back at the hotel :) http://t.co/MvyIaCf1wV @CrazyDiSki   Srecno! Budi vredna, uporna i bez odustajanja :) @aaenaaa Nope. I know they are :) #Nolefam @SladjaR hi Sladja ;) @Timothy_Nole   Yes, very much so. Will see them soon! @danimalek1   Yes, very excited! @Johnnyweaver   It’s not so unusual &amp; it’s good that you found out. There are plenty of good foods you can prepare for her #ServeToWin @aaenaaa It's product of consistency &amp; hard work &amp; it means a lot @ohmynole_   Check out my twitter description ;) (Laugh as long as you breathe…) @Citlayeli hold on, let me try. Pronto, espero. Did I get that right? @BasiaNF   Oh yes, very lucky! @MHmarcoheuerman   No she is back home getting ready for the baby to come. RT @ATPWorldTour: .@DjokerNole ready for fight to the finish in battle for year-end No. 1. http://t.co/QkZUjlBCKf #ATP #tennis http://t.co/… @djokovicAUS   Yes! Always a pleasure coming back to Melbourne and playing at the Rod Laver Arena! @agosfitti   Hopefully soon!! I had great time in Argentina. @suvonafarm   It’s not easy. I take a deep breath and focus on the ball. @djokovicAUS I had you saved, don't worry ;) @itsMileyAndNole   Ah, tough one, there are many I like… not sure which one to choose @alyssadjokovic   In my book #ServeToWin you can find out what I like to eat :) RT @ATPWorldTour: .@DjokerNole @RafaelNadal &amp; co. all class at China Open Players' Party. View gallery: http://t.co/Tlfhy9CsmW #atp http://… I promised you I would answer some questions the other day…will be answering some I saved now… Wooow, so many questions. I will try answering some of them later. Stay tuned. ;) Doing some interviews in Beijing before the #ChinaOpen. Any questions? http://t.co/wfQMGFRVDb My book Serve To Win is now available in China. These lucky #nolefam fans got their copy signed :) http://t.co/q80cBB4tV6 These young tennis players made me a cake - very honored to be part of the Dongfeng Peugeot Future Master. http://t.co/MbPeHivd0q Wishing the @BGFilharmonija luck on their historical debut at @CarnegieHall for their U.S. tour. Way to go! http://t.co/vgXoLIFpX6 RT @SRB_Nole: Still the pics at Beijing airport;) @JelenaRisticNDF @DjokerNole is so charming when he is signing😍❤️ http://t.co/qj2J5zTSlD Here are some more of my amazing #nolefam fans in Beijing: http://t.co/HIR6vUAgqb Thank you to all of my #nolefam for waiting for me to arrive in Beijing! Ready to defend the title at the #ChinaOpen: http://t.co/xaEXXUa8bu On my way to Beijing! See you soon! #NoleFam #China http://t.co/egqkmq27gv @Tanis95 Idemo! One of the best serves in the world, @milosraonic. #balkanboys http://t.co/OXgiaKBaho Great practicing with @GrigorDimitrov. See you again soon! http://t.co/nEJ45TA8Zp So glad to have the support of these guys every day as part of Team Novak. Getting ready for the #ChinaOpen. http://t.co/ojVYw5Va5v Daaaaaaaaaaaaaaaaaaaaaaaaaaa Finaleeeeeee! Yesssssssssssssss! Wow! What a game! Bravo mooomciiiiii Kakva odbrana,kakve kontre,kakva hrabrost! Bravo momci.. Teo,ljubim te u ruku! Raduljica sa osmehom! Uzivanje je gledati ih Supporting  Serbia tonight against France for place in the Finals of World Basketball Championships. Puna podrska kosarkasima veceras! Idemo Congrats to my DC teammates @Dutzee #F.Krajinovic for winning their singles matches today. Let's go @nenadzim #bozoljac tomorrow 👋 RT @seikowatches: If you are visiting Belgrade, please say hello to Novak Djokovic in the arrival hall!! http://t.co/u86pwlPrhs Finally, here is my #SmashTheSilence film :) https://t.co/MQHw1w8LvA What do you think #nolefam? Bravo za nase kosarkase za ulazak u polufinale! idemoooo Congrats to @cilic_marin for incredible success at US Open! Well done! Svaka cast sefe! I'm back home, recharging my batteries. Wasn't meant to be for me this year at US Open. Thx for ur love &amp; support! Just got the next cut of my #SmashtheSilence film. Have a watch... let me know if your see yourself in it! http://t.co/Mxj0eyMYI4 http://t.co/QVaCrJiJMq RT @AAlasfoor10: Here we start again... @DjokerNole I'm being attacked by Federer fans. Help? Working the core muscles earlier today. Training for tomorrow, and Monday, hopefully ;) http://t.co/RzgZGOisVj Getting serious now… Show me your #NoleFace pose for the chance to feature in my @adidastennis #SmashtheSilence film. http://t.co/L8Qa4yyxlp Semi-finals! Idemo! http://t.co/nSbTVPTF0h RT @UniqloUSA: #Uniqlo ambassadors @keinishikori &amp; @DjokerNole will battle it out in the #USOpen semi-final! One will win, but both will be… RT @peugeotarg: #TENIS - @DjokerNole alcanza las semifinales del @usopen por octavo año consecutivo. http://t.co/P670siGz2u Thank you to my good friend @andy_murray for a great match last night...see you at the next one. #usopen http://t.co/cmbuY6wH0n RT @adidastennis: Watch the second #SmashtheSilence video with @DjokerNole featuring #NoleFam! Did you make the cut?\nhttps://t.co/bN99U0hNvj Haha this one is funny, I love this!\nhttps://t.co/WmiIff6Fjb RT @philippelafon: @DjokerNole Remember doing this back in Roland Garros 2008 in my photo booth? #SmashtheSilence #luckycameraman ;) http:/… Yum... kind of. Copy the pose and share your shot for the chance to be in my film! #SmashtheSilence http://t.co/TRXn37r05o RT @adidastennis: Take a bite and strike a pose. Share your selfie to be part of @DjokerNole's film masterpiece! #SmashtheSilence http://t.… @MiljanNOLE @adidastennis just needs a bit more emotion ;) RT @MiljanNOLE: @DjokerNole do you like my photo for new round of #SmashtheSilence? I really hope that you do! @adidastennis http://t.co/m8… RT @andyroddick: 22 straight quarterfinals at slams for @DjokerNole .... What he's done the last 5 years is insanely impressive @amarillium great after today :) Hard work and focus gave me another victory today. #Nolefam, how are you? http://t.co/pgmN3GjlN3 This is for Zia, my little music prodigy :) https://t.co/N73oqA9iaR #Nolefam! I have been looking through all your #SmashTheSilence photos and have started to pick some. Watch this: http://t.co/nEyGTQ9md1 RT @djokerslove: @adidastennis @DjokerNole and if instead of one, EVERYBODY? ❤️😍 hope you like my work! http://t.co/L83T78nZKv @djokerslove wow! very nice! I love it! RT @usopen: 2011 #usopen champion @DjokerNole makes it eight straight years in the rd of 16 at the #usopen. @MBUSA http://t.co/WjdlK59hxZ This was difficult! I had to ask 15 questions as fast as possible. At least I beat @andy_murray. #usopen http://t.co/ESq5uik0H6 Big love today. Challenge for my #NoleFam– copy the pose for your chance to feature in my film! #SmashtheSilence http://t.co/QxXnch9mxj Proud to support @head_tennis and @RED in this good cause to battle AIDS: http://t.co/ksu8fGa0No http://t.co/boUAS0uHRV RT @novakfoundation: #NDF donated around EUR 68,000 for the reconstruction of Bosko Buha, children's theatre http://t.co/9RxDS48sGf #GoodNe… @NiallOfficial will you help me #SmashTheSilence and hold up a #NoleFam sign? ;) Thank you for the ❤'s @sanja_nole #SmashTheSilence #nolefam\nhttps://t.co/7Y6Id4FPm3 Nice RT @DiogoCatelas: @DjokerNole let's go, Nole! #4NoleFam #NoleFam #SmashtheSilence http://t.co/Oy7n5ZuB0K Wow, look at that wall. A true #nolefam fan. Thank you @championnole #SmashTheSilence https://t.co/aa6OtJkdbm So many great #NoleFam posts! Keep them coming! #SmashTheSilence RT @NovakFanClub: .@DjokerNole The silence you must smash young Padawan! #4Nolefam #SmashtheSilence http://t.co/WEudNezuiK Show me our #NoleFam sign for the chance to be in my film! #SmashtheSilence http://t.co/z2l2KURDo2 @Jude_Nachabe I'm seeing lots of good ones! RT @NovakIndiaFans: .@DjokerNole watches himself dance in an interview after the match: http://t.co/H4DWcz2JZb RT @rolandgarros: #USOpen A very happy @DjokerNole after his 2d round win against @Paulomathieu 61 63 60 @usopen #NoTimeToLose http://t.co/… This one is good too! Bright colors – great way to #SmashTheSilence @Sofina_meow. https://t.co/CAVydCwfgc RT @usopen: .@DjokerNole has stellar defense. Why? Find out here &amp; see for yourself at the #usopen: http://t.co/SNUCEsfIFG  http://t.co/OtW… Doubles! @AnthoulaFlegka #SmashTheSilence https://t.co/DbekJVbRe5 This one's nice @FCNovakDjokovic, I like how you got into tennis gear! @adidastennis #SmashTheSilence https://t.co/g8pbHtbpmy This is a good one @AAlasfoor10! Good effort making it to the court. @adidastennis #SmashTheSilence https://t.co/vKqFaVmUcc RT @usopen: #Djokovic \"I enjoy pressure because it brings meaning to what I do.\" #usopen #nightshift http://t.co/tDfBkIn4gS http://t.co/7tk… You can call me Director Novak. Now, it's time to #SmashtheSilence with me! http://t.co/164qBS19wM Few seconds from my practice today :) #video Getting ready for the #USopen #nolefam https://t.co/Nca1rz0ar1 I had a lot of fun on Thursday with @EdwardNorton &amp; @HLundqvist30! #nolefam, who do I remind you of? ;) http://t.co/4IVwMPy1M1 RT @adidastennis: Ready to #SmashtheSilence with @DjokerNole during the #USOpen? Watch the video and see how you can make some noise!\nhttps… Excited to play against @EdwardNorton, @HLundqvist30, Johnny Mac &amp; @noahrubin33 tonight! What a great warm up for the #USOpen. #JMTA RT @seikowatches: RT @iWMagazine @seikowatches and @DjokerNole celebrating the opening of the #SEIKO NYC boutique last night! http://t.co/q… Congratulations to our @VelStjepanovic #EuropeanChampion #TimSrbija http://t.co/FAbcpSR8IP http://t.co/MiZqAz7Yfj Friendly reminder - @ConchitaWurst, Mr.Bean and @Jumpman23 you have been nominated for the #ALSIceBucketChallenge ;) Did you see me on @Letterman last night? Watch a part of it here: http://t.co/0VbbWKglzv http://t.co/iP2eH83uBq RT @Letterman: Tonight! All-new Dave with @hitRECordJoe (#SinCityADameToKillFor), tennis great @DjokerNole and @MusicRobby. http://t.co/eii… Proud to be part of #ALSIceBucketChallenge. I donated as well. I challenge you @ConchitaWurst, Mr. Bean &amp; @jumpman23! http://t.co/JlZtcUG3Tk Johnny Mac, @niallofficial, Bernard &amp; @sabinelisicki thank you for nominating me for #ALSIceBucketChallenge ACCEPTED: http://t.co/kIyIuTE7wi Met some of you #nolefam's yesterday. Autograph for a smile, hehe I think this exchange was in my favor. http://t.co/3YEphbnS9Q . @EdwardNorton looking forward to our match! Counting on @HLundqvist30's reflexes to carry us vs you &amp; Johnny Mac. http://t.co/9zy7tmljS0 Cincinnati #nolefam, I am here! http://t.co/FkbLHVghKN Getting ready for tonight's doubles match in Toronto .We were suppose to play 4 h ago,but rain has other plans for us http://t.co/NQqMfaG7ea Do we have @onedirection fans in our #nolefam crew? I got to practice with @niallofficial this weekend ;) #1DNews http://t.co/hKX7bkz2fg @NickKyrgios I think so too.. Well,they loved you even more when you gave kids your racket. Good staff ;-) @NickKyrgios Good hit today bro.. U were firing those serves well! Save some power for tourney ;-) \"@stanwawrinka: Tomorrow not before 5pm doubles with @DjokerNole !! @rogerscupto http://t.co/BO0sV4eLUh\" Yessss! Let's goo Stanimal :-) @NiallOfficial Now you will not lose any  tennis matches against your buddies. So,don't worry about those \"bets\" you told me about :) @NiallOfficial NO NO man.. you were great! Honestly! You only played 3h of tennis in your life and you haven't missed many balls.. Great experience tonight in Toronto. Admiring the performance of my bro @NiallOfficial #Onedirection http://t.co/Rg2BcuUtTn I was offered \"treats\"when i arrived to Toronto by tournament director. Had to refuse,but it was a nice gesture :-) http://t.co/iNXmXT49jw \"@fabiofogna: Uomo sposato... Uomo fortunato??! @DjokerNole http://t.co/gPmNiEDs2K\" Molto fortunato! Hahaha :-) Me and @DjokoMare doing uphill sprints... #Monaco #workout http://t.co/JLbxbSXcc6 Riding uphill with my team support at the back :) @Peugeot http://t.co/D8i7OqBaAj My little friend Clement is growing into a champion. I've been following his career for couple of years now and he i… http://t.co/5Bc8CqcqX0 Crvena Jabuka - Svidja mi se ova stvar http://t.co/WRaNhRFWtl via @youtube Suncano jutro uz veselu pesmu Jabuke sa mojim ljubavima.. Congratulations to our golden guys! Great victory. Bravo @WaterpoloSerbia new European champions!!!! #vaterpolo http://t.co/pW7qEbul5v Serbia is European #waterpolo finalist! Go @WaterpoloSerbia team! Cheering for you guys tonight! #ideemoo #proud The story behind my #Wimbledon win on @cnni with @TheRealPatCash and @Petra_Kvitova :) http://t.co/GUTJ1SafM7 Back to the office after a short break. Feels good! #Belgrade #NoleFam http://t.co/QgXdJfYKHj Good morning from Mrs Djokovic and myself :) Thank you for all the wonderful wishes #NoleFam #Happy #Belgrade http://t.co/I4HyWkXfce 5 million fans on my Facebook page, WOW! Thank you for your support #5Mnolefams https://t.co/jb1VzTCpwi What is just happening here? WOW! http://t.co/S7HoLtOR5P RT @seikowatches: Many congratulations to Novak Djokovic on his win at Wimbledon! We are delighted for him and his team and are... http://t… RT @Peugeot: Congrats to @DjokerNole for his victory! Really proud of our brand ambassador #TeamDjokovic! http://t.co/3y28CvK87x My precious little family :) #WimbledonChampion #Love http://t.co/GS2bPubrdL #TeamDjokovic together going to the Champions dinner @Wimbledon #NoleFam @TheBorisBecker missing #MarianVajda http://t.co/rtEwotjqO4 More LOVE from the foooooood :-) http://t.co/mWaIgqxQ7O Dorucak pun ljubavi od brata Marka :-) Breakfast full of love prepared by brother Marko http://t.co/7bbohgZtdy Come oooooonnnnn!!!! Bravo Grci!!!! #GRE #WorldCup2014 http://t.co/pdGPhz1zmH έλα Ελλάδα!!! #Greece #WorldCup2014 You know who i'm cheering for? :) #WorldCup2014 http://t.co/HAHUa2s3uo Warm up time! @Wimbledon http://t.co/RQIWuT4s8i Ready? It's time! @Wimbledon @seikowatches @UNIQLO_UK #pierre #tesla #London http://t.co/JcJNNt7OvY Two days to go... #Wimbledon2014 @TheBorisBecker http://t.co/pcOpsrT7Hg Good practice today with @MilosRaonic @wimbledon #London #NoleFam http://t.co/0HlnK635Au I was today at the press conference of UNIQLO and  ITF. They signed a 3y Agreement for Title Sponsorship of the Whee… http://t.co/euNa36gmcn Happy Birthday my love! Family time in park #happy #Wimbledon2014 @JelenaRisticNDF http://t.co/Fcvgkua5Uo Watching the #WorldCup2014 ARG vs Bosnia tonight :) #NoleFam http://t.co/zHrnM8VyoN Grassss courts with legend of Wimbledon MR. BB :-) Enjoyed hitting few volleys with the man himself.@TheBorisBecker http://t.co/ZNojp4ClzU My dear #nolefam, thank you all for your support and the love you shared with me after the finals. There will be so … http://t.co/qziLXwnGAb What's his next move? ;) #NoleFam @TheBorisBecker http://t.co/HCGW3G14sZ Look who's going to training with me :) #RG14 @rolandgarros @PeugeotFR #NoleFam http://t.co/SYbP3lkxo7 After tennis practice today,played some #petanque with kind French gentleman that let me play with them :-) http://t.co/y01INZz0kj RT @JelenaRisticNDF: Call for #HELP on @rolandgarros Kids Day #SupportSerbia #SupportBosnia #SupportCroatia @novakfoundation http://t.co/EG… . @novakfoundation raises funds for Serbia and on our website and blog you can see ways to support Bosnia and Croatia. Thank you!!! Bonjour Paris!Today is Kids Day at @rolandgarros Let's unite and raise funds for children! see you at 15:45 https://t.co/3oVc5eL1Si \"@MiljanNOLE: Učenici OŠ \"Banović Strahinja\" za Novaka Đokovića @DjokerNole ♥ \nhttps://t.co/dEEFfY89fu\" Jedno veliko HVALA! Volim vas puno @veceivan Ivane,kako se poziva broj 0905-700-705 iz inostranstva sa mobilnog? Pokusavam da vas dobijem,ali ne ide :-) Pomozite.. RT @KevinSpacey: I want to recognize those impacted by the #SerbianFloods and efforts of @DjokerNole. May all affected get the support they… @KevinSpacey @setoo9 Thank you very much,guys @RafaelNadal Gracias Amigo!! RT @RafaelNadal: Increíble tu ayuda @DjokerNole en Serbia y Bosnia. Mi apoyo y cariño a las víctimas por las terribles inundaciones. http:/… Arrived for my first practice @rolandgarros #Paris #RG2014 #NoleFam http://t.co/IpEjjidxdr RT @JelenaRisticNDF: 3 days of mourning for people who lost their lives in Serbia during floods start today. 3 dana zalosti u Srb od danas.… RT @poplave2014: U Niš sleteo još jedan ruski avion! Dostavljeno 28 tona hrane,velika količina šećera, vreće za spavanje, šatori i još jeda… Ziveli svi narodi bivse Jugoslavije. Neka je Bog uz vas.. http://t.co/HkgVOCqIGv Takodje vidim da je i istok Hrvatske pogodjen poplavama..Iskreno se nadam da vas nece pogoditi u onoj meri koliko Srbiju I Bosnu. Cuvajte se Srce mi se cepa kada vidim koliko ljudi je evakuisano I ugrozeno u Bosni! Preko 950.000!!! Izdrzite Braco.. Pomoc ce stizati iz sveta @livingfor_Nole You can donate to NDF. Thank you all so much for your support and compassion. Serbia,Bosnia,Croatia are suffering very much RT @AmerDelic: Please use this link for donations to #HelpBosnia recover from the floods. Anything helps! Hvala!  http://t.co/O91nYNroqP RT @SavaJanjic: Two helicopters from #Belarus arrived to #Serbia with humanitarian aid. #SerbiaFloods Thank you Belarus! http://t.co/jhqBEI… RT @unicefsrbija: Ana Ivanović se priključila akciji za pomoć ugroženima u poplavama http://t.co/v6ifbCrgOg http://t.co/ffZVnSquz0 \"@HausOfNovak: The United Arab Emirates will donate $10 Million to Serbia. شكرا لك #SerbiaFloods\"Thank you sooooo much. Shukran RT @TipsarevicJanko: 3 pm…#tipsarevictennisacademy #KarakasevicvsTroicki #Poplave2014 RT @paugasol: My most sincere support to the families of the deceased and everyone affected by the worst floods in decades. #SerbiaFloods #… RT @OKarisik: RT RT RT 16:55 HITNA KOMPLETNA EVAKUACIJA OBRENOVCA. IDE TALAS IZ ZABREŽJA! #poplave #obrenovac RT @novakfoundation: #UPDATE If you wish, you can donate money to #NDF paypall for reconstruction of floodes schools &amp; kindergartens http:/… RT @novakfoundation: UPDATE: Ways you can help in Serbia and Bosnia with donations for the victims http://t.co/pJenWGkQZe #SerbiaFloods RT @poplave2014: Pozivaju se svi radnici,stanovnici,pre svega Kostolca,Požarevca i okolnih mesta da se u što kraćem roku jave na nasipe - O… \"@bubasport: #poplava #poplave #Poplave2014 #SerbiaFloods #Serbia #SerbiaNeedsHelp http://t.co/YFPolE62Ns\" :-((((( \"@BiboksBoban: Pekara iz Svilajnca \"Mali Milos\" bagerom razvozi besplatan hleb ugrozenim sugradjanima. Svaka cast\n! http://t.co/EmcnkKYlyO\" \"@nenadzim: Podrška svima!! Pomozimo ugroženima!! Uključite se u akciju prikupljanja pomoći!!\n@DjokerNole http://t.co/1XvMyJJzmn\"POMOZITE RT @JelenaRisticNDF: Republika Srpska broj za donaciju... #pomoc #BosniaFloods http://t.co/FxNRcI6ZK9 RT @keselj11: Serbia is facing huge floods!People are in life danger!Many cities are under water! #PrayForSerbia #SerbiaFloods http://t.co/… RT @gogitesic: ALARMANTNO: Deca sama satima čekaju pomoć u Obrenovcu, voda prodire u vrtić! http://t.co/RNp8d0j5cA RT @TSSRBIJE: Janko Tipsarevic i Viktor Troicki posetili evakuisane iz poplavljenih područja i uručili pomoć #poplave #FloodSerbia http://t… RT @IvanJov0: @VladoGeorgiev @veceivan @zaklina_prva Molim vas za rt .. http://t.co/MT3iHIFqEX RT @JelenaRisticNDF: #HelpSerbia “@SvetPlus: please help share this, it's really critical, the whole Serbia is flooded #SerbiaFloods http:/… Support and solidarity for my people in Serbia! Pls RT #serbiafloods #unite #poplave http://t.co/llxr1EpXQL Did a little \"clap\" before the start of interview for @TennisEurosport. Always pleasure talking to Barbara http://t.co/k5WRbrjsUf Always enjoyed being part of Kids Day in Rome tournament. Oggi iniziamo torneo con partita contro Stepanek.Forza :-) http://t.co/zgjDZA0WjG Another beautiful day and great practice in Rome with @stanwawrinka Grazie mille ancora http://t.co/1O5a89fgB8 My first practice in Rome yesterday afternoon... Bella Roma! #NoleFam http://t.co/QjweDjjDja Incredible atmosphere on first practice in Roma. Grazie a tutti tifosi per vostro appoggio. Ti Amo Roma. http://t.co/h6fUIR9x8K Rome here I come! Fitness session on the beautiful Stade Louise 2. Vezbanje sa atleticarima #motivacija :-) http://t.co/k01mbX2tx4 Thank you all sooo much for the compliments. We love you and can't wait to see \"little one\" soon! Hvala vam svima na podrsci I cestitkama Happy #NoleFam's day everybody! Love you and thank you for the support! Happy Bday to my dad as well :-) 53rd http://t.co/cGn575HBpP Jelena is pregnant!!!We will be parents soon! #blessed Postacemo roditelji uskoro!!! #najsrecniji @JelenaRisticNDF http://t.co/8WG1hocGIk Hello my friends! I am in good hands, recovering and enjoying beautiful Athens #Acropolis #NoleFam @JelenaRisticNDF http://t.co/KD9LwgPcJ0 \"@Alis0n_V: Take care @DjokerNole ! Here, there is few words for you written by myself :-) Love from France &amp;lt;3 http://t.co/5S5fL2SLZT\" RT @danimalek1: @DjokerNole http://t.co/bLqJrIZcBa Happy Easter #NoleFam ! Hristos Vaskrese! Thank you for your love&amp;support! Hvala puno na podrsci! http://t.co/42G3637g9d @FALCAO      Eres tu un genio total,Tigre! Un placer.. I wish you good and fast recovery! http://t.co/t2ZMPbuotK RT @JelenaRisticNDF: We raised &gt;3000€ on tonight's auction of beautiful Easter eggs!We are very happy @DjokerNole @novakfoundation http://t… Great hit with #Chila and nice pic with coaches-legends :-) http://t.co/hoJ2Zif1Pg @annastasijai Its beautiful. Thank you.. I will do some visualization of this photo for this year as well ;-) http://t.co/ENxBHfdRCz Going through some old photos.. found this one :-) Pronasao sam ovu sliku na iz arhive sa Kopaonika.. http://t.co/HD2IFIfNMZ Fitness training with Viktor and @Dutzee Lajovic yesterday #NoleFam http://t.co/syhqtMrcoc Stretching with Clement(future champ). Very important from early age. Istezanje sa buducim sampionom.Veoma bitno http://t.co/kNYNVtYyUk RT @championnole: @DjokerNole one of the best books i've ever read! i recommended it to my whole cooking class! :) http://t.co/8pD41aUreJ Of course it does! “@peterbradshaw: @DjokerNole Does digital version count? :) http://t.co/2bYU4fSOXH” RT @MarcSphera: @DjokerNole In Spanish for to improve my physical condition. Fantástico. http://t.co/GkrkzzhjOH RT @NovakFanClub: #NolefamDay April 25, a day to celebrate our family :) http://t.co/5fFtMa0yL3 👍 to u&amp; dad!“@DjokerFansARG: el mejor libro del mundo! My dad and I follow the 14 gluten free day diet every day :) http://t.co/qUgy2TZ5OJ” @rissy_luv thanks a lot! That's nice of you :) @JeanAngel25 yep, you have it on amazon ;) Hvala! @Milos_Nole: Najbolja knjiga koju sam pročitao.@DjokerNole ponosan sam na tebe.Hvala ti na svim savetima ♥ http://t.co/7cNc37bx37” RT @TanjaKudra: @DjokerNole Knjiga koja se čita višee puta i koja nikada neće da dosadi :) http://t.co/nKhDOUIiiy Hi there! @aaenaaa:  Here I am with your book and a poster of you, Nole :) http://t.co/XHX4q2ZkTl” @standardmen1989 coming out soon also in French! :) “@GermanNoleFan: I read in English and got my version for Christmas! See? loved it! You're my truly inspiration http://t.co/SKD4cEMFZH” Thanks! “@annastasijai: I have read it for a couple of times :) I have it in Macedonian and Serbian :) I love it &lt;3 http://t.co/KJIy449LTz” Well done my friend! ;) “@AAlasfoor10: @DjokerNole first book that I finish reading in 5 days ;) http://t.co/CoUf8CyORf” Thank you! “@FCNovakDjokovic: @DjokerNole my favorite book in the world! Look how happy I was when it arrived ;D http://t.co/LURW9lRgoo” This is my book #ServeToWin in many different languages... Did you read it? :) #proud #NoleFam #glutenfree http://t.co/7ufC4ROgPl Very proud of this campaign that @novakfoundation made. Share the love for sports &amp; fair play worldwide. Pls RT http://t.co/Kxnk26exlE RT @novakfoundation: Pogledajte ovaj zanimljivi VIDEO spot koji smo napravili za vas http://t.co/KTtkhkTvO2. #April6 Međunarodni dan sporta… RT @novakfoundation: Check out this great VIDEO we've made for u http://t.co/KTtkhkTvO2 #April6 is International Day of Sport for Developme… Happy International Day of sport for peace and development!We raised white flag as a symbol of peace #JoinUs http://t.co/492wto1W2R Yoga family time :) #Monaco http://t.co/WoLRAmoxsp Interesting day with commercial shoot for @Peugeot in Beaulieu Sur Mer. French Riviera is sooo beautiful! http://t.co/EOLSpxbMz4 It has been incredible 4 weeks in USA! Thank you all for the support. Back home-recovery time :-)  #nolefam #proud http://t.co/HZ4UxxfPjU Good hit today with Wayne Odesnik. Looking forward to a great day tomorrow :-) Idemo http://t.co/DdGlqmJHeI Beautiful sunset in Miami! Enjoying the last day hours on the beach.. Thanks for the support guys! Love you.. http://t.co/yN8Fi7eVHR Rat nikom dobro nije doneo. Mrznja takodje. Samo mnogo nevinih zrtava. Neka se nikad ne ponovi. Da zivimo u slozi i ljubavi i miru. On this day 15y ago i 1st experienced fear of war. Powerful weapon that destroys the most sacred unity-family. Never to happen to anyone. Great to start in Miami with W! No match tomorrow as Mayer forfeits. Used some free time me to watch Basketball #heat http://t.co/oIktTFzjrg Played golf today with my team and Viktor and we met one of the \"locals\" on the hole #4 :-) He loves the sand.. http://t.co/lhLiXKGlzn My first haircut of the day. Who dares to be the next?Edoardo didn't mind :) Ooops, he has no hair left :) #HappyDay http://t.co/XkchrYwwhh Watching very inspiring tennis story of Conner Stroud. My big respect to this young man and his parents. @TennisChannel Thank you for making it happen,Jim @JimY123 Visited Google few days ago in San Francisco.Amazing experience.. Played tennis with this Google Glass. Futuristic :) http://t.co/IgAAH3wo0A Sa dva prijatelja u LA-u na projekciji filma Montevideo.Fantasticna ekipa iz filma koji zasluzuje svetsku paznju. http://t.co/ZFjGLFk6op RT @Laliborsieri: OMG this is SO FUNNY. Nole please CHECK THIS OUT @DjokerNole #ElasticMan 😂😂😂😂😂😂 #NoleFam #HumorEnArgentina http://t.co/0j… \"@RosyKall: #LepeVesti @JelenaRisticNDF (VIDEO) | Telegraf – Najnovije vesti http://t.co/vWmxeAqpQy via @telegrafrs\" Zaplakao sam. Prelepo:) Cestitke Ivani Spanovic na bronzi na Svetskom Prvenstvu. Kraljica sportova se vraca na velika vrata u srpskom sportu. Idemo \"@RebelWilson: Thanks @DjokerNole x crushed it!! http://t.co/sXY9UuvC6E\" It was my pleasure Rebel! RT @stanwawrinka: Great fun playing with @KevinSpacey against Will Ferrell &amp; @DjokerNole in Pro final for @CFCcharity !! http://t.co/H1Uwj4… Kind a cute,right? :-) #bnpparibasshowdown. NYC-MSG.. love it! http://t.co/KCIM44H4FA Morning jog in Central Park NYC. Perfect start of the day. But freeeeeeeeezing :-) http://t.co/qIjyxfLWIS \"I believe I can fly\" haha :) #skydive #Dubai http://t.co/mLlYpXr8CF Doing variety of sports to be in good shape. #NoleFam #Dubai http://t.co/ToB5CThtsh Great first practice in Dubai. Feels good to be back :) #NoleFam http://t.co/81owte5XDF Of course,Gluten Free and Home made jam-sugar free :-) Mmm.. Crepes.. Finest are the home made ones.. Enjoyed delicious crepes with my cousin in Geneva. Love you http://t.co/9dqbMlPM1u http://t.co/uBh4HQWt5o Good workout today :) #NoleFam #AJDE http://t.co/zjmJ9mb75a Stairways to heaven :-) Idemo http://t.co/L00s0tHlvq Srecan rodjendan  28-mi rodjendan Civ sa\\ Viktor. Vidi se da mu nije svejedno da dune u mocnu svecu :-) http://t.co/38DHBFwN8M At Monaco-PSG game with buddy Viktor http://t.co/dO2yaoQpgH On my fb acc i posted a video from practice today. Off i go to stadium now to watch Monaco vs PSG :) Just another day in the office... :) #TeamDjokovic #DjokerTeam \n\nJos jedan dan u kancelariji... :) http://t.co/QTJwfsGLC0 Wow“@HugestNoleFans:we'd be happy if u could have a look at this video we made 4 u: http://t.co/xPZeUV95n2 all best from Germany we love u” Is it too early to start preparing for @rolandgarros #NoleFam? ;) Cc @PeugeotFR @Peugeot @MarkStillitano7 #Monaco http://t.co/CZrqDzARK2 I think we can call it a night... :) good night #NoleFam #Pierre #Tesla http://t.co/qZEUpOP8mS Hvala @TvPrva i @veceivan - bilo mi je zadovoljstvo da se druzim sa vama! http://t.co/zTcQF8nSNa Back to MC for work. One of the most beautiful tennis clubs in the world.Great to spend some time inSerbia http://t.co/rFnIl9SIbA http://t.co/1loN0YbEmS Memories...Wall where i hit my first tennis balls w/ Jelena Gencic. Destroyed by bombs but still there #grateful http://t.co/LJklCkgSgc Here are some photos of me when i won the race the other day.Thanks to @head_tennis for great ski gear! #NoleFam http://t.co/tbeEYfVnTG I won the other day on a ski race, but yesterday it was Viktor Troicki who beat us all! Well done! #Kopaonik http://t.co/1swqAkhfMA Winter time!!! First snow for me this year :) Love it! #Belgrade #Serbia http://t.co/HPvGF7zpnx On my way back to Europe.Exited for the rest of the season.Congratulation to @stanwawrinka for a great match. Love you Australia Great day for Serbian tennis today.I am dedicating my win to friends @TipsarevicJanko @BTipsarevic and their baby :-) My #NoleFam i noticed your surnames for @AustralianOpen occasion end with OVIC :) You are the best!! Thanks for your love!!! \"@meokee: @DjokerNole and we r lucky to have u as a hero for us CHECK THIS NOLE http://t.co/tzmwKAfA3t\" Thank you very much. LOVE you all That's how hot it was. Thank you everybody for being so persistent and passionate about our sport. @ AustralianOpen http://t.co/pc7hAUbHQm I have the greatest respect and appreciation for volunteers,ball kids,line umpires,and of course fans for handling this heat in last 4 days While everything around us is BURNING,Pat Rafter and I found some high protection sun cream. Protect yourself people! http://t.co/DMfInPX65c Zemlja,nebo,vazduh.. Sve zivo Gori u Australiji ovih dana.. Nezapamcena vrucina.. http://t.co/oZxrcQdOE1 Top tennis towns in Australia selected their favorite players. Nice initiative :-) @DavidFerrer87 @RafaelNadal http://t.co/Q8u9e5z4t3 Srecna Srpska Nova Godina svima. Evo jedne plemenite price za poklon :-) http://t.co/ndKIVtEBvc Good to start of with a Win in Aus Open 2014. Dobro je zapoceti pobedom ovogodisnji Aus Open.. Idemo dalje. Thanks for the support guys I got really nice presents from my dear fans. Wanted to share it with you.. good luck charms :-) Thank you girls http://t.co/jbeulWVep0 Guys,here is one more photo from Rodeo-Lufthansa Taxi ride! So much laugh with you two.. ahahaha @stepec78 @Leander http://t.co/CLkOzXfW6J RT @Leander: Rodeo Taxi in Melbourne!!! Funniest taxi ride of my life with my boys @DjokerNole &amp; @stepec78 Good Luck Boys 😂 http://t.co/oCJ… If you are in Melbourne &amp; want to get a chance to meet me, @PeugeotAus is organising competition on their Fb :) http://t.co/485mxoPXgf \"@dhantuchova: @MGaborik10 @DjokerNole Thank u!good luck with the rehab,we all want to see u back on ice!\" Thank you guys. Good luck to you Used a beautiful,warm day to go kayaking in Melbourne. Love it :-) http://t.co/hzlwdQe8QX From today, i am new, proud ambassador of @seikowatches :) http://t.co/fezJz7SKxL RT @head_tennis: Watch http://t.co/UZTInd4qKl to see how @DjokerNole makes his #CustomMade racquet, and then make your own at http://t.co/p… RT @AustralianOpen: The official 2014 #ausopen draw will be held tmrw morning at 10:30am at Melb Park w our defending champs @DjokerNole &amp; … Thx! “@TanjaKudra: AO draw is tomorrow at 10.30am local time (pre-ceremony starts at 10am). Good luck @DjokerNole :) http://t.co/LaAhSmwQA9” Booked my place on @AustralianOpen wall on time :) Such a great idea! It will be full soon! #oioi http://t.co/VIAud5qABX Happy to announce partnership with @Peugeot - French automobile manufacturer with very long tradition,over 200 years http://t.co/fqgZzUAqOI And @rogerfederer ,i would be honored if you named your kid after me. Sure Serena would be too. So,let us know. We will be around the courts It is beautiful to see how many people show their good hearts and supported Roger's Foundation. Very successful evening with tennis entertainment for a great cause.Congratulation @rogerfederer #RFNight Tasty barbecue japanese dinner :-) http://t.co/oVcy0XsATj \"@Brother_Ball: @DjokerNole Haha that's awesome ! Look what's on my side. http://t.co/NaGik6u0Zd\" I see you are familiar with this quote :-) \"@NDjokovicArmy: Koliko je dobra slikaa &amp;lt;3 @DjokerNole #NoleFam http://t.co/Vm6hDvnQoU\" Love this photo. Mnogo mi se svidja slika :-) Hristos se rodi,Srecan Bozic.Merry Christmas to everybody who celebrates it today. Beautiful message from the park http://t.co/IIblkNGiTB Citajte i VOLITE sve oko sebe. Pokenimo svi inicijativu da se u medijima pojavljuju vise ovakvih pozitivnih prica. http://t.co/uEkuXpanTC Srecan Badnji Dan celoj Srbiji,pravoslavnim narodima. Za Badnji Dan je nas Dragi Darko Nikolic napisao jos jednu plemenitu pricu. Hvala ti RT @HuddleBre: Мој Божићни поклон вама је преношење једне поруке.\n\nСтара је 84 године, и стиже са океана.\n\nПисао сам за Блиц о њој:\n\nhttp:/… Empty RLA and me jumping around.If you zoom in,you will see me.Different to observe the court from that perspective http://t.co/BeKMpvpMiy OMG!What a fantastic video.Makes me LOVE dogs even more!Fantastican snimak.Zbog ovoga VOLIM pse.http://t.co/Y4Sqwr20wt Watching Melbourne Victory play. Great stadium.. :-) http://t.co/qcSDfV7l4l What do you guys think of my german? :-) Haven't spoken it in a while..Sta mislite o mom nemackom jeziku? Pogledajte snimak :-) @KasiTennis \"@KasiTennis: Christopher Kas Backstage mit Novak Djokovic http://t.co/CCcF3wvXTO via @youtube @djokernole impressed by your german!!! #nole So many great memories from RLA! Fantastic feeling to practice on fresh surface. Love Melbourne. Hitting with Filip K http://t.co/6IlhozuxI6 Hahhahaha! Yes guys,GOOGLE power and lots of good info out there ;-) Also,i apologize,it is Aussie Aussie Oi Oi Oi :-) Yes,flying to Melbourne. Can't wait to arrive in Ozzy Ozzy OY OY OY land :-) @djokovicAUS Queensland and Northern Territory Aerial Services Limited, which was quickly abbreviated to the acronym 'QANTAS'. \n@TonySheahan correct? :-) Flying for the first time in my life with A380. Looks massive :-) Thumbs UP for Qantas http://t.co/mSVJF0WN3H Happy New Year - Srecna nova godina.\nWishing love,happiness,health,peace,joy to everybody :-) http://t.co/uWSB6t2Lud Happy New Year from Dubai! Lots of love, health, happiness and piece to all of you my friends! #NoleFam http://t.co/aQs143Huy6 :D @SoriNoleShady: Imagine you are having a jog in the park and suddenly @DjokerNole comes beside you running and says- \"Let's have a race!\" Just heading to practice. Time is now :) http://t.co/8xy2d11r0A Back to work :) http://t.co/vK453a2yjB Hvala Mariji i Petru sto su me pozdravili! E da,moram da pohvalim Ivana Ivanovic za modni detalj-leptir masnica crvene boje.. ;-) #tlzp Ali moram moram da pohvalim pevacke kvalitete Sare! Bravo.. Knez hrabar i zabavan,a Boris nas uvek nasmeje :-) Moj favorit definitivno @AnaKokicMusic Iza nje Aleksa Jelic.Divim se svima na profesionalizmu I zabavi koju su pruzali nedeljama Najzanimljiviji show na nasim prostorima. Pratimo finale #tlzp http://t.co/zXATaFHGQZ Beautiful Sheikh Zayed  mosque in Abu Dhabi. http://t.co/saNxXo1Rpu We played tennis with serbian and french kids today before practice in Abu Dhabi and enjoyed it very much @DjokoMare http://t.co/c5TpnpnWlf Game on! @RafaelNadal @DavidFerrer87 @andy_murray @stanwawrinka @tsonga7 @MubadalaTennis http://t.co/NPpMWe6ep6 Good practice today with  @andy_murray :) @MubadalaTennis #abudhabi http://t.co/ISAJzNeCX5 Pequeño paseo por la puerta de Alcala con buena compañia. Beautiful city of Madrid. Feliz Navidad http://t.co/tu7oZv3foM Merry Christmas guys!Wishing you lots of health, love and joy! Here is short vid of me&amp; couple of friends singing http://t.co/Qw0oZmEMCT Treba nam vise ovako inspirativnih prica. Nadam se da ce tvoje kolege slediti ovaj primer. Imate veliki uticaj na ljude u Srbiji @HuddleBre http://t.co/umu7VJuYaM Izvrsna prica sa velikom poukom koju moram sa vama da podelim. Fenomenalan tekst... \"@sambranson: This makes me laugh :) http://t.co/6WpgAZB3kQ\" hahahahhahahahaha Enjoying the sun and tennis courts with full squad on board. All smile and all happy :-) http://t.co/LBNZ9rD1xd Enjoying the sun and tennis courts with full squad on board. All smile and all happy :-) http://t.co/BYiTeu9J0X \"Listen Carefully guys and enjoy the sun \" :-) BB and good students. @TheBorisBecker http://t.co/FKrAXpduV3 Cestitke opet rukometasicama na istorijskom plasmanu u finale. Takodje @VelStjepanovic na sampionskom\"leptir stilu\". Estamos listos para Los zumos de frutas :-) Buenos Dias. Ready for some fruit juices in the morning. http://t.co/Z4Of5NU5AC We went to the water source in the montain to get some plain,natural water. First we needed to check if is free of p… http://t.co/Lj7xrKkjqf We went to the water source in the montain to get some plain,natural water. First we needed to check if is free of p… http://t.co/UWkxwtJziU Velike cestitke nasoj zenskoj rukometnoj reprezentaciji na fantasticnoj pobedi u izvanrednoj atmnosferi protiv Norveske! Srecno u polufinalu Muchísimas gracias por esta deliciosa tarta de zanahoria sin gluten! @CeliciosoBakery http://t.co/BNMRj82OIV Biking our way to the mountains.Hard work with positive energy. Come on! Naporan rad sa pozitivnom energijom! Idemo http://t.co/bvVedXSomR Best breakfast in the world. Vegetable and fruit shake. Enjoying it with my bro's @DjokoMare @djole_djokovic http://t.co/FOhrEW3tLZ http://t.co/COpsh7aK5O inspiracija svima. Ugledajmo se svi na ove studente koji su pokazali veliko srce i zelju da preduzmu nesto I pomognu @novakfoundation Odlican posao volontera i veliko HVALA svim Srbima koji su danas u Beogradu pomogli ljudima da se utople pred zimu @novakfoundation Great job by all the volunteers today in Belgrade and big THANKS to all the Serbian People for showing their good hearts. . @NiallOfficial on my way back from holiday i watched ur 1D movie. You guys are rocking!Gotta join you once on  tour to hit some balls ;) Remember: Dog is for Life, not just for Christmas! @DogsTrust @JelenaRisticNDF #presspaws http://t.co/RuKmeopcPA Hi fans in Abu Dhabi! I’ll be answering your questions! Submit them via @MubadalaTennis with #AskNovak and read my answers next Wednesday! Couple of you guessed right :) my little brother @djole_djokovic :) Holiday is over! Guess who i found back home chilling in the ice cold sea? http://t.co/hqZSy2DBFF Used my free time to get up to date with all the blog posts on http://t.co/UwodEnbRFt :) well done @novakfoundation http://t.co/Umzg3Q3yRx \"Man’s goodness is a flame that can be hidden but never extinguished.\"Nelson Mandela. RIP, your flame will burn forever. Greetings from our holiday :) http://t.co/pRFUUFWazd I'm glad I was part of the farewell of David Nalbandian. I cannot forget to mention how much fun Rafa, Pico, David a… http://t.co/yUKakDHc7w Fun time with kids! Enjoying my time in Argentina with my friends and colleagues :) \n http://t.co/HrlPJT96Yj Video for my #NoleFam :) thinking of you!  http://t.co/QH4Ga0MoP0 #tenisenloshielos http://t.co/o71QaospUS Beautiful Chile....i had great time here! Next stop #Argentina! Hope to meet my #NoleFam there ;) http://t.co/F9GNmvgBSz How cool is this :) #Chile http://t.co/r9N1iEVlnE Sightseeing in Santiago with my bros Viktor, @MarkStillitano7 and @tabashbgd :) Greetings from #Chile http://t.co/GKeQIpkIAR The runner up trophy from #DavisCup We gave our best, but Czech team was better. Congrats to them! Next time... ;) … http://t.co/1iU1EkvW9w Borimo se do kraja! Hvala vam sto nas bodrite! #DavisCupFinal #srbija In case u r flying tonight while we r playing, u can still watch us live on channel #Sport 24 in the plane!See u tonight! :) Early days of NDF,I remember it all :) RT @JelenaRisticNDF: I answered some of ur questions in blog post on #NDFBlog http://t.co/4ax2ELrmez Re-connecting with my old friends :)  http://t.co/66z2Kz82Hb Little bit of stretching before heading to my training session in Bercy #NoleFam http://t.co/yKyFEcTXhK Good morning #NoleFam :) anyone having late breakfast like me? :) http://t.co/vsqmh0LFD0 Tonight i will be part of the draw ceremony for @bnppmasters and after i'll make a short appearance in @GrdJournal :) A bientot! ;) RT @GrdJournal: Novak Djokovic (@DjokerNole), un des boss du tennis mondial, est notre invité #cesoir ! #LGJ Sve sto nije lepo raditi u 'relanom' zivotu, nemojte raditi ni u 'virtuelnom'. Budite pristojni, fini, lepi, dobri.. @BirajReci #HejtSpreci Cim prepoznamo elemente digitalnog nasilja,moramo na njega reagovati - iskazati stav protiv, ukazati na problem,potraziti pomoc @BirajReci Working hard these days with my team. Feels good to be back in #Paris! http://t.co/xgOgzJ63Ie Today I spent my day doing the photo shoot for @head_tennis. You'll see the results soon :)  http://t.co/FVjByZ3pWY I made an appearance in a documentary film about Belgrade. Premiere is this Saturday http://t.co/WCEJV9BbCs by @malagurski Ove subote je premijera filma o Beogradu u Sava centru, i ja se pojavljujem u njemu :) http://t.co/WCEJV9BbCs @malagurski I wanted to take u 4 a walk #NoleFam!Let's sightsee together Medieval Village of Roquebrune :) here is what i saw: http://t.co/EtD5ucMHEg Good night #NoleFam! It was nice talking to you tonight and seeing you :) thx for your messages! Off to sleep now,i'm a bit jet lagged :D Couldn't agree more! “@Harvike_: @DjokerNole \"More than a fanbase, it´s a family.\" ❤️ #NoleFam” @championnole sending my love back to Australia! See you in couple of months :) @meokee happy Eid! :) @meokee hello! Thanks for being patient :) you are officially noticed ;) @GermanNoleFan hi to my NoleFam from Germany, thanks for your support! @BORIS_DFB will do. Thanks! @gogitesic pozdrav i od mene i hvala na podrsci! @NDjokovic_Fans how about tonight? ;) @Feel_happiness2 happy bday! @SanjaSkipy i love it! Thx @TanjaNole @SanjaSkipy nego sta! Vidimo se u novembru ponovo!!! #DavisCupFinals @radiogod_ thanks a lot! @iamgricoboy hello to Philippines from me!!! @TanjaKudra @NikolaP9 pricam ja sa svima vama :) samo me ne cujete! Hvala na podrsci! I'm touched by your efforts to show me in so many ways your support #NoleFam I am memorising all your faces through your video msgs :) Thanks for sharing! “@malakkhalil8: Vote #NoleFam its important http://t.co/e8LdQeNT27” Thank you #NoleFam! “@iGeorginaOS: Have you seen what #NoleFam has made for @DjokerNole \"A #NoleFam Story\" https://t.co/Cxyh8cgaup :))” So grateful to have such a great team behind me all these years! and thank you #NoleFam for love and support! HAPPY!… http://t.co/O69eRSVOLs So grateful to have such a great team behind me all these years! and thank you #NoleFam for love and support! HAPPY!… http://t.co/PgYYHfeAiY My #NoleFam always there for me.... Thank you! Love you!  http://t.co/Buh0KNPS8j Music is the best way to relax and have fun :) Idemooo! #Shanghai http://t.co/j31wBHda8w On my way back to hotel. As you can see, i'm glued to my racket and i'm not dropping it out of sight ;) #Shanghai http://t.co/7gM6oY1eet Did you know that top players in Shanghai have their own,personal locker room?:) welcome to mine!\n http://t.co/PJuJpexoVg I saw with my own eyes the huge #Uniqlo store, it's really impressive.Thx to everyone who came to meet me last night… http://t.co/87SFtHbIqT Hello Shanghai!! Come and join me at Uniqlo Shanghai Global Flagship store from 19:45 to 20:30. It is their biggest store in the world! :) My #NoleFam are amazing! Thanks for the unconditional support :D  http://t.co/3983BJ1ODn It takes a lot of mental strength to win epic battles in big tournaments.Check out how I do it here: http://t.co/830jbFFfL0 #novaknole RT @adidastennis: Novak and Nole. The two sides of a personality. The world's number one tennis player. #NovakNole #NoleFam https://t.co/SX… RT @adidastennis: Novak is intense. Novak is driven. Novak never gives up on a point. #NovakNole #NoleFam https://t.co/FW5DSsYIcH RT @adidastennis: Nole is a funny guy who likes to spend time with his family... #NovakNole https://t.co/71d18AO6x6 Part of our warm up before the exhibition match  :) It made me so happy to see full stands today, all the proceeds … http://t.co/THyxBKZeX0 Warm welcoming by my #NoleFam in China! Feels like coming back home :) \n http://t.co/ukH8wsh2Er On my way to the airport. It's China time!!!! ;) Meet my fiancé and future wife :) So happy! Thank you for wonderful wishes #NoleFam and friends! http://t.co/jEfo5fLu8i #TeamSerbia is in the #DavisCup finals!!!!! Ideeeemoooooooo!!!!! http://t.co/PvHLk1iZtX I'm very excited for tomorrow's match vs Canada team! Beating Jet Lag and tiredness is so much easier when i'm with … http://t.co/R0wSSwOdVN There R good days &amp; bad days. It's important to keep fighting and believing.Back on court. #DavisCup #GoSRB http://t.co/JtT5JDep6q Good practice today. I'm ready for tomorrow's match! Wish me luck :)  http://t.co/oH20MkjEqC Miljan,GG and me lining up against NFL NY Giants Center David Baas.David weighs 145 kg.Who will win this battle?;) http://t.co/jw3BvcG32L Packed my stuff for tomorrow's match and i'm off to bed now :) see you soon! http://t.co/cGuJshEN7m Let the games begin :))) #USOpen2013 #NoleFam http://t.co/BMctw3LgPy Now back to my usual gear and heading to the US open for practice :) http://t.co/YOxFz8U9Mz Big THANK to UN Member States for proclaiming April 6 the International Day of Sport for Development and Peace. #April6 It was a real honor to address the UN and be given special privilege to speak on behalf of global family of athletes on this historic day. On my way to the United Nations :) it's a really special day today. #excited http://t.co/nzJEpeKjlX Excited to come to amazing store &amp;see u all!@UniqloUSA: #MeetNovak today at the  5th Ave store to send him luck for #USopen. See you there? Here r some positive,inspiring news: athletes from SRB win medals in Moscow! #NDF http://t.co/G0BMkbQztY cc @JelenaRisticNDF :) Very proud of Ivana and Emir for winning medals for #Serbia on world athletics championship in Moscow! Well done! Bravoooo Emire i Ivana!!!!Sav vas trud se isplatio,samo vi znate koliko je bilo tesko. Od srca cestitke vama,porodici,timu i Srbiji! Finished warming up for the match. Soon to go on court. See you soon!\n\n http://t.co/6Z9NMI7yeT The best warm-up before the match with my fans support!  thanks #nolefam http://t.co/9KZVRQCSlJ This was such a fun day with @MariaSharapova and @HeadTennis competition winners! :) http://t.co/RiO6nTqQgV Very happy to be in SF! Thanks for your support #NoleFam :) See you tomorrow! http://t.co/5kDSeyIfI5 Getting ready for the 3rd round match, see you soon on court :) #CoupeRogers If i keep up w/good work on court,u'll see more of it.I might add more moves to spice it up,stay tuned #CoupeRogers http://t.co/Pspb62VitR So, you liked my dance last night? #GetLucky #CoupeRogers http://t.co/vxddhHy2Oe This is what happens when you stop a hungry man and ask him for a photo... Haha #CoupeRogers http://t.co/BusmWR0dvs A very warm welcome on my 1st day of practice at #CoupeRogers. Thx guys for being there to support me :) http://t.co/Mt8gflc3Nk Good morning my friends! I thought to start my day with #FF :) Departure time :) #Montreal here i come! Guys, don't forget to send me recommendations for good restaurants :) http://t.co/rSxhg4VZfS Thank you Laurent Lokoli for great 4 days of practice.Very nice and talented guy,wish him the best!thx for gifts :) http://t.co/f4RPjra04U At the end of the practice,i invited couple of little ones to show me their skills on court :) they seemed happy :) http://t.co/WXuDjpiza7 Proud of @novakfoundation team 4 their hard work. Just launched the #NDFblog &amp; @JelenaRisticNDF wrote the 1st one http://t.co/PdIqyfm6LG Had a very good practice today! http://t.co/I1aWXtkMSQ Hey @TomThummer, how about this? :) http://t.co/7kzXmwtkqV http://t.co/FMhomWGxbP amazing performance by @TomThummer. Hope to get a chance to meet him 4 some private coaching. Love this stuff! :) http://t.co/FKJ4DFYM0z\nSummer hit \"Get lucky\" in a different way. brilliant! ;) Just finished my afternoon training session http://t.co/VLPFoIi830 Killing time before my lunch arrives. I'm sure you would do the same :) haha http://t.co/2NZP4UqYK2 Stretching after tough practice - it's very important! ;) http://t.co/MkWxVlJfse On vacation time flies, so i missed out the #FF. Better late than never, so here we go! #NoleFam"}