{"tweets": "When you see a good dog on Trump's Twitter and wanna smash the like https://t.co/fs7NCkKFdW .@roywoodjr recalls some key moments in the history of hip-hop, from Rapper’s Delight to the accidental creation of the record scratch. https://t.co/mtODtXnmcL It’s not just passengers who are switching to ride sharing apps, drivers are too, and that’s threatening old-school cabs. Full piece with @DesiLydic: https://t.co/TZrwXnq7Q5 https://t.co/hVkSHOmegc Someone has al-Baghdadi issues https://t.co/sxaf0AuwMX Still doesn’t make up for them abandoning us at Normandy https://t.co/S8iWCdLtL2 There’s a new Kanye album (2009) vs. there’s a new Kanye album (2019) https://t.co/Yd8eWNLOdG PSA https://t.co/J5gmIYoeWA .@ronnychieng talks s**t with @BillGates. #ReinventedToilet https://t.co/e32ESas7qS DJ and music producer @RealBlackCoffee discusses his passion for staying true to his South African roots, his Africa Is Not a Jungle initiative and his single \"LaLaLa.” https://t.co/MGrVElpXuL In addition to writing and directing \"Jojo Rabbit,” @TaikaWaititi stars in the film as a very infamous imaginary friend. https://t.co/77KRTPicvY When Ivanka Trump goes into work every day... what happens next? That’s this week on Unsolved Mysteries: White House Edition https://t.co/OuKBPQR6he Awww. This American president still has his imaginary friend. https://t.co/T2iVfYjZL3 Is he subtweeting Rudy https://t.co/jjQWQQau2p RT @ComedyCentralPR: .@TheDailyShow The Daily Show with Trevor Noah Announces Beto O’Rourke, Amy Klobuchar, Hillary Rodham Clinton &amp; Chelse… Found the whistleblower: Rudy's ass https://t.co/Hp3lHTzELy RT @TheDailyShow: @realDonaldTrump Great stuff, Mr. President! https://t.co/NDvNdxp8fZ @realDonaldTrump Great stuff, Mr. President! https://t.co/NDvNdxp8fZ RT @standup: .@dulcesloan gets strange reactions when she tells people she’s not from New York City.\n\nDon’t miss Comedy Central Stand-Up Pr… Trump just described his call with Ukraine as \"perfect.\" \n\nYou, too, can have a perfect, totally unimpeachable call with the president. Call 954-448-7867 now. RT @jameelajamil: You’re coming straight to hell with me @Trevornoah https://t.co/s3OzBi3l95 Previously on Today in Obama Scandal History: The Tan Suit\nhttps://t.co/zYZ20sVSwC @mmckinnon We would never... \nhttps://t.co/zYZ20sVSwC So much news this week! Anyway, 10 years ago, Barack and Michelle Obama went to New York to see a play, the worst scandal in presidential history. https://t.co/zrG032lAxc .@JameelaJamil is going to Hell, but Trevor is getting into Heaven as his mom’s plus-one. \n\nExtended interview: https://t.co/VqNpUAhB5H https://t.co/ECuKT8OMeU RT @TheDailyShow: Zuckcession https://t.co/5zOS6hxVkI RT @alexwagner: A little behind the scenes confab with @Trevornoah in the Daily Show greenroom -- right here! via @SHO_TheCircus  https://t… Zuckcession https://t.co/5zOS6hxVkI “When my girls were born, they only knew me after I filmed my two specials. I want them to know that I struggled a lot and that I had to work really hard.” @AliWong reveals the inspiration for her book “Dear Girls,” and shares stories from her early days as a stand-up. https://t.co/9oRbaXFjKD A battle brews in the Hamptons involving Native Americans, a tribal monument, and very upset white people. We sent our own white person @MichaelKosta to investigate: https://t.co/qSdzYqjBV9 If Trevor could ask Trump a single question, he would try to out-crazy him. #BetweenTheScenes https://t.co/1V7OZ37ZZf RT @Trevornoah: Always a great time visiting with @cthagod &amp; @angelayee! 🙌🏾 You can watch the full conversation on the @breakfastclubam’s Y… Ronny Chieng: International Student is now free on YouTube! ►https://t.co/kRGH1N2UTp\n\nIt takes place in Australia, so here’s a little primer on the land down under from @ronnychieng before you watch. https://t.co/BTR4629xxK Trump thinks he bought America like you’d buy a Quiznos, and now he’s being impeached by the dude who spreads the mayonnaise. Neal Brennan explains: https://t.co/B5CQ5ux6NJ Twenty 2,000 year-old coffins were found in Egypt.\n\nFull piece: https://t.co/MrtZgpaMfi https://t.co/XB9pSXpejq When a woman needs something explained to her on Twitter https://t.co/9ZKwR8WjOm Try to find a better story than this. We’ll wait. https://t.co/5xkXpEMhGY RT @standup: Don’t write a song about showing off your dick unless you’re prepared to show it. @dulcesloan https://t.co/UI6xBPDiEV .@cyntoia_brown reflects on coming to terms with being a victim of sex trafficking, enduring a harsh prison sentence at 16 and embracing her freedom. https://t.co/uAZ41WCHoT Tyler Perry opened one of the largest film studios in America, including a replica White House. No one tell Trump but we think we can trick him into living there.\n\nFull piece: https://t.co/2jAtLCbn7i https://t.co/hcidbXF353 “Africa has a voice and over the years I feel like that voice has diminished because of how the world has painted the continent… I would like for the world to see that voice.” - @realblackcoffee\n\nFull interview: https://t.co/9wVDWtE9Y8 https://t.co/N5vq9jMc0o RT @standup: .@ronnychieng definitely didn’t experience that famous brotherly love in Philadelphia.\n\nCheck out Ronny Chieng: International… Ouch https://t.co/eWpPUaUYhx “I’m not defending Hunter Biden…however, the last people who should talk about the blurred lines of family names and political influence are the ones running a home office from the White House.” https://t.co/RHXhmKXQFO Trump (and @dulcesloan’s boyfriend Marvin) ain’t s**t. Full piece: https://t.co/s4DeKztjgv https://t.co/UI7FNlvXF5 “Isn't it weird that in 2019, someone still has to make a movie trying to explain to people not to be a Nazi?” @TaikaWaititi discusses playing a buffoonish version of Hitler in “Jojo Rabbit.”\n\nFull interview: https://t.co/AXUVRztCA4 https://t.co/DL9elAWtC7 Trump takes on his biggest critic yet: himself https://t.co/3jVFXAQMCP Can’t be dragged into the president’s criminal activity if he doesn’t know your real name https://t.co/CouzR4uji5 https://t.co/rIj1TSSAMQ Should America dump Trump, or can we make him leave on his own? @dulcesloan has a plan: https://t.co/3aDW6T7jfv Trump doesn’t think he works for America, he thinks he owns it. @NealBrennan explains: \n\nFull piece: https://t.co/Qw6IygG1Zj https://t.co/pNK5yKZgAC LeBron James is drawing a lot of heat for not taking a stand against China and their oppression of Hong Kong. https://t.co/17orb7sfGA .@aliwong’s wrote her book “Dear Girls” for her daughters. It’s graphic, real, and she hopes they don’t read it yet.\n\nFull interview: https://t.co/iMv6QOyyxe https://t.co/l8RIeWcgAI Was Eliud Kipchoge able to run a marathon in under two hours because he had special Nikes? https://t.co/6xFnEEjaEM “We don’t forget. I don’t forget.” https://t.co/elWWKrI4AL So many scandals this week, so little time! Here's a catch up: https://t.co/tzRqNYajlp Trump is trying to get America to dump him-- or as @dulcesloan calls it, “pulling a Marvin.” Full piece: https://t.co/s4DeKztjgv https://t.co/Go7cWtibWL In California, roadkill is now on the menu. https://t.co/UkNnZneCeK Trump has come full circle and is now using the ”I know you are but what am I?” defense.\n\nFull coverage: https://t.co/u42F5s6FRG https://t.co/Tktw7hMNhS “Isn't it weird that in 2019, someone still has to make a movie trying to explain to people not to be a Nazi?” @TaikaWaititi discusses playing a buffoonish version of Hitler in “Jojo Rabbit.”\n\nFull interview: https://t.co/AXUVRzc1bu https://t.co/KmzjhcY4Tl There’s nothing Trump won’t do to profit off the presidency. He’ll be outside his own impeachment scalping tickets.\n\nFull coverage: https://t.co/u42F5sogJe https://t.co/Xo0cWaai5b RT @standup: Are there gay bugs? @jaboukie reveals his research.\n\nComedy Central Stand-Up Presents returns this Friday, October 18 with two… David Oyelowo’s dad is ready to get into the autumn spirit 🍂 https://t.co/xeR3kPhaVu Truly historic.\n\nFull coverage: https://t.co/u42F5s6FRG https://t.co/25B9WGyrtK Yesterday was wild https://t.co/2FhUSwopEd RT @TheDailyShow: Trump vs. Trump: Kurds Edition https://t.co/eqMMwNWtlg Trevor dives into the latest barrage of headlines, @dulcesloan weighs in on President Trump's impeachment strategy, and @TaikaWaititi discusses his movie \"Jojo Rabbit.”\n\nListen and subscribe: https://t.co/dlrkwFiFyf https://t.co/sJnfQT36DM Here's the full piece with @dulcesloan: https://t.co/s4DeKztjgv Here’s the full interview with @TaikaWaititi: https://t.co/AXUVRztCA4 You heard them... NO QUID PRO QUO https://t.co/dwUFsuCUHn TONIGHT: Should America dump Trump, or can we make him leave on his own? @dulcesloan has a plan: https://t.co/xfWXAMj06C RT @Trevornoah: Rocking the purple tonight to stand in solidarity against LGBTQ+ bullying! 💜#SpiritDay https://t.co/NvGEawrOlR One scandal in a day could doom a president. Today, Trump said f*ck it, we’re going SEVEN scandals. https://t.co/YY5qYGcCrF TONIGHT: Writer, director and star of #JojoRabbit @TaikaWaititi is here! https://t.co/BIKQKCk9p0 Mick Mulvaney... you... you just admitted the whole thing! https://t.co/MQb5CxVPFC Heading to Fox News for a contract like https://t.co/pNqBMEz9sn The smart person glasses could only get him so far. Rick Perry OUT. Who will be the next to go?! #TheCelebrityAppresident https://t.co/R7ALdDTYKh Nepotism is rampant in D.C. and, thankfully, the Trumps are calling it out… when it involves the Bidens.\n\nFull coverage: https://t.co/uazl3p2x5A https://t.co/eCdsu1jxyf Trump vs. Trump: Kurds Edition https://t.co/eqMMwNWtlg Stages of Trump corruption:\n\n1. Corruption is bad\n2. We don't do corruption\n3. Look everyone does corruption\n4. We do corruption *right*\n5. If you don't do corruption you're pathetic\n6. Doral Presents: Win A Dinner With The President! ($500,000,000 entry fee, world leaders only) https://t.co/dZFNVL75h8 We love Nancy in Stranger Things. https://t.co/9alCHtOZls https://t.co/qdTUscy49w Gina Rodriguez said the n-word in an Instagram post while rapping a Fugees song.\n\nFull piece: https://t.co/HteTJAPVwn https://t.co/Q9C8rSA7Sj lol https://t.co/fy18BhSaK7 Trevor highlights how Hunter Biden and the Trump children benefit from their family names, @cyntoia_brown discusses \"Free Cyntoia,\" and @aliwong talks about \"Dear Girls.”\n\nListen and subscribe: https://t.co/dsXaE6YnCM https://t.co/eO10vWZuND Here’s the full interview with @cyntoia_brown: https://t.co/5AwPJZYlzw Here’s the full interview with @aliwong: https://t.co/iMv6QOyyxe TONIGHT: @cyntoia_brown is here to discuss her memoir #FreeCyntoia. https://t.co/JrffgCcYAk Hold up, so the Trump boys wanted to attack the Bidens and the issue they chose was nepotism??? https://t.co/2fP8i68HyI TONIGHT: @aliwong is here to talk about her new book #DearGirls! https://t.co/lPUi1Bm2rf TONIGHT: People are burning LeBron’s jersey in Hong Kong. Luckily he’s used to it by now. https://t.co/hBaclgIjKW Biden meanders to, look… he sometimes, back when, and then gets to a valid point.\n\nFull debate coverage:  https://t.co/rdp54NNTjm https://t.co/cJdCePSmym Is your presidential campaign keeping you away from your family? Introducing Leo Deblin’s Family Fill-In:\n\nFull piece: https://t.co/zmOtnriaKN https://t.co/Rqbecul2Oe Who made a mark in last night’s #DemDebate? @alexwagner breaks it down: https://t.co/Kv9pW4ea9c https://t.co/d0W8JLAnoL RT @TheDailyShow: The Daily Show &amp; @DrunkHistory Present: TRUMP HISTORY https://t.co/dS826Ik3KX Kamala Harris wants Trump kicked off Twitter. \n\nFull debate coverage: https://t.co/rdp54NNTjm https://t.co/FeIxr6Y5dj CORRECTION: Trump is a-speakin with the Italian PRESIDENT today! Trump is a-speakin to the Italian prime minister today! #tbt https://t.co/LG626Yat37 Bernie’s billionaire tax got the stamp of approval from… billionaire Tom Steyer?\n\nFull debate coverage: https://t.co/rdp54NNTjm https://t.co/3852CXb6WP Billionaire and part-time scarecrow Tom Steyer https://t.co/87SqYXOXUG Kamala Harris starts a real-life Twitter beef with Elizabeth Warren about Twitter.\n\nFull debate coverage: https://t.co/rdp54NNTjm https://t.co/HeULm4oenV The #DemDebate stage narrowed from 10 to… 12 candidates? Trevor went LIVE to break it down: https://t.co/2Fywe7uyfy Trevor breaks down the fourth 2020 Democratic debate live, and @CBSNews special correspondent @alexwagner gives her take.\n\nListen and subscribe: https://t.co/9pssdhu5XJ https://t.co/VrhBCEyIOm Here’s the full interview with @alexwagner: https://t.co/Kv9pW4ea9c Trevor’s LIVE coverage of tonight’s Democratic debate in Ohio. #Votegasm2020 #DemDebate https://t.co/OYMtY2mzqw ANDERSON COOPER: Irreversible climate change is going to doom all mankind to a painful heat death if we don't act soon. So, obviously, I've gotta ask: Who's your shittiest friend and why When you're eight hours into the debate and Anderson Cooper asks a question about Ellen https://t.co/19orEhk50U Speaking of surprising friendships... https://t.co/XnBkODxr3t FUN FACT: Tom Steyer took a \"Which Succession Character Are You\" quiz and got \"The Money.\" \n\n(OK Jay is posting to Instagram wtf) \"I'm healthy. I'm feeling great. I have an ape's heart. They put the heart of an ape in my chest and I am strong\" - Bernie Sanders Achievement Unlocked: Consensual Embrace\n#DemDebate https://t.co/9kkh8pObZN RT @jaboukie: buttigieg be like my mom was a rusty loom, my dad is a grain silo, i studied Sweat at the university of Life (Harvard) TONIGHT: @alexwagner of @Sho_TheCircus is here to give her take on tonight’s #DemDebate! #Votegasm2020 https://t.co/CHGawYyrZf FUN FACT: True to his campaign pledge, Bernie just stole Tom Steyer's wallet.\n\n(So we've been going through Jay's old tweets in the meantime. Holy shit.) Once you see it. #DemDebate https://t.co/xp3f6enW9c FACT CHECK: Jay is taller than originally stated, we regret the error tfw you got a new heart and you're ready to fu*king rumble https://t.co/Tm3s5k6Fbz FUN FACT: Elizabeth Warren keeps all her plans in a 30 year-old Trapper Keeper\n\n(Please reply in the comments if you've seen Jay and we'll alert our search team. Don't be alarmed, we still have a few FUN FACTS left, so all good. Jay are you ok) Elizabeth Warren.... YOU JUST GOT PLAN SLAMMED! https://t.co/AxEkodfRXD BREAKING: Andrew Yang announces that in lieu of an opening statement he'll be giving one lucky audience member 60 seconds in the Money Machine https://t.co/DDnKKUzY4N RT @alexwagner: Guess who’s on ⁦@TheDailyShow⁩ tonight? Other than ⁦@Trevornoah⁩ ? Me! Live debate coverage starts at 11! Ayeeeeeee https:/… How Andrew Yang envisioned that moment going https://t.co/IxpPAoYG0Z FUN FACT: Joe Biden is the candidate most likely to point at someone in the crowd and go \"THIS GUY!\"\n\n(If you see Jay wandering around the West Village area, let us know. He's around 5'9\" and not answering our texts) FUN FACT: Pete Buttigieg was the 1983 Gerber baby.\n\nAlso, this is Madeleine -- our fun fact guy, Jay, hasn't returned from dinner. Luckily, he saved some fun facts in a file, so we have a few of them to use before we run out. Jay if you see this, get back to us! FUN FACT: Tom Steyer could single-handedly end homelessness in America, but hey, it's fun making commercials. #TDSFunFacts Get to know the newest candidate on the #DemDebate stage: Tom Steyer https://t.co/3jUK1lVpKO When prepping for a debate, be sure to practice 1) policy statements 2) zingers and 3) eye-rolls https://t.co/9CpuEtDncm Ok there might be too many candidates in tonight's #DemDebate https://t.co/rLg4Epm8qr Trump thinks everyone in the country works for him. @nealbrennan reports: https://t.co/11Ss4VS1Fx https://t.co/L3mz1W61bw RT @standup: Don’t try to survive on burrito bowls like @jaboukie. https://t.co/JS6qmDdiGs Lol Obama fist bumped Michelle and Fox News called it a \"terrorist fist jab\" https://t.co/Q4BrUUzYIp RT @nealbrennan: I told you I was gonna be on the Daily Show. https://t.co/IcLzB5b1LH Wait, did Trump just throw Giuliani under the bus? \n\nFull piece: https://t.co/8l8FaasgYB https://t.co/Rq0qt3uUmR .@desilydic explains the Middle East in a way we can all understand: a Waffle House.\n\nFull piece: https://t.co/xHLR84K0X3 https://t.co/WwnzATNDML Trump doesn’t think he won the election, he thinks he bought America. @NealBrennan explains: https://t.co/MCDRCs05ns RT @GQMagazine: .@jaboukie talks about bringing his queerness into his comedy and why masculinity needs a rebrand https://t.co/6fnxozjNW3 h… RT @TheDailyShow: From the Ukraine scandal to Syria, Trump’s presidency continues to be more chaotic than a Black Friday sale at Fyre Festi… Here's the full piece with @nealbrennan: https://t.co/11Ss4VS1Fx Here’s the full interview with @RealBlackCoffee: https://t.co/70KuO5yS4M TONIGHT: Trump looks at a globe the way the rest of us look at Zillow. @nealbrennan has more:\n\n📸: @seanogallagher https://t.co/1hLOBUWhaW From the Ukraine scandal to Syria, Trump’s presidency continues to be more chaotic than a Black Friday sale at Fyre Festival. https://t.co/vMHM313wnw TONIGHT: DJ and producer @RealBlackCoffee is here!\n\n📸: @seanogallagher https://t.co/QBHABlQ96m RT @RealBlackCoffee: On Tonight @Trevornoah @TheDailyShow https://t.co/yLooyEs0uZ TONIGHT: Rudy Giuliani’s associates get arrested in connection with Ukraine, which makes us wonder: what came first, the criminal activity or the criminal aesthetic? https://t.co/b9IYqzP3Pc ADORABLE: Even the president has an imaginary friend. https://t.co/KtiJwjsU5s All new episodes this week!\n\nMonday: @RealBlackCoffee\nTuesday: @alexwagner\nWednesday: @cyntoia_brown &amp; @aliwong\nThursday: @TaikaWaititi https://t.co/8jVct04pBQ .@TheLewisBlack is sick of surprise hospital bills so he created The Lewis Black Clinic, where everything from liver transplants to candy bars are $100.\n\nFull piece: https://t.co/KKQsGgMDLj https://t.co/0Jgi7lDrTn RT @ComedyCentralPR: .@TheDailyShow The Daily Show with Trevor Noah Announces Live Democratic Presidential Primary Debate Coverage | Octobe… Chanel Miller was known as “Emily Doe” after she was assaulted by Brock Turner. Her book “Know My Name” reveals her identity and tells her full story.\n\nFull interview: https://t.co/WSofJvuFQR https://t.co/gCQ35optvP If you need your rap music censored, you might want to find a different type of music. #BetweenTheScenes https://t.co/sPRZTfI2z5 Chanel Miller opens up about why she felt compelled to write her book “Know My Name” and how she hopes to aid other survivors of sexual assault with her words. https://t.co/bxgy13oVWp Unexpected hospital fees are slapping patients with hundreds of thousands of dollars in bills. @TheLewisBlack breaks it down: https://t.co/yh76wVLERB For a perfect time, call the Donald J. Trump Perfect Call Hotline: +1 (954) 448-7867 https://t.co/nmMzWB8omF @RoyWoodJr confirms what we all fear: unhappy Trump voters still want to vote for Trump in 2020. https://t.co/HA0SMZTJqY Here’s @AmbassadorRice talking about how she had to brief President Obama while hungover.\n\nFull interview: https://t.co/bohLunCCYC https://t.co/Ne7XQ8lgYS A deer crashed through the window of a hair salon, spraying glass everywhere… but then left through the front door?\n\nFull coverage: https://t.co/T4yLOPDRjz https://t.co/eJIsf8Swpi Tyler Perry opened one of the largest film studios in America, so get ready for A Very Madea Star Wars.\n\nFull piece: https://t.co/2jAtLBTMfK https://t.co/lXLZLP1FAw Much like the Backstreet Boys, ISIS could regroup and come back bigger than ever. https://t.co/SuZoZky5ga Will Smith reflects on getting into character as a young version of himself in @GeminiManMovie and explains why he feels liberated by sharing his private life on social media.\n\nFull interview: https://t.co/trfACKtIS6 https://t.co/EuDf50RPom Deandre Somerville got 10 days in jail for missing his first day as a juror. You know racism is bad in America when a black man can get thrown in jail at someone else’s trial.\n\nFull coverage: https://t.co/2jAtLBTMfK https://t.co/QnG5YRWg4m Trump’s decision to withdraw American troops and allow this Turkish invasion could have disastrous consequences. Here’s what’s going on: https://t.co/5tavY2QAsW RT @thehill: \"Daily Show\" hotline offering \"perfect call\" with Trump receives more than 35K callers in less than a day https://t.co/i8GiHeS… Sorry, but this is what happens when you choose a mode of transportation built around a basket. https://t.co/rMFtor4xIq Nobody told Snoop Dogg you can’t have strippers at a campus event. https://t.co/fHeD5Meo9F The NBA is just the latest business to learn that China won’t play ball if you try to dunk on their regime. https://t.co/ryhmbfjnGZ Passengers on a cruise demanded compensation after their toilets stopped working and a series of hot air balloons crashed at one of the nation’s largest festivals.\n\nFull piece: https://t.co/AC3OEkrHNc https://t.co/l9qgSgLiL4 Never forget how much they did for America in Normandy https://t.co/SSdnBXwXqL Mike Pence expertly deflects a reporter’s question on Ukraine with the line, “that’s your question.”\n\nFull coverage: https://t.co/yUt5QFkHBI https://t.co/IPpNg0G1LE Don’t you wish all your calls were perfect? Now they can be! Call our Donald J. Trump Perfect Call Hotline: +1 (954) 448-7867 https://t.co/f7TWOReASV California cuts power to hundreds of thousands to avoid wildfires, Turkey attacks America's Kurdish allies in Syria, and Sen. Rand Paul discusses \"The Case Against Socialism.\"\n\nListen to today’s Ears Edition podcast on @Spotify: https://t.co/ohDz9MhFZ9 https://t.co/3hPEWi5S2T The fallout from Trump’s troop withdrawal ⬇️ https://t.co/LpkfZnqcxY So...did you call? How’d it go? https://t.co/gwS2gjOe4k Here’s the full interview with @RandPaul: https://t.co/3UsJMiJ91b Did you call? How was it? https://t.co/gwS2gjOe4k RT @ReallyR65257017: @IAmKrishanPatel @TheDailyShow Just call the number. It's a \"perfect\" call. RT @alex_parkx: @StillDewan @TheDailyShow CALL IT RIGHT NOW RT @TheTronIsOn: @TheDailyShow Everyone should call in. This is gold. TONIGHT: Senator @RandPaul is here!\n\n📸: @seanogallagher https://t.co/yaELzKv2iE (954) 448-7867 Trump ordered troops to step aside in Syria, allowing Turkey to attack our Kurdish allies. And guess what: it happened. https://t.co/yPyIZua1j2 TONIGHT: Finally, a refreshing and much-needed political dialogue with @RandPaul https://t.co/0raseZFzX8 TONIGHT: Is Trump worried about ISIS fighters escaping Syria? Meh. https://t.co/V8vmgjMUad RT @brianbrown93: @TheDailyShow I cried (sorry, two words. But sir, it was such a perfect call) #TrumpPerfectCallHotline RT @BipolarNotMoody: @TheDailyShow Unpresidented #TrumpPerfectCallHotline RT @GaryAllenMiles: @TheDailyShow Tangy #TrumpPerfectCallHotline RT @fleurdeganja: @TheDailyShow Byebye. #trumpperfectcallhotline RT @princenelson06: @TheDailyShow Amazing. #TrumpPerfectCallHotline RT @SpoekGTi: @TheDailyShow Best #trumpperfectcallhotline Reply with a one-word summary of your call along with #TrumpPerfectCallHotline. We'll RT! Jealous of the Ukrainian president’s “perfect call” with Trump? You, too, can have a “perfect call” with the president with The Daily Show's Donald J. Trump Perfect Call Hotline.\n\nCall +1 (954) 44-TRUMP now! The president is standing by… https://t.co/g4VWNxOvG9 The NBA is just the latest business to learn that China won’t play ball if you try to dunk on their regime.\n\nFull coverage: https://t.co/cq1ububOGd https://t.co/qZRQLCz2mp This was the worst gender reveal party ever…and that’s really saying something.\n\nFull story: https://t.co/L3pSGeNl5Y https://t.co/r6XbAKYQDz This is economy plus on Spirit Airlines https://t.co/cJWdIaB62i Bill Weld is challenging Trump in the GOP presidential primary. @roywoodjr wants to see if any Trump voters will defect.\n\nFull piece: https://t.co/5XsY38t6uK https://t.co/p5WZkiODPc .@RonnyChieng delivers a stern message to China as it feuds with the NBA.\n\nFull piece: https://t.co/cq1ububOGd https://t.co/VAlhB0c1AW “I told myself, ‘That’s it. I’m gonna do what I want, I’m gonna say what I want, I’m gonna live the way I want without the fear of somehow losing something that is precious that I’ve created.’” - Will Smith\n\nFull interview: https://t.co/trfACKLkgG https://t.co/FjUsxf3AiV China lashes out at the NBA over a manager's support for Hong Kong protesters, @roywoodjr talks to GOP presidential hopeful Bill Weld, and Will Smith discusses \"Gemini Man.\"\n\nListen to today’s Ears Edition podcast on @Spotify: https://t.co/ohDz9MhFZ9 https://t.co/CI3XVyqEmH China vs. the NBA ⬇️ https://t.co/laYpQer44B Here's the full piece with @roywoodjr: https://t.co/5XsY38t6uK Here’s the full interview with Will Smith: https://t.co/trfACKLkgG RT @CTVComedy: TONIGHT: @GeminiManMovie star Will Smith visits @TheDailyShow at 11ep! #GeminiMan https://t.co/HvQXLBaHKm China is going to war with the NBA over a pro-Hong Kong tweet. Trevor and @ronnychieng weigh in: https://t.co/0Xr7NPpnOG TONIGHT: The reason you may not know about the current Republican primaries is maybe the GOP doesn’t want you to know. @roywoodjr investigates: https://t.co/3jIcYVaPJ8 TONIGHT: Will Smith is here!\n\n📸: @seanogallagher https://t.co/yvnnEV3hKC Congress is considering masking the whistleblowers’ identity, which can only mean one thing: the #1 TV event of the year — The Masked Whistleblower.\n\nFull piece: https://t.co/VUUb81IQLP https://t.co/IAuoeG6M2Z Unexpected hospital fees are slapping patients with hundreds of thousands of dollars in bills. @TheLewisBlack breaks it down: https://t.co/6ZMwboK0F9 .@AmbassadorRice worked in the White House under Obama and wants everyone to know: “This is not normal. This is beyond strange.” \n\nFull interview: https://t.co/bohLunCCYC https://t.co/M77BOsb0Lc If you need your rap music censored, you might want to find a different type of music. #BetweenTheScenes https://t.co/HIMnxMMTkP The White House blocked EU Ambassador Gordon Sondland from testifying before Congress, a completely innocent thing to do.\n\nFull coverage: https://t.co/VUUb81IQLP https://t.co/syCbf1iPXv Whoever booked Snoop Dogg to perform at the KU Jayhawks’ preseason clearly doesn’t know who Snoop Dogg is. https://t.co/9BFgabHhNq The Trump administration blocks an ambassador's testimony to Congress, @TheLewisBlack highlights the scourge of surprise medical bills, and Susan Rice discusses \"Tough Love.\"\n\nListen to today’s Ears Edition podcast on @Spotify: https://t.co/ohDz9MhFZ9 https://t.co/zGH6raftfS RT @AmbassadorRice: I had so much fun last night with @Trevornoah on the @TheDailyShow reminiscing about the Obama years, discussing Trump’… Here's the full piece with @TheLewisBlack: https://t.co/KKQsGgMDLj Here’s the full interview with @AmbassadorRice: https://t.co/bohLunCCYC This week on The Fantastic, Absolutely Tremendous Road to Impeachment: Trump blocks an ambassador from testifying to Congress, a completely innocent thing to do. https://t.co/m0V4cK4zP5 TONIGHT: The American healthcare system: it’s expensive, broken, and the reason @TheLewisBlack does all his own dental work. #BackInBlack\n\n📸: @seanogallagher https://t.co/jauwZSjguC TONIGHT: Former national security advisor @AmbassadorRice is here!\n\n📸: @seanogallagher https://t.co/DfOLZTt8n3 TONIGHT: The Trump White House is going full temper tantrum in response to impeachment proceedings. https://t.co/SEZWBPFsX9 “This right here is the biggest load of bullsh*t I have seen in a long time.”\n\nFull coverage: https://t.co/T4yLOPDRjz https://t.co/cO3J5sovwN Uh, Trump can't just \"decline to participate.\" It's not the Vietnam War. https://t.co/6JQEOV0LkB RT @DEADLINE: ‘The Daily Show With Trevor Noah’s Michael Kosta Sets Stand-Up Special On Comedy Central https://t.co/TUhUr9XUJq https://t.co… Love when the president's phone calls get the same reviews as Joker https://t.co/H2oIsozY2f Chanel Miller was assaulted by Brock Turner in 2015, and she’s no longer going by “Emily Doe.”\n\nFull interview: https://t.co/WSofJvMgIp https://t.co/QX2jwHUPZt There is truly no one who matches Trump’s level of wisdom.\n\nFull piece: https://t.co/WaBm8k0xN2 https://t.co/yXIoI6iQMo The punishment does not fit the crime. \n\nFull coverage: https://t.co/T4yLOPmgs1 https://t.co/irkDIaGtiG SAY IT SAY IT SAY IT SAY IT SAY IT SAY IT SAY IT SAY IT SAY IT SAY IT https://t.co/ZkFm1a19S1 Tyler Perry opened one of the largest film studios in America, including a replica White House. No one tell Trump but we think we can trick him into living there. https://t.co/Zw7VzfjRtE Last night’s coverage of Trump’s troop withdrawal ⬇️ https://t.co/4U94cVj23s President Trump abruptly pulls U.S. troops from northern Syria, @michaelkosta and @roywoodjr cover sports news, and author Chanel Miller discusses her memoir \"Know My Name.\"\n\nListen to today’s Ears Edition podcast on @Spotify: https://t.co/ohDz9MhFZ9 https://t.co/K2r5Cln4Yg What a touching story https://t.co/Bpo1lpd4dm Here’s the full interview with Chanel Miller: https://t.co/WSofJvuFQR \"That's right. Mitch McConnell — Senate majority leader and jack-o’-lantern in December — has come out condemning Trump.\" https://t.co/gv3NCEqZjW Trump’s abrupt Syria withdrawal proves he’s as reliable as Apple Care is for covering cracked screens. https://t.co/hUeYTDEYza TONIGHT: Chanel Miller is here to talk about her memoir “Know My Name.”\n\n📸: @seanogallagher https://t.co/bpgtVu3oTz INSPIRING: This man has kept his imaginary friend throughout his entire life https://t.co/RgkHC6vu8O A black man spends 10 days in jail for missing his first day of jury duty. That’s some M. Night Shyamalan twist ending racism. https://t.co/fVtUuZk5sh Trevor played Fortnite for the first time last week with @Ninja. \n\nFull interview: https://t.co/e6khnYaOnt https://t.co/uZXPqMjNEi Three years ago today, The Washington Post dropped the Access Hollywood tape of Trump saying \"grab ‘em by the pu**y.\" David @Fahrenthold describes the moment he got the recording: https://t.co/TXDaBtR0O4 All new episodes this week!\nMonday: Chanel Miller\nTuesday: @AmbassadorRice\nWednesday: Will Smith\nThursday: Sen. @RandPaul https://t.co/AdaudZwpF0 Trevor figured out how to avoid changing his little brother's diaper. #BetweenTheScenes https://t.co/FmOHrhTTTG CAN ANYONE FIGURE OUT WHY THE PRESIDENT CAN'T HEAR QUESTIONS https://t.co/eCcRVTESKW 🚨 New tweet added to our Jeff Flake Comfort Blanket 🚨\n\nCurl up in the soft embrace of Jeff Flake’s meaningless tweets... https://t.co/ocWaYdAIOv @JeffFlake Better question: where on our Jeff Flake Comfort Blanket do we put this tweet?! https://t.co/MC7aF1O8uI “The government is like a lawyer who represents all of us… It’s time for the advocate for all of us to actually fight on our behalf.” - @AnandWrites on how to limit plutocrats’ power.\n\nFull interview: https://t.co/Zb6TmJCold https://t.co/58dKEAhH69 Confused by the Trump-Biden-Ukraine scandal? @MichaelKosta watched Fox News for eight days straight and here’s what he learned. https://t.co/JRhm7LHE0d Trevor discusses the sentencing of ex-policewoman Amber Guyger for killing Botham Jean in his own home, and the public reaction to the show of forgiveness by Jean's brother. https://t.co/qhUJoapfdy Can we trust everything we read on Yelp? @DesiLydic investigates. https://t.co/p1HUfSMMVP This fall, the story of a meteorologist struggling to fit in on morning television… https://t.co/iJC6IS966i On the internet, no good deed goes unpunished. @ronnychieng sounds off in this installment of Everything Is Stupid. \n\nFull piece: https://t.co/S57zwmXUFV https://t.co/s8Wu2gZgR8 Just because Trump admits his crimes in public doesn’t mean they’re not crimes. #BetweenTheScenes https://t.co/wM1h9jJXQp In her new novel “Red at the Bone,” @JackieWoodson tackles race, class, and black wealth in America. Full interview: https://t.co/f6RQdooNJh https://t.co/8BK9yqxXl9 If you played Fortnite this week, you may have been playing against @TrevorNoah and pro gamer @Ninja.\n\nWatch the full @WatchMixer stream: https://t.co/xQQ6o9bUif https://t.co/6I97CpBfjX The NCAA will challenge paying student athletes in court. To make things fair, they should have to use unpaid student lawyers to see how that works out for them.\n\nFull piece: https://t.co/Y8F48Ft6h6 https://t.co/YM01YhQ1wK Is Trump too dumb to get impeached? According to @michaelkosta, maybe… https://t.co/2JQNIGlTGS We watched Fox News for eight days straight and figured out the Biden-Ukraine story: https://t.co/6Y7oOwP0ap No, all the impeachment buzz isn’t stressing Trump out, why do you ask??? https://t.co/ipE96LN7t3 “Everybody should have a judge look at them like a human being. Everybody in society should be treated with a level of compassion… And yet, this narrative doesn’t seem to be afforded to black people in America.”\n\nTrevor shares his takeaways from the Botham Jean murder trial. https://t.co/ToGJI0PLR0 .@michaelkosta thank you for your service https://t.co/Y2jEYSUn3q Welcome to the impeachment trial of Rudy Giuliani: personal attorney to the president and anus of the entire Ukraine operation. https://t.co/NgiwDyVTfX @kenolin1 We’re on it: https://t.co/tfaiYk7WLv Confused by the Biden-Ukraine scandal? We watched Fox News for eight days straight and here's what we learned: https://t.co/Dt6Sme208D Another day, another country Trump is calling on to investigate the Bidens. \n \nFull piece: https://t.co/LxZ4hX0d3Y https://t.co/ube1vIL46w Trevor discusses the hugs Amber Guyger received in court after being convicted of murdering Botham Jean in his own home.\n\nFull piece: https://t.co/yC6CilxGs8 https://t.co/DJvp7qT6j4 These new State Department texts seem a little problematic https://t.co/zP6FKcEwXo Police officer Amber Guyger was found guilty of murdering Botham Jean, an unarmed black man, in his own home. But the verdict was just the beginning of the story. https://t.co/h0BoHa84ay Watch world leaders from Shinzō Abe to Volodymyr Zelensky endure a meeting with Trump https://t.co/Bw3eoMpXWM Vice President Mike Pence becomes tainted by President Trump's Ukraine scandal, Trevor reacts to Amber Guyger's murder verdict, and Tyler \"Ninja\" Blevins discusses \"Get Good.\"\n\nListen to today’s Ears Edition podcast on @Spotify: https://t.co/ohDz9MzgQH https://t.co/DkOQpufjHA Here’s the full interview with @ninja: https://t.co/e6khnYspM3 Mike Pence has a convenient history of being unaware of Trump’s major scandals 🤔 https://t.co/YE3L4SQlCz TONIGHT: Professional gamer @Ninja is here to talk about his new book “Get Good”!\n\n📸: @seanogallagher https://t.co/ES2dNYGP68 TONIGHT: Even after a medical procedure, Bernie’s heart is still set on policy. https://t.co/z89cHxDZWs Trump reaaalllly wants journalists to ask the president of Finland a question – unless it’s about Adam Schiff.\n\nFull piece: https://t.co/fFjTdBKl28 https://t.co/l48fSG5y3Y .@Trevornoah &amp; @Ninja are LIVE at https://t.co/fvUCkzMVJK right now and it seems to be going well https://t.co/poFV5B8mmS Happening now: https://t.co/HcwwiWfl36 RT @Trevornoah: It’s. About. To. Go. Down! https://t.co/WdqFPJVJAb https://t.co/2vIH0KNkWD RT @Ninja: About to go live with @Trevornoah ^_^ https://t.co/2KBbwUWiKN https://t.co/pGUnSebD1N Trevor is LIVE with @Ninja right now on @WatchMixer: https://t.co/fvUCkzMVJK https://t.co/1FM2h02oro We're a little delayed FYI. Will keep you posted on timing! Are positive Yelp reviews pay-to-play? @DesiLydic offers a rose to Yelp’s Community Director and Season 16 Bachelor Ben Flajnik.\n\nFull piece: https://t.co/zfRIKIzOvc https://t.co/FnGzq5Zsti RT @TheDailyShow: “Just because you admit to your crime in public doesn’t mean it’s not a crime.”\n\nWhy are people confusing Trump’s honesty… Imagine being the aide who had to make that call…\n\nFull piece: https://t.co/fFjTdC1WqI https://t.co/992YqtwcpL Today @ 1:30PM ET @Trevornoah &amp; @Ninja talk all things gaming and play Fortnite/FIFA. Catch it LIVE on @WatchMixer! \n\nhttps://t.co/whmp7f2OIz Putin makes a ~hilarious~ threat to meddle in the 2020 election.\n\nFull piece: https://t.co/HqQ6gAMCqz https://t.co/2XgknEcEoz Last night’s piece on The Wolf of Wall Snakes ⬇️ https://t.co/uu0CB4x6nN Trevor highlights President Trump's unhinged border wall demands, @DesiLydic investigates a protest against Yelp, and Jacqueline Woodson discusses \"Red at the Bone.\"\n\nListen to today’s Ears Edition podcast on @Spotify: https://t.co/ohDz9MzgQH https://t.co/IGSibyAMii Coming this fall, Al Roker is... ROKER https://t.co/ixpCSFA0pM Here's the full piece with @DesiLydic: https://t.co/zfRIKIzOvc Here’s the full interview with @JackieWoodson: https://t.co/f6RQdo7cRJ TONIGHT: How do Yelp reviews work, and are they completely unbiased? @DesiLydic reports: https://t.co/nqCoWNFQTp Trump takes his rage towards impeachment proceedings and immigrants to an 11. https://t.co/wcKv6gGOh7 TONIGHT: Author @JackieWoodson is here to talk about her new novel “Red at the Bone”!\n\n📸: @seanogallagher https://t.co/8x0WDP86aG ROKER (2019) https://t.co/R1OzIBKj4F TONIGHT: Trump would like you to ask the president of Finland a question, motherf**ker. https://t.co/ngQwZ2UsZw “Just because you admit to your crime in public doesn’t mean it’s not a crime.”\n\nWhy are people confusing Trump’s honesty for innocence?\n#BetweenTheScenes https://t.co/sGLgQZoRZK “To do wrong you have to know what’s right\nIn the same way that without darkness can you have light?\nWithout the weak is there might?\nWithout a Jim, could there be Dwight?”\n-@MichaelKosta https://t.co/zJkQzMIujt “The only change that is worth doing in a moment like this - with such inequality - is change that will necessarily make the plutocrats less powerful.” - @anandwrites\n\nFull interview: https://t.co/Zb6TmJkNtF https://t.co/ThTkOOptlf 😐😕😣👀😒😮🤔😂🙄\n@Brittany_broski https://t.co/2Ou0V8CVz1 Pro bono lawyers will do it for the love of the game.\n\nFull coverage: https://t.co/Y8F48FKHFG https://t.co/Y6xmJoAle4 This out-of-control airport cart video is the gift that keeps on giving.\n\nFull piece: https://t.co/Y8F48FKHFG https://t.co/l1dzeyLcpW Somehow, even Tom Cruise is now caught up in the Ukraine scandal.\n\nFull coverage: https://t.co/K9Qttqvtv8 https://t.co/HxBGn35XDL RT @AnandWrites: @winnerstakeall @TheDailyShow Check out my extended interview with @TrevorNoah on @TheDailyShow. We really got into it.\n\nh… Trevor weighs the case for impeachment against Rudy Giuliani, @michaelkosta explores President Trump's moral blindness, and Anand Giridharadas discusses \"Winners Take All.\"\n\nListen to today’s Ears Edition podcast on @Spotify: https://t.co/ohDz9MhFZ9 https://t.co/ebqxeBbNEH Welcome to the impeachment trial of Rudy Giuliani: personal attorney to the president and anus of the entire Ukraine operation. https://t.co/XBngouKETb RT @thedailybeast: .@TheDailyShow's Trevor Noah puts \"unhinged\" Rudy Giuliani on trial for impeachment https://t.co/Q7SiHQvU2C @michaelkosta @seanogallagher Here's the full piece with @michaelkosta: https://t.co/CKRkr5xfRO Here’s the full interview with @AnandWrites: https://t.co/Zb6TmJkNtF TONIGHT: Is Trump too dumb to get impeached? According to @michaelkosta, maybe…\n\n📸: @seanogallagher https://t.co/wWI9lAnfZw Welcome to the impeachment trial of Rudy Giuliani: personal attorney to the president and anus of the entire Ukraine operation. https://t.co/rNcUyfYbWD American Beauty (1999) https://t.co/p7rR56DIlw TONIGHT: @AnandWrites is here to talk about his book @winnerstakeall!\n\n📸: @seanogallagher https://t.co/MwLc54f4WV TONIGHT: College athletes in California can finally get paid 💸 https://t.co/814pS5wxSV Not again https://t.co/NdKHCzzM62 Lincoln: “Those who deny freedom to others deserve it not for themselves.” \n\nFDR: “The only thing we have to fear is fear itself.” \n\nTrump: “Look, at least get the snake guy on the phone and get me an estimate.” https://t.co/inbtEbV43q Elon Musk heralded the future of space travel in a midnight press conference, when all normal announcements are made.\n\nFull piece: https://t.co/fXc7ApR1lr https://t.co/3zQCS6LojQ When Trump hides documents on a separate server, it sounds like this: https://t.co/Sa9jbk1Qne A reporter who took down a Good Samaritan for old, racist tweets was in turn taken down for…you guessed it: old, racist tweets. @ronnychieng reports. https://t.co/xBHRtEoEzp Presidential candidate Mark Sanford is challenging Trump for the Republican nomination. \n\nExtended interview: https://t.co/l1M0nDXVm5 https://t.co/AbrWaMdhDy Every day, more Americans are in favor of impeaching Trump. But luckily for him, there’s a loyal base of supporters who will never leave his side: Republican lawmakers.\n\nFull piece: https://t.co/oNmyBB1I2y https://t.co/VqDzdffcrT .@RoyWoodJr expertly protects the identity of the 6’4\", brown-haired, blue-eyed whistleblower named Kevin.\n\nFull coverage: https://t.co/oNmyBAK7b0 https://t.co/6cF4Cob1TS .@roywoodjr reports on President Trump's whistleblower scandal, @ronnychieng reacts to a viral \"beer money\" fundraiser, and GOP presidential candidate Mark Sanford stops by.\n\nListen to today’s Ears Edition podcast on @Spotify: https://t.co/ohDz9MhFZ9 https://t.co/c2SgvuYpvP From last night: Let’s add Australia to the mix ⬇️ https://t.co/e6yCfcAHvy Here's the full piece with @ronnychieng: https://t.co/BSRBx2QaaI Here’s the full interview with @MarkSanford: https://t.co/l1M0nDXVm5 TONIGHT: Donating to charity isn’t always what it’s cracked up to be. @ronnychieng has more with a new Everything Is Stupid:\n\n📸: @seanogallagher https://t.co/wQBVEGH6Xl What started as a scandal involving a call to Ukraine is now snowballing bigly. https://t.co/uDmuse0Sz2 RT @ronnychieng: On @thedailyshow tonight talking about beer money. 📷 @seanogallagher https://t.co/pK54JorL7D TONIGHT: 2020 Republican presidential candidate @MarkSanford is here! https://t.co/k2OUWvSvEI TONIGHT: The love Trump gets from his Republican supporters in Congress is unimpeachable. https://t.co/LKn9KTReCH “A phone call with - hear me out - Australia” https://t.co/Acaz7sM060 THIS WEEK: @MarkSanford, @AnandWrites, @JackieWoodson, and @Ninja stop by! https://t.co/3gR1csguQN When the subpoena hits https://t.co/jxGuj4SX31 INSPIRING: This Republican Congressman Loved President Trump So Much He Also Committed a Career-Ending Crime https://t.co/37oGbXjHCx Wonder why Fox &amp; Friends doesn’t want to say the word SERVER… https://t.co/oBTKyKK3r4 .@jameelajamil talks body positivity, body neutrality and being a “feminist in progress.” Full interview: https://t.co/jI6pFp8gkM https://t.co/ek1Jc9i6jb RT @TheDailyShow: We made a browser extension that turns Trump's tweets into crayon scribbles. Works really well with this one! \n\nDownload:… If Trevor could ask Trump one question, what would it be? #BetweenTheScenes https://t.co/bqcer7MrW5 .@JameelaJamil talks body positivity and her personal journey with body neutrality. Full interview: https://t.co/jI6pFoQEWc https://t.co/5qfKuSgY8q In their defense, how was the Met supposed to know this 2,000 year-old Egyptian coffin belonged to Egypt? https://t.co/V4HBoDydlu Trump may not understand what ‘quid pro quo’ means. The Sopranos helps him out.\n\nFull coverage: https://t.co/q9Onqv46ad https://t.co/h8nOWpig4o Trump could have done a lot more with his *one* impeachment. Full chat: https://t.co/s7oKJegZLh https://t.co/d7wAZmwFbw .@nickcannon makes time between being a father, hosting TV and radio shows, and getting a Bachelor’s in criminology to laugh at his pencil legs.\n\nFull interview: https://t.co/pgzZXk2kVs https://t.co/0LiyUS3pZY .@RoyWoodJr attends the Republican primary debate of candidates challenging President Trump in 2020. It goes about as well as you’d expect. https://t.co/zPX07JTpxl RT @EnthusiasticCy1: @TheDailyShow https://t.co/nbNuhC4rIE RT @narchyforpeace: @TheDailyShow https://t.co/84BE3JZE1v Boris Johnson addressed the U.N. warning of a robot revolution, but we may have bigger problems to face right now.\n\nFull piece: https://t.co/gDQ4RuVSWL https://t.co/k8iK0qYBOZ “We had extras who were like, ‘We can't believe we get to come to a show about Chicago, and we don't have to play a corpse.’ You know? ‘We get to have fun today.’” \n\nBashir Salahuddin and @Diallo Riddle talk about @southsidechi and sharing the lighter side of Chicago. https://t.co/3yux1bBXuf What’s so suspicious about the White House hiding Trump’s phone logs and Ukraine’s leader speaking like a hostage?\n\nWatch the full act: https://t.co/54gCo6UjLc https://t.co/wZCx5BlDs0 The most important story of the day: where did Lenny Kravitz’s sunglasses go?\n\nOur full investigation: https://t.co/MHQodegQfz https://t.co/zTgQgXfl9w If Trevor could ask Trump one question, what would it be? #BetweenTheScenes https://t.co/v9K73igx2H RT @KaeNel72: @TheDailyShow https://t.co/cCwCCnWkMg RT @mattysmoof: @TheDailyShow https://t.co/O9GHOcIOzk RT @justintbarnard: @TheDailyShow https://t.co/WpMKgcXUWc RT @amberthowell: @TheDailyShow https://t.co/gNTtQR8GiG RT @ccsaintdawg: @TheDailyShow https://t.co/RG9hMOa38a RT @sooyan00: @TheDailyShow Dear Diary, https://t.co/TpfLeRMtvH “The Good Place” star Jameela Jamil knows what the afterlife has in store. Extended interview: https://t.co/jI6pFoQEWc https://t.co/ycyomSRxy1 RT @ravenlynne: @TheDailyShow https://t.co/GpN07E6vAp RT @JoffCallaghan: @TheDailyShow https://t.co/NDlkywSBqq RT @ccsaintdawg: @TheDailyShow https://t.co/4OGvdWZds5 RT @geeker_out: @TheDailyShow https://t.co/V6VrfR22A4 RT @simon_didnt_say: @TheDailyShow https://t.co/X1yTjxdsbx RT @TypeSafe692: @TheDailyShow https://t.co/C67WjHoaAF RT @EW2Galaar: @TheDailyShow https://t.co/qcLdkOU3Ce RT @brianrdhamm: @TheDailyShow https://t.co/LIZtBdV32M RT @BobbieHill: @TheDailyShow On the eve of #SNL preview tomorrow night.... https://t.co/K93drV4lr5 RT @hallc28: @TheDailyShow https://t.co/iiEbgMMWcA Reply with a screenshot of your favorite Trump tweet in crayon scribble and we'll RT! We made a browser extension that turns Trump's tweets into crayon scribbles. Works really well with this one! \n\nDownload: https://t.co/pgL64CCJ00 https://t.co/YGFqnT43dd Trump can’t even get impeached right. @DesiLydic sounds off: https://t.co/GaT8w0EZRE The news these days... https://t.co/1DJzr3IxUW https://t.co/WCDmgnEU6F According to a CIA whistleblower, White House officials tried to hide Trump’s phone call with the Ukrainian president on, you guessed it, a private server.  #tbt\n\nFull piece: https://t.co/54gCo6UjLc https://t.co/MM2YyTj8yi RT @jameelajamil: He’s such an amazing interviewer, kind, well researched and engaging. This is one of my favourite interviews ever. Thanks… Trump doesn’t speak Ukrainian but will happily tell you what their president meant: no pressure.\n\nFull coverage: https://t.co/54gCo6UjLc https://t.co/VrArfQi5Kz Last night’s coverage of the whistleblower complaint ⬇️ https://t.co/82Qo5kPaSD RT @TheDailyShow: Anyhoo four years ago Barack Obama used a selfie stick in the White House https://t.co/rV4kzrqlTe 3’D chiss https://t.co/qdlWjEaKIW Trevor unpacks the whistleblower complaint against President Trump, @DesiLydic slams Trump for botching a huge opportunity, and actor @jameelajamil discusses \"The Good Place.\"\n\nListen and subscribe: https://t.co/QUj5m6mNVB https://t.co/jnbfVrb4RR Here's the full piece with @DesiLydic: https://t.co/t0NghOwhxk Here’s the full interview with @jameelajamil: https://t.co/jI6pFp8gkM TONIGHT: Will Trump’s impeachment be a blockbuster like the movie “Avatar” or a total waste of time like the movie “Avatar”? @DesiLydic weighs in:\n\n📸: @seanogallagher https://t.co/lJEW6TdQHI Did this whistleblower’s report just blow the lid off the Trump presidency? https://t.co/DKy8eIpHQw TONIGHT: Actor and activist @jameelajamil is here! https://t.co/2DXww0UUMV TONIGHT: The whistleblower’s complaint is out and, yes, there is a NEW scandal involving a private server #tbt https://t.co/p6sDa4OF6K Join the writers of The Daily Show for a night of stand-up comedy! Shows on Friday, October 4th and Saturday, October 5th, only at Arlington’s very own @cinemadraft. Get your tickets before they sell out!\n\n►Tickets: https://t.co/O5Jl0d2vgQ https://t.co/gByK0LgFhJ Anyhoo four years ago Barack Obama used a selfie stick in the White House https://t.co/rV4kzrqlTe Boris Johnson address the U.N. about the most important issue facing his country and the world at large: the impending robot apocalypse.\n\nFull act: https://t.co/73cN55RkU8 https://t.co/bN4V5rA9CI “I just took a DNA test turns out I’m 100% that witch\" https://t.co/9O4rZg6Ua6 NYT: Whistleblower Accuses White House Of Cover-Up\n\nCNN: Complaint Alleges Abuse Of Power In Oval Office\n\nFOX NEWS: It Is A Miracle Just To Be Alive So Take A Moment To Appreciate This God-Given Privilege By Stepping Away From Your Screens And Going Outside On This Gorgeous Day Joseph Maguire... YOU JUST GOT SWALWELL’D https://t.co/yALjLX8Vp5 Trump acid washing his servers right now https://t.co/pTHFIrGVmj Trump may not understand ‘quid pro quo.’ The Sopranos helps him out.\n\nFull coverage: https://t.co/q9Onqv46ad https://t.co/eFe6YF4Q33 Full coverage of Trump’s Ukraine call: https://t.co/q9OnqvlHyN https://t.co/NoiARyNtcJ RT @TheDailyShow: Yeah but 5 years ago Barack Obama wore a bike helmet, the worst scandal in presidential history. https://t.co/bmG571AXvG Last night’s coverage of the Ukraine call fallout ⬇️ https://t.co/cq498zbe4b President Trump responds to his impeachment inquiry by releasing a summary of his call with Ukraine's president, and @NickCannon discusses his personal and professional journey.\n\nListen and subscribe: https://t.co/ePJBI3Fh53 https://t.co/MeMkZHFlpN Here's the full piece with @roywoodjr: https://t.co/e4I3am9riY Here’s the full interview with @NickCannon: https://t.co/pgzZXkjWk2 Full coverage of Trump’s Ukraine call fallout:\nhttps://t.co/q9OnqvlHyN https://t.co/kahQLuleXh TONIGHT: @roywoodjr meets the Republican candidates looking to take Trump down.\n\n📸: @seanogallagher https://t.co/F4S2os4wxt Impeachment: the constitutional way to swipe left on a president. Will Trump’s Ukraine call make it happen? https://t.co/ibzZvjCioH TONIGHT: @NickCannon is here!\n\n📸: @seanogallagher https://t.co/hWliQSK1Zy TONIGHT: Trump’s call to Ukraine’s president could very well be an impeachable offense, but he’d at least like some points for transparency. https://t.co/pQUt6xOsrX Watching Trump right now https://t.co/mypmDGI9Dj I would withhold foreign aid for a chance to hear Trump read that name off a teleprompter https://t.co/imtViLTPh0 Yeah but 5 years ago Barack Obama wore a bike helmet, the worst scandal in presidential history. https://t.co/bmG571AXvG The most important story of the day: where did Lenny Kravitz’s sunglasses go?\n\nOur full investigation: https://t.co/MHQoddZfo1 https://t.co/iCHQTNZXIt Trevor really thinks this might be the scandal to sink Trump, @ronnychieng isn’t so sure.\n\nFull piece: https://t.co/lC6RSSKHMG https://t.co/JhEnotwrdN Rudy Giuliani takes a licking, but keeps on licking https://t.co/2p0f9eIF1X Trump manages to use the wrong \"they're\" even when he speaks https://t.co/aIcdpcqKnT Are we sure Trump knew who he was talking to on this call https://t.co/1tgWxTthIc Trump is facing an impeachment inquiry, so get off Twitter while you can.\n\nFull coverage: https://t.co/h0hpaimvvh https://t.co/VI8ubMtE9P From last night ⬇️ https://t.co/XVSW3FzocX Nancy Pelosi announces an impeachment inquiry against President Trump, @ronnychieng refuses to get his hopes up, and California Governor @GavinNewsom sits down with Trevor.\n\nListen and subscribe: https://t.co/hNvEaBMYBp https://t.co/5VJW6T3Ng2 Here's the full piece with @ronnychieng: https://t.co/lC6RSSKHMG Here’s the full interview with @GavinNewsom: https://t.co/nI5eUrbqUo RT @GavinNewsom: Talking about CA v. Trump, our global climate crisis, and impeachment on @TheDailyShow tonight -- make sure to tune in! ht… Trump may have invited a foreign government to meddle in a U.S. election. No, not that one, the next one. https://t.co/mrEpF0Mz5F TONIGHT: Is Ukraine finally the scandal that gets Trump impeached? @ronnychieng isn’t so sure: \n\n📸: @ruminasean https://t.co/wn3lwPtyVt TONIGHT: California governor @GavinNewsom is here!\n\n📸: @ruminasean https://t.co/U4b26nHsz3 TONIGHT: It’s finally happening: Trump may face articles of impeachment. https://t.co/2ihy4sW61P RT @peopleschoice: For its impeccable comedic timing and 'cause we adore @TrevorNoah, we're happy to nominate @TheDailyShow for #TheNightti… This 2014 masterpiece, as featured in The Daily Show's Trump Presidential Twitter Library, only gets better with time. https://t.co/6P4oKDNXo1 https://t.co/8TR8tAmUBv BREAKING: The Daily Show reacts to Trump impeachment inquiry on TikTok https://t.co/bndGfaT0QE We’re nominated for Best Nighttime Talk Show at the @peopleschoice Awards! #TheDailyShow #TheNighttimeTalkShow #PCAs\n\nMake your voice heard in *the* most consequential election of our time. Vote here:\nhttps://t.co/yAAwJiBUdm https://t.co/B4LCL4eKmO Trump’s rollbacks of species protection laws have led to a rise in trophy hunting. But what if the tables were turned?\n\nFull piece: https://t.co/XGLfzXA8nN https://t.co/v62kBoyLfO Double check your registration status and ensure your voice is heard: https://t.co/Na85A2DXbt Looks like two “before” pictures https://t.co/gFjVE2AsjP One more look at this 🔥🔥🔥 #Emmys https://t.co/ecIIbyDeV9 \"Because Trump is such a visceral assault on the senses, I think people have forgotten the power of voting for something as opposed to against something.\"\n\n#NationalVoterRegistrationDay #BetweentheScenes https://t.co/An6GXX0tU7 RT @roywoodjr: It’s been one day since my lip accidentally touched a public water fountain. As I await a bottom lip donor, the Emmys invite… Scientists at MIT have invented a new color called ‘the blackest black’ which absorbs 99% of light. @roywoodjr has some thoughts.\n\nFull piece: https://t.co/t2HjsOJ4t3 https://t.co/ipFNmr3hM8 “We actually know that these consequences will face us during our lifetime, and it is already happening now, and it will get worse.”\n\n@GretaThunberg on why we need to act today to save our planet tomorrow. https://t.co/BNErM5mnTa The Hamptons: vacation site for the rich and famous and tribal monument controversy site for Native Americans. @michaelkosta has more: https://t.co/UShkxHC5eh MIT scientists announce the creation of the \"blackest black\" material on the planet, and a highly skeptical @roywoodjr weighs in. https://t.co/LxBZPr5P0A Welcome to Fading Dreams: a rehabilitation center that helps former presidential candidates like @ericswalwell and @TheRevAl reintegrate into society. https://t.co/NZEye7hS0N Lou Dobbs’s praise of Donald Trump sounds familiar https://t.co/0AIbRtdnBE Still bitter. #Emmys https://t.co/QpVkxBkiYK Trevor doesn’t take The Daily Show’s Emmy nominations for granted. #BetweenTheScenes #Emmys https://t.co/M5o2gnM2x3 “Viola Davis is the only actor who can win an Emmy, and then have her acceptance speech also win an Emmy. She’s that damn good.\"\n\n@roywoodjr has everything you need to know ahead of the 2019 #Emmys: https://t.co/DGAb9tyIZv After a rash of NFL quarterbacks go down with injuries, many are wondering whether Colin Kaepernick will get the call. https://t.co/6S4FfeNOzb If you’ve played Fortnite recently, you may have been playing with Edward @Snowden.\n\nFull interview: https://t.co/cv7TgMrPI1 https://t.co/ZTMMgGEHiu Justin Trudeau’s blackface flashback backlash: https://t.co/7kkWZjP0Me At their dueling rallies on opposite sides of the country, Warren discusses her plans for a wealth tax while Trump talks about… light bulbs? https://t.co/FwspUDgtJt REVEALED: The true meaning of Trump's \"in any history\" comment https://t.co/a4SsaW4laT “If you’re gonna have the fun of black, you must also take the s**ttiness that comes with being black.”\n\nTrevor lays out a plan to deter people from wearing blackface #BetweenTheScenes https://t.co/vOWrFYgPke .@Snowden breaks down how he ended up in Russia, and what his life has been like there since his exile from the U.S.\n\nFull interview: https://t.co/cv7TgMrPI1 https://t.co/K2vHU3OaYF \"Sir David Attenborough is the Beyoncé of narration. He could narrate a vacuum cleaner commercial and I’d be sittin’ right there ENTHRALLED.”\n\n@roywoodjr's 2019 #Emmys predictions: https://t.co/76mqgqv5jd Justin Trudeau held a press conference to apologize for one blackface incident, and ended up admitting to more.\n\nFull piece: https://t.co/NGqiXaRu5t https://t.co/h0iPC7XhIk Climate activist @GretaThunberg on the #1 thing people can do to help mitigate climate change.\n\nExtended interview: https://t.co/5a8pRMtJ90 #ClimateStrike https://t.co/GioEqzxoAD Justin Trudeau is under fire after multiple instances surface of the Canadian prime minister wearing blackface.\n\nFull piece: https://t.co/2G0wIwwf9D https://t.co/Q1JHRw17oj RT @TheDailyShow: Justin Trudeau’s blackface and brownface photos make for the worst #tbt imaginable. https://t.co/RZ3wDuptN2 Bye bye Bill de Blasio. Our hearts will go on. https://t.co/8jCkElQwAZ RT @TheDailyShow: People who say they're going to raid #Area51 vs. people who actually show up https://t.co/4DICvLJ5Ya Canadian Prime Minister Justin Trudeau comes under fire for wearing blackface, @ronnychieng rants about futuristic technology in bars, and Edward @Snowden discusses his book \"Permanent Record.”\n\nListen and subscribe: https://t.co/FN9QPc9uXB https://t.co/T0U68JPVzt Here's the full piece with @ronnychieng: https://t.co/EYfvVvO30T Here’s the full interview with @Snowden: https://t.co/sm7x6xEuGM TONIGHT: Do you want to go to a bar where everyone knows your name, including the AI bartenders? @ronnychieng has more:\n\n📸: @ruminasean https://t.co/BcraJPKHsd Justin Trudeau’s blackface and brownface photos make for the worst #tbt imaginable. https://t.co/RZ3wDuptN2 Would you let the CIA edit your life story?\n\nFull interview with @Snowden tonight at 11/10c. https://t.co/vuJHY9oiQE TONIGHT: Edward @Snowden joins us to discuss his memoir “Permanent Record.”\n\n📸: @ruminasean https://t.co/jdOD0gK5Fy TONIGHT: If you ignore the xenophobia, Trump’s excitement about his wall is almost cute. https://t.co/Ev6eL9LNos Here’s how @JodiKantor &amp; @mega2e broke the Harvey Weinstein story. \n\nFull interview: https://t.co/Qgvi866xSv https://t.co/hCv0QJtoL7 Will Trump be the Saudis’ knight in shining armor and declare war on Iran?\n\nWatch the entire act: https://t.co/KVeKjWnXzb https://t.co/kgWGVPUBbK New York Times investigative reporter @mega2e explains how she and @jodikantor broke the Harvey Weinstein story.\n\nFull interview: https://t.co/Qgvi85OX0X https://t.co/WrQVjFrlRk People who say they're going to raid #Area51 vs. people who actually show up https://t.co/4DICvLJ5Ya Trudeau just took a DNA test\nhttps://t.co/ixf43v51W0 https://t.co/hXU1v7plPM Not sure how serious we should take this given the last promise Trump made to a foreigner was \"I vow to be a faithful husband\" https://t.co/d8npm9NAJs Trump and Saudi Arabia have forged a deep bond over their shared love of cold, hard cash.\n\nWatch the entire act: https://t.co/KVeKjWFyXL https://t.co/U6nx8ZXOF3 Thank you Kanye, very cool! https://t.co/jfLjaketip Tensions flare over an attack on Saudi Arabia's oil supply, @roywoodjr throws shade at the blackest material on Earth, and @jodikantor and @mega2e discuss \"She Said.\"\n\nListen and subscribe: https://t.co/wmTvn7YHOX https://t.co/Sy4SVc6hoM Here's the full piece with @roywoodjr: https://t.co/LsXuqo25kU Here’s the full interview with @jodikantor and @mega2e: https://t.co/Qgvi85OX0X cc: @BillNye https://t.co/jfLjaketip Is Trump saying America should go to war on behalf of Saudi Arabia because they buy stuff in cash? https://t.co/ghr0YiLmIB TONIGHT: MIT scientists claim to have developed the blackest black on the planet, but @roywoodjr isn’t buying it.\n\n📸: @ruminasean https://t.co/569tG2QG8r TONIGHT: New York Times investigative reporters @jodikantor and @mega2e are here to talk about their new book “She Said.”\n\n📸: @ruminasean https://t.co/1Y5s9jHWV1 TONIGHT: Colin Kaepernick is re-submitting his résumé to the NFL 👀 https://t.co/KLjCKHiihH Heads up Alabama https://t.co/DC7iNbUiEo REVEALED: The true meaning of Trump's \"in any history\" comment https://t.co/mbn6Sk3GzG Trump “knows a guy” who “can’t stand his kids.”\nFull piece:\nhttps://t.co/VumeYz5PC6 https://t.co/WjOuygRz8k Teen climate activist @GretaThunberg spent two weeks sailing across the Atlantic in a zero emissions boat.\n\nWatch her full interview with Trevor:\nhttps://t.co/5a8pRMtJ90 https://t.co/7W0YJ2maje Elizabeth Warren knows how to hold a rally: a one-hour speech followed by four hours of selfies. https://t.co/ZFDM78nuRA RT @TheDailyShow: In dueling rallies, Warren discusses her plans for a wealth tax while Trump talks about… lightbulbs? https://t.co/I9jcZMh… Sean Spicer appears on \"Dancing with the Stars,\" Elizabeth Warren and President Trump host very different rallies, and Bashir Salahuddin and @diallo discuss South Side.\n\nListen and subscribe: https://t.co/iEUKqkZILW https://t.co/vMaBHfvVjI Here’s the full interview with Bashir Salahuddin and @Diallo: https://t.co/nQSrRrRtdx In dueling rallies, Warren discusses her plans for a wealth tax while Trump talks about… lightbulbs? https://t.co/I9jcZMhNcC TONIGHT: Bashir Salahuddin and @diallo Riddle are here to talk about their Comedy Central series @southsidechi!\n\n📸: @ruminasean https://t.co/CrXwMf7ijQ We’re nominated for a @peopleschoice Award! #TheDailyShow #TheNighttimeTalkShow #PCAs\n\nYou can vote 25 times per day and today each vote counts twice. RT this to vote once, or cast 50 completely legal votes here: https://t.co/iLozZJVdMp https://t.co/05Idz4d8qI TONIGHT: If there’s one thing America loves, it’s a disgraced former press secretary making a comeback on a reality dance competition. https://t.co/etw03J7OVu tfw you can't ask any questions about Kavanaugh\n\nFull interview with Justice Sonia Sotomayor: https://t.co/tlhocXU213 https://t.co/UnwjJibtrP “The draw to play to TV affects every human being” - Justice Sonia Sotomayor on why the Supreme Court isn’t televised.\n\nFull interview: https://t.co/tlhocXU213 https://t.co/LldJLGxP3Q And Jesus said unto them, \"Text 1899 to help Sean Spicer's salsa triumph over James Van Der Beek's foxtrot\" https://t.co/gkrZzVjNrl Actress Felicity Huffman was sentenced to 14 days in prison, but may have acted her way to a light ruling. https://t.co/hVwJ0Vtp7S Lou Dobbs thinks the Trump White House is doing so well he accidentally broke into a rap. https://t.co/rbwjdIoQYf Lou Dobbs can please Trump in a way few others can. https://t.co/M7Fqvopqfp Brett Kavanaugh faces a new sexual assault claim, President Trump threatens Iran after an attack on Saudi Arabia, and Supreme Court Justice Sonia Sotomayor discusses \"Just Ask!\"\n\nListen and subscribe: https://t.co/2izku6lMs7 https://t.co/N0RUAVMLRY Here’s the full interview with Sonia Sotomayor: https://t.co/tlhocXU213 Brett Kavanaugh, the only Supreme Court justice sponsored by Bud Light, faces another wave of sexual misconduct allegations. https://t.co/4KzupBGYig TONIGHT: Justice Sonia Sotomayor is here!\n\n📸: @ruminasean https://t.co/K65iC6C46w This North Korean propaganda is getting a little over the top. https://t.co/ISTrUxw9FJ TONIGHT: Trump’s response to the new Kavanaugh allegations makes us wonder: Does the president understand how the justice department works? https://t.co/tKqRSkwbOz Donald Trump is the Jon Taffer of political rallies. This is: Rally Rescue. https://t.co/YkL7KGckCk All new episodes this week!\n\nMonday: Sonia Sotomayor\nTuesday: Bashir Salahuddin &amp; @Diallo\nWednesday: @jodikantor &amp; @mega2e\nThursday: @Snowden https://t.co/6zW0ATJvgF Technology is all around us, but could it end up inside us? @dulcesloan reports: https://t.co/w8y7ECUVdu RT @TheDailyShow: “What we should do as individuals is to use the power of democracy to make our voices heard and to make sure that the peo… “Food is how you say ‘I love you.’ It's how you say ‘I'm sorry’ to someone. It connects you to your roots, where you came from.” \n\n“Queer Eye” star @antoni talks about his cookbook “Antoni in the Kitchen” and the significance of food in his life. https://t.co/0KUvlDbd2C Climate activist @GretaThunberg spent two weeks sailing across the Atlantic. Her first thought when arriving in New York: it smells.\n\nFull interview: https://t.co/cxARYKWMjw https://t.co/10pc9RGmqb Africans are so grateful for American trophy hunters they want to return the favor.\n\nFull piece: https://t.co/3J4NEtzyF0 https://t.co/LY5wljvPZ7 Which parents are most worried about tech overload for their kids? Not the ones you’d think. Full report from @TheLewisBlack: https://t.co/mGhS4bDtLi https://t.co/ubVAdhHE2s Microsoft president @BradSmi discusses the need for ethical principles to help regulate the growth and development of digital technology. https://t.co/FNvYICasNM Here’s Trevor’s full interview with climate activist @GretaThunberg: \n\nhttps://t.co/5a8pRMLk0y Are you a former presidential candidate struggling to readjust to a normal life? The Fading Dreams Candidate Reintegration Center can help. https://t.co/XSc6bxrQ4F .@TheLewisBlack is #BackInBlack to talk about kids and screen time. https://t.co/Ob3G7kmHXj Trump takes a stand against vaping on behalf of Melania’s son. https://t.co/ce5mdfggyo RT @GretaThunberg: My full interview on @TheDailyShow with @Trevornoah https://t.co/khde5CmxAQ State &amp; local governments prescribe Big Pharma a heavy dose of accountability. https://t.co/uAAZCh9O8i “Democrats have firm ideas about what being electable means. But the fact that Trump is president means that literally anyone is electable.” \n\nNew York Times columnist @jbouie gives his take on the third Democratic presidential debate and the meaning of electability. https://t.co/KRrPGSgEI0 “What we should do as individuals is to use the power of democracy to make our voices heard and to make sure that the people in power cannot continue to ignore this.” - Climate activist @GretaThunberg https://t.co/4feLq7QhWU RT @BradSmi: One of the highlights of this week was chatting with @Trevornoah on @TheDailyShow! See the full episode here: https://t.co/Fvs… At Fading Dreams Candidate Reintegration Center, ex-presidential contenders like @ericswalwell and @TheRevAl learn how to put their White House hopes behind them. https://t.co/CT6iz18Oge Bernie, you good? Full #DemDebate coverage: https://t.co/c09HPWBEXN https://t.co/jPCxgZ8Yka Dems showed so much love for Barack Obama last night that Michelle might need to come get her man.\n\nFull coverage of last night’s #DemDebate: https://t.co/c09HPWBEXN https://t.co/n9ynDFxBwz RT @ericswalwell: Watching the #DemocraticDebate last night almost gave me a relapse, but I'm good. \nReally. \n(I'll always love Iowa.) http… RT @GretaThunberg: “I think what we should do as individuals is to use the power of democracy to make our voices heard and to make sure tha… Are you a former presidential candidate having trouble reentering society? Welcome to Fading Dreams Candidate Reintegration Center.\n\nFeaturing @ericswalwell and @TheRevAl. https://t.co/5md8W80IvN At the third round of 2020 Democratic debates in Houston, the moderators play hardball, Andrew Yang plays Oprah, and Castro comes after Biden. https://t.co/hKgbclbJ1E Trevor covers highlights of the third 2020 Democratic presidential debate, and New York Times opinion columnist @jbouie gives his take on the night.\n\nListen and subscribe: https://t.co/tCDaGnOuS9 https://t.co/NLEHEfNUzH Here’s the full interview with @jbouie: https://t.co/LzekAD5n9r RT @RealBenBailey: @TheDailyShow I am in the Cash Cab and just got sent this!!! Lol ⚡️ “The Daily Show Live Tweets Houston #DemDebate”\n\nhttps://t.co/K1f4PcGMfC Trevor’s LIVE coverage of the Democratic debate in Houston. #Votegasm2020 #DemDebate https://t.co/ED2y1QdL8S Fire up the phonograph we're going LIVE at 11/10c! Vice President Biden, our next question is for you: What year do you think it is Tonight at 11/10c: LIVE #DemDebate analysis with @nytopinion columnist and @CBSNews analyst @jbouie! https://t.co/P0K8VKJk9X ...Right? #YangGang #DemDebate https://t.co/tEKMxHV56a Good news: We've reached the midway point of the first third of the opening night of this six-week #DemDebate RT @Trevornoah: Yeah I said it. I'm my grandmother's favorite. 😂https://t.co/917XBNek9O \"DEBRA MESSING VERY UNFAIR TO ME\" https://t.co/goZs6oxRbd Props https://t.co/7OfHVBjD6l Achievement Unlocked: Elder Abuse\n#DemDebate https://t.co/srZXph8Mn9 Savage stuff from ABC https://t.co/781x52DpIv Bernie earlier this morning https://t.co/sFjd4KvYTU Not to be outdone by #YangsDebateSurprise, Julian Castro just bit the head off a live bat https://t.co/2GGs4izIY0 BETO: We need to stop gun violence\nBOOKER: I can unite the country\nYANG: Guess what, America? You just got in THE CASH CAB JUST IN: Jorge Ramos has announced that, f*ck it, he's jumping in the race too https://t.co/LsB670inNi BREAKING: The start of the #DemDebate will be delayed 15 minutes because Joe Biden accidentally wandered into an Applebee's https://t.co/xuVPJYgjst Swear @roywoodjr hit it without ever hearing the song https://t.co/ixf43v51W0 https://t.co/0mjLurdh30 RT @Trevornoah: New upload on the YouTube! Watch the full clip here 👉🏾 https://t.co/sEDVx5cwXO If you enjoy it, share it with your friends!… .@GretaThunberg sailed from the U.K. to the U.S. in the name of climate change.\n\nExtended interview: https://t.co/dCFVkdKoLm https://t.co/7Yvvprv7SJ Trump takes a stand against vaping on behalf of Melania’s son. https://t.co/2k6vp6rA9h Climate activist @GretaThunberg on the #1 thing people can do to help mitigate climate change.\n\nExtended interview: https://t.co/Fxm575fEtw https://t.co/l63QEcjYhG Some of the world’s biggest drug dealers are finally paying up https://t.co/p8EAIC3QCM President Trump addresses concerns about vaping-related deaths, @TheLewisBlack talks about the effects of screen time on kids, and activist @GretaThunberg stops by.\n\nListen and subscribe: https://t.co/zuBszzQEgr https://t.co/6uZVWqn1Qc Here’s the full interview with @GretaThunberg: https://t.co/BB2xTS7I4O @TheLewisBlack @ruminasean Here's the full piece with @TheLewisBlack: https://t.co/Ivd1FxFDG4 TONIGHT: @TheLewisBlack sounds off about kids and their damn phones.\n\n📸: @ruminasean https://t.co/OhpNGXwLdO Drug companies are starting to pay the price for their role in the opioid crisis. https://t.co/cTUmxXt0Qq TONIGHT: Climate activist @GretaThunberg is here!\n\n📸: @ruminasean https://t.co/nhgr5016MP TONIGHT: Donald Trump moves to ban flavored e-cigarettes, inspired in part by his wife’s son, who is coincidentally also his own son. https://t.co/ts4LtwlhHD RT @TheLewisBlack: TUNE IN NOTICE! NEW Back In Black Segment\nTonight, Sept 11 @ 11pm/10pmC on @TheDailyShow on @ComedyCentral (Photo: @rumi… Africans are so grateful for American trophy hunters they want to return the favor.\n\nFull piece: https://t.co/3J4NEtzyF0 https://t.co/94fb0QMr6H Trophy Hunting: good, bad, or definitely bad?\n\nFull segment: https://t.co/FKdCNNxdu9 https://t.co/bUikYcQ21h Where did Trevor get his accent skills? #BetweenTheScenes https://t.co/gXvc2qrTLf RT @iansherr: Had a great time discussing #biohacking and implanted chips with @dulcesloan and @TheDailyShow!\n\nhttps://t.co/DW2njcqFKw Six years ago today, Donald Trump tweeted this heartfelt message on 9/11. \n\nIt is forever memorialized in The Daily Show's Donald J. Trump Presidential Twitter Library #DailyShowLibrary https://t.co/Y8NfDoXIYJ What will Apple do after the iPhone 11 Pro Max? The iChicken Sandwich? https://t.co/hnZkJjmrSU RT @TheDailyShow: 17 Years of Donald Trump's Weird Lies About 9/11 https://t.co/5TMIt0QlyR Apple rolls out its latest iPhones, President Trump rolls back restrictions on trophy hunting, and Microsoft President @BradSmi discusses his book \"Tools and Weapons.\"\n\nListen and subscribe: https://t.co/wcIFD9v70m https://t.co/HgYJwNCMV1 Here's the full piece with @dulcesloan: https://t.co/pkj1fhw2T1 RT @BradSmi: It's always fun talking with @Trevornoah. https://t.co/545mTbVIQl Here’s the full interview with @BradSmi: https://t.co/Gdgl3wv5Rj Wait this was real? https://t.co/dJyJhVKPcZ TONIGHT: Microchips: the way of the future or the end of privacy? @dulcesloan reports: https://t.co/eaWRslqrmJ RT @TheDailyShow: BREAKING: John Bolton’s mustache has been lowered to half-mast https://t.co/ocnEym7Y6f Why is trophy hunting still a thing in 2019? Trevor investigates: https://t.co/ndiGY9VKjp TONIGHT: @Microsoft president @BradSmi is here to talk about his new book #ToolsAndWeapons! https://t.co/qYEYuBxeZb TONIGHT: Did Trump fire national security adviser John Bolton or did Bolton resign? https://t.co/8sb8Ue4rNe .@michaelkosta and @jaboukie have the perfect summation of Bianca Andreescu's win over Serena Williams.\n\nFull segment: https://t.co/3naBha96aJ https://t.co/5XeDugdiv1 We’re nominated for a @PeoplesChoice Award! You can only vote 25 times per day. Pace yourselves.\n\nTo vote, RT this or send a tweet with these hashtags: #TheDailyShow #TheNighttimeTalkShow #PCAs https://t.co/EOjGZXWHly .@chrissyteigen helps raise awareness for Trump’s serious medical condition. https://t.co/pd4lrp2t2V Imagine getting fired for the advice \"Don't throw a 9/11 party for the Taliban\" https://t.co/wkZf9v6PbN BREAKING: John Bolton’s mustache has been lowered to half-mast https://t.co/ocnEym7Y6f John with the wind! Bolton OUT. Who will be the next to go?! #TheCelebrityAppresident https://t.co/KuLWJ5Xm8m Prosecutors struggle with Felicity Huffman's college cheating scandal sentence.\n\nFull segment: https://t.co/lib3NKuiHM https://t.co/WqVR0YMzA8 RT @TheDailyShow: This weekend in Trump beefs: hurricanes, Chrissy Teigen, and the Taliban. https://t.co/7lst4yXQIQ Trevor gives a rundown of President Trump's latest beefs, @michaelkosta and @jaboukie cover sports, and @antoni discusses his book \"Antoni in the Kitchen.”\n\nListen and subscribe: https://t.co/uBaO0X68oJ https://t.co/J1TraFuDsI Here’s the full interview with @antoni: https://t.co/usB0xy8Fuw This weekend in Trump beefs: hurricanes, Chrissy Teigen, and the Taliban. https://t.co/7lst4yXQIQ Trump sadly rolling up an unused \"WELCOME TO AMERICA, THE TALIBAN!!!\" banner he had been working on for weeks Where Trevor’s accent skills came from and why he’s his grandmother’s favorite grandchild. #BetweenTheScenes https://t.co/jmmKs8nYVF TONIGHT: “Queer Eye” food expert and author @antoni is here to talk about his new cookbook “Antoni in the Kitchen”!\n\n📸: @ruminasean https://t.co/tiiYW40cHX .@ChrissyTeigen’s tweet at Trump was too vulgar for the news to repeat. Luckily, we’re not the news. #PresidentPAB https://t.co/AmmY02zdCg BUILD, BUILD, BUILD! Don Trump’s wall is going up and going up FAST! https://t.co/aQFpL7hK2R RT @TheDailyShow: @VP https://t.co/QqHUeAaXAq @VP https://t.co/QqHUeAaXAq \"Even gun owners are saying, ‘We've got to change what's happening here.’ And we could actually do it. We don't have to rely on just Washington, D.C. along the way.”\n\n@GovernorBullock breaks down his ideas for gun reform. Full interview: https://t.co/Oe0w9RRBii https://t.co/0MJKFyH5ot Me: I’ll have the Taliban over for 9/11\nMe: Wait, the Taliban kills Americans\nMe: I know. I WON’T have the Taliban over for 9/11\nMe: (turns to camera) https://t.co/vNUiHvyMc2 A German amusement park accidentally built a ride that looks like a swastika. https://t.co/tkeUuv4WP8 This week: @antoni, @BradSmi, @GretaThunberg and @jbouie stop by! https://t.co/al8ohWWVwh 🎶 saw me bangin' on the sofa 🎶 https://t.co/Q5lCtQ2CPq .@Jaboukie has a plan to harness toxic masculinity for the good of gun control. Full piece: https://t.co/kZRKRMRUhV https://t.co/RGmeiBOI6W Field Trip!!! @roywoodjr, @desilydic and @ronnychieng give five kids a very special tour of the Donald J. Trump Presidential Twitter Library. https://t.co/AMjMPi0K72 .@jaboukie has a plan to make people care about gun control: turning guns gay. Full piece: https://t.co/kZRKRN9vGv https://t.co/MTGmWMVZVh “We've been wearing our hair for ages. And I think the world is kind of waking up to our beauty and our power.” @TraceeEllisRoss embraces her natural hair and discusses the launch of her hair care brand @PatternBeauty. https://t.co/H903qEws53 Did this dude just opt out of an armed robbery? https://t.co/x57laqeVD1 This is genuinely shocking. Can't believe it wasn’t going to be at Mar-a-Lago. https://t.co/ox2QOBVm8E Biden referred to Obama as “President… My Boss.” Full piece: https://t.co/hIM7WnOVd5 https://t.co/3r9BwQT3kx “Finn Wolfhard got me the job. They asked ‘who would you want to play you grown up?’ and he said me, and then my agent called me and I was like, ‘Wow, that kid’s so powerful!’”\n\nBill Hader on “Barry” and how he got cast in “IT Chapter Two.” Full interview: https://t.co/Py5S1WHZVm https://t.co/8HCkZGkLHl Hong Kong police clash with some creative pro-democracy protesters. https://t.co/cwbyRKUeii Stop trying to make Brexit happen. It’s not gonna happen. https://t.co/BuKNc2nDbB Is it bigger news that the Pope Francis got stuck in an elevator or that the Pope uses elevators to begin with? https://t.co/2ZHVq4VHpp Trevor’s sit-down with his gran in Soweto was just a casual family visit… with a camera crew tagging along. #BetweenTheScenes https://t.co/BkGp2zjz3I .@RoyWoodJr catches us up on the biggest news we missed over the break: the Popeyes chicken sandwich. https://t.co/xYlD33J424 Think Mexico isn’t paying for Trump’s wall? Think again. https://t.co/yybSk4pmqy Brazil’s president, Jair Bolsonaro, fans the flames of the Amazon fires. https://t.co/Jd7RhONBWH How long til we find out his dad gave him a sled called \"Alabama\" https://t.co/AE08eDR33z 🤯\n\nFull segment: https://t.co/8CZbz8ypX0 https://t.co/oDFBJQsngK RT @TheDailyShow: The Amazon is on fire, Brazil isn’t doing enough to stop it, and its president might even want it to happen. https://t.co… Fires threaten the Amazon, @TraceeEllisRoss discusses \"Mixed-ish\" and her hair care brand Pattern Beauty, and @GovernorBullock talks about his 2020 White House bid.\n\nListen and subscribe: https://t.co/rDZI4kcmPb https://t.co/CWWI7Wvcvd Here's the full interview with @TraceeEllisRoss: https://t.co/cgnGbYhTA6 Here’s the full interview with @GovernorBullock: https://t.co/Oe0w9S9c9Q The Amazon is on fire, Brazil isn’t doing enough to stop it, and its president might even want it to happen. https://t.co/pul8kTKXMN TONIGHT: @TraceeEllisRoss is here!\n\n📸: @ruminasean https://t.co/eTmamhfUYL Amy Klobuchar has a joke she'd like you to hear https://t.co/5mh5IQepva TONIGHT: 2020 presidential candidate @GovernorBullock is here!\n\n📸: @ruminasean https://t.co/4d8mpQoLaC TONIGHT: President Trump goes from “Mexico will pay for the wall” to stealing the money from his own military. https://t.co/9oJ4bk1fPA ALERT: Alabama is currently in the path of a Category 5 Tweetstorm \n\n➡️Current forecasts predict 10-15 more tweets by morning with an 80% chance of a clip from Lou Dobbs Tonight\n\n➡️Storm is extremely unpredictable and could veer off at any moment and hit Debra Messing https://t.co/JWNneGmfPb “I was on Saturday Night Live. That’s like the worst show to be on if you have anxiety.” \n\nBill Hader talks Barry, anxiety, and “IT Chapter Two”: https://t.co/Py5S1WHZVm https://t.co/NPiQIe5dyO RT @TheDailyShow: Trump, hiding under the bed: \n\nArmed Robber:\n\nTrump:\n\nArmed Robber: Hurricane Dorian is not going to hit Alabama\n\nTrump:… So, yeah, Trump thought he could change the path of the hurricane with a Sharpie and no one would notice. https://t.co/BjZYbiHIhw Brexit is officially cursed. https://t.co/MvsOcVzR7M How do we control guns without gun control? Make guns gay. @jaboukie explains: https://t.co/DQDpwa8nZ3 https://t.co/FacpyZprSO How could Biden forget Obama’s name? It’s in his campaign slogan.\n\nFull segment: https://t.co/kZEJVwVKmj https://t.co/LBBGS2YdAc Trump, hiding under the bed: \n\nArmed Robber:\n\nTrump:\n\nArmed Robber: Hurricane Dorian is not going to hit Alabama\n\nTrump: ACTUALLY IN THE ORIGINAL PROJECTIONS .@Jaboukie has a plan to make people care about gun control: https://t.co/NrZvBww7Cq RT @TheDailyShow: Guns are gay now. @Jaboukie reports: https://t.co/PbGETbcmFt .@jaboukie pitches a novel way to solve America's gun problem, Trevor examines Joe Biden's latest gaffes, and Bill Hader talks about \"Barry\" and \"It: Chapter Two.\"\n\nListen and subscribe: https://t.co/0PJqO6Hn6y https://t.co/DOzilaPuRX Here’s the full interview with Bill Hader: https://t.co/Py5S1WZBjW Guns are gay now. @Jaboukie reports: https://t.co/PbGETbcmFt .@roywoodjr pens an emotional note home from the front lines of The Great American Chicken Wars https://t.co/hUT6C3Ux5Y TONIGHT: Bill Hader is here to talk about @ITMovieOfficial!\n\n📸: @ruminasean https://t.co/OvEHyASX3Q TONIGHT: Did Trump think he could change the path of the hurricane with a Sharpie and we wouldn’t notice? https://t.co/GFtXIEvYbF Pope Francis got trapped in an elevator before his weekly Vatican address.\n\nFull segment: https://t.co/ytKb6FGK4g https://t.co/UTFkxXAAQa Wow! The GOP's refusal to pass stricter gun control measures is inspiring these brilliant new school designs: https://t.co/BAL0qIMZhw @wxdam https://t.co/HZ4B6aD6gh Somebody take away this man's Sharpie https://t.co/O1Rb6I1GRt Sh*tstorm Donald squares off against Hurricane Dorian.\n\nFull coverage: https://t.co/js6XXzm9Tm https://t.co/m5eWYGCM8I .@roywoodjr is tired of the top 1% having 99% of the chicken sandwiches. \n\nFull Popeyes coverage: https://t.co/i4erh1ob70 https://t.co/c5o1vNNVzR RT @TheDailyShow: Hurricane Dorian meets Sh*tstorm Donald. https://t.co/S4fJWmgXV2 President Trump makes odd claims about Hurricane Dorian, @roywoodjr examines the Popeyes chicken sandwich craze, and @shameikmoore discusses \"Wu-Tang: An American Saga.\"\n\nListen and subscribe: https://t.co/4CCD9fmon7 https://t.co/zQf3Y05DOY Here's the full piece with @roywoodjr: https://t.co/xn6pvmmgCE Here’s the full interview with @shameikmoore: https://t.co/7dZtMCYsSN Donate at https://t.co/nf3sljrK4V to support Hurricane Dorian response efforts in the Bahamas and U.S. Atlantic coast. https://t.co/sygoOErAVe TONIGHT: When is a chicken sandwich more than just a sandwich? @roywoodjr reports on the Popeyes craze. \n\n📸: @ruminasean https://t.co/uDDCDqdfgm Hurricane Dorian meets Sh*tstorm Donald. https://t.co/S4fJWmgXV2 TONIGHT: @shameikmoore is here to talk about playing Raekwon on the new series @WuTangOnHulu!\n\n📸: @ruminasean https://t.co/jFWJT8dGA2 TONIGHT: Donald Trump’s Category 5 disaster of a response to Hurricane Dorian. https://t.co/uh1QaSf5H4 THIS WEEK: We’re back with @shameikmoore, Bill Hader, \n@GovernorBullock and @TraceeEllisRoss! https://t.co/ULxIfHLudS This #LaborDay, we ask the question on everyone’s mind: What does Ivanka Trump actually do? https://t.co/OfEcvL5wZ3 As you gather around the grill today, remember that President Obama once asked for Dijon mustard on his burger, the worst scandal in presidential history. https://t.co/6gYiw8b1aK Nigerian recording artist and songwriter @burnaboy discusses his album “African Giant” and why Afrofusion music is like pizza. https://t.co/qwUxUuzopA Donald Trump is trying to deport Melania, and we’re not going to let him. #DontDeportMelania https://t.co/7JNS6z03e4 “We are criminalizing and vilifying people simply for how they show up in the world, and for seeking asylum, which is a legal human right.”\n\n@AyannaPressley talks immigration, gun violence and Trump’s history of racism. https://t.co/fEQGwW4XyZ Why doesn't he want us to shoe you what he said https://t.co/TjCzbsuk2B The Daily Shoe returns on Tuesday! Number one shoe in late night! https://t.co/gsC9Qi14tC Talk to @dulcesloan about being a woman tomorrow. Here's your Morning Routine from @ComedyCentral https://t.co/VHUvRTtPVQ “We felt like we were being deeply irresponsible in trying to uphold this image of perfection because it was so deeply false.\"\n \n@jadapsmith on her marriage with Will Smith. Full interview: https://t.co/iVRl6Zb7vI https://t.co/olqCcrH8Je Prayers up to all the world leaders who have to sit there while Trump spews his nonsense. #FYC https://t.co/7aNUtsGKoF Donald Trump is trying to deport Melania and we're not going to let it happen. #FYC #DontDeportMelania https://t.co/yZgw4kFkIG #tbt to when Trevor got into a little trouble with the French government. #FYC #BetweenTheScenes https://t.co/REcz8S68vL On the anniversary of the March on Washington, @roywoodjr dives into the history of civil rights marches and activism: https://t.co/uoij8F20DP Five years ago today, Barack Obama wore a tan suit, the biggest scandal in presidential history. #FYC https://t.co/H33y98ypib .@LilNasX and @taylorswift13 both took home @MTV #VMAs last night… but why was only Taylor allowed on the country charts? 🤔🤔🤔 https://t.co/76d9XJr61u And still the best story of 2019… https://t.co/MRZfgfTR40 We got your #VMAs predictions right heeee https://t.co/Fb5yUO9qx8 Trevor’s trip home to South Africa included a surprise meeting with President Ramaphosa. #BetweenTheScenes #FYC https://t.co/InYIqpFlLU What happened to Trevor’s dog, Fufi? #BetweenTheScenes #NationalDogDay https://t.co/HAmsjqW50S We see you, @ShawnMendes… but this year is all about @LilNasX. Catch all of @roywoodjr’s predictions for the 2019 @mtv #VMAs. https://t.co/G4iqXvoM6V If you build it, they will come… in through the Canadian border. #tbt https://t.co/HEWiIGipkM .@jadapsmith on why she and Will decided to go public with the imperfections in their relationship on @RedTableTalk.\n \nFull interview: https://t.co/iVRl6Zb7vI https://t.co/PY7jbKwjN9 How many times will Trump tweet \"I hereby order\" before he realizes it doesn't do anything https://t.co/MRJCH78grW On reparations and white privilege. #BetweenTheScenes #FYC https://t.co/pXqNXkQsl9 .@ronnychieng talks s**t with @BillGates. #ReinventedToilet #FYC https://t.co/uiUZzoy9aT When you notice that Mike Pence always. talks. like. this. #FYC https://t.co/5zXiNndx4s Afrofusion artist @burnaboy sings a pair of songs from his album “African Giant.” https://t.co/USTb7eATbX Trevor on the difference between offending and affecting and how The Daily Show will tackle 2020. #FYC\n\nFull panel: https://t.co/yZjD1MaUyD https://t.co/Gwg6evxqWV .@dulcesloan wants more than equality for Black Women's Equal Pay Day. Full piece: https://t.co/bf068gZYvn https://t.co/CQocpJCjYE Student debt has reached an all-time high of $1.4 trillion across America, or roughly one dollar for every Democratic presidential candidate. https://t.co/z90nE4OUfU RT @roywoodjr: With a new dealer infringing on their territory, The CSC (Chicken Sammich Coalition) looks for a way to slow Popeyes' growth… “Get some bifocals. Take it easy, kid. You know? The war is over. Just lean into aging. Go with brains, good luck.” - @nlyonne to herself after seeing her 13 Emmy nominations for “Russian Doll.” https://t.co/AZAcha27Bt Matrix 4 looking like trash https://t.co/lZ3mO4BMTG The Mooch wants everyone to know he doesn't move his hands like this anymore https://t.co/pS3PHsEdjL When is Trevor’s mom coming on the show? Never. #BetweenTheScenes https://t.co/mTkN1PleGC Nothing but respect for our King of Israel https://t.co/LZLXHK8MvE STEPHEN MILLER: President Trump is the most gifted politician of our time and the best orator to hold that office in generations.\n\nTRUMP: https://t.co/VnQsPwWOnJ MTV Cribs: Soweto featuring Trevor Noah https://t.co/1H8Pknr6Tc Trevor went to Soweto, South Africa to talk to his grandmother about his childhood, her life under apartheid, and what he needs to do to get her to watch The Daily Show. #FYC https://t.co/9O763PCnEH These five lucky children got an exclusive tour of the Donald J. Trump Presidential Twitter Library in Washington D.C. #DailyShowLibrary #FYC https://t.co/a0Q6ovHNwZ .@RoyWoodJr has a 2020 strategy for Democrats that might be crazy enough to work.\n\nCatch the season finale of “This Week at the Comedy Cellar” Friday at 11/10c on @ComedyCentral \n\nhttps://t.co/WD8WHsms5b How can you throw away a BMW when there are kids in America driving Kia Sorentos. https://t.co/q1prJC8GgP 2020 presidential candidate @MichaelBennet takes questions from the audience on how he'd improve education and address gentrification. #TalkingDems #Votegasm2020 https://t.co/pCf2w9m1jO #tbt to this gem from 2004 #FYC https://t.co/Grba8AJowS People on both sides of the aisle are acknowledging America’s white supremacy problem — except Tucker Carlson: https://t.co/i1k7gOANPI We connected the dots and it’s abundantly clear that Donald Trump is trying to deport Melania. #DontDeportMelania \n\nFull piece: https://t.co/M8qD6MbQiX https://t.co/wiIKSmNvj8 “Do not try this s**t if you are black. Or Muslim.” \n\nA Missouri man walked into a Walmart with full body armor carrying an assault rifle to prove a point. Full piece: https://t.co/BRjdoPVOfs https://t.co/wZFE6xueek Reminder that the El Paso shooter’s manifesto is just Fox News fan fiction. https://t.co/DPbUSWqnrJ Tucker Carlson took a surprise vacation after these comments. 🤔 Full piece: https://t.co/x3leoSHuE5 https://t.co/2nTJfyiigt Chris Cuomo claps back at a negative Italian stereotype… with another negative Italian stereotype. https://t.co/ln7fz5vnre If video games have the power to inspire mass shooters, could they also inspire legislators to push a gun bill through Congress?\n\nPlay THE LEGISLATOR: LICENSE TO BILL: https://t.co/d1CAMVB9wT https://t.co/k9luMzVMc4 “Because Trump is such a visceral assault on the senses, I think people have forgotten the power of voting 𝘧𝘰𝘳 something as opposed to 𝘢𝘨𝘢𝘪𝘯𝘴𝘵 something.” #BetweenTheScenes https://t.co/53QFMW0mIt Now that Viacom and CBS are merging, the spinoff possibilities are endless. Full piece: https://t.co/shGHIDAYIJ https://t.co/4c2SPSRrJq RT @LauraHuntley12: #DontDeportMelania brilliant!! https://t.co/PMpVdnREiL RT @CornellWBrooks: The BEST (unlicensed) #immigration lawyer I know, #TrevorNoah, argues #DontDeportMelania. Hilarious. \n\nTHE case for imm… One year ago today - remembering the life and music of Aretha Franklin. #BetweenTheScenes https://t.co/J8eifefjkM Is Donald Trump trying to deport Melania? The evidence points to yes. #DontDeportMelania\n\nFull piece: https://t.co/M8qD6MtrHx https://t.co/xkQwOlgNbZ It’s #NationalRelaxationDay and Jeanine Pirro is here to calm you down. https://t.co/f0eufCGjLd We promise this isn't a Fox News \"vacation\" https://t.co/h2VNMFo1aY True story. We’ll be back on Tuesday, September 3rd after our previously scheduled summer hiatus! https://t.co/KE7YxEe7Bk Is Donald Trump trying to deport Melania? Trevor breaks down the president’s hard-line immigration policies that seem to be aimed at the first lady. #FYC #DontDeportMelania https://t.co/ycQIcLtxPM In Memoriam: John Hickenlooper, Presidential Candidate, 2019 - 2019 https://t.co/rXe2iPS80a RT @ad5roses: Brilliant! 👏😄 #DontDeportMelania https://t.co/Pw5Fa2PMOF Donald Trump’s immigration policies seem to be targeting his wife. Don’t let him do this! #DontDeportMelania\n\nFull piece: https://t.co/M8qD6MtrHx https://t.co/kRjfvgrPXG RT @decider: Trevor Noah's #DontDeportMelania campaign is picking up some serious steam: https://t.co/FpExgyQTkv https://t.co/99zBlQKXeh Every little bit helps, Nancy. #DontDeportMelania https://t.co/6KeHKewVrv RT @DEADLINE: ‘The Daily Show With Trevor Noah’ Asks: Is Donald Trump Trying To Deport Melania? https://t.co/k8hvBFmiKe https://t.co/vEyvxG… RT @StacyLynNews: @TheDailyShow is trying to make #DontDeportMelania a thing and, yes, it IS trending! @wonkfm RT @abestimator: #DontDeportMelania https://t.co/PvRTP8YDEq Trump’s hardline immigration policies are aimed squarely at his wife. We see you Donald! #DontDeportMelania\n\nFull piece: https://t.co/M8qD6MtrHx https://t.co/zd1sW8d3E6 RT @Trevornoah: Don’t do it Donald, #DontDeportMelania https://t.co/dRoT5imqVw RT @MAMRedPill: Leave it to Trevor to finally make sense of Trump’s immigration Executive Actions. #DontDeportMelania https://t.co/AvK9yh8J… RT @carlosrgm_: this one made me laugh way too hard #DontDeportMelania https://t.co/6nJ5VUT9Te RT @PrissyKFJ: #DontDeportMelania 😄🤨 https://t.co/w1WqMX85pg RT @thedailybeast: Trevor Noah thinks Trump wants to deport Melania https://t.co/41kVELgqWt #DontDeportMelania RT @HuffPost: \"The Daily Show\" host creates the wildest conspiracy theory yet. #DontDeportMelania https://t.co/CzO4DUUVoq RT @itswebgeekme: Please #dontdeportmelania who will decorate the White House for Christmas? https://t.co/8fFSvUze1E RT @ElieNYC: Welp, @Trevornoah now owns the internet and we all have to pay him rent.\n#DontDeportMelania https://t.co/FHMcgl6HbS Here's the full interview with @jadapsmith: https://t.co/0AGfTQLW8W RT @sylvierocs: I just got off the daily show on Youtube to see if people will really do it and y’all did #dontdeportmelania https://t.co/N… Here’s the full interview with @BilldeBlasio: https://t.co/vjdujclh3j RT @COACHCP2: This is hilarious #dontdeportmelania has to be one the best trending yet today. https://t.co/TwhHvxXbYZ RT @shepresisted18: Looks like all of trumps immigration policies affect his wife hmm coincidence?? I think not #dontdeportmelania https://… Melania might be the best Trump we have… #DontDeportMelania https://t.co/qEdKrxajTh RT @HuqRezwana: #dontdeportmelania because that was a rofl brilliant piece by @TheDailyShow RT @Crispyr4: How did we not figure this out?? #dontdeportmelania https://t.co/Dh58UmxH3u TONIGHT: Actor and host of @RedTableTalk @jadapsmith is here!\n\n📸: @ruminasean https://t.co/hzdYZF09Ya RT @leogarnier: Trevor Noah descubre los verdaderos motivos de la insistente retórica y las políticas de Trump contra los inmigrantes  #Don… RT @OrtollServando: As Trevor Noah put it: #dontdeportmelania RT @christiann1986: This is a thing now huh... thanks #TrevorNoah  #dontdeportmelania RT @kingforaweek: I should have seen this the whole time. #dontdeportmelania. https://t.co/taabvqKoff Is Donald Trump trying to deport Melania? #DontDeportMelania https://t.co/aWoNOErfbV TONIGHT: 2020 presidential candidate @BilldeBlasio is here!\n\n📸: @ruminasean https://t.co/w4khbOqC5i TONIGHT: Don’t throw away your BMW when there are kids driving Kia Sorentos! https://t.co/XoVynrpc20 .@burnaboy is being sampled by everyone, including Drake, and was named Best International Act by @BET for his Afrofusion style. Watch the full interview here: https://t.co/JscmoqOBiQ https://t.co/JbfwnsfiwI Tired of the hustle and bustle of being dropped by advertisers? Want to get away because your boss says you have to? Then you need: Fox Vacations. \n\nFull piece: https://t.co/x3leoSHuE5 https://t.co/4ZGeXIjM9F Of all the surprise Fox News host vacations, Bill O’Reilly’s was the best. And longest. https://t.co/5xiPpC0uT2 Nothing beats a Fox News vacation! https://t.co/CpN3l0IUKJ These house hunters got out of this house real fast once they found KKK paraphernalia framed on the walls. https://t.co/LDJBnxGbsu Sponsors bail on Fox News's Tucker Carlson over his comments downplaying the white supremacy threat, and Nigerian songwriter @burnaboy discusses his album \"African Giant.\"\n\nListen and subscribe: https://t.co/LRADP3fDlx https://t.co/3ItlxuhcEw RT @burnaboy: 💪🏾🙏🏾 https://t.co/VGeebNIPQ8 @burnaboy And here's @BurnaBoy's performance of \"Ye\" and \"Anybody\": https://t.co/T9T3ta8C2R Here’s the full interview with @BurnaBoy: https://t.co/JscmoqOBiQ TONIGHT: @burnaboy is here to talk about his new album #AfricanGiant!\n\n📸: @ruminasean https://t.co/AUbjFqyOGx Hmm… Fox News hosts have a curious habit of going on surprise vacations after saying something controversial. https://t.co/mH7n8kN7so TONIGHT: Is there an N-word equivalent for Italians? Chris Cuomo &amp; @roywoodjr weigh in. https://t.co/SV5RBTFPdK @MrDanZak @washingtonpost Don't talk about it, TOK about it @delasfar YOU KNOW WHAT YOU DID Hong Kong protesters spent hours in an airport with no plans to travel. The dedication... https://t.co/p129bz8bQP No end in sight for our bitter TikTok feud with the @washingtonpost https://t.co/ZdnNdEEKmn 🤔🤔 🤔 \n\nFull coverage of Jeffrey Epstein’s death and conspiracy theories: https://t.co/SYPauOSfSM https://t.co/2ACRC7MbbS RT @RepPressley: TY to @TheDailyShow for having me on to discuss the chaos &amp; corruptness of this administration - but also the unspoken, re… .@RepPressley reacts to Trump's \"go back to where you came from\" tweet. Full interview: https://t.co/4HLHAuuNbs https://t.co/mU734HJHzS “Do not try this s**t if you are black. Or Muslim.”\n\nA Missouri man walked into a Walmart with full body armor carrying an assault rifle to prove a point. Full piece: https://t.co/BRjdoPEdnU https://t.co/feN2puB0qj “One minute you’re answering questions about pork chops on a stick, and then the next thing you’re getting yelled at to call the President a white supremacist.”\n\nFull coverage of the Dem candidates at the Iowa State Fair: https://t.co/opN9T099X0 https://t.co/DtXGw1Xv8c Trump needs a finsta. Full piece on the Epstein death and conspiracy theories: https://t.co/SYPauOSfSM https://t.co/6E13PV5ev2 RT @TheDailyShow: Unpacking the real conspiracy in the Jeffrey Epstein story: https://t.co/9s7paf0YMw Gymnast Simone Biles lands a historic dismount, questions swirl around Jeffrey Epstein's supposed suicide, and Congresswoman @AyannaPressley sits down with Trevor.\n\nListen and subscribe: https://t.co/TepNK7Kdy3 https://t.co/BXpEhEd6i5 Here’s the full interview with @AyannaPressley: https://t.co/4HLHAuuNbs Unpacking the real conspiracy in the Jeffrey Epstein story: https://t.co/9s7paf0YMw RT @AyannaPressley: Tonight I’m talking gun violence &amp; immigration with @Trevornoah at 11pm EST @TheDailyShow @ComedyCentral https://t.co/x… TONIGHT: @AyannaPressley is here!\n\n📸: @ruminasean https://t.co/6QomQRUg9q TONIGHT: Hong Kong protesters spent hours in an airport with no plans to travel. That’s dedication. https://t.co/ASQk6HYSrf .@washingtonpost it's on https://t.co/znHgJFUlkm “We must become as serious about our love as some are as serious about their hate.”\n\n@marwilliamson fields audience questions on spirituality in politics, white supremacy and why we need to love with conviction. #TalkingDems #Votegasm2020 https://t.co/tRKps8XwpY Tired of Congress blaming video games and doing nothing on gun control? Play our new, totally unrealistic game where gun legislation actually gets passed! \n\nPlay THE LEGISLATOR: LICENSE TO BILL: https://t.co/d1CAMVB9wT https://t.co/jAAEpFhORA @CillizzaCNN It's who he is. It's what he does. https://t.co/oEkKDaYWcN THIS WEEK: @AyannaPressley, @burnaboy, @BilldeBlasio, @jadapsmith and @MarkSanford stop by! https://t.co/bHqDJPVkSH Lots of overlap between Fox News and the El Paso shooter's manifesto. See for yourself: https://t.co/oJE6bsumcu For every half hour you spend on Instagram, your phone should automatically tweet out a picture of what you look like while you’re scrolling. https://t.co/hY5juwmfmy “A simple mistake shouldn’t be able to hold you back your whole life, like it did me myself.”\n\n@MeekMill talks about his Amazon documentary series \"Free Meek” and raising awareness about the effects of probation. https://t.co/kFOX2VX8GI “When you label a person a criminal, then it’s so easy to strip them from their humanity and from their due process rights.”\n\n@dianeguerrero__ lays out the steps to take to make people see the humanity of immigration. Full interview: https://t.co/rTivBrD78k https://t.co/1Wl0YYEJ6z .@marwilliamson shares her views on racism and reparations in America. Full interview: https://t.co/ngbyXnDqGQ https://t.co/mBJzwcFJ5g Mike Huckabee went on Fox News to shift the blame for mass shootings from guns to a lack of faith in God. But some of the things that people say God told them to do are… questionable. https://t.co/MOzH25UUaH This kid got $3 million for being the best at a video game and changed parenting forever. https://t.co/ughfG4ulpX “There’s no good way to arrest someone when you’re riding a horse. Whether you’re leading him with the rope or throw him over the back, it’s always going to look racist.”\n\nHorseback cops in Texas are taking serious heat for a questionable arrest method. https://t.co/xzpXW1hfi0 According to Fox News, there’s no “gun” in “America’s gun violence epidemic.” https://t.co/HX25piWr9L Full piece: https://t.co/DWdEtRvF2E https://t.co/vOsiBJJM6o Turkmenistan state TV broadcasts a bizarre, stunt-filled propaganda video to counteract rumors that the country's brutal dictator has died. https://t.co/d2GzOfmhEA .@EvaLongoria talks about her role in \"Dora and the Lost City of Gold\" and discusses the mass shooting in El Paso from her perspective as a Texan. https://t.co/3n50E2VW4M How to scare off a cougar: Play Metallica https://t.co/ISGKG8ip9a The trade war between America and China has escalated bigly. https://t.co/Rs5N2AWxXQ Oh look, the El Paso shooter's manifesto is out on audiobook https://t.co/aBhoFq5S4o .@EvaLongoria talks Dora, El Paso, and her Texas roots in her full interview: https://t.co/w8U1PicMsT https://t.co/B1okkSmT3Z America has mass shooting PTSD. #BetweenTheScenes https://t.co/VjJpCuNcFm Is Trump’s “white supremacy or any other supremacy” the new “very fine people on both sides”? https://t.co/iCN2LjS2Oa Presidential candidate @marwilliamson outlines her goal to bring morality back into politics and clarifies her positions on vaccines and reparations. https://t.co/ptlI5iI8Jg “America tries. It’s not about perfect, it’s about trying to be more perfect. You’re not saying get rid of guns, you’re saying try to minimize the chances of this happening.\" \n\nTrevor reacts to the El Paso and Dayton mass shootings: https://t.co/xdFfRIafsA “I wanted to speak up for the people who don’t have a voice… When I came home I wanted to dedicate myself to helping those people and helping their family members.”\n\n@MeekMill is working to fix America’s probation system. Full interview: https://t.co/dqxnJkjUBV https://t.co/07DidLPN64 RT @lizlet: I am playing @TheDailyShow's new video game and oh boy it's pretty dark. https://t.co/VxWab08lsF https://t.co/K0LDAop1U9 Fortunately for Rod Blagojevich, Donald Trump is tired of all of his friends being locked up. https://t.co/H9UPZcwYv9 We created a totally unrealistic video game where you, the legislator, try to pass gun control through Congress. \n\nPlay THE LEGISLATOR: LICENSE TO BILL: https://t.co/d1CAMVSKor https://t.co/MJdvXddV3F Now that Equinox and Soulcycle are canceled, liberal New Yorkers need a new #Resistance alternative to their pro-Trump workouts. @jaboukie has the woke-out for you. Full piece: https://t.co/d8FeEnK4BA https://t.co/dJPeldcicn If video games are so powerful, why not create one that might inspire people to do something that can END gun violence? \n\nPlay THE LEGISLATOR: LICENSE TO BILL: https://t.co/d1CAMVSKor RT @mashable: 'The Daily Show' has created a playable game to make a point about gun control https://t.co/iIAPAPRLLP https://t.co/SK0sTYIp55 “If you’re hosting a fundraiser for Donald Trump, I don’t know if you can call yourself a champion of racial equality and inclusion.”\n\nFull piece: https://t.co/d8FeEnK4BA https://t.co/fg3Gtm36j8 RT @TheDailyShow: We created a totally unrealistic video game where you, the legislator, try to pass gun control through Congress. \n\nIntrod… Climate scientists urge people to stop eating meat, billionaire Stephen Ross faces backlash for planning a fundraiser for President Trump, and @MeekMill discusses \"Free Meek.”\n\nListen and subscribe: https://t.co/Rrg5c3C50q https://t.co/IupaCA7Zn3 Here’s the full interview with @MeekMill: https://t.co/dqxnJkBvtt TONIGHT: Thinking of nixing Equinox over its ties to Trump? @jaboukie’s got you covered. https://t.co/1VKLHrJPrR When a SoulCycle membership becomes a moral issue: https://t.co/SDJvv2kDjM TONIGHT: Hip-hop artist and criminal justice reform advocate @MeekMill is here to talk about his new documentary series #FreeMeek! https://t.co/KFuKL2kXRG RT @Nschotte: @TheDailyShow This is hilarious https://t.co/To7pcTl01Q RT @DorothyMB: @TheDailyShow Fun! https://t.co/6XmmAw7U7E We created a totally unrealistic video game where you, the legislator, try to pass gun control through Congress. \n\nIntroducing THE LEGISLATOR: LICENSE TO BILL. Play here: https://t.co/d1CAMVB9wT https://t.co/9sxkruXvV5 RT @Trevornoah: We now live in a constant state of terror.\nhttps://t.co/FE3pNZpXyd A backfiring motorcycle causes panic in Times Square, highlighting a broader ramification of mass shootings: a nationwide state of terror. #BetweenTheScenes https://t.co/I5GF9ttmsg 8/2(2+2) = a divided nation https://t.co/unzAidEt1H Bingo! Joe Biden is coming for your assault weapons. Full piece: https://t.co/bp0D5rn0cy https://t.co/HU44GstP1l “I would never say that we should be as malevolent or as cynical as Mitch McConnell is… But we do need to be as strategic as he is.”\n\n@MichaelBennet on getting past Mitch’s c*ck-blocking. Full interview: https://t.co/rRjl1TgpO0 https://t.co/oYHe7fuxt8 First and last time you’ll see this trending https://t.co/4IQbjhFrzs Fox News vs. The El Paso Shooter’s Manifesto https://t.co/ARCUW7ANB0 Democrats slam President Trump in the wake of white supremacist gun violence, Sen. @MichaelBennet discusses his White House bid, and @nlyonne chats about \"Russian Doll.\"\n\nListen and subscribe: https://t.co/duIpOcgqHi https://t.co/HVXPmoSMjK Here's the full interview with @nlyonne: https://t.co/L0qrg28ONo Here’s the full interview with @MichaelBennet: https://t.co/rRjl1TgpO0 Democrats are coming after guns and cussing like the kids have gone to bed. https://t.co/mneo5KVApQ TONIGHT: @nlyonne is here to talk about her Emmy-nominated Netflix series @RussianDoll!\n\n📸: @ruminasean https://t.co/3wRSrdTKIh TONIGHT: 2020 presidential candidate @MichaelBennet is here!\n\n📸: @ruminasean https://t.co/Ysjfg33jS1 TONIGHT: Is Trump’s “white supremacy or any other supremacy” the new “very fine people on both sides”? https://t.co/wxrnbqGJUa RT @MichaelBennet: Susan and the Bennet girls are movin’ on up to New York City! I’ll be on @TheDailyShow with @Trevornoah tonight at 11 PM… TRUMP [leaning over to console shooting victim at hospital]: I have been treated very unfairly by Bette Midler Find a new hobby, people. Full piece: https://t.co/VbUYCXIJIC https://t.co/EZlDEyhW9t **North Korean State TV voice** https://t.co/dKJNC6UbTY RT @Trevornoah: NYC! IT’S... ABOUT... TO... GO… DOWN! @TheGarden Nov 8th, 2019! Ticket pre-sale starts NOW. Find them here --&gt; https://t.co… .@marwilliamson clarifies her stance on vaccines, depression medication and health care versus “sick care.” Full interview: https://t.co/HtpMHUJPoy https://t.co/UgdKmzmGoo Oh look, the El Paso shooter's manifesto is out on audiobook https://t.co/CzyLz5uOha Mike Huckabee went on Fox News to shift the blame for mass shootings from guns to a lack of faith in God. But some of the things that people say God told them to do are…questionable. Full piece: https://t.co/VbUYCXIJIC https://t.co/o3k7hPUwxA In the wake of the El Paso and Dayton shootings, Trevor responds to the “people die other ways more” argument against gun reform. Full piece: https://t.co/jVf2IU1NjH https://t.co/OOTsfkHiwl Mike Huckabee and Sean Hannity come up with bizarre ways to avoid blaming gun violence on guns, and @marwilliamson discusses her 2020 Democratic presidential campaign.\n\nListen and subscribe: https://t.co/4exYK0QuOB https://t.co/mCEfiYwpLb Here’s the full interview with @marwilliamson: https://t.co/HtpMHV1qN8 According to Fox News, there’s no “gun” in “America’s gun violence epidemic.” https://t.co/IfMk5UeUZP TONIGHT: 2020 presidential candidate @marwilliamson is here!\n\n📸: @ruminasean https://t.co/UpT9Ex84Q9 TONIGHT: Chorez app: the Kidz Bop of basic housekeeping. https://t.co/ZXWj3CUP4Y Hoverboards are real and even cooler than we imagined. https://t.co/ZlL687ijwh “Airlines try. They try harder and harder to make flying safer and safer.”\n\nLegislators aren’t even trying when it comes to guns. Full piece: https://t.co/jVf2ITKcs9 https://t.co/JFtbIQaKST Native Texan @EvaLongoria discusses the El Paso shooting. Full interview: https://t.co/w8U1PicMsT https://t.co/PPROnLRBGt Wow was The New York Times revising this headline right up until delivery? https://t.co/hbdG4Iav1S “The fact that our nation’s leaders have continued to fail us, to protect us, is outraging. You should be outraged.”\n\nNative Texan @EvaLongoria discusses the El Paso shooting. Full interview: https://t.co/w8U1PicMsT https://t.co/Ix9CbUoKx8 “It’s not about perfect, it’s about trying to be more perfect.” https://t.co/QPwh3wNMnJ This weekend’s two mass shootings didn’t happen in a vacuum. More on America’s mass shooting epidemic: https://t.co/OS8TRW5kxe Trevor reflects on America's gun violence problem in the wake of deadly mass shootings in El Paso and Dayton, and @EvaLongoria discusses \"Dora and the Lost City of Gold.\"\n\nListen and subscribe: https://t.co/RHpSjDb6oc https://t.co/hFsVisvmwn Here’s the full interview with @EvaLongoria: https://t.co/w8U1PicMsT Trevor reacts to the El Paso and Dayton mass shootings: https://t.co/i4XOj9qqXv TONIGHT: @EvaLongoria is here!\n\n📸: @ruminasean https://t.co/XlOLjt7gRp .@roywoodjr recalls the history of old-school hip-hop from Rapper’s Delight to the accidental creation of the record scratch. https://t.co/Q01kBXdvpl Me on instagram vs. me in real life https://t.co/jAEAhEDuqI THIS WEEK: @EvaLongoria, @marwilliamson, @MichaelBennet, @nlyonne and @MeekMill stop by! https://t.co/1enr6rmrAz And now, Part 1374 of our ongoing series: Imagine If Obama Did This Shit https://t.co/JKg8J423VI “You know what’s cool about being black? You can just make up phrases and white people don’t know if it’s real.”\n\nCory Booker’s “Kool-Aid” slam on Joe Biden was one of the biggest highlights of the night. Full coverage of the Detroit Dem Debate, night two: https://t.co/dPJhEU7pQF https://t.co/F32sPuuufK The moment Booker dropped Kool-Aid https://t.co/aALoEypYat The media is allowing conflict to overshadow good conversation in the 2020 debates. New York Magazine's @Olivianuzzi explains how. Full interview: https://t.co/uqV1JsEaIy https://t.co/LSyfz1USt8 .@AndrewYang plans to give every American citizen $1,000 per month. Here’s how. Full interview: https://t.co/q4LJ5qXdf3 https://t.co/pIqbJu8F0E Trevor’s favorite toy growing up? A brick. #BetweenTheScenes https://t.co/anHJGlj7vN “Hold up. Did Joe Biden just call Bill de Blasio a little-ass snitch?” https://t.co/ex9fh9J8g9 Wow, @nytimes getting creative! Get even more creative with our Trump Racist Euphemism Headline Generator: https://t.co/t7vbhIcXP7 https://t.co/UwiFOeVoJk “CNN, you catty bitch. Half of those questions might as well have been: ‘Pick three people on the stage - F**k, Marry, Kill. Go!’” https://t.co/QkxXwH8MU4 Does anybody here work on Friday?\n\nFollow us on TikTok: https://t.co/ixf43v51W0 https://t.co/0vQpFnkt6J Second of all, why is it that the people who want to spread their DNA are always the last people who should be spreading their DNA? https://t.co/rqoGO6X3Vz .@roywoodjr and @ronnychieng break down the Democratic debates, including Cory Booker’s “Kool-Aid” jab at Joe Biden and whether they really cut Andrew Yang’s mic.\n\nThis Week at the Comedy Cellar airs tonight at 11/10c on @ComedyCentral. https://t.co/M3it5JdAdB An NYC cab driver picked up two and dropped off three when a woman gave birth in his back seat. https://t.co/VKn3SDvuVe NBC/MSNBC political analyst @CornellBelcher discusses Kamala Harris’s performance in the Democratic debate and the challenges she faces as a black female candidate. https://t.co/AoPePMezTG Did Don Jr just unfollow his own Secret Service code name? https://t.co/5ScddygiPQ How did a blackout in NYC help launch hip-hop? @RoyWoodJr explains in the latest CP Time: https://t.co/taaIKVQKoe https://t.co/3wXs8ejdx1 “Ronald Reagan we have called you back to tell you: Bye Felicia.”\n\nAfter a racist recording of a phone call with President Nixon surfaced, Ronald Reagan got posthumously cancelled. https://t.co/f1cfdohVim A recording emerges of Ronald Reagan making racist remarks, @roywoodjr examines early hip-hop, and actor @dianeguerrero__ discusses immigration and \"Orange Is the New Black.\"\n\nListen and subscribe: https://t.co/VlRzHbctBK https://t.co/vDNBLeJo9Z Here's the full piece with @roywoodjr: https://t.co/taaIKVQKoe Here’s the full interview with @dianeguerrero__: https://t.co/KUSFYFqGK7 TONIGHT: Activist, author, and actor @dianeguerrero__ is here! https://t.co/qG7XCDyJXl Can the Jeffrey Epstein story get any worse? What’s the Senate’s latest pet project? And was Ronald Reagan racist? Unpacking these questions and more in tonight’s “In Other News.” https://t.co/IkW8kmFPPP TONIGHT: From “Rapper’s Delight” to mumble rap, @roywoodjr walks us through the history of rap in a new CP Time:\n\n📸: @ruminasean https://t.co/j1RtTRABut TONIGHT: Jeffrey Epstein’s sperm ranch: another disturbing detail in the financier’s sex ring saga, and the worst salad dressing ever. https://t.co/XEGN2vgB0o Here’s our review of the debates on TikTok. Follow us: https://t.co/ixf43v51W0 https://t.co/wF2pjU4P8u “You know what’s cool about being black? You can just make up phrases and white people don’t know if it’s real.”\n\nCory Booker brings Kool-Aid to the debate. Full coverage: https://t.co/dPJhEUp0Id https://t.co/54y6yraeKU Just when you thought Biden was the target of the night, Tulsi Gabbard pops up from under the ring and slams Kamala with the chair. Full coverage: https://t.co/dPJhEUp0Id https://t.co/mZ1zVxY9FF .@MichaelKosta enters the post-debate spin room and shows these clowns what real reporting looks like. https://t.co/ks5KKZlB8D RT @roywoodjr: ‘The Lion King’ plot holes &amp; The 40th Annie of ‘Rappers Delight’ NEW CP TIME @TheDailyShow tonight https://t.co/nQR5biPWnu Two years ago today, Trump wrote a check reimbursing Michael Cohen for hush money payments to Stormy Daniels.\n\nBut you know what else happened in the month of August? Barack Obama wore a tan suit, the greatest scandal in presidential history. https://t.co/3b99V4yakl Booker brought the heat. Full debate coverage: https://t.co/dPJhEU7pQF https://t.co/vO7xGywWD2 RT @ComedyCentral: Nah, last time there was a joke at a debate it became president. https://t.co/7glq9lfUwS Joe Biden gets hit from all sides, punctuated by a Kool-Aid bath courtesy of Cory Booker. Full coverage: https://t.co/dPJhEUp0Id https://t.co/RnAPp8rMut Democrats were out for blood on night two of the Detroit debates— Harris and Booker vs. Biden, Gabbard vs. Harris, and everyone vs. Trump. https://t.co/QCgDJhzxJZ Trevor continues his live coverage of CNN's Democratic primary debates, and NBC/MSNBC political analyst @cornellbelcher weighs in on how the candidates performed.\n\nListen and subscribe: https://t.co/g7Q0i0Q4Ku https://t.co/cJs32wVmBK Here's tonight's interview with Democratic strategist and pollster @cornellbelcher and his thoughts on tonight’s #DemDebate! https://t.co/T4H1yNAzTB ⚡️ “The Daily Show Live Tweets Detroit #DemDebate Night 2” by @TheDailyShow https://t.co/ywfUqJOAgV We're LIVE! ⬇️⬇️⬇️ #Votegasm2020 #DemDebate https://t.co/0D1KCBtSVo Trevor’s LIVE coverage of the Detroit 2020 Democratic debates, night two. #Votegasm2020 #DemDebate https://t.co/nwo432nPvE AIDE: Okay, remember to share the website https://t.co/7qIPQVU8D5\nJOE BIDEN: Got it\n(2 hours later)\nPlease join me at my website, it is https://t.co/UKOmoqOYbr We're LIVE with full debate coverage on Comedy Central at 30330pm! JAY INSLEE: We need to fight climate change\nKIRSTEN GILLIBRAND: I can win back Obama-Trump voters\nTULSI GABBARD: https://t.co/rfHUDa9o13 .@BilldeBlasio the choice is yours! @BilldeBlasio 3) Propeller guy in Titanic https://t.co/8jCkElQwAZ @BilldeBlasio 2) The Naked Gun https://t.co/dqqbaqluZE Mayor @BilldeBlasio, it's pretty clear you're not going to be president, so we thought we'd give you a chance to choose the gif we use when you inevitably drop out of the race.\n\n1) Mac and Me https://t.co/7T3vCAlGe9 Wow CNN taking it up a notch with their time limit enforcement #DemDebate https://t.co/omgJDQIAPH The moment Booker dropped Kool-Aid https://t.co/4cuzvKeDL1 RT @roywoodjr: Half of America right now \n#DemDebate https://t.co/TYhrro6NW1 My goodness https://t.co/YseJXtKr5J Does anyone else feel personally victimized by Bill de Blasio's sideburns? #DemDebate https://t.co/cDxrXxKM9E If it's what you say, we love it, especially later in the summer https://t.co/0yjwdEswjm @NBCPolitics Me when the train arrives as soon as I get to the platform https://t.co/514VPu0Rvc RT @ronnychieng: \"Casual Rich Asians\" https://t.co/r9MFggRS8B Fun Fact! Julian Castro is \"total twinsies\" with brother Joaquin. #TDSFunFacts Fun Fact! Michael Bennet is the oldest youngest person running for president. #TDSFunFact Fun Fact! Cory Booker was always the first student to jump up when his teacher said, \"I need a couple big strong boys to help me move some chairs.\" #TDSFunFacts Who should get beamed up tonight? Reply with the name of a candidate... or moderator! https://t.co/m1D6TSgm3G Fun Fact! Didn't Jay Inslee go yesterday? No? Well how do you like that. #TDSFunFacts We're back with more #TDSFunFacts! \n\nFun Fact: Joe Biden has somehow converted a total lack of enthusiasm into a lead in the polls. We're now on TikTok. Follow us here: https://t.co/ixf43v51W0\n\nMay God have mercy on our souls. https://t.co/AS6VbfJUK0 The meerkat is polling higher https://t.co/w2yOoJ4jrB JEFFREY EPSTEIN: What we do is, we start a ranch, I impregnate 500, maybe 600 women, and—\n\nJEFFREY EPSTEIN'S SCIENTIST FRIEND: I meant ideas for dinner Looks like John Delaney got his t-shirt moment! https://t.co/i0ZMHrJ7kS FaceApp’s old person filter is definitely for white people. \n@JoshJohnson\n \nWatch This Week at Comedy Cellar Fridays at 11/10c on \n@ComedyCentral.\n\nhttps://t.co/VgVNB57f77 “CNN, you catty bitch. Half of those questions might as well have been: Pick three people on the stage. F**k, Marry, Kill. Go.”\n\nFull coverage of the Detroit Democratic Debate, night one: https://t.co/dXYWqb93sg https://t.co/Km8AnAr6HQ “The last time I saw that many people on one stage was when Moonlight and La La Land were fighting over an Oscar.”\n\nThere are too many damn candidates. @RoyWoodJr has solutions. https://t.co/qPKaad7tZF Got the club goin up https://t.co/eK2hk5zqNj The first ten Democratic candidates take the debate stage in Detroit to see who can handle the presidency… and CNN’s catty questions. https://t.co/77kY3OaWnb Trevor and @roywoodjr go live after the Democratic primary debate to recap the biggest moments, and New York Magazine's @Olivianuzzi gives her take on the night.\n\nListen and subscribe: https://t.co/0QvOrWgpCo https://t.co/YUjhQ5Aom4 Here’s the full interview with @Olivianuzzi: https://t.co/uqV1JsmzR0 ⚡️ “The Daily Show Live Tweets Detroit #DemDebate Night 1”\n\nhttps://t.co/a1BGChVoaA We're LIVE! ⬇️⬇️⬇️ #Votegasm2020 #DemDebate https://t.co/JK3w91JPMO Trevor’s LIVE coverage of the Detroit 2020 Democratic debates, night one. #Votegasm2020 #DemDebate https://t.co/Nyi5kUB7XR Want more John Delaney? We're LIVE at 11/10c on @ComedyCentral with full #DemDebate coverage! LIVE AT 11/10c: @NYMag's @Olivianuzzi gives her take on tonight's #DemDebate! https://t.co/Xds5gmlfNJ Marianne Williamson sounds like she's about to end every sentence with \"...and that's why I want to talk to you about the healing power of fish oil\" Steve Bullock trying to make a splash https://t.co/RzTg2MEOip RT @jaboukie: who are yall @JohnDelaney @Hickenlooper @GovernorBullock #DemDebate https://t.co/6zEDHps6aY THROW YOUR HANDS UP https://t.co/dddb4BxOLd Delaney didn't go down without a fight https://t.co/b1Xgy31WUZ Marianne Williamson stuns the #DemDebate audience by ascending to a higher plane of dimensional consciousness https://t.co/UQBm28VhRP Fun Fact! John Hickenlooper has never actually looped a hicken. #TDSFunFacts BREAKING: CNN's Star Ring just beamed John Hickenlooper back to his home planet #DemDebate https://t.co/2vGN7GHScS This #DemDebate is so white an impromptu Dave Matthews Band concert has broken out https://t.co/VLFaFvHTy6 Damn does FaceApp now show what you would look like if you were polling above 0% https://t.co/7MW6zBgvOO Fun Fact! Bernie Sanders is not a fan of fun facts. #TDSFunFacts When the resume has to be a page long but you don't have much actual work experience https://t.co/FgalSdwTLs Fun Fact! Pete Buttigieg has learned four new languages since the last debate, including one he invented as part of a dare. #TDSFunFacts Fun Fact! Elizabeth Warren recently unveiled an ambitious $37 trillion plan to get people to stop talking about that DNA test she took. #TDSFunFacts Fun Fact! Marianne Williamson can cast the 4th-level transmutation \"Banishment\" despite technically being a druid. #TDSFunFacts Fun Fact! Tim Ryan self-produced a 2013 hip-hop album titled \"Get Rich or Tim Ryan\" #TDSFunFacts BREAKING: Marianne Williamson will be debating tonight in the form of a snow owl https://t.co/ZLY3Scz9Yf We've had a little fun at Eric Swalwell's expense here, but we do want to acknowledge him no longer being in the race for president. Best of luck to Rep. Eric Swalwell, pictured here: https://t.co/da9HqzNcKr Ok, hard reset. Goodbye, Eric Swalwell, former democratic candidate for president. Eric. Swalwell. https://t.co/NbsgGsWQya Oh man, this is embarrassing. It's spelled \"Eckhart,\" not Eckhardt. Having some issues over here. That was Aaron Eckhardt, not Eric Swalwell. THIS is Eric Swalwell, Democratic congressman and former presidential candidate. https://t.co/Wk13hab4Ui Apologies. In a previous tweet, we attached a photo of a person who was NOT Eric Swalwell. Here is a correct photo of former Democratic candidate for president, Eric Swalwell. https://t.co/SolxLemvEx Before the #DemDebate begins, let's take a moment to remember the candidate no longer with us: Rep. Eric Swalwell https://t.co/8lHTe6m6tN The thrilling story of a ragtag group who attempted to do the impossible: build a debate stage for 20 Democratic candidates. https://t.co/sNV3NL0PGO The easiest dots to connect. Full piece: https://t.co/DWdEtRvF2E https://t.co/dcUbfIQ9zt Trump can’t get the temperature in the White House right – thanks, Obama 🙄 \n\nFull piece: https://t.co/DWdEtRvF2E https://t.co/zRhRpDoF47 BREAKING: President Trump says Black Moon “infested with rats and crime” https://t.co/I7coXHwNt8 .@dulcesloan highlights relationship studies on \"foodie calls,\" PDA, and the surprising benefits of snooping on a significant other's phone. https://t.co/jkmUUKiqNu “Trump says it’s the black people who are the true racists because they keep bringing up race every time someone says something racist.”\n\nTrump beefs with Rep. Cummings and Baltimore: https://t.co/DWdEtRvF2E https://t.co/Fsg3IjbBiT Trevor highlights President Trump's most recent beefs, @dulcesloan gives a rundown of colorful relationship studies, and @ImAngelaBassett chats about her role in \"Otherhood.”\n\nListen and subscribe: https://t.co/yM1v5S4pCZ https://t.co/gjiLvsrd7T Here's the full piece with @DulceSloan: https://t.co/aV49oRkYyz Here’s the full interview with @ImAngelaBassett: https://t.co/HOG4uiwkPM TONIGHT: With studies coming out every day, how do we know which ones to trust? @dulcesloan helps us keep up in the new segment Studies Show:\n\n📸: @ruminasean https://t.co/7NNSueeAtD The A-B-Cs of this week’s Trump beef: air conditioning, Baltimore, and champagne. https://t.co/Vqqf6gbRbS TONIGHT: @ImAngelaBassett is here to talk about her new @netflix film “Otherhood”!\n\n📸: @ruminasean https://t.co/LWuWoWbruF Tonight at 11/10c on @ComedyCentral: Trump is running out of things to blame on Obama. https://t.co/hRx1pBSab7 Rudy Giuliani’s hair has magnificently changed colors, and scientists are baffled. https://t.co/KUsFMQYUiC THIS WEEK: @ImAngelaBassett, @Olivianuzzi, @cornellbelcher and @dianeguerrero__ stop by! https://t.co/W5DVclycwP America creates so much trash that we outsource it to Asian countries. But now they’ve had enough. Full piece: https://t.co/3CMpSydjgt https://t.co/vqbTxhfCQL Here’s the lowdown on what really happens to recycled waste, the right way to recycle, and the best way for folks to reduce their carbon footprint. https://t.co/Ajt2Kkql6a Trump stays weird when it comes to 9/11 https://t.co/VXaqCMHFvV Star Wars fans: @ronnychieng has a new business venture. Full piece at https://t.co/yCpt5TAhuJ https://t.co/b6D8tMBA2k When animals pop up in the news, it’s rarely for something good. Trevor’s Australian cousin brings us the latest animal news: https://t.co/3AW5juiCGc Puff, puff, pass… to a pregnant woman? https://t.co/qr8bYhylKv The beach wants you dead. @TheLewisBlack has some tips on how to stay safe this summer. https://t.co/REM8CrBPn8 RT @standup: Gangs have a strict “no giggling” policy. @JoshJohnson https://t.co/cYgkBPQ4Jl Auctions: where rich people go to flex. @ronnychieng has more with this installment of Everything is Stupid: https://t.co/D8cERFLiXY When a veteran chess player makes a rookie mistake - full piece: https://t.co/9ZOdSPoKkc https://t.co/yU8G1X6J65 2020 Democratic presidential candidate @AndrewYang discusses the threat that A.I. technology poses to America's workforce and makes the case for a universal basic income. https://t.co/wPD0riGIUv RT @standup: This is how Donald Trump will get booted from office. @michaelkosta https://t.co/Sd3NFpZCBL .@1jamiebell discusses switching from playing a Nazi to Bernie Taupin in “Rocketman.” Full interview: https://t.co/IlAmp7tdwu https://t.co/IimLCDZrnB Do you think Trump stopping by a wedding is a fun story we should all enjoy? @cherylwillsny1 does not. https://t.co/gx3yffOfM0 This toddler does TSA PreCheck a little differently… https://t.co/JAlPyPDQzR RT @standup: .@dulcesloan isn't surprised by people who don't believe the moon landing was real.\n\nWatch This Week at the Comedy Cellar: htt… If every airport had an African father, there’d be a lot less complaining about flights canceled by storms. https://t.co/vW1sIWRELR God save the Queen. https://t.co/bLlSS84Vl3 Devin Nunes did his homework https://t.co/3wDwpSrvIY Elizabeth Warren’s got a plan for it, and Bernie’s rearing to hit the reset button - we’re talking student debt. https://t.co/g0azMMbYpi In the latest installment of “F**k These Animals,” Trevor’s Australian cousin highlights times when animals say “f**k these humans.” https://t.co/QPq08KtwoL Bernie Sanders wants to hit the reset button on student debt… which is what it always looks like he’s doing. https://t.co/aUi7RqSeAf “The opposite of Donald Trump is an Asian man who likes math.”\n \nDemocratic presidential candidate @AndrewYang makes his case. Full interview: https://t.co/3Tltc7R0u0 https://t.co/yfnfg1dLzQ Don’t miss America’s favorite new sitcom, Meet the Debts! Starring @Jaboukie, @DesiLydic, @RoyWoodJr and crippling student debt! Full piece: https://t.co/uqzvXBjuPA https://t.co/O3PmVpbmQi Democratic presidential candidate @AndrewYang makes his case. Full interview: https://t.co/3Tltc88BSA https://t.co/F4sTqgmyvW In America, student loan debt will follow you until you die. At least that’s where we hope it stops. Full piece: https://t.co/O6iSPR4hSy https://t.co/AJjnTxuKAV A toddler takes a ride on an airport conveyor belt, student debt reaches devastating levels in the U.S., and @AndrewYang discusses his 2020 Democratic presidential campaign.\n\nListen and subscribe: https://t.co/PfXe0BV2Tr https://t.co/4OCH34uZIv Here’s the full interview with @AndrewYang: https://t.co/3Tltc88BSA TONIGHT: 2020 presidential candidate @AndrewYang is here!\n\n📸: @ruminasean https://t.co/rhohRBMHRE Student debt has reached an all-time high of $1.4 trillion across America, or roughly one dollar for every Democratic presidential candidate. https://t.co/3vHeSQJzIS RT @AndrewYang: Tonight! Looking forward to this 😀👍 https://t.co/iqrYGsuYe0 TONIGHT: When an airport turns into an amusement park: https://t.co/WZaRo7j0Sf Wow! Scientists are puzzled by a mysterious phenomenon occurring on Rudy Giuliani's head. https://t.co/rkqsIZuSO0 Meth in snow globes? Damn, Grandma. Didn’t know you partied so hard. https://t.co/XX2ORKGwre The Queen didn’t even bother taking off her purse to meet Boris Johnson 😂 Full piece: https://t.co/gOYfWnh4vV https://t.co/DVm6YzRMuQ The beach wants you dead. @TheLewisBlack has some tips on how to stay safe this summer. https://t.co/FwgwS4tE30 RT @TheDailyShow: Devin Nunes did his homework https://t.co/Y8DzGoMlMM “To his credit, Robert Mueller refused to play partisan games and was as impartial as his report is… Well, I assume his report is, I haven’t read it. C’mon now.”\n\nNo one could get Mueller to crack. Not even The Daily Show correspondents. Full coverage: https://t.co/ttKxSEY9In https://t.co/QeZQxaEpLQ Full coverage of the Mueller hearing: https://t.co/tOPqCql2A4 Robert Mueller testifies about his Trump-Russia investigation before Congress, @TheLewisBlack addresses the dangerous state of beaches, and actor @ginatorres discusses \"Pearson.\"\n\nListen and subscribe: https://t.co/gkgCYQv8Yo https://t.co/VM5Xzo49u8 Here's the full piece with @TheLewisBlack: https://t.co/CDoLwWXdap Here’s the full interview with @ginatorres: https://t.co/EakpGWp5lC TONIGHT: Beaches: summer vacation spot or death trap? @TheLewisBlack is #BackInBlack:\n\n📸: @ruminasean https://t.co/hXSrfuwMho Mueller’s hearing was less of a bombshell, and more of a reminder to everyone to do their homework. https://t.co/KM69xwVnck TONIGHT: Actor @ginatorres is here to talk about her new show @PearsonUSA!\n\n📸: @ruminasean https://t.co/HcG9liJofL No one is getting the answers they want out of Robert Mueller, not even @desilydic, @roywoodjr, or @michaelkosta. https://t.co/FrDM8y1Lza Tonight at 11/10c on @ComedyCentral: Mueller testifies and dishes all the juicy details he wishes everybody would have just read in his report. https://t.co/dBUU1up9Dj RT @TheLewisBlack: Tune In Alert! 📱💻Tonight (July 24). New segment of Back In Black on @TheDailyShow on @ComedyCentral at 11pm/10pmC. (phot… Devin Nunes did his homework https://t.co/Y8DzGoMlMM Damn, Mueller crushed the lightning round https://t.co/4oDnAaaoFw 🎶 It’s the circle of trash 🎶\n\nFull piece: https://t.co/H1ffuzN553 https://t.co/NMfPe8spuC RT @TheDailyShow: @DonaldJTrumpJr @replouiegohmert https://t.co/Jc4WDZozR9 @DonaldJTrumpJr @replouiegohmert https://t.co/Jc4WDZozR9 Explosive stuff https://t.co/sXTk7ymQWQ If you ever thought, \"I like Donald Trump, his policies and his hair, but I just wish he could read,\" well then, Great Britain has the leader for you. Full piece: https://t.co/kxr9DHWTvL https://t.co/nVMLp25Mnf Asian nations reject shipments of recyclable trash from the West, @michaelkosta and @roywoodjr cover odd sports news, and @DavidSpade discusses Lights Out with David Spade.\n\nListen and subscribe: https://t.co/a6XpKw1CBr https://t.co/oeL5cID9Hf Here's the full piece with @roywoodjr and @michaelkosta: https://t.co/7Dwx6bucFI Here’s the full interview with @DavidSpade: https://t.co/6bm5xbKn0c Boris Johnson, biblical floods, and bans on declawing cats. So much news, so little time! https://t.co/O7Nbq2JNrz TONIGHT: It’s officially the most boring part of the sports calendar, but @roywoodjr and @michaelkosta are here to spice it up with a new I Apologize For Talking While You Were Talking.\n\n📸: @ruminasean https://t.co/95QST3qBpN TONIGHT: @DavidSpade is here to talk about his new late night show on Comedy Central @LightsOut!\n\n📸: @ruminasean https://t.co/uBmLnhNHnX Tonight at 11/10c on @ComedyCentral: With earthquakes, measles, and now floods, God is either about to wipe us out or drop a new album. https://t.co/VCl0qhs8p9 .@cherylwillsny1 you are a BEAST https://t.co/s7aUyRegp9 “Footage of the Moon Landing? This guy just paid almost two million dollars for something he could have watched on YouTube.”\n\nExpensive auction items are stupid. @RonnyChieng reports: https://t.co/D7eWaw0akq https://t.co/4Gl0se5rh8 This sounds like a headline written by a newspaper that just dropped acid. Full piece: https://t.co/enKbGkVYmg https://t.co/3Q3nwrc3rX Meet Boris Johnson: Britain’s new prime minister and stunt double for Jeff Daniels in “Dumb And Dumber.” https://t.co/lhCCa1GyPv A$AP Rocky has been detained in Swedish prison for three weeks. Worst of all, they're making him assemble his own furniture. Full piece: https://t.co/enKbGkVYmg https://t.co/2d2SZMzFA3 uh oh https://t.co/j20w9tAjpB President Trump advocates for rapper A$AP Rocky's release from jail in Sweden, @ronnychieng sounds off about expensive auction items, and actor @1jamiebell discusses \"Skin.”\n\nListen and subscribe: https://t.co/6Bnfgako4t https://t.co/x5tPWKX9cW @ronnychieng @ruminasean Here's the full piece with @ronnychieng: https://t.co/D7eWaw0akq @1jamiebell Here’s the full interview with @1jamiebell: https://t.co/IlAmp7KOV4 A$AP Rocky is locked up in Sweden, but fear not, Donald J. Trump is on the case. https://t.co/FlNmpd8Lcg TONIGHT: Actor @1jamiebell is here to talk about his new film “Skin.” https://t.co/8FRpeYQUhp TONIGHT: Auctions: where rich people go to flex. @ronnychieng has more with a new installment of Everything is Stupid:\n\n📸: @ruminasean https://t.co/lvQTgkT8A7 Kim &amp; Kanye lobbying President Donald Trump to free A$AP Rocky from a Swedish jail is what happens when a news headline drops acid. \n\nTonight at 11/10c on @ComedyCentral. https://t.co/LlwZ88StdN You can’t get rid of Instagram likes. That would be like Twitter getting rid of all the white supremacists. https://t.co/YYbuREtM3u RT @TheDailyShow: @ParkerMolloy https://t.co/gGWSVPlHq2 @ParkerMolloy https://t.co/gGWSVPlHq2 Trevor dissects President Trump's verbal attacks on progressive Congresswomen Ilhan Omar, Rashida Tlaib, Alexandria Ocasio-Cortez and Ayanna Pressley. #BetweenTheScenes https://t.co/mG0zHip8tP Seriously though, what happened to Lindsey Graham? https://t.co/XC5aHxZJ9s When you won’t stand for antisemitic tropes https://t.co/LZLXHK8MvE THIS WEEK: @1jamiebell, @DavidSpade, @ginatorres and @AndrewYang stop by! https://t.co/Zvs8vjfBIQ Can a lake have the same rights as a person? In Toledo it can.  @MichaelKosta heads to Ohio to find out more. https://t.co/0ggl1TazKT The irony of Trump saying, “If you don’t like America, you can leave.” https://t.co/CEXUZT1pzM RT @barbarajean9999: @TheDailyShow #BeatTheChant My son learning to walk https://t.co/szqV0ggZRP #BeatTheChant! https://t.co/89mrfTFAoS Trevor on why it’s important for characters from marginalized groups to be played by actors from those same groups. #BetweenTheScenes https://t.co/U9UwJI7jbW Hey news orgs! Calling Trump’s remarks “racially-charged” is so 2018. You can do better. Try our Trump Racist Euphemism Headline Generator: https://t.co/t7vbhIcXP7 https://t.co/EmDo2K5CRl “When I wanted to open up a store, nobody would sell to me, so I said, \"You know what?’ I’mma learn how to do everything the big boys do and do it better than they do it.’” \n\n@DapperDanHarlem on how he got his start in the fashion industry. Full interview: https://t.co/Tf3xZqh1nR https://t.co/CT1AGoFjYc Puerto Ricans call for Governor Rosselló to step down after his sexist, homophobic, and violent text messages were leaked. https://t.co/bR1XUhp7IR “That’s why I love America. That guy jumped on a submarine in the ocean and banged on the door until they opened it. No other cop in the world would be that baller.” https://t.co/bCKR3OpOkq TFW you’ve been sending Russia pictures of your face. https://t.co/2Nc28nSONy Were Trump’s “go back to your country” tweets racist? Sounds like a case for Trevor Noah: Racism Detective: https://t.co/nwvUxGykum Will the footage of Trump partying with Jeffrey Epstein in 1992 hurt him? @MichaelKosta weighs in: https://t.co/iTBrljv006 It only gets creepier when you see how Trump dances: https://t.co/q4zGLY3M8k https://t.co/OwuL9up5cH @realDonaldTrump https://t.co/hFwpeGbCri Trump: “If you hate our Country, or if you are not happy here, you can leave!”\n\nAlso Trump: https://t.co/imSUDjpAEc “Trump’s plan is to paint The Squad as the most un-American people possible… to appeal to that portion of white voters who determined the electoral college in the last election and say, ‘I’m with you, not these people.’” #BetweenTheScenes https://t.co/kWgYCFtIhi #BeatTheChant https://t.co/89mrfTFAoS RT @RealCarlosSagan: @TheDailyShow #BeatTheChant A tour of the Monte Carlo casino https://t.co/eHbUVZp2qZ RT @NLosq: @TheDailyShow Making a bowl of cereal #BeatTheChant https://t.co/MMYjbCXarC RT @AltCyberCommand: @TheDailyShow 5) Climbing a three-story building #BeatTheChant https://t.co/7We0gkFf94 RT @MeowYorkTimes: @TheDailyShow 5) McGregor owning Aldo #BeatTheChant https://t.co/Q8MEHkS7V1 RT @MISSY_ROMAN: @TheDailyShow Billy Joel singing the first verse of “we didn’t start the fire” #BeatTheChant https://t.co/VpH637DJZ4 RT @quasirealSmiths: @TheDailyShow 5) 95 Yard Touchdown return #BeatTheChant https://t.co/asEiYGfoqt The “send her back” chants at Trump’s rally mark a new low: https://t.co/sxh2VIZx9G https://t.co/WgxxcGRypp .@Nas talks about bumping into Trevor in Russia and what pushed him to produce a second “The Lost Tapes” album 17 years after his first. https://t.co/UjXq0BB3FK RT @MaXanablue: @TheDailyShow Eating 60 hot dogs #beatthechant https://t.co/Qd62HdsT6F RT @Sethhorton813: @TheDailyShow Kendall Coyne makes history #BeatTheChant. https://t.co/JVZCOQO8d2 RT @Nikhil_P_B: @TheDailyShow @ronnychieng Usain Bolt winning running match &amp; setting new world record. #BeatTheChant https://t.co/f8iX5VLN… RT @SFB2009: @TheDailyShow Evel Knievel jumps 14 Greyhound Buses! #BeatTheChant https://t.co/w1VcGLiqfO 4) Spinning the Price Is Right wheel #BeatTheChant https://t.co/SDBhXVrceY Reply with your own #BeatTheChant video! 3) Monkey sex from start to finish #BeatTheChant https://t.co/6aEA3U6eyM 2) Neil Armstrong's moon walk #BeatTheChant https://t.co/UUbUXzk4Bp Trump says he \"started speaking very quickly\" to stop the \"send her back\" chant. Here are some things that take less time than he did to stop the chant.\n\n1) Solving a Rubik's Cube underwater #BeatTheChant https://t.co/mDGAZKZieN This Week at the Comedy Cellar premieres TONIGHT at 11/10c on @ComedyCentral. A Daily Show Comedy Cellar takeover featuring @roywoodjr, @jaboukie, @michaelkosta, @dulcesloan and @ronnychieng.\n\nhttps://t.co/ezgssEHhHD Trump tried to distance himself from the “send her back” chants he inspired, but luckily, cameras exist. Full piece: https://t.co/sxh2VIZx9G https://t.co/3NRvP2vxl5 RT @TheDailyShow: #FreeJaboukie https://t.co/KPxf8Ss3wn Feeling nostalgic.\n\nFull piece: https://t.co/sxh2VIZx9G https://t.co/7a9cVzbaUD RT @TheDailyShow: Trump supporters chanting “send her back” about Ilhan Omar almost makes you miss the days when all they wanted was to imp… Ilhan Omar becomes the target of a racist chant at a Trump rally, Puerto Ricans demand the resignation of their governor, and @IamIshaSesay discusses \"Beneath the Tamarind Tree.”\n\nListen and subscribe: https://t.co/y2Tg3M9Evj https://t.co/XNcYPPjGlq Here’s the full interview with @IamIshaSesay: https://t.co/dWtxNNeXJg #FreeJaboukie https://t.co/KPxf8Ss3wn Trump supporters chanting “send her back” about Ilhan Omar almost makes you miss the days when all they wanted was to imprison a woman without trial. https://t.co/3JfI9kykeo RT @IamIshaSesay: Thank you for the beautifully moving conversation @Trevornoah - I loved every minute of my time on the show!! #gratitude… TONIGHT: Journalist and author @IamIshaSesay is here to talk about her new book “Beneath the Tamarind Tree”. \n\n📸: @ruminasean https://t.co/CuQxbz5Cfh TONIGHT: Everyone’s clamoring to get to air conditioning… even these guys: https://t.co/3frpyeDmKX Is Trump supporters chanting \"send her back\" about Somali-born Rep. Ilhan Omar racist? https://t.co/0gJsjXFzCl Trevor’s grandmother remembers Nelson Mandela and the fear she experienced during apartheid. #MandelaDay\n\nFull piece: https://t.co/GzPxx4ZUP4 https://t.co/NTYmPmyfyG One can dream. https://t.co/YWH7obVDZd https://t.co/C73LqmJETF We need to talk about Trump’s dance moves at a 1992 party with Jeffrey Epstein. @MichaelKosta reports: https://t.co/kdnzRdkMyC https://t.co/F98kxyi8os RT @Trevornoah: Saying goodbye to my youth... https://t.co/8D2A1NiJmy On Scarlett Johansson and the representation debate. #BetweenTheScenes https://t.co/uxBw99Jfyd Rep. Emanuel Cleaver was done listening to the House bicker, so he just bounced. Full piece: https://t.co/YWH7obVDZd https://t.co/knO0lrx9Ux All hell breaks loose in the House over whether to condemn Trump’s racist tweets. Full piece: https://t.co/YWH7obVDZd https://t.co/Kh48ji3CeH RT @TheDailyShow: Apparently there’s a congressional rule against calling the president racist… can we get a rule against having a presiden… Druglord El Chapo is sentenced to life plus 30 years in prison, Democrats and Republicans spar over President Trump's racist tweets, and visual artist Nelson Makamo stops by.\n\nListen and subscribe: https://t.co/huRGOzpjxR https://t.co/CHC3S1yC4W Here's the full piece with @michaelkosta: https://t.co/kdnzRdkMyC Here’s the full interview with Nelson Makamo: https://t.co/dWgnQi6ion Apparently there’s a congressional rule against calling the president racist… can we get a rule against having a president BE racist? https://t.co/VtST40kwSG TONIGHT: Will the footage of Trump partying with Jeffrey Epstein hurt him? @michaelkosta weighs in:\n\n📸: @ruminasean https://t.co/wb9ijAXi5O TONIGHT: Visual artist Nelson Makamo is here!\n\n📸: @ruminasean https://t.co/YUQYNHqrih Trevor unpacks Scarlett Johansson’s recent controversial comments about being allowed to “play any person, or any tree.” #BetweenTheScenes https://t.co/A4cRg2qP2Y TONIGHT: Should’ve seen this FaceApp twist coming… https://t.co/2Tfd6TIAfV New SoulApp lets you see what your favorite Fox News hosts' souls look like https://t.co/9F3ArRExMk Trevor doesn’t take The Daily Show’s Emmy nominations for granted. #BetweenTheScenes https://t.co/KZWip23UKi Scarlett Johansson’s bravest role yet https://t.co/MTs85R7x4k This dude jumped on a submarine in the ocean and banged on the door until someone opened it. That is the definition of “America, fuck yeah!” https://t.co/L3UHav7JDt Hey news media, we know it's tough to find new and inventive ways to avoid calling Trump racist. That's why we created the Trump Racist Euphemism Headline Generator: https://t.co/t7vbhHVmXz\n\nYou're welcome! https://t.co/gvJkj8EzKv RT @Trevornoah: Buddy was just as excited to hear that @thedailyshow was nominated for another 2 Emmys! Congrats to the amazing Daily Show… “It’s almost like Mitt Romney was playing the game Taboo and the forbidden word was ‘racist.’”\n\nRepublicans react to Trump’s tweets: https://t.co/Dr0sLVKxyK https://t.co/nVgCuAPpdQ RT @TheDailyShow: Trump doubles down on his racist tweets, while Republicans scramble to condemn them in terms other than “racist.” https:/… The U.S. Coast Guard makes a half-billion-dollar drug bust, the House votes to condemn President Trump's racist tweets, and rapper @Nas discusses his album \"The Lost Tapes 2.\"\n\nListen and subscribe: https://t.co/jR9RwtB8Lh https://t.co/QRYZeGzKf9 Here's the full piece with @MichaelKosta: https://t.co/OW2EeqhoTG Here’s the full interview with @Nas: https://t.co/QUlNrzjM7n Trump doubles down on his racist tweets, while Republicans scramble to condemn them in terms other than “racist.” https://t.co/wNCMBbo2ZV TONIGHT: Citizens of Toledo, Ohio are protecting Lake Erie by… legally recognizing it as a person? @michaelkosta reports: https://t.co/6C6apHbwu0 TONIGHT: Hip-hop icon @Nas is here to talk about his new album “The Lost Tapes 2”!\n\n📸: @ruminasean https://t.co/u4QsYZAQSo TONIGHT: One small step for military tech, one giant leap for pigeon poop revenge. https://t.co/6Em5WNUo6s When you truly love America https://t.co/tJ0S7EncrL What happens when you try to move a huge TV from one apartment to another in the middle of a massive blackout? #BetweenTheScenes https://t.co/UZS2SYKfs2 America’s morons have had enough. https://t.co/gmUVIsE0oa RT @ComedyCentral: Let’s party! Congrats to @TheDailyShow with @Trevornoah on their #Emmy nominations for Outstanding Variety Talk Series a… RT @defjam: Catch the one and only, @Nas tonight on @TheDailyShow w/ @Trevornoah 🚨\n\n📅: TONIGHT\n⏰: 11 p.m. ET https://t.co/9MpHtRRATH Television Academy Sends Nominationally-Charged Tweet https://t.co/qbtVACszAD \"Racially-charged\"?? You can do better. Next time you need to avoid calling Trump racist, try out our Trump Racist Headline Euphemism Generator! https://t.co/t7vbhHVmXz https://t.co/1hTkCzR03v A million people aren’t going to storm Area 51. A million people responded on Facebook, which means seven people are going to storm Area 51. https://t.co/33GMV9dVud Everyone says Trump’s tweets are racist. Trump says they’re not. Sounds like a case for Trevor Noah, Racism Detective. https://t.co/6H9Dlc7K1y News orgs! Can’t summon the courage to call Trump’s comments racist? We’re here to help! https://t.co/D02AX4srQ1 The FBI finds incriminating evidence in Jeffrey Epstein's mansion, New York City experiences a major blackout, and @DapperDanHarlem discusses his book \"Dapper Dan: Made in Harlem.\"\n\nListen and subscribe: https://t.co/eysASlrGL4 https://t.co/6dWTj7Qx2F You’ve heard the name, now meet the man -  Jeffrey Epstein: R. Kelly without the talent or melanin. https://t.co/9sXuUVI3tp Here’s the full interview with @DapperDanHarlem: https://t.co/Tf3xZqh1nR RT @LAM_Barrett: .@TheDailyShow made a baker bot and it’s spectacular https://t.co/MHOGUU0csk https://t.co/0HwC41yoQH RT @ergoking: @TheDailyShow This was the best of the dozen I generated. https://t.co/w2CVPuBuwX RT @LyndzLP: @TheDailyShow My favorite https://t.co/REwpZvVf8t RT @marinafang: These are so good: TRUMP PAINTS FRESCO OF RACE-TINTED KERFUFFLE\n\nTRUMP FORDS RIVER OF RACIALLY REDUCED BALSAMIC GLAZE\n\nTRUM… RT @dandrezner: I got “TRUMP THROWS PENNY IN FOUNTAIN OF RACE-ADJACENT OOPSIE-DAISY”!!! https://t.co/FCFGeC5VQ9 Hey media, need to write a headline about Trump being racist, but don't want to call him a racist? Try our Trump Racist Euphemism Headline Generator! https://t.co/xSSWFqKs99 https://t.co/zqYgCceW1d Trevor got caught in a somewhat compromising position during the NYC blackout. #BetweenTheScenes https://t.co/Cod7sKpZ6x TONIGHT: Fashion icon @DapperDanHarlem is here to talk about his new memoir “Dapper Dan: Made in Harlem”!\n\n📸: @ruminasean https://t.co/QMWQlNmTV3 TONIGHT: What’s worse: Trump’s racist jab at Pressley, Tlaib, Omar &amp; AOC, or his lame attempt at walking it back? https://t.co/nROYutm8cW Download our browser extension and Trump's tweets will appear as the crayon scribblings of a child, the way they're meant to be: https://t.co/pgL64CCJ00 https://t.co/0DXKxbsFNM THIS WEEK: We’re back with @DapperDanHarlem, @Nas, Nelson Makamo and @IamIshaSesay! https://t.co/vtUtjndKWJ Trevor might not have known he wanted to host The Daily Show when he was little, but he did know he wanted enough money to buy dessert. #BetweenTheScenes https://t.co/7XTPUODHQf RT @DEADLINE: ‘The Daily Show With Trevor Noah’ To Air Live After Round 2 Of Democratic Primary Debates https://t.co/FTLDgI85VF https://t.c… Trump’s racism is a family tradition that goes back decades! Learn more on our interactive tour of Donald Trump's New York: https://t.co/Rppz41Uxhr https://t.co/Q8xzzd9hCz 50% of the American public cannot name the three branches of government. Can @Jaboukie? Full piece: https://t.co/KRYie6ypEq https://t.co/G2XA5V7PQr #TBT to when Disney cast \"The Lion King\" 🍿🍿🍿 https://t.co/K3Tug0v7Wa “If Lehman Brothers was Lehman Brothers and Sisters, maybe they would have done a little bit better.”\n\nChristine @Lagarde breaks down the numbers to explain why equal pay for women and men is so important. Full interview: https://t.co/ks5XT78keU https://t.co/BoZnLoGSIO .@PeteButtigieg sticks around for a #TalkingDems audience Q&amp;A on domestic and foreign policy, his meeting with Rev. Al Sharpton and how he defines economic success. #Votegasm2020 https://t.co/6mzpHXStb0 Do virtual baptisms count? 🤔 \n\n@ronnychieng reports: https://t.co/jKtDmtXAuo https://t.co/UHA0eZzEfo MTV Cribs: Soweto featuring Trevor Noah https://t.co/85yOmKyhci We created an interactive tour of Donald Trump's New York City! Join Daily Show Virtual Tour Guide @MichaelKosta and visit all the places that made Trump \"Trump,\" and the places that Trump made \"Trump\" by slapping his name on it. \n\nFull tour: https://t.co/Rppz42c88Z https://t.co/SUtVdXInUd New York Senator Kirsten Gillibrand answers audience members' questions about her presidential campaign and how she plans to address the climate change crisis. #Votegasm2020 #TalkingDems\n@SenGillibrand https://t.co/9fKJQH81iV ICYMI: After months of protests, brutal Sudanese dictator Omar al-Bashir ends his 30-year rule, only to be replaced by an autocratic general. https://t.co/fYWXSVdGq3 The U.S. women’s soccer team is still fighting for equal pay after their fourth World Cup win. @DesiLydic womansplains the gender wage gap:\n\n#USWNTParade #USWNT #FIFAWWC https://t.co/zAJwrOahZK Trump treats George Stephanopoulos to the weirdest episode of “Cribs” ever. https://t.co/FDdU5MLorT What superpower would you have? @oliviamunn and Trevor discuss. https://t.co/eJYxG8eSQL After racist and sexist messages from Kyle Kashuv resurfaced, Harvard rescinded his acceptance. Now he’s on Fox News doing damage control. Full piece: https://t.co/cmNee6LpkM https://t.co/9ZGTldn8Pd What happened to Teddy from Trevor's book \"Born a Crime\"? The audience finds out #BetweenTheScenes https://t.co/FIdxu44YDd Careful what you wish for. https://t.co/S2zL3w0Y7c If you’re full of s**t, prepare to be told to get the f**k outta here. https://t.co/Ft0ElqnFu6 The U.S. women’s soccer team won their fourth World Cup, but are still fighting for equal pay. @DesiLydic womansplains the gender wage gap:\n\n#USWNT #FIFAWWC https://t.co/MBjNdyL4cx RT @TheDailyShow: “The women’s team wasn’t just playing to win a game – they were playing to win a lawsuit.”\n\n@DesiLydic breaks down the U.… “This is a promise: my cabinet will look like America.” @BernieSanders takes questions from the audience on immigration, diversity and debt in a special #TalkingDems #Votegasm2020 https://t.co/qwFYru9sDe RT @TheDailyShow: “The women’s national team is one of the most successful team sports in the world, and we’re still struggling to get equa… The National Anthem beat is wack.\n\n►@RoyWoodJr’s special #NoOneLovesYou: https://t.co/ZG3b8YM1iG https://t.co/zD7ioOE4Cv “If I stick a straw up my nose, I could get 35 million views on YouTube?”\n \nWhy are people rallying to ban plastic straws? @ronnychieng investigates. https://t.co/oXjN1wbUGY So close. https://t.co/MoLnC6LaHw Does Trevor still keep in touch with his old DJ friends? #BetweenTheScenes https://t.co/maxq3k1u4U .@KamalaHarris takes questions from the audience in this #TalkingDems. First up: Tupac. https://t.co/i4okacXDfL 3D-printed guns: yay or nay? #BetweenTheScenes https://t.co/RqfVqHU0Yx Elizabeth Warren has been fighting against predatory practices of banks and credit card companies long before it was cool. Full piece: https://t.co/pYZ5dk9ODz https://t.co/fvEoXNXaxC Join us on the definitive tour of Donald Trump's New York, from Central Park to the Fox &amp; Friends studio!\n\nVisit all 12 stops: https://t.co/9vLMZK8p0b https://t.co/bhoRwuIM47 How many people actually know the National Anthem? @DulceSloan investigates. https://t.co/oNAckxFUV7 When you know the lyrics to God Bless America https://t.co/stQzET8edt The National Anthem beat is wack. \n\n►@RoyWoodJr.’s special #NoOneLovesYou: https://t.co/MxUdhKR5dW https://t.co/lqMBluiaxT On this #IndependenceDay, we remember the time Barack Obama didn't wear a flag pin, the worst scandal in history. https://t.co/RzMcUxpHI6 Christine @Lagarde details the waste of time, energy and resources in businesses that don’t give women the same opportunities, salary and rights as men. Full interview: https://t.co/DGNcrkmt23 https://t.co/GGWa6c3XKD “I want to push a social-emotional learning curriculum, a trauma-based curriculum and a mental health counselor in every school, so we start dealing with the root causes of our kids’ inability to learn.”\n\nPresidential candidate @TimRyan discusses his education plan. https://t.co/UneJ1oO8oF .@RonnyChieng sounds off about pet owners who over-pamper their dogs with expensive spa treatments, fine dining and luxurious kennels. https://t.co/J0659qVoon .@arturocastro85 pokes fun at Latinx stereotypes on his new sketch series, #Alternatino.\n\n►Catch the first ep: https://t.co/6g2rTYVuAZ\n►Full interview: https://t.co/GzC0Ip6LJy https://t.co/aE0QTwz2r3 RT @DOEE_DC: It’s official, we’re enforcing the District’s single-use plastic straw ban. So what’s it like on the front lines of food servi… \"I hope we can get to a space where women, particularly women of color, toplining studio movies isn't something we need to celebrate because it’s just commonplace.”\n\n@TessaThompson_x has played several blockbuster roles, including her part in “Men in Black: International.” https://t.co/ESvdzHagsl This week on Unsolved Mysteries: White House Edition, what does Ivanka Trump actually do? https://t.co/Rc5BXKDD53 When you learn German to get closer to your dad, but accidentally get closer to Hitler. #BetweenTheScenes https://t.co/cDrn3MRthP PROPAGAND-OFF! Fox News vs. North Korean State TV https://t.co/RANF4qZD4b .@lindseyvonn on what inspired her to start https://t.co/sg23gQq9E3 https://t.co/To2NxNEPE9 “Who the f**k is Chuck Schumer?”\n\n@Jaboukie heads to Rhode Island to learn about the lack of civics education in high schools. https://t.co/T6fKswl2lF “You’re born into the world with a limitless sense of possibility and unbridled confidence, and over time the world chips away at that.”\n\n@ElaineWelteroth discusses her book, “More Than Enough,” and her fight against self-doubt. https://t.co/CSqagS5ERe The only thing you can roast Trump with is policy. #BetweenTheScenes https://t.co/Y5hYfn4vt5 Still we wonder... https://t.co/Aty7JFuLjN .@JacobTobia is gender-chill. Full interview: https://t.co/PiNHv2VzOA https://t.co/JlXbYkCs8M RT @Newseum: “Let us make ‘The Daily Show’ the most comprehensive news package that you can watch within 30 minutes on any given day,” said… Tim Ryan couldn’t get a word out, Jay Inslee looked like a sad bar patron, but John Delaney managed to grab the spotlight on health care. Full coverage: https://t.co/SxpUXRQssn https://t.co/nLfAlkqgQ1 ICYMI: Beto habla español, Klobuchar can’t land a zinger, and de Blasio bulldozes his way through #DemDebate night one. #Votegasm2020 https://t.co/QLq8T0Mp8n On the plus side this may be the first time he’s asked for consent https://t.co/kwrkeBz5Pr O.J. Simpson logged on to Twitter to talk about watching the Democratic Debates… or was it something else? Full coverage: https://t.co/RqTwvAp1Zz https://t.co/PPxCyjfBEO What was Marianne Williamson talking about? Full coverage: https://t.co/RqTwvAp1Zz https://t.co/moIV0etsx1 After what Kamala Harris did last night, Joe Biden’s time might be up. Full coverage: https://t.co/RqTwvAp1Zz https://t.co/PMzu1L17FS #DemDebate2: A good night for Kamala Harris, a bad night for Biden, and a very confusing night for Marianne Williamson. #Votegasm2020 https://t.co/xvIbgCvlAx Candidates clash in 2020's second Democratic primary debate, and Trevor sits down with former DNC Chair @GovHowardDean.\n\nListen and subscribe: https://t.co/caxteEfgTV https://t.co/wJh5tvROlH Here's our full interview with former DNC chair @GovHowardDean from tonight: https://t.co/YTzp1JvQs6 ⚡️ “The Daily Show Live Tweets The #DemDebate2 ” by @TheDailyShow\n\nhttps://t.co/BBsWsHQfoX RT @ronnychieng: Had a crazy dream that Marianne Williamson appeared in a presidential debate We're LIVE! ⬇️⬇️⬇️ #DemDebate2 https://t.co/1p7dGA9Rey #DemDebate2... YOU just got Swalwell'd! https://t.co/17sgN78DPr Trevor’s LIVE coverage of the second 2020 Democratic debate. #Votegasm2020 #DemDebate2 https://t.co/6XOKcA6N1C FUN FACT: The Daily Show is LIVE at 11/10c on Comedy Central! RT @ronnychieng: I'm in Miami at the Democratic Debates to host the newest gameshow craze sweeping America - Name Dem Candidates! TONIGHT o… 👀 #DemDebate2 https://t.co/dGIMddx3Yp MODERATOR: In one or two words, what would your first act as President be?\nBERNIE: Special interests\nKAMALA: Immigration \nMARIANNE WILLIAMSON: I was reading a wonderful article in GOOP about New Zealand, RT @roywoodjr: When a couple arguing on your flight but you got the middle seat #DemDebate2 https://t.co/B7y9DxNoqP FUN FACT: Michael Bennet is a middle school boy playing an adult in a play. #DemDebate2 Wanna feel old? Here's what the cast of Two and a Half Men looks like today #DemDebate2 https://t.co/gfwhQkb1vm Joe Biden... YOU JUST GOT SWALWELL'D #DemDebate2 https://t.co/vYqYX7hl4J \"Candidates, by show of hands: How many of you have no idea who the woman on the end is?\" #DemDebate2 https://t.co/plbDAg9qJd Achievement Unlocked: OHHHHHHHH\n#DemDebate2 https://t.co/MjlklPsL0p FUN FACT: Roy Moore has still not conceded. #DemDebate \"Ladies and gentlemen: The early bird special starts too damn late!\" #DemDebate https://t.co/t2hNcIkWmc FUN FACT: John Hickenlooper watched a porn with his mom. Somehow people have forgotten about this. #DemDebate FUN FACT: The plural of Buttigieg is Buttigi. #DemDebate FUN FACT: Bernie Sanders prepared for Thursday's debate by combing his hair on Monday. #DemDebate FUN FACT: The candidates debating tonight are running for President, a job first created for the 1997 Harrison Ford action thriller Air Force One. #DemDebate Trevor breaks down the second night of the Democratic debates LIVE. #Votegasm2020 #DemDebate https://t.co/XfaDRnUe6L RT @TheDailyShow: @BilldeBlasio https://t.co/lWx18u5isJ @BilldeBlasio https://t.co/lWx18u5isJ The thrilling story of a ragtag group who attempted to do the impossible: build a debate stage for 20 Democratic candidates. https://t.co/KEzPSwgm8z ¿Cómo se dice “illiterate”? \n\nFull coverage: https://t.co/SxpUXRQssn https://t.co/t5IiJPhOx9 Here’s an easy mnemonic device to remember all 20 Democratic candidates. #DemDebate \n\nFull coverage: https://t.co/SxpUXS83jV https://t.co/BoFzd0Xbwg Cory was shook 😂😂😂 https://t.co/ZQULY8jqcL “Beto O’Rourke was so fluent in Spanish, I bet half of America thought they flipped to Univision by mistake.”\n\nWarren impressed with policy, and Beto brought the Español. Full coverage: https://t.co/SxpUXRQssn https://t.co/X34o6PNDxK If there’s anyone who knows how to push their way into a crowded debate field, it’s a seven-foot giant from New York. #DemDebate Full coverage: https://t.co/SxpUXRQssn https://t.co/eQWcTcUUdB Beto habla español, Klobuchar can’t land a zinger, and de Blasio bulldozes his way through #DemDebate night one. #Votegasm2020 https://t.co/u9ymYamuWc Trevor gives a rundown of the first 2020 Democratic primary debate, and FiveThirtyEight senior political writer @perrybaconjr weighs in on how the candidates performed.\n\nListen and subscribe: https://t.co/md4SeEYxr0 https://t.co/ARsZodV1CS ⚡️ “The Daily Show Live-Tweets The #DemDebate - Night One”\n\nhttps://t.co/GXJj4Jn7Hy Here’s our full interview with FiveThirtyEight senior political writer @perrybaconjr from tonight: https://t.co/1iSkY3Njnf When you remember we have to do this all over again tomorrow #DemDebate https://t.co/SRvkN61qps We’re LIVE! ⬇️⬇️⬇️ #DemDebates https://t.co/OFoJPBBB65 Trevor’s LIVE coverage of the first 2020 Democratic debate. #Votegasm2020 #DemDebate https://t.co/S3cakNo5pe We're LIVE at 11/10c on @ComedyCentral! #DemDebate #Votegasm2020 https://t.co/k0LhLApj5j EXCLUSIVE: Behind-the-scenes footage of MSNBC's technical difficulties #DemDebate https://t.co/45jmBKmNIK BREAKING: Jay Inslee, John Delaney, and Tim Ryan have spontaneously fused into a jar of mayonnaise #DemDebate https://t.co/zq2oSwFrdg When your little sister steals your phone https://t.co/2vucJQxpOM RT @roywoodjr: Ya'll got this man on Live TV trying to think of a couple of words in Spanish to sprinkle in on his next answer. #DemDebate… No one:\n\nEvery Democrat: ¡Hola, muchachos! ¿Vamos a la playa? Ja ja ja ja ja\n#DemDebate Not your type? https://t.co/3smAE1oRk7 When Dad says \"Hola, como estas?\" to the waiter at the Mexican restaurant #DemDebate https://t.co/64FY2LV6kp Achievement Unlocked: ¡Tiempo de pander! #DemDebate https://t.co/2D5u5aerPJ Team de Blasio signing on! #DemDebate https://t.co/FZsZBVFEJx https://t.co/Rdp1VG1I5I Warren arrives at the #DemDebate with all her policies in tow https://t.co/4rc5SNl8dE Trevor breaks down the first night of the Democratic debates LIVE. #Votegasm2020 https://t.co/DlzACdROnJ This is amazing — schools around the country named after Robert E. Lee want to change their names, but in order to save money, the name still has to end in Lee. https://t.co/lQ4cWMMuaF “Being Latino, everybody expects you to be suave, like spicy food or be really good at dancing. I’m a terrible dancer, and I really like Matcha.”\n\n@arturocastro85 pokes fun at misconceptions about Latinx in his new show. Watch the #alternatino premiere: https://t.co/6g2rTYDTcp https://t.co/0qJWRgTMMR RT @iammunimaslam: @TheDailyShow I don't even know the right answer Name this Democratic candidate. Wrong answers only. https://t.co/aawLSw3zMC .@jaboukie visits a Rhode Island high school to learn about the fight for civics education. Full piece: https://t.co/N36L1QNqfv https://t.co/HW1dFf1NNu A 22nd woman has accused Donald Trump of sexual assault. Full piece: https://t.co/skuyMcSUov https://t.co/oYCp0HJk92 Bernie Sanders is proposing a plan to eliminate a trillion dollars of student debt in just six months. https://t.co/texs4qsAN2 A 22nd woman accuses Trump of sexual assault: https://t.co/5pFlRA9yR4 Bernie Sanders announces a plan to cancel student loan debt, @jaboukie investigates a student-led fight for civics education, and @oliviamunn discusses \"The Rook.”\n\nListen and subscribe: https://t.co/AqyEUvS5hI https://t.co/wHzykJZiCx Here's the full piece with @jaboukie: https://t.co/N36L1QNqfv Here’s the full interview with @oliviamunn: https://t.co/sLXlHgQcx7 Outrage over Trump's election helped make the #MeToo movement mainstream, but so far he's been immune to its effects. https://t.co/13JuBXrbsK RT @FallonTonight: Tonight on the show: @Trevornoah, @SebastianComedy, and magic from @pennjillette &amp; @mrteller! #FallonTonight https://t.c… TONIGHT: @jaboukie meets the students fighting to give their peers a better civics education. https://t.co/KTbj8Bm9eH RT @oliviamunn: So many emotions on @TheDailyShow tonight w @Trevornoah // @TheRookSTARZ #TheRook premieres this Sunday on @STARZ https://t… TONIGHT: @oliviamunn is here to talk about her new show @TheRookSTARZ!\n\n📸: @ruminasean https://t.co/7zka4wXlNt TONIGHT: Sanders wants student loan debt to feel the Bern. https://t.co/hFJzMAIJUU The point is, we are at peace thanks to, and in spite of, Donald Trump. https://t.co/qRz5dSm4g7 Trevor looks at the fallout from the Iran non-strike. Full piece: https://t.co/bmVvNcXaW9 https://t.co/WkaZThelsB A Louisiana police department recently promoted an officer who shared a racist image on social media. Full piece: https://t.co/O4oTIBmm7v https://t.co/Qb2rjKwUzP What a time to be alive. https://t.co/ZA8Beh039C Asylum seekers in America are treated even worse than how Somali pirates treat their hostages. Full piece: https://t.co/caLwQBI3uy https://t.co/jdO5kFzpxi President Trump makes a last-minute decision against bombing Iran, a database exposes cops' racist Facebook posts, and author @ElaineWelteroth discusses \"More Than Enough.\"\n\nListen and subscribe: https://t.co/dWBKMnQKJR https://t.co/wJsVzqd4RB Here’s the full interview with @ElaineWelteroth: https://t.co/rzrMWarDuj The U.S. comes close to war with Iran (thanks to Trump) but narrowly avoids it (also thanks to Trump). https://t.co/cy3968iSfo TONIGHT: Media trailblazer @ElaineWelteroth is here to talk about her book #MoreThanEnough!\n\n📸: @ruminasean https://t.co/NsUWj3a1Dd TONIGHT: The #BETAwards are a night to celebrate black excellence and… Billy Ray Cyrus? https://t.co/jVAhKrfTSK RT @ElaineWelteroth: About to go on @TheDailyShow show with @Trevornoah...so excited (and nervous!!)! Wish me luck, fam! 🙏🏽 .@marsaimartin took home the Young Stars honor at the #BETAwards last night. So what’s next for her? Full interview: https://t.co/duY9YQb791 https://t.co/Tw9XcJD7LS .@AnnaKendrick47 finds out that she’s on an audience member’s \"list\" and Trevor has no idea what that is #BetweenTheScenes #FYC https://t.co/ciq8lgkeUs A sci-fi look into the future, where white people 👀 think twice before calling 911 on innocent black people 👀 https://t.co/I43RHM3ZmG .@DesiLydic traveled the world to talk to women and all she has to show for it is a vagina tattoo and this special: https://t.co/0C9b8RX0X7\n\nDesi Lydic: Abroad #FYC https://t.co/bsUqT8CSKg THIS WEEK: @ElaineWelteroth, @oliviamunn, @perrybaconjr and @GovHowardDean stop by! https://t.co/VW1XXd82PY The #1 question Trevor got when he became host: What does a South African know about American politics? #FYC \n\nFull panel from @WSJ's Future of Everything Festival: https://t.co/TOLSYrb1BA https://t.co/qajKvD4lTr Here’s how Trevor’s 10-year-old brother once explained his mixed family to other kids. #BetweenTheScenes #FYC https://t.co/rVg2UACbJq If you build it they will come (in through the Canadian border). https://t.co/xVXHGp1cuG RT @ComedyCentral: .@jaboukie tells @Justsydnyc how he takes his coffee in @TheDailyShow offices and it's disgusting. #Clusterfest\nhttps://… Executive Producer @jenflanz on why a lot of women hesitate to speak up in writers’ rooms and the advice she gives to women at The Daily Show.\n\nFull panel from @WSJ’s Future of Everything Festival #FYC: https://t.co/TOLSYqTqd0 https://t.co/4mMOMTrgeM Can’t stop watching these world leaders sit there while Trump spews his nonsense https://t.co/wm73eF4Sk5 Pregame for the #BETAwards with @roywoodjr: https://t.co/jza5RHWmkQ IMF Managing Director Christine Lagarde makes the case for investing in women as powerful economic players. https://t.co/ohtHwyhq3J Trump kicked off his 2020 campaign this week in 2016 fashion #FYC https://t.co/8c8zyizCsG An audience member asks Trevor #BetweenTheScenes about his dog, Fufi. Funny story… #FYC https://t.co/nipgaCcICE Catch the 2019 #BETAwards, tonight at 8/7c! “Why is Beyoncé still being nominated?! At this point she should just have her own category and the trophy should be called The Beyoncé.” \n\n@roywoodjr recaps the #BETAwards nominees: https://t.co/2mVF9h6orc Trevor visits his grandma in Soweto, South Africa, to talk about his childhood, her life under apartheid, and what he needs to do to get her to watch The Daily Show. #FYC https://t.co/LESb0gyiLC Silicon Valley is embracing pet chickens and bare feet...like Africa always has. #BetweenTheScenes #FYC https://t.co/TlMuytAF5X .@TessaThompson_x dispels the myth that black and brown faces on movie posters don’t sell overseas.\n\nFull interview: https://t.co/kw6giRUOEm https://t.co/8iKYsoBY2H .@roywoodjr celebrates Juneteenth in the latest #CPTime. Full piece: https://t.co/QpBDAFgXOv https://t.co/Dz62B5oR4k Millennial parents are getting creative with how to punish their kids. #BetweenTheScenes #FYC https://t.co/POenjI3On7 Trump treats George Stephanopoulos to the weirdest episode of “Cribs” ever. https://t.co/I2yXDlzhoS Summer's here and this is still the best story of 2019… https://t.co/I5i4MUQdDs “I cannot truly understand the impact of limiting a woman’s right to control her own body because I am not a woman. So, it helps that half of our staff is women.”\n\nTrevor talks representation and more. #FYC Full panel: https://t.co/TOLSYrb1BA https://t.co/eGeCFu7HMm Trevor and members of his team sit down with The Wall Street Journal's @JoannaStern to discuss the inner workings of The Daily Show at The Future of Everything Festival.\n\nListen and subscribe: https://t.co/7ZDfzIefEM https://t.co/Qetd6alor3 RT @THR: 'New Tape': An epic (and hilarious) adventure from @TheDailyShow host @Trevornoah. Watch the full video: https://t.co/SiOt457f0Z h… What does a South African know about American politics?\n\nTrevor and The Daily Show creators answered that and more at @WSJ’s Future of Everything Festival. #FYC Full panel: https://t.co/BWyhJ7sE4y https://t.co/R5ozKskJg9 NEW: White House releases photos of Trump consulting with chief military advisers over Iran strike https://t.co/KEESgunLI7 RT @Newseum: Our newest exhibit, #SeriouslyFunny, is now open! \n\nSee the funnier side of the news from @ComedyCentral’s @TheDailyShow and o… .@Oprah stayed after her interview for #BetweenTheScenes, or as she calls it, “the behind-the-scenes thing you do.” #FYC https://t.co/G4wQlif0BM “Any American can help. You can call your congressperson, and you can urge them to keep the pressure on Sudan. You can actually make a difference.”\n\nFull piece: https://t.co/0kq8yTVs1g https://t.co/GKnjYYWHTa RT @TheDailyShow: Trevor on reparations. #BetweenTheScenes https://t.co/mby825Pumc Critics blast Joe Biden for his anecdote about getting along with segregationists, Sudan's longtime dictator is deposed, and former Olympic Alpine skier @lindseyvonn stops by.\n\nListen and subscribe: https://t.co/oB7r9PJ9gP https://t.co/lCoI4O35eL Here’s the full interview with @lindseyvonn: https://t.co/RT49mO2gKE Social media’s lighting up about the Sudan situation. Here’s the long and short of it: https://t.co/uu6st2eN4n TONIGHT: @lindseyvonn is here!\n\n📸: @ruminasean https://t.co/ucekAFtLCQ Trevor on reparations. #BetweenTheScenes https://t.co/mby825Pumc TONIGHT: The relationship between America and Iran just went from tense to trigger-happy. https://t.co/oTqm7IAO3M If you're in the D.C. area, check this out! https://t.co/RsZCAUkd8C A Trump-loving city elected an African refugee mayor? See for yourself. #WorldRefugeeDay https://t.co/jc2tmDutVv Who is Donald Trump? One CNN analyst has figured it out. https://t.co/Dpv5wiXm59 Full interview with @RefugeeAssist director Becca Heller:\nhttps://t.co/kaEBnlDbly Why anti-refugee arguments just don’t add up. #WorldRefugeeDay https://t.co/Ji9FaKVKrz This cocaine bust is big news for Philly, and huge news for Gritty. https://t.co/Baut9OV44F “America should switch back to the old-school Netflix DVD plan. You can start a new war, as soon as you finish the ones you already have.”\n\nTensions rise between America and Iran: https://t.co/SbchV7jMdd https://t.co/ppMkBjIF3h RT @Trevornoah: This is amazing. I didn't know they were recording.😂😂😂😂 @THR https://t.co/FdANHRoDjI .@Malala on how to put a face to refugee experiences, how to communicate the urgency of their needs, and the importance of listening to refugees tell their stories. #WorldRefugeeDay https://t.co/K2EU6bKLiA Iraq War 2: This Time, It’s Persianal https://t.co/diMaWzs3qC U.S.-Iran tensions escalate, @roywoodjr commemorates Juneteenth with stories of escaped slaves, and @arturocastro85 chats about his show Alternatino with Arturo Castro.\n\nListen and subscribe: https://t.co/mxqGzXNtH8 https://t.co/cfAKElP1L6 RT @arturocastro85: Thank you @Trevornoah and @TheDailyShow for giving me my late night debut. You were such a gent and your crew is amazin… Here's the full piece with @roywoodjr: https://t.co/z2319yLjUf Here’s the full interview with @arturocastro85: https://t.co/2hPjzkHppY RT @sxsw: .@TheDailyShow host @Trevornoah and correspondents @ronnychieng, @michaelkosta, @DesiLydic, @dulcesloan, @roywoodjr, and @jabouki… Can America at least wrap up one of its other wars before starting a new one with Iran? https://t.co/X4nHf4e7Y7 TONIGHT: It’s Juneteenth and @roywoodjr is celebrating with a new CP Time.\n\n📸: @ruminasean https://t.co/rotsCinV8V TONIGHT: Creator and star of #Alternatino @arturocastro85 is here!\n\n📸: @ruminasean https://t.co/SzjHdp8fyj TONIGHT: Trump 2020: Now in stereo! https://t.co/YTWn9SvIA7 Last night Trump unveiled his fresh new platform for 2020 https://t.co/3yQfVTTEKT Even rappers would see Kyle Kashuv’s N-word count and be like, \"You gotta throw in some other lyrics, man.”\n\nFull piece: https://t.co/qSv6eDJWVS https://t.co/2lkSnKdPGN RT @Newseum: “The biggest legacy of all is that I hope people would go, ‘That was a hell of a funny show that talked about politics and the… “Here I am! I am queer! I have a debit card!”\n\n@jaboukie’s at the Pittsburgh Equality March to find out how the LGBTQ community feels about corporate participation in Pride Month. https://t.co/nwtzFz0wxa RT @THR: Watch @trevornoah break out his Bernie Sanders impression while talking about #TheDailyShow segment on the Senator's public access… RT @Trevornoah: So excited and honoured to be on this week’s cover of @THR https://t.co/gDO9vcK1QD 📷: @alex_gavillet https://t.co/r3SwdxR3nO Dogs evolved eye muscles to appeal to humans and appear even cuter. They cannot be trusted. Full piece: https://t.co/tduUyvsqgl https://t.co/A9cCzVSdb2 Racist comments cost Parkland student Kyle Kashuv a spot at Harvard. Full piece: https://t.co/qSv6eDJWVS https://t.co/pVPjh62Ole RT @THR: THR Cover: How @Trevornoah became the busiest man in comedy https://t.co/q2JLltqdwh https://t.co/9yWFePiE0U Talking about Kyle Kashuv, Harvard, and the n-word: https://t.co/sa8PuAaJOl A study finds that dogs' eyes evolved to appeal to humans, Harvard rejects a Parkland survivor over racist comments he posted online, and DNC Chair @TomPerez stops by.\n\nListen and subscribe: https://t.co/u8IwZE9hwV https://t.co/iZak0nL0xW Here's the full piece with @jaboukie: https://t.co/065r7Iy9CI Here’s the full interview with @TomPerez: https://t.co/NBbj7XB83l How dare Harvard admissions judge someone for what they did in high scho-- oh, wait. https://t.co/POtS1MBrUR TONIGHT: Are corporations jumping on the rainbow bandwagon just to bring in the green? @jaboukie hits the Pride circuit to find out: https://t.co/zV6IDLOsw0 TONIGHT: DNC Chair @TomPerez is here!\n\n📸: @ruminasean https://t.co/fp1oTwQeGp RT @Newseum: .@Trevornoah wore this suit on his first day hosting @TheDailyShow in 2015. Noah, who is from South Africa, joked, “A job Amer… The only way to beat Trump at his own game is to not play the game at all. #BetweenTheScenes https://t.co/DBIJUt5RHO According to Pete Buttigieg, statistically speaking, America has probably had a gay president. https://t.co/fMSOuOclB8 We all know what that cough was about… https://t.co/eB4PgzoggP Phoenix police threaten to shoot a black family suspected of stealing a Barbie doll. Full piece: https://t.co/HJzGNAg1y2 https://t.co/L2gxdRz4Cu RT @DEADLINE: ‘The Daily Show With Trevor Noah’ To Air Live After 2-Night Dem Debate https://t.co/wINkB41vzn https://t.co/mdJ8Dee8ym O.J. Simpson is now following you! https://t.co/KEPpOeCEDz That didn’t sound like a real cough. That sounded more like a “Shutthefuckupaboutyourtaxes.” Full piece: https://t.co/9DLHr8DVw0 https://t.co/oMpLxPykJA Phoenix cops caught on tape: https://t.co/nA4aOjds23 RT @Lagarde: I had a great conversation with @Trevornoah on @TheDailyShow last night. We spoke about reforms to level the playing field for… Phoenix cops spark outrage for threatening a family, George Stephanopoulos interviews President Trump, and Trevor chats with managing director of the IMF Christine @Lagarde.\n\nListen and subscribe: https://t.co/gOH5OcryXw https://t.co/Mj0FWaTZ78 Here’s the full interview with @Lagarde: https://t.co/5aztyuGWAk “You know what’s most troubling about this? How many people have been arrested and put in jail because everyone assumes the police version of events is always the truth.”\n\nCell phone footage shows Phoenix police threatening to shoot a family over a stolen Barbie. https://t.co/SpGVXNiLfp TONIGHT: International Monetary Fund Managing Director Christine @Lagarde is here!\n\n📸: @ruminasean https://t.co/dKTuU4uS9r TONIGHT: Trump treats George Stephanopoulos to the weirdest episode of “Cribs” ever. https://t.co/5kpd73wn9Z When grandpa's telling the same stories again and you can't get him off the phone https://t.co/1sLnhM6IbS Turns out humans have been getting high since 500 B.C. https://t.co/tW3QyLWW1m Biden, Sanders, and Warren are out of their dictatorship prime. Full piece: https://t.co/QAF4nNji5Y https://t.co/DzcDmT2kzv THIS WEEK: @Lagarde, @TomPerez, @arturocastro85 and @lindseyvonn stop by! https://t.co/qhi8BBYLAs “I’ll have you know my father works at Red Lobster!” https://t.co/rWGxHlQIyQ When TSA Pre-Check comes with a complimentary post-check. #BetweenTheScenes https://t.co/blHlkGnuQk RT @cgreenba: Not sure whether to laugh or cry after visiting the #DailyShowLibrary, but it was worth the wait to see it! https://t.co/A5lp… RT @motothero: Had the best time at #DailyShowLibrary! Good to know that while we may live in a dumpster fire, at least we can still laugh… Trump: * exists *\nEvery other world leader: 😐 https://t.co/m8XA5IZ505 Should fathers in the U.S. get longer parental leave ? \n\nFull “@DesiLydic: Abroad” special: https://t.co/tqdcxj3WMw https://t.co/aOEJklstAZ RT @sandramoscoso: Took in a little culture today at the #DailyShowLibrary. Line was long. SAD! But totally worth it. BALANCED GENIUS! http… D.C. you need to be in line for the #DailyShowLibrary by 4:30pm if you want to get in tonight. We’re sorry. \n\nThis was the largest audience to ever witness a Presidential Twitter Library, period, both in person and around the globe. RT @IMFNews: .@Lagarde will be on @TheDailyShow with @Trevornoah tomorrow, Monday, June 17 at 11pm ET to talk about #trade, #gender, and #e… “If I stick a straw up my nose, I could get 35 million views on YouTube?”\n \nWhy are people rallying to ban plastic straws? @ronnychieng investigates. https://t.co/TtlZdETaaP If you’ve ever been in an Uber and thought, “I wish we could do this 10,000 feet in the sky,” you’re in luck. Full piece: https://t.co/yIQTRmB8gB https://t.co/KMAm0w3tEz Happy Father’s Day to David Oyelowo’s dad and David Oyelowo’s dad only. https://t.co/uy2PDtsBaQ “The women’s team wasn’t just playing to win a game – they were playing to win a lawsuit.”\n\n@DesiLydic breaks down the U.S. women’s soccer team’s historic 13-0 win: https://t.co/S0T2Un3Hqh https://t.co/SfEjIGnMlz Here at the Trump Presidential Twitter Library in D.C., we take research and data visualization very seriously. Happy Father’s Day. #DailyShowLibrary https://t.co/3rreaNerM9 Today’s the last day! 12-8pm at The Showroom - 14th and L Happy Father’s Day from The Trump Presidential Twitter Library - D.C. #DailyShowLibrary https://t.co/Of556JqymV Tired of CBD? Try @TheLewisBlack's CTFD. Full piece: https://t.co/5gmcZRKf91 https://t.co/8Fv0ZZEgyf “I wanted to give opportunity to women that look like me, to young girls that look like me.\"\n\n@thedanieb passed on movie offers to perform ‘Shakespeare in the Park’ for free. Full interview: https://t.co/GwMIhvKbW2 https://t.co/pxcMEa4gEq Amen! ✌️ https://t.co/v5NS7jTM5u RT @Honey_Blonde29: #dailyshowlibrary https://t.co/bQBYZNCSFz RT @CarpeNoctom: #DailyShowLibrary https://t.co/5FUXjcbW4f Obama hits the podcast world and escaped lions hit South Africa. https://t.co/uki15S7HEl RT @jbillinson: He’s tweeting! #DailyShowLibrary https://t.co/fj719s6OVD RT @jbillinson: The memorial for the deleted tweets is an incredible touch #DailyShowLibrary https://t.co/5atjZ6D80H RT @ABC7News: .@TheDailyShow celebrated @realDonaldTrump's birthday by opening a pop-up exhibit featuring the president's most memorable tw… The Vatican might want to take a look in the mirror before maligning the trans community… https://t.co/K9085eMkEz Reminder that we’re also open tomorrow from 12-8pm Attention D.C. Trump Presidential Twitter Library patrons: be in line by 7pm if you want to get into the Library today. We didn’t expect the biggest Twitter Library crowds of all time, but here we are. #DailyShowLibrary Today &amp; tomorrow only: https://t.co/tfaiYk7WLv .@realDonaldTrump, the people of D.C. are LOVING your Presidential Twitter Library! #DailyShowLibrary https://t.co/B3R68gFnG3 Trump loves law and order… until the law doesn’t follow his orders. https://t.co/EPcPLb8LRW The first defendant sentenced in the college admissions scandal is a former Stanford sailing coach who accepted 610,000 in bribes. Full piece: https://t.co/kXlh5We4XD https://t.co/bECFdV2jd1 Open today and tomorrow only: https://t.co/tfaiYk7WLv New in the D.C. Trump Presidential Twitter Library: A tribute to Melania Trump, aka the new Jackie O, and her effort to combat cyberbullying. #DailyShowLibrary https://t.co/gbmTd5sxcv \"It is a little sad that the friendship tree died, but at the same time, it did last longer than most people do in Trump's White House.\"\n\nEmmanuel Macron and Donald Trump's friendship tree has died. Full piece: https://t.co/yIQTRmjwS1 https://t.co/WMhbr4lf5U RT @TheDailyShow: Can’t stop watching these world leaders sit there while Trump spews his nonsense https://t.co/dn5imhNgRJ RT @DanaMarlowe: There is nothing you could be doing this weekend DC friends, as cool as stopping by the @TheDailyShow #dailyshowlibrary an… RT @JCWG_Advocate: #DailyShowLibrary Listen Here! This Daily Show team had some incredible researchers- the amount of information &amp; details… RT @skenigsberg: Lmao @realDonaldTrump just tweeted while I’m at the #DailyShowLibrary and they have an alarm that goes off @TheDailyShow 😩… RT @TheDailyShow: @WhiteHouse @realDonaldTrump We, too, celebrated #FlagDay with a ceremonial flag hugging here at the Trump Presidential T… @WhiteHouse @realDonaldTrump We, too, celebrated #FlagDay with a ceremonial flag hugging here at the Trump Presidential Twitter Library in D.C.! #DailyShowLibrary https://t.co/VozSak8tGy We would like to invite all, even the haters and losers, to the Donald J. Trump Presidential Twitter Library - now open in Washington D.C.\n#DailyShowLibrary https://t.co/8qyXlSZqou Do you know how to spot a deepfake video? We’re here to help. https://t.co/9iwo9iUThJ “He was sentenced to just one day? I’ve been stuck in the airport longer than that.”\n\nThe first defendant in the college admission scandal has been sentenced to one day in jail. https://t.co/PJFdJJHlRh RT @fran_chambers: This is what happens when @realDonaldTrump tweets inside the #dailyshowlibrary https://t.co/m58maiMPnx RT @washingtonian: Add @TheDailyShow's Trump exhibit to your weekend plans. \n\nhttps://t.co/gV4lP0vJLF This is the longest line to ever witness a Presidential Twitter Library -- period -- both in person and around the globe. https://t.co/wk0tjotYd8 Donald Trump is doubling down on his pro-meddling stance. Full piece: https://t.co/uFRca24KBK https://t.co/fc12huhgaR RT @nicksmithnews: LOOK! \nA LINE AROUND THE BLOCK!\nTODAY @5PM @fox5dc a sneak peek  @TheDailyShow @Trevornoah presents:\nTHE DONALD J. TRUMP… The Donald J. Trump Presidential Twitter Library D.C. is officially open! Stop by Friday through Sunday from 12pm-8pm, just blocks from the White House at The Showroom - 1099 14th St. NW https://t.co/F1Sx0Uhg8v RT @MattGertz: Because my life was apparently insufficiently surreal, @TheDailyShow “Donald J. Trump presidential twitter library” pop-up m… RT @jiveDurkey: .@TheDailyShow has arrived in D.C. https://t.co/NWiwW2CS2P RT @Cpatrickis: The @realDonaldTrump “Presidential Twitter library” opens today on 14th street. @TheDailyShow with @comedy said it’s a cele… Trump attempts some damage control after his pro-meddling controversy and admits to a secret meeting with Free Willy.\n\nFull piece: https://t.co/uFRca24KBK https://t.co/mq2YTJZGPY Really pulled out all the stops to get @realDonaldTrump to the Trump Presidential Twitter Library. #DailyShowLibrary \n\nHours/location: https://t.co/tfaiYk7WLv https://t.co/XqPCSa5Ykj RT @TheDailyShow: @IvankaTrump Happy Birthday! Come celebrate at The Daily Show’s Trump Presidential Twitter Library! https://t.co/CdgL65hp… @IvankaTrump Happy Birthday! Come celebrate at The Daily Show’s Trump Presidential Twitter Library! https://t.co/CdgL65hp1t Happy Birthday Mr. President. Take a break from your empty schedule and visit The Daily Show's Trump Presidential Twitter Library. It opens today just a few blocks from the White House! #DailyShowLibrary\n\nMore info: https://t.co/tfaiYk7WLv https://t.co/sl99M9byDM President Trump says he might accept dirt on his rivals from foreign governments, @ronnychieng blasts over-pampered dogs, and Rep. @TimRyan discusses his 2020 White House bid.\n\nListen and subscribe: https://t.co/g6CeygRvXx https://t.co/IV6eQt1zo5 Here's the full piece with @ronnychieng: https://t.co/MjJNzJTysS Here’s the full interview with @TimRyan: https://t.co/hZfUPCzou9 Friday to Sunday ONLY. Hours/location: https://t.co/tfaiYk7WLv A Very Important Message from President Donald J. Trump: https://t.co/EumNZNkfUK Trump loves law and order… until the law doesn’t follow his orders. https://t.co/OrUWu5AlL0 RT @ronnychieng: Tonight on the @thedailyshow I catch treats with mouth 📷 @ruminasean https://t.co/Idv14m3cHj TONIGHT: Everything is stupid, including your pets. @ronnychieng tells us why:\n\n📸: @ruminasean https://t.co/cttxJfg26o TONIGHT: 2020 presidential candidate @TimRyan is here!\n\n📸: @ruminasean https://t.co/bP1hpOoHH8 TONIGHT: Sarah Huckabee Sanders is leaving the job she hasn’t been doing for months. https://t.co/QCgAIXBeFc RT @TimRyan: Hard at work on my way to NYC to talk with @Trevornoah on @TheDailyShow tonight. Tune into Comedy Central at 11. https://t.co/… So beautiful for Trump to honor Sarah Huckabee Sanders with one final lie https://t.co/VznIigAyQX Hucka-byeee! Sarah Sanders OUT. Who will be the next to go?! #TheCelebrityAppresident https://t.co/qQnvXJkAem Can’t stop watching these world leaders sit there while Trump spews his nonsense https://t.co/dn5imhNgRJ RT @Newseum: A tweet is worth 280 characters, the president’s tweets…priceless. The Donald J. Trump Presidential Twitter Library presented… Hours/location: https://t.co/tfaiYk7WLv .@DesiLydic reacts to criticism of the U.S. women’s soccer team: https://t.co/T1a8bp4wOv https://t.co/BqT1mzvGTn Joe Biden’s 40-minute speech about Trump in Iowa would make a pretty good stand-up special. Full piece: https://t.co/dw9qpgGM12 https://t.co/Q9XayvmHH0 https://t.co/B33f0w9TUw “The women’s team wasn’t just playing to win a game – they were playing to win a lawsuit.”\n\n@DesiLydic breaks down the U.S. women’s soccer team’s historic 13-0 win: https://t.co/T1a8bp4wOv https://t.co/EDQHgxESOg RT @TheDailyShow: Donald Trump apparently keeps secret documents in his suit pocket, has a pen pal in Pyongyang, and can’t pass up a chance… Will he or won’t he? https://t.co/5GIoLZqYLb Here's the full piece with @DesiLydic: https://t.co/T1a8bp4wOv Here’s the full interview with @TessaThompson_x: https://t.co/KQkaWyOwY0 Donald Trump apparently keeps secret documents in his suit pocket, has a pen pal in Pyongyang, and can’t pass up a chance to go after Joe Biden. https://t.co/ZBxYWx3mj0 TONIGHT: Was the U.S. women’s soccer team’s 13-0 victory “unsportsmanlike”? @DesiLydic weighs in:\n\n📸: @ruminasean https://t.co/9ZsEYVBiXS TONIGHT: @TessaThompson_x is here to talk about Men in Black: International!\n\n📸: @ruminasean https://t.co/sL6fmQkUw8 TONIGHT: The U.S. Women’s soccer team goes OFF against Thailand. https://t.co/hi8wOaGtWm Spiced up @realDonaldTrump’s daily intelligence briefing https://t.co/4dW7IQFQ3M “For me, removing myself from that environment was the first thing… I started doing the only thing I really knew how to do, which was working with food.”\n\n@ChefKwame on his journey from selling drugs to competing on “Top Chef.” Full interview: https://t.co/rO3GATj1nF https://t.co/k6R3vzMRGR “If I come back and see any plastic straws in here, I’m burning this whole f**king place to the ground.”\n\n@RonnyChieng: Straw Cop doesn’t mess around when it comes to the plastic straw ban. Full piece: https://t.co/49ZvMiHCSp https://t.co/wRLNaa7v1p The Vatican might want to take a look in the mirror before maligning the trans community… https://t.co/mbIfPMACet https://t.co/ITYaAReHVd Russians are hardcore. These ships are about to crash into each other and Russian sailors are busy getting a sun tan. Full piece: https://t.co/2Jma6dmsDt https://t.co/l1aEYwkbrf .@realDonaldTrump you rolling? https://t.co/LMK8PPOR2K RT @Adweek: The Daily Show buys ads on Fox News in DC inviting Trump to its presidential Twitter library: https://t.co/OudPsjrLp7 https://t… RT @THR: 'The Daily Show' airs \"presidential Twitter library\" ad on Fox News https://t.co/cPjimz093I https://t.co/nWc96lOhwM The Vatican dismisses the notion of non-binary gender, Vladimir Putin builds an alliance with China's Xi Jinping, and @ChefKwame discusses \"Notes From a Young Black Chef.\"\n\nListen and subscribe: https://t.co/EhHnxw9cPk https://t.co/8MEzBwZVfM Here's the full piece with @ronnychieng: https://t.co/49ZvMiHCSp Here’s the full interview with @ChefKwame: https://t.co/rO3GAT1qw7 Russia plays chicken with an American warship, and Vladimir Putin floats Xi Jinping as his new BFF. https://t.co/1s23PrNqUu TONIGHT: @ronnychieng has a unique solution to plastic pollution. https://t.co/nkE1F55imO Looking good. See you Friday, D.C. \n\nHours/location: https://t.co/tfaiYk7WLv https://t.co/0YoHYtwdr8 TONIGHT: @ChefKwame is here to talk about his memoir “Notes From a Young Black Chef”!\n\n📸: @ruminasean https://t.co/YR8Iw4kJn4 TONIGHT: The Vatican might want to take a look in the mirror before maligning the trans community… https://t.co/4WVlCJXnyA These lions running rampant in South Africa aren’t helping the country’s reputation. https://t.co/oHByvSchum .@ericswalwell chats with the audience about the war in Afghanistan, healthcare, and education. #Votegasm2020 #TalkingDems https://t.co/1vEijXOyn1 “Aside from all the arguments for these women earning the same as the men, we haven’t once talked about them actually winning championships.”\n\n@AbbyWambach discusses the success of the @USWNT and fight for equal pay. Full interview: https://t.co/bdAB4grJYy https://t.co/L8UsHQHHqb Credit where it's due, great deal https://t.co/FW17JjF8cJ RT @NBCNews: WATCH: Jon Stewart's full statement before House cmte., demanding additional funding for 9/11 victim compensation fund, which… Trevor’s sit-down with his gran in Soweto was just a casual family visit… with a camera crew tagging along. #BetweenTheScenes https://t.co/3l0JIekYBR The Daily Show Presents: The Donald J. Trump Presidential Twitter Library -- Washington D.C. \n\nFriday - Sunday ONLY\n\nAn experience that makes you think literally *anyone* can be president. https://t.co/ilYgNu5kPs RT @PodSaveThePpl: For the season 3 premiere, @deray @MsPackyetti @samswey &amp; @ClintSmithIII discuss the murders of Black trans women, house… Before you hate on Trump and say he didn’t get anything major out of this Mexico deal, you’re forgetting one thing… but it’s a secret.\n\nFull piece: https://t.co/e9dafSdi8N https://t.co/pjoCLRspll President Obama would like you to subscribe to his podcast: https://t.co/oBWn4XwAYj Talking Trump’s tariff deal: https://t.co/Kf2VunAt3q Democratic presidential contenders make their case in Iowa, President Trump cancels his Mexico tariffs, and actor @thedanieb chats about her Shakespeare in the Park gig.\n\nListen and subscribe: https://t.co/uLT0nnTw71 https://t.co/snsCKY7DrG Here’s the full interview with @thedanieb: https://t.co/GwMIhvKbW2 People love a reboot, but dressing up an old deal as a new deal? Come on now… https://t.co/l1fVfiOTzT TONIGHT: Actor @thedanieb is here to talk about @PublicTheaterNY’s \"Much Ado About Nothing\"!\n\n📸: @ruminasean https://t.co/USW7NzUxLz TONIGHT: Not cool, lions. https://t.co/eVOKfeRNqF RIP to the Macron/Trump friendship tree https://t.co/daCHa5TxNq \"Do you, Reince Priebus, solemnly swear to keep all mentions of John McCain hidden from view of the president, whether on foreign waters or domestic?\" https://t.co/0EFqnw9l9L If your man won’t put a ring on it, take a page out of Elizabeth Warren’s book 😉 https://t.co/vqaIVXPkUk Finally! Someone stands up for the straight people of Boston.\n\nFull piece: https://t.co/ZF2q106lxE https://t.co/WcnBBo2y7p Did Trevor know what his life would be like today when he was a kid? No, but he knew he’d have enough money to buy dessert… #BetweenTheScenes https://t.co/rOnU4WdZYn “We just wanted to tell a real story that, ultimately, everyone can relate to, and who happen to be Asian American.” @parkrandall discusses the inspiration behind his new Netflix movie “Always Be My Maybe.” https://t.co/N34f7YFS5V “America needs a revolution, and if you need Pepto, it’s in aisle 12!”\n\nBernie Sanders joined a protest of Walmart over their starvation wages. Full piece: https://t.co/C8dz6QUJHO https://t.co/6EXCNRivNP THIS WEEK: @thedanieb, @ChefKwame, @TessaThompson_x and @TimRyan stop by! https://t.co/c9Rn8hSGAm This Friday, we're bringing the Donald J. Trump Presidential Twitter Library to Washington D.C. for one weekend only. Don't miss it!\n\n►Hours/location: https://t.co/tfaiYk7WLv https://t.co/KuJ0cFT5Kt The Trump Presidential Twitter Library opens in D.C. this Friday for one weekend only. Don’t miss it 👇 https://t.co/cArzs9zKoA Hours and location: https://t.co/tfaiYk7WLv RT @WhenTheySeeUs: What do you see when you see us? @Ava DuVernay talks the reasoning behind the title of our miniseries with @TheDailyShow… To help Trump get his Twitter groove back, The Daily Show is bringing the Donald J. Trump Presidential Twitter Library to D.C. Let’s make Trump’s Twitter great again. Full piece: https://t.co/eGGR4sBTcy https://t.co/g7VgoeUnqT Elizabeth Warren is running for POTUS and taking no prisoners. https://t.co/oUvwDSNSV8 RT @Newseum: Join us 6/15 as @jenflanz, executive producer for @TheDailyShow with @Trevornoah, supervising producer @raminhedayati &amp; produc… Socialism’s having a moment, and Ocasio-Cortez was unavailable, so @jaboukie sat down with a Vermont senator who mighttttt have some insight on this. https://t.co/m0xChTlK6m “I think ending gun violence has to be the number one issue for the next president because it’s the most important issue that doesn’t have a champion.”\n\nPresidential candidate @ericswalwell on his plans for tackling sensible gun reform. Full interview: https://t.co/GjhM4GSzVR https://t.co/IUgmrAcgvO South African 9-1-1 operators have a very different definition of “emergency.” #BetweenTheScenes https://t.co/9L7bQyljez Finding out it’s pronounced “Ree-anna” is like finding out Beyoncé is pronounced “Bay Once.” https://t.co/K0zkOowGSL A high school principal leaves his graduates with one final lesson: don’t plagiarize. https://t.co/CGjiKNheQs What is CBD and why is it everywhere? @TheLewisBlack breaks it down: https://t.co/RBtjZ36bZb It’s Pride Month! …And this is how Russia is celebrating: https://t.co/L6T205jlt1 Meet Boris Johnson: British politician and stunt double for Jeff Daniels in “Dumb And Dumber.” https://t.co/DWCsaVhRY2 Same. See you at the Trump Presidential Twitter Library next Friday? https://t.co/tfaiYk7WLv https://t.co/ctD2TdfUus To help Trump get his Twitter groove back, The Daily Show is bringing the Donald J. Trump Presidential Twitter Library to D.C. for one weekend only: June 14-16. Let’s make Trump’s Twitter great again. https://t.co/kC4Mdpa0ZT “Think of a recording artist, a living recording artist… they said no.”\n\nBefore Carpool Karaoke was a hit, @JKCorden couldn’t get anyone to buy in. Full interview: https://t.co/JW44U0WbIH https://t.co/T5gfswuM8m Uh... @BillNye you wanna take this one or should we? https://t.co/kAgBA94tLy “Elizabeth Warren has been fighting against the predatory practices of banks and credit card companies, long before it was cool.”\n\nMeet Elizabeth Warren: https://t.co/QAF4nNji5Y https://t.co/b3UBP6AsTK Happy Birthday Metronome Mike! https://t.co/MjlntFRudH .@Jaboukie gets a firsthand look at socialism's surge in popularity among young people and sits down with America's OG of socialism, @BernieSanders. https://t.co/GIC2JlHJnV Meet Elizabeth Warren: https://t.co/6JQhrSkHUV Trevor examines the career of Elizabeth Warren, President Trump loses his Twitter groove, and @JKCorden discusses \"The Late Late Show\" and hosting the 2019 Tony Awards.\n\nListen and subscribe: https://t.co/8A9VG0bSPs https://t.co/wJ189CgW6w Here’s the full interview with @JKCorden: https://t.co/JW44U0EAk7 Elizabeth Warren’s presidential campaign surges, partly due to her unique strategy of (checks notes) having a plan. https://t.co/foIZ62qYqd TONIGHT: Host of CBS' @latelateshow and the Tony Awards @JKCorden is here!\n\n📸: @ruminasean https://t.co/Mh07AgCsAv TONIGHT: Some veterans do D-Day a little differently… https://t.co/uZQZ7B05lm Trevor might not have known he wanted to host The Daily Show when he was little, but he did know he wanted enough money to buy dessert. #BetweenTheScenes https://t.co/d6jtWe8qOc “When I say, ‘Pass the mic,’ I mean, put together a diverse team who can speak to those issues when you may not necessarily be the right person to speak to those issues.”\n\n@EricSwalwell talks white privilege and his run for president: https://t.co/r2C1jjvP37 https://t.co/QLZQ3CKStT Sure, Trump's behavior at Normandy seems petty and disrespectful, but did he ever salute a Marine with a latte? https://t.co/6wCMYKhgcm Even Trump knows at this point that his endorsement is bad news. Full coverage: https://t.co/4hAyAqFISa https://t.co/V4KPQ4X7Ar The B in CBD might stand for bullshit. @TheLewisBlack reports: https://t.co/occZsH4r9d https://t.co/qVlp9duz4Y .@realDonaldTrump, we're bringing the Donald J. Trump Presidential Twitter Library to Washington D.C.... just blocks from the White House... ON YOUR BIRTHDAY. Stop by!\n\n►More info: https://t.co/HWOeAZiJ07 https://t.co/mKiF1mr9iL Trevor examines U.K. politician Boris Johnson, @TheLewisBlack rails against the wild popularity of CBD, and @parkrandall discusses his Netflix film \"Always Be My Maybe.\"\n\nListen and subscribe: https://t.co/wu7yPtwuDO https://t.co/CqAG4KQweV Here's the full piece with @TheLewisBlack: https://t.co/occZsH4r9d Here’s the full interview with @parkrandall: https://t.co/mPhSQq8fTk Britain, you’ve been royally Trumped. Full piece: https://t.co/4hAyAqo80C https://t.co/DqbwzNJI4E Meet Boris Johnson: British politician and stunt double for Jeff Daniels in “Dumb And Dumber.” https://t.co/jxID8CgQ1o Tonight at 11/10c: Guess who's back? @TheLewisBlack \n\n📸: @ruminasean https://t.co/2MPLWTXqlN TONIGHT: @parkrandall is here to talk about his new film #AlwaysBeMyMaybe on @netflix! https://t.co/yCmjibTSkt TONIGHT: Tfw you-- 🤮 https://t.co/VUKdyoFQyW Day 2 of Trump in the U.K. Full coverage: https://t.co/78wHOE6V5z https://t.co/QdZwxj4vIB RT @jaboukie: bernie was really cool. still waiting to hear back from @aoc. would love for the three of us to go axe throwing or something… Why are young Americans embracing socialism? @jaboukie asks the OG, @berniesanders.\n\nFull piece: https://t.co/UZVvknaAdb https://t.co/d0D6qj6uzd How many times have you watched the video of the helicopter spinning the woman https://t.co/GyVnb4MLbV At his U.K. presser, Trump had no idea what reporters were asking him, but he hid it pretty well. Full coverage: https://t.co/78wHOEovX7 https://t.co/yyP88zbVBC For Trump, protests are like Eric – he just pretends they don’t exist. Full coverage: https://t.co/78wHOE6V5z https://t.co/UmTgr5jMi9 RT @TheDailyShow: @IvankaTrump Cool. Maybe they can get to the bottom of this:\n\nhttps://t.co/sYClNvBOlF @IvankaTrump Cool. Maybe they can get to the bottom of this:\n\nhttps://t.co/sYClNvBOlF RT @TheDailyShow: Trump in the U.K., Day 2: 75,000 protesters and one weird tuxedo. https://t.co/CKR9G4wWSE President Trump downplays protests during his U.K. visit, @jaboukie chats about socialism with @BernieSanders, and @amberscorah discusses \"Leaving the Witness.”\n\nListen and subscribe: https://t.co/DgcOyWfQiU https://t.co/I52Bfsr9nY Here's the full piece with @jaboukie: https://t.co/UZVvknaAdb Here’s the full interview with @amberscorah: https://t.co/cI0iZaS7BD RT @jaboukie: @TheDailyShow @BernieSanders https://t.co/bcbi7b2oTZ Trump in the U.K., Day 2: 75,000 protesters and one weird tuxedo. https://t.co/CKR9G4wWSE TONIGHT: @jaboukie and @BernieSanders discuss socialism’s glow-up. https://t.co/s2h5myL11M TONIGHT: #exJW @amberscorah is here to talk about her memoir #LeavingTheWitness!\n\n📸: @ruminasean https://t.co/BM4KfKiLAe TONIGHT: Oh na na, what’s her name? https://t.co/Bw980PWMhe Jay-Z is a officially a billionaire, but is he *truly* happy? https://t.co/O0ubLJ1qQu President Trump's state visit to the U.K. is marred by a jab at London Mayor Sadiq Khan and his endorsement of controversial pro-Brexit politician Boris Johnson. https://t.co/7aSqCivxGj Jared Kushner was asked about Trump’s racism and things got awkward real fast. Full coverage: https://t.co/JmopuWIRuR https://t.co/raEq1mZswp What do you get the man who has tweeted about everything?\n\nThe Donald J. Trump Presidential Twitter Library opens in Washington, D.C. on June 14th, Trump's birthday... surprise! 🎂🎉🍾\n\nJune 14 - 16 | 12PM - 8PM | FREE\nThe Showroom at 1099 14th St. NW https://t.co/BsVlK3VB8m RT @DEADLINE: ‘The Daily Show’ Trump Presidential Twitter Library To Open New Chapter In Nation’s Capital https://t.co/FiO3ByCCOs https://t… Truth hurts. https://t.co/opddXc5zHX How is Jared Kushner this bad at lying? https://t.co/dumwRc3wWt Trump in the U.K. Day 1: https://t.co/fIMzrujOMf President Trump descends on the U.K., @roywoodjr and @michaelkosta weigh in on sports news, and Democratic Rep. @ericswalwell talks about his 2020 presidential campaign.\n\nListen and subscribe: https://t.co/zcg3SsDgFA https://t.co/aGEzVvjpKY Here's the full piece with @roywoodjr and @michaelkosta: https://t.co/t3p6GCAiCR Here’s the full interview with @ericswalwell: https://t.co/r2C1jjvP37 RT @ericswalwell: Excited to join @Trevornoah TONIGHT on @TheDailyShow! Tune in!! https://t.co/vsuuaSZsme Trump takes shots at London mayor Sadiq Khan, dotes on his doppelgänger Boris Johnson, and finds no vacancies at Buckingham Palace on his trip to the U.K. https://t.co/lRwwR6Glge TONIGHT: It’s June, aka sports championship season. @roywoodjr and @michaelkosta report:\n\n📸: @ruminasean https://t.co/Y2db4CAJlY TONIGHT: 2020 presidential candidate @ericswalwell is here!\n\n📸: @ruminasean https://t.co/DcxJCUEkIQ TONIGHT: Were people booing speakers at the California Democratic convention, or just asking “Who?” was at the podium? https://t.co/uYMCgVybF4 Oh no https://t.co/xxQFySj5dt House pets: They’re furry, they’re friendly, and they lead simple, quiet lives…\n\nOr do they? @RoyWoodJr investigates the secret life of pets. @PetsMovie https://t.co/AlStqUu1o1 THIS WEEK: @ericswalwell, @amberscorah, @parkrandall, and @JKCorden stop by! https://t.co/cXIeGkbNzU BREAKING: There's a new Democratic candidate for president and his name is \"John Hickenlooper\" https://t.co/O9WWPvsir0 RT @roywoodjr: Dude built like a boss on Grand Theft Auto you gotta do jobs for. https://t.co/ezUreQFHBb This is what happens when the fashion police can’t legally indict a sitting president https://t.co/1U1nuhBLOx Mitch McConnell: ruthless politician &amp; perfect movie villain. https://t.co/InHXp3qGE3 “Instead of a whip, give Jesus a gun, a slick suit, and let him shoot the bad guys. Also, we need more dogs. Everybody likes dogs.”\n\n.@ronnychieng is here to fix the Church’s outreach problem: Don’t update the tech, update the Bible. https://t.co/QSM7I9170w “What can we do for our sisters who don’t have any legal recourse, and how can we use our collective influence to help them?”\n\n@ReeseW discusses Time’s Up, Big Little Lies and working with Meryl Streep. https://t.co/vQcw4qa6Kc The measles are going viral again and @TheLewisBlack isn’t happy about it. Full piece: https://t.co/9jJW9VL1IC https://t.co/ZVLCe7cFQk As Trump faces a possible impeachment inquiry, let’s take a moment to remember the worst scandal in presidential history: Obama’s tan suit. https://t.co/jCuvzO0EVd .@CSiriano talks designing for Billy Porter, Janelle Monae, and Michelle Obama, and using fashion to celebrate a variety of body types and gender identities. https://t.co/eqhW2DwJ3x .@nealbrennan wishes Democrats would be a little more Republican. https://t.co/Pd7AYbn3b9 .@ava discusses “When They See Us” and the importance of retelling the story of the Central Park Five. Full interview: https://t.co/iONwpOO9fd https://t.co/eKr5NpBlDP Tired: Natural gas. \nWired: FREEDOM GAS. https://t.co/gCzaZ1YoJ4 Robert Mueller speaks! Did Trump obstruct justice? His answer is a resounding… maybe. https://t.co/8jIu95hdOy Netflix may be pulling out of Georgia. https://t.co/TaiT82AyCk Trump: “I don’t do coverups”\n\nAlso Trump: https://t.co/vMGeHK3GMl Yes, @JoshJohnson knows his voice sounds white.\n\nDon’t miss the one-hour finale of The New Negroes tonight at 11/10c on @comedycentral. https://t.co/pQco1Sdz3j Republicans are relentless. @nealbrennan thinks Democrats should take a page from their playbook. Full piece: https://t.co/JgMmM7JOOl https://t.co/bWoHGkqkUi Roy Wood Jr. and Ronny Chieng want ANSWERS https://t.co/7SMyUrSrRe The NBA needs Drake less in rapper mode and more in R&amp;B mode. https://t.co/bX861whD7w Trump sounds like a drunk person in a pizza shop at 4am. Full coverage: https://t.co/NvuJXAriBH https://t.co/dAOKCkoA4t RT @TheDailyShow: Impeachment: so dirty, so filthy, so…happening? https://t.co/QB7zkNgwv2 Top Democrats support impeachment for President Trump, @nealbrennan makes the case for a more relentless Democratic Party, and @CSiriano chats about \"Project Runway.”\n\nListen and subscribe: https://t.co/Ci3cqkTDr5 https://t.co/QeqAB9wBNi Here's the full piece with @nealbrennan: https://t.co/JgMmM7JOOl Here’s the full interview with @CSiriano: https://t.co/JnBjy1AtiX RT @PadmaLakshmi: @TheDailyShow https://t.co/PDPGTnza28 Impeachment: so dirty, so filthy, so…happening? https://t.co/QB7zkNgwv2 TONIGHT: @nealbrennan has a strategy for Democrats to get more laws passed: be more annoying.\n\n📸: @ruminasean https://t.co/TuPhtk5E9I TONIGHT: Fashion designer @CSiriano is here!\n\n📸: @ruminasean https://t.co/EnIz8rZAKz TONIGHT: The White House’s bold move to hide the USS John McCain from President Baby. https://t.co/TMrvymNafQ Another day, another new Democratic candidate for president! Is America ready for Frank Beltloop? https://t.co/y9op5ILnEB #tbt to the single worst scandal in presidential history: Obama's bike helmet. https://t.co/aUcmvtzto5 .@DrBiden wants teacher-centric education policy and a Secretary of Education who is actually a teacher. Full interview: https://t.co/jzQmqKeBaF https://t.co/5FJzPJIHk2 RT @PoliticsCow: @TheDailyShow Conspiracy in the front, obstruction in the back. RT @OllieGlanvill: @TheDailyShow PRESIDENTIAL HAIRASSMENT BEGIN THE MULLET INVESTIGATION https://t.co/HbzTKlRtXQ https://t.co/Z9V43Cvcfy https://t.co/Eq37EC6hQ6 https://t.co/fzgcJhLDy7 Mueller out ✌🏽 https://t.co/keFTlN2KAM #FeelTheMoulmentum https://t.co/tWLr7hJ9RA Even Yoda would’ve heard Mueller and been like, “Mmm, report confusing you make.” Full coverage: https://t.co/F45TxzLoa1 https://t.co/TKNTIOBrwQ Robert Mueller breaks down the Mueller report, @ronnychieng gives his take on high-tech Christian campaigns, and @DrBiden discusses her memoir \"Where the Light Enters.”\n\nListen and subscribe: https://t.co/drngcqzQ4c https://t.co/fRP0bDb7JW Here’s the full interview with @DrBiden: https://t.co/jzQmqKeBaF Robert Mueller speaks! Did Trump obstruct justice? His answer is a resounding… maybe. https://t.co/ggGf8FoXwq TONIGHT: @DrBiden is here to talk about her new memoir “Where The Light Enters”!\n\n📸: @ruminasean https://t.co/vwzP6rQJ4m TONIGHT: Mitch McConnell: ruthless politician &amp; perfect movie villain. https://t.co/o5NTIgY2Dq #Grizzleman2020 https://t.co/zKCjiTfR9h Another Democrat has entered the race for president! Get to know Pat Grizzleman! https://t.co/6yGBAvP7N8 Trump had to be seated far enough back at a sumo match so he didn’t get smushed 😂 Full piece: https://t.co/4GLpHlbmFl https://t.co/xFSHSA7DmK Why Twitter needs an edit button https://t.co/Ch4mNpXNYp https://t.co/UmMhz8pzIO Is Trevor Noah a spy? @RoyWoodJr drops some bombshell evidence: https://t.co/gs08Rxf3y8 https://t.co/rIgbzLci5C \"I don’t like to do the whole 'can you imagine if Obama did this' thing, but can you imagine if Obama did this?!\"\n\nTrump sides with Kim Jong-un after he calls Joe Biden a low-IQ individual. Full piece: https://t.co/4GLpHlbmFl https://t.co/L2UVobXXNI The prison demands of convicted drug lord El Chapo draw suspicion, President Trump gets coddled in Japan, and @ReeseW talks about her HBO series \"Big Little Lies.”\n\nListen and subscribe: https://t.co/r6p7flI2mC https://t.co/fZvQV0URF0 Here’s the full interview with @ReeseW: https://t.co/2CLgnHBwUG While Trump watches sumo in Japan, the world wrestles with what to do about his continued support for Kim Jong-un. https://t.co/HpkcRnP336 #Pudgehammer2020 https://t.co/lY6UXPevQo TONIGHT: Star and producer of @HBO’s “Big Little Lies” @ReeseW is here!\n\n📸: @ruminasean https://t.co/8evcSLYzDa RT @ReeseW: Talking all things @Big_Little_Lies with @Trevornoah on @TheDailyShow... tune in TONIGHT y’all! 11PM on @ComedyCentral 🙌🏼 TONIGHT: Theresa May has resigned, but still hasn’t Brexited 10 Downing Street. https://t.co/wUar0BfXYI Get to know Jim Pudgehammer, the latest Democrat to announce his candidacy for president! https://t.co/cySakxHpqI THIS WEEK: @ReeseW, @DrBiden, and @CSiriano stop by! https://t.co/6yGxbZLSuJ Even though they were fully exonerated in 2002 with DNA evidence, Donald Trump insisted as recently as 2016 that the Central Park Five were still guilty.\n\nTake the interactive tour of Donald Trump's New York! https://t.co/Rppz41Uxhr https://t.co/bo2piUAYuN .@RLSWrites dispels the “why don’t they leave?” myth about victims of domestic abuse. Full interview: https://t.co/hjw3K2WPrS https://t.co/OtuxQKDyLe .@ava discusses “When They See Us” and the importance of retelling the story of the Central Park Five. Full interview: https://t.co/IYtnSB0vPZ https://t.co/3mHZ1xjJOi .@SenGillibrand weighs in on the abortion debate and outlines her plan to get money out of politics. https://t.co/bg3VldMoR0 If you’re taking your friend to meet the president, give them a heads-up first. #BetweenTheScenes https://t.co/aR1a8TUXae Are the 130 Midwest tornadoes in the last five days climate change’s latest flex? https://t.co/mVaUhDrwGj Take it from @DesiLydic and @dulcesloan and incorporate 👏🏽 that 👏🏽 pussy 👏🏽 https://t.co/zS67MzSwWE RT @latimesent: \"Only an idiot would take over from Jon Stewart as host of @TheDailyShow, and luckily I was that idiot.\n\nWill Smith turned… To Fox News or not to Fox News? For 2020 Dems, that is the question: https://t.co/jHsSwqNulF We know what you're thinking: \"What if America loses the race for 5G!?\"\n\nAnd also: \"What is 5G?\" https://t.co/RMso531wfC The Dems want to talk infrastructure in the bedroom, but Trump isn’t over the fight they just had in the living room. #BetweenTheScenes https://t.co/SeVIc8g2ic Where did Donald Trump grow up? Take the Donald J. Trump Tour of New York to find out: https://t.co/gg4hBmyjs2 https://t.co/9PtZ4LtwfH Men passing laws on abortion makes as much sense as the Amish passing laws on cybersecurity. https://t.co/uJSUN9sVB4 Think you’re bad at your job? Meet Ben Carson… https://t.co/S5kFZJbKBw China’s biggest loss in the trade war: no “Game of Thrones” finale. https://t.co/29xZkKKclS Good luck to next year’s Morehouse commencement speaker… https://t.co/l0GL7pOTP6 Sausage fests across the country are passing some of the most extreme abortion laws America has ever seen. https://t.co/F5F6lhxOjP “It doesn’t matter if you can do your job, it matters if you look like you can do your job.” \n\n@DulceSloan breaks down why Ben Carson is going to get fired. https://t.co/1Z0YubFj3z Trump's latest African dictator move: asking his advisers to publicly confirm how super chill he is. \n\nFull piece: https://t.co/bLGMxB0pOf https://t.co/qWoLmTUqcc “Listen. Show up, and find where you are most powerful.”\n\n@jordanklepper takes advice on allyship before protesting on behalf of undocumented students barred from attending state universities in Georgia.\n\nFull episode of @Klepper: https://t.co/mMQa1PoOjV\n\nhttps://t.co/6hGnsIuptg It’s now legal to carry nunchucks in New York. @MichaelKosta meets the man responsible. https://t.co/nsFOg4ou8i The Dems want to talk infrastructure in the bedroom, but Trump isn’t over the fight they just had in the living room. #BetweenTheScenes https://t.co/37BqvE9IlP Every time Nancy Pelosi patronizes Trump, she seems more and more like a black auntie: https://t.co/bLGMxB0pOf https://t.co/iVsnsqGTaL President Trump spars with Rep. Nancy Pelosi, @dulcesloan gives her take on whether Ben Carson will be fired from HUD, and @wyattcenac discusses \"Wyatt Cenac's Problem Areas.”\n\nListen and subscribe: https://t.co/zdVcxWGVF6 https://t.co/H3Ec9iqNFx Here's the full piece with @dulcesloan. Catch her on @thenewnegroes tomorrow night at 11/10c: https://t.co/bujTfMuNig Here’s the full interview with @WyattCenac: https://t.co/YxlwcJIMB2 Trump's latest African dictator move: asking his advisers to publicly confirm how super chill he is. https://t.co/Pu7un9GyzK RT @TheDailyShow: @realDonaldTrump YOU SEEN THIS ONE?\n\nhttps://t.co/i6hlP5Is1Z @realDonaldTrump YOU SEEN THIS ONE?\n\nhttps://t.co/i6hlP5Is1Z TONIGHT: Ben Carson doesn’t know what he’s doing, but @dulcesloan is here to help him fake it til he makes it: https://t.co/gr3OJ6nd97 TONIGHT: @wyattcenac returns to The Daily Show to talk about his show @ProblemAreasHBO!\n\n📸: @ruminasean https://t.co/aNNwn0SL0Z TONIGHT: Did you like Ben Carson's Oreo gaffe? Then you'll LOVE his damage control. https://t.co/jxcIahj8oF New York might make it illegal to cross the street while texting. @RonnyChieng hits the streets to make sure New Yorkers are only walking and texting during emergencies. https://t.co/nXdzMcPDdo What an achomlishment! https://t.co/GaNuloBCYe RT @standup: Don't come to @dulcesloan with your feminism. \n\nCatch The New Negroes with @barvonblaq and @Mike_Eagle this Friday at 11/10c o… If you have no idea what 5G is, don’t worry, the president doesn’t know either. Full piece: https://t.co/oaUo1pGbh6 https://t.co/4aKCzsfMez #tbt to the most inspiring commencement speech ever https://t.co/2IG8N3Mksp Get ready for a real life “Grand Theft Auto” mission. https://t.co/amQnytlfKR The U.S., China and the race for 5G: https://t.co/1rjI7qIY0e Over 130 tornadoes wreak havoc in the Midwest, the U.S. and China fight over 5G, and journalist @RLSWrites discusses her book \"No Visible Bruises.\"\n\nListen and subscribe: https://t.co/hVgHQk1CGQ https://t.co/gNZjwNVwvJ Here’s the full piece with @ronnychieng: https://t.co/qwA3BsMbXx Here’s the full interview with @RLSWrites: https://t.co/hjw3K2WPrS We know what you're thinking: \"What if America loses the race for 5G!?\"\n\nAnd also: \"What is 5G?\" https://t.co/2ZdQ5bPy1Z TONIGHT: @ronnychieng hits the streets of New York to talk about a new potential texting-while-walking ban. https://t.co/7P56Oe4wdz TONIGHT: Journalist and author @RLSWrites is here to talk about domestic violence and her new book “No Visible Bruises.”\n\n📸: @ruminasean https://t.co/uXXt0swduB TONIGHT: The Midwest has seen 130 tornadoes in the last five days. Climate change’s latest flex? https://t.co/tsKBimoc4A Ever worry you're bad at your job? Meet Ben Carson. https://t.co/myn5RzXBE5 Donald Trump’s favorite news network is flirting with a younger, hotter candidate: Pete Buttigieg. https://t.co/QehXYZ4p5O .@Ava on her new series @WhenTheySeeUs and why she avoided naming it “The Central Park Five.” Full interview: https://t.co/IYtnSB0vPZ https://t.co/7CV5D7FFZM “Every computer should have an angry goat in front of it to scare away the demons!”\n\nFull piece: https://t.co/RgjYahUUiD https://t.co/plvR5nQG21 Me logging onto twitter this morning https://t.co/iZgtkKNioy RT @ronnychieng: I’m Kung Fu fighting in @michaelkosta ‘s @thedailyshow field piece on the legalization of nunchucks in New York. Full piec… China can’t watch the ‘Game of Thrones’ finale, and they are pissed. And once they get to watch the finale, they’ll be double-pissed. https://t.co/65ZPJQDNaW U.S.-China trade tensions cause a \"Game of Thrones\" blackout, 2020 Democratic candidates take different approaches to Fox News, and @ava discusses @WhenTheySeeUs. \n\nListen and subscribe: https://t.co/nNn3qEigGa https://t.co/mE9R69VpzX Here’s the full piece with @michaelkosta and @ronnychieng: https://t.co/cTyqO6VGyE Here’s the full interview with @ava: https://t.co/IYtnSB0vPZ RT @WSJLife: Trevor Noah on taking the reins from Jon Stewart as \"The Daily Show\" host https://t.co/ccvriJNEuU RT @WSJLife: \"How do you create a space where you're not trying to implement tokenism but rather true representation?\" Trevor Noah discusse… Fox News is flirting with younger, hotter candidates and Trump is not having it. https://t.co/mOeMqn4PpZ TONIGHT: @michaelkosta charts one man’s fight to legalize nunchucks. https://t.co/hG05qAGf17 RT @WSJ: “The Daily Show” host @Trevornoah chats with his writers and producers about how they’re gearing up for the 2020 election at The #… TONIGHT: @ava is here to talk about her new Netflix limited series @WhenTheySeeUs!\n\n📸: @ruminasean https://t.co/RGlAsgGdDf Good day for Nabisco, bad day for Ben Carson. https://t.co/lJmsl7QyAb .@SenGillibrand stayed after her interview to discuss why we need to reprise JFK’s space race as a green energy race and how she’ll win in red, purple and blue districts. #BetweenTheScenes https://t.co/QE13LRyCKy “Three weeks ago, Trump and Romney’s positions on abortion were the extreme positions. But now, thanks to Alabama and Missouri, these guys get to act like feminists.”\n\nFull piece: https://t.co/RgjYahDiU3 https://t.co/73hp1KTvgn Robert Smith: I’m going to pay off all of your student debt!\n\nAll future commencement speakers: F**k. https://t.co/Cx8L6HQtF5 RT @latimesent: \"Only an idiot would take over from Jon Stewart as host of @TheDailyShow, and luckily I was that idiot.\" - @TrevorNoah http… Some people are taking the #GoT finale a little too hard… https://t.co/35MmPCwDA3 .@DesiLydic and @DulceSloan have a solution to stop the regulation of women’s reproductive rights:\n\nIncorporate that pussy. https://t.co/VnG9WSE3Un RT @BrickyTheWall: We’re not just building a wall, we’re building a movement! #WeAreAllBricky https://t.co/CcjHBCcN3d Trevor reacts to the extreme anti-abortion laws passed in Alabama, Missouri and Georgia: https://t.co/chfSGerv3z State Republicans pass extreme anti-abortion laws, Bill de Blasio joins the Democratic presidential field, and @SenGillibrand discusses her 2020 White House bid.  \n\nListen and subscribe: https://t.co/PWbrVKGnfZ https://t.co/06pDUWaEtA Here’s the full interview with @SenGillibrand: https://t.co/UofdJvPbW6 Men passing laws on abortion makes as much sense as the Amish passing laws on cybersecurity. https://t.co/kCGIJhWeWj TONIGHT: 2020 presidential candidate @SenGillibrand is here!\n\n📸: @ruminasean https://t.co/ROIIentwax TONIGHT: A billionaire vows to pay off the student loans of 400 Morehouse graduates…and ruins all future commencement speeches indefinitely. https://t.co/qVPuawCxwY TONIGHT: We're back, baby! https://t.co/6FjYLSDNW2 THIS WEEK: We’re back with @SenGillibrand, @ava, @RLSWrites, and @wyattcenac! https://t.co/KaKuLQ2M1M Let's all take a moment to remember the worst scandal in presidential history: Obama's Saudi Bow. https://t.co/pADp6UGkky Compromising on complimentary water bottles? Sure. Compromising on breakfast? Never. Wake up breakfast with @McDonalds #ad https://t.co/YHzuQLEgKo RT @roywoodjr: They got the Iron Throne sittin out in the open like patio furniture. #DemThrones .@roywoodjr gives a season-by-season recap of #GameofThrones in 5 minutes: https://t.co/XVs8iliGfI https://t.co/s90relS4Ku “Season 6: Jon Snow is running around the North trying to unite the Snow Bloods and the Snow Crips.”\n\nPregame for the #GameofThrones finale with @roywoodjr's recap of all 8 seasons: https://t.co/66HFtSWtiS Comedian @chelseahandler gets serious about confronting her white privilege. Full interview: https://t.co/VIgEp4bAtk https://t.co/nA2xnUteot “You can’t look at the foster care system in isolation, it’s a symptom of larger unaddressed social issues.”  \n\nIn their @HBO doc “Foster,” Mark Jonathan Harris &amp; Deborah Oppenheimer tackle the U.S. foster care system's shortcomings &amp; the complex needs of the families involved. https://t.co/9PP5VA1iSs .@roywoodjr recaps all of #GameOfThrones in five minutes. https://t.co/GzGdlHq81p RT @NewsHour: .@DesiLydic @TheDailyShow traveled to Iceland, Namibia &amp; Spain to learn why these countries are ranked ahead of the U.S. on g… .@dulcesloan can’t blame America for falling back on familiarity. https://t.co/q0Y8oMMFsz “These kids were in a food coma. It was time to wake them up.”\n\n@roywoodjr is here to save kids from bad school lunches: https://t.co/cPtVlVWuGG https://t.co/cVt12pfYRc “The Night’s Watch is basically the TSA of Westeros.”\n\n@roywoodjr recaps every season of #GameOfThrones before the series finale. https://t.co/zMWFdOXid3 PSA: The cast of #GreysAnatomy are not real doctors.\n\nFull @iJesseWilliams interview: https://t.co/TVGeVnL72v https://t.co/fP5aD6x0rN New election, same s**t. Full @DesiLydic piece on sexist election coverage: https://t.co/D0XGnWtylO https://t.co/o9lNchtWRq Trevor’s favorite toy growing up? A brick. #BetweenTheScenes https://t.co/mGQ7YK7oB6 Space Pirates? What about Space ISIS? @michaelkosta investigates: https://t.co/56tEhhL0Ct .@angelicaross is on “Pose,” and @desilydic taught posing at a charm school in Kentucky, so they’re basically the same. https://t.co/oXlnQctCHV Daily Affirmations with Fox News’s Jeanine Pirro https://t.co/ELbz4002Yu Lindy West takes on anti-choice rhetoric. #tbt to the full interview: https://t.co/2N0rLK5EwD https://t.co/tOAPp19LVr .@tyrabanks talks coming out of modeling retirement and re-branding herself for a new era of fashion. https://t.co/lUYk0lhzuC RT @Trevornoah: The only possible way to feel after @thedailyshow wins 5 Webbys! Thank you to everyone who voted 🙏🏾 Now... can someone plea… .@tyrabanks shouts out @larettahouston, the photographer for her Sports Illustrated cover that she found on Instagram. https://t.co/83ko3KkYxM Mayor @PeteButtigieg takes audience questions on the Iran Deal and defining America’s economic success in the latest #BetweenTheScenes: Guest Edition. https://t.co/coTc6MeoiG Before we get on the “America first” bandwagon, let’s aim for better than 49th in the world in gender equality. A look at Desi Lydic Abroad: https://t.co/GathaVRMIf https://t.co/l9lIgiDyWx In making @Klepper, @jordanklepper got a close look at real American stories, and an even closer look at real American jails. 😳 https://t.co/9Dnv7rzV1P RT @MTVAwards: @TrevorNoah HI! You’re nominated for Best Host for @TheDailyShow at the 2019 #MTVAwards! Vote now at https://t.co/srdtfvPGrL… Come take our tour of Donald Trump's New York! There's a mobile version so you can do it on the toilet just like he would.\n\nFull tour: https://t.co/Rppz41Uxhr https://t.co/rbCt3nXWHm “We will not go quietly into that tub of butter!”\n\n@roywoodjr visits America’s school cafeterias to fix the school lunch system. https://t.co/VMUOYONU16 Today, we remember the time Barack Obama bowed to the Saudi king, the worst scandal in presidential history. https://t.co/vFraTp8Kwh A #BetweenTheScenes primer on how to avoid changing diapers. https://t.co/6XVMv4C5KF It’s not easy to make it as an all-female rap group, but @RVKDTR is dominating the scene in Iceland, and @DesiLydic wanted to find out how. https://t.co/jqv4RC7dH0 RT @ComedyCentral: Statue of Liberty? More like Statue of Irony. Watch The Daily Show Presents: @DesiLydic: Abroad, tonight at 11/10c. #You… Footage surfaces of Bernie’s old public access TV show and DAMN is this dude consistent. https://t.co/jgvzKtAboN https://t.co/FFyP8FKOOR Some people care about Trump’s tax returns, others just want to eat a carton of eggs for breakfast. https://t.co/y0g3L6cZ1V After 7 billion seasons, Earth is about to be cancelled. https://t.co/tO7uCb9tCW RT @CecileRichards: It’s probably not news to anyone that it can be, shall we say, a little challenging for issues that affect women’s live… RT @StrahanAndSara: .@thedailyshow’s @DesiLydic reveals her hidden talent: packing a suitcase! #StrahanAndSara https://t.co/dVbVafFIdl RT @UPROXX: #DailyShow correspondent @DesiLydic on her new gender equality special, 'Abroad' https://t.co/uNfMXo1FnN https://t.co/Ae4VVbWg53 The United States ranks 49th in gender equality worldwide, and tonight at 11/10c, @DesiLydic tries to copy other countries' homework. https://t.co/yDuM3FP3fO Cab drivers are losing business to ride sharing apps and seeking divine intervention. Full piece with @DesiLydic: https://t.co/TZrwXnHJeF https://t.co/tQqedLX8A6 RT @CecileRichards: It's insane that people who have never experienced ovulation, menstruation or pregnancy are often the main gatekeepers… Women make up 51% of the population, but what percentage of Congress is female?\n\nWatch Desi Lydic: Abroad tonight at 11/10c on @ComedyCentral https://t.co/vYIrMAiubq RT @NewsHour: @TheDailyShow's @DesiLydic traveled to Iceland, Namibia &amp; Spain to learn why these countries are ranked ahead of the U.S. on… Never forget that John Hickenlooper accidentally took his mom to see “Deep Throat.” https://t.co/jYPuEdhen6 Do women really make 80.7 cents for every dollar a man earns? Does having kids mean less money? It’s a little more complicated than you think. @DesiLydic womansplains the gender wage gap and the motherhood penalty: https://t.co/t36Q7BWFPK Thoughts and prayers for Tucker’s balls in 2020 🙏🏽\n\nFull piece with @DesiLydic: https://t.co/yWoFvyDl0l https://t.co/aQovG4JoBm Happy Mother’s Day to Trevor’s mom and Lionel Richie. #BetweenTheScenes https://t.co/1RuXPLzNF1 America doesn’t want Iran’s weapons moving towards their bases, but aren’t America’s bases in every direction? https://t.co/07LoZOb77q Iceland, Namibia and Spain all do better than the U.S. when it comes to gender equality. @DesiLydic wants to know why: https://t.co/9pVlmH90vU This kid found $40,000 worth of meth in a box of Legos. https://t.co/hXbymRj3m6 Still the best thing to happen this week. Full coverage: https://t.co/jgvzKtiA0d https://t.co/dULCbnIGXq You may have visited Central Park, but have you experienced Trump’s Central Park? Welcome to The Donald J. Trump Tour of New York City.\n\nVisit all 12 stops at https://t.co/Rppz42c88Z https://t.co/zOEZqAKDbI Women are running for president, which means sexism is ready for its closeup! Full piece with @DesiLydic: https://t.co/yWoFvylJBL https://t.co/QgMp0Pt7v8 Introducing Trump’s new head of ICE: Lady Gugu. https://t.co/O8XWbbtqxX There’s just something about a woman running for president that brings all the sexism to the surface. Full piece with @DesiLydic: https://t.co/yWoFvyDl0l https://t.co/BQUzs5k3Da .@DesiLydic on sexist 2020 media coverage: https://t.co/82o1WLe8vD Trevor covers South Africa's high-stakes election, @DesiLydic reacts to sexist 2020 U.S. election coverage, and Mark Jonathan Harris and Deborah Oppenheimer discuss \"Foster.”\n\nListen and subscribe: https://t.co/xhjj6jP06X https://t.co/Qh3TVReFR0 Watch @DesiLydic: Abroad on Monday, May 13 on @ComedyCentral. Here’s the full interview with Mark Jonathan Harris and Deborah Oppenheimer about their @hbodocs film “Foster”: https://t.co/7Q3s95bXIr Female presidential candidates aren’t getting equal air time, and @desilydic is pissed — both as a woman and as someone who loves being on camera. https://t.co/yPWEUYViof TONIGHT: Academy Award-winning filmmakers Mark Jonathan Harris and Deborah Oppenheimer are here to talk about their new @HBO documentary “Foster”! https://t.co/7yXlxeyCyt TONIGHT: If Facebook breaks up, which part of the company will sell our data to Russia? https://t.co/E4Zb6v5gMj Take a mental health break with Jeanine Pirro https://t.co/M2d2vHyNdo Bernie Sanders is GREAT with kids.\n\nCheck out this unearthed footage from Bernie’s 80s public access show: https://t.co/jgvzKtiA0d https://t.co/zubuX2U45S We won 5 #Webbys and we need a five-word acceptance speech. Share your ideas using #5WordSpeech. This is your big chance to work for us, not get paid, and not have us give you any credit for it. Thank you. Five. https://t.co/sAsCqxmq1U You need to see this old Bernie footage for yourself. Full piece: https://t.co/jgvzKtAboN https://t.co/FRfEnLvVCR Say what you will about “Fox &amp; Friends,” but they stand by their man. Full piece: https://t.co/SvO5x3gJyA https://t.co/LFAbfT3TfP Bernieeeee! https://t.co/ylLnOEeLuV RT @Klepper: .@jordanklepper spends time with members of the Valhalla Club, a group of veterans in Texas who put on pro wrestling shows to… Footage of Bernie Sanders reveals his ideological consistency, Donald Trump lost over a billion dollars in a decade, and @tyrabanks discusses her return to Sports Illustrated.\n\nListen and subscribe: https://t.co/ZvXbMJf02k https://t.co/wju7qkWIJV Here’s the full interview with @tyrabanks: https://t.co/pDGGLeaedQ h/t to @hollyotterbein and @politico for unearthing this 👌 Bernie footage Bernie Sanders had a public access TV show in the ‘80s. We sifted through the unearthed footage and hoooboy… https://t.co/trO27E9pZR TONIGHT: Entrepreneur, media mogul, and cover star of the 2019 Sports Illustrated Swimsuit Issue @tyrabanks is here! https://t.co/VLrnGRIuv8 TONIGHT: Prince Harry and Meghan Markle pick a name for their… passion project. https://t.co/lWxsWC8eg6 “If you protest during your spare time, it’s not a strike, it’s just a hobby.”\n\nBetsy DeVos wants teachers to protest during their “adult time” instead of during school hours. Full piece: https://t.co/jSNHg2EnMK https://t.co/NwjJCT7C8c RT @HuffPost: \"The Daily Show with Trevor Noah\" takes a whistle-stop tour of New York that Donald Trump is not going to like. https://t.co/… “Imagine if everyone got invited to an event and got a different dress code.”\n\nTrevor unmasks the Met Gala experience.\n#BetweenTheScenes https://t.co/AvBicYYGMl The United States ranks 49th in gender equality worldwide, and @DesiLydic heads overseas to copy other countries' homework.\n\nWatch Desi Lydic: Abroad Monday, May 13 at 11/10c on @ComedyCentral https://t.co/OaUUuJXXmc The IAAF wants to alter runner Caster Semenya’s hormones for… being too good at running? https://t.co/lhABEyyzCa RT @Variety: TV reviews: \"Klepper\" and \"Desi Lydic: Abroad\" on Comedy Central https://t.co/2Pr6QxTV9N “It doesn’t matter if you think the reason is bullshit, it’s just how America’s laws work.”\n\nSteve Mnuchin is refusing to give up Trump’s tax returns because he thinks the Democrats invented a fake reason. Full piece: https://t.co/jSNHg2EnMK https://t.co/Jx4VAh0MYx How did Trump lose $1 billion while pretending he was rich? Find out in our very legal and very cool Donald Trump Tour of New York! \n\nhttps://t.co/Rppz41Uxhr Scientists warn that over one million species face extinction, Trump officials brazenly defy House Democrats, and @ValerieJarrett discusses her memoir \"Finding My Voice.\"\n\nListen and subscribe: https://t.co/QJPl3ZmEJm https://t.co/iBQmr4FLS5 Here’s the full piece with @desilydic: https://t.co/gqiqoItjEk Here’s the full interview with @ValerieJarrett: https://t.co/L4pqOokUUg There's much more of The Daily Show's Donald J. Trump Tour of New York City at https://t.co/Rppz41Uxhr! For Trump, buying New York's most famous hotel, The Plaza, was literally a no-brainer, especially when you see what he paid for it: https://t.co/YlIfDajpKQ Next, we take you to Central Park, where Trump proves that you don't have to be the type of person who would ever go to a park to have opinions on who committed what crimes there: https://t.co/OXH72MVHaU Presenting The Daily Show's Donald J. Trump Tour of NYC! Join @MichaelKosta at https://t.co/Rppz41Uxhr and explore Trump's childhood home, his opulent 5th Avenue fortress &amp; other places that brought him many years of litigation and bankruptcy. https://t.co/MUUirwZpUs Someone tell Trump “just say no” is for drugs, not democracy. https://t.co/KZUrQj0yeM TONIGHT: @DesiLydic breaks down the rising competition between cabs and ride-share apps. https://t.co/QqRgQBQ5uN “I thought, ‘Did I do this wrong?’ Then I turned around and Katy Perry was a hamburger.”\n\nTrevor sums up his #MetGala experience #BetweenTheScenes https://t.co/spezCtoUPh TONIGHT: @ValerieJarrett is here to talk about her new memoir “Finding My Voice”! https://t.co/fwlXGlLPKl While Harry and Meghan celebrate a royal milestone, America is celebrating one of its own: https://t.co/lQ6yExlHnI .@roywoodjr goes to America’s school cafeterias to fix school lunches. Full piece: https://t.co/yBt192cviy https://t.co/s1YMbymAUD Trump takes a swing at China but hits America instead. #SorryGregory https://t.co/nBtizlbBPn Congrats to the Royal Family! https://t.co/5lIKnHc33j Not only did Prince Harry watch his wife give birth, it’s probably the first time he’s seen a royal family member perform labor of any kind. https://t.co/dwzpan493P A Starbucks cup makes an accidental appearance on \"Game of Thrones,\" Trevor muses about America's next war and comedian @eddieizzard chats about his global \"Wunderbar\" tour.\n\nListen and subscribe: https://t.co/V3gidXgjmd https://t.co/eh6ZdoWnLO Here’s the full piece with @roywoodjr: https://t.co/yBt192cviy Here’s the full interview with @eddieizzard: https://t.co/sgaxWTOVfw Which country will be America’s Next Top Battle?\n\nFirst up, this year’s 195th most popular spring break destination: https://t.co/1dcVnQ2JWX TONIGHT: Trump makes school lunches unhealthy again. @roywoodjr reports: https://t.co/Y0KO7qcyDY TONIGHT: @eddieizzard is here to talk about his Wunderbar U.S. tour!\n\n📸: @ruminasean https://t.co/mU8W2OjXtG TONIGHT: A Starbucks cup made a surprising cameo on last night’s Game of Thrones. https://t.co/ypQzCPaXsW .@ChelseaHandler discusses her new memoir, how Trump’s election sent her to therapy, and her new munchie-free weed line. https://t.co/FbqX4JWiRL THIS WEEK: @eddieizzard, @ValerieJarrett, @tyrabanks, and Mark Jonathan Harris stop by! https://t.co/7EFr1Jfgl3 Watch Desi Lydic: Abroad on Monday, May 13 on @ComedyCentral The Constitution doesn’t technically guarantee men and women equal rights, but is there anything we can do to change that?\n\n@DesiLydic womansplains the Equal Rights Amendment: https://t.co/MuSw1NHA9U Full interview with @PeteButtigieg: https://t.co/sZKjUymCWG https://t.co/mP2YPOYZbo Facebook's new “Secret Crush” feature could help you find love… or just your grandma. https://t.co/FYDNYyk8dL .@iJesseWilliams talks being a pretend doctor through his work on “Grey’s Anatomy,” and gets real about why he got involved with cannabis dispensary MedMen: https://t.co/G4LPW9npiK Wow, this sure is a dark version of Maury. https://t.co/e9ABSHCMku The Mueller Report was like a bad episode of Sherlock Holmes. He just laid out the evidence and walked way. Full piece: https://t.co/GJvzWluL3i https://t.co/Rje2q3iN0v Why can’t our caveman brains understand how serious climate change is? @roywoodjr reports: https://t.co/qFPCxJw3Dj Joe Biden hit the ground stumbling at his first 2020 campaign rally. Full piece: https://t.co/OZP196oFlN https://t.co/UMk15oLuJb Facebook has heard your concerns! Well, read them in your private messages. https://t.co/6MPeExiBLd Joe Biden says he wants to be your President, but is he too sleepy for the job? Full piece: https://t.co/Bnn3E0bfRj https://t.co/wCuErpqEdp With all due respect to this list of the world’s sexiest accents, you got it wrong. https://t.co/sshGA2qxpL Want to party with @CharlizeAfrica while supporting her @CTAOP Africa Outreach Project? Here’s your chance: https://t.co/kYoQ49kfkk\n\nFull interview: https://t.co/51tah8HMXK https://t.co/3mwFnl6OHH More proof that this measles reboot is a terrible idea. https://t.co/qZOD8QZ37z RT @ComedyCentral: Meet a new kind of hero – a broke one. #NightPigeon @roywoodjr https://t.co/ST5EbceNoJ “You spend time, you have beer and you understand a lot of people are dealing with the same problems. They’re just dealing with them in different ways.”\n\n@JordanKlepper spent time with gun owners, including a 13-year old from Texas. Full piece: https://t.co/VjdbcKjY2l https://t.co/6NP8Umc96B Some are calling the Arctic the new Africa, and the original Africa has some tips for when the white people come. Full piece: https://t.co/pspRO4O4ww https://t.co/K7ONLcLQxR .@jordanklepper got arrested, got wet and got a new show. @Klepper premieres May 9th at 10:30/9:30c on @ComedyCentral. Full piece: https://t.co/VjdbcK2mDL https://t.co/7uxNp0qaLj A whale is suspected of being a Russian spy, @jordanklepper shares clips from his activism-oriented show @Klepper, and @CharlizeAfrica talks about her role in \"Long Shot.”\n\nListen and subscribe: https://t.co/rjRe5p1G0I https://t.co/IWE3oZTve9 Here’s the full piece with @jordanklepper: https://t.co/f7newBBJiG Here’s the full interview with @CharlizeAfrica: https://t.co/51tah8HMXK Before Russia was hacking your grandma’s Facebook page, they were doing actual superpower stuff, and they’re back at it.  👀 https://t.co/5fdCxXpMdp TONIGHT: Look who’s back! @jordanklepper is here to talk about his new show “Klepper”! https://t.co/ocqyhbuslC Tonight at 11/10c, a message from our African friends.\n\n📸: @ruminasean https://t.co/zMDhMCIOWF TONIGHT: Academy Award-winning actor @CharlizeAfrica is here to talk about her new film @LongShotMovie! https://t.co/9d9ImepcEU TONIGHT: Barr ditches House Democrats and one congressman comes up with a finger-lickin’ response. https://t.co/3FjDxeKoyD .@iJesseWilliams wants to change the way we treat white and non-white cannabis consumers. Full interview: https://t.co/LoTcEfTEKI https://t.co/fNdbOOrQeo One big flaw in American democracy: There’s no defense against someone being a dick. Full coverage of Barr’s hearing: https://t.co/GJvzWluL3i https://t.co/oI3xsuBrBF Barr’s letter was basically the equivalent of every subway announcement. Full piece: https://t.co/GJvzWluL3i https://t.co/s1Uhf8Czgk “Look at Senator Blumenthal’s face. He has the face white people pull when they get shut down in public.”\n\nBarr calmly denies a request for notes from his call with Robert Mueller. Full piece: https://t.co/GJvzWluL3i https://t.co/Qo82vGdwWz Here’s our recap of the Barr hearing: https://t.co/ze7qnoRVLt A survey finds that New Zealanders have the sexiest accent, Attorney General William Barr gets a Senate grilling, and @chelseahandler talks \"Life Will Be the Death of Me.”\n\nListen and subscribe: https://t.co/aNVxcVPdYr https://t.co/ZFxzsKgooA Here’s the full piece with @roywoodjr: https://t.co/xzz1LdUuqz Here’s the full interview with @chelseahandler: https://t.co/pLKLH6myOe “America, I feel like I found a fundamental flaw in your democracy: You have no defense against someone just being a dick.”\n\nWilliam Barr shows up to his Senate testimony with his middle finger held high. https://t.co/41j5OsdqeA The world is ending, so why is it so hard to do anything about it? @roywoodjr reports tonight at 11/10c. https://t.co/XCxwliNHQn When Kamala makes your head spin https://t.co/AoptoaET5K TONIGHT: Comedian, activist and author @chelseahandler is here to talk about her new book “Life Will Be The Death Of Me”! https://t.co/EV7EbLSJPn TONIGHT: A new poll ranks the world’s sexiest accents and South African comes in… 2nd?! https://t.co/mR8CBxzZAD RT @LateNightSeth: If you have an aunt with a dirty sense of humor, @DesiLydic is right there with you. https://t.co/CdntlWorn9 “I know in the suburbs, it’s boys will be boys, kids will be kids. But when it’s black kids doing it or poor kids doing it, they’re filling prisons.”\n\n@iJesseWilliams discusses the discriminatory enforcement of cannabis laws in America. Full interview: https://t.co/LoTcEfTEKI https://t.co/5cgH0ZEvR5 me:\ndon't say Trump obstructed\ndon't say Trump obstructed\ndon't say Trump obstructed\n\nme, 2 minutes into questioning: https://t.co/6naJkXM4HY “Cory Booker was almost run over during a speech and it barely made the news.”\n\nDemocrats outside the top tier are struggling to get media attention: https://t.co/Bnn3E0bfRj https://t.co/eZgY476zVT Joe Biden has especially strong support from black female voters. @dulcesloan knows why: https://t.co/Fu0ky5LOwg https://t.co/dTlWxqoj3y A car accident interrupts Cory Booker's campaign speech, @dulcesloan explains why Joe Biden is popular among black female voters, and @iJesseWilliams talks \"Grey's Anatomy.”\n\nListen and subscribe: https://t.co/SglBFUjGey https://t.co/DNg0XQsRSZ Here’s the full piece with @dulcesloan: https://t.co/Fu0ky5LOwg Here’s the full interview with @iJesseWilliams: https://t.co/LoTcEfTEKI Biden could take a page out of Trump’s book: instead of letting a verbal miscue trip him up, just create a new reality and plow right through! https://t.co/B0nLXw1hpA TONIGHT: @dulcesloan breaks down how Joe Biden is America’s “familiar dick.”\n\n📸: @ruminasean https://t.co/L0VPZgYXkl TONIGHT: “Grey’s Anatomy” star and activist @iJesseWilliams is here! https://t.co/BAmLNP4SSX TONIGHT: The Father, the Son, and the… hold on, he said what?! https://t.co/ZkkabD9N8w The Washington Post claims Donald Trump has told over 10,000 lies since becoming President. But what about these 10 times he told the truth? https://t.co/s7QDVoE50a .@PeteButtigieg sticks around for a #BetweenTheScenes audience Q&amp;A on domestic and foreign policy, his meeting with Rev. Al Sharpton and how he defines economic success. https://t.co/PoHp8MhG5Z “Avengers: Endgame” and “Game of Thrones” have turned every conversation into a spoiler minefield. @roywoodjr sets some rules for spoilers. Full piece: https://t.co/ZSX0k4r2mo https://t.co/Yobi1vy5D0 “Racial inequities didn’t just happen. They’re not an accident. They’re, in many cases, the consequence of racist policies.”\n\n@PeteButtigieg outlines the need for anti-racist policies at a local and national level. Full interview: https://t.co/ecEgxO3jP9 https://t.co/Qdg6cwrOt4 .@DesiLydic heads to Wall Street to investigate the financial industry’s male backlash against the #MeToo movement. https://t.co/3J2U1PoOPs Trying to avoid “Endgame” spoilers? @roywoodjr has a few tips: https://t.co/FO7amBY9Tw President Trump tells over 10,000 lies while in office, @roywoodjr addresses film spoiler outrage, and 2020 White House hopeful @PeteButtigieg discusses \"Shortest Way Home.”\n\nListen and subscribe: https://t.co/BcaNONWLbi https://t.co/ft1kPyGtNN Here's the full interview with Mayor @PeteButtigieg: https://t.co/ecEgxO3jP9 Spoiler alert: @roywoodjr is here to help you protect yourself from “Endgame” spoilers. https://t.co/PrzAOIH0L4 Seriously, though. https://t.co/JRkG2MS1Gg TONIGHT: 2020 presidential candidate Mayor @PeteButtigieg is here!\n\n📸: @ruminasean https://t.co/BMk44RGCsV TONIGHT: Congrats to Trump for hitting 10 thousand lies! Or as Trump would say, 1 million lies! https://t.co/dATzrzeoCL “I do think it’s simply harder for candidates of color or female candidates, I’m very mindful of that.\"\n\n@petebuttigieg talks white privilege tonight at 11/10c. https://t.co/om21y7SoOT Haven't seen Avengers: Endgame yet? Here's everything you need to know before you go: https://t.co/BstauDeEge RT @Klepper: The Mueller Report: feat. @HillaryClinton\n\nFull Video: https://t.co/u1H4yX0PvF https://t.co/jDgdZ5pUfO RT @Klepper: And now, @HillaryClinton reads from the Mueller report.\n\nKlepper premieres May 9 at 10:30/9:30c on @ComedyCentral. https://t.c… THIS WEEK: @PeteButtigieg, @iJesseWilliams, @chelseahandler, and @CharlizeAfrica stop by! https://t.co/2JBIZ0YmHB Watch Desi Lydic: Abroad on Monday, May 13 on @ComedyCentral Do women really make 80.7 cents for every dollar a man earns? Does having kids mean less money? It’s a little more complicated than you think. @DesiLydic womansplains the gender wage gap: https://t.co/o7dvYxP84z New York City subways are about to be flooded by commuters avoiding the new “congestion tax” on drivers. @TheLewisBlack reports: https://t.co/8m3noIWJij https://t.co/PPIbi9r8jp Is Netflix killing intimacy or do people just not know how to multitask? Full piece: https://t.co/U0SldU4UtK https://t.co/JBihC6dVrh Don’t f**k with Kamala, Brian! Full piece: https://t.co/75cLuEboWz https://t.co/NWnrqQMgED .@melindagates on why birth control is the greatest anti-poverty tool we have. Full interview: https://t.co/jigWpmAxZq https://t.co/mCDy9mHyqy What do black folks and country music have to do with each other? More than you think. @roywoodjr reports: https://t.co/tRtXATDA9W Some climate change solutions are better than others. Full piece: https://t.co/kus2R4cPrK https://t.co/u9XEzuuf6g .@jaboukie’s first piece of advice for Trump’s Twitter: be less thirsty. https://t.co/piIMNNSca5 Guess Joe’s gonna ride 'til he can't no more. Full piece: https://t.co/U8dtE9wkQl https://t.co/16yRiHF5GT Even Teslas need a side hustle. Full piece: https://t.co/U0SldU4UtK https://t.co/KXMTyYVen1 “We don’t need to dim the sun. We already have two dim sons. They’re called Eric and Don Jr.”\n\n@ronnychieng unpacks the worst solutions to climate change. Full piece: https://t.co/AIKGScLC14 https://t.co/149OeZcTaF McDonald’s staffs up with seniors, Bumble tries to block dick pics, and chimps discover Instagram. https://t.co/zTXTvF8nye McDonald’s is looking to hire senior citizens to fill positions. Full piece: https://t.co/uTWsEKDUOv https://t.co/JE3n2u2DRS You've been hit by\nYou've been struck by https://t.co/raXhH4ryQ5 Go ahead. We’ll wait. Full piece: https://t.co/U0SldU4UtK https://t.co/5aJQ0re7FW RT @TheDailyShow: @jeneps Mr. Vice President, Sir... You have forgotten the Tan Suit:\n\nhttps://t.co/zYZ20sEh82 @jeneps Mr. Vice President, Sir... You have forgotten the Tan Suit:\n\nhttps://t.co/zYZ20sEh82 How times have changed. Full piece: https://t.co/U8dtE9eJrL https://t.co/Ad1aunjJ3z “The only thing that spends more time in Biden’s mouth than those perfect teeth, is his own foot.”\n\nJoe Biden: America’s favorite goofball. Full piece: https://t.co/U8dtE9wkQl https://t.co/RJe4FLbAzE Trump met with Twitter CEO Jack Dorsey to complain that his follower count was down 🇺🇸\n\nFull piece: https://t.co/y5TgvmIAmd https://t.co/WbGhxUMmkH Trevor discusses Joe Biden's 2020 presidential candidacy, @roywoodjr highlights black peoples' contributions to country music, and @ryanoconn chats about \"Special.”\n\nListen and subscribe: https://t.co/RvdynudXEk https://t.co/sOzsChwkjM Here’s the full piece with @roywoodjr: https://t.co/Ws87hLMVvQ Here’s the full interview with @ryanoconn: https://t.co/oSrTV0Harx Joe Biden jumps on the 2020 train with a s**t ton of baggage. https://t.co/dAWYVgUDNc TONIGHT: The history of country music is blacker than you think. @roywoodjr explains in a new CP Time:\n\n📸: @ruminasean https://t.co/ebGO7hmD7n TONIGHT: Creator, writer, and star of Netflix's “Special” @ryanoconn is here! https://t.co/Ox5uqtC6fo TONIGHT: Humans’ closest relatives might be getting a little too close… https://t.co/oUZ463tFTH How many Marvel movies do you have to see before Avengers: Endgame? None. Just watch this: https://t.co/GQ7GnAkHOg Trump thinks he should have more Twitter followers and @jaboukie thinks he should stop being so thirsty. https://t.co/4ewK6PDUe9 “I’ll have you know my father works at Red Lobster!” Full piece: https://t.co/y5TgvmIAmd https://t.co/9nhOIIYGWI Jussie Smollett season 1 ep 4 is wild 🚨SPOILERS🚨 https://t.co/9S7xgFDeu0 Black Twitter is the only gated community Trump isn’t allowed in. @jaboukie is here to help.\n\nFull piece: https://t.co/y5TgvmqYXD https://t.co/FUnwkbw3NA Trump summons Twitter CEO and tech bro Tyrion Lannister to the White House to complain about his follower count... https://t.co/S1bSotqC6B When Ivanka Trump goes into work every day... what happens next? https://t.co/45D6ABWfBW .@jaboukie offers Twitter advice to President Trump, @TheLewisBlack foresees a horrible subway experience in New York, and @melindagates discusses \"The Moment of Lift.”\n\nListen and subscribe: https://t.co/E4yQIdjDte https://t.co/udlCfPmQgF Here’s the full piece with @TheLewisBlack: https://t.co/8m3noIWJij Here’s the full interview with @melindagates: https://t.co/jigWpmiWAQ Trump wants to speak to the manager @Twitter @WHCA @HouseDemocrats https://t.co/qzpqH7ELQA TONIGHT: NYC commuters are ditching cars for the subway and @TheLewisBlack is here to give them a fair warning.\n\n📸: @ruminasean https://t.co/RlT6ak7x49 This week on Unsolved Mysteries: White House Edition, what does Ivanka Trump actually do? https://t.co/sYClNvBOlF TONIGHT: Global advocate for women and girls @melindagates is here to talk about her new book “The Moment of Lift”!\n\n📸: @ruminasean https://t.co/8alv4GYrK8 TONIGHT: Whoever is writing this Jussie Smollett story deserves a raise. https://t.co/XrHVQageSb RT @TheLewisBlack: Tune in TONIGHT (4/24) for a new Back In Black segment with @TheLewisBlack on @TheDailyShow @ 11pm/10pmCT on @ComedyCent… Two years into your presidency is as good a time as any to learn about your country’s criminal justice system. Full #BetweenTheScenes: https://t.co/bBjBvzflSb https://t.co/spHMnL4cfV Elizabeth Warren explains her 2% wealth tax like she’s in one of those sponsor-a-child commercials. \n\nFull piece: https://t.co/Ybu8Q4fi7Q https://t.co/ncHbvzFlH4 \"Marvel gave the Swedish space viking with the hammer three damn movies before they gave us a black one, and as soon as they give us a black movie, Thanos show up and trash the whole crib.\" https://t.co/GQ7GnAkHOg RT @Trevornoah: I stole this pic from @hasanminhaj 🙌🏾  who probably stole it from @mosalah #Time100 https://t.co/I3M68HTQov Pete Buttigieg doesn’t tell you about his policies, he just makes you feel like policies. Full piece: https://t.co/Ybu8Q4fi7Q https://t.co/qjB6fBsZks “No collusion” doesn’t equal “no obstruction.” #BetweenTheScenes https://t.co/0NgxVGZAF6 Five Democratic presidential candidates participate in CNN town halls, @michaelkosta weighs in on impeachment, and @apalmerdc and @JakeSherman discuss \"The Hill to Die On.\"\n\nListen and subscribe: https://t.co/K34CExiJd9 https://t.co/vBtwxzkkfM Here’s the full piece with @michaelkosta: https://t.co/Oedi0HIe03 Here’s the full interview with @JakeSherman and @apalmerdc: https://t.co/RSPEY4XuvU For those who don’t have five hours to spare and have a life unlike us, here are the highlights from last night’s Dem town halls: https://t.co/UYu396AnM0 TONIGHT: @michaelkosta’s back to talk impeachment and, yes, he has a chart. https://t.co/PjHYMX2DAa TONIGHT: Politico’s @JakeSherman and @apalmerdc are here to talk about their new best-seller “The Hill to Die On.” https://t.co/4fvkRWC9za TONIGHT: Some candidates keep it 100. Amy Klobuchar keeps it 1000+ 😶 https://t.co/UvhJ1WoHBx We won 5 #Webbys! Congrats to the other winners and thanks to all who voted for us, legally and illegally! https://t.co/nkaAVq3FJV #FreeTheRedactions\n\nFull piece: https://t.co/RdG3FOCyWX https://t.co/27qXj14T8x “2019 is the year when powerful white people are learning things about the justice system that black people in America have known about for a very long time.”\n\n#BetweenTheScenes https://t.co/783JwFcdHW Didn't watch the Marvel movies leading up to Avengers: Endgame? @RoyWoodJr has you covered. https://t.co/ZKIWCKO97j Africa might not be the best place for Prince Harry and Meghan Markle to blend in. https://t.co/uInZ1EwRvy “You don’t get mad when you’re doing something good and someone takes notes.”\n\nThe Mueller report reveals that Trump doesn’t like his lawyers taking notes in meetings. Full piece: https://t.co/RdG3FOCyWX https://t.co/afHrLse06W The Mueller report fallout 👇 https://t.co/mhgaacNy2P RT @nguyen_amanda: I grew up watching @TheDailyShow every night and tonight I got to be on it. Unbelievably grateful. https://t.co/fdpBspd8… RT @Trevornoah: Live and learn 😂 https://t.co/JalfCiAoN3 The Mueller report portrays a White House in full panic mode, @ronnychieng is unimpressed by anti-climate change proposals, and @RiseNowUS CEO @nguyen_amanda sits down with Trevor.\n\nListen and subscribe: https://t.co/DOyQMZw90z https://t.co/utv0ozNKcm Here’s the full piece with @ronnychieng: https://t.co/KkvL6yOXRb Here’s the full interview with @nguyen_amanda: https://t.co/KOJnoiiOWC RT @TheDailyShow: Meet Pete Buttigieg: a name to remember (and learn how to pronounce). https://t.co/xj6InPYMRy The Mueller report is finally out to the public, and AG William Barr left out A LOT of juicy details. https://t.co/WP4NSxcPFl TONIGHT: @ronnychieng rings in Earth Day with some head-scratching global warming solutions. https://t.co/uqY0GvGmCC TONIGHT: Founder and CEO of @RiseNowUS and Nobel Peace Prize nominee @nguyen_amanda is here! https://t.co/0w2abI2sPG Trump: “I don’t remember” 37x \n\nAlso Trump: https://t.co/XHguRn7sIF TONIGHT: Harry and Meghan might be taking a six-month sabbatical in Africa?! https://t.co/lgyNDDnVxb .@Trevornoah do 👏 not 👏 wear 👏 green 👏 during 👏 rehearsal 👏 https://t.co/JTR37c9ame THIS WEEK: We're back with @nguyen_amanda, @JakeSherman &amp; @apalmerdc, @melindagates, and @ryanoconn! https://t.co/95CKkKnzye RT @Klepper: Go behind the scenes of Klepper with the Klepper podcast!\n \n@jordanklepper discusses the stories behind each episode with writ… Trevor accidentally pranks himself so Ellen doesn’t have to. https://t.co/r1En2tZ2cg .@Lizzo is the OG of body positivity. Extended interview: https://t.co/O525daebgJ https://t.co/iX1bypHYHO “Jean Valjean… he’s in prison for 19 years for stealing a loaf of bread. Well, you only have to look at the prison industrial complex here in America right now.” \n\nDavid Oyelowo on how “Les Mis” is as relevant as ever. Full interview: https://t.co/5wqS8CtZB1 https://t.co/KtM7pHXI1N Throwback to @AnnaKendrick47 crashing #BetweenTheScenes: https://t.co/ow6x59p0xU “The women’s national team is one of the most successful team sports in the world, and we’re still struggling to get equal pay.”\n\n@AbbyWambach discusses the gender wage gap in professional soccer and why she’s dedicating her life to fighting for equality. Extended interview: https://t.co/onKLcs5gYU .@Jaboukie on being the “millennial correspondent.” Full SXSW panel: https://t.co/FtIRSxhcow https://t.co/3WR3lS88Li .@BernieSanders stayed after his interview for a #BetweenTheScenes audience Q&amp;A on immigration and his relationship with the black community. https://t.co/HGOACK78rF Switzerland: all the American gun culture, none of the American gun violence.\n\n@michaelkosta reports: https://t.co/MsJU4lbNlv https://t.co/qCIql40pVy Bandersnatch (2018) https://t.co/i2sked9SxU This casual Friday, we remember Obama’s JacketGate, the worst scandal in presidential history. https://t.co/uQ2f4aoVBi .@Oprah's career as a talk show host began with a “demotion.” Extended interview: https://t.co/VfUkyUod7A https://t.co/1eViG7aEHY"}