{"tweets": "Constant fart smell https://t.co/msYP6O3Agy Being a team is all about building trust and perfecting an angry mob mentality @chelcielynnn We know it's actually 'Frankenstein's Monster' shut up nerd https://t.co/SmYg5r58aN Is Meredith Von Pigeon a brilliant basketball coach? Yes. Is she a little bit insane? Also yes. https://t.co/2nEsZErvhf Will Ferrell meets the toughest cop in the world https://t.co/rsm0cLLfji Rubí is a telenovela so insane, you should probably sit down to watch this https://t.co/VKhR3cdrN9 https://t.co/VR94spG6JP The scariest thing your kid could be for Halloween: our president 😱https://t.co/RywGlCdT7d https://t.co/MBVFQScfVG When the first day of my period aligns with a full moon https://t.co/iJWe4Eldqg My bedroom//My car https://t.co/YFxYAMEPKf This is the scariest horror movie filmed on a camcorder since the last horror movie filmed on a camcorder 📹😱https://t.co/dYgC214T5Q https://t.co/jLTPAT8KV4 NOFX's song \"Oxy Moronic\" is an addictive punk rock anthem about the highs and lows of big pharma. https://t.co/TTi1NP49MB https://t.co/zpqi4C6WPP My gravestone: https://t.co/ESWJRW3lqX There is always a scary girl in every horror movie and @ChloeGMoretz is that girl. https://t.co/O5hkJmdphh https://t.co/W7hwoIOy5M What happens in your bed when you're on vacation? https://t.co/yrVfEzBkTg https://t.co/XnYhpQx1py Throwback to that time Will Ferrell met his landlord, Pearl. https://t.co/ovF3GeUY8q https://t.co/Tza0kaZyc2 If you have ever wondered why it takes you so long to get off your plane after landing, the secret lies in what the flight crew have to do to \"prepare the cabin doors.\" https://t.co/EBynBedKK9 https://t.co/AcPXrUuPKf i just went through a breakup so now i have to turn my garfield costume into a sexy garfield costume President Galaxy Brain strikes again https://t.co/RLzGtHUjse when my boss asks me to do something at 4:59 on a friday https://t.co/nWID8Xkxxm Adam Scott sat down with Zach Galifianakis to discuss whether or not Martin Scorsese remembers him &amp; if he can give a smile that doesn't say, \"I just fucked your girlfriend.\"\n\nWatch \"Between Two Ferns: The Movie\" on @netflix https://t.co/ilVvD0SI5e @NetflixIsAJoke @mradamscott how to do your makeup when you're possessed by an evil spirit (feat @laurenlapkus) https://t.co/9xorXhlWvo the scariest halloween costume is \"your co-worker who microwaves salmon\" Meeting the parents can get pretty daunting when you're dating Ivanka Trump. https://t.co/B4wQsOWRvJ https://t.co/Mo4DlhIW9I Did Gloria Steinem really work with the CIA? And more importantly, did she get any cool spy gear? @GloriaSteinem  https://t.co/GYk8BgbkOE The results of your dog's DNA test might surprise you... https://t.co/IOJ2TRjaza Don't worry, parents, Dr. Phil is just as confused as the rest of you https://t.co/51eCyOstck @TheDrPhilShow when you run into that \"friend\" you hate, but you're an adult and have to be nice...\n\nWatch the full video here: https://t.co/FHyXYLLxZu https://t.co/yf3khrWgvn As the United States embraces a world of alternative facts under President Trump, it must also embrace alternative spelling. https://t.co/zILwM43i1m Me//My ex's new girlfriend https://t.co/zEtDpMWZlS Want to know what happens when you find a hole peeking into the girls locker room? This happens. 100% of the time. https://t.co/PPDKOawTnk the scariest part of halloween is having to pay rent the next day Challenge: Can you spell any of these words? No cheating stunads! (feat. @KellyRipa) https://t.co/rxvLFB3uJo 10/10 amazing research @urichmond A bunch of rats learned how to drive tiny cars and they're honestly super into it. Thank you science https://t.co/MHYO67hLaN RT @WayneBrady: I got to spit and sing some knowledge on this smart and painfully dead on piece by @NeilGarguilo and @justlikestephen https… Every Trump speech feels like you're trapped in a car with him https://t.co/T5zk8Bjc4V https://t.co/Sug84kUBG0 RT @IJasonAlexander: Very proud to have been invited to be part of this. The whole series on historic racism is worthy and wise. https://t.… Absolutely not https://t.co/3E3W9ccBrK RT @billyeichner: BIG NEWS: MOVE OVER, GRACE AND FRANKIE! BILLY ON THE STREET IS COMING TO @NETFLIX FOR THE FIRST TIME NOV 1st!!!!! FOUR SE… The scariest unboxing video on the internet 🧟‍♂️😱 @jmillstein https://t.co/bxcHQgTRld https://t.co/ej1MQGOIhM Scream\nScream 1\n2 screams 2 many\nScr3am\nWe all scream 4 ice cream\nSesame scream It's not paranoia if they are out to get you https://t.co/i8TaSiG5Ki @BirdySoderdy https://t.co/eDh0TQ3sFB This is literally just gifs of Jeff Goldblum but what more do you need, what more does anybody need https://t.co/nMxKZ12HYl #jeffgoldblum @blazinbeetz no Every Trump speech feels like you're trapped in a car with him https://t.co/oyLvjxQFGm Brooke Shields learns it's never too late to start over... https://t.co/cW5ABfTzsU @BrookeShields https://t.co/ev8lmL3mFs Not all heroes wear capes, some wear giant hot dog suits https://t.co/ixVpRoCRzc How the hell are you supposed to go to the bathroom in a romper? https://t.co/jA163H724K @MeganBrotherton https://t.co/YgSDfFTC0L when it's actually more than just a fart https://t.co/8JrBjWEeA3 RT @MeganBrotherton: I directed a new short for Funny or Die! https://t.co/gVc0FWl48q With climate change effecting the entire planet, soon the swimsuit model may be the next to be added to the endangered species list. https://t.co/zncS9yJDrc https://t.co/npHxz02i3y These early cartoons have a lingering smell. https://t.co/ewDaI8DhCP If you look at a butt crack sideways it looks just like the Joker's smile. Take our quiz and see if you can tell the difference between a G.O.B. Bluth quote or a quote that the president actually said out loud with his mouth https://t.co/xy5QKzSeuq A robot watched Shrek and this is what it had to say https://t.co/aTlCkxH5bw https://t.co/0OO9vBVAf3 Swipe left. Natural diamonds are one-of-a-kind, formed over billions of years. Lab-grown diamonds are mass-produced in a microwave. #ad @realisadiamond https://t.co/hf81FC3EyW An easy recipe for Halloween bread that will take you out of this world. Literally. https://t.co/dA5De7QQBc THEY HAVE PAY-OR-PLAY CONTRACTS https://t.co/U7FYjs8fnu @hulu @warnerbros @amblin Only if my mom says it's ok https://t.co/O3hsoXPcqL This trailer mash-up for ‘Us’ is absolutely terrifying... https://t.co/12NdixhFbE https://t.co/Ur9piCsfSk The truth behind Dennis Quaid's infamous on-set meltdown is finally revealed. https://t.co/oNlFcvVMDF New parents just go so hard. https://t.co/g9Gscv7cbj Spooky Halloween idea: call someone and leave them a voicemail A suburban couple becomes disturbed by a demonic presence living uncomfortably in their child's closet. https://t.co/vRP0uJ6ZVk https://t.co/zhSb8Nefdj Too scary https://t.co/5BFG59uHN6 A lovely couple is just looking for a home to die in. ⚰️https://t.co/sXDNDtiQ9s https://t.co/4b6mmUuVQd He's survived the Russian mob and the world's toughest gangsters, but can John Wick survive the ultimate challenge, a Destination Wedding? https://t.co/j6VMCHWH6r This Halloween, go see the scariest horror movie filmed on a camcorder since the last horror movie filmed on a camcorder. Or the one before that. Or the one before that.... https://t.co/iRq2fvT9fN Weird Al Yankovic doesn't need a full marching band behind him to tell you your team sucks. But it definitely doesn't hurt. @alyankovic https://t.co/vWa5YZPKe0 we keep borrowing other people's phones even though we all use them literally every time we are on the toilet If you loved Ocean's Eight you're gonna love the British spinoff. The Spice Girls are back and they're taking up a life of crime in the newest installment of the 'Oceans' franchise. Girl Power! @spicegirls https://t.co/ZFuRuxi6Ai I'm 12 https://t.co/QS8GL88JMm If black mirror were realistic:\n\nwatch the full video here: https://t.co/VbrZtT2iaY https://t.co/O6912S3hd5 There's a 100% chance Mugatu asks to speak to the manager https://t.co/Rw6jA9MKZW how to do your makeup... when you're possessed by an evil spirit 😱 https://t.co/220gCdfDoR You know those pretentious baristas who make you feel stupid? Yep. This is them.\n\nWatch the full video here: https://t.co/0kar5Q0c1P https://t.co/F3n58YPT1P Not to brag, but I just stabbed a cherry tomato with my fork on the first try There is always a scary girl in every horror movie and @ChloeGMoretz is that girl. https://t.co/qqn1Y0rzB7 Dumbo and the Joker know why they put on a happy face. https://t.co/6qsM8UoU4Y Award-winning actress Brie Larson is in a new, absolutely award-winning bonus episode of Between Two Ferns. Watch \"Between Two Ferns: The Movie\" only on @netflix. \n https://t.co/d1QEhnXf22 @netflixisajoke @brielarson Thank you @DancesWithTamis for your endless wisdom Please, please, PLEASE, hang these around your office. Trust me, it's exactly what everyone needs https://t.co/jTQsv9ZfQu What really happened at the last supper 🙏 https://t.co/OtcC8Eljfs We asked 20 strangers to 💩 in front of each other for the 1st time ... https://t.co/0QIugEqDOq https://t.co/Rt9n1CSemz The scariest unboxing video on the internet 🧟‍♂️😱https://t.co/bxcHQgCfWD https://t.co/29weJ5ucqp \"Only Wanna Be With You\" is the dumbest music video about sucking at all sports https://t.co/k2eGHA4j5u Cultural Impact: \n\n███████\n\n███████\n\n███████\n\n███████\n\n███████\n\n███████\n\n███████    ███████\n\nAnchorman     Batman Getting called to jury duty is just the beginning of a glorious journey. https://t.co/Kvp71skHIc Paul Rudd's talent truly knows no bounds https://t.co/yiWgw95Bzc @firstwefeast @seanseaevans Ron Burgundy opened up the call lines to talk to America about what really matters: cheese, golf, and wolf-dog hybrids. https://t.co/qB9QCj3XqF Some of us just prefer men with small dicks who cum fast. https://t.co/8wViRITnVz @NoActivityCBS @nycomedyfest @CarolinesonBway @CBSAllAccess and make sure you've got all your questions for @amysedaris @PatrickBrammall @sunitamani &amp; Trent O'Donnell ready! Get an exclusive first look at @NOACTIVITYCBS Season 3 at @nycomedyfest on Nov. 10th at @Carolinesonbway, plus a LIVE Q&amp;A with the cast! FREE TIX HERE, HELL YEAH: https://t.co/exfiYDevMP @CBSALLACCESS The second one is kinda cute... https://t.co/ZbxgBNW3Hh The reality TV show gets a new spin when one gay man looks for love in a mansion filled with lots of other gay men: https://t.co/cijVJmdSh2 @jessetyler @GeorgeTakei https://t.co/MdjjRBVqo1 looking for the English edition of this episode? we got you: https://t.co/PScSnlkeIh María la del Barrio es la versión incestuosa de La Cenicienta https://t.co/bkVdax3DMk No one is all 6:\n\n1. A bitch\n2. A lover \n3. A child\n4. A lover\n5. A sinner \n6. A saint Michael Keaton helps teen misfits Dexter (Kenan Thompson) and Ed (Kel Mitchell) take a small burger joint to the top of the food chain in 'The Good Burger Founder'. @MichaelKeaton @Iamkelmitchell @kenanthompson https://t.co/YSQRnOBkto RT @trixiemattel: I sang in a bathroom. https://t.co/HhmlRlVM1G \"How old are you?\"\n\"Old enough\"\n\"Old enough to what?\"\n\"Old enough... to party\"\nhttps://t.co/Gzdb4a29Pv Finding money is free https://t.co/SjhiQoN8Xd Jurassic Park reviewed by a robot: https://t.co/EBH7QWbtUe https://t.co/n4IbAxvSHc you can reply “die” to our tweets as much as you want but we will never die. our power only grows Things go \"FFRRMMMPPHHFF\" in the night https://t.co/t2Xn1ej2Bl @fin_costick @quiethandfilms Can you believe how well Gus Fring's face healed up?! @BreakingBad Did you know guitars were designed to look like this woman? https://t.co/uJnjrTesb2 ME: I don't need sunscreen or moisturizer \n\nALSO ME: https://t.co/Dd5JweAgz9 We made @quiethandfilms endure his biggest pet peeve so he could bring us Gus Fring's pet peeves too https://t.co/WaJdCrk7Ny The amazing @trixiemattel played a show in our bathroom and it was one of the best days of our lives https://t.co/cZswN7hniZ The one where we all make regrettable impulsive purchases https://t.co/QP25a2nDmT @FriendsTV This has been the funniest three minutes of my entire week, I'm wheezing https://t.co/Pl3wP7s3aT @TadhgFleming Everyone's excited about the new season of No Activity... well, almost everyone.\n\nSeason 3 drops November 21, exclusively on @CBSAllAccess https://t.co/PWqVlNitqq For people who have too many freaking weddings to attend, Visa Vows has you covered (with @jamiechung1): https://t.co/qIWgXRES6K https://t.co/ubHFoeNZIT Get amped for an all new season of No Activity with all new guest stars and returning favorites https://t.co/Uu420uLEv2 @CBSAllAccess Aren't morning people the worst kind of people? (with @DeadKevinSketch) https://t.co/XRLP5LVSug Yeah so bye-bye Pepé Le Pew, you grabby ball of stink. https://t.co/RXv3rdmBo6 Amigas y Rivales is a telenovela that will make you never want to have kids https://t.co/PVLHv77d1q Happy Thanksgiving, Canada! Enjoy your day with way too much food, Schitt's Creek, and a whole lotta gifs! https://t.co/ApZICKZC5B @SchittsCreek Mondays are shit https://t.co/Vee2geIbXG Stranger Things' David Harbour originally auditioned for the role of Eleven. Here's the lost audition tape:\n\nWatch the full video here: https://t.co/K3kT7hs4Gg @DavidKHarbour @Stranger_Things https://t.co/oCfq2acyez Natural diamonds are rare gems older than life itself and 100% unique. Lab-grown diamonds are inauthentic and made in a microwave. #ad  @realisadiamond https://t.co/ufMMIJYdBf \"When everyone calls you trash, and everyone treats you like trash, why don't you just become trash?\" Honestly kind of a fair point https://t.co/2SUEWFQlfw @nbcsnl @DavidKHarbour 5 out of 5 dentists agree: you haven't been flossing since your last appointment you lying piece of shit https://t.co/xyCykS9DTo when i place my luggage in the overhead compartment https://t.co/EG29QuEl4f Remember the Tom Hanks movie 'Big'? It's just like that ... but with a girl! https://t.co/x8Goox58qB @tomhanks @evanrachelwood @DarrenCriss https://t.co/PL3dKsmKWv \"November Rain\" is the dumbest music video about a guy jumping through a wedding cake https://t.co/j9lbtDg7La Ted Raimi tells the scariest stories ever told - a Halloween collection sure to scare you down to your dick 😈@tedraimi https://t.co/nzhekVRlOU https://t.co/Gu0FLX1qxs Here's some candy hearts https://t.co/lggYww4pDL 80% of breakups happen because one person finished binging a show without their partner Jason Voorhees takes to the streets of New York City this Friday the 13th to ask people how they would like him to kill them. @JasonLVoorhees https://t.co/FKzyOaIfRc This Meat Loaf epic is the dumbest music video about breaking into a castle to take a bath https://t.co/rhZdrB7hvS https://t.co/4OvLPmb2fT The Least Popular Halloween Candy In Every State https://t.co/fvlFpx68vO Get yourself spooked with these gritty Halloween tales 😱(feat @marilynmanson) https://t.co/uK1vLOo0Z5 https://t.co/1TKuiY1prH Ahh, I simply love admiring* fall** foliage***\n\n* drinking\n** a beer \n*** in the shower me trying to look at all my crush's old instagram posts without liking any https://t.co/qrRnLrg5GK Dating is hard, especially when your girlfriend has been possessed by the soul of a demon. @eliroth https://t.co/UBbEUlrXs9 the morning after can be... awkward 😅\n\nwatch the full video here: https://t.co/uBD8kET0hu https://t.co/VFn4zBuZ2o NSYNC's \"I Drive Myself Crazy\" is the dumbest music video about punching a TV: https://t.co/iHYySJZST4 https://t.co/AWCwqRPS9C It's.... it's just so.... beautiful https://t.co/IY1LN8VkuY @DannyDeVito A slasher stalks a sorority house on Halloween, but he may not be the creeper we think he is. https://t.co/jOFhlpslm2 Big things are happening! https://t.co/LAr7LyTNzG @dashiell when i sext the group chat instead of my girlfriend https://t.co/EZsbxbq3NH Keanu Reeves sat down with Zach Galifianakis to compare scars, discuss his lack of awards, and listen to Zach recite his deep poem. Watch \"Between Two Ferns: The Movie\" only on @netflix https://t.co/N4XTwIymBi @netflixisajoke RT @soulpancake: When the cost of bringing others joy is your own joy...the cost is too high. #LaughingMatters https://t.co/iwfQKvHlsV @fun… Your favorite Halloween movies in Spanish are even darker than the originals https://t.co/9mtEKiM70c The Mindhunter team isn't ready for the Golden God. https://t.co/O3QqqfZZle me on twitter           me in real life \n\n                        🤝\n\n            nobody likes me Monika is visited by an unexpected suitor on Halloween night. https://t.co/6qFRkjg12X https://t.co/D2avvFMoiL ME: i'm just going to have one drink tonight\n\nME FIVE MINUTES LATER: https://t.co/7lZtmcbtLA RT @AnnaAkana: In honor of #WorldMentalHealthDay the wonderful @soulpancake &amp; @funnyordie brought this documentary into the world. Honored… Did Ron Burgundy single handedly cause the downfall of Studio 54? Find out on this episode of The Ron Burgundy Podcast https://t.co/ksdqmthM9c @BrookeShields RT @rainnwilson: Some sad friends and I gave birth to something depressing and funny today. Watch #LaughingMatters now: https://t.co/36nWGl… SCIENCE, BITCH! https://t.co/Rx1Ek2BdMm @aaronpaul_8 @jimmykimmel RT @SaraJBenincasa: Me being so thankful to see people sharing such beautiful things on #WorldMentalHealthDay / Me when a man at the shop s… RT @ChrisGethard: It’s world mental health day. Was very flattered to be in this documentary about comedy and depression alongside so many… RT @CrisisTextLine: We love how @soulpancake and @funnyordie brought comedians together for an honest look and real conversations about com… CO-WORKER: i give today...a 10/10 ;)\n\nME: https://t.co/tm7Je3Iwfd RT @AliciaHannah: Watch this 30 min doco with all your fave comedians (@SarahKSilverman, @aparnapkin!) bringing awareness to mental health.… RT @funnyordie: @AnnaAkana @soulpancake 💕 @AnnaAkana @soulpancake 💕 \"Laughing Matters\" - the documentary that brings comedians together to discuss comedy, mental health, and the funny business of being sad, is now available online on FOD &amp; SoulPancake: https://t.co/aJsWSyHOsZ #laughingmatters #WorldMentalHealthDay #mentalhealthawarenessday https://t.co/12WHigvKUM It feels less scary if you spell it out with hot dogs https://t.co/OojdFdSUt0 my co-workers think i'm drinking a pumpkin spice latte but really it's a big mug of butternut squash soup the remake of 'The Little Mermaid' we've all been waiting for 😍 https://t.co/n3qlQYka9P Tasty! https://t.co/MUOXYJamh7 LOOK AT THEIR CHUNKY TUMMIES AND THEIR FLUFFY ROUND BUTTS  https://t.co/c9tNAaJ9oa @KatmaiNPS My inner child has awoken and is shrieking https://t.co/MFNSNXIfj4 @LisaFrank @BarsalaHousing @hotelsdotcom beware the Backseat Googler! https://t.co/6bTqfzIsOD all he wanted was spaghetti and tv with his family, but the trumpet had other plans.\n\nwatch the full video here: https://t.co/5fi2uW993T https://t.co/pmlLLiQSO4 I am Franklin https://t.co/PZU0bDRK6Z RT @soulpancake: It’s a funny business… being sad. Watch the *NEW* #LaughingMatters trailer and tune-in to the premiere tomorrow at 10am on… that fucking sucks https://t.co/bSNN54rkNd CHRISTMAS HAS COME EARLY https://t.co/WR6cXykGTx @jackblack meeting your girlfriend's dad for the first time? awkward.\npeeing next to your girlfriend's dad? yikes. https://t.co/xNDKKxsRi3 'Big Mouth' season 3 is here and it is worth celebrating https://t.co/hESvJkPwlj @bigmouth RT @bubbiesknowbest: Zach Galifianakis Talking Circumcision With Three Jewish Grandmas Is The High Point Of 2019 - We could not agree more!… Sally Jessy Raphael on the Art of Mime @SJRaphae https://t.co/WqVKKA0sVZ RT @IndieWire: #BetweenTwoFerns: Director Scott Aukerman Found a Completely New Way to Make a Movie https://t.co/Bp8skWeJ5U https://t.co/dX… when i see two people fighting online https://t.co/0Ook30pYiR Are cartoons evil? Well, some of them definitely aren't great. https://t.co/653V05DPuy me: everyone i work with is a moron\n\nalso me (eating m&amp;ms): why do these skittles taste so chocolatey RT @NetflixIsAJoke: The votes are in, and a new extended interview with David Letterman is here! Did we mention Between Two Ferns: The Movi… First there was man, then there was mansplaining. https://t.co/FWREHapGJT Christina Applegate stars in the totally-no- overrated Meryl Streep Lifetime biopic: https://t.co/7jwsktHN8p @1capplegate @lifetimetv https://t.co/tsNmhtIPcO Finally, someone focusing on technology that matters https://t.co/lJhIV6Kwhk the scariest part of any scary movie is when there's a sex scene and i'm watching with my parents See how much Zach Galifianakis knows about Zach Galifianakis in this Between Two Ferns: The Movie quiz. Do any of us really know ourselves? https://t.co/AwZiXDAIrp @Netflix @NetflixIsAJoke I am powerful https://t.co/x1XJL1wSie You know those pretentious jerks that work at high end coffee shops who make you feel stupid? Yep. This is them.\n\nWatch the full video here: https://t.co/0kar5PIBah https://t.co/YZu4tTLoUE for halloween i'm dressing up as \"slutty whistleblower\" Big Bird was our biggest (and bird-iest) intern. https://t.co/5RTvJmGuvv RT @FilmDailyNews: #Netflix seems to be doing something right and bring us a movie based on the hilarious web-show #BetweenTwoFerns. Click… Will Ferrell meets the toughest cop in the world... 👶 https://t.co/gsz3wngasF The gals gab about their scariest Halloween stories... 😱\n\nw/ @BirdySoderdy @hordie @allynrachel &amp; @marissagogo https://t.co/ZeYlZgduFH RT @NetflixIsAJoke: Cinematic parallels https://t.co/oDi6YgWn3I After being locked up for 40 years, Pee-wee Herman is back for his biggest Halloween adventure EVER! https://t.co/yt35aeENXT how to pass an exam without studying https://t.co/z5zXfNCOyH A lovely couple (@MrJerryOC &amp; @RebeccaRomijn) are just looking for a haunted home to die in https://t.co/ogPVeEMpo6 RT @NetflixIsAJoke: Incredible. One of the most motivational scenes in cinematic history. https://t.co/bbuwLyMDZY RT @NetflixIsAJoke: Imagine being this calm around Peter Dinklage and/or Fabergé eggs https://t.co/mvdonXdF36 Worst Pumpkin Spice food: We beg you https://t.co/D0pNM27FPL if you love Pokémon don't watch this 😈 https://t.co/1wsyRg12iP how to do your makeup when you're possessed by an evil spirit https://t.co/60cFzlwYnz you have to talk reaaaally nice to the airplane if you want to step off the airplane https://t.co/2e9gmpGA3h RT @NetflixIsAJoke: Can't believe no one's thought of this https://t.co/CNbw6M62IC Never in my adult life have I wanted anything the way I want this crocheted Skeletor costume https://t.co/WroYz8oPmG @crochetverse Zach takes late night legend @Letterman to task for stealing his show format, in this extended interview from Between Two Ferns: The Movie (now streaming on @netflix) https://t.co/uuUMyNtyII @NetflixIsAJoke Don't trust Will Ferrell when he says Bat Fight is a game of honor and diplomacy. https://t.co/gFnhPiBY9E Me during the entirety of my work shift https://t.co/sL0TrIfZ0h POLL: Who are you rooting for in the baseball playoffs? when someone calls me instead of texting like a normal person https://t.co/4hqzY3Q8Ia Remember the 'Saved by the Bell' when Zack Morris gambled with the life of an unborn child? Zack Morris is trash. https://t.co/nLFkUBCNdz Writing music for John Mayer has its challenges:\nhttps://t.co/Ijq2UHZKbQ https://t.co/RYkbeKrjoq How did I get here https://t.co/vluYikj6bL Watch @danceswithtamis get drunk and watch 'Mean Girls' for the first time https://t.co/COvNvASIgm Today's episode of The Ron Burgundy Podcast is about getting a car right from your phone, inflatable waving tube-men, and whether or not a baby penguin actually sat in the Stanley Cup. https://t.co/3t59gWtsqh @FairTheApp @TheScottPainter @StanleyCup @MikeBolt4 RT @AM2DM: .@laurenlapkus says Keanu Reeves brought his A-game (and poetry!) to #BetweenTwoFerns: The Movie https://t.co/GoS9LMg25w Will Ferrell meets his landlord, Pearl. https://t.co/pYP88TuUYI Whatever you do...DO NOT tell Gary he's just a skeleton https://t.co/7ztt6eByaP me acting too confident before walking into a haunted house https://t.co/zPnTiyle9m Happy Mean Girls day! https://t.co/mk6v0Qj4kz The grittiest, sexiest, scariest reboot of Charlie Brown 🎃(starring the cast from @MTVteenwolf) https://t.co/27FiXVvBbI IT'S OCTOBER THIRD https://t.co/9B704Y4htC #meangirlsday Ladders get you to high places, but don't get high on them if you're getting *high* https://t.co/kI5kzczG9T Welp!! There goes my next paycheck!! https://t.co/yOX1pY43RO me on linkedin vs me on tinder https://t.co/toAkuzXd4r BACK-CHANNEL DEALS! OPEN FROM 5:15PM TO 2:30AM! \nhttps://t.co/lF5L25iUKQ Oops, we forgot :\nCapricorn: Lasting Peach Trump fuck-ups as astrological signs:\nAquarius - Moot\nPisces - Hamberder\nAries - Tim Apple\nTaurus - Covfefe\nGemini - Adam Schitt\nCancer - The United Shtates\nLeo - Smocking gun\nVirgo - Melanie\nLibra - Boarder Security\nScorpio - Unpresidented\nSagitarius - Prince of Whales so embarrassing https://t.co/Fruj6bSpdy RT @netflix: this is an absolutely perfect joke, courtesy of Between Two Ferns: The Movie https://t.co/HwIoNtU63l all day every day https://t.co/c4YGcZ2Pd2 .@actualthatdog's new music video for \"Just The Way\" is a 'Three's Company' fever dream featuring @jackblack &amp; @MayaRudolph https://t.co/twU8U8FYbN How hard can it be to keep women out of harm's way????!?!?!??! On #90DayFiance, it's apparently very hard. https://t.co/TDfXQE69Xq The grittiest, sexiest, scariest reboot of Charlie Brown 🎃 https://t.co/xD8hifQSqZ @ElizabethAnnKi6 @paulmanke6 You could always read the article and find out Is this extra as all hell? Probably. Is it also completely necessary? Absolutely https://t.co/XBRRWuH4Kd The scariest thing your kid could be for Halloween: our president 😱 https://t.co/IdQ83Y7K56 Lindsay Lohan wants to date you 😍 https://t.co/IWgFrfern5 It's a digital billboard, it was only a matter of time before someone saw its full potential https://t.co/rGyP249N9W did you know there were Goosebumps stories that were *so scary* that the publisher refused to release them?! https://t.co/1kCxaFGhMI RT @InterviewMag: \"You’re not allowed to say red-headed stepchild anymore, so you’re canceled.\" https://t.co/DRhXdlCg9y Question: if Freddy Krueger moved into your neighborhood, would you want to know? 😱 https://t.co/ITgpuYbKBp at midnight on october 1st i started playing \"monster mash\" on repeat and now everyone hates me Colton Underwood may be the *famous* virgin Bachelor, but Andy Stitzer (@SteveCarell) is the original virgin Bachelor. https://t.co/mOlMAYbYnE ATTORNEY AT PAW https://t.co/sozMSVJV2a @CFOAB The best part of Rosh Hashanah is the blowing of the shofar, the apples dipped in honey, and my mother telling me that I look like shit Are you suffering from chronic Womanhood? The cure is simple, cost effective and will make you feel like a new man!\n\nWatch the full video here: https://t.co/8lc1Ih1OQs https://t.co/LlJDYx9Heg I have never laughed harder about autumn apple picking than I did watching this season opener https://t.co/JcZFyqdqaa @nbcsnl RT @NetflixIsAJoke: Classic mistake, happens to the best of us. https://t.co/Hrd8gFFFL2 it's finally autumn and you know what that means: jumping on a huge, beautiful pile of leaves and then screaming because you landed on a dead body underneath RT @USATODAY: Zach Galifianakis knows how to embrace awkwardness. 🌿 https://t.co/dRaupIxz71 Here's something we can all agree on: https://t.co/oL6wbWQ85o When Christina Hendricks gets a job at a new office, it's unclear which is more old-fashioned: her style, her typing skills, or the office's policies toward women.\n\nWatch the full video here: https://t.co/hwTciL7c3v https://t.co/QbzVcz08IO when i carry out the trash and the recycling at the same time https://t.co/Saw0z04oFj \"Remember to recycle, or I'll turn you into a fu*king tree,\" - Captain Planet (with @DonCheadle) https://t.co/NQ9kQV4Ea2 First there was man, then there was mansplaining. https://t.co/DNBsXYB6xv This lost masterpiece of pornography was recently discovered in a woodworking shop of a Beverly Hills dentist. June Crenshaw (@KristenBell) was known as the 'sex kitten' of the Supreme Court. https://t.co/2oLXIert4I I'm laughing on the inside https://t.co/1K6yRJdnLN We asked 20 strangers to 💩 in front of each other for the 1st time ... https://t.co/crywlt3nZM Annoying Mother Starter Pack\n- “Have you gained weight?”\n- “I’ll be 90 years old by the time you give me grandkids”\n- “Did you see what I posted on Facebook today?\n- “Wish your aunt a happy birthday”\n- Don’t insult me by forgetting to take leftovers” Who knew LeBron and D-Wade were so basic? @KingJames @DwyaneWade https://t.co/RruBD0EyQg Blowing on earbuds. Video games freezing. Forgetting your f$*%ing password - again! These are but a few of the high-tech dystopic nightmares humanity actually has to deal with.\n\nWatch the full video here: https://t.co/VbrZtT2iaY https://t.co/CZFnlQAZBY NOFX's song \"Oxy Moronic\" is an addictive punk rock anthem about the highs and lows of big pharma. @NOFXband https://t.co/I4tbPK4pPZ Couldn't agree more https://t.co/RbxDaAyYan Don't call me unless its bad news... and even if it is bad news, just text me. https://t.co/i4KMh3LvK9 I second this https://t.co/xVtG2a5Tr4 RT @etalkCTV: Find out what it's like to work with @galifianakisz irl 🌿🌿 @laurenlapkus #BetweenTwoFerns https://t.co/tzIX1g2Si4 Aren't morning people the worst kind of people? (with @DeadKevinSketch) https://t.co/bJZL22Z9xu What happens in your bed when you're on vacation? 😉 https://t.co/Jdo0ckV0i6 Benedict Cumberbatch sat down with Zach Galifianakis to discuss selling out for Marvel movies, doing American accents, and why Brits love the C word. https://t.co/swCsmOj0ie  #betweentwofernsmovie This is already my new favorite show and it's not even out yet https://t.co/AGt5w4LpBT @realspaceforc Rubí is a telenovela so insane, you should probably sit down to watch this https://t.co/o7QM5qDeiK RT @NetflixIsAJoke: Incredibly enlightening interview between Zach Galifianakis and Benadick Cumberbun (sp?). Between Two Ferns: The Movie… RT @JTAnews: Zach Galifianakis Crashed the Jewish Dating Show ‘Bubbies Know Best' https://t.co/UpgyYohYG1 via @hey_alma @BubbiesKnowBest @N… Two of the worst people ever run into each other in pilates class. @elizacoupe https://t.co/bQseqHl0Vj when i sneak out of work 2 minutes early https://t.co/yyEFYEvcq5 RT @ScottAukerman: BETWEEN TWO FERNS Episode 23: BENEDICT CUMBERBATCH \nhttps://t.co/CTVf3o4A0P Remember the 'Saved by the Bell' when Zack Morris framed Slater for a hate crime? Zack Morris is trash. https://t.co/rQmGIBur54 Learn what EDM is all about, what it's like to be a producer/DJ, and even listen to Ron and Carolina throw down some pretty slick freestyle beats. https://t.co/kpFRkQowT5 @DillonFrancis RT @TheAVClub: Scott Aukerman and Lauren Lapkus made up the #BetweenTwoFerns movie as they went along https://t.co/o0TD7erJxT https://t.co/… Watch this hilarious satire \"before you go full CAPS LOCK in an article comment section\" https://t.co/6gSttWfklK @markhumphries @evanwilliams Thank god he looks the way he does though. Watch the #BetweenTwoFernsMovie, only on @Netflix. @NetflixIsAJoke https://t.co/BdOaqcr8Vf As the United States embraces a world of alternative facts under President Trump, it must also embrace alternative spelling. https://t.co/MG3p2dear5 If velvet was a person, it would be @JeffGoldblum https://t.co/UXCubD6XOj I've been sprayed https://t.co/wv0p77cnmQ Buckle up for THE MOST DRAMATIC season of \"The Millennial Bachelorette\" (with @KekePalmer) https://t.co/mhngNEWGyk Refuse to go to your mom's wedding and she'll tell everyone about your gastrointestinal trouble. As she should.  https://t.co/CDHoZz53V2 #90DayFiance I genuinely cannot wait to ask Alexa what the weather is and have Samuel L. Jackson yell \"TRY LOOKIN' THE FUCK OUTSIDE\" at me https://t.co/pe60DvX0Fn @SamuelLJackson aaaaAAAAAAAhaaaaHHHH https://t.co/nXvOFiq3t9 *Jeff Goldblum voice* There. Look at this. See? See? I'm right again. Nobody could've predicted that they would suddenly, suddenly return to the Jurassic Park franchise. https://t.co/xthYVEtndx @JeffGoldblum @LauraDern @TwoPaddocks A lot can happen in a lifetime. https://t.co/R98PAHHoTt I'm sorry, I couldn't hear you. Watch the #BetweenTwoFernsMovie, only on @Netflix. @NetflixIsAJoke https://t.co/np3wQqdJjX The choice is clear https://t.co/BXb85unXYG RT @Variety: Zach Galifianakis says Bradley Cooper doesn't mind that he called him a \"hot idiot\": \"He's the perfect man\" #BetweenTwoFerns h… This is what \"Mary Poppins\" would look like if Mrs. Doubtfire played the nanny: https://t.co/JlSmui7SqZ It kicks off in January and tickets go on sale THIS WEEK and I am FREAKING OUT https://t.co/d7yha3w38K @officialTandE RT @Variety: Zach Galifianakis explains why he tries to make his #BetweenTwoFerns guests \"feel weird\" https://t.co/sRyUZ2FKX2 This is so fucking sweet I am in physical pain https://t.co/09oN5Cyxmj @nebulami RT @THR: Netflix's feature-length version of Zach Galifianakis (@galifianakisz)'s #BetweenTwoFerns has arrived. Read the review: https://t.… Is your teen texting about losing his virginity to a pile of leaves \nLMAO: Loving my autumnal orgasm \nFML: Fucking many leaves! \nBFF: Better fuck foliage \nLOL: Leaves, oh leaves! \nSTFU: Sucking the foliage's underside \nBTW: Bury this weiner me returning home to do laundry after 2 weeks of college https://t.co/2YVwNHqGe6 If 'The Little Mermaid' was an indie film, this is what it would look like: https://t.co/ZA3Jg7eMQW Finally there is some justice https://t.co/1YzeGcSxFT RT @johnlegend: I just want everyone know that @galifianakisz is an evil, seductive man and he gets what he deserves in #BetweenTwoFernsThe… Pictures say 1,000 words but this gif says \"I want to fling this man into an active volcano\" https://t.co/axiF22zVIP @GretaThunberg What do you get when you ask Twitter to design your Emmy attire? OPTIONS. You get a WHOLE LOT OF OPTIONS https://t.co/xavq4jW5Pc @MrEmilyHeller Tag your crazy ding-dongs. Watch the #BetweenTwoFernsMovie, only on @Netflix. @NetflixIsAJoke https://t.co/zRAMSVHvjW Check out all our Halloween apparel right here \n\nhttps://t.co/oq3Ah8EEVS \n\n(and maybe even look at our other stuff too while you're there, but like only if you want to, idk it's pretty cool) It's the first official day of autumn which means you're now officially allowed to go full-tilt Halloween and no one can stop you! NO ONE!! Deck yourself out in our Halloween Collection and get spooky 🎃 https://t.co/3jvuvIMByW @nytimes @jvn ❤️❤️❤️ Your semi-annual dentist appointment is FINALLY HERE. Get HYPED for the twice-a-year experience that's basically torture. https://t.co/f3xli2U9om Me at work this morning https://t.co/Cs9rmYaaQl RT @ringer: In honor of Netflix’s #BetweenTwoFerns movie, here’s our staff on the Zach Galifianakis web series’s most memorable episodes ht… This Meat Loaf epic is the dumbest music video about breaking into a castle to take a bath https://t.co/UDQHCXazfG Just airdropped this to the entire bar https://t.co/TOlW0qr57y Dawson Leery (James Van Der Beek) set an impossibly high bar for boyfriends in the 90's. Now he's ready to fix that. @vanderjames https://t.co/nfEETPpT4s RT @vulture: We’ve ranked all 22 episodes of #BetweenTwoFerns that have been released since 2008 https://t.co/cqcV11Tmes RT @rekhalshankar: My dad overcome with pride seeing me in the #BetweenTwoFernsMovie https://t.co/JixaAh9cVA Mary Poppins needs a raise ya'll (w/ @KristenBell ) https://t.co/OPwME5xZP3 All the perfect ingredients for a memorable fall afternoon https://t.co/3Mtx74wC48 What happens when you get a flat tire in the desert? You summon music video magic and make that tire your bitch! https://t.co/THl7nWzpVv Fleetwood Mac fans explained https://t.co/d1tPatqz4B RT @nerdist: Go watch #BetweenTwoFerns The Movie, right now.  https://t.co/crB6J2NDG9 This is what the bachelor would be like if the bachelor was honest (with @DavidSpade) https://t.co/2uD0ApYdbG This dog is on a diet and HE HAS SOME THINGS TO SAY ABOUT IT https://t.co/tmvp82qnxE RT @letspainttv: Had a great time chatting with fellow cable access host Zach Galifiankis about paint, life and Between Two Ferns: The Movi… Zach talks with comedically-adjacent, bland-but-handsome Paul Rudd, in this sorta uncut extended interview from #betweentwofernsmovie - Watch now on @Netflix! @NetflixisaJoke https://t.co/M95FgYrI8h RT @bubbiesknowbest: Zach kept us thoroughly entertained when he stopped by to talk about Between Two Ferns: The Movie - especially, ah, Bu… Someone literally called it \"Burt's Bries\" https://t.co/G1AhRBE9yp RT @GretaThunberg: Fridays for future. The school strike continues! #climatestrike #klimatstrejk #FridaysForFuture https://t.co/5jej011Qtp Honest answer to an honest question. Watch #BetweenTwoFernsMovie now on @Netflix. @NetflixIsAJoke https://t.co/rTnylnabSU Eating the ocean's plastic isn't the answer, so if you actually want to get involved in the fight against climate change, check out this link to find Global Climate Strike events going on near you → https://t.co/2XZ1nD7tsK \nhttps://t.co/NkbArjNsLt #ClimateStrike TGIF baby!\n\nThank\nGod\nIt’s\nFthe weekend RT @nicsperling: Funny or Die Finds New Life in the Streaming Era. My piece on the 12-year old start-up and it’s evolution from “The Landlo… Remember the 'Saved by the Bell' when Zack Morris dumped a woman for saving his life? Zack Morris is trash. https://t.co/RWPrAzx9yj Do you need a Safe Space? See what this guy has to offer: https://t.co/f0Ufc0e1xX https://t.co/tPpzIs8ifV Which wine pairs best with funfetti cake? Find out on this week's episode of The Ron Burgundy Podcast https://t.co/rXr9o1EQIq @roniginach The Least Popular Pizza Topping In Every State https://t.co/G6CRxTn2Kg RT @jakecoyleAP: ⁦@galifianakisz⁩ and ⁦@ScottAukerman⁩ on #BetweenTwoFernsTheMovie “For me, it was just realizing ‘Hangover 4’ was never go… \"I'm half-Cajun so I'm a hot sauce guy but I'm also half-Jewish so I'm a little frightened\" https://t.co/J8430NJA8N @thecampaignbook @firstwefeast The conspiracy theories about milk are rampant. Thankfully, an intrepid dairy lawyer has dedicated his life to debunking the lies and @TheMooerReport is finally here. Read The Mooer Report here: https://t.co/mpVUlGG4yu #ad https://t.co/DJwCnpdCVV Finally, the seasonal emojis we need https://t.co/ouCYgUaO9D I can't decide https://t.co/JqoNDJnNSl Which show is better: 90 Day Fiancé or Game of Thrones? Watch @danceswithtamis get drunk and watch 'The Neverending Story' for the first time https://t.co/3t4MErOnjk If Sumit's in an arranged marriage, maybe he should have arranged to have gotten out before taking on a new girlfriend. This ain’t #SisterWives, but it is #90DayFiance. https://t.co/7RgCgeoIjN Bruno Mars is here to show you whatta man he is. https://t.co/Koklq8UFe2 If you play this at work, for all your boss knows you're just checking your email like a good diligent employee https://t.co/n34MXTwcgv @NintendoAmerica Words to live by: ‘If you make a mistake, you can always fix it with more icing.” @Kroger. #ad https://t.co/nBIf7JLCQN Kristen Bell sings a love ballad to the most important person in her life: her therapist, Jan Gray PhD (Yvette Nicole Brown). https://t.co/IMfBqPlm2T To be fair, as long as the horse was sober this shouldn't be an issue https://t.co/E9b37JUmzP cheers https://t.co/elVpoTyEFt RT @ScottAukerman: Please pardon the deluge of self-promotion this week, but I have a movie coming out Friday, and we’re all proud of it an… FRIENDS turns 25 this week, but we're still debating: was Ross the best or the worst friend? https://t.co/5qF6BYI5d5 ME: *needs a calculator to figure out the tip*\n\nME WATCHING SHARK TANK: ok 14% for $55k is an insane valuation, these guys need to take a royalty deal at $1.37 per unit and The choice is clear https://t.co/QvkokPyA2X On this day ten years ago, Greendale opened its doors to all of us. Celebrate with the best 'Community' gifs! https://t.co/80WLW23b7K @CommunityTV #community RT @UPROXX: From Bradley Cooper to \"Bart\" Pitt to Jennifer Aniston (and Tila Tequila), we revisited the most uncomfortably awkward #Between… This miniseries centers around Shawn and the demons and it's the perfect way to tide yourself over until 'The Good Place' season 4 premiere https://t.co/TtJHKODOrv @nbcthegoodplace Look out Kimmel, Fallon, Colbert, O'Brien. Galifianakis is comin' for ya. Watch the #BetweenTwoFernsMovie on @Netflix this Friday. @Netflixisajoke https://t.co/FQLDpLRvl2 annual reminder that ted cruz is younger than will smith https://t.co/er7IKHSFNo Being pregnant isn't easy, but @HilaryDuff has a secret that will make it just that little bit better. https://t.co/6Drm87OjmP You gotta applaud her vigilance https://t.co/bNj8yz7Eic Puppy see, puppy doo-doo https://t.co/r5fENhER8Z Netflix just made the announcement today, IT'S HAPPENING! IT'S REALLY HAPPENING!  https://t.co/X4UZuGnJG6 @SeinfeldTV @netflix #Seinfeld Shawn Mendes may seem sweet and polite. However, behind closed doors, he is nothing but a self-absorbed diva! @ShawnMendes https://t.co/hIevpZEg6r Learn how to make music like John Mayer:\nhttps://t.co/Ijq2UHZKbQ https://t.co/Kuc77ZGH3B me on the first day of college vs me on the last day of college https://t.co/EAlIPOyzuy Don't be fooled, vibrators can be VERY dangerous. https://t.co/Y8fEZ9J4Di Everyone shut up please https://t.co/0ytMbnF7qU Dax Shepard makes his wife Kristen Bell audition for the role of his wife @KristenBell @daxshepard @realmichaelpena https://t.co/BdoBf6R9q2 \"Handjob, Bland Job, I Don't Understand Job\" by Garfunkel &amp; Oates https://t.co/u1ZG0MIhFh Viral star Darby Souffle doesn't know anything about cooking or cannabis - so what could go wrong when she cooks with it? A sketch by the Funny Or Die Interns. https://t.co/yZUyY41GBC Learn how to best protect yourself from Donald Trump and other potential pussy grabbers. https://t.co/wgDCWfIxDL The Wire's @lancereddick is the last person you'd want running a toy store. https://t.co/P7fG1qacpY I've spent my whole life chasing the high I get when I fill my water cup with soda Charity is good... unless it goes to your head like it did for Seth Rogen. Link to full video here: https://t.co/sSNXJdtJpU @Sethrogen https://t.co/Bq6VmNpDdv This couch costs more money than I am worth, which isn't a lot but like, still\nhttps://t.co/Z3uceEdOgB Can't believe someone would actually narc on people just trying to live the dream of epic IKEA hide-and-seek\nhttps://t.co/qdDCPrYAyK We've got spoOOOooky shirts for any occasion, they probably work best for Halloween but hey if you wanna wear them for Christmas we're not gonna stop you https://t.co/mcwgeXulnA It's Friday the 13th, which means it's a good day to avoid precarious ladders and black cats, and a great day to check out our new Halloween shirts! They're 100% bad luck free, we checked. \n\nGET SPOOKY https://t.co/oq3Ah8n44k https://t.co/he3kwOZSAi Remember the 'Saved by the Bell' when Zack Morris was a scumbag politician for a free vacation? Zack Morris is trash. https://t.co/gnNp7zBDxO Einstein judging you for closing Twitter and immediately opening it again https://t.co/sKS7wdf8qh How do you shake off a bad game? What's the weirdest thing a heckler has ever said? What's the best thing about Chili's? All this and more on this episode of The Ron Burgundy Podcast @ClaytonKersh22 https://t.co/YcqydKEtQz THIS IS THE MOST CURSED THING I HAVE EVER SEEN. I'M CALLING 911 https://t.co/qPqWfKLoAI So when are we gonna see this collaboration on Sesame Street @lizzo @MeCookieMonster https://t.co/y14Yrs0GtQ when i carry in all the grocery bags in one trip https://t.co/NAC3mGXnHa John Legend reveals the naked truth about his home life. @johnlegend https://t.co/NMLcrbGysn No https://t.co/qUblRhUamv Romantic photoshoots are out and CRINGEY 80'S THEMED SHOOTS ARE IN https://t.co/55NNGby5Cc @madithewynner RT @seewhatsnext: Attention celebrities: Between Two Ferns is back on September 20. \n\nConsider yourself warned. https://t.co/6BcHwLawBI Bring back capes https://t.co/cMHds3Gd6P I want to grate cheese on Jennifer Lopez's abs https://t.co/mpR2xDmCut @jimmyfallon @JLo The best things in life are free: \n-Hugs \n-Laughter \n-Friends \n-Telling someone annoying to shut the fuck up me trying to act cool when i see my ex with someone new https://t.co/t7QuW4X6v4 Get hyped for the dentist https://t.co/J68vokZwxr On #90dayfiance, the octopus is crunchy, the lambs are soft, and I need therapy. https://t.co/koLgQBG9y9 I don't even wanna tell you how much they cost https://t.co/sn4b1ZL9Xy K https://t.co/lJ1WuCFRmG Holy mother of naps https://t.co/0rVeRZtU1B @UPLIFTDesk my face when i see how much the new iphone costs https://t.co/mbxHZBcKgK Fun fact: @UzoAduba auditioned for *a few* other roles for Orange Is The New Black. https://t.co/OMqCQ68YTv What's your favorite Letterkenny moment? And if you don't have one that means you need to start watching this show IMMEDIATELY https://t.co/gkQDLz1eP9 @LetterkennyProb The only thing better than a child impersonating Trump is when that child LITERALLY HAS TRUMP'S FACE https://t.co/NydjMI0PmU @drfakenstein RT @ScottAukerman: Here it is! The trailer for BETWEEN TWO FERNS: THE MOVIE, out September 20 worldwide! https://t.co/Pu4gaECw96 \"The famous actor\" https://t.co/z6EhwtE0Rw Adam Sandler turns 53 today, celebrate this legend with some gifs of his funniest moments! https://t.co/LPBAWWDi6j @AdamSandler Being pissed off is making me rich https://t.co/IHWsee2zFS \"Zack Morris Is Trash\" returns this week! Catch up on your favorite episodes before the new season starts: https://t.co/zBEak7Tt4E https://t.co/wqHketlZuH Lindsay Lohan wants to date you https://t.co/fjr2osB6RG RT @laurenlapkus: The trailer is here!!!! https://t.co/SJYLLjfTBz *anxiety has entered the chat https://t.co/Vhpnc2XoEO RT if you're still watching football in your pajamas and you smell terrible It seems friendlier when it's spelled out in hot dogs https://t.co/xEzcG8ZgQS Don't get sick of your friend just because they're sick: https://t.co/NuknKTcfin Expecting a baby really messes with your head. \nhttps://t.co/E3KADScgZf @Convos2yrold @iMattClarke @DMilchard When my shit is red // But I remember that I ate beets yesterday https://t.co/b8Gr5aqgZt Ladders get you to high places, but don't get high on them if you're getting high. https://t.co/60qc4pyetD Okay so you might not NEED them but c'mon they're so good \nhttps://t.co/UPOPny9HOj #chickensocks Challenge: Can you spell any of these words? No cheating stunads! @KellyRipa https://t.co/EJm7wp6qT2 It's a bird, it's a plane, it's a guy that didn't throw up https://t.co/dY8AJ0Oqxu Aaaahhhhhhhhh annnnnxiiiiiiieeeettttyyyyyyyyyyy.\nhttps://t.co/5DsvG1XRrE @modern_mantras @danzevin This is a Meryl Streep level performance\nhttps://t.co/USbB4P1Iki Happy Friday https://t.co/vHwe5U45zi @jenieuwedocent horrifying The president falsified hurricane charts with a Sharpie and has actually lost his mind but hey at least we have memes https://t.co/zURYB1dolH #SharpieGate 🤣😂😎 https://t.co/YYcagfUqpT Sometimes the thing you're searching for your whole life is a space pirate with a really cool helmet. https://t.co/K0jxw2VxsZ Every Friday https://t.co/ocfzjqbWSl Wut? https://t.co/3ESd9Bq92j Lets be honest... 😈 https://t.co/PDusBch0mQ Should have eaten a panini https://t.co/De8T3BUm1j Raising children is no small task, that's why Ron and Carolina brought in an expert to talk about it\nhttps://t.co/OBgVWZanjH Man, dip is so freakin’ good. Try this one for fantasy football acclaim. @kroger #ad https://t.co/X8tItOsfBY Telenovelas are Hell merch is now available! https://t.co/qID9igmFFu https://t.co/BqTu7GUEGx If he taught a class on impressions or even how to annihilate hot sauce covered wings I would sign up for both https://t.co/ae7a9Bzt1K @JayPharoah @firstwefeast RT @NYMag: Watch the trailer for \"Between Two Ferns: The Movie,\" featuring Matthew McConaughey, David Letterman, \"hot idiot\" Jon Hamm, and… @chrissyteigen https://t.co/iZxlRr7q1b SEVEN DEADLY SINS\n\n- Lust\n- Gluttony\n- Greed\n- Sloth\n- Wrath\n- Envy\n- Taking your shoes off on a plane @piktore @Jellybean_Negro OH MY GODDDDDD ME: *drops a piece of food*\n\nMY DOG: https://t.co/lIOFmQ8VEa @ludwikapaleta @viethmichelle  we love you Amigas y Rivales is a telenovela that will make you never want to have kids https://t.co/60upZQvFkS When someone gives me a compliment https://t.co/bNaMtaqNUk ENOUGH IS ENOUGH https://t.co/mFNVBuoQN0 Could this be the future of Safe Spaces? Watch the full video here: https://t.co/ktRA6rm51X Celebrate this incredible news with a whole whack of the best Grace and Frankie gifs https://t.co/v4xHmQDUhC Leave your fantasy football league in the dust with this Lucky 7-Layer Dip from @Kroger. #ad https://t.co/d3OvVSSFPV I don't know what we did to deserve Jeff Goldblum. https://t.co/IpI3mcgVAW Who is the hottest Chris? instant messaging was invented so i would never have to talk to or look at my co-workers Mariah Carey's \"Heartbreaker\" is the dumbest music video about fighting your evil twin in a bathroom https://t.co/ZW0IQdWSBY no drug gets you as high as cleaning the dryer lint trap This week's #90DayFiance has left us with a lot to process, folks. https://t.co/9Tio6lun2S I promised myself I wouldn't cry but it's just so beautiful https://t.co/BYHEk4uZ2N https://t.co/WvhRdg7pNy https://t.co/3T98JIVmsI GET OUT https://t.co/FyfQW9FMfX @chrissyteigen https://t.co/NPhyYU2yKd Finally you'll be able to send your babies off to sleep with the soothing, soothing sound of Larry David https://t.co/b9s20VMeir @miZfUckinglORia @NetflixIsAJoke https://t.co/f7wmBGM4iQ Bobby Mooer is a champion of milk, a jackhammer of justice and a deacon of dairy. He’s spent a lifetime in the industry debunking the myths and rumors against milk. The Mooer Report is coming. @TheMooerReport #ad https://t.co/fTg4BvUauf *sesame street theme song plays*\n\nthree year old me: https://t.co/fatT7XDjL2 @NetflixIsAJoke Peeing our pants laughing @moonalmalka1 Honestly, yes RANDOM GUY: You should smile more \nME: https://t.co/H2jUvw5vHR RT @NetflixIsAJoke: Zach Galifianakis. Two ferns. A lot of famous people. \n\nBetween Two Ferns: The Movie premieres September 20th. https://… Those cash booths, except instead of money flying around inside it's…actually...screw this joke…there’s nothing better than money. Damn https://t.co/bqUiu5PoZl A friendly reminder from Comcast: https://t.co/KfAfqiU1s5 Keanu Reeves is 55 today, gaze upon these gifs and remember that we do not deserve him https://t.co/mDtlaLJlsU #happybirthdayKeanu Football is coming back! What's your favorite part of a football? Throwback video: don't trust Will Ferrell when he says Bat Fight is a game of honor and diplomacy @MrCraigRobinson https://t.co/eDZu2OaN6I Today I labored to hold in a fart inside a crowded elevator Whoever invented Sunday depression did not take into account that Labor Day could fall on a Monday Alison Brie finds out what it takes to be Dave Franco's dream girl... 😱 @alisonbrie @oliviamunn https://t.co/hEkkkDmFmG WHAT I HOPE TO FIND IN THE FRIDGE: spaghetti and meatballs\n\nWHAT I ACTUALLY FIND: https://t.co/PL7HY8qXBp When you have to face the fact that Donald Trump is your president, try \"Yelling F*ck,\" the new FDA-approved drug for presidential relief. https://t.co/mFK7BEejSu Hear me out: a kabob but with hard boiled eggs Would you watch The Handman's Tale? Watch the full trailer here: https://t.co/Sd7ZDeHICa https://t.co/P2hhEFmS0k Security doesn't get tighter than Ron Livingston.\n\nWatch the full video here: https://t.co/SUhW9Vhg9E https://t.co/YmHYLBW0I1 Dave Franco and Chris Mintz-Plasse talk way too dirty... @MintzPlasse https://t.co/y9hC9k4nm1 No two booty calls are exactly the same. https://t.co/5OwrFt3nsW @AnthonyTroli What's your favorite summer snack: Throwback to that time Will Ferrell met his landlord, Pearl. https://t.co/AJOjTd3wae I wish someone would invent a vending machine that sells self confidence The only thing more relaxing than a scented candle is a scented candle that literally says \"leave me the fuck alone I'm meditating\"\nhttps://t.co/s6bVCT0P3B Zach needed a confidence boost - so he decided to do his stand-up set for a bunch of preschoolers https://t.co/gdFll8KWhk John Mayer can't relate to not getting the girl:\nhttps://t.co/Ijq2UHZKbQ https://t.co/kx3gHCa2vD My gravestone: https://t.co/brk7T134ya Remember the '7th Heaven' with the marijuana murder mystery? It was a very special episode. https://t.co/wSGspMXPJO This is the last known photo of my absent father as he waved goodbye to me. If you recognize this hand, please holler. https://t.co/fFKIt15TkZ You've got a brain in your noggin but do you actually know what's going on in there?? Ron Burgundy's here to get some answers @drmarcmilstein https://t.co/NfrmM5ISZQ Bryan Cranston will not be messed around with.\n\nWatch the full video here: https://t.co/OIGuan0l39 https://t.co/GtyqsfOhZb Signs you're dehydrated:\n-When you pee air comes out\n-You can file your nails with your tongue\n-Your bones get crumbly\n-You can knit a scarf with your saliva Someone should make sure Pole from #90DayFiance isn't in the Amazon right now. Just sayin... he's an arsonist. https://t.co/DVbhj1QBVy OTHER PEOPLE'S CARS: Baby on board!\n\nMY CAR: Depressed, single person on board! At the ‘Depression Olympics,’ staying in bed can win you a gold medal, but it’s not as easy as it looks. https://t.co/IAYWfKuvGj I have never laughed so hard at typos in my entire life https://t.co/T5jGEXvRXL How did we ever survive such a vile controversy https://t.co/MuJ3Tn61qr What happens in your bed when you're on vacation? https://t.co/e0zRXJhrk5 This is the kind of high-end fashion I like to see https://t.co/XhlQINOzS5 @toadhatguy You learn something new every day. Thank you @TVsAndyDaly for your curiosity and @cobijones for giving us the facts. #ad @heineken_us https://t.co/sSPNgmK7mi burps are angels that briefly live inside our bodies You severely underestimate my apathy\nhttps://t.co/amg4fWdYgQ Be careful around Seth Rogen when he's being charitable. Watch the full video here: https://t.co/sSNXJdLkOu @Sethrogen https://t.co/d0EdN0mIWv I'm laughing so hard I'm gonna puke, this is the best day of my life\nhttps://t.co/hGDeLMHGTM We love you @MissyElliott @lizzo They were so amazing I feel like I owe them a gift basket or something https://t.co/mSXKlZzFYm He’s not wrong. #ad @heineken_us https://t.co/awHYiWDETR @MATTLOXLEY Nailed it MY MOM: Are you high?\n\nME: https://t.co/aprdPxvJtn More like @BillNye the Soccer Guy LOL #ad @heineken_us https://t.co/rfKxHGwXBF Dear @Jokoy, this is the reason we watch soccer #ad @heineken_us https://t.co/HROS2cbQcQ Throwback to when The Axis of Awesome taught us how to write a love song @axisofawesome https://t.co/xMfghBWT3j He hasn't hosted SNL in 35 YEARS!! THIRTY! FIVE! YEARS! DECEMBER PLEASE HURRY https://t.co/0YEshNK1Nf @nbcsnl If you haven't already, tune into the @JerryOSho! Each episode features a new guest, hot takes on the latest pop culture news, funny sketches, and MORE! https://t.co/DGqvF9cjmn If anyone needs me I'll be sitting alone in a dark room reflecting on the fact that I just had to write this headline https://t.co/y1aK0m4cjm #NukeAHurricane It’s not a fantasy soccer league unless you have at least one friend who’s as committed as this guy. #ad @heineken_us https://t.co/NbKcLJCOYp @samanthamorell Pearl doesn’t age @LoveLolaHeart @barrheadnews woah, that backpack rules Happy Monday, she looks how all of us feel https://t.co/WpUGNQABD1 @barrheadnews .@JoKoy absolutely loses his mind calling this goal with @TVsAndyDaly &amp; @CobiJones during the LA rivalry game! #ad @heineken https://t.co/eLF4fLwrbc Throwback to the time Will Ferrell met the toughest cop in the world... 👶 https://t.co/IHl3yKKmtl @faxanadonts @Heineken_US We agree - great graphic! @Heineken_US special guest @BillNye is in the house!! https://t.co/fkE8fp4jGl Get the funniest commentary of FS1’s LAFC vs LA Galaxy game with comedian Andy Daly and MLS great Cobi Jones. Brought to you by @heineken_us #ad https://t.co/n5sJ0uPlyL Join Funny Or Die TONIGHT as hosts Andy Daly and Cobi Jones kickoff the Heineken Announcer Remix comedy show featuring celebrity guests, live during the LAFC vs. LA Galaxy match. @heineken_us @UPROXX @cobijones #ad https://t.co/Rhmuj18RDv Introvert: the only fragrance that no one else will smell https://t.co/05fIzWAssY When i start to cuss and realize there’s a child in my presence https://t.co/GpiCYcQfts The first \"Billy on the Street\" video was filmed 15 years ago. Since then, the show has brought us so many quotable lines and laugh-out-loud moments. Congrats on the Emmy nomination Billy! @billyeichner https://t.co/jVWBZknaf1 The Heineken Announcer Remix with @TVsAndyDaly and @CobiJones is this Sunday on Funny Or Die! Watch us live during the Heineken Rivalry Week matchup between LAFC and LA Galaxy! #ad https://t.co/6WfnLvdyxY @Andyleisen Awwwww... I... am so happy https://t.co/jrzrkEOwlW @dandrezner we agree - thank you!! Jerry O' is back on Monday with all-new episodes! https://t.co/NlqI60zRjs @JerryOShow @MrJerryOC SUNDAY: It’s the Heineken Announcer Remix! Join us on Facebook Live as celebrity announcers Andy Daly &amp; Cobi Jones commentate live on FS1's LAFC vs. LA Galaxy game as part of the MLS Heineken Rivalry Week! @Heineken_US #ad https://t.co/RJvx1AO3ww Remember the '7th Heaven' when the dad got shot and blamed video games? It was a very special episode. https://t.co/0QXeBWHzzy \"It’s always a good idea to demonstrate to your coworkers that you are capable of withstanding a tremendous amount of pain\" https://t.co/2Xm83jbxw9 @Nick_Offerman @TheGrimHEEP bigfooot!!! THE BETRAYAL https://t.co/J78nRUgFaC Just airdropped this to the entire bar https://t.co/weWWspGDQ9 Who's better to talk about American history and politics than someone who literally wrote the books on it? https://t.co/XgvtkwtocI @BurgundyPodcast @sheepdog1018 @sheenaniganz @Stranger_Things @alwayssunny damn it The Stranger Things gang discover it’s always sunny in Hawkins. @Stranger_Things @alwayssunny https://t.co/DlnIH3LKhy Not to be dramatic but if this happened to me I'd move to a new country https://t.co/hc2JdUtNN2 @nate287897 I'm trying to dream big here Wow don't you all just love art? https://t.co/6hF23I068b My dream is to eat at the little table that comes on top of pizza https://t.co/JLaV1BqtmC @LannisterTwinz @jvn @IAMLenaHeadey @GameOfThrones SHE'S READY Knows how to cook, shops at @Kroger, AND speaks French? Jeff Goldblum is GOALS. #ad https://t.co/o20O3ASm4n Jonathan Van Ness &amp; Lena Headey dish about all the Game of Thrones Emmy nominations @jvn @IAMLenaHeadey @GameOfThrones https://t.co/PbLIT6AwM7 @DancesWithTamis @KarenKilgariff @GHardstark @2DopeQueens @melissabroder @jvn what does 69 mean? Trae Crowder gets a crash course on getting back to nature: https://t.co/ir2SyiVVvL https://t.co/eivs2q9TrZ @JerryOShow @JimGaffigan https://t.co/1DvXqNgwkb If you're tired of trying to find fun and interesting stuff to listen to on your own, look no further, we found some cool podcasts for you https://t.co/uBDSQYzWiv @KarenKilgariff @GHardstark @2DopeQueens @DancesWithTamis @melissabroder @jvn @RebeccaADeLeon that jingle is magic @martyherzz rest in peace Happy birthday 'Saved by the Bell'! But not you, Zack Morris https://t.co/iXNB1u8Rya #savedbythebell Drascilla is concocting spells because none of the men have jobs on this week's 90 Day Fiance. https://t.co/eQQtZTefbI #90DayFiance A robot watched Avengers Endgame and here's what it had to say https://t.co/LOrVvBdBUc If 'Superbad' was a person they still wouldn't be old enough to buy booze for their party, so here are some gifs to celebrate instead https://t.co/N1b7GLmSMM @Sethrogen @evandgoldberg @JonahHill For your consideration: https://t.co/kSoKaDdA5p (Please pass beers responsibly) https://t.co/nFzdwtkyNv This public artwork is 16 feet tall and must be defeated before it's too late https://t.co/jDKldRhuP8 https://t.co/YVAa9CZxzB https://t.co/o9UTxhBPiO @JerryOShow All jokes aside, you are truly a magical entertainment stallion @MrJerryOC 💕 Thank you @wendys for these adorable bacon and jalapeño accessories. They are 🔥 #ad https://t.co/ddYC2LZGih Frasier https://t.co/aFYiqYyKYl TBH, we're not 100% if we're doing it right either 🤷‍♀️@garfunkeloates https://t.co/eYTenQewAN Finally it's safe to be a woman in the office!\n\nWatch more: https://t.co/f0Ufc0vCWx https://t.co/ZLizITNpbz The Handman's Tale. Coming soon to DudeHulu.\n\nWatch the full trailer here: https://t.co/Sd7ZDeZk0K https://t.co/TpGdhaKaMv Remember that time Jennette McCurdy got real dirty? @jennettemccurdy https://t.co/HtQ8sHMZyN @dudleyjoshua @iHeartRadio https://t.co/fb0bopOIiP https://t.co/MvGUxATiWK https://t.co/bXUrWWWZMP Finally an answer to the age-old question, does John Travolta do the best John Travolta \n https://t.co/eaUC0qpElA @jimmyfallon Did you know that Bradley Whitford (Get Out, The West Wing) is one of Hollywood's best Emotional Stuntmen? @WhitfordBradley https://t.co/GtKyEAvNfQ We’re backstage at Baconfest with a behind-the-scenes look at what goes into perfecting @Wendys bacon #ad https://t.co/QoxDehbxOQ Remember the '7th Heaven' with the developmentally disabled glow-in-the-dark puppeteer? It was a very special episode. https://t.co/F3B2aS8739 We love seeing marital feuds happen on live television: https://t.co/MC3OLWk5WN For real though this alpaca's got moves https://t.co/llM26A8VSJ Gad Elmaleh Struggles with U.S. Customs and Border Patrol (w/ Ron Livingston) @gadelmaleh https://t.co/SK5hBVp8GF it’s been a while, how about a rematch? :) @markwahlberg This was the ultimate battle of terrible dad jokes and I both hate and love every second of it https://t.co/WlVy8kOc29 What's Ron Burgundy's email password? What are hackers? Should we fear robots? Get answers to all these questions and more in this episode of The Ron Burgundy Podcast https://t.co/N8nFMG1DEE @BurgundyPodcast This man slays at everything he does: https://t.co/RTYv2Qdmui Bella Thorne and Mae Whitman star in Disney's latest live-action adaptation of an animated movie. Because the world needs that. @bellathorne @maebirdwing https://t.co/LnwcFtLGus Did you know that @JerryOShow is the pop culture king? https://t.co/PynplIzkRt Wow the interspecies sexual tension is UNMISTAKABLE https://t.co/ZC8odX5uNW This is basically a roller coaster for the environment and I am losing my mind https://t.co/ik3X2RlFMX @JustWhooshh Cheese Monger is actually Latin for ‘the big cheese’ @Kroger #ad https://t.co/9ifPCZy8Rk There has to be a law against this https://t.co/0w2rVJP4yw These influencers show off the hottest @Wendys Baconfest fashions, including adorable bacon print scrunchies and heels. #sponsored https://t.co/M3ovWTEopQ You're doing awesome @MrJerryOC - we're looking forward to today's @JerryOShow ! https://t.co/4GzRwhech1 The John Mayer method of writing a love song:\nhttps://t.co/Ijq2UIhl3o https://t.co/J3KC1zj4hH we look forward to the rematch @allainsenpai @robthemeadows @bricheeseyy Sometimes the internet is so good https://t.co/OR4qLXPsOp Congratulations on your new Santa @LevarStoney Uhhh, thanks I guess? https://t.co/7hHpuIluIQ The Quesadilla Challenge is a challenge where you make me a quesadilla and I eat it Pole needs to fly the chicken coop, learn Portuguese, and get a job... There are so many reasons why #90DayFiance makes me livid. https://t.co/Y2DnADvYV4 A robot watched Shrek and this is what it had to say https://t.co/wDbEQNuReR TODAY: The Real Housewives of Orange County​ will be stopping by The Jerry O​ Show! #RHOC @JerryOShow @TamraBarney @ShannonBeador @vgunvalson https://t.co/0ezPOmMe8p *SOBBING* THEY'VE DONE IT..... THEY'VE FINALLY DONE IT https://t.co/IEyglBDjf4 @jackblack Never take advantage of the man with no sense of smell.\n\nWatch the full video here: https://t.co/OIGuanhVUH https://t.co/kobxiAuFVz This \"all-kid audience\" episode will crack you up no matter how old you are https://t.co/rmLFZu7SEp @ConanOBrien @TeamCoco RT @JerryOShow: 10-minutes before the show and @MrJerryOC didn't know what to wear! https://t.co/NPfhPnwExB A behind the scenes look @Wendys version of a music festival: BACONFEST #ad https://t.co/0f9CmfKlCI The @JerryOShow premieres today! Don't miss it! https://t.co/o1ekhgFebO Beware Seth Rogen after he has given to charity.\n\nWatch the full video here: https://t.co/sSNXJdLkOu https://t.co/FKrFN5vGSs This is the walk of no shame with @DaRealAmberRose https://t.co/Eqyo3oyGEY This retreat has little to do with environmentalism: https://t.co/ir2SyjdwUl https://t.co/qfKyRTcvmT 🙋‍ https://t.co/xakzx2Bumi Who are you to stop Natasha Lyonne from being the Beetlejuice? Watch more: https://t.co/yfCa12DNSk https://t.co/7qkqZxBD1J Remember the '7th Heaven' with the bulimic entrapment dinner and cult brainwashing? It was a very special episode. https://t.co/JL4Yw6CCn1 Ron Burgundy brought a surprise guest to @LateNightSeth and things got a little heated... https://t.co/khhhBjnsXO tbh, we could watch Ron Burgundy &amp; @jimmyfallon do rapid fire questions all day https://t.co/kG9PVfRuvb Green Shirt Guy is all of us https://t.co/AxF7wA3U3h Ron Burgundy being surprised with WILD ANIMALS on @latelateshow is exactly what the internet needs rn https://t.co/QST5B7hTL8 She is so powerful https://t.co/PlUU4CXNlY @firstwefeast @KristenBell RT @people: Jerry O'Connell Reveals His Dream Jerry O Talk Show Guest: Meghan Markle! https://t.co/u4facMds0B @people Wow this is so great!! Not only did Ron Burgundy appear on every late night talk show last night, he also stole something from each set/studio. (Shhh, don't tell anyone) @JimmyKimmelLive @FallonTonight @LateNightSeth @colbertlateshow @latelateshow https://t.co/5i4JgmwhGn someBODY once told me https://t.co/ddw8LXla0g Ron Burgundy revealed his beef with Shawn Mendes during his standup set on @FallonTonight https://t.co/qutU4dZK3h Ron Burgundy was the life of the party at @colbertlateshow https://t.co/OADk42jj2U The biggest story of 2019, according to Ron Burgundy: https://t.co/JqPsh3YV5X RT @TeamCoco: Watch Legendary anchorman Ron Burgundy try his hand at prop comedy. https://t.co/3taAD6oe6P #CONAN https://t.co/2eymDKbuaN During his late night marathon, Ron Burgundy dropped by @JimmyKimmelLive and didn't disappoint. https://t.co/EUXsUyAT19 Everywhere in the same night! Is Ron Burgundy the new Santa Claus? We're not saying no, but we're not NOT saying no. https://t.co/M6IRSEMRvv And you'll never guess which character he plays https://t.co/aQDiZmrERf @SnoopDogg RT @Slate: When sitcoms get serious, the results can be hilarious. https://t.co/kNIYcUcq8b Leave the original alone, ya filthy animals! https://t.co/oaa7eWDJ6U @IncredibleCulk Hip-hop mogul Rick Ross lost a bunch of weight. Now he's selling his own workout tape called #ROSSFIT, so you can lose weight like a hood billionaire too! https://t.co/YtAq9aYs07 Tell your representative how you feel on this issue. Call the Capitol switchboard at (202)-224-3121, and ask to be connected with your local representative in the House or Senate, and you'll be transferred to their office. Mass shootings shouldn't be common. https://t.co/7RQHrLP1mQ This is either society's highest or lowest point and I can't decide which https://t.co/xpXMPCqlon Manny Pacquiao becomes a pro wrestler with a little help from the late Garry Shandling: https://t.co/86m2twKqg8 https://t.co/1V0vu3M1GQ It's like a giant bouncy-house for adults except you don't bounce you just get drunk https://t.co/uqeCtPpVeT Lookin' good Jerry (past &amp; present) 😎\n\nWe can't wait for the @JerryOShow to premiere on August 12th! https://t.co/fV9FBvnSBd The Ferrari-driving, embroidered-jeans wearing gun designer who loves to Juul is reality television perfection https://t.co/9ZDkc1NiIW #90DayFiance @JerryOShow https://t.co/rK4ZkG1uyT Jeff Goldblum with an assist from Regina Hall! @kroger #ad https://t.co/46TX9Nkia9 Bruno Mars is here to show you whatta man he is. https://t.co/04vsaogwoQ The fact that there was a papa roach implies that there were also a grandma and grandpa roach and probably an uncle roach too For anyone who identifies with the quote “I am not a successful adult. I don’t eat vegetables and/or take care of myself\" more than they'd like to admit https://t.co/358paK7pGf My gravestone: https://t.co/99cSA8mw79 The 'Shaun of the Dead' stars are coming back with a brand new original series as paranormal investigators and it sounds SO COOL https://t.co/ADVL4L8iDC When was the last time you saw your dad jump? These four people got to experience the unimaginable: Dads jumping. https://t.co/olTaJITGNX Your financial future can seem intimidating. Check out @ORSaves and learn how they can help with #saving towards #retirement.  Watch the full video here: https://t.co/uZHJd26taa and don't miss the cameo by Oregon @TreasurerRead. When my parents say “Well I just hope you’re putting some money away for your future. Are you?” #ad\n\nMe out loud: Yep!\n\nMe mentally: https://t.co/gAdqS0GfGn BASIC: a 6 foot long party sub\n\nGENIUS: a 6 foot long party taco Every Trump speech feels like you're trapped in a car with him https://t.co/jU23wh858L Waka Flocka Flame announces his candidacy to replace John Boehner and preside over the House of Representatives https://t.co/xvOy9J74AY Who else could go for some Rum Ham right about now https://t.co/4v2DDk3PGi Please help....my feral hogs. They're sick. https://t.co/CSc7HmRHEp GAMERS OF THE 1990's, REJOICE https://t.co/NPHZZEga6D If I was forced to live in deserted island and was allowed to bring only one object, I'd bring a boat so I could immediately sail back home Fired Up with @bradjenkins gives an insider’s view into the hearts and minds of political leaders, artists, and everyday heroes. Plus, he interviews cool people - like @parkrandall https://t.co/Ft31cUl4fy Kristen Bell sings a love ballad to the most important person in her life, her therapist Jan Gray PhD (Yvette Nicole Brown). https://t.co/ij4BaACP9C @A_StrangeGuy We have t-shirts featuring a fully colored logo as well! https://t.co/ei2lgS8gsO Know who your real friends are.\n\nWatch the full video here: https://t.co/2YpoxiyXtJ https://t.co/QcMRlr0o99 Do regular tampons fail to contain your epic periods? @JillianMichaels recommends Tampax Titanium to annihilate your flow. https://t.co/v0ZGZ2Z3tN We have a brand new store! Filled with brand new shirts! We made them! They’re good for wearing! Now featuring arm holes! https://t.co/hWPkuQZib6 https://t.co/UeApDeSyuq \"I love my complexion, so I gotta use protection!\" - SPF 💯 😎with @ninadobrev &amp; @nicholasbraun https://t.co/19fHja7NO3 If you've ever wondered just how much harassment men go through when walking the streets of New York City alone, now you know. https://t.co/ouVcoSzVNg How dare you. How DARE you. https://t.co/iIoIBQy30T I'M IN A GLASS CASE OF EMOTION https://t.co/k7OwGaiqvf @MrJerryOC @WendyWilliams @JerryOShow https://t.co/Y9EP5CHCL9 This roadie is so good Tenacious D gave him his own music video https://t.co/wOF4pSvGnC Lying on a hotel room floor with a flute of Prosecco being smothered by puppies is how I wanna go out https://t.co/gK2hNz5gi4 Moms posting memes on Facebook like: https://t.co/KGlmO8ejRY Remember the '7th Heaven' when Matt got his car stolen by a pregnant teen? It was a very special episode. https://t.co/3keX5wmMVz Did you know you need a license to be a proper F Boi?\n\nWatch the full video here: https://t.co/cLGVcsPFxf https://t.co/SsONFZm1rq This is a crime https://t.co/qVxuYvLkmH ME: I'm going to a fancy wedding this weekend and I NEED to get my nails done.\n\nME, THE DAY OF THE WEDDING: https://t.co/UM25AZvKed fuck now \"Smooth\" is stuck in my head SPOUSE: whats my birthday?\nME: uh\nSPOUSE: what are all the words to Santana's \"Smooth\" Feat. Rob Thomas?\nME: Man, it's a hot one / Like seven inches from the midday sun / Well, I hear you whisp Life is a BBQ. Crush it with this sauce. @Kroger #ad https://t.co/dRgln9VN9Z NSYNC's \"I Drive Myself Crazy\" is the dumbest music video about punching a TV https://t.co/6ZKEIJVEIH Finally a safe space for women!\n\nWatch the full video here: https://t.co/f0Ufc0e1xX https://t.co/SKB0lcCExm God has left the chat https://t.co/vjJrJP8rjk \"Hey Siri - remind us to start watching the 'Jerry O' show starting on August 12th.\" https://t.co/Evi0tIrw2A Sharks have no business being this adorable and goddamn I love it so much https://t.co/1gBvOPqiov (art by @elclimo) it's so hot right now that i might slam my foot with a hammer so i can enjoy air conditioning at the hospital This week's episode is boring and, yet, I still have a lot to say. https://t.co/roxE0xnH6f Between 11 Ferns https://t.co/39MyKb2s5m Don’t let Gary stop you from having the best ribs on the block. @Kroger #ad https://t.co/82VdUdi5v1 *tim ryan quietly holding this sign in the back row of a lil jon concert* https://t.co/FS6Y41ylCH SWEET, SWEET RELIEF https://t.co/bgYmaCCIxp Maverick is not prepared to learn the ways of the throat rip. https://t.co/V1d9RgFdtZ The spinoff to Handmaid's Tale is a little over the top. \n\nWatch more here: https://t.co/Sd7ZDeZk0K https://t.co/kA0NkMcvtc Nick Offerman 'Cats' would feature songs like \"I Know What I'm About, Son\" and \"The Naming of Breakfast Foods\" https://t.co/UwZ42rIoEs @Nick_Offerman The live action remake of Step Brothers looks amazing https://t.co/9s1eiAjc3Q Lil Nas X // Big Nas X https://t.co/0y1A2wAzeu SEVEN DEADLY SINS\n\n- pride\n- greed\n- lust\n- envy\n- wrath\n- gluttony\n- when my mom comments on all my facebook posts I mean, if your arm's not gonna fall off then there's probably time for a beer https://t.co/a80aAxmDR2 @SharkWeek People have been spending $50 on candles like this lately https://t.co/pCR4aik7PO I laughed so hard I choked but to be fair this is probably what my singing sounds like https://t.co/oRIlQAx8ya As the United States embraces a world of alternative facts under President Trump, it must also embrace alternative spelling. https://t.co/r1whzmjxNL The board game that doesn't require a board https://t.co/1F4guTW3ln Sometimes they ask you the strangest questions: https://t.co/SUhW9UZEL4 https://t.co/aaKMwyR1jB John Mayer wants authenticity in his love songs.\n\nWatch the full video here: https://t.co/Ijq2UIhl3o https://t.co/PeQCpy9HuM You've heard of baby shark... but have you heard of SHARKLUMBO!? https://t.co/Ej09hGtdJD We asked 20 strangers to shit in front of each other for the first time ... https://t.co/fSN8MTN1BL this weekend i am bravely attempting the Sit On The Couch And Do Nothing For 48 Hours Challenge Knight Blade!\nThe greatest show you never saw!\n\nWatch it here: https://t.co/8HoolguxzV https://t.co/siMZhlQFlx Signs of a concussion:\n\n- You see little birdies and stars everywhere\n- You feel real dumb\n- Your brain melts a little\n- You forget how to spell the word potato Would you take advantage of someone with no sense of smell?\n\nLink to full video here: https://t.co/OIGuanhVUH https://t.co/rreJwb6lVz \"Hey so the craziest thing happened, someone got into the kitchen while you were gone, I dunno who though\" https://t.co/8sX6DtUZlA This is honestly genius, I want every pair https://t.co/YTOg3sLfl1 @SamTheCobra @ABeautifulDay ❤️🌹🎶 https://t.co/7522PCpRWa https://t.co/ONvOWaW7Ir Remember the 'Full House' when cigarettes were cool and Steph was a loser? It was a very special episode. https://t.co/Sc8VLPuUsZ Why is this not in the Olympics https://t.co/sZxFTHPaRN I was born to adore baby sloths Trae Crowder (The Liberal Redneck), Drew Morgan, and Corey Ryan Forrester spend a little time in the Poconos learning what it means to be a gay naturist. https://t.co/ir2SyjdwUl @traecrowder @coreyRforrester @averagedrew https://t.co/rKdCwRlBEO Congratulations to our very own @cottoncandaddy for managing to be the last person on earth to write about her own story The ID was fake but this means that Thor is now officially from Canada and none of you can convince me otherwise https://t.co/aC0XxdsV4v just airdropped this to the entire bar https://t.co/HDY6486Dub \"You got your father's dead eyes.\" https://t.co/zwQVVk9nJT Chris Hemsworth squishing Rocket into his \"Fat Thor\" belly is an image I didn't know I needed https://t.co/GStXlbqacY Fridge pawning, toenail clipping, awkward proposing... The stuff we see on 90 Day Fiancé is truly amazing. https://t.co/PDSX4P7Qcu I just hope it doesn't become a regular guest on his show https://t.co/QOcKy1qAkW It’s always good to have a friend named Tony. It’s even better when that Tony is the king of produce @kroger #ad https://t.co/0oGGCvCP0J You will get an email today we all had a crush on guys with this haircut https://t.co/107GQWqOlF Natasha Lyonne was born to play Beetlejuice: https://t.co/yfCa12DNSk https://t.co/tjkzYMuKS2 I wish I could describe the level of joy this gave me https://t.co/rlcL5MGerz @SHAQ How many cups of coffee have you had today? I'm going to be laughing about this for the rest of the day https://t.co/4drY0qXe61 @TreasurerRead has a firm handshake. @ORSaves can help with #retirementsavings. Watch the full video here https://t.co/uZHJd26taa 50 Cent       Pioneers headed West\n\n                   🤝\n\n   Get rich or die trying #ad https://t.co/FYwS3uWx3b How the hell are you supposed to go to the bathroom in a romper? https://t.co/1JGbXe6wuJ After we all bust the aliens out, we gotta introduce them to Earth properly https://t.co/nZ3ZLP8xRB Nothing makes me hornier than pulling out a Jenga block that's loose and comes out easily I could make costumes this amazing too if only I paid attention in high school home ec https://t.co/mIXgXw5VOs @Comic_Con it’s never good to see your ER doctor wearing a “but first coffee” shirt Rose McGowan and Billy Zane star in the real-life, true story of Betty Boop, the inspiration behind one of the most iconic and sexiest cartoon characters of all time. https://t.co/lb8nrhesag Me after seeing Tom Hanks as Mister Rogers https://t.co/qiQZDrLYpc Tea is my copilot. https://t.co/uqrShRHKUG Giving to charity has it's advantages for Seth Rogen.\n\nWatch the full video here: https://t.co/sSNXJdtJpU https://t.co/9nBOj1tWJs Only a fool would challenge Deandre Jordan to a penis competition -- That fool is Dave Franco. https://t.co/k5QqZfrftl It takes a lot to enter the world of Pro Wrestling as Manny Pacquiao finds out the hard way.\n\nWatch the full video: https://t.co/86m2tx21EI https://t.co/jaF0K9gVLs Lose weight the Rick Ross way!\n\nLearn the full method here: https://t.co/9tWUIZWI7P https://t.co/iWl5ndEgEa Bagels are just donuts who got jobs Always read the book ladies! https://t.co/d66ItXREPX Dad's don't jump. That's a myth!\n\nWatch the full video here: https://t.co/THskMN7MnC https://t.co/1Y54grOW8N And make sure you crank Danger Zone - Kenny Loggins while you scroll through these gifs https://t.co/IE7oiXK3RE Dinner's getting cold bro https://t.co/UPDga7nfrR RT @GDLA: Jerry O'Connell (@mrjerryoc) stopped by Good Day LA to talk about his new show \"Jerry O,\" premiering on FOX 11 in August https://… We combined them into one movie https://t.co/mlK3syjIke Remember the 'Full House' when Stephanie helped her classmate get beaten by his father? It was a very special episode. https://t.co/ziPmxgdhNS James Corden in cat form is what I'm gonna see in the corner of my room next time I have sleep paralysis https://t.co/f4NVZISJCl You took a crap at a party and the toilet doesn't flush. Do you? RT @JerryOShow: Jerry O premieres Monday, August 12.\n\nGo to https://t.co/vmDLeNlEQG for tickets and local listings. #jerryoshow #jerryoconn… If you missed @JeffGoldblum's secret BBQ dish, try these GIF-kabobs. #ad https://t.co/JUY8G2f4dk This is the pinnacle of summer fashion https://t.co/6ZQgxMDxtu Police Squad Goals are EVERYTHING!\n\nWatch the full video here: https://t.co/2YpoxiyXtJ https://t.co/sSeRCDQlkr CATS (2019) https://t.co/vo1YeaYYFC @JerryOShow @MrJerryOC Can we have the suit The amazing @trixiemattel played a show in our bathroom and it was one of the best days of our lives https://t.co/t117HFoNyz Waka Flocka Flame is ready for his next move: https://t.co/65bUFIgNBN https://t.co/43PRb9gXNY If you only watch one video today please let it be this https://t.co/L9YqQHMM97 Learn about the importance of #saving for #retirement and how @ORSaves can help. “What if… I don’t work…like ever again.” – The guy who invented retirement #ad https://t.co/yJ5wpqHNxn Deangelo Vickers mime-juggling was already great but I could watch this edited version all day long https://t.co/n7TYlgfyqD Stranger Things characters ranked:\n\n- Dustin\n- Steve\n- Jim Hopper\n- 11\n- 69\n- 420 Is this superhero (@LamorneMorris) steppin' out on his girl? https://t.co/naWOnRWsRv 90 Day Fiancé is a masterclass in the cinematic arts. https://t.co/aGy7nT1tAO Congratulations @SarahKSilverman on the Emmy nomination for 'I Love You America'! https://t.co/t4ZnmVICP9 @DancesWithTamis @cottoncandaddy *nodding* mirror yell Congratulations to the amazing @jvn and @gibblertron on the Emmy nomination for 'Gay Of Thrones'! https://t.co/rsNbGCCB5L HAPPY BIRTHDAY DAD https://t.co/5mLXvs69nf Congratulations @billyeichner on the Emmy nomination for 'Billy on the Street'! https://t.co/LNzKVhVwdF Signs of the flu:\n\n-When you cough an egg comes out\n-Horses avoid you\n-Your nipples leak\n-Mirror yell \"You're disgusting\" at you para los que la pidieron en español ❤️🌹 La telenovela Rubí te dejará traumado pero feliz https://t.co/4Q7ja3VAWJ Would you pass a F Boi exam?\nhttps://t.co/cLGVct7goN https://t.co/nf6hgwpwpm Tenacious D are in safe hands with the world's greatest Roadie!\n\nWatch the full video here: https://t.co/4sTVboxYXn https://t.co/nCzT05U0rC Finally an event I actually want to attend https://t.co/dANsxQ0SSY Who's your favorite Lion King Character: RT @92Y: More tickets just released for @MrJerryOC in conversation with @RadioAndySXM @92Y 7/30 at 7:30. Get yours here: https://t.co/EXDbf… Hell yeah check out those savings. https://t.co/mUTpuzsfHM Take a tour of the The Black Keys' studio in their first ever Masterclass. @theblackkeys https://t.co/X4sTgXxnFr People who like mondays are weirder than people who eat soup in the summer On repeat. https://t.co/96aZZ6qYpx My neck\n\nmy back\n\nmy pussy\n\nand my crack\n\nare all places where I have cut myself shaving Now there is a version for men!\n\nWatch the full video here: https://t.co/Sd7ZDeHICa https://t.co/2oCCigHln3 For the people who have too many weddings to attend, Visa Vows has you covered -- With @jamiechung1 https://t.co/3VkGEenc4a The stars dictate our lives so hopefully there's some good stuff in here for you https://t.co/RglvCFGsdo Traveling has its low points.\n\nLink to full video here: https://t.co/SUhW9Vhg9E https://t.co/UXkLEKGkcZ I would rather drink my iced coffee out of an old boot than use a paper straw Can these Disney couples feel the love in their final therapy session? No. No, they can't. https://t.co/GlaIUt5FBk Expressing your feelings is hard, let Nic Cage do it for you https://t.co/0zq36AH16z The stars dictate our lives so hopefully there's some good stuff in here for you https://t.co/hBFtbsObmJ my therapist's face after our first session https://t.co/Bkt2GIL36D It should be illegal for anyone near me to sneeze more than two times in a row Remember the 'Full House' when Steve Urkel taught Stephanie glasses positivity? It was a very special episode. https://t.co/JiDG040ySl Sometimes 3D Printing can go a little too far.\n\nWatch the full video here: https://t.co/KTWJwjmoEc https://t.co/Ua5tcg1MBu These recipes will make you one step closer to becoming Jeff Goldblum. #ad https://t.co/dOv3OGLOCU Can one man on roller skates make the streets safe again?\n\nWatch the full video here: https://t.co/8HoolguxzV https://t.co/A7xTstFqBI MY BRAIN: act natural act natural act natural act natural\n\nME: https://t.co/okZzDOxtSG when my stress acne and diarrhea come back https://t.co/h93gxvc42Q what video should we break down next? \"November Rain\" is the dumbest music video about a guy jumping through a wedding cake https://t.co/vqzdz6kz9s They tried their best and that's all that we can ask for https://t.co/cqOL0z67fJ a burrito:\n\nme: https://t.co/LHz0OoWcCq A touching moment with Jeff Goldblum @Kroger #ad https://t.co/ktseN8VZ5B RT @TeamCoco: .@TigNotaro didn't recognize Anne Hathaway. https://t.co/2bSOzI5133 #CONAN https://t.co/exsfqeQptK Thanks for the laughs, Rip Torn, you will be missed https://t.co/VVbJZQSXYR The stars dictate our lives so hopefully there's some good stuff in here for you https://t.co/hHZFP4nLO2 If you're not first, you're last. https://t.co/3ZW1PGIYoK Bryan Cranston has no sense of smell.\n\nLink to full video here: https://t.co/OIGuan0l39 https://t.co/YXdnDFroCT People are taking baths in buckets and eating raw bacon I can't. https://t.co/SYpMkJkICO Hey uhhhh quick question: what https://t.co/4rvgJ4kcID The stars dictate our lives so hopefully there's some good stuff in here for you https://t.co/MkTEoAp9qj Midsommar (2019) https://t.co/VLzMBvAjbe Who's your favorite Stranger Things character? Pen Flower Bun, aka @GlennHowerton, sits down with @TigNotaro to get Philadelphia’s weather report from @alexa99. She still has no idea who he is. #ad https://t.co/3umbWDgeco If you're gonna make a fire, you gotta do it the right way: https://t.co/f2PEJ0F1T3 https://t.co/kANK4Q73x5 These guys don't know the meaning of a naturist retreat: https://t.co/ir2SyjdwUl https://t.co/oBGgm28cD6 What are your favorite sitcom opening scenes? https://t.co/JyJ5qIeDzE The stars dictate our lives so hopefully there's some good stuff in here for you https://t.co/M3Qk0pU55i Brooke Shields learns it's never too late to start over... and over... and over again! https://t.co/1rleG5LRpJ Natasha Lyonne is very passionate about this project: https://t.co/yfCa12DNSk https://t.co/kH7Ftu2rvy Will a second superman make the city a safer place? Or will it just make things SUPER awkward between Batman and Superman? https://t.co/TqjVV0JeSW This almost ruined my eternal love of pickles. Almost. https://t.co/6DzNfYeoft Bring them back! https://t.co/5kKfRwKp6G They are trash and so am I. https://t.co/81kKNZ3GRS Signs of a heart attack: \n\n- Your blood starts screaming\n- Your shorts go numb\n- Dead relatives greet you\n- Steam comes out your ears They warned Jeff Daniels but he just wouldn't listen: https://t.co/7cyhBXWLFD https://t.co/07g9cMlQz1 My gravestone: https://t.co/jhJDNitauu Maybe David Harbour should have played Eleven in Stranger Things?\n\nWatch the full video here: https://t.co/K3kT7hs4Gg https://t.co/rfJ7tKox7i Can you repeat the third one?https://t.co/Ur2lPLJaAb Pro Boxing isn't the only sport Manny Pacquiao is interested in: https://t.co/86m2tx21EI https://t.co/baI6GsSJvq Thank you 'Pen15' for reminding me how lucky I am to not be 12 years old anymore https://t.co/ZOVOdzN0yW Remember the 'Full House' when D.J. got busted not drinking beer? It was a very special episode. https://t.co/auZQmbljIL Anyone find it disturbing that the rock man from never-ending story ate nothing but other rocks For the love of sleep and dogs and America can we please do literally anything else to celebrate https://t.co/MkEy6Ab9Nm Rick Ross knows how to get you fit: https://t.co/9tWUJ0eiZn https://t.co/EUvF0xFB6e This Patriotic Punch will quench your thirst for an Instagrammable bbq drink. @Kroger #ad https://t.co/9ii1oQeBCh If you guys hear any explosions coming from my bathroom tonight, it's uh.........fireworks America's living rough right now so you know it's 243rd birthday party is gonna be messy! https://t.co/Fr8A3PPlwA To get the most time off, just fake your death. https://t.co/S0Zbm9q1h6 What's a good movie to watch tomorrow after I eat too many hot dogs and throw up everywhere? instagram is down, so you can just tweet at us with how your life is better than ours Twirler lore states that if a baton falls on the ground, it will cause seven years of bad luck. @kroger #ad https://t.co/8sDDZbGcv7 Your neighbor plays excessively loud music. Do you... If this sounds magical that's because it is https://t.co/oRKCkNmPu3 No matter where you work, there's probably at least one psychopath you have to deal with. https://t.co/u3aGACYfvR How would you feel if you saw your father jumping?\n\nLink to full video here: https://t.co/THskMN7MnC https://t.co/YoGXEmE6nt ME: A juice that's good for my health for $10.00? That's insane. \n\nALSO ME: A craft beer for only $15? I'll take 2. What happens when Seth Rogen gives money to charity: https://t.co/sSNXJdtJpU https://t.co/uwAIDaUPFP I give this the world's first 10-star rating. https://t.co/eS1wKP4U4p And I need you *violin* and I MISS you https://t.co/uJv7CArRgM Everything is shit and this presidency is a nightmare but at least we have memes https://t.co/mWYBR51eQT When was the last time @TigNotaro peed her pants? Watch her interview @wolfgangpuck with help from @alexa99 to find out. #ad https://t.co/uDczv1U5xE My biggest fear is dying with a skid mark in my underwear *insert Seinfeld bass slaps* https://t.co/YUh752wBrH But why https://t.co/9Nh4MDsl0R Seriously why are they like this https://t.co/H5ADNgBS4W Aren't morning people the worst kind of people?\n(with @DeadKevinSketch) https://t.co/MokU3iEkCD Don't be a fake friend: https://t.co/2YpoxiyXtJ https://t.co/6bySKQxs2n I may not be rich now, but that’ll change when my ‘Valerie Vomit’ Garbage Pail Kid goes up in value Honestly it'd be better to wear canvas dropcloth from Home Depot https://t.co/T0Zhsx8br0 no no NO https://t.co/LlfHtFaeQG just got my customized kevin durant knicks jersey in the mail, so i guess i’ll just take a big sip of coffee and read the news We all have that one Frenemy.\n\nWatch the full video here: https://t.co/FHyXYLLxZu https://t.co/iYwiozi8hF K-Pop just got a dose of Anna Kendrick! https://t.co/PhkNLvaFz2 ASMR wasn't real for me until this came along. https://t.co/TIwFS4Yh8Z HOW TO RELAX\n\n- Meditate\n- Drink tea\n- Take a bath\n- Burn down your ex's house Possums:\n-Smelly\n-Nocturnal\n-Scavengers \n\nOpossums:\n-Osmelly\n-Onocturnal\n-Oscavengers Finally time for Waka Flocka Flame's career change?\n\nWatch the video here: https://t.co/65bUFIgNBN https://t.co/CSeJ1Xuk06 I demand MORE SASSY BATMAN https://t.co/dUCCXphY0K No one ever talks about just how old The Little Mermaid actually was... https://t.co/a5XRu4epoR Becoming a registered F Boi requires professional testing: https://t.co/cLGVcsPFxf https://t.co/rx99aMDMtG Reasons I'm Screaming At My TV: A 90 Day Fiance Recap https://t.co/TJ5nqVpL97 Marianne Williamson's debate mantras are almost as powerful as crystals https://t.co/SLoq8fHTgI Personally I think her closing statement should've been accompanied by a tambourine and the burning of sage https://t.co/1KqRFzTsPd I wish I could make this less clickbait-y but I can't without spoiling it, please, please watch https://t.co/fUqqIuZjG8 Remember the 'Full House' when Aunt Becky's kids cheated their way into school? It was a very special episode. https://t.co/ztjLFC3Tze I live my life seeking the same rush as when I heard Cotton Eyed Joe for the first time Better to make lemonade with pee and salt. You know, the normal way. https://t.co/ESRvlSSZGv @Team_Mitch NO @JerDog ahahhahahahahahahha Name this movie. Wrong answers only. https://t.co/scA5OLyoMS This post is full of cheese. We could not fit anymore cheese on this post. https://t.co/t1x1dN5MQQ Sometimes the internet's an okay place https://t.co/itJWDnjgSi my brain                     my liver\nwanting to              wanting to\ndrink                            survive\n      ( •_•)                          (•_• ) \n      ( ง )ง                          ୧( ୧ )\n      /︶\\                             /︶\\ Marimar is a Telenovela so crazy, you'll probably need therapy after watching this. https://t.co/L7pPULl5wn Could Danny McBride be exactly who Jack Black &amp; Kyle Gass need on the road?\n\nWatch the music video here: https://t.co/4sTVboPAlX https://t.co/Sq50uBvsLI Since I don’t own a swimming pool, this summer I’ll be laying with the supermarket vegetables while they're getting misted. There are some things you just shouldn't do with a 3D Printer: https://t.co/KTWJwjE02M https://t.co/ghhAWdajp9 Annual reminder to kiss carefully out there https://t.co/FcBqKRWQyR Tonight's primary debate stage is going to be PACKED https://t.co/QDSR64MPnI Thank you science https://t.co/d6bvvwI8JQ The Office is leaving Netflix, but there's other great comedies you can watch, I promise https://t.co/AFKpVH6q1g RT @ringer: You might not know Demi Adejuyigbe by name, but you’ve likely laughed at his memes, parody videos, and random web-born phenomen… This is the story of Manfred, a man just trying to survive in a world of battered egos.\n\nWatch the full video here: https://t.co/Sd7ZDeHICa https://t.co/KBRBxox8XD 1940s: everyone sits around and listens to the radio\n\ntoday: if i can't look at my laptop and phone while the tv is on, my heart will stop beating What do you get when a professional roller skater takes up fighting crime? Knight Blade!\n\nwatch the full video here: https://t.co/8HoolguxzV https://t.co/Mnt79jQbHG What is going on https://t.co/8jU9skiSG0 Melissa explains it all and @Alexa99 fills in the gaps. Watch @TigNotaro try to identify @MelissaJoanHart. #ad https://t.co/uh5SNk1FlW me: everyone i work with is a moron\n\nalso me (eating m&amp;ms): why do these skittles taste so chocolatey Nothing gets past Ron Livingston.\n\nLink to full video here: https://t.co/SUhW9UZEL4 https://t.co/bud2qX9jw9 Are you Peach? I'm Peach. https://t.co/Dq1kBYnN0y FLUTE! SOLO! FLUTE! SOLO! FLUTE! SOLO! https://t.co/Jijm1EsmC6 When in doubt just make the entire room a diaper https://t.co/I4xsgkvTLJ Cats can be very jealous creatures. https://t.co/Ny0B99rtnx Hands up who else has a a psycho boss like this? https://t.co/e779jvNUlK There's only ONE DAY LEFT to vote and winning would be cool https://t.co/lKBnhjogvL Smell isn't everything.\n\nWatch the full video here: https://t.co/OIGuanhVUH https://t.co/7i8c9iHKHn MY FRIENDS: you need to stop dating slimy older guys\n\nME: https://t.co/W3qCWVWF2W Not all Superheroes should be allowed to have a sidekick. https://t.co/n9JFBkYPI2 Rob Lowe doesn't like it when he's not on television. https://t.co/A2FRNNjks7 When Becky in HR runs the office diversity program. @We_Are_Sikhs #DiversityDay #ad https://t.co/E0v7rn3Xwo Skid marks are toilet souvenirs There are many rules to making a fire: https://t.co/f2PEJ0nr1v https://t.co/QoTN8XCGce I spent an hour down this rabbit hole and I don't regret a single second https://t.co/7jhpHra1eM NBA star @JimmyButler​ and child star @MilesBrown​ sit down for an intense magical #1on1 https://t.co/IQud2OMv9Y This product is guaranteed to get you noticed at company meetings!\n\nWatch the full video here: https://t.co/wPUFIpFN6K https://t.co/jgv4vtzysF This sketch series makes me want to be Italian. https://t.co/VY5677qgsP Reduce, reuse, recycle and remember to consider Funny or Die's \"I Love You, America\" for Outstanding Variety Sketch Series and other categories. https://t.co/ikyrM1tHSG Please please please let this be a recurring thing https://t.co/MlNkKUP9ej Which commandment is the one that says \"thou shalt not do enough research and looketh a fool online\" https://t.co/8cNluZO3ft Trae Crowder (The Liberal Redneck) needs to do a bit more research.\n\nLink to full video here: https://t.co/ir2SyiVVvL https://t.co/yqgvOxVGu5 Yeah I have a dad bod\n\nDangling\nAnd\nDroopy\n\nBig \nOle\nDick This is the reboot we all deserve, please, we need it https://t.co/DMA43gH8eS It's time to let Natasha Lyonne make her dream project, Beetlejuice 2.\n\nWatch more: https://t.co/yfCa12mctK https://t.co/JYd65eiggi 7 DEADLY SINS:\n-Pride\n-Greed\n-Lust\n-Gluttony\n-Wrath\n-Envy\n-Teachers that say \"the bell does not dismiss you. I dismiss you\" Tenacious D search for a new roadie when they find one of the most amazing Roadies that has ever toured the roads (Danny McBride).\n\nWatch the full video here: https://t.co/4sTVboxYXn https://t.co/Lk0EYmSrGV SUMMER AS A KID: i'm going to go run around all day!\n\nSUMMER NOW: if i move one single inch i will sweat through all my clothing RT @colbertlateshow: Comedian and actor @TigNotaro is on the Late Show tonight to discuss her new show ‘Under A Rock’ on @funnyordie #LSSC… RT @broazay: before memes, guys used to sit around in a circle and loudly quote Anchorman at each other for literal years And it's literally a perfect fit every time but I'm still not happy about it https://t.co/gJxaFONNws This video made me happier than anything else today and I'm not ashamed to admit it https://t.co/KAEaZSiTbk RT @GoldDerby: Funny or Die’s scrappy Emmy campaign is made up of other Emmy campaigns: Emmy inception! https://t.co/hoeKqE5z5I https://t.c… The Blues will not be forced! Even by Jeff Daniels.\n\nWatch the full video here: https://t.co/7cyhBYemxb https://t.co/ugJsXeQoXp WIFE: what are you thinking about\nME: nothing\nMY BRAIN: https://t.co/tldWPb1hqy Bulletproof diaper bags and maple syrup grilled cheeses! What's even happening on 90 Day Fiancé: The Other Way?https://t.co/bZnE7Hiy6P Secrets don’t make friends, but they do make a mean summer meal. https://t.co/HoUdlRtUsa We found a really good use for these wasteful DVD mailers. Consider \"American Vandal\" for Outstanding Comedy Series and other categories. https://t.co/rrZazseDDT ME SOBER: vibrant, intelligent, sophisticated\n\nME AFTER ONE SINGLE DRINK: pants are just two long skirts Rick Ross' workout regimen 'RossFit' will change your life!\n\nWatch the full method here: https://t.co/9tWUIZWI7P https://t.co/ewRs5jfTbu When all else fails just go for it and electrocute yourself https://t.co/pvr0UMTGaI RT @MrJerryOC: 7/30 I get interviewed by BU, Clayton High, Nanagamon Camp for Boys grad, TV host, producer, wrangler, @SIRIUSXM @RadioAndyS… @elijahdaniel are you accepting new residents Can't wait to uproot my life and move to Gay Hell https://t.co/p8pVD9TCb7 when i'm watching a movie with my parents and there's an uncomfortable sex scene https://t.co/0KcmhAcA59 Wyclef teaches @TigNotaro to dap with the help of @alexa99. Check it out. @Wyclef  #ad https://t.co/V2z7M53W0N School's out for the summer and kids are everywhere so I now believe school should be in session 13 months a year We got all these DVD mailers from other shows so we used them to tell you about ours. Consider \"Brockmire\" for Outstanding Comedy Series and other categories. https://t.co/CtHNUrTmGW Honestly it's close enough https://t.co/2nRMCMhvNK The @Walmart Grocery App just took us from Bedrock to the future and back. #ad https://t.co/9Q7BNbVgnX Zach will be joined by Lauren Lapkus, Ryan Gaul, and Jiavani Linayao! https://t.co/ZMVYiticsT RT @DEADLINE: Netflix Plants Ryan Gaul, Lauren Lapkus, And Jiavani Linayao For ‘Between Two Ferns’ https://t.co/cRWg63weVc https://t.co/ajk… @trixiemattel we miss you RT @trixiemattel: LITTLE SISTER at @funnyordie today! https://t.co/VTcbWKj0Iw Are these not 2 of the worst people you'd ever meet? https://t.co/lnl41VkBwx Can Manny Pacquiao make it as a Professional Wrestler?\n\nWatch the full video here: https://t.co/86m2tx21EI https://t.co/uBmWHecdkl I keep myself humble by projectile vomiting at work once a month It's not easy being friends with Zach Galifianakis. https://t.co/fP6s3tn6W6 There should be a halloween in the summer for all the costume ideas that will be too old by October Signs you're a dad:\n-Cargo shorts follow you around everywhere\n-You sing Bob Seger in your sleep\n-You're really good at not hearing things\n-You can smell spit up before it happens When I see Jennifer Aniston and Adam Sandler lookin good as hell in a new Netflix movie.\n\nWatch Murder Mystery now, only on @Netflix #ad https://t.co/htCJ2Ycy5C When was the last time you actually saw your dad jumping?\nhttps://t.co/THskMNpnfa https://t.co/tFBVvK6dw2 The results are in! https://t.co/xnQl8QmI4i Would you trust your friends and co-workers with a 3D Printer?https://t.co/KTWJwjmoEc BATMAN: i'm the world's greatest detective\n\nROBIN: *laughs because batman still hasn't found where he hides his weed* We got all these DVD mailers from other shows so we used them to tell you about ours. Consider \"Billy on the Street\" for Outstanding Short Form Variety Series. https://t.co/KFF8BgAQ53 You gotta make sacrifices for your friends: https://t.co/2YpoxiyXtJ https://t.co/Cza3TMbrT2 It takes more than a chiseled physique to make a man attractive in today's world. https://t.co/C3CdnX18L7 For anyone who kinda misses having to physically put a VHS tape in a VCR https://t.co/hCmoS6eryE \"I have more lines in this video than I did last season. I'm sorry for that\" https://t.co/KlR20sSsVZ RT @DEADLINE: Emmys: DIY Campaigns On Shoestring Budgets Use Others’ FYC Screeners To Draw Attention https://t.co/jEib46zPBj https://t.co/F… Can't wait for the diplomatic talks with the Lord of Sharks next https://t.co/H3wSXKJ4VH This dad gets it. Or does he? https://t.co/Tg68TkLNAU Some friendships are really REALLY hard!\n\nWatch the full video here: https://t.co/FHyXYM38R2 https://t.co/TEasFcAMED It's Friday, time to take 85 terrible selfies and cry myself to sleep congrats to the toronto raptors but we still have the stanley cup so I wonder who will lie to us now https://t.co/IhNOjnPoK2 The next season of Black Mirror is feeling a little too relatable: https://t.co/VbrZtT2iaY https://t.co/zUYK84RIrE What's the nastiest pizza topping: We got all these DVD mailers from other shows so we used them to tell you about ours. Consider \"Gay of Thrones\" for Outstanding Short Form Variety Series. https://t.co/XmPTfBuqd6 What stage of capitalism is it when brands make memes out of other brands https://t.co/UgSgdQvgBL Things that fuck me up:\n\n- Alcohol\n- Cocaine\n- When people don't vaccinate their kids This might be more ASMR than you can handle - brought to you by the cast of @ShaftMovie – Get your tickets now! #ad. https://t.co/eXy2rlljY6 @SamuelLJackson @The_JessieT @MoreReginaHall @AlexShipppp https://t.co/MmrpBLV0VD Our mothers are becoming living, breathing Facebooks This is exactly the kind of Pride Month representation we need https://t.co/aRxm2QEiAu Like art? Then tune in to TLC's 90 Day Fiance: The Other Way. It's insane. https://t.co/AxDjhyEgqz John Mayer takes YOU behind the scenes of his songwriting process. https://t.co/s2DdJVWIIF Is it finally time for Waka Flocka Flame's dream to come true?\n\nWatch the full video here: https://t.co/65bUFIgNBN https://t.co/hY771FGfUB I made it through all of high school without drinking coffee and now I need to drink an entire pot to stay awake for three consecutive minutes Would you pass your F Boi exam?\nhttps://t.co/cLGVct7goN https://t.co/eNV8toOBsi You can turn them into a dogfish. GET IT? DOGFISH? DO YOU GET IT https://t.co/m7kvXLxVDw kea-no sleeves https://t.co/zxd7goJQxP \"I caught you a delicious bass\" https://t.co/HfBGHyTdBZ @ItzMarney oh no my money i bet all my money on thailand to beat the US in the womens world cup, can somebody check on the score for me *Extremely Britney Spears voice*\n\n\"It's Peppa, Bitch.\" https://t.co/uA1YA678e8 Watch @Alexa99 help @TigNotaro identify @itsJulieBowen. As it turns out, they could be related. #ad https://t.co/buLXy6kTGl It should be illegal to drive faster or slower than me I AM SO READY TO BE ABLE TO SEE AT CONCERTS https://t.co/P6krUfEUna This new Bandersnatch has much easier choices. Watch Murder Mystery June 14th, only on @Netflix #ad https://t.co/HZq4RTLYLq It's not about who would win or lose just as long as everyone has fun https://t.co/u96jmBVjdB i'm never sleeping again https://t.co/qN0rFN3xkd I wanna say the butler did it but that may be too obvious. Adam Sandler and Jennifer Aniston team back up in this hilarious whodunnit set on a European honeymoon. Watch Murder Mystery June 14, only on @Netflix #ad https://t.co/2DxGJqPzq0 In a twist of fate, rappers Lil Dicky, Trinidad James, and Mystikal suddenly find themselves responsible for customer safety at a liquor store. https://t.co/NYVPMTwU62 There is a reason the 3D Printer is for OFFICE USE ONLY!\n\nWatch the full video here: https://t.co/KTWJwjmoEc https://t.co/AZs9TkvVXs People who love Mondays are the same people who asked the teacher if they forgot to assign homework All relationships need some rules. https://t.co/uLCDx2wdFZ When you wanna show off your joint rolling skills but you're out of weed https://t.co/lgLa45QCEv Tenacious D might have just found the best Roadie ever!\n\nWatch the music video here: https://t.co/4sTVboPAlX https://t.co/V5rsFYPgqd Superman once again proves to be the most unoriginal superhero. https://t.co/Ysl3bzsQ4J Anybody can be a Disney Princess these days https://t.co/bg9bjEcvQm OTHER PEOPLE'S CARS: Baby on board!\n\nMY CAR: Person that's watched every episode of law and order on board! Can Ray Wise make this roller blading star a crime fighting hero?\n\nWatch the full video here: https://t.co/8HoolguxzV https://t.co/sS8pVtz2dH That's MISTER Rambo to you, Godzilla. https://t.co/HDjNdcjZtS *record scratch* what https://t.co/czadfXpTUE You can either bring your own bag or use a plastic one that tells the world you have warts https://t.co/I4FZvK7xID Don't sit in front of @MrWillMiles on the train.\n\nDon't miss The New Negroes with Baron Vaughn and Open Mike Eagle on @ComedyCentral https://t.co/tejhGOpp8E Are you living your best life this #NationalDonutDay? https://t.co/AScgajexb6 neil degrasse tyson's head just exploded https://t.co/EXqPrO0C66 a heart attack https://t.co/4MLzAO2R4z Honestly upset that I couldn't cop an invite https://t.co/y0OHMyQFs0 Remember the 'Saved by the Bell' when Zack Morris stabbed Screech in the back to hook up with Lisa? Zack Morris is trash. https://t.co/9dArt3uOTm There’s no movie that’s better than a random blooper reel Do you know the right way to make fire?\n\nWatch more here: https://t.co/f2PEJ0nr1v https://t.co/O4ashw8eiK Is anybody shocked though? No. Are we all going to roast the shit out of it? Obviously. https://t.co/C2qMmcG84u Bryan Cranston is sick and tired of rude party guests farting in his face. https://t.co/s5EmqLGyVw me: 😐\n\nteacher: *sits backwards in chair*\n\nme: 😮 This is an extremely wise and logical purchase and I will explain why https://t.co/NQveRsqcLb \"I have the some of the worst eyesight on the planet and even I can see this is a problem\" https://t.co/3AtflgFUfg TFW the party has six people but this much food @mortonsalt #EraseFoodWaste #ad https://t.co/XbiNR9G5ga Just when we thought we'd seen it all https://t.co/D6Pw0eU1i0 My city smells like hot dogs and now I can too. Thanks @JordanaBrewster https://t.co/g6Hw5kDmy1 Business Suits can change your life: https://t.co/wPUFIpFN6K https://t.co/OTHGJwW0SD Impress a date by storing caviar in your glove box and offering it to them CONGRATULATIONS! It's a PhD :') https://t.co/EIUeSaxFv6 Natasha Lyonne is ready to reboot Beetlejuice\n\nWatch More: https://t.co/yfCa12mctK https://t.co/4aCXQmjwrG May their disembodied wails echo through the halls for a thousand years https://t.co/2qKlWHeI8z having a great TUESDAY!\n\nT ook a dump in my\nU nderwear and\nE veryone is \nS aying i smell and i\nD ont have \nA change of clothes \nY uh oh @cottoncandaddy *nodding* Smash Mouth Smash Mouth 2020 https://t.co/BLthau49R0 James Van Der Beek gets interviewed by @TigNotaro and @alexa99. Pacey reportedly very jealous. @VanDerJames #ad https://t.co/d5y5CMpq7M ME, AT THE BEGINNING OF A WEDDING: I've never looked more elegant in my life\n\nME, AT THE END OF A WEDDING: I'm a drunk floor mop that claps What's happening to Jeff Daniels?\n\nWatch the full video here: https://t.co/7cyhBXWLFD https://t.co/QuWCEewwzG This cured my depression and added three more years onto my life https://t.co/jK2vhNSKAL NO ONE:\n\nGHOSTS: https://t.co/Mnc6S5CsuX Either this cat has a really great ear or she's just a dick https://t.co/lSCF0XZHQz These are the most creative and hilarious protest tactics I have ever seen, help I'm cryinggg https://t.co/oQ7JnobfH4 Getting through U.S. Customs and Border Patrol gets harder and harder all the time. Just ask Gad Elmaleh &amp; Ron Livingston. https://t.co/jm89yPZwBD When your eye twitches it can mean two things:\n\n-You're stressed\n-Your eyeball is about to have an orgasm You don't need to be a role model to debate children. https://t.co/xK3kH949aE Parts of an avocado https://t.co/UqCP34ubB1 Get fit using the Rick Ross method today!\n\nWatch the full video here: https://t.co/9tWUIZWI7P https://t.co/E5t6ZrpFR1 Finally the full story of the distracted boyfriend meme\n\nWatch the full video here: https://t.co/vk2zGnPOLT https://t.co/8MsZEMdkBu It's Walk Off Time! https://t.co/UbKfYWoAof If having a baby was like getting a new iPhone: https://t.co/VbrZtTjT2w https://t.co/qeoh1mIIGJ This definitely made me spiral a bit but it's fine it's chill I'm fine https://t.co/D0FQAFOxpH Life for Disney Couples isn't always happily ever after! https://t.co/yE3ABNqMxK Real friends don't make excuses!\n\nWatch the full video here: https://t.co/2YpoxiQylh https://t.co/ehHJajaWaD Leave him alone HE'S BEAUTIFUL OK https://t.co/RSbTZVSwig The other RDJ (@rdouglasjones) has some thoughts about Marvel's Black Panther.\n\nDon't miss The New Negroes with Baron Vaughn and Open Mike Eagle on @ComedyCentral https://t.co/UPc7hZQpIr What would you even do with hair lint after you buy it https://t.co/c8fOkLWUxg Yeah hi this thing is 40 feet tall. WHAT. https://t.co/vsnNyiliNp Remember the 'Saved by the Bell' when Zack Morris lost $20,000 on counterfeit jewelry? Zack Morris is trash. https://t.co/ljV2Refw0Q Sleeping is like flushing the toilet but for your body They look like they're about to headline Coachella https://t.co/ZexFMjnHro Manny Pacquiao considers some career alternatives.\n\nWatch the full video here: https://t.co/86m2tx21EI https://t.co/hIpVDoJwR6 Personally I think MORE children's clothes should have NWA lyrics on them https://t.co/gx8GTvVAXX @RamboMovie https://t.co/mYFgJE2lyR @BlackAxeNinja Fair critique Filing this under \"sentences I never thought I would say in my life\" https://t.co/dlhtKldyPE My butt after eating spicy food: https://t.co/lE3rS9IMat I think Rambo Vs Godzilla should be a movie How well do you know your Therapist? https://t.co/cSFpldale4 My greatest accomplishment in life is that I haven't left anyone a voicemail in over 10 years Ok but we need these everywhere https://t.co/ycZmdlBdPt With friends like these, who needs enemies?\n\nWatch the full video here: https://t.co/FHyXYLLxZu https://t.co/8hlZQApjLc \"hoping Robert Mueller sounds like PeeWee Herman\" oh my god https://t.co/rXl3KpKvas My motivation https://t.co/fbF7HdTMa5 @nerdist 👏👏👏 RT @nerdist: Ranking every Between Two Ferns episode https://t.co/QVs83umgDY https://t.co/ErtGRPwKOO RT @billyeichner: SURPRISE!!! It's an all new BILLY ON THE STREET with Academy Award winner REESE WITHERSPOON!!!!!!!! https://t.co/kZnHY1j3… 🎶i’m extremely at the club🎶 Damn, this leaked audio of Paris Hilton's new track before auto-tune sounds off https://t.co/iWb0nHUnRH Someone please stay at this hotel and report back after because I'm gonna have questions https://t.co/1oYn36AB1r When was the last time you saw your dad Jump?\n\nWatch the full video here: https://t.co/THskMNpnfa https://t.co/wOEWV6vmLg This Twitter account proves that 90's fashion isn't as bad as you remember, IT'S WORSE https://t.co/3547xdLnpI Best DVD in my collection https://t.co/dS45vebhoI Only 90's kids will remember when Chewy and Darth Vader had a fling and vacationed in Mykonos https://t.co/swuiCMtja7 Jesse McCartney, thank you for teaching us the weirdest fact about cucumbers. https://t.co/Q8TksKMu2P Find out more about Waka Flocka Flame's real dream here: https://t.co/65bUFIyp0n https://t.co/sWU0Bcp6lW Meeting your girlfriend's dad for the first time can be a total nightmare: https://t.co/9vUIWGxL8w https://t.co/iV0xUnh69z This man is such a pro he could have played any role on Stranger Things! https://t.co/K3kT7hJG4Q Just some of the questions you get asked going for your F Boi license: https://t.co/cLGVct7goN https://t.co/LvHH7NHBEP Superman is completely unaware of his own strength https://t.co/l0l6dx1eqj Zach Galifianakis was definitely not threatened by Natalie Portman's dog. https://t.co/pX1jsDWhdI I unplugged it and plugged it back in https://t.co/Uu1BTv7EEv When 3D printing goes bad: https://t.co/KTWJwjE02M https://t.co/OaNzOG0hjC Are you ready for a roller blading superhero?\n\nWatch the full video here: https://t.co/8HoolgcWIn https://t.co/EDPJu4cmjn Haha good thing this buffoon doesn't run an entire country or anything. Wait https://t.co/Sib8hvnDbB George Wallace thinks Californians are doing some stupid shit.\n\nDon't miss The New Negroes with Baron Vaughn and Open Mike Eagle on @ComedyCentral https://t.co/7WLwKhQzs5 We love you @GuyFieri Congratulations to the Mayor of Flavortown!!! https://t.co/OQReRMmuSo Remember the ‘Saved by the Bell’ when Zack Morris cloned himself to cheat on his girlfriend at her birthday party? Zack Morris is trash. https://t.co/UGVHWMXluJ Zach Galifianakis and his ferns are coming back and this time they’re going cross country!\nhttps://t.co/7xXkjf71LE I'm like Rod Stewart's 'Forever Young' but like, the exact opposite Hello we want to announce that Between Two Ferns: The Movie is coming soon and it stars Zach Galfafananakakais, the ferns, and many more.\nhttps://t.co/7xXkjfoCDc https://t.co/2oNwH6k8UL An epic band like Tenacious D needs an epic Roadie!\n\nWatch the music video here: https://t.co/4sTVboPAlX https://t.co/SMP6gkXaX0 Fellas let this be a lesson that all you have to do to impress people is put on a button-down and do a French tuck https://t.co/4iL0tJaVyP cc: @michelbrownmike Pasión de Gavilanes is a telenovela that's equal parts sexy and horrifying https://t.co/8N8jcnZEci The best way to get over someone you're obsessed with is to actually get to know them My inner child that loves Pokémon is screaming and so is my outer adult that loves beer https://t.co/km3qwTRqdK My dog is more qualified to be in government than Ben Carson and he eats his own shit https://t.co/l7a35zvZ3z Guy Fieri just got his walk of fame star, on the holiest of days, world goth day https://t.co/FfL66CFdJ4 Felt cute, might delete later https://t.co/mQGpI2sISX In terms of skeptical squints, I feel Tyrion's the most. https://t.co/U4hsOx06eI I wish I was Bruce Lee at least once a week Not everyone needs help making fire.\n\nWatch the full video here: https://t.co/f2PEJ0nr1v https://t.co/Ta8V2EvrRu I can't wait for this movie to inevitably win Best Picture and every other Oscar https://t.co/zWJBTew4fB RT @billyeichner: It's HERE!!! New BILLY ON THE STREET with the @JonasBrothers!!!!! With @NickJonas @JoeJonas @KevinJonas AND BILLY JONAS!!… @ninarb_ @jvn @celestebarber_ @QueerEye He finally found his dragons!! @jvn @celestebarber_ @gibblertron If we had a say in the matter you would’ve ended up on the iron throne @susan_r_naf @jvn @celestebarber_ @QueerEye It’s tough, we know. But you can always go back and watch all the Gay of Thrones episodes from the beginning! https://t.co/PFEhfYhuGl @cookiepusher @jvn @celestebarber_ @QueerEye SO WILL WE Gay Of Thrones merch is available now. Get itttttt.\n\nhttps://t.co/y3BsjzbcSE @kentonknoepfler @jvn @celestebarber_ @QueerEye Thank you for joining JVN on his journey to become the TRUE Mother of Dragons! So I have to ask.. @tanfrance @bobbyberk @Karamo @antoni hows it feel to be out of that egg? Jonathan Van Ness (@jvn) loves three things: George RR Martin, a nice fringe, and the formerly Game of Thrones. This week he is joined by the hilarious @celestebarber_ and his @QueerEye co-stars. https://t.co/ID2a8j9AcE I enjoy my farts so much, I'm going to start giving them out as birthday presents Listen I know it’s Brienne I don’t even care at this point Sing along to the new Game Of Thrones theme song https://t.co/b1GWno839X This is the opportunity of a lifetime https://t.co/oJ3INfwVqw Not enough people rap about Jane Fonda and Lily Tomlin as far as I'm concerned https://t.co/WsOCXWFvOi Can I get a refund on all the hours of my life I wasted watching this season https://t.co/L08xiDCWQE Finally! A movie for women! Made entirely by men. https://t.co/Pa1jvWHSxP Give your fingers a break by typing with your elbows for a day The big take away from 8 years of watching Game Of Thrones is that the wolf should not have lost an ear Handjobs can be confusing. https://t.co/eWpkkgIiKO My ASMR is Christopher Walken reading off every type of bagel ever invented Jonathan Van Ness (@jvn) needs Jon Snow to explain whats going on with that hair honey!\n\nWatch the latest episode of Gay Of Thrones here: https://t.co/wdArgwgTpQ https://t.co/i3geHoOPXb Jeff Daniels learned the hard way that you just can't force the blues!\n\nWatch the full video here: https://t.co/7cyhBYemxb https://t.co/yn4fSS4PqK Faith in humanity restored https://t.co/rADkpExcHh Zach Galifianakis had trouble interviewing this 7 year old. https://t.co/iMkGnK7dW2 Every dog's worst nightmare https://t.co/BXy34sgnad The people that can control themselves from tearing up those paper coasters at bars into a thousand little pieces deserve some sort of award Is this what they mean when they say 'clothes maketh the man'?\nhttps://t.co/wPUFIpFN6K https://t.co/9ytNDIR7H3 Watch out for the hellfire this weekend. https://t.co/u3EU0bZLnL Ricky Bobby https://t.co/eQjVrs88DO Mom can you come pick me up? Everyone's running on all fours I'm scared https://t.co/1fwLf7B1eW Naomi Ekperigin knows why your rescue dog seems like a racist.\n\nDon't miss The New Negroes with Baron Vaughn and Open Mike Eagle on @ComedyCentral https://t.co/zmUGEY9lYe Everybody take a deeeeeeep breath https://t.co/FbfVfAXhnY I spent $100 on a memorabilia Grumpy Cat turd, and I bet it's worth triple what I paid now Remember the 'Saved by the Bell' when Zack Morris sabotaged Screech's one chance with Kelly? Zack Morris is trash. https://t.co/lznlTdBHRP If there is a hell, I'm definitely going for how shitty I was to substitute teachers as a kid Also it's normal and not gross at all so spread the word. https://t.co/519GcRxXkj when my office turns on the air conditioner https://t.co/h6U9hSGKUW But you should definitely still check it out because this shit is bananas https://t.co/KW0yz4Eej7 This storyline is Oscar worthy https://t.co/KvonAc3qu3 Forget the King in The North, Icy Icy Frostman going after the King of the Jungle. https://t.co/LZVZr4YAob Is Black Mirror getting a little too realistic?\n\nWatch the full video here: https://t.co/VbrZtTjT2w https://t.co/mUoasSB1BW A good way to get out of a bad date is to shit your pants and leave We all know a person like this:\nhttps://t.co/v8ogBlvurh https://t.co/upYPvtZf2p Stage moms have nothing on these fools. https://t.co/B3EwKNMgjf You're not gonna believe how many signatures this already has https://t.co/IyjmL58Gox Happy Wednesday the Jonas Brothers did a photoshoot with ferrets https://t.co/fW5bxGGqy7 @joejonas You think you can play a little ditty for us? My only remaining molecule of Serotonin trying to get me through the day https://t.co/PEgeynAyvv This is proof that sometimes real life is better than fiction https://t.co/asgoYKqdUj Every Trump speech feels like you're trapped in a car with him https://t.co/ifAZex3m7A You ever stop and think 'oh shit I have a spleen somewhere in my body' and then just keep walking? I miss chasing rings or stars or coins for pointless points. https://t.co/Oh13JZs65I Remember the time Kristen Stewart &amp; Jesse Eisenberg had that really awkward interview: https://t.co/IdLSYxA7rA https://t.co/kt2LlaeeKp TAKE MY MONEY. TAKE IT https://t.co/jhMDMo3Lj6 Not all heroes wear capes https://t.co/aF87WDQFlI Jonathan Van Ness (@jvn) loves three things: heating pads, ​Rosalía, and Game of Thrones. This week he is joined by the totally fabulous @TiffanyHaddish. https://t.co/t32ZfRuk1G Daniel Day-Lewis was put on this earth to defeat the evil daniel night-lewis Sometimes friends make the best enemies.\n\nWatch the full video here: https://t.co/FHyXYM38R2 https://t.co/KKboHzVps2 Its yard sale season, everybody. Stay safe out there. https://t.co/yIBEmCfSnf We all definitely deserved this scolding https://t.co/I2AVdAaBfj That throne looks uncomfortable as shit, to be honest Hopefully next episode will reveal that all of season 8 was just a bad dream and we'll get a do-over https://t.co/rQWbP0Plvp When it's Monday https://t.co/rZw9Nc4JJy The reality TV show gets a new spin when one gay man looks for love in a mansion filled with lots of other gay men looking for love. https://t.co/7T5ExQpxKg Increase your popularity by telling people you're Jeff Goldblum's dog Zach asks Ben Stiller why he never went into comedy like his parents https://t.co/4tszQvdcrc My mom          Mark Zuckerberg\n                 🤝\n      Ruining Facebook Michael Madsen (Reservoir Dogs, Kill Bill) wants you to know that your mother is f*cking hardcore. https://t.co/fbnxQ3gKcf Brian McKnight is an expert! https://t.co/7YhgYSks6y My constant mood is ‘guy who is standing at the very back of a concert and can’t see anything, but still pretends to have fun’ The greatest challenge of dating is dealing with awkward parents: https://t.co/9vUIWGxL8w https://t.co/HiXL2gnbKs I fart in your general direction. https://t.co/zgLzyiHyol For someone who’s known for saying “facts don’t care about your feelings” he sure got upset when the facts didn’t care about his feelings https://t.co/SBvCW5GNzn Gee who could that silhouette POSSIBLY belong to???? It's a real mystery https://t.co/FuZB8kVgeq Honestly do we even deserve John Krasinski https://t.co/fAHsLkjZmj Are you as scared as Clayton English?\n\nDon't miss The New Negroes with Baron Vaughn and Open Mike Eagle on @ComedyCentral https://t.co/AQeqUe6vxm I wish my work desk had a steering wheel so I could drive away right this instant He sure is https://t.co/15ztMJUR27 Remember the ‘Saved by the Bell’ when Zack Morris stole a dog then slaughtered countless ants? Zack Morris is trash. https://t.co/AVIn14SYGU I save hundreds of hours every year by writing HBD instead of \"happy birthday\" Anyone wearing these is bound to get ALL the beaches https://t.co/9nZRa4w7d8 HOLY SH-IT https://t.co/CC90gwSNhB I didn't know I needed this in my life but I absolutely needed it https://t.co/UnigxE4vR8 thank you, i'll take my diploma now https://t.co/k0thoS2kyP I want an autograph from the bird that smashed into Fabio's face When you go down the dark rabbit hole of 3D Printing: https://t.co/KTWJwjmoEc https://t.co/cowdc5iq9X Ok but really who wouldn't want to punch a steak wearing Thanos' gauntlet https://t.co/cG5iIk5wCS I've heard of concealed carry but this is ridiculous https://t.co/pQecntgct8 Today is Wednesday Google show me photo of George Bush proudly painting the words \"Ben's Chili Bowl\" on wall https://t.co/48EsbuUmVj They make some excellent points. https://t.co/DqGqsxhMrE Unlike Mick Jagger, Wild Horses would 100% drag me away If they don't name him Kanye Westminster I will be so upset https://t.co/MC9luHvwtD And this cafe has 5 stars on Yelp...\nhttps://t.co/0kar5Q0c1P https://t.co/asX7hWnpcv @TJimmy16 May I suggest reading the article The theme for Met Gala 2019 was actually really cool but it proooobably needed a little more explanation https://t.co/TCxeuWKHHz Not cool...not cool at all https://t.co/iB59VwAD9S The perfect antidote to that fleeting feeling of not-impending doom when you forget Donald Trump is in the White House. https://t.co/wlgtcanyfF Jonathan Van Ness (@jvn) loves three things: smart gun control, rose water, and Game of Thrones. This week he is joined by the insanely talented @kumailn. https://t.co/dmZARtWIK7 *I walk out on Shark Tank and immediately stress vomit*\n\nALL THE SHARKS, COVERED IN VOMIT AND IN UNISON: \"We're out\" I almost feel bad for laughing https://t.co/2QJ2mNTk6D Me, at a crowded bar, trying to get the bartender to notice me https://t.co/NoukRs4J0A What do you do when a tag on your shirt makes your skin itch? The best Met Gala appearance so far https://t.co/GcuHHPsXQP You’re smoother than this. #ad @Snickers https://t.co/llEBzJuw0e I'm so upset about that ending I think I need a support group https://t.co/wENo8wlm7K I wish my friends cared about figuring out déjà vu as much as @ryanoflan @jackrobichaud and @AhmedBharoocha but they’ve NEVER carried me around town like a large child. Not even ONCE Lord Chad https://t.co/QxfLTkXNWE Ron Burgundy deserves the Iron Throne Uh oh. It looks like Michael Bolton's got a case of the Mondays. https://t.co/KojBomgPlp Making fire is complicated: https://t.co/f2PEJ0F1T3 https://t.co/zZRgYPHbyn Instead of cleaning my glasses, I make them dirtier so I don't have to see anything Gabrielle Union isn't really bringing it in this photoshoot https://t.co/j0eWSVTDlQ STRIPPER: *jumps out of a giant cake at my bachelor party*\n\nME (secretly disappointed that i don't get to eat a giant cake): coool Jonathan Van Ness (@jvn) needs Tilda (Brienne of Tarth) to get herself some facial toner and dry shampoo!\n\nWatch the latest episode of Gay of Thrones here: https://t.co/L3blO9WC8J https://t.co/31zw5Ovyl9 You have the power to be smooth. We believe in you and so does @Snickers. #ad https://t.co/UvHWDQovNg Your dog may be cute, but do you really know who they are?\n\nWatch the full video here: https://t.co/pQhj5cgEyR https://t.co/7eOXF9RSPF Charlize Theron can't contain herself around Zach Galifianakis https://t.co/XKUnYnIHzF Me: :(\n\nAnyone: *adjusts in their chair and it sounds like they farted*\n\nMe: :) Are you embarrassingly awkward? Us too. Thankfully, the fine folks at the Association of How to Behave Normally have put together some tips on how to stay smooth. @Snickers #ad https://t.co/q5XynSUsCe May The Fourth Be With You! https://t.co/Dl5lNViJ8k May the 4th be with Indie Cinema.\n\nWatch the full trailer here: https://t.co/ltjkN4JViD https://t.co/7MZlUz93L7 Don't lie. You always hum along to the Game of Thrones theme. https://t.co/U8GOmo5ONl Maryland twitter roll call. https://t.co/S8a6f0RN5Q Brb buying a parrot so that I may vanquish my enemies https://t.co/JYBKXW7YzB That red-eyed thousand mile stare is just so good https://t.co/PYE33H7HTu How could you like a post from a year ago? You’re smoother than that! @Snickers #ad https://t.co/leChdR98cJ A once in a lifetime opportunity! https://t.co/jARVqcJXEP I don't know what I was expecting but it certainly wasn't this https://t.co/1VvWWldUUj Remember the 'Saved by the Bell' when Zack Morris impersonated a woman named Bambi to abusively date Screech? Zack Morris is trash. https://t.co/vf7L0eWefk Remember Roxette? That's it. That's the tweet. They always say you need to dress for success!\n\nWatch the full video here: https://t.co/wPUFIpFN6K https://t.co/NeejFSYfAQ I'll be hanging out on Google Translate for the rest of the day https://t.co/peguh8Qqyz TONIGHT on @SHODesusandMero: The Bodega Boys kick it with comedic legend @sethrogen at 11/10c. Only on #ShowtimeLateNight https://t.co/oK3Zsfaehp Why, why, why? Stay smooth, even in awkward situations. @Snickers #ad https://t.co/fDFkvKC1gg This is genuinely kind of poetic https://t.co/E5yKvcRssQ when the waiter ignores you https://t.co/jPH21BFXNa DENTIST: you need to floss every day\nME: https://t.co/rqdSU8i9WJ This will never stop being funny https://t.co/DPJOxUSsNl Which @GlennHowerton pet peeve is your biggest pet peeve? I'd rather be dead than have to greet everyone who attends my funeral @Turd_Ferguson SHE JUST HAS A LOT OF FEELINGS @TheyCallMeCarg Thanks I hate it What a festive way to convey the worst possible news. https://t.co/tK5xMUQsx6 If I had to see this then so do all of you\nhttps://t.co/RLhfCEcynU DC / MARVEL https://t.co/O83XS5Iirs What it would be like if Black Mirror was more realistic: https://t.co/VbrZtTjT2w https://t.co/m4Lu0d2o49 Make sure your weird roommate isn’t on the text chain before you rant about him. @Snickers #ad https://t.co/APhI8dCZ8w If you gave me the choice between dating someone I met in line at the DMV and someone from Facebook I would choose the DMV every time https://t.co/FMZwfwhGwg Déjà vu happens because you died in a parallel universe OR your brain broke. No middle ground there. https://t.co/NCGU6P0PxX Wish we could go back to the olden days when roosters would wake us up so I could show up late to work and say my rooster died Jeff Daniels forced the blues a little too hard.\n\nWatch the full video here: https://t.co/7cyhBYemxb https://t.co/zFDoji4aAL It's an acquired taste. https://t.co/NkbArjNsLt \"Is butter a carb??\" https://t.co/ToiEVtp33J This is a crime against humanity and someone needs to pay https://t.co/Y9aryntF7g The new Sonic looks like a damn snack https://t.co/menp5H9SDy https://t.co/9V5WexQphl When it's not gonna be May/ When it's gonna be May https://t.co/8xo1PHzKCR Jonathan Van Ness (@jvn) loves three things, Maison Margiela, Ayanna Pressley, and Game of Thrones. This week he is joined by the amazing @itsgabrielleu. https://t.co/gHF09VXzI2 Most people who've become successful in life said they started practicing daily affirmations as sperm Great Lash mascara and frosty blue eyeshadow is really what got all of us through middle school https://t.co/KgFbsVfyKD Chuck e Cheese is: I thought I was ready but HOOO BOY I WAS NOT READY https://t.co/PB6DVo8JAt \"Bizarre\" and \"I didn't really understand what was going for most of it\" is how this podcast would like to be remembered.\n\nListen to the full episode here: https://t.co/WMK86F1gZK https://t.co/Tmx2BrClK6 more like Wouldn't Stock https://t.co/swT8JHwPqP Everyone watching Game Of Thrones last night https://t.co/QJ5rO9JpH2 Two of the worst people ever run into each other in pilates class. https://t.co/QKaKLcGkp9 Do you know a backseat googler?\nhttps://t.co/v8ogBlvurh https://t.co/Or6GTzam8c The main reason human's have tongues is to tell people not to name their kids Chad These couples are very confused about sex. https://t.co/cA4v3M3sPb Stay to the end of avengers endgame to eat all the popcorn people left behind We’re rooting for you. You can do this. You can be smooth. @Snickers #ad https://t.co/m5ggzAaMVB FREE MY MANS https://t.co/vVR1RmXEr3 Finally a fair press junket interview.\n\nWatch the full video here: https://t.co/IdLSYxA7rA https://t.co/LQoR3mdCIz Sex with Superman is clearly too good to turn down. https://t.co/55YSbokAE7 @cottoncandaddy Congratulations son Zach Galifianakis learned the hard way that you don't fuck with Steve Carell! https://t.co/TmAtLlMZlK Whoever decided that Macaulay Culkin's character would die in 'My Girl' should go to jail for ruining my childhood Ron Burgundy has some choice words for the San Diego Chicken.\n\nListen to the full episode here: https://t.co/WMK86EJG8c https://t.co/RG72TaG2zv Life after sports isn't always easy. That's why you need a backup plan.\nhttps://t.co/IpULrx7d6l https://t.co/3CpYRYVP7j A New D̶r̶a̶g̶o̶n̶ https://t.co/WMWUPyb4c5 Your girlfriend's dad could be your biggest dating challenge.\n\nWatch the full video here: https://t.co/9vUIWGg9JW https://t.co/ci7dsWzLy4 This show is a gift to sketch comedy and the world and it's probably going to become your new favorite https://t.co/WxvnmZNTEk Who's your favorite Avenger? Get ready to be spun right round baby right round (like a record baby right round round round) https://t.co/0kJ2jRNNc7 The Dark Web is a murky sea of suspicious activity and witty spokespeople. Thankfully, Discover is monitoring thousands of Dark Web sites and will alert cardmembers if their information is found! Sign up for @Discover Free Social Security Number Alerts #ad https://t.co/A27peLWNkk https://t.co/Oa28zSiMph The Mother of Dragons can do anything, including apparently, a pretty good impression of the King In The North. https://t.co/N79jsxZvxS Remember the 'Saved by the Bell' when Zack Morris gave Screech an unpaid law enforcement job after forgetting his birthday? Zack Morris is trash. https://t.co/OFQZJnlHE0 *Me, screaming while doing a cannonball into a pool full of people*\n\n\"There's an average of 100 milliliters of piss and sperm in every poooooool\" @IronKneebone Bold of you to assume my 11 year old son can read @ksadair This is slander @JonGauster Sir this is twitter @Jackiewiles We need a support group Find true wokeness by uniting your inner Ye:\nhttps://t.co/LXmQmJ7Ga0 https://t.co/RM8Gc5TUsY Just a super normal day https://t.co/yMqVwCxtNm Honestly this deserves a Grammy https://t.co/Ynn1HCBPdM In true Ron Burgundy fashion, the last guest of Season 1 is.....a chicken. https://t.co/HbZ6VVzK2y when you make a great toast but still gotta fill your own glass so you can cheers https://t.co/TxBXdj66lG This is the exact face my mom makes when she wants to yell at me but we have company https://t.co/cLTJ8adqBM @ManMadeMoon vicious but fine af The new Bond villain is sexy as hell https://t.co/rVwjzYoyal Getting called to jury duty is just the beginning of a glorious journey. https://t.co/xCs5WuRSXz Wake me up when I'm Jean Luc Picard After the month he's had, I'd be wailing some Prince at the nearest dive bar too https://t.co/EnEOBf7xw0 What a time to be alive https://t.co/PlPp7AasHK Would you rather: Honestly who even needs a boyfriend https://t.co/HKvxGYBj2s Some of us just prefer men with small dicks who cum fast. https://t.co/RqQo2ENvEz Roses are red \nViolets are blue\nKeep your goddamn mouth closed\nWhenever you chew when i drop my phone but it doesn’t crack https://t.co/W64DyyIzhi But how will we know where all the dads are? https://t.co/Fhuj1kdPkr Have all of your anxieties put to rest with this soft-spoken mantra that's as soothing as it is witty https://t.co/p1myuFLgwb Look we can't all be artists but we can all certainly laugh at these hilarious failed attempts https://t.co/Oo8c9KbXZJ when my spouse farts in bed vs when i fart in bed https://t.co/9KiO6BXEbm I really don't need this right now https://t.co/wL9jWc9OCb Jonathan Van Ness (@jvn) loves three things: Petee’s Pies, Micellar water, and Game of Thrones. This week he is joined by the fabulous @AnnaKFaris. https://t.co/K8vZwsStqV The world would be a better place if there were more people named \"Sock\" out there. Are these the worst coffee snobs ever?\nhttps://t.co/0kar5Q0c1P https://t.co/CCKqioUn6f I feel LIED TO and BETRAYED https://t.co/v8b6mkWLTp Whatever the fight was about, he was hopping mad https://t.co/OKTuUaeyNb Thank you Mother Earth for every thing you give us except pigeons Who is your favorite Simpsons character? Ron Burgundy could use some help on his British accent.\n\nListen to the full episode here: https://t.co/0pGxBth3oe https://t.co/U30gavkWxQ @diddoliciouse Hi! This is an excellent question. No Soooooo Arya grew up REAL QUICK https://t.co/2gMtCmT6oT Changing the name of \"Resting bitch face\" to \"Resting Bran face\" https://t.co/ZAMxlFpCua Captain Planet (Don Cheadle) has a very important message for you this Earth Day! https://t.co/wwjobVMFEM Whoever made the neverending story owes us some sort of compensation for making us watch that horse die in the quick sand Are you qualified for Coachella? How would you handle the questions David Spade has for Charlotte Mckinney? https://t.co/i8yNFwHuuy Listen to all of Louie Anderson's amazing facts here: https://t.co/w1j5O2GWDb https://t.co/VnYgrqFBev The miracle of easter is that the bunny has been kid rock the whole time https://t.co/RrFl16ansL What really happened at the last supper https://t.co/QaAwGbICYq The best part of easter is when the man inside the bunny costume removes his head and body, and eats a cold calzone while staring into his open refrigerator Witness one man's journey into the hazy smokey light. https://t.co/D2oIjKrcZs Ron Burgundy spills the (British) tea with Carolina.\n\nListen to the full episode here: https://t.co/0pGxBth3oe https://t.co/451zlfv5dz Ever wonder what 'weed' stands for?\n\nW smoke\nE weed\nE very\nD day If you love indie films, you'll love The Dirty Garage:\nhttps://t.co/azoeeEpLp6 https://t.co/dHeFm2LYBk What's your favorite way of getting high? The History of 420 as told by Cheech and Chong. https://t.co/GgSnjTEjo4 Jonathan Van Ness (@jvn) needs Evil Carol Brady (Cersei Lannister) to get herself some texture foam and pomade!\n\nWatch the latest episode of Gay of Thrones here: https://t.co/fvtF1Cnp9s https://t.co/7EWPbguhgO Remember the time Zack Morris unleashed a plague of rodents? Zack Morris is trash. https://t.co/gaolWoRATk I love to \n\nD ookie\nI n\nE very\nT oilet This episode of The Ron Burgundy Podcast is -- in Ron's words -- \"bloody brilliant\". https://t.co/tcsR6zQZgs What's your favorite type of exercise? How many obscure indie bands are going to call themselves \"Harm to Ongoing Matter\" after this https://t.co/TutJsxjslk RT @Gusbuckets: Check out the sketch we shot for Funny or Die, directed by @ThisTim.\ncritics are saying it's the best tire-themed sketch i… This is one drunk tale for the books https://t.co/qF5nfUrRyM ME: Look but don't make it obvious \n\nMY FRIENDS: https://t.co/INzrjCNfbO The Mueller Report, Page 290 https://t.co/VS6jZGsV7g He should go to HR about it https://t.co/74mXlz95Tw Spider-Man looks ready to take the biggest step of all. https://t.co/bYUpW8lub8 The main difference between alligators and crocodiles is i’m not sexually attracted to gross ass crocodiles The best cure for that Wednesday lull is with some good old fashioned lols https://t.co/cZVsctsO1L hank somlo and chawbucca https://t.co/smceSatdi6 Alright everybody needs to calm down a little bit https://t.co/Sw1JeRYTKR Jurassic Park reviewed by a robot https://t.co/ceRx2cu6MZ Doing great on my new years resolution to go* to** the*** gym****\n\n*jerk\n**off\n***my\n****dick What's your favorite summer activity? Finally a way for everyone to be successful.\n\nWatch the full video here: https://t.co/wPUFIpocfc https://t.co/4ZSBojNbPW Avengers endgame spoiler: your wife leaves you at the end. Here's our official 4/20 uniform \n\nhttps://t.co/ThMbrwFLB1 https://t.co/K2cuMFZZuP Jonathan (@jvn) loves three things - chocolate covered pretzels, Ivy Park running shorts, and Game of Thrones. https://t.co/mNDQ5esdOT Turn any carpet into a glamorous red carpet by bleeding profusely @RealChrisCal @cottoncandaddy She’s alright The future of having children is terrifying!\n\nWatch the full video here: https://t.co/VbrZtTjT2w https://t.co/389mmqjIJr Name ONE cop movie where the chief of police doesn't say \"the FBI's up my ass\" https://t.co/gI0vI2mQ2p FOR THE INTERNET IS DARK AND FULL OF SPOILERS https://t.co/iNM9pLsOU6 HOW TO RELAX\n\n- Drink tea\n- Meditate\n- Take a bath\n- Tell everyone to shut the fuck up We're not sure if Ron Burgundy has ever actually seen an episode of Game of Thrones.\n\nListen to the full episode here: https://t.co/oBDVjaY71g https://t.co/s3jovOPhQw wow, when Ariana Grande forgot the words to her song, ALL of her uncles showed up to help https://t.co/qgJdeVXBRA https://t.co/MiGzHt7A7v https://t.co/K2PSjrk8CD https://t.co/3GLBixpxFO https://t.co/fARJaNVfA0 Nicolas Cage as Teletubbies: A Thread https://t.co/k9UpjOnGrv We get that he's been through a lot...but quit staring https://t.co/UW9b40Etn6 every dad immediately after making a bad joke https://t.co/epXry4m01J When your fishing poles just aren't cutting it, maybe it's time to step up and use what the REAL fishing pro's use. https://t.co/Kclty9C0qj Dave Franco learns that sometimes you just gotta love yourself. https://t.co/RubJVE16pD Your girlfriends dad just wants to get to know you better. Thats all.\n\nWatch the full video here: https://t.co/9vUIWGg9JW https://t.co/0CiuNFMb0G Who is your favorite Game Of Thrones character? How do you say #EraseFoodWaste in Dothraki tho?\n\nWatch now: https://t.co/CnJU2adTcG @mortonsalt #ad https://t.co/QmFjhDCkla If you won't be singing along tonight, there may be something wrong with you. https://t.co/o5HN5bpMpR Trae Crowder and his fellow Liberal Rednecks get a taste of the nudist lifestyle at a gay naturist retreat https://t.co/ir2SyjdwUl Peter Dinklage's daughter wrote a poem, and boy does Ron Burgundy have some colorful commentary for it.\n\nListen to the full episode here: https://t.co/oBDVjaY71g https://t.co/eI7q6Enu4G Finding good Thai food can be hard when you have a backseat googler:\nhttps://t.co/v8ogBlvurh https://t.co/TOoYNIWrRE Rebecca Romijn won't just give you a helping hand. She'll give you two! https://t.co/cnufU2UxSB Is this a more fair and balanced interview?\nhttps://t.co/IdLSYxA7rA https://t.co/KbfJzrQjUx I've gotten to the age where the words \"music festival\" send a shiver down my spine Be the MVP of happy hour with new, lightweight, water-resistant @JCrew Tech Pants. #ad https://t.co/Yj8dlYBnO6 https://t.co/9tX4TembkU When you fucking love jackets https://t.co/XDESpaIvQe Remember the 'Saved by the Bell' when Zack Morris committed international kidnapping to fix a chess game? Zack Morris is trash. https://t.co/v5vvpJC79f I hope the internet can come together and agree that sandwiches are good. Find inner peace with this unique guided meditation:\nhttps://t.co/LXmQmJph1y https://t.co/5DEewsqkqL Roses are red, violets are blue, Ron Burgundy talks to Peter Dinklage about poetry, koo-koo-kachoo https://t.co/WRTZmyn8VA Here's an idea: If Samuel L. Jackson is in the movie, maybe your kid shouldn't see it! https://t.co/2uQgjFlL4K My neck\nMy pussy\nMy crack\nMy ass\nMy inability to remember the correct order of things Wow hot new summer trends to watch for!!!!!!!! https://t.co/ZzhO1LkUva Gay of Thrones with @jvn is back for the final season next Tuesday! https://t.co/no62aciRPJ when my roommate is watching a movie with a date but i want to watch too https://t.co/fzGmhb5RWa Heavy \"nedal\" is the only thing I care about this week https://t.co/Yf1QdGnHwb now i look pretty smart for wearing a diaper all the time https://t.co/WAnzoSmAXy What's your favorite Avengers Endgame character? wow nasa released the first picture of garfield's butthole https://t.co/BeccrdRqHS You may now call me \"Tire Guy\" BECAUSE I GET TIRES. https://t.co/sS4FnQo2W5 Some people take Coffee way too seriously:\nhttps://t.co/0kar5PIBah https://t.co/9r5u74bVHL The easiest way to get someone to reply to you is to say \"don't @ me\" Is Harrison Barnes ready for life after basketball?\nhttps://t.co/IpULrwPBHL https://t.co/TpZUbjnMQi that was quick https://t.co/b6tejEsfPQ My mind is like a goldfish, so this is super relatable. https://t.co/sSm6t08EWT @MichaelaOkla @cottoncandaddy this chic tweet happened on a Tuesday maybe not so useless after all Tuesdays are like male nipples, useless Parks and Rec turns 10 today!! Happy birthday! https://t.co/a9B5Y52Scp I didn't think I'd ever be happy to see 2012 tumblr posts make a comeback, but here we are, it's hilarious https://t.co/neasqCoaxD A face only a mother could love. https://t.co/RK6oa0mPXb Here is one girl's journey to being diverse, but like REALLY diverse. https://t.co/yhCbXa0oyJ Santa is probably bored as shit right now Google these facts and tell us that Louie Anderson is wrong:\nhttps://t.co/w1j5O2GWDb https://t.co/d2oyFrrToG Even The Night King made an appearance! https://t.co/vwb18p6vuH What is the sexiest body part? me texting when my mom can see my screen https://t.co/UEHn23eYGW You have the chance to help us take home some Webbys and you don't even have to leave your couch! https://t.co/bq8TKtCq8p Are you ready to show your boss who’s actually the boss? With @Jcrew Tech Pants, it's you, dude. #ad https://t.co/4Utt2b4ItA https://t.co/GkyS1Es1JB According to my calculations..\n\n  ━━━━━ ━━\n┃ I STILL USE    ┃\n┃ MY FINGERS  ┃\n┃  TO ADD         ┃\n┃      3 + 4          ┃     \n└━━━━━━  ┘\n 7 ┃ 8┃  9┃  / ┃\n━┛━┛━. |━  ┛\n4  ┃5 ┃6  ┃ + ┃\n━┛━┛━┛━ ┛\n1  ┃ 2 ┃ 3 ┃ = ┃\n━┛━┛━┛━ ┛ Vinnie Jones will do whatever it takes to get you in shape! https://t.co/sXVwEItwV5 If there's one thing I learned in high school it's that I have trouble paying attention for hey who wants to get high behind the bleachers Sex is like riding a bike, my balls always hurt Never forget this is what @chrissyteigen has to deal with every day. https://t.co/lyNWFakJU6 In the bathroom no one can hear you scream https://t.co/XrTvuUhmkz Finally a show for the city's real heroes!\nhttps://t.co/o4LcKdu3YB https://t.co/AfRdv34GcZ Ryan Gosling can act from like here to all the way over there https://t.co/o9LtWAznHj This guy will help you get the biggest balls in town. https://t.co/Q90LNIVCuo DATE: I don't think it's gonna work out between us\n\nME, TAKING APART A BURGER AND PLACING THE TOMATOES WHERE THE BREAD SHOULD GO: Why??? My family's face when I watch porn but forget my bluetooth is connected to the living room speakers https://t.co/b9xJVXwNVl We honestly can’t decide which one’s worse: a haunted garage or a midnight trash pick up.\n\nListen to the full episode here: https://t.co/flSw4tnUZK https://t.co/NJtmhZXyh9 Is the Kevin Bacon Actor diet too extreme for you?\nhttps://t.co/FaCwfqJXZd https://t.co/uPhvKyCuLb 5 out of 5 dentists agree: your breath smells like shit This sorority letter is real and only Michael Shannon can do it justice https://t.co/opczx6tYFV Even Macklemore and Ryan Lewis had a hard time with record producers: https://t.co/NFb3K1otY1 https://t.co/BW5UTVOSdw 15 minutes normally\n\n▶️ 🔘──────── 15:00 \n\n15 minutes when i'm waiting for food delivery\n\n▶️ 🔘──────── 1231:97:83 'Strange Planet' is a look at human nature that's truly out of this world https://t.co/C3q3g45rXI Stay active(ish) all day long with the new @JCrew Tech Shorts. #ad\nhttps://t.co/GizxiIX0Ig https://t.co/1eYwH5QP8v What would the combined forces of Darth Vader and Gordon Ramsay be like? (Hint: insanely funny) https://t.co/fDjqpkGXUY Me, to my lazy fucking cat who hasn't gotten off the couch in 3 days:\n\n\"More like pet sedentary\" Felt cute, might delete later https://t.co/KJRPPHyDAl Remember the 'Saved by the Bell' when Zack Morris got his friend struck by lightning then exploited him? Zack Morris is trash. https://t.co/S6VnyZpfTY cookie monster is the most relatable sesame street character because we both struggle with addiction How was he SUPPOSED to pay for a ticket when he doesn't even have POCKETS https://t.co/gVoSZm393l Never before has an indie film been this indie: https://t.co/azoeeEHmNG https://t.co/q9bEtq4ohK Destroy someone in an argument by saying \"well...I play the accordion, so fuck you\" and walking away Stay smooth, even while Insta-stalking, with Creamy @Snickers Peanut Butter. #ad https://t.co/VzmBFD577c No, juice is fruit MILK https://t.co/RiaHxz83iA Who ya gonna call? Ron Burgundy! https://t.co/0tqcmbI3o6 Dr. Dolittle rewrote the laws of nature. https://t.co/qGtk1RJ4kK I’d rather complain for ten years about receiving a spam email than to take four seconds to unsubscribe from it They didn't move for OVER AN HOURRRRRRR https://t.co/hJ1KG1k3sf MOM: Does your new boyfriend have a car?\n\nME: Duh...\n\nMY BOYFRIEND'S CAR: https://t.co/QUIWwN1SdL @SJSchauer I know you can’t necessarily “win” at drinking games but also you definitely won at our drinking game This Friday we'll finally find out if Zack Morris is trash https://t.co/ShqYMwfWa5 He’s back and he’s trapped in Central Florida. The new season of Brockmire premieres tonight on @IFC. https://t.co/0L366IDGol @MichaelaOkla Please collect your children, they are horrifying When you’re called upon to be a hero, do it in @JCrew Tech Shorts. #ad https://t.co/EYaatA6Irl https://t.co/AvIbGaQRSj Who allowed this to become a thing https://t.co/B5qrOj2EMm Waking up to see that the Joker trailer is out https://t.co/GvTlo91u7E The morning after sex with a stranger is only as weird as you make it. https://t.co/NxfAJv3S9e The Marie Kondo method really helps you clean the unwanted boyfriend refuse from your life. https://t.co/2JG1yImM7z Meeting the parents doesn't get weirder than this: https://t.co/9vUIWGg9JW https://t.co/JaNDIvK9UR These honestly had me in tears https://t.co/0b5TfgW2Px who wants to tell Patti that it used to be 140 https://t.co/vbj4K4v7h5 This is why cops go to therapy. https://t.co/t7GVxctJNe Robert Smith's level of enthusiasm is how I've felt for all of 2019 so far https://t.co/o3L1MPMXUp Enjoy these gifs in honor of the new bat-and-ball season. https://t.co/UNUXAUNCY3 Don’t be unsmooth. Try Creamy @Snickers Almond Butter and stay smooth, even in awkward situations. #ad https://t.co/4AuCnV2s3p @camdron5000 of the universe Robert Smith for president https://t.co/To3SFQL9sv This is not an April Fools joke https://t.co/6qQbszrWNz Ron Burgundy asks a psychic about the wrong kind of crystal\n\nListen to the whole episode here: https://t.co/dKN7X9B7Ln https://t.co/BeMqvW6LeH Ok if Mondays are your day off you are exempt from this People that love Mondays are the same kind of people that enjoy doing their taxes Who had one? https://t.co/jbMa4S8R3G don't you hate when you ask the barber for a little trim and they end up cutting off all your pubes I've always wondered where they came from. https://t.co/gBMIi1LhEN The Game of Thrones map just keeps getting weirder and weirder. https://t.co/ptcStHSZIC FRIEND: i had this dream last night where-\nME: *desperately searching room for real life mute button* You gotta get your priorities straight. https://t.co/NTZU1ZRpxo When I'm asked to bring something to a potluck https://t.co/Sq6uxMPbX7 Players get some weird questions at March Madness press conferences. https://t.co/cteiGua8h5 Remember that time Zach Galifianakis tried to interview Brad Pitt. https://t.co/upR2bTosI2 ME: :(\n\nMARCH MADNESS: 🏀\n\nME: :) When I show up to a party 20 minutes early https://t.co/eleUIZYNHg He’s sober but he’s still the same Brockmire. The new season starts Wednesday on @IFC. https://t.co/E4VGB44UKG Ron Burgundy knows the best way to reveal the truth about our past, present, and future: talk to a psychic.\n\nListen to the whole episode here: https://t.co/dKN7X9B7Ln https://t.co/Qr5LShWaZm i am legally required to wear a hannibal lecter mask when i go to a buffet to prevent me from eating all the food Jesse Williams and Camilla Belle star in the final installment of the Dirty Dancing Trilogy https://t.co/250OZhAdP1 Fashion has gone too far https://t.co/WaUd3gJV2z This is the best budding friendship of 2019 https://t.co/viT8U8hLMq Quit playing games with my heart https://t.co/W9P1rXvBEf |￣￣￣￣￣￣| \n|     THEY       |\n|       DO         | \n|＿＿＿＿＿＿| \n (\\__/)  || \n (•ㅅ•) || \n / 　 づ https://t.co/kvt9ZlEAx8 I have so many questions https://t.co/NDMKZy1vws Congratulations to @jvn on Queer Eye’s win for Outstanding Reality Program at the @GLAAD Media Awards! https://t.co/xQiZEA8puj Remember the 'Blossom' when a kid brought a gun to school and Joey met an alcoholic clown? It was a very special episode. https://t.co/ctbRykOK1k i put on my pants just like everyone else - only when i absolutely have to Ron Burgundy doesn't need a psychic to predict co-host Carolina's love life. https://t.co/TCJLtmDmvB ME: (awkward silence)\n\nDATE: (awkward silence)\n\nME: (awkward silence)\n\nDATE: (awkward silence)\n\nME: https://t.co/u1PSHo2ZqG your teeth say a lot about you https://t.co/Hw0jlAcqfo I mean in terms of Uber drivers, we'd love to get this guy. https://t.co/kEIlfOCUK9 This should be ILLEGAL I will CALL THE POLICE https://t.co/AMbjrrGVLm So @ShakeyGraves stopped by our office and performed some songs. In our bathroom. https://t.co/Ri7TzGDdIU Interviewing your co-star is awkward enough without your questions getting switched. Full Interview here: https://t.co/IdLSYxRIQa https://t.co/cQPcCBWr9U If my dog ever figures out he can blame farts on me, i’m done for What's the most important feature of the iPhone? https://t.co/BkHncwBqJi Who else knows a backseat googler?\nhttps://t.co/v8ogBlvurh https://t.co/qtiRtgKFzw Brockmire premieres next week on @IFC, but we’re giving you the first episode now. Lucky you. https://t.co/UTY3jsNn3q ME: thank you\nCASHIER: no, thank YOU\nME: https://t.co/aUKuxggzY1 Just a super normal day in the Senate https://t.co/qhX6cgjlva do i need to binge every old season if i want to start watching baseball tomorrow? This trailer mash-up for ‘Us’ is absolutely terrifying... https://t.co/pLteX62QqL Of all the sexistential crises I've seen, this one takes it. https://t.co/rT5cmD4gbT These thieves really are what they ate https://t.co/peKwOs9drw Barney the dinosaur + Bruce Willis = Thanos Aw man did we take a wrong turn at Belgium AGAIN https://t.co/gXFm6emKpR no one:\n\njk rowling: attorney general william barr is actually grown up harry potter https://t.co/cTkwiRQRVF My wish is for it to be 5:00 so I can go home https://t.co/JbkyZoYaHu google, show me everything white people like https://t.co/QwQ5LbTDxr Ok I know I'm an adult but I WILL buy these for myself, I don't care https://t.co/wigMaCxDmC Make them almost look you in the eyes https://t.co/lzaotduNbu These are the REAL heroes of Chicago:\nhttps://t.co/o4LcKdLEQ9 https://t.co/BYTCaGaV84 INSTAGRAM STORY WHEN I’M SOBER\n____________ _____________\n\nINSTAGRAM STORY WHEN I’M DRUNK\n……………………………………. Staying woke isn't easy:\nhttps://t.co/LXmQmJph1y https://t.co/VwdBRllNKT My new zodiac is \"Florida man slapped with Big Mouth Billy Bass singing fish after argument\" and that just feels right https://t.co/bhHIEsrsYy Now that @RobGronkowski is retired he can focus on his true calling: acting in Rob Gronkowski fan fiction https://t.co/NmqQC4NEdq And now, a very important anti-bullying message from Mr. Ron Burgundy.\n\nListen to the full episode here: https://t.co/EcQYNZmOR6 https://t.co/xX3Gw8MJh7 DON'T PLAY WITH MY HEART LIKE THIS https://t.co/d1sjTj3HG4 When my coworker sneezes on me https://t.co/NHaCiwnaU5 my mom when she was pregnant with me\n\n|              |\n|              |\n|               \\\n|                 \\\n|                   \\\n|                     \\\n|                      \\\n|            💩     /\n|                    /\n|                  /\n|                 | The Harry Potter reveal we never saw coming https://t.co/gacdx653Yc Any park can be a dog park if you let your dog shit everywhere ME: Will you marry me?\n\nMY GIRLFRIEND: No\n\nMY WIFE: What the fuck? Retweet if Sunday depression We all know 'Would You Rather' can get dirty, but this is just insane. https://t.co/p6xL4nfnho Throwing out perfectly good snacks? Not on this guy's court. @mortonsalt #EraseFoodWaste #SavedIt #ad https://t.co/aoPW76pmw6 Coffee Snobs are the worst: https://t.co/0kar5PIBah https://t.co/clGXlUSIZB Checkmate! This new trailer for 'The Little Mermaid' movie makes 'Aladdin' look tame. https://t.co/SeWSJqXnP6 Dating gets A LOT harder in your 30s https://t.co/JocgHWTYF4 ME: i’m going to have a productive weekend\n\nALSO ME: i should pee in a bucket so i don’t have to leave my couch during march madness Save time and money at the movies by bringing your own stick of butter to rub on your popcorn Ron Burgundy learns that a swirly is NOT an ice cream treat.\n\nListen to the full episode here: https://t.co/EcQYNZmOR6 https://t.co/N4FXEQ0hc1 METEOROLOGIST: it's finally warm enough to grill!\n\nDADS: https://t.co/McED0tJRWm You gotta have the right name if you wanna sell records:\nhttps://t.co/NFb3K16Szr https://t.co/Om0Edg0F6L Take these gifs and grow strong with them. https://t.co/967BVRV7cL Dave Franco and Chris Mintz-Plasse talk way too dirty https://t.co/vqdNHLpXAv don't talk to me until i've spit in your morning coffee This is honestly next level https://t.co/rbvs71u7y6 What a lucky burrito https://t.co/qesHTu6USi After the long wait, the redacted version of Mueller's report is here https://t.co/PzwdB54IBy me eating a frozen pizza https://t.co/CG0lqDByKP Remember the 'Webster' when he set the apartment on fire with a chemistry set? It was a very special episode. https://t.co/oyRbShboNj All sports stars need a backup plan:\nhttps://t.co/IpULrwPBHL https://t.co/SQsOSBailG You ever have that problem where you forget to pull up your pants after going to the bathroom? Steven Seagal is an extra in it. https://t.co/YaurJEXNGt ┏┓  \n┃┃╱╲ in this house\n┃╱╱╲╲  we hang\n╱╱╭╮╲╲  our toilet\n▔▏┗┛▕▔    paper\n╱▔▔▔▔▔▔▔▔▔▔╲   \n      OVER NOT UNDER\n╱╱┏┳┓╭╮┏┳┓ ╲╲ \n▔▏┗┻┛┃┃┗┻┛▕▔ The stand-up/music hybrid series features one hell of a talent roster https://t.co/nwu8KsmFW5 @mattsinger @GermainLussier Thank you for your service Even handsome celebrities -- like Ron Burgundy -- are not immune from being bullied. https://t.co/rP1gtLZQoE Why isn't RoboCop just dropped into every movie??? https://t.co/RqvqsjQ1qa @OhNoSheTwitnt @DancesWithTamis yes @ExDinosaur one hungover person Roses are red\nViolets are blue\nIt's national poetry day\nThere's a corn in my poo Rubí is a telenovela so insane, you should probably sit down to watch this. https://t.co/Qg4Vp71Gjv Believe these facts or don't. Louie Anderson doesn't care one bit.\nHear them all here: https://t.co/w1j5O2GWDb https://t.co/uwgIiIaF2b my favorite part of a musical is when everyone bows because it means i can go home If there's one place I trust to make quality lasagna, it's a Garfield restaurant https://t.co/gZgI6SOSYJ The indie film to end all indie films: https://t.co/azoeeEHmNG https://t.co/qYHsdFFjwD Are blarjebs cheating? A case study. https://t.co/ha3NG42jWX From now on i will only communicate with people in Elf Gifs https://t.co/a2SRFvlPJF Crazy how you don't have to be literally the worst person ever in order to be funny https://t.co/DvhBeM6Q3g We’re a nation of foodies but, somehow, Americans manage to waste nearly 150,000 tons of food – every day. Kinda mind-blowing if you think about it. @mortonsalt #ad \n\nVisit https://t.co/y2P4bnjEGG for no-waste recipes and share your season highlights with #erasefoodwaste https://t.co/UssyDARsgL When I see the Stranger Things 3 trailer VS when I realize it's not out till July https://t.co/OwA8gUpVDY Something to try for your next dinner guests. https://t.co/I4Bx7amGYg What were Canadian advertisers even ON https://t.co/wqDuKvNw6p *waking up suddenly in the middle of the night* it was ME who let the dogs out If you want to be an A-List actor, you need to eat like one:\nhttps://t.co/FaCwfqsn7F https://t.co/cmXZAL6DR5 Listening at 2x is up there with the 'Skip Credits' button. https://t.co/tzdnzDmmHe Is there a magic spell to get her to stop https://t.co/kKBF3Qs2Sp The Seinfeld gang has never been cuter https://t.co/DNIs5Od3RR How To Play 'Annoying Co-Worker' https://t.co/kZNOogEtXx Finally an answer for why it takes so damn long to get off an airplane! https://t.co/ezu62UalbM Before every game of pool, I like to intimidate my opponents by eating the chalk cube When people ask why the Bible is my favorite book, I show them this. https://t.co/bypwmMNEO4 Is cleaning your boyfriend's apartment sparking joy? https://t.co/ti9vq2xoPz She bleats her mind and I appreciate that in a politician https://t.co/HQxDVrvsMt Whoever talks the least https://t.co/v8dvhDHDwG Have you ever wanted to chat with THE Ron Burgundy? Well, now ya can. Call the @burgundypodcast at (213) 394-6474 and tell us which of these 3 topics you have to talk to Ron about: golfers from the 70's...favorite types of cheese...or wolf-dog hybrids! These 3 topics only!!! So sorry about this https://t.co/CNKB1tHBXd The perfect yoga class doesn't exi- https://t.co/oAzjUAr1R8 @NJDevilNYGuy that works too Feel free to let out a burp and blame it on us Ron Burgundy wrote a heartwarming song dedicated to his Aunt Louise and it is truly beautiful.\n\nListen to the full episode here: https://t.co/wwd6NhiIB9 https://t.co/0Sg7GX9GkW hope everyone enjoys taking a green shit today Sometimes the reasons you're unpopular aren't as obvious as you might think https://t.co/updeBvMfCE A handy product designed to help women get the support they need.\nhttps://t.co/thMKLjhYYJ The tips are counterintuitive BUT THEY WORK. https://t.co/NhHUhSbz13 Denis Leary has some cold hard truths for St. Patrick's Day https://t.co/7S6veV657S If you think i'm going anywhere near a green beer today, you're delusional. ROOMMATE: did you buy these green bagels for st patricks day?\nME (bought regular bagels like 3 weeks ago): uh....yeah Next time you have a Green Beer on St. Patrick's Day, keep in mind where it actually comes from! https://t.co/3VwQP9uVcw Clap On lights may be a fun novelty, but they can really kill the romance. https://t.co/oUKPs2ugnI me explaining what everyone owes after a group meal https://t.co/jskkXldkhe Ron Burgundy finally created a theme song for the podcast and let's just say the feedback has been...mixed.\n\nListen to the full episode here: https://t.co/wwd6NhiIB9 https://t.co/XbWQyPMveh There's gonna be a lot of weird stuff happening on the new season of Game of Thrones. https://t.co/gUNNCXOmHm Remember the ‘That’s So Raven’ when they battled racism at the mall? It was a very special episode. https://t.co/cumQ5mkVqg Honestly I'd rather drink with my dog than people anyway https://t.co/mXo4YcTzLs What happens when two stars read the interview questions intended for them? Watch the full interview here: https://t.co/IdLSYxA7rA https://t.co/CEbW0iGBSo Kratu is the champion of my heart https://t.co/yLT5lZnedF Who's the sexiest actor? if everyone leaves work right now we can't ALL get in trouble You've seen Chicago's police, firemen, and doctors in action. Now get ready for their sanitation workers: https://t.co/o4LcKdu3YB https://t.co/9D5QoStuoO Although 10/10 Uncle Phil would not make a good AirBnB option. https://t.co/6h97VwV6bM Dude, is Beto actually, like.... a poser?? https://t.co/TEZrjBuNEN What's that old saying about the pot and the kettle? https://t.co/PRznMBo1Va THIS IS NOT OK https://t.co/i6VLeIM5Xj Anchorman, podcaster, and now songwriter? What can't Ron Burgundy do? https://t.co/Nyncmps8sv Oh Thanos isn't even READY for Carol Danvers OR Hawkeye's new hair-do. https://t.co/QM6djAHhZh FRIEND: let's work out tomorrow morning\nME: https://t.co/G5niHoovlg it took 17 people to write this when the moon \nhits your eye \nlike a big pizza pie \nthats a felony but when the moon hits your eye like a little pizza pie thats just a misdemeanor lol NO ONE:\n\nPI: 3.141592653589793238462643383279502884197169399375105820974944592307816406286208998628034825342117067982148086513282306647093844609550582231725359408128481117450284102701938521105559644622948954930381964428810975665933446128475648233 786783165271201909145648566923 🤞The Dude abides?🤞 https://t.co/Ml5Qc9rHU0 Ever wonder what goes on behind the scenes while rappers are recording? It's probably a lot like this https://t.co/i4bBioFrDD Charlie Brown still has better hair though. https://t.co/b6XPlP392z Science.... How could you betray me like this.... https://t.co/Q3BZy2Ixmj But if you think this means I'm gonna start interacting with actual people you are dead wrong https://t.co/hRUlQpkB8J Instagram and Facebook are down, time to count my pubic hairs CHILDHOOD GOALS:\n\n- Be President\n- Go to space\n- Dunk a basketball\n\nGOALS NOW:\n\n- Get out of bed in the morning\n- Make it through the day without crying\n- Dunk a basketball Zoe Saldana &amp; Kate Bosworth have the maturity of 2 year olds. https://t.co/bRARz6jzWQ No one likes a backseat googler:\nhttps://t.co/v8ogBldT2H https://t.co/PYnnICIzbp This is why I'm single (by choice). https://t.co/oFsqcvPBJ6 Why actually study when your parents can just buy your way into school right?? https://t.co/jQmizc08zm It takes a lot to win a Pa-gent, but Chris Pine might just have what it takes:\nhttps://t.co/SbXkZFIBt3 https://t.co/KxrrpF8ASy WHO ON EARTH BLOWS OUT CANDLES THIS WAY?? https://t.co/Nc5xlbVxrT The human body is made up of 70% internet had that nightmare again where i'm taking the SATs because my mom forgot to pay someone $360,000 to do it for me Captain Marvel (Brie Larson) really looks a lot like the 4th HAIM sister https://t.co/HPHSwxglcp Thankful for those *looks at watch* zero seconds he saved us https://t.co/pulBIbFLQT I'm just *sobbing* I'm just so happy for the both of them https://t.co/IS9M66PpWg Trainers hate this guy because he's so damn effective. https://t.co/3zFGZtCCV9 Who's ready for us to rock the daytime television world?! https://t.co/eOznuR5gTf Ok yeah these guys take the cake https://t.co/JD87trud04 @cottoncandaddy *SPITS EVERYWHERE* NO ONE:\n\nDONALD TRUMP: https://t.co/x6O1LCtEM6 I've got a case of the MONDAYS\n\nM y\nO ld\nN asty\nD ick\nA Doesn't\nY Work \nS Anymore How is this time change still a thing? Here are gifs to help deal. https://t.co/lZIVvTzXN5 Word to the wise: Don’t get stuck on an elevator with Ron Burgundy. He might eat you.\n\nListen to the whole episode here: https://t.co/PvFdAPuzpd https://t.co/7hoVIr8Rm8 Steamrollers can be used for many things but one thing they aren't for is crushing people. https://t.co/pPJyBynKjz Phone calls are bad news. Why can't people just text!\nhttps://t.co/shlK3bqued https://t.co/1ZjbQCwstn Party games are a minefield, but these guys have your back. https://t.co/Bzffye2gPq Sometimes sex scenes need a little movie magic to really capture the sensuality. https://t.co/zj4KNkGnbC YouTube has age restricted this video. We can't imagine why. https://t.co/Pbn2OhxeQO Find balance in your life with this guided meditation:\nhttps://t.co/LXmQmJph1y https://t.co/cP59omtPMs Two sequels. One movie. It's not that confusing. https://t.co/BKoC2lKt7D There are so many possibilities. https://t.co/63sqJPsvjv Please do not Live, Laugh AND Love anywhere near me. Pick one. Will Ron Burgundy make it out of this elevator alive? \nListen to the full episode here: https://t.co/PvFdAPMaNN https://t.co/VjwLBkJGhw This is why you always use a condom.\nIf you're at @SXSW, don't miss #Snatchers.\nhttps://t.co/n8NcdICke3 Getting your morning coffee should be this hard.\nWatch the full sketch here: https://t.co/0kar5Q0c1P https://t.co/uuAVOb0i9J LEAKED: Uzo Aduba auditions for every role in Orange Is The New Black https://t.co/AZ3FrSuDXB Man, animatronic gameshow mascots know how to PARTY. https://t.co/fFFifAyAYu Harrison Barnes knows that you always need a backup plan:\nhttps://t.co/IpULrwPBHL https://t.co/gd796UASsV Always, but especially today, we are grateful for the funny women that bless our twitter feed https://t.co/aYn5XV1OhA MY ROUTINE IN MIDDLE SCHOOL:\n\n- wake up\n- be awkward all day\n- fall asleep\n\nMY ROUTINE NOW:\n\n- wake up\n- be awkward all day\n- drink until i fall asleep Thanks for showing us around @trickaduu HAPPY INTERNATIONAL WOMENS DAY LADIES @aparnapkin @TheDweck  @meganamram @taylortomlinson @Party_Harderson What's a better way to celebrate International Women's Day than by highlighting some serious funny women?https://t.co/QaYWKDeEzW When I fart in public https://t.co/mNvR4SDEij WOMEN Remember the ‘Sabrina The Teenage Witch’ when she became a crackhead for pancakes? It was a very special episode. https://t.co/JFjPQgyUvO If you’ve ever wondered what Hollywood is really like, Mark Hayes is here to show you with this truly illuminating adventure https://t.co/Zc4zusmv4x Oh this guy rats. https://t.co/cx6JAJ2l1u This is arguably the most important thing Google Maps has ever captured https://t.co/T360PTphib By this logic do you think Trump now thinks his last name is \"The President\" https://t.co/M0zKbb09Oz This news was the best possible way to start our day https://t.co/7mcQAOQsN5 NO ONE: \n\nDOGS: I love you Getting trapped in an elevator isn't going to stop Ron Burgundy from recording his podcast. Work ethic, baby! Right here! https://t.co/l8FkyIMvVz Getting a record deal is not easy. Even for Macklemore &amp; Ryan Lewis.\nhttps://t.co/NFb3K1otY1 https://t.co/nsrQNvYB7A They might as well have just hired the same kid for every board game commercial ever https://t.co/9IGfs7Ykrh And the whole thing was immortalized forever in a documentary https://t.co/Llru2KpnLx We found (even more) evidence that tracksuits get you laid. https://t.co/nfqE7L4Rxs But why do all of these photos fit so well??? https://t.co/du1sfzOfsL wow, NC-17 https://t.co/rFla8iQs2r me vs me in my drivers license photo https://t.co/rQoRZDW1a4 Keep the fun alive! #RightToDesire #ad https://t.co/50DLu8g4v0 Has sobriety changed Jim Brockmire? https://t.co/iiluZjXcWx How sweet is this? https://t.co/mdUYimmNpR for lent I'm giving up lent Every Trump speech feels like you're trapped in a car with him https://t.co/ji7SJLFBIv A-list star Kevin Bacon explains his strict diet: https://t.co/FaCwfqsn7F https://t.co/3viM5wwOk7 Whoa isn't it amazing how science and facts continue to say THE SAME THING ABOUT VACCINES? https://t.co/CbNpe2KUWZ Louie Anderson is here with some facts we bet you didn't know: https://t.co/w1j5O2pleB https://t.co/v68CAUfQiS .@Lizzo just brought the heat. https://t.co/ZpNIrQdMgP me on a regular Tuesday vs me on Mardi Gras https://t.co/g6v4znTvsv If you've ever wondered \"how's Blockbuster doing\" look no further. Spoiler: not great https://t.co/YMle6BZ4bY Evil villains will do whatever it takes to stop superheroes like @KalPenn from organizing. Visit https://t.co/QK5rlxJmcl to learn more. #Ad #SEIU https://t.co/rGpTUnRUcL thanks to @xiaxiatechnique and @dastmalchian we now super into B*D**S***M****\n\n* backup\n** disk\n*** startup\n**** machine https://t.co/GD9Px3HgEk UGH why does April 14 feel so far away now??https://t.co/6ZQykssmKJ We made the perfect Saint Patrick's Day t-shirt \n\nhttps://t.co/hXHtJzdjN8 https://t.co/IxbndZleGi . @Colton I hear you jumped a fence? y/n The one guy in my office who hasn't seen game of thrones has this exact face right now https://t.co/3NCe7caXym Watch @danceswithtamis get drunk and watch Shrek for the first time https://t.co/wllBuc6DML I have two words for you: NARTH. VADER. https://t.co/xNZutou5Bd Can anyone give these guys give a TED talk now pls?https://t.co/r4fmviUZ17 How is this a breaking news story https://t.co/TWs84tyuJp me on twitter vs me on instagram https://t.co/TtlkaIWdvc Can John Mulaney please host EVERY episode of SNL? https://t.co/hTYRMsJm1G Judge Judy is the one celebrity that makes both Ron Burgundy and RuPaul literally shake with excitement.\nListen to the full episode here: https://t.co/OHrBL9wQH9 https://t.co/b5ISxpe9rA Huge if true https://t.co/sH2nW7RlYO RT @CBSAllAccess: More antics. Even less activity. 🚨 #NoActivity Season 3 is officially a go. https://t.co/EIkl5xnVbk Putting up some signs around town https://t.co/wq4tdpkuA0 First there was man, then there was mansplaining. https://t.co/T3IyWyzrTX Who knew a dirty garage would be such a crowd pleaser: https://t.co/azoeeEpLp6 https://t.co/yN4k8GquEJ How do we order more of these https://t.co/DudmJPDv6p Maybe if Star Wars was more like this it could win an Oscar: https://t.co/ltjkN4JViD https://t.co/QwxtQsuVLM Wanna feel old? Your Tamagotchi has been burning in hell for 20 years. Who remembers the \"Manifesto for Conscious Men\"?https://t.co/hqMaZ0fnzE Saint Patrick's Day is around the corner and we have clothes for your body\nhttps://t.co/hXHtJyVIVA In the troubled city of Chicago, it's time to take out the trash:\nhttps://t.co/o4LcKdLEQ9 https://t.co/IOD4eZk0Re Finally an honest review of the Apple Watch. https://t.co/S5sTcJ66sd A light pancake and some light eyeliner and Ron Burgundy is good to go!\nListen to the full episode here: https://t.co/OHrBL9wQH9 https://t.co/JqXUsrQq1i Beans are magical!\n\nBlessing \nEvery\nAnus with \nNasty \nSmells Does your boyfriend's apartment spark joy? https://t.co/XkvCzWymcE Just what I need going into the weekend. https://t.co/QAXR7STF6v 10 years ago Will Ferrell challenged Craig Robinson to a Bat Fight.\nIt's a game of honor and diplomacy. https://t.co/9NJbeRqi60 @nwalks We are, and you may quote us on this, absolutely in favor of that @nwalks you deserve all the Oscars for this Watching Bill Nye learn about EDM will get you ready for the weekend. https://t.co/xLVYpFm3gG Natalie Walker's 'audition tapes' are hilariously on point and a must-see https://t.co/ffCb13GzwP Save me! https://t.co/hXhHET0GpT Please, PLEASE let the new Pokemon trainers have Scottish accents https://t.co/bZ6seIvDj7 Lady Gaga and Bradley Cooper performing Shallow https://t.co/tR9XVRpaHm @ZacharyLevi @Marvel @MaiselTV @RachelBros @AlexBorstein *brisket emoji* Remember the 'Growing Pains' when Matthew Perry drove drunk and hit a tree? It was a very special episode. https://t.co/fLn03giXV7 If you want to be truly woke, follow this guided meditation: https://t.co/LXmQmJph1y https://t.co/EUOh2PVaWK Are you ready for all this Creativity, Uniqueness, Nerve, and Talent? https://t.co/NvzLnVGddF You'll never think of peanut butter and socks the same way after this. https://t.co/RpK9thUU62 Here's one to unpack with your therapist https://t.co/5aHUq99KzU More like School of Rock Hard Abs am I right https://t.co/zs7W9MPsme A useful sign to have in the office https://t.co/oYRnNXsibV Surprisingly, Ron Burgundy and RuPaul have more in common than you may think. https://t.co/QQTCY3msJy SEVEN DEADLY SINS\n\n- Lust\n- Gluttony\n- Greed\n- Envy\n- Wrath\n- Pride\n- Leaving dirty dishes in the sink and waiting for your roommate to do them Susie and Midge 2020. https://t.co/wWp01TfVNj Which man is going to win this years Pa-gent?\nhttps://t.co/SbXkZFIBt3 https://t.co/IlQ3Sv2cbR Straight up these shoes make you feel amazing. https://t.co/Icxibf2W7R People who say they skip the opening of Game of Thrones are liars. https://t.co/ZmebxsYWHL *slamming fists on the table* \"BLUE CHEESE! BLUE CHEEEESE-UHH!\" https://t.co/n1XcuSEQvu Phone calls are reserved for bad news. Period!\nhttps://t.co/shlK3bqued https://t.co/Xr2OiYSkdX They're not the best jokes ever written but we guarantee you'll laugh anyway https://t.co/zit7WS14YO Even stars of viral videos need to be rescued! #ad\nWatch more: https://t.co/vNlbrjYcbM https://t.co/mOGhkDn8ca What a wild fantasy https://t.co/NktnWjPY70 Sound on for a tear jerking rendition of The Notebook by Michael Cohen. https://t.co/HnwydkRYAU WHAT MY FRIENDS STORE IN THE LITTLE POCKET OF THEIR JEANS:\n- Condoms\n- Bag of coke\n- Joint\n\nWHAT I STORE: \n- Heartburn pill\n- Anti gas medication\n- Tiny ham sandwich Mr. DeVito will see you now. https://t.co/zHPKtbTuY9 Your butt will thank you. https://t.co/6RXVabWEcy The rat is me and the manhole is my summer jeans https://t.co/1BeezdWWlm ME:  :(\n\nJOHN C. REILLY IN STEP BROTHERS: \n\nME:  :) Retweet to bless the timeline https://t.co/n1b5whNULH I have big* dick** energy***\n\n* a disease where my\n** dick\n*** is like INSANELY small These are sure to have you howling https://t.co/YVgGwgrmyr When you start telling a story and your friends say you've already told it https://t.co/CDFy3MMdwQ Remember the time we disguised Jewel as a mild mannered businesswoman and took her to Karaoke? https://t.co/z33TAFsyQd I hate cats but I love these cats. https://t.co/u8KFb5l2JT “Go fuck yourself!” \n― Dick Cheney https://t.co/5kQWKxanQe Thankfully the world doesn't work the way these kids thought because these are, uhh, TERRIFYING https://t.co/dmjKahD7PZ There were some questionable wins but hey at least the men on the red carpet TURNED. THE. HELL. OUT. https://t.co/F4V0R6ASf0 IS THERE AN AIR MARSHAL ON THIS FLIGHT? THE GUY IN FRONT OF ME JUST RECLINED HIS SEAT Ron Burgundy is die hard for “Die Hard.” https://t.co/MIYpFQ8flA LADY AND THE TRAMP (2019) https://t.co/IraeEXCju6 Who put this up in the bathroom https://t.co/CExwTOLRpl .@ryanoflan learns about the history of our great country's ass as he explores Ballstown. https://t.co/3l0imtoEer Commenting on the decor is my go-to. https://t.co/3oL5g1oVkw Sebastian from the little mermaid is:\n\n1) A crab\n2) A lobster\n3) A sex symbol It's not the Oscars if they don't present this award on Live TV where it belongs. https://t.co/Z1UG7ihcBl The most depressing part of the Oscars are the red carpet correspondents who spend hours getting into fancy outfits but don't get to go inside Controlled breathing is the key to a happy life: https://t.co/Tiu8AvNmoF https://t.co/HErXyvlsNT While watching the Oscars tonight, lets not forget about the real heroes of Hollywood. https://t.co/T0evmENPWC I just wanted to take another look at you. https://t.co/woCro8wyYD The Timothée Chalamet one gets me every time. https://t.co/LtsLSws9cX The Oscars has no host. Clearly they should have asked Zach Galifianakis to do it. https://t.co/nMWiOgQG6W Ron Burgundy has something you need to hear about Christmas in February. https://t.co/b9TvPAcwcG Consider this a warning https://t.co/N8UmEIuXGh All husbands must be prepared to act at a moments notice: https://t.co/r87YZW7Z2O https://t.co/dyMzdZJchU Why.... Why did they make him so damn fine https://t.co/zMtOvt9V0d Oscar nominated actor Willem Dafoe has been in LOTS of movies. But how many can he remember? https://t.co/oH4YEf66pD That Fyre App Download Trailer was extra sweaty though. https://t.co/SiZd47h471 Not all record producers were behind Macklemore and Ryan Lewis' branding:\nhttps://t.co/NFb3K1otY1 https://t.co/QPs0inrYRV Nobody expresses themselves better than the Rose family https://t.co/bSeRGwVK1D ME: I need to stop oversharing with coworkers \n\nALSO ME: Today I peed 6 times, farted 4, and took a crap that looked like a question mark Today we lost an unforgettable human. You will be greatly missed, Brody. https://t.co/Tbu4AKZUmE *record scratch* he tried to do WHAT?https://t.co/syBhFD8jOE RED LIGHT: Stop\n\nGREEN LIGHT: Go\n\nYELLOW LIGHT: Slow down, then speed up, then step on the breaks, then hit the gas and have a panic attack This version of 'A Star Is Born' would have been guaranteed an Oscar! https://t.co/tnStcrvXEI Were you the same type of person when you were in diapers too? https://t.co/bRtLs82eN9 Ron Burgundy has a present for you... https://t.co/pW0zzmKarM JOB INTERVIEWER: have you ever been convicted of a crime\n\nME (remembering i got caught putting soda in a water cup at taco bell): i can explain You've probably reached your coffee quota for the week so here's a pick-me-up that's a little bit Schmidt-ier https://t.co/pz8LeGL3qZ hmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm no https://t.co/FTQAMGkkCg You won’t believe what she looks like now. Meet the biggest hair fail on YouTube six years later. #WHEREISTORI #ad https://t.co/TJMhG5oky9 *Walks into gym*\n*Sees this*\n*Walks out of gym* https://t.co/aRG9PCdYwW Types of headaches:\n- Stress\n- Migraine\n- Hypertension\n- When a friend tells a story about someone you've never met and includes dates, places and what they had for lunch that day A Star Is Born reviewed by a robot https://t.co/COwp1OGVcr Finally a Star Wars film for the arthouse crowd: https://t.co/ltjkN4sjU3 https://t.co/1HNVrXHWwd Serial killer documentaries is my self-care. https://t.co/YW9wbwf6el TAKE MY MONEY https://t.co/bRJqupfIvW Is your dog a mongrel? Maybe you should do the DNA test to see where he really came from! https://t.co/pQhj5cyfXr https://t.co/ouFXnlTnT8 These are truly some dark, dark times https://t.co/QlHvrbTjcK MOM: When are you going to start dressing like an adult?\n\nME: https://t.co/yhsmCNZemO https://t.co/R6QNcUrwFI Whatever happened to “I Burnt My Hair Girl?” The Tori Locklear Story #WHEREISTORI #ad https://t.co/n7SyWMXmvz sorry i'm late, i was waiting for the barista to make eye contact with me so she could see me putting money in the tip jar This is the kind of heist movie I need right now. https://t.co/YtVphz2NxA Let's call this a national yard sale https://t.co/7vvsOlWugT when i wake up and i'm still drunk https://t.co/65zR2Te0Gy Time to polish that resume. https://t.co/qPsHaBVQ7D NOBODY:\n\nME IN 7TH GRADE, WALKING AROUND WITH A SKATEBOARD IN MY HAND THAT I DON’T KNOW HOW TO RIDE: I’m a skater. Think you know how to spell words good? Think again! https://t.co/WU9LmfD2Y0 https://t.co/ANfKSursRv These presidents may not have been real, but we'd be lucky to have any one of them right now. Happy President's Day! https://t.co/SkpcTx2UIY Deepak Chopra is very deep...but for more reasons than you think.\n\nListen to the full episode on Funny Or Die: https://t.co/PCQUjeacZd https://t.co/YhK2YTQLcV Happy President's day to the future female presidents only Aubrey Plaza and Josh Gad experience a breakup in a noisy diner. https://t.co/mGlqEtTVqL Burned Baby Burned #ad https://t.co/8gWN4zAaOi How old were you when you realized slices of bread look like choads? https://t.co/8ZtCngK5PT As President's Day approaches, we pay tribute to the man who gives our current president his glorious orange sheen. https://t.co/6D6BvvLNX8 When I see a pigeon walking towards me https://t.co/SVcqHHxBsY If you want to be an actor, you gotta say no to that breakfast burrito!\nhttps://t.co/FaCwfqJXZd https://t.co/39wlAw5wia This is the indie film of the year for quirky girls. https://t.co/A9pusakxz3 Does Chris Pine have what it takes to win this Pa-gent?\nWatch the full sketch here: https://t.co/SbXkZFIBt3 https://t.co/9Po0rLfpYB Real romance happens on President's Day https://t.co/K6xeOAUm55 Wow, this is clearly the start of a beautiful friendship for Ron Burgundy and Deepak Chopra.\n\nListen to the whole episode here: https://t.co/PCQUjdSBAD https://t.co/98KUuGFWM0 Seriously, this much love is not okay https://t.co/5u3vC207ME Why would someone choose to call when they could just text?\nhttps://t.co/shlK3bqued https://t.co/psw380VEXR We present you the world's most creative mug https://t.co/xGnLzXTBez ME TRYING TO COME UP WITH AN EXCUSE TO LEAVE WORK EARLY: I…have to pee Me looking at everything I have to finish before starting my 3 day weekend https://t.co/OBDlnSSagt Happy 364 Days Until Your Boyfriend Buys You Flowers Again Day Turns out I don't need to hear every disgusting detail about your mucus https://t.co/kOSRXHUbJH Here are some rough stories to enjoy over a box of discounted chocolates https://t.co/nUFtRInVN7 Even if you don’t have a date at least you can have a laugh https://t.co/iVLoIDD0NJ Finally an honest Valentine's Day commercial https://t.co/MBAjlvRtQ3 Send the perfect Valentine's Day to your National Treasure https://t.co/f0iAOO69Nx Clear your mind. Take a deep breath. Ron Burgundy and Deepak Chopra are here to help you answer the universe’s biggest questions. https://t.co/OKpafWLG5j Here's some candy hearts https://t.co/gJvxCSrLnP The Least Popular Holiday In Every State https://t.co/fC2J5LJgvl Is Joe Jonas a good way to say \"I Love You\"? https://t.co/Z6tpKdeo8b Just a few simple tips to keep yourself breathing in any situation: https://t.co/Tiu8AvNmoF https://t.co/g6TsVnFYvQ David finally has the perfect way to proudly display his surname https://t.co/8WpvrmrNTf When cleaning up after your disgusting boyfriend, it's important to ask what things spark joy. https://t.co/jlBvXLreQJ My valentine is president Abraham Lincoln so we're waiting to celebrate on Monday Sad space news... https://t.co/lDV5beJqtU I guess we really can't have ~ nice ~ things https://t.co/AwMvRupn3a Good on Disney for finally listening to the fans and including Alita: Battle Angel in Frozen 2 https://t.co/9A0XOk44pw )         )        )\n    )     (         )       )   \n_(___(____)____(___(__ _\n\\                                   /\n \\         mmmmm        /     |\n   \\            hot           /____|\n     \\         pee          /\n       \\                     /\n         \\_________ / You're doing amazing sweetie! https://t.co/VemvybcfZp Are you a woman suffering from men who seem to hear “yes” when you say “no?” This may be just what you need. https://t.co/1rba4XgoZm El Chapo's arrest made for some surprisingly funny jokes https://t.co/PIDAR8NgPL Being a husband means always being ready!\nhttps://t.co/r87YZW7Z2O https://t.co/LgYgKmg1Oy Lotion is for teenagers! https://t.co/NkpnmJPtI8 But we're not buying it. https://t.co/33d7nAgYYl Give yourself and your ex the Valentine's Day you both deserve https://t.co/eVHcBwumtF JUDGE: have you reached a verdict\n\nJURY: yes your honor, we believe the defendant is.... more like jail chapo Give this Valentine's Day card to your loved ones https://t.co/3c9robE0ev Lindsay Lohan is ready to mingle! https://t.co/zUmdEc8CDp Most people agree that this look is a royal mess - but hue knows, maybe we're all prussian to conclusions https://t.co/L8TdqwLLer Louie Anderson brings you some completely unbelievable facts:\nhttps://t.co/w1j5O2GWDb https://t.co/QLbCe6lhqv It doesn't get any more powerful than this https://t.co/izyQNAZ5eb @cottoncandaddy It is law There were a lot of noteworthy red carpet looks but these three NEED TO BE DISCUSSED https://t.co/cyrmZP6Z46 NETFLIX: Are you still watching?\n\nME: https://t.co/9omlfAFTxZ If your rice gets wet dry it off by putting it in a bowl of phones Cardi B should have won an award for this episode of Between Two Ferns https://t.co/pX61QwUV5Q Married couples know what it's all about. https://t.co/IvCAabKjIN Saxophone Facts: \n- Will make you pregnant if played correctly\n- Also referred to as 'curvy brass boi'\n- Used for good music (jazz) and also bad music (ska)\n- Known as \"the farting instrument\"\n- Fill it with trail mix to create a snacksophone Critics are raving about The Dirty Garage. Watch the full trailer here: https://t.co/azoeeEpLp6 https://t.co/zNyI8qR4Gm Is Shawn Mendes secretly a diva? This limo driver likes to think so! https://t.co/WqwxK1EcNT This is how they write Garfield Valentine's Day cards https://t.co/Stnx7IXDob I can't wait to embrace* my gorgeous** wife*** on Valentine's Day!\n\n*fuck\n\n**neon green\n\n***croc Henry Rollins has a few issues with Dr. Seuss' famous children's book \"Oh, the Places You'll Go!\" https://t.co/jJipt6Naoq It's about time we got an indie Star Wars film!\nhttps://t.co/ltjkN4JViD https://t.co/NmOUysCmIP As the great Shaggy says: \"It wasn't me.\" https://t.co/LL4XZSEwbl This story was wild and the tweets are even better https://t.co/hsbkCv2oIG @SteveMorge That’s the secret Steve, they’re all die tweets If a baguette wore pants how would it wear them? https://t.co/XxBjWYHB2R Because sometimes words just aren’t enough https://t.co/oXiIs0uPCS 911: What's your emergency?\n\nME: A person wearing a fedora at a club just requested a song from a DJ We put Steve Buscemi eyes on the Spice Girls and it's CHILLING https://t.co/ATTYSLAmKO RT @BurgundyPodcast: My podcast is LIVE! Give it a hell of a listen: https://t.co/my7jXR9zFq Unfollowing someone after a break-up: yay or nay? https://t.co/syRdlYUhhy Dog DNA tests are just like 23andMe, but without the privacy concerns.\n\nWatch the full video here: https://t.co/pQhj5cgEyR https://t.co/mziOC5RgiZ Take our poll and tell us which one ruined your day more! https://t.co/jB2vS3KbIa Tell your loved one how you really feel this Valentine's Day with our new greeting cards\n\nhttps://t.co/4yzMDvBp7u https://t.co/AEo03MNKVp Here's something we can all agree on https://t.co/ErcftuH44m The life of sanitation workers just got a lot more dramatic:\nhttps://t.co/o4LcKdu3YB https://t.co/YzQLrfxinK MIDWEST: I’m wearing 19 layers and my bones are still frozen\n\nCALIFORNIA: My hand is cold This is nightmare fuel https://t.co/BcamVXKxLa Ron Burgundy has a hard time with a hard \"E\"\nhttps://t.co/oKgYU4SId7 https://t.co/s8LhHFY6IL RT @TheWrap: Ron Burgundy Goes All In on 'Ted Cruz Is the Zodiac Killer' Theory https://t.co/u2Y4ByeKdN https://t.co/zvVwDnTyjD Tell your loved one how you really feel this Valentine's Day with our new greeting cards\n\nhttps://t.co/6Mq6fUYZOT https://t.co/DZkQT7aQs1 Welcome back to California @hbarnes!\n\nWatch the full video here: https://t.co/IpULrx7d6l https://t.co/rmktJ54Uox Get ready for a mouthful of Ron (and his big ole apple) Burgundy.\nhttps://t.co/oKgYU4B6Ox https://t.co/hh1BZ0CFg2 My worst school lunch was a baloney tuna wrap i packed myself. https://t.co/eZx9q5YOao Ron’s take on a true-crime podcast is a must-listen https://t.co/oKgYU4SId7 Who decided this was a good idea https://t.co/JH4d9gF2HD Remember when Macklemore and Ryan Lewis got their first record deal?\nhttps://t.co/NFb3K16Szr https://t.co/FBbIUiiJud Billy's going from In The Street to the silver screen! https://t.co/6YMtzHu6OI Tell your loved one how you really feel this Valentine's Day with our new greeting cards\n\nhttps://t.co/4yzMDvBp7u https://t.co/XjVe0XUJVM This picture really does say a thousand words https://t.co/aDBDGqLScG Don’t Blame Jeff. Blame HSDD. #Righttodesire #ad https://t.co/cXRIFtUQlc What happens in your bed when you're on vacation? https://t.co/OSEVJnNDrm If you're serious about acting, you have to get the diet right.\nWatch the full video here: https://t.co/FaCwfqJXZd https://t.co/lxKhysDQV8 Find your sexual desire again. Talk to your healthcare provider about HSDD @righttodesire #ad https://t.co/ul4PRnfniB 🚨 WARNING: THIS VIDEO CONTAINS EDGY POLITICAL HUMOR 🚨 https://t.co/iEQ8fcskMS They got my name wrong AGAIN https://t.co/NJwTpHQudU average time to watch a movie: 95 minutes\n\naverage time to pick what movie to watch: 9512499340929 minutes If you loved 'The Notebook' then you'll be horrified by 'The Hug' starring Bryce Dallas Howard https://t.co/ZLYujANIQa There is some fierce competition at these male Pa-gents:\nhttps://t.co/SbXkZFIBt3 https://t.co/2j3S72gn9k Dana Perino, answer for your crime https://t.co/00hPorlxLe Twitter was funnier than the Super Bowl game and the halftime show combined https://t.co/smljKQcphl Adam Levine was born without nipples....those are tattooed on https://t.co/Nbqo9IlxZe no one:\ndads: i'm not sleeping, i'm just resting my eyes How far would you go to get out of a speeding ticket? https://t.co/bK9MilmCyY Even though his dog bed was right there. LEGENDARY.  D.O.G. uses @AvosfromMexico to keep his humans happy and complacent. #AvocadosFromMexico #SB53 #ad https://t.co/CrbmKppam0 Not doing chores is its own reward. The avos are bonus.\n@AvosfromMexico #AvocadosFromMexico #SB53 #ad https://t.co/iKZKCJ4KdX @AvosfromMexico DEAL! @AvosfromMexico #SBLIII #SB53 #AvocadosFromMexico @AvosfromMexico Can we have him? @AvosfromMexico #SBLIII #SB53 #AvocadosFromMexico @AvosfromMexico Like “who’s a good boy?” @AvosfromMexico #SBLII #SB53 #AvocadosFromMexico Trip Finnigan: Legend of Leisure. Keeps his humans happy with @AvosfromMexico #AvocadosFromMexico #SB53 #ad https://t.co/StqcZ4IlLI @AvosfromMexico Charles seems like he really cares about hard-hitting investigative journalism #AvocadosFromMexico All sports broadcasts should have special dog correspondents @AvosfromMexico #sb53 #SBLIII #ad #AvocadosFromMexico Now I just need someone to incentivize me like this at work.\n@AvosfromMexico #AvocadosFromMexico #SB53 #ad https://t.co/jH7Pj5td6g Get five in a row to win https://t.co/RfvNKKcJHN Here's a little known fact: Tom Brady is NOT from Boston. https://t.co/k5I3305kly What kind of person actually makes phone calls these days?\nhttps://t.co/shlK3bqued https://t.co/YDs0hrHc9t Shouldn't have left my mouth open but I really wanted that avo. @AvosfromMexico #AvocadosFromMexico #SB53 #ad https://t.co/3f6bUbOgf4 COWORKER: How....\n\nME: Shut the fuck up This also works in most relationships and some traffic stops.\n@AvosfromMexico #AvocadosFromMexico #SB53 #ad https://t.co/IkGm4hx4pX For all those situations which make breathing harder, these tips could be a life saver: https://t.co/Tiu8AvNmoF https://t.co/PPm9yVAG7F Whether you’re in a Red State or a Blue State, there’s no escaping being trapped inside your own bubble. https://t.co/cxGVlIr2jp Things I crave when it's cold out:\n- hot Cocoa\n- warm fire\n- cozy socks\n- 1 million dollars It's time to pick a side https://t.co/z3DAXtzrPN - INCORRECT PASSWORD\n- SECURITY QUESTION: WHERE WERE YOU ON MARCH 3RD, 1997?\n- INCORRECT ANSWER\n- CHANGE PASSWORD\n- PASSWORD MUST HAVE CAPITAL LETTER, SYMBOL, NUMBER AND BE 73 CHARACTERS LONG\n- SORRY, NEW PASSWORD CANNOT BE SAME AS OLD PASSWORD CONFESSION: being on hold makes me hyperventilate. https://t.co/ZDGJ3EpGLx Having a husband around is great, but more than one and things get confusing real quick. https://t.co/r87YZW7Z2O https://t.co/JRHEzHOKOJ Maybe it's time we bring Captain Planet back?\nhttps://t.co/36YtA6LppH https://t.co/vsuU9YqBze Nothing says romance like a heart-shaped tin. https://t.co/jWBdoORnH4 It's so cold that boiling water is freezing https://t.co/NyVhSSXxcF If you've already started making plans for Valentine's Day you need to calm down These 13 tasty GIFs of Danny Devito eating will make you hungry. https://t.co/6OYbIjH31T Things getting stale in the bedroom? Keep your man excited with these fun tricks found in nature! https://t.co/l7UZgjz2gD RT if you love the INTERNET\n\nI ‘m\nN ot\nT hat\nE Happy\nR With how\nN My\nE Life\nT urned out Affleck's decision to hang up his cape has polarized DC fans everywhere https://t.co/0iTI9uwc91 C'mon guys https://t.co/85CrGBPC49 The “Ron Burgundy Podcast” comes straight from the veteran newsman himself. https://t.co/vNTo5JcskC tbh this is what it feels like when there's an argument in group chat. https://t.co/xTZ3VQFQIc Maybe Mitch from City Slickers isn't cut out for Westworld: https://t.co/DBHQYDXxqi https://t.co/DUsPFECCYL WHY IS THIS A THING https://t.co/xpMTgNATA4 ______________  me waiting\n|                       |  in the stall\n|                       |  for everyone\n|                  []   |  in the\n|                       |  bathroom\n|                       |  to leave\n|_____________|  so i can\n[]     👟👟      []  poop @cottoncandaddy mmmmmm eggggies who left this in the office fridge https://t.co/BbfU1LGxsS Yet another cautionary tale about the dangers of google translate https://t.co/W1XFZ5H9uZ APPS: Please take a moment to rate us in the-\nME: no Me remembering summer https://t.co/BNuaNZAxSN Guys really live in apartments like this and don't see any issue https://t.co/aeyyR5RM1g If they started making indie Star Wars films we really hope they look something like this: https://t.co/ltjkN4sjU3 https://t.co/GQXQI4GycN Grab a pen, you're gonna want to take notes https://t.co/F4DgAXGwzA 9:00AM: *show up at work*\n9:01AM: well it's probably time for lunch Help me find him https://t.co/lKYRHpTMzJ"}