{"tweets": "Even Spider-Man and Thanos are willing to team up for the kids on Halloween at the #LakeShow 🕸👾 https://t.co/oXcN4qI59H RT @Complex: 🌸 @ComplexCon x @Lakers x @TakashiPom 🏀\n\nHere's the first look at our collab dropping in 5 days at Long Beach.\n\nTIX: https://t… That jump stop from the secondary logo to the restricted area 😳 https://t.co/BE4utdY854 “I wasn’t thinking about anything but doing whatever I can to help the team win and keep the crowd energized.\"\n\nhttps://t.co/MQl9dtzKNX RT @JaredDudley619: 🔥🔥🔥 https://t.co/muRadRP2gS RT @KingJames: My best wishes as well to the first responders⛑ right now doing what they do best! 🙏🏾💪🏾 RT @KingJames: I 🙏🏾 for all the families in the area that could be affected by these 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥 now! Pretty please get to safety ASAP ⚡️ “AD, LeBron and Dwight Take Control in #LakeShow Victory”\n\nhttps://t.co/LkJIcnB7mM Lakers Reaction: AD and LeBron put versatility on display in victory https://t.co/mLmYv5Q2zp 🎥 \"when I'm able to shoot the ball like that, it opens up the floor for guys to drive and makes the defense respect me from three\" https://t.co/NMNmqgpLPr 🎥 \"It starts with our mentality defensively. It starts with our physicality” https://t.co/8JkRkZs8VD AD, Bron and Dwight all posted double-doubles, and defense did the rest to close the door on Charlotte.\n\nhttps://t.co/sngVbzT3rC 🎥 Dwight Howard speaks to @LakersReporter following the Lakers win over Charlotte https://t.co/OBwaTWtWEF 🎥 “We have a high ceiling for what we can be on the defensive end.” https://t.co/jv8DuyInIq All the Dwight Moves\n#LakersWin https://t.co/TDYUz3syoU The Brow came to play. #LakersWin https://t.co/y4H41Nop6z RT @LakersReporter: Vogel after LAL held CHA to 39 2nd half points: “We have a high ceiling for what we can be on the defensive end.” Outscored them by a dozen in the fourth. #LakeShow \n\nhttps://t.co/pe8rIxPnnH RT @LakerGirls: #LakeShow 💜💛 https://t.co/tuvdpIm1xz RT @LakersReporter: “He was off the charts,” said Frank Vogel about Dwight Howard, who was “a star in his role tonight.” Howard had 16 poin… The people needed back-to-back taco nights. \n\nThe #LakeShow and @JackBox delivered 🌮🌮 https://t.co/HLOp8TagSn Big Lineup. Big Performances. Big Win. \n\n@AntDavis23: 29 pts, 14 reb\n@KingJames: 20 pts, 12 ast\n@DwightHoward: 16 pts, 10 reb, 4 blk https://t.co/OgiYyxuhLw King calls checkmate 👑💪 https://t.co/AhzzFNZ9F4 @ACFresh21 Flex on ‘em, AC! 💪💪💪\n\n(📺: @SpectrumSN ) https://t.co/g8TIj9B5pv ☁️⚡️☁️ https://t.co/NMoGkK3BFB Trust us, getting between AC and the bucket is a bad idea 💥💥💥 https://t.co/Knc7R8iHNa RT @LakersReporter: Dwight Howard: 14 points (7 of 7 FG’s), 9 rebounds, 3 blocks in 19 minutes. He’s +26. How about a 14-2 #LakeShow run to start this quarter? You don’t want to give him a runway 🛫🛫🛫\n\n(📺: @SpectrumSN ) https://t.co/RUfyUJM2Lo RT @LosLakers: #CARUSHOW 🔨 Fearsome Frontcourt \n\n@AntDavis23: 29 pts, 13 reb\n@DwightHoward: 12 pts, 9 reb https://t.co/hqJ25T4xXt 〰️3️⃣〰️ https://t.co/4gTolaGsiL AC FRESH 🎯🎯🎯 https://t.co/xYhk11HWDz Spotted: David Beckham #LakeShow https://t.co/qAOPzMcHhk Can’t keep him off the glass 💪💪 https://t.co/91hPrqcSTg AD’s feelin’ it beyond the arc! 👌👌👌\n\n(📺: @SpectrumSN ) https://t.co/NPpcm8aUe6 Bigs playing big. \n\n@AntDavis23: 25 pts\n@DwightHoward: 8 pts, 6 reb https://t.co/MiyVZzsCxK Splash Brow 〰️💦 https://t.co/ytrtCEs5iv Sunday whites looking 👌 #LakeShow https://t.co/IYIMwCHex0 RT @LakersReporter: LeBron has 7 assists already. Dwight with the casual over-the-head reverse alley-oop 🤷‍♂️\n\n(📺: @SpectrumSN ) https://t.co/j2XRWeWa9G RT @LakerGirls: Dark mode💡 https://t.co/dClC01Z1Ox 🔥🔥〰️〰️〰️🔥🔥\n\n@AntDavis23: 16 pts, 2 blk https://t.co/6LgxcIykp0 That AD making ‘em dizzy with the crossover 😵 😵 😵\n\n(📺: @SpectrumSN ) https://t.co/M9b9nugaKT Quick work for JaVale #LakeShow https://t.co/dt99gEWCzY Three straight buckets from the Brow 〰️〰️〰️ AD on one end of the floor. JaVale on the other. The bigs have this handled.\n\n(📺: @SpectrumSN ) https://t.co/zKQ1lYAGKk Ball is up. #LakeShow Sunday's #SuitingUpTogether, powered by @ToyotaSoCal https://t.co/VSi1XFt6Vp Quarterback LeBron 🏈🏀 https://t.co/InAX6QOElV Sunday hoops coming at you now!\n\n📺: @SpectrumSN \n📻: 710 ESPN &amp; 1330 Tu Liga\n\nhttps://t.co/IVkPHkUoB5 #LakeShow https://t.co/OLjbYKnCMA Almost that time #LakeShow https://t.co/nOegNpAiG7 #3 rocking 4’s #LakersSneakerCam https://t.co/9hzyjiXiTD 🏁 @kylekuzma 🏁 https://t.co/yjJ6qOEq9y Calm &amp; Casual 😌\n\n@AntDavis23 | #LakeShow https://t.co/7Q7K0OT38H Mr. Dudley providing the vibes today 👌 #LakeShow https://t.co/2j8uSfSJa9 Cozy &amp; happy 😃 \n\n@QCook323 | #LakeShow https://t.co/RnpdVXa8nc RT @LakersReporter: Rajon Rondo has been dealing with a sore right calf, and had a precautionary MRI on Saturday that confirmed a mild righ… RT @troydaniels: GameDay..!!! #LockedIn #LakeShow #VA #LA @Lakers https://t.co/AafQvWbwzw Nothing like spending Sunday with the #LakeShow\n\n⏰: 6:30 p.m. PT\n📺: @SpectrumSN \n📻: 710 ESPN &amp; 1330 Tu Liga\n\nhttps://t.co/APEuWFFbCB Quinn putting in the extra work after the buzzer is our Moment of the Week presented by @budweiserusa. https://t.co/yALotnFtYi “Good evening Laker fans, and welcome to the Home Opener.” #LakeShow https://t.co/6iGM8BqEgw Station domination. #LAL60 https://t.co/DCJMYfsrHp NEW POD: Subscribe to the all-new Official Lakers Podcast for exclusive interviews, analysis and more throughout the season!\n\n🎧: https://t.co/Sq1O4M9OPa https://t.co/hLR7iYYOc6 With five blocks and two steals, Anthony Davis spearheaded the Lakers' suffocating defensive display.\n\nhttps://t.co/kCVdIpzHca RT @SouthBayLakers: A peek inside the #GLeagueDraft. https://t.co/XESPCqHsKQ RT @SouthBayLakers: GPII Back in the Bay 🌊🌊\n\nSBL has acquired the returning player rights to Gary Payton II.  \n\n https://t.co/jhc9nX0LcB RT @troydaniels: That atmosphere last night was crazzyyy..!! Good Win Fellas.! #LakeShow #VA #LA @Lakers https://t.co/ocAM6G27Y7 He's a shooter. He's a defender. He's a record-holder. He's a podcaster.\n\nMeet Deadshot Danny Green.\n\nSenior Writer @KevinDing: \nhttps://t.co/TYkE5RULoA ⚡️ “LeBron, Defense Power Lakers' Victory in Home Opener”\n\nhttps://t.co/0gL7SXYOSc Lakers Reaction: LeBron’s psychical scoring leads home opener victory https://t.co/gXRdQyuQam 🎥 Troy Daniels talks about his hot night and the origin of his “Layup” nickname https://t.co/RQVi1tpQie 🎥 AD “couldn’t ask for anything better” than getting a victory in the home opener https://t.co/ZyXqXs1HMy 🎥 LeBron: “We want to continue to get better and better with our defensive strategy and our gameplan and just execute that.” https://t.co/JOqNCtR25h 🎥 Vogel says AD was “all for” moving to center to start the 2nd half. https://t.co/MXzK4aGsia RT @DGreen_14: That winning feeling 💎✊🏽 https://t.co/nccFwKTIWw \"We want to be that every single night, being able to hold teams under their averages.\" - LeBron James\n\nhttps://t.co/lUmskqFYMm 🎥 Anthony Davis puts up 21 points and 5 blocks in his debut on the Lakers’ home floor. https://t.co/3LcEox5F1Q 🎥 LeBron James drops 32 points and 10 dimes to lead the Lakers’ win over the Jazz. https://t.co/XiqYBDQp31 🎥 #LakeShow rides a second-half wave to victory in the Home Opener https://t.co/GvGUsXXufp Hard work means always getting better, even after the clock hits zero. https://t.co/DdyGAus6Tj RT @JaredDudley619: Home opener! LA Vibe just different! https://t.co/XdVK39IyXj 🤙🤙🤙 #LakersWin https://t.co/cTfiNYkhCi “What’s up, #LakeShow?!”\n\n🗣 @QCook323 https://t.co/RLG327mfrV Thanks for coming out. This one was for all of you #LakeShow https://t.co/7MYxU49E7v First one on home court. #LakersWin \n\nhttps://t.co/q87j2UQshg First win, how ya feelin’ AD? https://t.co/7qHtEY5RNC Make way for the King. #LakersWin https://t.co/nwhAs6CjaX #WeGotTacos with 24 points to spare 😳\n\n🌮🌮 @JackBox 🌮🌮 https://t.co/i5XkXVsCA5 Home Opener done right. #LakersWin\n\n@KingJames: 32 pts, 10 ast, 7 reb\n@AntDavis23: 21 pts, 5 blk https://t.co/Ena8qPLl4p Smooth. #LakeShow https://t.co/UfJTIQRlkC .@Kostas_ante13 in for his #LakeShow debut. .@ZachN_23 enters the game for his NBA debut. RT @LakersReporter: LeBron James leaves to a standing ovation after a dominant performance: 32 points on 12 of 22 FG’s and 7 of 8 FT’s, plu… \"Trey\" Daniels Mode 👌👌👌👌 https://t.co/Sk9HCnlqfz RT @LakersReporter: LeBron’s getting another rest here w/LAL leading 81-65 at the 8:49 mark. He’s been terrific in his 27 minutes: 10 for 1… #LakeShow firing on all cylinders 💥💥💥\n\n@KingJames: 21 pts, 9 ast, 7 reb\n@AntDavis23: 19 pts, 4 blk\n@troydaniels: 12 pts, 4 3pm https://t.co/OKFLcxgG2s TROY 🏹🏹🏹🏹 Just throw it up. @AntDavis23 will go get it.\n\n(📺: @SpectrumSN &amp; ESPN) https://t.co/bdKWPBbCDA One hand’s all he needs 💪 https://t.co/K53B2UHyZh 🔥🔥🔥 https://t.co/KkgXu8rsH0 @SpectrumSN 👑🔌   ➡️   〰️🇪🇺👣 https://t.co/CzJBIhK8kO RT @LakersReporter: Alex Caruso started the 2nd half for JaVale McGee, LAL going small with AD at the 5 here. AD relentless with the swat on one end and the Eurostep on the other 😤😤😤\n\n(📺: @SpectrumSN &amp; ESPN) https://t.co/UR56yRo6Zw Defense carrying the way. \n\n@AntDavis23: 17 pts, 3 blk\n@KingJames: 9 pts, 5 ast https://t.co/FJ3azCii6L 🤝\n\n@AntDavis23 x @JaValeMcGee https://t.co/0VpbjWcwby Defend with passion 🛡 https://t.co/kNoCqoiJS9 AD literally can’t help but get buckets 🤷‍♂️ #LakeShow\n\n(📺: @SpectrumSN &amp; ESPN) https://t.co/WOgom5D9fe Early work for the Brow 〰️\n\n@AntDavis23: 12 pts https://t.co/Sm42X5nhc3 RT @LakersReporter: A 10-0 LAL run here buoyed by strong defense (Utah shooting 37.5%, with 6 TO’s) was capped by 4 straight AD FT’s. He ha… RT @LakersReporter: Anthony Davis just accidentally scored when the alley-oop he intended for Dwight went straight through the hoop. Counts… RT @LakerGirls: Its show time! #LakeShow https://t.co/noqFXVDQ9s Bron serves it up from the logo and @AntDavis23 throws it down at the rim! #LakeShow\n\n(📺: @SpectrumSN &amp; ESPN) https://t.co/vLWRSybOto Ball is up. #LakeShow Pregame 👑🔨 #LakeShow https://t.co/RZsMVxf7Is Focused 👑\n\n@KingJames | #LakeShow https://t.co/sPwGjYImJF #SuitingUpTogether for the first time on our home floor, powered by @ToyotaSoCal https://t.co/kktRcgZmTQ RT @Lakers: For our city. #LAL60 https://t.co/6V2yV2Vp5N Back on home court for the first time this season 🏠\n\n📺: @SpectrumSN in L.A. ESPN nationally \n📻: 710 ESPN &amp; 1330 Tu Liga\n\nhttps://t.co/p43VZJnNVi First one for the home crowd. #LakeShow https://t.co/msUlJ0H89M Shooter’s touch 🎯\n\n@DGreen_14 | #LakeShow https://t.co/VmIbqaYUsA It’s almost game time! Make your picks before tip-off for the chance to win a signed KCP jersey. Download the Lakers App, brought to you by @WishShopping, to play now.\n\n📲 Apple &gt;&gt; https://t.co/3q02H8Z1IQ \n\n📲 Android &gt;&gt; https://t.co/xNXTjoSSor https://t.co/63Ge9VuXx5 RT @LakersReporter: Rondo is out tonight with the sore calf. Same starters as Game 1 expected. Rocking the statements for the home opener. #LakeShow https://t.co/RG8cGmZTYU Fitted for the home opener 👖👔 #LakeShow https://t.co/Y1cBfBpCmt 18,997 seats.\n1 mindset. https://t.co/5dklaTp0zb LA, stand up! Join us tonight for our Opening Night Party at @LALIVE before the game from 4-7pm for food, games, and lots of fun. https://t.co/Cg6EXr9CDS 🔥🔥🔥 HOME OPENER VIBES 🔥🔥🔥 https://t.co/EDrZF4ya0e 🏠 (Est. 1999) https://t.co/LVRHqBszr7 That home opener kinda feelin’ #LakeShow https://t.co/QlfZD7LV17 \"He's 26 years old. He's in the middle of his prime.\"\n\n@LakersReporter on why Anthony Davis could be in for a monstrous year. \n\nOfficial Lakers Podcast 🎧: https://t.co/Sq1O4M9OPa https://t.co/YcAvi2T4gx First time on home floor tonight!\n\n⏰: 7:30 p.m. PT\n📺: @SpectrumSN in L.A. ESPN nationally \n📻: 710 ESPN &amp; 1330 Tu Liga\n\nhttps://t.co/ncA6Z2s1qB Good luck tonight, @LAGalaxy! https://t.co/Usie3L2uXF 🎥 Rajon Rondo checks in on his health status, and says he’s willing to do what the team needs from him. https://t.co/eIn7ESFm6E 🎥 LeBron James talks about preparing for Utah and how he watches games. https://t.co/n2qzMnZqe8 🎥 Frank Vogel updates Rajon Rondo's status, and discusses Kyle Kuzma's potential impact upon return. https://t.co/VkjgdUQFn1 RT @kylekuzma: Coming to a city near you soon🤫 https://t.co/hCLiDFySUo Got better today #LakeShow https://t.co/Ha1U8vZyl4 RT @LakersReporter: Rondo asked if he has a preference for starting vs. coming off the bench: “My preference is what Coach Vogel wants me t… RT @LakersReporter: Frank Vogel said he does expect to use Rajon Rondo as a starter “a lot,” essentially playing matchups by starting him a… RT @LakersReporter: Vogel said Rondo “looked really good today,” using the word “fresh,” but they’ll wait until tomorrow to determine his s… RT @LakersReporter: Frank Vogel: “There are (tons of) little execution pieces that we’ve got to clean up, from post spacing, to not running… Looks like @JamesWorthy42 and @RKHorry have @JackBox tacos on their minds. Stay tuned for a big announcement! #wewanttacos https://t.co/W5v4Cd7KQN 🎥 \"We're focused on the process - building and tightening up the little things, the little habits we know will lead to wins\" https://t.co/ug1lDvwx4n RT @LakersReporter: Frank Vogel said Rajon Rondo is a question mark for Friday’s game (missed last night with a sore calf), while Alex Caru… It’s not work if you love every second of it. #LakeShow https://t.co/M6x07IXmhJ Can’t find tickets? Not a problem. Browse the official Lakers resale marketplace.\n\nhttps://t.co/kP0mGxvv4M https://t.co/Dd9ozKZVdj 🎥 \"My teammates did a great job finding me. I got into a nice little rhythm but that's not my concern, it's the defensive end.\" https://t.co/g0bAcZN2c5 🎥LeBron James keeps the big picture in mind during his postgame media session following the season opener. https://t.co/znJ26cF5Nd 🎥 Anthony Davis looks back at his 25-point, 10-rebound Lakers debut. https://t.co/WDD9ca5XLi RT @JaredDudley619: Best job in the world! Tough loss but a lot to learn from tonight! Will be back on Friday! https://t.co/R9YCyf0PQF Game one in the books. Back to the grind. \n\nGreen: 28 pts, 7 3pm\nDavis: 25 pts, 10 reb\nJames: 18 pts, 9 reb, 8 ast https://t.co/UqFYPQtsEx Danny Green reaches 28 points on the night, passing Kareem Abdul-Jabbar (27) for the most ever in a Lakers debut. RT @LakersReporter: LeBron just somehow stopped a 4-on-1 Clippers fastbreak after an inbounds turnover. Bodied up Kawhi, then stripped Harr… The block. The charge. @KingJames has the will.\n\n(📺: TNT) https://t.co/YDZvzCwkng RT @LakersReporter: Jared Dudley’s now 2 for 2 from 3 with his 1st 2 attempts as a Laker, and has been strong defensively as well. 10 key m… 🎯🎯🎯\n\n@DGreen_14 | #LakeShow https://t.co/bT8o4RlnWh The chase is everything 👑🛑 https://t.co/KKbn9kkBTB What. A. Game.\n\n@AntDavis23: 25 pts, 8 reb\n@DGreen_14: 21 pts, 6 3pm https://t.co/4H6nSb92Gu RT @LakersReporter: DANNY GREEN. Wow. His 6th 3 capped a big LAL run that has them up 85-82. Deadshot Danny for the lead! 👌👌👌👌👌👌 https://t.co/fmAYkJ1n0A Dwight Howard. Tie ball game. RT @LakersReporter: Danny Green has been terrific tonight on both ends. He’s 4 for 6 from 3 after sprinting to the corner to convert a Cook… Season 17. Still zero gravity. 🚀\n\n(📺: TNT) https://t.co/59LhmU4W7z RT @LakersReporter: Two outstanding plays by @KingJames on one defensive possession, first a chase down block of Shamet, then a charge draw… Two blue shirts in the paint. AD’s still got this 💪 https://t.co/cMIjBRl99N Halftime Downtown. \n\n@AntDavis23: 18 pts\n@KingJames: 14 pts https://t.co/B7lfqGdtIj King &amp; Klaw 👑✋ https://t.co/oHshHGqiUq Pump-fake. \nGive-and-go.\nAnd-1.\n\n@troydaniels has got that finesse. https://t.co/NZ2zoV8owJ RT @LakersReporter: LeBron’s up to 13 points on 5 of 8 FG’s with 3 boards and 3 assists in 12 minutes. Kawhi has 13 points, 2 assists and 1… One quarter down. #LakeShow \n\n@AntDavis23: 9 pts, 3 reb\n@KingJames: 6 pts, 3 reb https://t.co/1CCNjnFbCn RT @LakersReporter: The first FG attempt from Troy Daniels is, of course, a 3, which he hit to counter Green’s for LAC. LAL up 21-13. AD gets tricky down low for the first bucket of his #LakeShow career 〰️💪\n\n(📺: TNT) https://t.co/8TAQtVFsOa Clear out for the King\n\n(📺: TNT) https://t.co/zgi05YZeef You know he's been waiting for this 👑💨 https://t.co/eiXev5ysUJ Bron bullies his way for the first bucket of the season.\n\n(📺: TNT) https://t.co/p4SdmcPjNr Let’s go!!! #LakeShow https://t.co/JcnqFHR9ZQ Bron. Fadeaway. Cash. https://t.co/qRYyXAN0Pg RT @LakersReporter: With Beverley on him, LeBron called for a post-up, spun and scored at the rim to start the season for the Lakers. On th… Bron. Bucket. 2019-20 has officially tipped off. Ball is up. #LakeShow #SuitingUpTogether for Opening Night Presented by @ToyotaSoCal https://t.co/OpBpzPcEBP It's time. All eyes on L.A. \n\n📺: TNT\n📻: 710 ESPN &amp; 1330 Tu Liga\n\nhttps://t.co/rqMtWIKaXT Quiet moments with the King. https://t.co/irwuMKDRVG The warmup #LakeShow https://t.co/5m913NyuTP Together #LakeShow https://t.co/kYxEkQMsCd Donning the gold armor. https://t.co/U4EzZDIEoQ #LakeShow 💜💛 https://t.co/IRkZyCQh5o 🎯 @DGreen_14 🎯 https://t.co/0UYfh3FIbE RT @LakersReporter: Rajon Rondo is out tonight (sore calf). “Go Lakers” 💜💛 https://t.co/lbMkga8xOp 〰️ Calm 〰️ https://t.co/hZA2Hd1K0y Getting our minds right. #LakeShow https://t.co/5jCFYPdlbd Simple. Clean. #LakeShow https://t.co/CoPLde0FQj AD is in the building 🤙 #LakeShow https://t.co/F9U9hVuMVE RT @LA_Sparks: For the purple &amp; gold, good luck this season @Lakers 🙌 #LakeShow\n\n#GoSparks #LeadTheCharge https://t.co/3NT6JKKLsj RT @LAKings: 🏀The #LakeShow starts tonight! Good luck @Lakers 👊 https://t.co/zHi5UKNm4E Time for work 👑 #LakeShow https://t.co/RZmVCSBtEV Get to know a new member of the #LakeShow—2 time NBA Champion @DGreen_14, presented by @TISSOT. https://t.co/gVO5gmo4Sg A.M. Business ⏰ https://t.co/3Ted89HW1v For our city. #LAL60 https://t.co/6V2yV2Vp5N RT @LakersReporter: Frank Vogel is opting to wait to share his starting line up until before the game tonight; We know he went with Bradley… RT @LakersReporter: Vogel said Rajon Rondo (sore calf) will be a game time decision. We’re back. Introducing your 2019-20 Los Angeles Lakers. https://t.co/6MNfKSqDnx RT @LakersReporter: We covered lots of ground on my Official Lakers Podcast debut show🎙, including @AntDavis23’s MVP chances, why @KingJame… RT @kylekuzma: SEASON IS HERE!!!!!!!!!! It all starts tonight. \n\n⏰: 7:30 p.m. PT\n📺: TNT\n📻: 710 ESPN &amp; 1330 Tu Liga\n\nhttps://t.co/rqMtWJ1Mmt RT @JaValeMcGee: When you’re starting the fight on the side of the junk yard dogs you realize you’ve grinded and sacrificed for this exact… RT @KingJames: ‘‘Twas the Night Before Christmas feeling right now! Excitement on high beams 🤯😱😤🤩😁👑 The new #LakeShow season is here, and so is the revamped Official Lakers Podcast! \n\nJoin hosts @LakersReporter and @AaronLarsuel for their predictions on the 2019-20 season:\n\nhttps://t.co/eLdXeSYrOn Avery Bradley talks about the jump he thinks the Lakers can make on the defensive end, and the potential for improved 3-point shooting on the other end. https://t.co/SM5xGG4aHj Anthony Davis discussed his excitement to begin the regular season tomorrow night against the Clippers. https://t.co/uJckwSawR9 Toast to Tip-Off with @MartellUSA and win a chance to deliver the game ball at a Lakers game. Must be 21+ to enter. #MakeYourStatement\n\nEnter now &gt;&gt; https://t.co/M8vkWVTJHd https://t.co/ttL82iPm7Q Vogel: Defense ‘will determine whether we have a successful season or not’ https://t.co/iX3trJXB2N Tomorrow. #LAL60 https://t.co/8804pOqIHm RT @troydaniels: #Squad..!!! Tomorrow the journey begins..!! Going to be highs and lows.. important thing is that we stay level and focused… RT @LakersReporter: Injuries for tomorrow: Quinn Cook is available to play, Alex Caruso is probable and Rajon Rondo is questionable (sore c… Then: AD’s first day on the job.\n\nNow: 1 day until it’s time to get the job done.  #LAL60 https://t.co/XX1ouYy87U 👀 @LAKERS x @takashipom 🌼 x @ComplexCon\n\nMerch dropping at ComplexCon next weekend. https://t.co/XxyAcMmyfE Tuesday, it begins. #LakeShow https://t.co/5O7tCfAMtW ⚠️ Floor may be slippery when guarding @ZachN_23 ⚠️ https://t.co/MEkiQ77kPR 🎥 Danny Green shares his thoughts on how the team will continue to develop throughout the season. https://t.co/QLjbbmBk7W 🎥 LeBron James discusses his relationship with Coach Vogel, and his excitement for Opening Night. https://t.co/pPWlGfSUcz 🎥 Frank Vogel gives an injury update on Kyle Kuzma and talks about when he'll decide on Opening Night starters. https://t.co/bZGqFZ6S5A Kyle Kuzma (stress reaction) will not play in Tuesday’s season opener. From the LeBron-AD combo to the new vets' debuts, there was plenty to take away from the preseason: \n\nhttps://t.co/YEOELl3dEu After additional testing, Alex Caruso (bone contusion, pelvis) is considered day-to-day. Then: The Doctor is cemented among the stars. \n\nNow: 2 days until the stars shine bright once again. #LAL60 https://t.co/bJhgIbJKP1 The future is bright 💫 https://t.co/kAEsLtJ7sV You know the drill, #LAL60 and share your top memory as a Lakers fan. Then: The kid from Akron arrived in LA. \n\nNow: 3 days until he leads the team into their second season together 💪  #LAL60 https://t.co/aWG1gKEdYU RT @kylekuzma: That boy got game https://t.co/IJAkcUSP0N Snacks had himself a feast tonight! 🍫🍟🍿\n\n@ZachN_23 with 29 points and 5 treys to close out the preseason. https://t.co/lfMpC7LM1Y RT @JaredDudley619: Can’t wait til Tuesday! 👌🏽 https://t.co/MZHZJTnGUj When it's finally the regular season 😄 https://t.co/nmuvX9MncT That'll do it for the preseason. Four days till the games start counting. https://t.co/wR1AotmsEO Only 12 minutes away from sealing the preseason. \n\nKCP: 25 pts\nNorvell: 23 pts\nCacok: 14 pts, 9 reb https://t.co/dTCdOlPGFX 🇬🇷 Athens Athleticism 🇬🇷\n\n@Kostas_ante13 here protecting the bucket for the #LakeShow https://t.co/hRDeUm6Kxl RT @LakersReporter: Alex Caruso has a bone contusion, pelvis; X-rays were negative. He will not return tonight, and will undergo additional… 👌 #LakeShow https://t.co/nUsU0ujzrS Zach can play 👀\n\n@ZachN_23: 16 pts, 3 3PM https://t.co/FxJmlTT87Z 🔥🔥🔥 @ZachN_23 out here giving opponents floor seats on a nightly basis 🔥🔥🔥\n\n(🎥: @SpectrumSN) https://t.co/brodI2VF74 Together #LakeShow https://t.co/XuWb27i2t4 Zach Norvell putting on a show! 🎟🎟🎟 Kenny's got the ♨️🤚\n\n@CaldwellPope: 14 pts https://t.co/eVVIijCsEZ 🚫👀 @ZachN_23 getting fancy with the dish! \n\n(🎥: @SpectrumSN) https://t.co/esjqaIvnhs RT @LakersReporter: LAL took a 10-5 lead behind 3’s from KCP and Troy Daniels, though Alex Caruso is heading back to the locker room with t… Ball is up. #LakeShow #SuitingUpTogether for the final time in the preseason!\n\nPowered by @toyotasocal https://t.co/VKS0KBM1G4 Last preseason game coming right up! \n\n📺: @SpectrumSN in L.A. NBA TV nationally\n📻: 710 ESPN &amp; 1330 Tu Liga\n\nhttps://t.co/ya83es7hcd Working on the fundamentals 📚\n\n@ACFresh21 | #LakeShow https://t.co/RZ5CYMjPkU One last dress rehearsal 👌 #LakeShow https://t.co/WmzbThrWFB Business trip #LakeShow https://t.co/eN6P13pt47 What will the Lakers look like under the leadership of LeBron James and Anthony Davis?\n\nSenior Writer @KevinDing on the early signs: \n\nhttps://t.co/qSINM5ea48 RT @SouthBayLakers: The journey continues. A big congrats to @MarcusAllen_15 on signing with the @lakers. #SBLakers https://t.co/iizpPNbr2Z We gotta know … What's been your favorite part from the past 60? Post &amp; #LAL60 Then: Showtime squad livin’ the dream.\n\nNow: 4 days until this team’s chasing theirs. https://t.co/f1WWthTgAA One more preseason game in the Bay! \n\n⏰: 7:30 p.m. PT\n📺: @SpectrumSN in L.A. NBA TV nationally\n📻: 710 ESPN &amp; 1330 Tu Liga\n\nhttps://t.co/rhmarvHHsT Royal Court Vision\n\n@KingJames was on another level with these passes last night 👑👀 https://t.co/hKdY1Et0uC “Forget the pain, I’m gonna go get these buckets.”\n\n@JaValeMcGee with words to live by 😂😂😂 https://t.co/qxKqV8Posu \"We have practices where the bigs are working together on passing and it shows in the game\" https://t.co/CFzIDLWQy0 \"We felt the value of sharing the basketball last night but on the tape, there's a long way to go, there's room for improvement.\" https://t.co/fqbCcoTNYA Back to The Bay to close out the preseason 🌴 https://t.co/2zNPmt61nV Support Kareem and #TeamUCLALakers by donating now to the 24-hour Cancer Cure-A-Thon, brought to you by @LLSusa.\n\nDonate today &gt;&gt; https://t.co/JTV1nFBRMk https://t.co/6YoIO0VQ8W LeBron James was voted the NBA's best passer and player with the best basketball IQ. \n\nhttps://t.co/HFuCxAaERM @LakerGirls What’s been your top throwback from these past 60? #LAL60 and share with us. Then: Lighting up the 2009 Championship Parade.\n\nNow: 5 days until they’re lighting up the #LakeShow. https://t.co/j7wUT4QhnJ RT @LakersCommunity: Looking back at all of our camps and tournaments this past summer for #JrNBAWeek 🏀 https://t.co/1kvPIOwxkd OFFICIAL: The Lakers have exercised their team option on Kyle Kuzma \n\nhttps://t.co/Gwv1KMfgc0 OFFICIAL: The Lakers have signed @MarcusAllen_15\n\nhttps://t.co/fryfK6TLHj ⚡️ “LeBron, Quinn and co. dazzle in exhibition victory”\n\nhttps://t.co/CDSum97ZF8 \"I think it all starts on our defensive end and then it just happened, that selfless attitude on the offensive end.\" https://t.co/Gx6SVeznbt \"Bron is gonna be Bron, AD is gonna be AD but it's our job to create space for them,  knock down open shots, and take care of the ball.\" https://t.co/CLb6ti9CaY Quinn Cook talks about getting out on the floor with his new squad for the first time https://t.co/Ncwlu9Zvzi \"We know it takes all of us to win. We're trying to set a standard right now.\" https://t.co/6oAj6W52S0 \"What we're trying to get accomplished is dominant defense and extremely selfless offense.\" https://t.co/4BCPQc1W3E LeBron James and Anthony Davis combined for 19 assists on a high-flying night for the Lakers' offense. \n\nhttps://t.co/IsvMhfxbAW RT @LakersReporter: * @KingJames on the pass: “I had to get it to him some way, somehow.” https://t.co/TldTY33Zoe Just a kid from Akron 👑 #LakeShow https://t.co/Dc6HgVgB2u RT @LakerGirls: W on #LakersPrideNight! https://t.co/CfpiNgxaXC Quinn Cook caught fire in his first performance in front of his new home crowd 🔥\n\nhttps://t.co/VX9XIn8qoZ RT @LakersReporter: Frank Vogel postgame: “What we’re trying to get accomplished is dominant defense and extremely selfless offense.” He th… RT @JaredDudley619: Im a man of my word!!!!! 🙏🏽 https://t.co/2Jfxx6k9hr RT @kylekuzma: Quin cooooooookin https://t.co/IoQPSBTJee Be back soon, @STAPLESCenter ✌️ \n\n@KingJames: 18 pts, 11 ast\nAvery Bradley: 18 pts\n@QCook323: 16 pts\n@AntDavis23: 8 pts, 10 reb, 8 ast https://t.co/D89xGygkIO Leave no man down. #LakeShow https://t.co/HT1vWEpfhM ⏫ @JaValeMcGee got that hang time. https://t.co/5BxfOJbUkE This shouldn't be possible, @KingJames. https://t.co/isuiB5YhDQ Fun night at @STAPLESCenter. \n\n@KingJames: 18 pts, 11 ast\nAvery Bradley: 18 pts\n@QCook323: 16 pts https://t.co/2QPvqvA0FB Who even *thinks* about trying this pass, @KingJames?!?! 🤯🤯🤯\n\n(📺: @SpectrumSN + @espn) https://t.co/aycDZ5jf6m RT @LakersReporter: A ridiculous over-the-head-to-the-corner dime from @KingJames in transition got @DGreen_14 an open corner 3, which he d… RT @LakersReporter: Avery Bradley is 4 for 5 from 3 tonight. And that’s his job on offense this year, to space and convert 3’s on LeBron/AD… .@robbierogers, winner of this year’s Laces of Unity Award, is a game changer on and off the field 💯 #LakersPrideNight https://t.co/WA9Xh8Oes6 💜3️⃣💛 https://t.co/UkjV3ztvGg #LakeShow ➕2️⃣6️⃣\n\n@KingJames: 16 pts, 6 ast\n@QCook323: 13 pts\n@DwightHoward: 13 pts https://t.co/8kCboU44ho @KingJames @SpectrumSN @espn Go 🆙 and get it, @DwightHoward! https://t.co/2bUpLaJpQ4 Anybody can read the defense on the ground. @KingJames can do it mid-air.\n\n(📺: @SpectrumSN + @espn) https://t.co/3ZeecTpaL5 Dime #LakeShow https://t.co/WwrvJGxbie RT @LakerGirls: ❤️🧡💛💚💙💜 https://t.co/mAXIFq44o4 @QCook323 👨‍🍳👨‍🍳👨‍🍳 https://t.co/aLyaPWhqk3 Quinn Cookin’ \n\nA #LakeShow debut 💜💛 https://t.co/kdIfkPIK4t RT @LakersReporter: What an impressive debut from @QCook323, who’s now 3 for 3 from 3, plus a FT line J, for 11 points in 5 minutes. LAL up… Handles like a guard. Passes like a guard. Dominates like nothing else.\n\n(📺: @SpectrumSN + @espn) https://t.co/HKMI8leLFf Fellas not wasting any time. \n\n@KingJames: 6 pts, 4 ast\n@AntDavis23: 5 pts, 5 reb, 4 ast https://t.co/55w5cZfquC Best keep out of his path 🌪🌪🌪\n\n(📺: @SpectrumSN + @espn) https://t.co/NF1YaEX4Aa RT @LakersReporter: LeBron’s really setting a tone tonight … he’s getting back in transition, closing out to shooters, then sprinting up in… That Big-to-Big connection 👀\n\n(📺: @SpectrumSN + @espn ) https://t.co/Vsw8tvywXy What a duo. #LakeShow https://t.co/M1MJwPXKhK For the first time at @STAPLESCenter: \n\n“No. 3. 6’10. 8th year from Kentucky.” https://t.co/C86xlc89Cy We liked the sound of that 🎤 #LakersPrideNight https://t.co/52TXtqruzT Ball is up. #LakeShow #SuitingUpTogether powered by @toyotasocal https://t.co/bSGoLtT5bs Time to tip off #LakersPrideNight!\n\n📺: @SpectrumSN in L.A. ESPN nationally\n📻: 710 ESPN &amp; 1330 Tu Liga\n\nhttps://t.co/cqalIIeo0E Home debut for @AntDavis23 https://t.co/0y9fqIxysa Keep the team in your back pocket. Download the Lakers app today.\n\n📲 Apple &gt;&gt; https://t.co/Wg5zsjNZLh \n\n📲 Android &gt;&gt; https://t.co/gTV21ke07g https://t.co/utUbvpvpKz RT @LakersReporter: Rajon Rondo is out tonight (rest). 🏀🌈 #LakersPrideNight https://t.co/oJccnxXBB6 The #LakeShow is going to be lit up a little differently tonight 👀#LakersPrideNight https://t.co/udu6TWHghT King &amp; Kuz #LakeShow https://t.co/kyHJAVjL5c RT @LakerGirls: We’ve got a little something special planned for #LakersPrideNight ! 🌈 https://t.co/SxIIu8oFUe Back to business #LakeShow https://t.co/cLHFxdZsJO 😀😀😀 https://t.co/Utzt6myKaO Anthony Davis will play tonight against the Golden State Warriors. We want to see your favorite moment in Lakers History: #LAL60 Then: Legends are forever. \nNow: 6 days until legends are made. https://t.co/Am5GRZwAcO Back at it with our second annual #LakersPrideNight!\n\n⏰: 7:30 p.m. PT\n📺: @SpectrumSN in L.A. ESPN nationally\n📻: 710 ESPN &amp; 1330 Tu Liga\n\nhttps://t.co/mm0Gl5xRns RT @kaj33: Hope to see y’all out there let’s make this the best year yet https://t.co/1K8ybRsV3G Our annual #LakersPrideNight returns tomorrow 🏳️‍🌈 https://t.co/JyQiG7BxSW Kareem is captaining another great cause with @LightTheNight.\n\nPlease support #TeamUCLALakers by donating now &gt;&gt; https://t.co/rAv5sCtQs6 https://t.co/Rxrwq6D6ZB 🎥Frank Vogel: ‘I credit our guys for gutting it out last night’ https://t.co/CaSwOsYyM3 🎥 Anthony Davis says he ‘felt fine’ after completing a full practice post-thumb sprain. https://t.co/o1i22Gwq5B RT @LakersReporter: New Story - Injury Update on Davis, Kuzma and Cook: https://t.co/hsdmFGgPbn RT @LakersReporter: Quinn Cook practiced today. He’s hoping to play tomorrow, but they’ll see how he responds to the practice before the ga… RT @LakersReporter: Davis said the plan is for him to play tomorrow night, but they’ll monitor how his thumb feels before making the determ… RT @LakersReporter: Anthony Davis said he knew his thumb was “just a jam” and he completed the full practice: “It felt fine at practice tod… Had to switch it up today ☀️🏈 https://t.co/wBAen9h90v RT @LakersReporter: LeBron was a 1st Team All-State WR in high school, naturally. https://t.co/McG1D49gXP @kobebryant Are you ready for this season? Share your best moment as a Lakers fan with #LAL60. RT @LakersReporter: The Lakers are getting a lil’ sun at the end of practice today, doing some light work on the turf field next door ... m… Then: The Age of Kobe began.\nNow: 7 days until a new era starts. https://t.co/dqTqVCusJR OFFICIAL: The Lakers have signed guard Reggie Hearn https://t.co/0KfyUjUAWn 😤🇬🇷💜💛\n\n@Kostas_ante13 | #LakeShow https://t.co/OvxcJkCQZA ⚡️ “Rookie Zach Norvell Leads Lakers to Victory in First Preseason Start”\n\nhttps://t.co/Sw14CS9fbz “It doesn’t matter who’s on the floor, we’re trying to play a certain way. I was proud of our guys” -Frank Vogel https://t.co/Qct3Qs2bQ4 “First game in Staples with a Lakers jersey on, something you always dream of. Felt good to get out there” -Zach Norvell Jr. https://t.co/eYe6xJHCDO \"The young guys are doing a good job of keeping up, and learning quick.\" -Alex Caruso https://t.co/1xb4c2t0j9 \"We just tried to move the ball a lot, make sure everybody touched the ball, and good things end up happening that way\" -Dwight Howard https://t.co/C82hCSPioL The Lakers' return to STAPLES Center was highlighted by Zach Norvell Jr. taking over with 22 points in his home debut. \n\nhttps://t.co/JkxKSKPDs9 🎥 @DwightHoward packs the box score with 12 points, 13 rebounds, 6 assists and 4 steals. https://t.co/PAUI0ygtqz 🎥@ZachN_23 scores a game-high 22-points in the Lakers win. https://t.co/62iQJ1p0Yc 🎥 Seven Lakers score in double-digits in a wire-to-wire victory. https://t.co/Yf5aa6H8fE RT @JaredDudley619: Man it felt so good to be back on the court! After 2 weeks of no practicing and no 5 on 5 def felt rusty to play in a g… Zach Norvell Jr. drops a game-high 22 pts and Dwight Howard (12 pts, 13 reb, 6 ast, 4 stl) stuffs the stat sheet. \n\nhttps://t.co/eb2lN0BMza RT @LakersReporter: Vogel postgame: “Zach has a real knack for scoring the basketball ... everybody has to honor him, so he brings gravity.… RT @LakersReporter: Frank Vogel said that no matter who’s in the game, “We want to play harder and more physical” than the opponent, and he… No you didn’t, @ZachN_23 😱 https://t.co/y4bSQtTVaW First time playing at STAPLES Center and @ZachN_23 drops 22 for the #LakeShow.\n\nWe see you, Rook! 🔥🔥🔥 https://t.co/BTniOESg28 Meet our rookie, @ZachN_23. He’s here to take your ankles.\n\n(📺: @SpectrumSN) https://t.co/z7XC5QO7C3 RT @LakerGirls: Feels good to be back!! 💜 https://t.co/S5BIqTReaM RT @LakersReporter: Zach Norvell (22 points) crossed over Jordan Poole on the perimeter, causing him to fall over, and he then drove to the… Anthony Davis, who was injured in the first quarter of Saturday’s game against the Brooklyn Nets, had an MRI today. \n\nResults of the MRI confirmed a sprained right thumb and his status will be day-to-day. Spotted: Our man is back for another season 💜💛 #LakeShow https://t.co/jEvl2Z9J3P Dwight's got himself a line tonight 👀\n\n@DwightHoward: 12 pts, 13 reb, 6 ast, 4 stl https://t.co/r8ldeI6FVY Support from the sideline. https://t.co/EJOeM9mopY @SpectrumSN One-man fast-break.  @DwightHoward Style. https://t.co/wBhKoMKLxf Dwight out here doing it all by himself with the steal and slam!\n\n(📺: @SpectrumSN) https://t.co/1ITPt4IwED 🍽🍽🍽🍽🍽\n\n@dstockton32 sets the table.\n@Vontae__15 feasts. https://t.co/NfyPPcDPAP Zach &amp; The Bigs putting in that first-half work.\n\n@ZachN_23: 12 pts \n@JaValeMcGee: 9 pts, 2 blk\n@DwightHoward: 8 pts, 12 reb https://t.co/SWL5Z92elB First start for @ZachN_23 💜💛 #LakeShow https://t.co/7Qm0oi0KqX RT @LakersReporter: Good ATO from Vogel to get KCP a layup out of a time out, with Dudley making the pass. LAL lead 49-40 late in the 2nd Q. JaVaaaale McThreeee 👌👌👌\n\n(📺: @SpectrumSN) https://t.co/SeOsMT06ha RT @LakersReporter: David Stockton has 8 points off the bench in 8 minutes, with a pair of 3’s to go with 2 assists as LAL lead 44-31 after… The rook got his first start tonight ... and the rook came out firing! \n\n@ZachN_23 with a 10-point opening quarter 🔥🔥🔥\n(📺: @SpectrumSN) https://t.co/Un06gEnsxj #LakeShow up double figures at the end of the first. \n\n@ZachN_23: 10 pts\n@DwightHoward: 4 pts, 6 reb, 2 stl https://t.co/9O0JuOhZ0x RT @LakersReporter: The Warriors, with Curry and 4 young guys, started 1 for 11 as LAL lead 10-4. Lakers are just 2 for 9 from the field, b… AC with the goal line fade to @CaldwellPope! 🏈🏈🏈\n\n(📺: @SpectrumSN) https://t.co/iix4l67PSu First time in the starting lineup. 26 seconds in. The rook @ZachN_23  makes it splash 💦\n\n(📺: @SpectrumSN) https://t.co/xEonwaqYay Ball is up. #LakeShow Almost game time #LakeShow https://t.co/ZKKc2LhGoR Home sweet home 🏠 #LakeShow https://t.co/1xg1zbnzFB We've waited long enough. Time for Lakers Basketball live from Los Angeles!\n\n📺: @SpectrumSN in L.A. NBA TV nationally \n📻: 710 ESPN &amp; 1330 Tu Liga\n\nhttps://t.co/xop75PfkZj RT @LakerGirls: First game on the home floor!! #LakeShow https://t.co/XdfkgnHhwS Back home. Ready to hoop. #LakeShow https://t.co/ajM43THxgg Making his #LakeShow debut tonight 🙌 https://t.co/2F5I9j3zzP #SuitingUpTogether on our home floor!\n\nPowered by @toyotasocal https://t.co/bWCiMs5O67 RT @LakersReporter: Looks like the starters for the first half will be Alex Caruso, Zach Norvell, KCP, Jared Dudley (making his preseason d… RT @LakersReporter: Vogel said Kyle Kuzma (stress reaction, ankle) has been cleared for non-contact activities. Meanwhile, he said the team… RT @LakersReporter: Frank Vogel said that in addition to LeBron and AD, vets Danny Green, Rajon Rondo and Avery Bradley will rest tonight. It’s a good day to be back in LA #LakeShow https://t.co/5ceNcJcQHU Celebrate with us, post a picture of your favorite memory as a Lakers fan with #LAL60. https://t.co/4exrtmvDQG Then: The first official Laker Day.\n\nNow: 8 days until our first game of the season marks our 60th year of Lakers Basketball in LA. https://t.co/Qlob8X1aAB RT @LakersReporter: Coming off the trip to China, Frank Vogel is opting to rest LeBron James and Anthony Davis for tonight’s preseason game… For the first time this season: It's Lakers Game Day in Los Angeles.\n\n⏰: 7:30 p.m. PT\n📺: @SpectrumSN in L.A. NBA TV nationally \n📻: 710 ESPN &amp; 1330 Tu Liga\n\nhttps://t.co/8dRTLFmLmI RT @LakersReporter: New Story: “Lakers Experiment with Differing Lineups” - a look at how Frank Vogel used different players around LeBron… A look back at the best plays from our preseason action in China #LakeShow https://t.co/Pu7k3TsLXr RT @LakersReporter: Update: the MRI on Davis’ sprained thumb will come on Monday. Instead of morning shootaround, the team will have a walk… The 👑hits 'em with style and grace. https://t.co/Ct8JH6NM64 Next Stop: 🏠 https://t.co/RUzpcIU5bt RT @LakersReporter: Anthony Davis will get his sprained right thumb tested tomorrow upon the team’s return to L.A. See you guys back in the States 👋 https://t.co/bYgVW09md0 @SpectrumSN And he spins through the paint for another hammer 🌪 🔨\n\n(📺: @SpectrumSN) https://t.co/ER3VYFSCL5 Kostas steps through for the and-1 in his #LakeShow preseason debut!\n\n(📺: @SpectrumSN) https://t.co/IupnXYdroZ One frame remains in Shenzhen. \n\n@CaldwellPope: 11 pts, 6 reb\n@JaValeMcGee: 9 pts, 2 blk https://t.co/xRXSiBWSIo Posterized: A Play in Four Parts https://t.co/qDDV6XU8qf JaVale hits ‘em with the popcorn machine and the poster! 🍿🖼\n\n(📺: @SpectrumSN) https://t.co/jfrGwuZ1z0 RT @LakersReporter: Anthony Davis, who had his thumb lightly wrapped in the 1st Q, just came back from the locker room with some ice on it.… 24 minutes gone in Shenzhen. \n\n@CaldwellPope: 6 pts, 4 reb\n@KingJames: 6 pts, 4 ast https://t.co/BWASi78jtr Can’t take your eyes off @DGreen_14 for a second. https://t.co/bs0PC4k4XA 🌲⛹️‍♂️🌲 https://t.co/bHSuZOi6fl Closing out the quarter in the Freshest way 😎\n\n(📺: @SpectrumSN) https://t.co/0LwJhdpf7e One frame through. \n\n@KingJames: 6 pts, 4 ast\n@AntDavis23: 6 pts, 2 blk https://t.co/naNCm2sbkI The power and the finesse 👑\n\n(📺: @SpectrumSN) https://t.co/I5Ew9qlk85 It’s back. https://t.co/lpS4d6Ph1E #SuitingUpTogether in Shenzhen powered by \n@ToyotaSoCal https://t.co/LWxn6B5fwc “Layup line” is more of a suggestion. https://t.co/RrWlePzT31 Live and in person https://t.co/mc5AWlNDdR One more early wake-up call for Lakers Nation back in the States! \n\n⏰: 4:30 a.m. PT\n📺: @SpectrumSN in L.A. NBA TV nationally\n📻: 710 ESPN &amp; 1330 Tu Liga\n\nhttps://t.co/zMlXYVJ4dT RT @LakersReporter: Injury update: Kostas Antetokounmpo is available to play. The following Lakers are out: Jared Dudley (sore right quad);… Feeling out the Shenzhen hardwood #LakeShow https://t.co/2yxHPAVPsQ Always Be More https://t.co/AZIKXvgEML 📍 Shenzhen https://t.co/5HVZPMHDyz Armed with power, handles and shooting touch, Anthony Davis \"is not just the unibrow, he is the unicorn.\"\n\n@KevinDing: \nhttps://t.co/eYB6X8c99L Shanghai sights #LakeShow https://t.co/FDvFBC21kY Final from Shanghai  \n\nJames: 20 pts\nRondo: 18 pts, 6 ast\nCaruso: 11 pts, 8 ast, 3 stl https://t.co/MUpHQ3LXMT RT @LakersReporter: Two-way rookie Zach Norvell has had some nice moments tonight on both ends of the floor, certainly highlighted by scori… Global superstars. Students of the game. \n\n@AntDavis23 | @KingJames https://t.co/4fLw5FUL0L No easy buckets https://t.co/JQVxitBMf5 Point of attack\n\n@KingJames: 20 pts\n@RajonRondo: 18 pts, 6 ast https://t.co/g6FN0Lz9ON AD with the swat. Bron with the finish. It’s a Show.\n\n(📺: @SpectrumSN) https://t.co/h8yQFTLXMK RT @LakersReporter: * @JaValeMcGee has 5 blocks and 3 steals with 9 rebounds and 4 points in 17 minutes, looking every bit like the player… Too big. Too fast. Too strong.\n\n(📺: @SpectrumSN) https://t.co/2jys7ANkCh 😤😤😤 https://t.co/GUKQxiPBuo Halfway through this one.  \n\n@KingJames: 16 pts\n@AntDavis23: 14 pts https://t.co/tRX3K8o0kj .@ACFresh21 on both ends!\n\n(📺: @SpectrumSN) https://t.co/jOWrcGlPzd 🔟 for Bron. 🔟 for AD. https://t.co/9ANfUgAYRq The vision. The footwork. AD’s got it all from head to toe 👀👣\n\n(📺: @SpectrumSN) https://t.co/cmwJPUU4ox RT @LakersReporter: AD has been sprinting up the court in transition and forcing the Nets to foul once he establishes position down low. Ju… #SuitingUpTogether in Shanghai powered by @ToyotaSoCal https://t.co/Ql2YYdMaCg What’s up, Lakers Nation! \n\nWhere are our Angelenos who woke up at 4 in the morning for this one? https://t.co/RF2QLRcrAw Waking up with the #LakeShow at 4:30 a.m. PT!\n\n📺: @SpectrumSN in L.A. NBA TV nationally\n📻: 710 ESPN &amp; 1330 Tu Liga\n\nhttps://t.co/ygMScJ2kw8 Good morning to the folks back home ☕️ https://t.co/U7klNaAtJA 〰️ x 👨‍🍳 https://t.co/ql1Dum7eTG Shanghai Styles https://t.co/Are4L8VtMZ The Lake Show goes where you go: Download the app now.\n\n📲 Apple &gt;&gt; https://t.co/Wg5zsjNZLh\n\n📲 Android &gt;&gt; https://t.co/gTV21ke07g https://t.co/ug5oG80dVD 📱🔥\n\n#LakeShow /// #WallpaperWednesday https://t.co/lgvWuCuqvq Lakers Nation, help us wish a happy birthday to Devontae Cacok 🎂 https://t.co/fsZdUq9yfn Wheels up to China ✈️ #LakeShow https://t.co/jES55OB6DW Relive the first W of the #LakeShow preseason 💜💛 https://t.co/8X3mcHDADh ⚡️ “AD Destroys in Lakers Preseason Debut”\n\nhttps://t.co/uydIdmuF8o Frank Vogel dubs AD a “beast of a scorer” after preseason debut. https://t.co/I4bXTkwALj Anthony Davis reacts to big performance in Lakers preseason debut. https://t.co/lQwd0y5NRN LeBron James reflects on his return to the court in the Lakers’ preseason opener. https://t.co/aDVM3woV4D RT @troydaniels: The Journey begins now..!! That purple and gold hit different. Great team win tonight.!! #LA #VA #lakeshow @Lakers https:/… “He can beat you with step-back jumpers, 3-point shots, drives from the perimeter ... and he’s also a terrific lob threat and finisher inside.” - Frank Vogel\n\nhttps://t.co/cG80DapHWN RT @ACFresh21: Good first run.. Felt good to be back !! #LakeShow Anthony Davis made it a debut to remember with 22 points and 10 boards in only one half of action. #LakeShow\n\n(📺: @SpectrumSN &amp; TNT) https://t.co/zdF8u2mixZ RT @kylekuzma: AD=🤯🤯🤯 RT @LakersReporter: Frank Vogel on Anthony Davis and his dominant first half: “He’s a monster.” 〰️ @AntDavis23: 22 pts, 10 reb\n👑 @KingJames: 15 pts, 8 ast\n\nAnd they only played the first half.\n\nhttps://t.co/otNaIkNdck Consider this a warning, @NBA. https://t.co/AKA2rWPN1p RT @LakersReporter: The 2nd 3 from Troy Daniels tonight gives him 14 points, and has LAL up 115-91 with under 3 minutes to play. Caruso has… Get used to it 🤩 #LakeShow https://t.co/P0267Oviqz Starting bigs with the double-doubles. \n\n#LakeShow up 2️⃣0️⃣\n\n@AntDavis23: 22 pts, 10 reb\n@JaValeMcGee: 10 pts, 13 reb https://t.co/G7qTMjBdD8 RT @LakersReporter: Alex Caruso has LAL’s bench unit clicking well, leading the way with 8 points and 2 assists to push the lead back up to… Your favorite player’s favorite player with the and-1\n\n@ACFresh21 ➕ 1️⃣\n\n(📺: @SpectrumSN &amp; TNT) https://t.co/7wwZgY0lQ9 RT @LakersReporter: Third Q starters for LAL: Alex Caruso, Troy Daniels, KCP, Devontae Cacok and JaVale McGee. LeBron and AD are very likel… The Brow reaches into his bag for the circus shot! 〰️🎪\n\n(📺: @SpectrumSN &amp; TNT) https://t.co/Lu4TLkB28J These guys are gonna be a problem. \n\n@AntDavis23: 22 pts, 9 reb\n@KingJames: 15 pts, 8 ast https://t.co/XSIqtlwfsx You can surround @KingJames with your entire team. He’s still gonna score 👑💪\n\n(📺: @SpectrumSN &amp; TNT) https://t.co/PsZuaJRPuG RT @LakersReporter: Anthony Davis is up to 20 points, much coming against the league’s best defensive PF/C in Draymond Green. GSW, on the o… Best stay off the tracks when the L-Train is coming 🚂🚂🚂\n\n(📺: @SpectrumSN &amp; TNT) https://t.co/z5OeTL9Q5h This guy really threw down five dunks in his first quarter as a Laker. @AntDavis23 is something else.\n(📺: @SpectrumSN &amp; TNT) https://t.co/rlrlMSa8tw RT @LakersReporter: LAL’s starting line up looked terrific against the shorthanded Warriors, with AD (17 points, 7 boards, a bunch of dunks… 17 points and 7 boards in his first quarter in gold. \n\nLakers Nation, you're gonna love this guy. https://t.co/ijakw3TS2f Anthony Davis with three straight dunks. You can't stop this guy. AD out here trying to tear down the rim in Game 1 🤯 https://t.co/Hcgx2vx8sp RT @LakersReporter: Moments after finding McGee on a pretty high-post pass, Anthony Davis hit the O glass to slam back a miss, putting LAL… AD with the tip-in for the first #LakeShow bucket of the preseason! 〰️〰️〰️ Ball is up. #LakeShow #SuitingUpTogether tonight:\n\nPG: Avery Bradley\nSG: @DGreen_14 \nSF: @KingJames \nPF: @AntDavis23 \nC: @JaValeMcGee Let the Show begin. Preseason 2019 tips off now in the Bay! \n\n📺: @SpectrumSN in L.A. TNT nationally\n📻: 710 ESPN &amp; 1330 Tu Liga\n\nhttps://t.co/RVVJExQbmY Preseason game 1 https://t.co/OUk4Ok6T46 New beginnings. #LakeShow https://t.co/hti8pVn7lx Pre-season reps. #LakeShow https://t.co/psKLNdvpEs RT @LakersReporter: Starters: Avery Bradley, Danny Green, LeBron James, Anthony Davis and JaVale McGee. Frank Vogel cited Bradley’s strong… First fits of the year 🔥 #LakeShow https://t.co/DGrEMzMI4p You ready? 😤 #LakeShow https://t.co/UstHzixbxD It's almost time 〰️\n\n@AntDavis23 /// #LakeShow https://t.co/GmTw0V6DoH It's finally time. Lakers Basketball returns tonight at 5 PT!\n\n📺: @SpectrumSN in L.A. TNT nationally\n📻: 710 ESPN &amp; 1330 Tu Liga\n\nhttps://t.co/tWtzm6z5Gt Tomorrow, the wait is over. #LakeShow https://t.co/KvwKkZXOgp First flight of the year ✈️\n\nLakers basketball is back #LakeShow https://t.co/PnQFTquCq3 Frank Vogel says LeBron and AD are expected to play in Saturday’s preseason opener https://t.co/DlgiHjEF5W JaVale: Will be “exciting to see” himself and Dwight alongside AD https://t.co/6kMkTAK2z6 A little fun before we head to The Bay 😂 #LakeShow \n\n@KingJames x @AntDavis23 https://t.co/5b9FeGufyr RT @LakersReporter: New Story: “The Impact of LeBron’s Uncharacteristically Long Offseason”, looking at how the 15-time All-Star had 70-ish… RT @LakersReporter: Frank Vogel said he expects both LeBron James and Anthony Davis to play in Saturday’s preseason opener at Golden State. OFFICIAL: The Lakers have signed @dstockton32 \n\nhttps://t.co/ObCv0PRWqF “You’re not going anywhere with the bounce with Avery Bradley on you.” https://t.co/Yf73Lxthrn Vogel: AD’s ‘ridiculously versatile’ game is key for Lakers’ offense https://t.co/ngO68qnXeA Rob Pelinka describes this year's squad as “a really serious team of veterans.”\n\nSenior Writer @KevinDing on the vet-laden #LakeShow:\n\nhttps://t.co/7PpLpvtHSN Rajon Rondo shares his thoughts on his teammates and his own journey to the NBA. https://t.co/X9p9Zu9xGs LeBron: ‘Luxury of our personnel’ allows for lineup flexibility https://t.co/5McZhgQMhs RT @LakersReporter: LeBron James, after Thursday’s practice, said the role he plays - on ball, off ball, running the offense, playing aroun… Iron sharpens iron 👑〰️ #LakeShow https://t.co/kDSIevthMx AD &amp; LeBron in the same lineups. \n\nAvery Bradley stealing the spotlight. \n\nDwight &amp; JaVale setting the defensive tone. \n\n@LakersReporter and @JoeyARamirez break down the biggest storylines from training camp. https://t.co/mc9EBDpF0F #LakeShow | #WallpaperWednesday https://t.co/7BnJVbriAT All business. One goal. Together. \n\n#LakeShow https://t.co/s6YQ7TWweU \"He can really guard the ball, to the point where Coach said, ‘If he’s on the ball, just pass it.’ \n\n\"He’s very special on the defensive end.” - Anthony Davis\n\nhttps://t.co/fatgWaQR9T Avery Bradley says defense is mindset for 'every practice, every game' https://t.co/oP2UjcHHzF Alex Caruso stays hungry by 'fighting for minutes' https://t.co/8FkUXt91eW AD praises Rondo &amp; Bradley's start to camp. https://t.co/p4ZpQYoGYg Frank Vogel: ‘Who’s gonna help us win is the first criteria for playing’ https://t.co/j92pFr0BWW RT @LakersReporter: Davis is the latest Laker to point out how much Avery Bradley has impressed: “Pretty special. He can really guard the b… RT @LakersReporter: Bradley added this about choosing the Lakers: “I felt like this was the situation where I could reach my full potential… RT @LakersReporter: After Tuesday’s practice, Frank Vogel said he’s happy with “everyone on our team” after 6 practices in 4 days. Said “no… Tuesday is the perfect day to get better 👑 #LakeShow https://t.co/m7gvUKK5At RT @LakersGaming: .@Twitch Tuesdays are in full swing with @Mootyy2K!\n\n🏀 @NBA2K\n⏰ 12:00PM PT\n💻 https://t.co/EUsKIxKz8P https://t.co/g6h8okT… Two-a-days are the best days 😃 #LakeShow https://t.co/b9YfHUzJDk Turn the perimeter into the trenches 😤 #LakeShow https://t.co/E7MmDH5wQ4 No shortage of competition at the point guard position. \n\nhttps://t.co/NWwixq8QAC Frank Vogel reviews the team’s progress on day three of camp https://t.co/SOonbpqdkX LeBron: Vogel and assistants ‘put us in position to win’ https://t.co/MrnjDQKB4V RT @LakersReporter: LeBron asked what he’s looking for from the coaching staff, after saying he’s pleased with the front office’s choice of… When you give @kylekuzma a disposable camera, you never know what you’re gonna get 📸 \n\n#LakersMediaDay https://t.co/2AN0iir0hw Intensity. Enthusiasm. Energy. \n\nAnother good day of practice in the books. #LakeShow https://t.co/CBmTtTSn2X Dwight. JaVale. AD. That’s a scary sight. #LakeShow https://t.co/ZU8e5bF00e \"We’ve got two of the best players in the world competing together and all anybody’s talking about is Avery Bradley’s tenaciousness. \n\n\"That speaks volumes about what he’s been able to show in the first couple of days.”\n\nhttps://t.co/88Qc9Jqmmk 'All anybody's talking about is Avery Bradley's tenaciousness' - Frank Vogel https://t.co/3KE8oE3akv Dwight Howard tasked with setting physical tone at first practices. https://t.co/28DUR0Mxzj Danny Green says team is ‘defensive oriented’ to start camp. https://t.co/0bDze5f9Ai Playmakers at work 🎩 #LakeShow https://t.co/GlEHAOQYOT RT @LakersReporter: Vogel said LeBron has looked really good physically ... zooming out looking at the season at large, he said the approac… RT @LakersReporter: Danny Green on the first two days of practice: “Pretty good. Conditioning wise, everybody looks good. Had some good scr… Day 1. Together.  \n\n#LakeShow https://t.co/lqSEX1Vdd7 Frank Vogel would put LeBron and AD ‘against anybody in the league’ https://t.co/U8VGRifwGi AD considers chemistry with LeBron ‘very important’ https://t.co/S2KUbAbmLc LeBron: ‘It starts and ends with me and AD’ https://t.co/Pm8i3Z7pnF Building chemistry #LakeShow https://t.co/oxT1ybJxcG “I’m very motivated. But I’m right now not in talking-about-it mode. I’ve been very quiet this summer for a reason. My mother always told me: ‘Don’t talk about it. Be about it.’ “\n\nSenior Writer @KevinDing:\n\nhttps://t.co/2HMnxRdFvE “They’re guys who are going to smash the defense if they don’t bring early help and double teams.\" - Frank Vogel \n\nhttps://t.co/ztXVWsyR20 First practice of the year. Setting the tone. #LakeShow https://t.co/uwtbLAzObh “I think this is the most exciting the league has been in a while.” - Anthony Davis RT @LakersReporter: Vogel: “My sense of guys is that there’s going to be a willingness to sacrifice for the betterment of the team.” That d… Frank Vogel on how he sees LeBron James and Anthony Davis against the league’s other duos: \n\n“I think we’ve got the best of them. ... We’ve got two top-five players. I’d put them up against any of the rest of them.” @troydaniels @Kostas_ante13 @DGreen_14 @CaldwellPope @DwightHoward @RajonRondo @Vontae__15 @QCook323 @ZachN_23 @JaValeMcGee @D_Jay11 @Thortontucker .@AntDavis23 makes his #LakersSneakerCam debut https://t.co/2Q6PL7jvpy @troydaniels @Kostas_ante13 @DGreen_14 @CaldwellPope @DwightHoward @RajonRondo @Vontae__15 @QCook323 @ZachN_23 @JaValeMcGee @D_Jay11 Hometown tribute for the rook, @Thortontucker #LakersSneakerCam https://t.co/w7NHy57EuV @troydaniels @Kostas_ante13 @DGreen_14 @CaldwellPope @DwightHoward @RajonRondo @Vontae__15 @QCook323 @ZachN_23 @JaValeMcGee .@D_Jay11 with the Spongebob kicks. #LakersSneakerCam https://t.co/CShRSULPZr @troydaniels @Kostas_ante13 @DGreen_14 @CaldwellPope @DwightHoward @RajonRondo @Vontae__15 @QCook323 @ZachN_23 .@JaValeMcGee goes retro for #LakersSneakerCam https://t.co/trLRns1QA9 @troydaniels @Kostas_ante13 @DGreen_14 @CaldwellPope @DwightHoward @RajonRondo @Vontae__15 @QCook323 More Kobe 4 Protros from @ZachN_23 #LakersSneakerCam https://t.co/mQXepe3SQq @troydaniels @Kostas_ante13 @DGreen_14 @CaldwellPope @DwightHoward @RajonRondo @Vontae__15 .@QCook323 bringing 🔥🔥🔥 #LakersSneakerCam https://t.co/fI1xuvmoK2 12 years in the game 😤 \n\n#LakersMediaDay https://t.co/wGI5aa04IJ @troydaniels @Kostas_ante13 @DGreen_14 @CaldwellPope @DwightHoward @RajonRondo LeBron 16s on @Vontae__15's feet. #LakersSneakerCam https://t.co/HGtHZ23b23 Championship pedigree 🏆 #LakersMediaDay https://t.co/HJX2tL0tEv @troydaniels @Kostas_ante13 @DGreen_14 @CaldwellPope @DwightHoward .@RajonRondo in the Rondo 6s. #LakersSneakerCam https://t.co/w91UOLRupk @troydaniels @Kostas_ante13 @DGreen_14 @CaldwellPope .@DwightHoward with the fresh white Kobe 4s. #LakerSneakerCam https://t.co/UENiioKGtf @troydaniels @Kostas_ante13 @DGreen_14 Kobe 4 Protros for @CaldwellPope #LakersSneakerCam https://t.co/nKS5g6McbO @troydaniels @Kostas_ante13 .@DGreen_14 rocking the Clyde Hardwoods for #LakersSneakerCam https://t.co/3f0ygpkHZt No more waiting. #LakeShow season is here.\n\nhttps://t.co/32izZFMOLh ⚡️ “Lakers Season Begins with Annual Media Day”\n\nhttps://t.co/InQzhwOBn9 @troydaniels @Kostas_ante13 AC looking fresh in the Kobe 4 Protros.\n\n#LakersSneakerCam https://t.co/lb9AsrNlyV @troydaniels Coming to America x Coming to LA\n\n@Kostas_ante13 with the #LakersSneakerCam heat 🇬🇷🔥🇺🇸 https://t.co/DjZvP2QNOp AC FRESH x #LakersMediaDay https://t.co/l5fl9yt1AR RT @LakersReporter: Anthony Davis said he’s already feeling like the team is tight. Personalities are meshing, and there is excitement abou… @AntDavis23 @KingJames Troy Daniels: “When the Lakers called, it was a no-brainer to me … I have one goal, and that’s to be a champion and play with the best. So I’m here.\"\nhttps://t.co/V4Ka6cbcB3 RT @LakersReporter: Dwight Howard on how he’s feeling physically after playing only 9 games last season: “I feel amazing. I’m at a pretty g… RT @kylekuzma: BIG FACTS https://t.co/3BVKvL89aS 3️⃣9️⃣ #LakersMediaDay https://t.co/xSYAec2eSL RT @LakersReporter: * @AntDavis23 on not really needing to recruit free agents: \"A lot of guys were texting me … ‘It’s you and LeBron … can… @AntDavis23 @KingJames AD on staying focused: “Just knowing that nobody outside our locker room matters.” \nhttps://t.co/V4Ka6cbcB3 .@troydaniels bringing the 🔥🔥🔥 for his first #LakersMediaDay\n\n#LakersSneakerCam https://t.co/QVmk6k0H0K * @AntDavis23 is excited about playing next to @KingJames: “I think it’ll put the defense in a bind when you have two guys you have to worry about every time down the floor.”\nhttps://t.co/V4Ka6cbcB3 Year 3 will be special 🦈 \n\n#LakersMediaDay https://t.co/Qv8BEVjZ5o @ACFresh21 Avery Bradley: \"This year my focus going into the season is defense and being able to make shots at a high percentage.\"\nhttps://t.co/V4Ka6cbcB3 @ACFresh21 Jared Dudley on LeBron: “I see a man who’s extremely focused, who’s extremely on a mission.”\nhttps://t.co/V4Ka6cbcB3 More players at the podium here at Media Day 2019. #LakersMediaDay https://t.co/kGfFniWjdm @ACFresh21 Caruso doesn’t care how he’s used: \"Whatever I have to do to help us win is what I’m going to do.”\nhttps://t.co/V4Ka6cbcB3 RT @LakersReporter: Caruso said he’s been very appreciative of the support he’s gotten from Lakers fans, and explained why they stand out:… Squad. #LakersMediaDay https://t.co/xIgzVOwTVD * @ACFresh21: \"Basketball for me is such a joy. l have so much fun competing with my teammates. It got me to where I was aiming and I think it’s just the beginning.”\nhttps://t.co/V4Ka6cbcB3 RT @LakersReporter: Danny Green said he thinks he’ll fit in “perfectly fine\" alongside LeBron and Anthony Davis. He mentioned how teams hav… Kyle Kuzma: \"It’s pretty cool to be on a team like this.\"\nhttps://t.co/V4Ka6cbcB3 23 /// 3 \n\n#LakersMediaDay https://t.co/wWD4eXlGbf McGee on roster additions at center: “My reaction was we got better … it’s amazing how Rob is plugging people into the right spots at the right time.”\nhttps://t.co/V4Ka6cbcB3 LeBron James: “I’m happy to be a Laker.\" Oh, it’s real. #LakersMediaDay https://t.co/72FC2oIAEZ LeBron: “I’m very motivated. But I’m not in talking-about-it mode. I’ve been very quiet this summer for a reason. My mom always told me, ‘Don’t talk about it, be about it.’\"\nhttps://t.co/V4Ka6cbcB3 Season 17 👑\n\n#LakersMediaDay https://t.co/iXPciJQwTu LeBron: “When Rob and everyone upstairs did what they had to do to acquire AD, I was truly excited.”\nhttps://t.co/V4Ka6cbcB3 RT @LakersReporter: Frank Vogel on @KingJames coming into this season with the most rest he’s had since 2005: “That’s good news for us and… Pelinka on @kingjames: \"You can see in his demeanor a seriousness and a focus.\"\nhttps://t.co/V4Ka6cbcB3 Gearing up! #LakersMediaDay https://t.co/Et3P3YwRnW Vogel: \"The shooting improvement, I hope it’s dramatic from where we were last year.\"\nhttps://t.co/V4Ka6cbcB3 Rob Pelinka: “When the starting point of your roster is two of the best players in the universe that’s a great starting point. It puts us in a position to be the last team standing.” https://t.co/V4Ka6cbcB3 Frank Vogel opens Media Day: \"When the belief is strong at the outset, it’s about focusing in on the work, and we’re looking forward to gettting after it.”  https://t.co/V4Ka6cbcB3 Catch every player live from @UCLAHealthTC for the 2019 Media Day Press Conference. #LakersMediaDay https://t.co/V4Ka6cbcB3 RT @kylekuzma: Time to be great #year3 Today’s look from Joe Kelly 🌮 and @Cody_Bellinger 👑 https://t.co/8jFS9eaheR RT @JamesWorthy42: Forget the lists and the predictions and rankings. The only thing that matters is on the court. Let’s go #LakersNation h… It all starts tomorrow. \n\n#LakersMediaDay https://t.co/t3yoz5xmqx Kyle Kuzma has not been cleared for full practice or game participation. \n\nHe is scheduled for an MRI when the team returns from China, and a status update will be given at that time.\n\nhttps://t.co/DCNALkc9tV A career 40% 3-point shooter, Troy Daniels will be called upon to let it fly for the #LakeShow 🎯🎯🎯\n\nhttps://t.co/TGTJ9HAjB6 Join us in wishing a happy birthday to the one and only @JeanieBuss 💜💛 https://t.co/2kHvdxAfux 10 days. Lakers basketball is back. https://t.co/80yLNjqCD1 Squad coming together in Vegas 🏜 #LakeShow https://t.co/xulgq71Edk RT @kaj33: See you all tonite at B&amp;N Fashion Island Newport Beach https://t.co/xgwWWaYxgS 💜📱💛\n\n#WallpaperWednesday /// #LakeShow https://t.co/rtMV5YNrNG Purple and gold, and everything in between 🌈 #LakersPrideNight returns October 16th. https://t.co/IFZssri0Kh 🌴🇬🇷🌴 https://t.co/El3KmShzXg Training camp is back this week ... and so are the expectations.\n\nSenior Writer @KevinDing:\n\nhttps://t.co/NNWvxcSSLp Baby Mamba was a different beast 🐍\n\n@kobebryant /// #NBARookieWeek https://t.co/cCHV3T2kGq From Division III point guard to Kentucky student-manager to NBA head coach — Frank Vogel knows the grind is the key. \n\nhttps://t.co/GB5fd901dZ Let the work do the talking 🤫 \n\n@AntDavis23 /// #LakeShow https://t.co/QmV2nV0N8c RT @LakersReporter: New Story: “Getting to Know Frank Vogel.” I sat down with the new @Lakers coach for an extended Q&amp;A touching on how he… RT @NBADraft: Giannis, JAY Z, Nick Young meme...\n\nListen in to get to know @Thortontucker of the @Lakers to celebrate #NBARookieWeek! #NBAR… Jared Dudley looks to blend veteran presence with his 3&amp;D game.\n\nhttps://t.co/fbomkVx5VL AC⚡️AD #LakeShow https://t.co/nqmz4cjZIx Didn’t find tickets? Not a problem. Browse the official Lakers resale marketplace.\n\nhttps://t.co/vh6TqaLlme https://t.co/h7HTclGsyV Then &amp; Now 🌴 \n\n#WallpaperWednesday /// #NBARookieWeek https://t.co/SUL6jUe332 #LakeShow tickets are available for games through January 5th. Buy now.\n\nhttps://t.co/BhKezoepeG https://t.co/Rm9u4KOR2W Happy birthday to the Zen Master himself, Phil Jackson!\n\n💍💍💍💍💍 https://t.co/zmBdXsr9eG Lakers tickets are on sale tomorrow at noon PT for games through January 5th. Bookmark the page, pick your dates, and enjoy the #LakeShow.\n\nhttps://t.co/i2TnOx7Sfu https://t.co/lJDoHOGmtP Packed house with 12 days until training camp 🙌 #LakeShow https://t.co/ZuAns3IJXk Today was a good day #LakeShow https://t.co/ldddyzZ6QX Quinn Cook joins the Lakers after ranking among the NBA's 97th percentile on spot-up shots last season 🎯🎯🎯\n\nhttps://t.co/wTEklhS3eu RT @JeanieBuss: Happy Birthday Elgin! His skill set would be right at home in today’s NBA. 🗣Message to Hollywood: you should be making his… RT @NBAHistory: \"Modern basketball began with Elgin Baylor...\"\n\nRelive the illustrious career of 11x #NBAAllStar with the @Lakers, Elgin Ba… Enter for your chance to win an autographed Anthony Davis jersey 🖊️ (CA residents only)\n\nDetails: https://t.co/ypmBRTefhq https://t.co/PkJUWBbwBm 🏀⚽️\n\n#LakeShow /// #LAGalaxy https://t.co/tLNNyiPcIs Happy birthday to L.A.’s first hoops superstar, the iconic Elgin Baylor 🌟🎂 https://t.co/hN7RqzHlzo RT @LAGalaxy: some @Lakers out here watching #LAGalaxy get buckets https://t.co/y1NbYNjef0 RT @JaredDudley619: First @LAGalaxy game ⚽️ https://t.co/KYnonCbNOu RT @LA_Sparks: Thank you @Lakers!💜💛\n\n#GoSparks #LeadTheCharge https://t.co/QqArwM2Doh Do it for LA 💜💛 @LA_Sparks \n\n#LakeShow /// #LeadTheCharge https://t.co/w8nAKOQMsl You asked. @LakersReporter answered. https://t.co/deXw6Gp5nY Great energy in the lab today #LakeShow https://t.co/cAJiuKQ8cq Be different 🦈 https://t.co/g5Khtq7mKm .@AmericanExpress Card Members – don’t miss your chance to come see the #LakeShow. Card Members get access to exclusive single game tickets to some of the biggest games this season: https://t.co/lM3oDsdy3O https://t.co/BgG5L3aVI8 .@AmericanExpress Card Members – don’t miss your chance to come see the #LakeShow. Card Members get access to exclusive single game tickets to some of the biggest games this season starting today at 10am PT. #AmexLife: https://t.co/lM3oDsdy3O https://t.co/5jo11tH8Bh RT @LakersCommunity: Rekindling the spirit of unity that lifted our nation on 9/11 by packing meals for those in need. We will never forget… Kuzzzzzz! \n\n#WallpaperWednesday /// #LakeShow https://t.co/9UU2xlvlZh #KuzControl is a way of life. It’s a mindset 🦈\n\n@kylekuzma /// #LakeShow https://t.co/I67ndlnVKE Anthony Davis has made his intentions clear. \n\nhttps://t.co/rmLDSoRX5X AD is on a mission 🙌 #LakeShow https://t.co/s2jIXSzgRh Welcome to the jungle 🦁\n\n@KingJames /// #LakeShow https://t.co/G1Sro6fPAh “This summer I improved the most on my 3-ball. I wanted to be able to stretch the floor. … By me doing that I’ll be able to help the Lakers as much as possible.” - @AntDavis23\n\nhttps://t.co/sKoThaQJvL Cookin’ up 😈 #LakeShow https://t.co/OrQWRSXdFy RT @LAGalaxy: #LakeShow x #LAGalaxy\n\nLakers Night coming Sept. 15: https://t.co/AKQgHkyaV0 https://t.co/ut1Fsfswop #LAGalaxy /// #LakeShow \n\nDetails: https://t.co/RcBqDeVEBf\n\n⚽️🏀 https://t.co/i3cpPInBi9 From Kobe's work with Make-A-Wish to Metta's lessons for the youth.\n\nA personal look at the last 20 years of Lakers Basketball from Senior Writer @KevinDing. \n\nhttps://t.co/nKXJo7MzHC RT @QCook323: Man I get to learn from J. Kidd, Rondo and Bron every single day! A POINT GUARD’S DREAM!! No choice but to get better and lea… RT @LakersReporter: ICYMI, here’s a look at the unconventional path for @ACFresh21 from going undrafted to continuing to work/battle toward… 💪🏀 https://t.co/1zVWFKYOPh \"I'm looking forward to giving 110%.\" \n\n@DwightHoward /// #LakeShow https://t.co/9s7aud247Q You’re welcome 🤝\n\n#WallpaperWednesday https://t.co/3Nix9s922E RT @Thortontucker: All I need was a 70 lol, I’m on 2k🤯 https://t.co/7XhtRzmwgd This is art 💜💛\n\n@RajonRondo /// #LakeShow https://t.co/CQ9UKaPE3e RT @KingJames: 🔥🔥🔥🔥🔥🔥🔥🔥🔥😤😤😤 @ACFresh21 💪🏾 https://t.co/SOKNo5kflS The Alex Caruso mix that you wanted 🙏\n\n@ACFresh21 /// #LakeShow https://t.co/z6XhJJPBuA LeBron James is that dude 👑\n\n@KingJames /// #BestOfNBA https://t.co/reWl2E5y3M Hussle &amp; Motivate 🏁 @CaldwellPope https://t.co/gCZbSuG5gI Coach Phil Handy’s MasterClass 📚 #LakeShow https://t.co/95rlZSbnlH Perfect day to get better 😈\n\n@ACFresh21 /// @troydaniels https://t.co/blvCYxOQs0 Enter for your chance to win an autographed Anthony Davis jersey 🖊️ (CA residents only)\n\nhttps://t.co/ypmBRTefhq https://t.co/HG65V4ZFuh Royalty 👑\n\n#WallpaperWednesday https://t.co/4gFcnG9eCP Beijing ✈️ Taipei! #LakeShow https://t.co/BMC2RhfeGR 🌴🌴 https://t.co/WaVEKXS1FO In the lab 🌴 @troydaniels https://t.co/lWSD05X52m OFFICIAL: Lakers sign Dwight Howard\n\nhttps://t.co/HV20wG4pWr https://t.co/SY2RJu6aqC Young Kobe dominates OT in his first Finals #MambaMarathon\n\n📺: @NBATV https://t.co/juuQuM8aPJ #MambaMarathon: The greatest last game ever \n\n📺: @NBATV https://t.co/1tILqAnPgS You know you're a legend when you have an iconic moment against every other team in the league. \n\n🐍: https://t.co/GEHUpFbSxv https://t.co/OBQLHyhJ8Z What does Mamba Mentality mean to you? https://t.co/9oHULsa0lr That time Kobe balled in one glove after breaking his hand. https://t.co/wEeAKL9sPd Whether it was 8 or 10 or 24, nobody rocked a uniform like the Mamba. \n\n🎽: https://t.co/kDX9XHqxmF https://t.co/QTHHItcSuP That time Kobe went over the backboard. https://t.co/kvCiHBno3N That time Kobe pulled off this filthy dribble into a clutch fadeaway at the All-Star Game. https://t.co/U6u559Kt4W That time Kobe dropped a dime off his opponent's back. https://t.co/0pVGRUiqYr @NBATV 💍💍💍💍\n\nhttps://t.co/pEt3brtxmc That time Kobe talked his talk and backed it up with clutch free throws. https://t.co/uT4TSKvcXs More #MambaMarathon with a clutch OT performance in the 09 Finals ⚫️🐍\n\n📺: @NBATV https://t.co/osr1EAQeAa That time Kobe couldn't play, so the Big Fella represented. https://t.co/4LPEEVD97C @NBATV “You’re sitting and watching, and it’s like a miracle unfolding in front of your eyes and you can’t accept it. \n\n\"Somehow, the brain won’t work.” - Dr. Buss\n\nhttps://t.co/BfVTzPJfBl Legacy #MambaDay https://t.co/vcYFXi3GU5 That time Kobe turned a monster screen into a buzzer-beating trey. https://t.co/cm0hAAc1zs That time Kobe proved you can't box out the Mamba Mentality. https://t.co/1dkQyYwVTr 8️⃣1️⃣ #MambaMarathon \n\n📺: @NBATV https://t.co/vnO8UuAJQW That time Kobe reinvented playmaking with this insanity. https://t.co/h78CgIGaLc That time Kobe hit the game-winner in a battle of USA's best. https://t.co/l6m6Nzuy21 Vino Vibes #MambaDay https://t.co/t5VWVG5UUl Wallpapers for #MambaDay 🐍 https://t.co/flSdUDJDzf That time Kobe played with a torn rotator cuff ... and got buckets left-handed. https://t.co/j1b4szxQYS That time Kobe scored against all five Kings on one possession. https://t.co/xk9qp2wPFK That time Kobe: A thread https://t.co/3LqPlFCRLi @NBATV “I was prepared to do whatever. I was going to run and push myself to exhaustion. It doesn’t matter.\n\n\"Every rebound. Every loose ball. I think my teammates understood that. To us, it was a life-or-death situation. We just weren’t going to lose.”\n\nhttps://t.co/1StR6tlKq5 #MambaMarathon continues with a sizzling Kobe dropping 48 points to sweep the Kings ♨️♨️♨️\n\n📺: @NBATV https://t.co/MWlzThtrMI @NBATV “My father taught me when I was growing up don’t back down from any man. ... Whenever I have the chance to guard Michael Jordan, I want to guard him. I want him. The ultimate challenge.” - @kobebryant\n\nhttps://t.co/okAfdZiveQ @NBATV The 1997 Dunk Contest was the first of many iconic moments for an 18-year-old who would become one of the all-time greats.\n\nhttps://t.co/VvzapEKRbo Next up on the #MambaMarathon: A duel between two of the GOATs 🐐🐐\n\n📺: @NBATV https://t.co/6yaHyJ90R1 Tipping off the #MambaMarathon with a Rookie Kobe winning the Slam Dunk Contest 🐍🛫\n\n📺: @NBATV https://t.co/Z0V2AKpBB8 RT @kobebryant: Thank you everyone for the birthday wishes 🙏🏾 #41 #vino There's only one way to spend 8/24: A Mamba Marathon on @NBATV\n\nhttps://t.co/uuucWRK5oh Kyle Kuzma showed off his shooting stroke in Australia, sinking 4-of-5 from deep for Team USA. \n\nhttps://t.co/pIGsMyAPwj Kareem. Shaq. Wilt. Pau. It’s only right we celebrate #NBABlockWeek with legendary Laker big men. https://t.co/UqH9bkTRuZ RT @KingJames: Happy Born Day @kobebryant aka Black 🐍!!!! #Legend #Icon #Goat Laker Nation Stand Up 🙌🏾 RT @paugasol: Happy birthday, GOAT!!!!! 🐐 @KobeBryant https://t.co/NuHdapgm7P RT @JeanieBuss: Happy Birthday @kobebryant !!! Celebrate your day today but tomorrow all @Lakers fans will celebrate KOBE DAY 8/24 - an off… International Kuz #LakeShow https://t.co/UhZLvk0xgG Laker personified. Global icon. Happy birthday, Kobe. https://t.co/bNmtZ3rTKO RT @LakersReporter: New story - Hitting 4 of 5 3’s for Team USA in an exhibition vs. Australia in Melbourne, @kylekuzma continues to impres… Let the show begin 🎬 https://t.co/ZdrDl1lQwx Laker Nation, you ready? https://t.co/uF0vZTnQih We workin’ 🤫 @ACFresh21 https://t.co/nTtSOnh1Zk RT @LakersReporter: Kuzma drilled 4 of 5 3’s towards all 12 of his points in the 102-86 exhibition W for 🇺🇸 over 🇦🇺. Yet another nice sign… We see you with that form, @kylekuzma 👀 https://t.co/NmDmnbG5lu RT @NBA: ✌🏽 @kylekuzma \n\n🏀: 🇺🇸v🇦🇺\n⏰: 5:30am/et Thursday\n📺: @NBATV \n💻: https://t.co/HbtDcrWR7x https://t.co/S3BGEt3iRX Never another like Wilt the Stilt.\n\nHappy birthday to one of the greatest to wear the purple and gold. https://t.co/jeNRC0VKPP AD took over Dodger Stadium for Lakers Night 💜💛💙 https://t.co/6SlXfqtqjZ New kid on the block 💛💜 https://t.co/RhtyM6tF92 You love to see it 🤩 @AntDavis23 https://t.co/Yb6tIjv3WG AD made the first pitch look effortless 😎 #LakeShow https://t.co/bPgy90y6Es Full-time Laker, part-time Dodger 🏀⚾️ https://t.co/LKDo1aYGJV Vibes from Australia 🇦🇺 #KuzControl https://t.co/NctZ0Sl9rp Next stop: 🇦🇺\n\n(🎥: @NBA)\n\nhttps://t.co/UeIVjOD0CY RT @NBA: Jayson Tatum threads the needle to Kyle Kuzma! #USABMNT #USAGotGame https://t.co/dROBWSdcPR Legends just do it differently.\n\nAnybody can pass to a teammate. The Mamba and the King can dime up themselves. #NBAAssistsWeek https://t.co/AURFYaQBU4 Kuz on the floor. Snoop on the mic. USA across the chest. \n\n🔊 “Do It When I'm In It” by @SnoopDogg https://t.co/bqzxwwWZ6v Locked in 😤 #LakeShow https://t.co/r5nYbhTrgS The @Dodgers take on the Blue Jays on August 20 for our annual Lakers Night at Dodger Stadium ⚾️🏀\n\nTickets: https://t.co/03xtMdUP9m https://t.co/8ZkYWwdjB8 RT @JaredDudley619: 🙏🏽 for my guy @boogiecousins!!! This man was working is butt off ... Keep your head up my G! Lakers center DeMarcus Cousins has suffered a torn ACL in his left knee. \n\nhttps://t.co/eOO3SPo4US RT @LakersReporter: Lakers center DeMarcus Cousins suffered a torn ACL in his left knee, which was confirmed by his agent, Jeff Schwartz, o… 🎥 @kylekuzma talks about absorbing knowledge from all the basketball minds around USA camp. https://t.co/23AtNPrqZS Legends never die. Happy Hussleday, Ermias 🏁 https://t.co/mpCotfFSfQ Earvin. Buck. Magic. \n\nHappy 60th to the man known by many names, including Greatest Point Guard Ever. https://t.co/l9zkgx9EVE The kid from Flint reppin’ 🇺🇸 #LakeShow https://t.co/TGXEh9sYxT RT @LakersReporter: A 🇺🇸 🏀 summary for @kylekuzma: https://t.co/ks1RoqFQiM “This is 10 times better than playing pick up games”\n\n@kylekuzma on his summer with USA Basketball https://t.co/r8aDsEfKr5 RT @LakersReporter: Kuz said it’s more taxing on your body to be playing with Team USA than just doing regular offseason prep, but it’s als… Lakers Nation, @kylekuzma wants you in the house for 🇺🇸🆚🇪🇸 in Anaheim this Friday! https://t.co/zYt93Cb6Zl 〰️\n📱 \n\n#WallpaperWednesday https://t.co/wylihD10zz RT @JeanieBuss: 💜💛Happy Birthday Magic💜💛 https://t.co/XLEaxdiNdu RT @KevinDing: Some people say they want to accomplish a lot in life; some even dare to say it openly and earnestly. Many others never say… 60 Years of Magic\n\nHappy birthday to the legendary @MagicJohnson! https://t.co/GEJnSdbO6k “I just want to be a great player. I don’t like to sit out. I like to play basketball. It’s my life.\"\n\nSenior Writer @KevinDing on Kuz's decision to compete with USA Basketball. \n\nhttps://t.co/e6LkzokfPj “It’s unreal. It’s a great experience for me, especially where I come from and my journey as a basketball player.”\n\n@kylekuzma on representing for USA Basketball 🇺🇸🏀 https://t.co/CCx2ZnBTie Same court, different colors 🇺🇸 https://t.co/Nd3HxqPD5I RT @KingJames: You ALREADY Know!! 🗣🗣🗣 https://t.co/juBIO334xK RT @LakersReporter: Kuz on 🇺🇸 🏀: “Everything is going great. Been a great camp so far. Learning, getting better every single day, (gaining)… RT @LakersReporter: Team USA is practicing at the Lakers facility tonight and the next two days, w/@kylekuzma representing. https://t.co/Yp… OFFICIAL: @D_Jay11 has signed with the #LakeShow\n\nhttps://t.co/iQHd0x6dk0 CHOSEN ONE 👑 https://t.co/ufxhOEYdIL 📈 Marquee matchups\n📉 Back-to-backs \n\n@LakersReporter breaks down the ins and outs of the 2019-20 #LakeShow schedule. \n\nhttps://t.co/HVs2l1v9qw B O O G I E\nI\nR\nT\nH\nD\nA\nY\n\nHappy 29th, @boogiecousins! https://t.co/lxTkaVJv1c 2020 #LakeShow: Coming soon to your city.\n\n🖨: https://t.co/bRyx3PH9Vt https://t.co/LPu3xVZiHH RT @JamesWorthy42: Basketball’s greatest rivalry takes center stage on MLK Day! Beat those Celtics! https://t.co/NKzCaE6maD More than half of the Lakers' 2019-20 season will be broadcasted to a national audience.\n\nhttps://t.co/P03UtUudiF RT @JaredDudley619: 🙏🏽🙏🏽🙏🏽 ticket giveaway on deck https://t.co/L972YuQXry RT @LakersReporter: Here’s my complete 2019-20 @Lakers schedule breakdown: https://t.co/sWBaWY8kBd As soon as that schedule drops, you know @DGreen_14 is ready for it. And he’s not the only one...\n\nSchedule presented by @Delta https://t.co/LgOlkB8soO #LakeShow vs. Everybody https://t.co/K8neuLdkUg RT @DGreen_14: Stoked for year one in purple and gold! Let’s gooo, Lakers Nation! #LakeShow https://t.co/ovyaSTWjU3 RT @SnoopDogg: #LakeShow till I die! Home opener October 25th vs the Jazz 🔥🔥🔥 https://t.co/w5IPUFFo1T RT @LakersReporter: Anthony Davis heads back to New Orleans for the first time as a Laker on Nov. 27. RT @kylekuzma: We’re taking on the Clips at home, nothing like playing on #NBAXmas! #LakeShow https://t.co/pnOokmYxcs RT @JaredDudley619: Can’t wait for the #LakeShow to begin on October 22! https://t.co/ZbntgmHWyC RT @JaValeMcGee: This seasons going to be crazy. Back in the Bay to take on #DubNation February 8th. https://t.co/gOMyusdkWH 82 games. 29 arenas.\n\nGet ready for the 2019-20 #LakeShow tour, presented by @Delta\n\nhttps://t.co/IAWniJukpk That purple and gold just hit different! #NBARooks https://t.co/UhtjICzdag Do it for LA 💛💜\n\nCongrats to the West on winning the U.S. Boys Championship! They will play Team Africa in the #JrNBAGlobalChampionship today at 1:30PM PT on FOX. \n\nhttps://t.co/aaMydNIYpy Put the whole country in #KuzControl with this Team USA throwdown 🇺🇸🔨 https://t.co/3uIH6F5KA6 Kyle Kuzma is one of 17 finalists for the 12-man roster. \n\nTeam USA continues training at @UCLAHealthTC on Tuesday. https://t.co/oGJRxdrKv8 RT @NBA: Kyle Kuzma x #PhantomCam \n\n#USABMNT\n#USAGotGame\n#FIBAWC https://t.co/umFHjvuqDM Kuz takes flight for Team USA 🦅🦅🦅\n\n(🎥: @NBA) https://t.co/3S4OVPEuRR RT @Lakers: Catch Kuz in action tonight for Team USA 🇺🇸 \n\nTime: 7PM PDT | Watch: @NBATV \n\nhttps://t.co/koDnayxZE0 Catch Kuz in action tonight for Team USA 🇺🇸 \n\nTime: 7PM PDT | Watch: @NBATV \n\nhttps://t.co/koDnayxZE0 Off the wall into the windmill dunk... We see you, @kylekuzma👌 (via @NBA) https://t.co/jM85oQ1ANN Our guy @CaldwellPope with the future generation of hoopers at @Nike HQ in China. #LakeShow https://t.co/OPuhXicApW Happy Birthday, Bill Bertka 🐐🎉 https://t.co/aqm8rkX619 RT @Dodgers: California Love. \n\n@Lakers, we’re ready for Lakers Night. But first, @kenleyjansen74 has a message for @AntDavis23. https://t.… @AntDavis23 @kenleyjansen74 @Dodgers No days off, right? See you August 20 for Lakers Night! RT @kylekuzma: Nina!!!!! 🙏🏽 https://t.co/fl6kRcjUyn Good vibes in LA 🙌 https://t.co/JysSKmMn44 First bucket as a Laker for @DGreen_14 💛💜 https://t.co/PIYgEl93KW OFFICIAL: The Lakers have promoted Nina Hsieh to Head Athletic Trainer.\n\nhttps://t.co/ltmfpgoEHH 🇺🇸KUZ🇺🇸 https://t.co/OIxNx73T8H Red, White &amp; Kuz 🇺🇸 https://t.co/yGTpwcTwYY RT @usabasketball: 🗣️ \"... I like to play basketball. It’s my life. So, for me to have the opportunity to play for USA Basketball &amp; have a… RT @NBA: 🇺🇸 @kylekuzma wraps up Day 1 from Las Vegas! #USABMNT https://t.co/aONjU2PFpD 🇺🇸 @kylekuzma already getting buckets on day one of Team USA training camp!\n\n(🎥: @NBA)\n\nhttps://t.co/oTPZfr6CZ0 #ThisIsWhyWePlay https://t.co/bWhA3zD9mT Oh, you thought #NBAHandlesWeek was just for the guards? \n\nCan't leave out the game's best ball-handling big. https://t.co/idza8VIOuu “You circle each game and look at the players (you’re facing) and you take that challenge every single night to go out there and try to shut those guys down.\"\n\nhttps://t.co/82FpOvEhVd RT @RomeluLukaku9: I’m available to catch these passes from @KingJames on the fast break since they think i’m slow out here🗣😂😂 https://t.co… Deal Done? Lukaku to #LakeShow confirmed? ⚽️➡🏀 https://t.co/TYICEcOa6c Repping LA on the hardwood, the diamond and the sticks. \n🏀✖️⚾️✖️🕹 https://t.co/jCENzzZUaU RT @kylekuzma: 🐐🐐🐐 https://t.co/05lbH9AKv0 RT @KingJames: Alright alright. Enough is enough. The throne has been played with to much and I ain’t for horseplay. Ether coming soon! 😁🔥🔥… RT @kylekuzma: Keep your confidence @ at 10 today then repeat. Anthony Davis Live! https://t.co/REk4JLCULr RT @LakersReporter: Other new additions: Greg St. Jean as player development coach/advance scout; Dru Anthrop as head video coordinator/pla… OFFICIAL: Jason Kidd, Lionel Hollins, Phil Handy, Miles Simon, Mike Penberthy and Quinton Crawford have been named assistant coaches for the upcoming season.\n\nhttps://t.co/LSl8fRZq5K RT @UCLAHealth: The results are in! @usnews has ranked UCLA Health #1 in Los Angeles, #1 in California, &amp; #6 in the nation. Thank U to our… RT @KingJames: You already know what today is..... Yup you guessed it. 🌮 TUEEEEESSSSSSSSSSSSSDAY🤪😆😁😂🤣😋 By coming to the Lakers in 2018, LeBron James opened the Lakers' possibilities for this coming season, writes @KevinDing:\n\nhttps://t.co/MzcbuVkDPf RT @KingJames: Wishing all my @IPROMISESchool students, staff, and parents the most unbelievable 1st day of school tomorrow‼️🙏🏾 We set out… No shortage of highlights from some of our recent signees! \n\nCheck out the top plays of #LakersSummer presented by @budweiserusa. https://t.co/nsJfXcGqEf RT @boogiecousins: .44 and .15 https://t.co/vhw18XhsLy Armed with length and athleticism, Kostas Antetokounmpo looks to make a splash as the Lakers' new two-way big man. \n\nhttps://t.co/KaSJNxVBmz RT @JeanieBuss: We enjoyed hosting our @USC_FB friends ❤️💛💜 https://t.co/7XnS6fRxNo 🗣🗣 🗣 @JaredDudley619 https://t.co/RBWW99zqJ3 RT @USC_FB: Thank you to @JeanieBuss, Kurt Rambis, and the rest of the @Lakers organization for having us and providing professional insigh… Jared Dudley shares his thoughts on his joining the Lakers, his new teammates and what he's bringing to the squad. \n\nhttps://t.co/IUh3AYS6tt RT @LakersReporter: New story looking at the value of @JaredDudley619, both on and off the court, using his words from an introductory conf… RT @JaredDudley619: 🙏🏽🙏🏽🙏🏽 https://t.co/n6urXDM0UF Happy 24th to the kid from Flint! #MambaYear https://t.co/UVfOvAUGSK RT @DerwinJames: Lakeshow 🖤 https://t.co/VpxxBPOueP #JamesGang taking on a new meaning today 👑⚡️\n\nThanks for stopping by, @DerwinJames! https://t.co/Xn1arntGZL Attack the offseason 😤 https://t.co/ivH9quzob0 RT @Chargers: JAMES ❌ JAMES 💯\n\n#BoltUp | #LakeShow https://t.co/0F5CFYtyHE Lakers Youth Foundation and Project Destined teamed up with franchise legends Robert Horry, Metta World Peace and A.C. Green. \n\nLocal youth learned from these iconic Lakers about the strength and endurance needed both on the court and in the boardroom. https://t.co/vPYD8Risld RT @kylekuzma: This was so cold in the game lol @KingJames https://t.co/z4jCjyXqu5 From Athens to L.A. The journey continues for @Kostas_ante13.\n\nWelcome to the #LakeShow, Kostas! \n\nhttps://t.co/16MRALTCJk Can your camp counselor hit half-court shots like @kylekuzma?\n\nOnly at Camp Lakers presented by @UCLAHealth. #TeamUCLALakers https://t.co/8M9RHXqw11 @SouthBayLakers 😎 #LakersSummer ➡️ #LakeShow 📝\n\nCongrats, Jordan Caroline!\n\nhttps://t.co/39ZjEg53uP Best of luck to the @LAGalaxy in their match tonight! https://t.co/hK9NPpVPWw @troydaniels @JaredDudley619 @QCook323 “I’m here now and I’m ready to work, so let’s get started.” - @boogiecousins https://t.co/u4cWqnFx7Q @troydaniels @JaredDudley619 “I’m excited to compete at a high level and put on a show for you fans.” - @QCook323 https://t.co/pf4bUtIY6w RT @kaj33: Hello Vikas - it was my pleasure working with you &amp; I hope to do it again. I look forward to reading comments on your site. http… RT @JaredDudley619: I been giving away tickets for 12 season and haven’t had any problems.... My followers has tell you first hand.. no pla… @troydaniels \"I wanna thank you guys for welcoming me to Lakers Nation.\"  - @JaredDudley619 https://t.co/LUavAghUST Welcoming AD to the #LakeShow family in our @budweiserusa Moment of the Week! https://t.co/8jcTHmKnQC \"When I got the call, there was one goal in mind, and that's to win a championship.\" - @troydaniels https://t.co/aOXoLSNzHn \"I'm gonna bring my all each and every night, and I hope you guys appreciate it.\" - Avery Bradley https://t.co/R7go7AwOkh \"He can shoot it, he can stretch the floor, he can put it down, he can finish, he’s got some post moves. \n\n\"So I’m very excited about playing alongside him.” - @AntDavis23 on @kylekuzma\n\nhttps://t.co/gwvXdyciRc “I’m really excited about the roster we have this year, and hopefully we can make you guys proud.” - @DGreen_14 https://t.co/saXUWYgxou RT @troydaniels: Take advantage of every opportunity in life.. Because you never know when it will present itself again.. Remember there is… RT @ACFresh21: 👀👀🔥 https://t.co/QhSZdXvuCa RT @JaredDudley619: 🔥🔥🔥🔥🔥 https://t.co/8iet7KgtXK Oh, we got a squad. #LakeShow https://t.co/rkC6untEIk The man's on the cover of the game ... 💯 https://t.co/z7OMkttCnz 👀👀 https://t.co/TF7wbXePNN RT @troydaniels: Listen man it’s my Birthday!! Thank you lord for waking me up on my bday.. I’m blessed 🙌🏾 #28 https://t.co/oQ4WRQ0wC4 🤣🤣🤣 @troydaniels spending his B-Day with his first visit to Lakers HQ. https://t.co/Y3aUPRtFw1 RT @QCook323: Man @JaredDudley619 the realest!! Appreciate you big homie! This is going to be a fun year! #Lakeshow. RiP DAD! HBD to one of the newest #LakeShow members, @troydaniels! https://t.co/RkmbqCBOoF RT @LakersReporter: Troy Daniels on the Lakers roster: \"I think we have an unbelievable group with this team this year. They built this tea… RT @LakersReporter: Troy Daniels on playing w/LeBron + AD: “I think it makes it a lot easier for me as well as them. They have somebody to… Eyes on the prize 💍👀 https://t.co/PBVGerSMec “I like every player that we have from 1 through 14. I’m excited about it. \n\n\"I’ll put our roster up against anybody. I feel that in a seven-game series that we would come out victorious.”\n\nhttps://t.co/PZZ5ukmKzh “He thought he wasn’t gonna be in it!”\n\n@AntDavis23 and @KingJames messing around on LakersSnaps 😂😂 https://t.co/X5RwBMqZDp Day one of many. Let the AD Era begin. https://t.co/6ZquMO8y8V “There is nothing he can’t do.” https://t.co/jArk3wRF7h All eyes on these two 👀👀 https://t.co/vNvF0XzJdQ Watch out, league. He’s here. https://t.co/0BUDIFYgEf RT @LakersReporter: I asked Anthony Davis about playing the 4 vs. the 5 given how the game has evolved in recent years. Here’s an article b… OFFICIAL: The Lakers have signed rookie Talen Horton-Tucker. \n\nhttps://t.co/hCyD9QFDIJ \"Love you guys, can't wait to get started. See you at STAPLES.\" https://t.co/MJaaG2KBsu Center Stage https://t.co/3bYvaiyDrZ It's real. \nIt's really real. \n#AD3 https://t.co/bDniuIjptR RT @LakersReporter: Asked Anthony Davis about how the game has evolved w/teams going small, and he was very clear that he prefers to play t… \"I loved playing with @boogiecousins. Obviously we didn't want it to end. ... Now we have the opportunity to reunite in a great situation.\" - @AntDavis23\n\nhttps://t.co/ggEbcLQmpt RT @LakersReporter: After Anthony Davis praised Kyle Kuzma (when asked about Kuz staying in L.A. through the trade), Frank Vogel added that… RT @LakersReporter: Coach Frank Vogel on having LeBron and AD: \"Both are guys that are going to command double teams in any action that you… \"My goal is to bring a championship here with the team that we have.\" - @AntDavis23\n\nhttps://t.co/ggEbcLQmpt \"I like our roster. I like every player that we have. ... I'll put our roster up against anybody.\" - @AntDavis23\n\nhttps://t.co/ggEbcLQmpt RT @LakersReporter: Rob Pelinka: \"Today is a history-shifting day for the Los Angeles Lakers.” While introducing Anthony Davis alongside Fr… RT @JeanieBuss: If you want to watch @lakers press conference now go to @SpectrumSN #AnthonyDavis https://t.co/FAGk77oGQw RT @LakersReporter: You can watch the live Anthony Davis press conference that’s about to start on @SpectrumSN ... and @NBATV will simulcas… \"Today is really a history-shifting day for the Los Angeles Lakers.\" - Rob Pelinka\n\nhttps://t.co/ggEbcLQmpt Join us in welcoming @AntDavis23 to the #LakeShow! https://t.co/ggEbcLQmpt Built for the Brow. #AD3 https://t.co/fZmt5zOVhW TFW you come back from a 25-point deficit in your #LakersSummer finale. How you feeling, Jordan Caroline?! https://t.co/RbiQxxVm2b Avery already repping for the home team ⚾️ https://t.co/Z1kGue6Jvq RT @LakersReporter: Bill Bertka has a strong emoji game at age 91. He was quite pleased with the second half effort in a postgame text: “Gr… Closing out #LakersSummer with a 25-point comeback! 💪💪💪 https://t.co/np8ENCV0y1 RT @LakersReporter: Halftime score: 57-33, Warriors. Current score: 72-69, Lakers, after an 8-0 run to start the 4th Q. OK Jaron Johnson, get fancy with it! 🍇🍇🍇 https://t.co/WgEoS3Ncrl One half left in Las Vegas.\n\nCaroline: 9 pts\nJohnson: 7 pts\nMiller-McIntyre: 4 pts, 4 ast, 3 reb https://t.co/Xde20VUAjI RT @SouthBayLakers: Sibling rivalry. #LakersSummer\n\nDavid Wear x Travis Wear. https://t.co/ID7gBRjxgH All set for the final run of the summer. ☀️☀️☀️ https://t.co/WtlSErWQ0G RT @SouthBayLakers: Wrapping up @NBASummerLeague with an afternoon tipoff on @NBATV.\n\nDavid Wear and #LakersSummer face his twin brother Tr… Welcome to your new home, @QCook323 🏡 https://t.co/gQQwCeZdeQ Quinn 🆚 Kuz\n\n@QCook323 already putting in work on his first day in LA. https://t.co/UlTH4dpHpK He’s got two. We’ve got 16. Let’s work on another. https://t.co/OByS7xtRUr RT @LakersReporter: Green on LeBron + AD: “Gives you nothing but the ultimate confidence and belief in yourself and your team. (Know) you’l… RT @LakersReporter: Danny Green on conference call right now on his decision to join the Lakers: “It wasn’t very hard. You’ve got LeBron an… Life is amazing, it is what it should be. https://t.co/vLc3fUkLOq No better gift than a spot on the #LakeShow. Happy birthday, @AricHolman! https://t.co/MdDibOLwo1 Elite scorer. Elite rebounder. Elite defender.\n\n@AntDavis23 does it all. \n\nhttps://t.co/maCRxpweAU RT @SpectrumSN: .@geeter3 caught up with @boogiecousins to discuss his relationship with @RajonRondo and what we can expect to see from him… 👋 Welcome to the Show, @DGreen_14! https://t.co/YcipNMtaPK RT @LakersReporter: LAL fall to 0-4 in Vegas after the 2-1 start in Sacramento, losing 117-96 to NYK. Cacok led the way with 14 points and… https://t.co/LCLjMbj2F3 91-year-old coaching legend Bill Bertka reflects on winning the Assistant Coach Lifetime Impact Award, and his 45 seasons with the Lakers. https://t.co/eYiKyZ9ge6 💜 &amp; 💛 &amp; 💚 https://t.co/sCwnWib2tL RT @LakersReporter: Here’s Bill Bertka alongside some of his former co-workers, with whom he won many 🏆’s, after receiving the 2019 Tex Win… Halftime in Nevada. https://t.co/dO0Ucu32NG There's a bull ready to run 😤\n\n@Nick_P34 x #LakersSummer https://t.co/w3fijv5JJc RT @SouthBayLakers: Primetime in the Summertime 😎\n\n#LakersSummer meets RJ Barrett and the Knicks tonight from Las Vegas.\n\n📺: ESPN 2\n» https… RT @JaredDudley619: The best birthday present ever! #lakers https://t.co/Pi8t8JSZJc “We had a couple fan reactions that were crazy. One kid almost jumped out of his jersey.”\n\n@kylekuzma surprises his fans, learns his Chinese nickname and more during his offseason visit to Shanghai 🇨🇳 https://t.co/hN7vAa6Unv Happy 34th to @JaredDudley619, celebrating his birthday as a new member of the #LakeShow! https://t.co/foOyxydPe3 RT @LakersReporter: Here’s a feature I wrote a few years ago on the 🐐, Bill Bertka, about his incredible basketball journey: https://t.co/S… Recognition for the legend. \n\nNobody more deserving of the Tex Winter Assistant Coach Lifetime Impact Award than the 🐐, Bill Bertka.\n\nhttps://t.co/oshMflHjdZ RT @kylekuzma: The man!!!!!🙏🏽 https://t.co/SXtv9RuoXo Anthony Davis is ready for it all. Every definition of greatness. Every mark he can make.\n\nSenior Writer @KevinDing on the mind set of the Lakers' new superstar.\n\nhttps://t.co/Sed4oXjdKN Bigger than basketball. Congrats, @KingJames! https://t.co/Xwo9hiXJiN OFFICIAL: The Lakers have signed Devontae Cacok and Aric Holman. https://t.co/fkaiZEgOzm #LakersSummer ➡️ #LakeShow 📝\n\nCongrats, @AricHolman! https://t.co/1soxczr8dW #LakersSummer ➡️ #LakeShow 📝\n\nCongrats, @Vontae__15! https://t.co/JA1SVrGoUo New cast members joining the #LakeShow. Coming Fall 2019. https://t.co/TmlENGSG7o 🎥 Miles Simon talks about the progress made by the team and coaching staff in tonights Summer League matchup against the Warriors. https://t.co/aUTW2HvKCa 🎥 Jordan Caroline gives his thoughts about his game-high 27 point effort against the Warriors. https://t.co/0dMEooGvPI Fellas stuffed the stat sheet in a tough battle. \n\nJordan Caroline: 27 pts\n@Vontae__15: 10 pts, 10 reb\n@CMMPatience: 7 pts, 10 reb, 10 ast https://t.co/NHlHTTgoAt 📍 Quinn City https://t.co/9BqzKOybjs One more half of late night hoops coming right up. https://t.co/NE5qZsDKiF Codi Miller-McIntyre shakes his way in to an and-1 for #LakersSummer\n\n#LakeShow (📺: NBA TV) https://t.co/4FpEC6zwnX 👊 @CaldwellPope out here showing his #LakersSummer support! https://t.co/ZKfGk8Vv4a Game 3 from Las Vegas coming right up. https://t.co/1LEk0VlTqz OFFICIAL: Rajon Rondo is returning to the #LakeShow\nhttps://t.co/cPGrps7LMb Rondo Returns.\n\nOFFICIAL: @RajonRondo has re-signed with the #LakeShow! https://t.co/wC5l2Gsk3A Morning prep for the night cap.\n\n#LakersSummer 🆚 Warriors\n📺: NBA TV at 8:30 PT https://t.co/5l1lNPIRdZ OFFICIAL: Alex Caruso has re-signed with the #LakeShow\n\nhttps://t.co/4kbVBGrCYP Call it a Refresh. \n\nOFFICIAL: @ACFresh21 is returning to the #LakeShow! https://t.co/meuH7OK6OA @troydaniels 🏁🏁🏁\n#LakeShow RT @kylekuzma: Welcome dudz @JaredDudley619 https://t.co/nJUkpq4Xlu RT @LakersReporter: New Article: “Top NBA Duos, 1980-2019.” Since LeBron and Davis both made All-NBA 1st Team in 2017-18, I looked at the n… 🤫🤫🤫 https://t.co/0FlQwllDbY 👑: \"I'm going with Anthony Davis.\"\n❓: \"You sure you want him to be your teammate?\"\n👑: \"I'm very sure of that.\"\n\nNow it's more than just an exhibition. @KingJames and @AntDavis23 are teaming up for real 🌟🌟 https://t.co/BnoZsud82W RT @kylekuzma: DG! @DGreen_14 🎥🍿 👑 x 〰️ https://t.co/NEb2OPIse1 Get ready, Lakers Nation. You haven't seen anything like him. https://t.co/oTrfJOTsT4 \"Anthony represents everything we stand for, with his unwavering commitment to excellence as both a person and athlete. This is a historic moment for the Lakers franchise, and we couldn't be more proud to have him.\" - Rob Pelinka\n\nhttps://t.co/1VtzApnLNW The resume speaks for itself. \nWelcome to Los Angeles, @AntDavis23! https://t.co/uXJJwdGvOq OFFICIAL: Kentavious Caldwell-Pope and JaVale McGee have re-signed with the #LakeShow \n\nhttps://t.co/Hodz6O4VwG The big fella's back for another one! \n\nOFFICIAL: @JaValeMcGee is returning to the #LakeShow! https://t.co/7kFoR8JTfk Year 3 for KCP. \n\nOFFICIAL: @CaldwellPope is returning to the #LakeShow! https://t.co/pZOXl0DNPc RT @LakersReporter: The Lakers, riding their bench, fully erased the once 22-point deficit to tie the game at 63. They’ve outscored the Cli… RT @LakersReporter: LAL have the once 22-point deficit down to 5 early in the 3rd Q despite shooting 34%. Halftime at T&amp;M. https://t.co/HMlomZCv9M Your daily Devontae Cacok dunk highlight.\n\n#LakeShow (📺: ESPNU) https://t.co/6FX9FFPLgj The '17 Summer Championship MVP back where it all started. #KuzControl https://t.co/6GZDC2C598 LA vs. LA in LV\n\nTip-off now on ESPNU! https://t.co/M90SZsiYM4 RT @LakersReporter: Starters tonight: Young, Mathias, Johnson, Caroline and Perkins. Meanwhile, Zach Norvell is out with a SI joint contusi… RT @SouthBayLakers: Summer #LakeShow in the 🏠 https://t.co/gCdyWjpxSe RT @SouthBayLakers: Battling a familiar foe tonight in Sin City at @NBASummerLeague. \n\n📺: ESPN\n» https://t.co/7TCfYNRUvn https://t.co/4hqKH… 🎥 Devontae Cacok talks about what he wants to bring to the summer squad, and who's stepping up as a leader. https://t.co/3SypD8KWfu 🎥 Lakers Summer League head coach Miles Simon gives his thoughts about game one of @NBASummerLeague. #LakersSummer https://t.co/lZTKBAoce1 🎥 Zach Norvell lead the Lakers in scoring in their Vegas Summer League opener vs Chicago. https://t.co/ubtAbpcCpK Back at it again tomorrow night. https://t.co/nChJVEBxKJ Devontae Cacok doing what he does best\n\n#LakeShow (📺: ESPN) https://t.co/KyywiknrdF 🔥🔥🔥 Regal heat #LakersSneakerCam https://t.co/fvYG71QsGx RT @LakersReporter: LAL closed to within 7 points after 3 Q’s, at 70-63, after trailing by as many as 19 in the 1st half. They were a comeb… Halftime here in Vegas. https://t.co/MDMcLBTxmY Royal Arrival #LakersSummer https://t.co/IpGzCiinzE Step-back trey and a four-point play in the first five minutes. \n@DMathias31 with the early🔥✋ https://t.co/Qikv9KGzKl 👑 The King is in the building #LakersSummer https://t.co/nruotqMoi7 RT @LakersReporter: Lakers starters for the Vegas Summer League debut coming up shortly: Young, Mathias, Norvell, Holman and Perkins. Talen Horton-Tucker (stress reaction, right foot) will not play in the remaining summer league games. \n\nHe will stay with the team in Las Vegas and continue to receive treatment. RT @SouthBayLakers: Homecoming for @MarcusAllen_15!\n\nThe Vegas native returns to his roots with the @Lakers Summer squad as they take on th… All warmed up in the desert 🏜\n\n#LakersSummer tips off the Vegas opener at 4:30 PT on ESPN! https://t.co/Vk8tVQ4rjv Driving intexticated is not worth the risk. Drive safely across Lakers Nation this holiday weekend.\n\nFor more information visit: https://t.co/YSiIz6sBKR https://t.co/txNxW70ZSL RT @SouthBayLakers: Team off day.\nFourth of July.\nDoesn't matter.\nStill getting work in.\n\n#LakersSummer 💪 https://t.co/1hvXsGUxpO RT @LakersReporter: Here are 10 takeaways from the LAL Summer League squad’s stay in Sacramento for the 2nd California Classic: https://t.c… Whose way? Our way. \n\nGood vibes only in a victorious #LakersSummer locker room. https://t.co/2zWawRSa6s 🎥 Coby Karl breaks down how the Lakers rallied from a 21-point deficit to win the Cali Classic finale. https://t.co/rkCm0TtPCN 🎥 After burying the game-winning 3-pointer, @ZachN_23 shares his thoughts on his California Classic performance. https://t.co/SfyExbZX5g RT @SouthBayLakers: Had a great time, @SacramentoKings.\n\n😏 #CaliforniaClassic https://t.co/uQkTIFUDJJ Sacramento, we'd like to introduce you to @JordaniHoward. \n\nFive triples in the fourth quarter alone! ☄️☄️☄️☄️☄️ https://t.co/HwWXrSg2Vm 🎥 After trailing by as many as 21 points in the 4th quarter, the Lakers fight all the way back to win the final game of the California Classic 99-97 https://t.co/bOxE159qUv New kid’s got the clutch gene 🧬🧬 \n\n@ZachN_23 with the #LakersSummer game-winner! https://t.co/5V09kA6azh Zach Norvell closes out the California Classic with a #LakersWin https://t.co/Ky6OmriWx8 RT @LakersReporter: Well, that was fun. The Lakers summer league squad, down 21 early in the 4th Q, exploded from 3-point range down the st… 👌👌👌 @ZachN_23 for the win! #LakersSummer 🔨 Devontae Cacok 🔨\n\n#LakeShow (📺: @SpectrumSN &amp; NBA TV) https://t.co/lY5sPcCmLH One half left in the #CaliforniaClassic. https://t.co/G1R9ylnoIa Aric Holman beats the first quarter buzzer.\n\n#LakeShow (📺: @SpectrumSN &amp; NBA TV) https://t.co/4QPswjs2xM California Classic finale tips off right now! #LakersSummer\n\n📺: @SpectrumSN and NBA TV https://t.co/vqNmDeuE2Q RT @LakersReporter: Lakers starters for the third and final CA Classic game in Sacramento (2 p.m. on @SpectrumSN): Jordan Howard, Dakota Ma… RT @SouthBayLakers: Looking to build off yesterday.\n\nCan't wait to see all of the Laker fans as we close out the #CaliforniaClassic 😏\n\n📺: @… 🎥 Zach Norvell Jr. talks about his game-high 20-point effort. https://t.co/IPrwGO3XbW RT @SouthBayLakers: 😤 @Vontae__15 was the attention grabber in tonight’s #LakersWin. 💪\n\n1️⃣6️⃣ points\n1️⃣2️⃣ rebounds\n5️⃣ steals\n2️⃣ assist… 🎥 California Classic head coach Coby Karl gives his thoughts about the teams second half intensity and the improved bench play. https://t.co/6xqu1P7iSn 🎥 Led by Zach Norvell's game-high 20 points, and Devontae Cacok's double-double, the Lakers knocked off the Warriors 100-90 in Sacramento. https://t.co/QX8lftQvt0 Summertime and the winning's easy ☀️\n\n@ZachN_23: 20 pts (7/10 FG)\n@Vontae__15: 16 pts, 12 reb, 5 stl https://t.co/YkSwnbcyUf Steal on one end, dunk on the other for Devontae Cacok\n\n#LakeShow (📺: @SpectrumSN &amp; ESPN2) https://t.co/x2FcsuVud7 New guy's got handles ♨️ ♨️ https://t.co/i3IDq0IErv The new two-way's got us off to a strong start. \n\n@ZachN_23: 10 pts (4/5 FG) https://t.co/uFk18vrt8h Devontae Cacok throws it down with two hands\n\n#LakeShow (📺: @SpectrumSN &amp; ESPN2) https://t.co/k0IX70w6Yr RT @LakersReporter: Nice start for new 2-way player Zach Norvell tonight. He has 8 of LAL’s 13 points on 3 of 3 FG’s, including a 3 and an… RT @LakersReporter: LAL starters for CA Classic Game 2: Joe Young, Dakota Mathias, Zach Norvell, Rosco Allen and Nick Perkins. LAL take on… RT @SouthBayLakers: Getting minds right for Game 2. 💪\n\n#CaliforniaClassic | #LakersSummer https://t.co/ZBkcpUsavD The top 3-pointer in the WCC, Zach Norvell hit 2.6 treys a night on a 37% clip.\n\nHe and the #LakersSummer squad are back in action at 6 PT on @SpectrumSN and ESPN2!\n\nhttps://t.co/hfFxtGYRpk RT @SouthBayLakers: Two-way guard @ZachN_23 leads the @Lakers Summer squad against the Warriors tonight from Sacramento.\n\n📺: @SpectrumSN \n⏰… Ball is up. #LakersSummer \n\n📺: @SpectrumSN &amp; NBA TV Gameday at the Cali Classic! \n\n#LakersSummer tips off on @SpectrumSN at 6 PT.\n\nhttps://t.co/B65mzf5mBg OFFICIAL: Welcome to LA, @ZachN_23! \n\nhttps://t.co/qUo2HaKUBY RT @LakersReporter: Here’s the starting 5 for the first @Lakers summer league game, via coach Coby Karl: Joe Young,\nDakota Mathias, Zach No… RT @SouthBayLakers: The prep work is done.\nSummer hoops starts tonight!\n\n@Lakers 🆚 @MiamiHEAT \n⏰: 6pm PT\n📺: NBA TV \n\n#CaliforniaClassic | #… Wheels down in Sactown 🛩\n\n#LakersSummer ready to tip off the California Classic on Monday. https://t.co/WT33jDQcLE #LakersSummer Liftoff ☀️🛫 https://t.co/N78q7qDX1d RT @Thortontucker: Only if it was still a dream💜 https://t.co/3eW30vkUOf Now's the time to make a name for yourself. Let the competition begin. #LakersSummer https://t.co/bljjrtFAy1 Mom dressed him in Kobe jerseys as a kid. Now it's his own name across the back.\n\n@Thortontucker was destined for the #LakeShow. https://t.co/d9LKepXtLi Small council meeting 👑👑 https://t.co/L7Q67FDGEj In his first interview as a Laker, @Thortontucker talks about his relationship with LeBron James and the stress reaction that will keep him out of the California Classic. https://t.co/WxmbSagXTU California Classic head coach Coby Karl gives his first take on the #LakersSummer squad and similarities to the @SouthBayLakers. https://t.co/xN4Vf59Kts “We may have lost the case, but we didn’t lose the faith she had or the love that she really had in her heart.”\n\nSenior Writer @KevinDing dives deep into Reggie Bullock's story of family and activism. \n\nhttps://t.co/MWgBKq0VJS RT @flea333: Tell ‘ em Reggie. https://t.co/L7hcI8kVak \"My sister was the backbone of my family. ... My sister was the one that pretty much was my guardian.\"\n\nFollowing the tragic murder of his transgender sister, Mia Henderson, @ReggieBullock35 has dedicated his life and his platform to standing up for LGBTQ+ rights. #PrideMonth https://t.co/BD5tridsLl OFFICIAL: Roster set for #LakersSummer ☀️\n\nhttps://t.co/3Ln3L8vGMZ RT @KingJames: Gotta hold it down for my Class!! 03 Forever and Beyond. 🙏🏾💯 #KingMe👑 #StriveForGreatness🚀 https://t.co/i7eJfQgrKG RT @JamesWorthy42: That’s going to be an epic #worthyclap https://t.co/ntdquZyRE6 Rook showing off that 7'1\" wingspan on day one with the #LakeShow 🦅 https://t.co/BXC3b4K8DH OFFICIAL: The Lakers have extended qualifying offers to Alex Caruso and Johnathan Williams. \n\nhttps://t.co/fggp4ANFnS 3x NBA MVP\n3x NBA Finals MVP\n5x NBA Champion\n12x NBA All-Star\nOlympic Gold Medalist\n\nA resume deserving of the @nba Lifetime Achievement Award. Congrats, @MagicJohnson! #NBAAwards https://t.co/W22EEOdWnW 👀 #LakeShow https://t.co/WF1lYGvCWM First birthday in purple and gold for Coach V! 🎉🎂🎁 https://t.co/Em4Lhfgvhj Armed with a 7'1\" wingspan and a reputation for versatility, Talen Horton-Tucker joins the #LakeShow as an 18-year-old full of potential.\n\nhttps://t.co/B2jtINOD27 RT @LakersReporter: Here’s my summary of the call with Talen Horton-Tucker, who discussed his “dream come true” of being drafted (No. 46, a… Talen Horton-Tucker talks about his versatility, and calls LA a \"dream destination\" after being selected by the Lakers. https://t.co/RN8Nye14lZ RT @LakersReporter: THT on his game: \"Keeping it versatile … you gotta be able to do a lot of different things on the court. Just get bette… RT @LakersReporter: Talen Horton-Tucker on the Lakers: “It’s a dream destination for me.\" RT @LakersReporter: On a conference call right now, THT, on where he wants to go from here w/his game: \"I feel like becoming better every d… RT @LakersReporter: The Lakers nab the 6’4’’, 238-pound swingman with a reported 7’1’’ wingspan. The Chicago native played 1 year at Iowa S… THT ➡️ LA\n\n@Thortontucker, welcome to the #LakeShow! https://t.co/h7Oq3N5MAU RT @NBADraft: With the 4th pick of the NBA Draft, the @Lakers select @drehunter_!   \n\n#NBADraft 2019 presented by State Farm Time to get the night started in Brooklyn. https://t.co/d4SaAUscCq Happy birthday to the NBA's first superstar: The late, great George Mikan! 👓🏆 https://t.co/JcIDiY8E9X RT @LakerGirls: “I knew I was prepared for that moment.” #LGAuditions | July 14 https://t.co/FfVPFPWgiY Wanna get in on the #LakeShow summer league experience? \n\n✈️ 2 flights from L.A. to Vegas\n🏨 2 nights hotel stay\n🎟 2 tickets to a #LakersSummer game\n\nEnter here 👉 https://t.co/hbiPvdfhce https://t.co/Sl04JJzhj2 RT @LakersCommunity: Check out some of the ways we gave back this season! 💜💛 https://t.co/4Nz3kIuWJe RT @SouthBayLakers: He has a heart of gold. 💛💜\n\n@_ScottMachado spent his birthday helping provide the homeless in Skid Row food, clothing a… RT @JemerrioJ: New Day.... To Get Better ✊🏾 workouts at 10am \n\nIt’s time ‼️ #KuzControl x Team USA 🇺🇸\n\n@kylekuzma will compete at USA Basketball training camp for a spot on the FIBA World Cup roster. \n\nhttps://t.co/PaUNUnHU5G RT @LakersGaming: Week 8 at the @NBA2KLeague was 🔥 #LakersGaming https://t.co/4xPCloeH9I The Lakers are proud of @ReggieBullock35, who is a finalist for the Muhammad Ali Sports Humanitarian Award in recognition of his advocacy for the LGBTQ community. \n\nhttps://t.co/vfOHI2MI3g RT @SouthBayLakers: 🎉 Happy Birthday 🎉 to our leader, President/CEO @JBuss! #SBLakers https://t.co/btasHZMftP 👑x🐍\n\n@KingJames and @kobebryant teaming up for the benefit of the next generation. #LakersFamily https://t.co/sgoud3s7xK Coach &amp; King 📋👑 https://t.co/5WFpdVqI2J You can’t 😤 https://t.co/qkr5RMNJvK https://t.co/7o5KSpsMy0 After leading his team in scoring, rebounds and assists, Jarrett Culver put his two-way skills on display in his #LakeShow workout. \n\nhttps://t.co/mSF5SMoWnx Working out for the #LakeShow today: Texas Tech guard @jarrettc08 https://t.co/WBgypgba05 🎥 Jarrett Culver talks about his ability as a two-way player, and leading Texas Tech to the NCAA title game. https://t.co/Tp40eSkkZZ Camp Lakers, presented by @UCLAHealth, is back for it's 20th summer providing young players with the ultimate #LakeShow experience!! \n\nDetails: https://t.co/cjoWjYGQvo https://t.co/4bzbN61Psd Big 12 Player of the Year Jarrett Culver will work out for the Lakers this Saturday. \n\nhttps://t.co/DXDZiHkruq “This is obviously a proud and historic franchise, and it’s a big honor to be here and to be responsible for this next chapter of our history.”\n\nSenior Writer @KevinDing on Frank Vogel's reputation for basketball strategy and human connection.\n\nhttps://t.co/VXd83lSeuv Two in China. \nTwo in DTLA. \nTwo in SF. \n\n#LakersPreseason x @Delta \n\nhttps://t.co/GIYVIzER5W RT @kylekuzma: Appreciate the love❤️🤙🏽 https://t.co/YdrSWwo7JM RT @SouthBayLakers: Float like a butterfly, sting like Izzy B. 🥊💪\n\n#LakeShow x #SBLakers https://t.co/CJcFqgobLN Mr. Clutch. The Logo. \n\nHappy birthday to the great Jerry West! https://t.co/SpMBIoZOQn RT @judyseto: Thanks @KingJames ! Looking forward to teaming up with you and the @lakers again. https://t.co/Ea9VteEYud RT @judyseto: Thank you @lakers for this amazing opportunity. Ready to roll up my sleeves and get to work. I’ve come home #LakerNation 🙏💜💛… “I really enjoy the process of studying the roster and formulating a plan.”\n\nFrank Vogel shares his first impressions of the young core and LeBron James. https://t.co/ZmaO7k86z8 RT @Ky1eLong: Worked with her when coming back from elbow and shoulder operations, she is elite! https://t.co/3Xi0ZyyXtk RT @KingJames: Welcome back Judy!!! https://t.co/pGZdo7bjDo OFFICIAL: Judy Seto has been hired as Director of Sports Performance and will oversee the medical care and optimize the health and performance of Lakers players.\n\nhttps://t.co/3uEVxHhR16 \"When you got talented guys working together, you can accomplish anything.\" \n\nCoach Vogel gives a preview of the culture he wants to build and his on-court philosophies. https://t.co/59f8OMYcsP RT @LakersReporter: LeBron’s All-NBA company: Kobe Bryant, Kareem Abdul-Jabbar, and Tim Duncan (most selections in league history). https:/… Congrats to @kingjames on his record-tying 15th All-NBA selection! \n\n👑👑👑👑👑👑👑👑👑👑👑👑👑👑👑\n\nhttps://t.co/vcVVXRWjxu Happy birthday, @Iam_J3! 🎁🎈 https://t.co/fISfEyA9Jf RT @LakersReporter: Vogel said defense still starts in the paint: \"With all the talk of the 3-point line, it’s still most important to buil… RT @LakersReporter: Frank Vogel on offense has an “analytics-based approach to playing the game outside in,” which uses the 3-point line an… Coach Vogel, welcome to your new home. #LakeShow https://t.co/aSIf45RrwS RT @LakerGirls: “It was bigger than just a dance team.”\n\n#LGAuditions | July 14 https://t.co/mcLnwcrsDr Coach sets the tone. https://t.co/v5w4FVpCc3 RT @LakersReporter: New story on Frank Vogel’s approach to NBA basketball, and how it applies to his new job as Lakers head coach, coming o… “Full of enthusiasm and positive energy about what we can be as a basketball team.”\n\nCoach V delivers his message to #LakeShow fans. https://t.co/lpKANOSbfh Coach V #LakeShow https://t.co/x4WS5cqyxx RT @LakersReporter: Vogel said LeBron’s 2018-19 was clearly impacted most by the Dec. 25 injury. For next season? “I expect us to see one h… RT @LakersReporter: Vogel said he had a “very positive” conversation with LeBron. RT @LakersReporter: Asked Frank Vogel if his approach has evolved from Indiana days through Orlando: “There's been a major evolution stylis… “I’ve got a strong plan about how we’re going to play as a basketball team.” - Frank Vogel \n\nhttps://t.co/c2qJ3WlEPn RT @LakersReporter: Frank Vogel: \"I see a lot of promise, a trememdous amount of promise for what we can be.\" \"It's an honor for me to be here today and be responsible for this next chapter of Lakers history.\" - Frank Vogel\n\nhttps://t.co/c2qJ3WlEPn RT @LakersReporter: New head coach Frank Vogel just took the podium alongside GM Rob Pelinka. Sitting in the first row are Joey and Jesse B… Frank Vogel speaks to the media for the first time as the Lakers head coach. #LakeShow https://t.co/c2qJ3WlEPn Coach Vogel takes center stage this morning at 11 on @SpectrumSN, Facebook Live and here on Twitter. https://t.co/R0O0iE5ZMB RT @SouthBayLakers: Years and years of muscle memory.\n\n#AndreIngram | #SBLakers https://t.co/w3nrWlwwIi Berlin Born. Berlin Bred. \n\n@moritz_weasley hoops beneath his hometown mural 🇩🇪 https://t.co/FFb7cB9Jn1 The Lakers had a 90.6% chance of staying at the No. 11 spot or falling backwards. Instead they'll draft 4th overall. https://t.co/fTK3xmiwvg RT @NBA: Larry Bird and @MagicJohnson to receive Lifetime Achievement Award at 2019 NBA Awards presented by Kia on TNT!\n\n⭐️ #NBAAwards: Jun… RT @kylekuzma: Did y’all really see the hand of the king though👀👀🤷🏽‍♂️🔥 https://t.co/AuwZRazHAh https://t.co/8VkQQqh7oa RT @LakersReporter: Here’s a full transcription of LAL GM Rob Pelinka’s phone call with a few of us after the Lakers jumped 7 spots to nab… The Lakers had just a 9.4% chance of jumping into the top four.\n\nhttps://t.co/zmtnfQ1AX5 RT @KingJames: #4 👀 Beautiful. This man @kylekuzma. \n\nClutch on the court. Clutch at the Lottery. https://t.co/CpnnXHNbgN RT @LakersReporter: Wow. The Lakers jumped all the way up from the 11th slot to the No. 4 position. They had just a 9.4% chance to get in t… OFFICIAL: The Draft's fourth-overall pick belongs to the #LakeShow https://t.co/wWvPJNR1Sh RT @joshhart: Wow....👀👀👀 Let's. Go. https://t.co/s6kJZItEqK https://t.co/xV7NMQYBWX Whoa. 🏓⏳ https://t.co/vAjasgvuhZ RT @Lakers: Time will tell where the Lakers will draft in June. \n\nLottery night gets started on Tuesday at 5:30 PT on ESPN.\n\nhttps://t.co/Z… RT @LakersReporter: GM Rob Pelinka: “(Vogel) has a proven track record of success in the NBA Playoffs, and he reflects the core qualities w… “I look forward to coaching such phenomenal talent and bringing my strategic vision to the team.”\n\nWelcome to the #LakeShow, Coach Vogel! \n\nhttps://t.co/I3Ts5KOZOD Time will tell where the Lakers will draft in June. \n\nLottery night gets started on Tuesday at 5:30 PT on ESPN.\n\nhttps://t.co/ZxFmt5O1VT RT @LakersReporter: Kuzma won’t bring any good luck charms to the lottery, like when @JamesWorthy42 brought Dr. Buss and Chick Hearn bobble… Kuuuz!\n\n@kylekuzma checks in with @LakersReporter about representing the Lakers at Tuesday's NBA Draft Lottery. https://t.co/OEoEzpiPTM 🐶🐾 Our first four-legged #LakerForADay reps are Harlow and Pierre —  who visit over 1,000 patients per month through @UCLAHealth’s People-Animal Connection therapy program! \n\nThanks to @MayaRudolph for giving Harlow her voice! #TeamUCLALakers https://t.co/3QCX5rV3Xv https://t.co/udj4GcZZRJ RT @LakersReporter: The Lakers are sending @kylekuzma to Chicago to represent the squad for the NBA Draft Lottery on Tuesday, May 14. LAL (… RT @LakersGaming: 🎮 Entertainment Day with your #LakersGaming squad 🎮 https://t.co/LDMZPd6WIN “It’s the dog in me. I probably want it more than them ... I do want it more than them. I ain’t gonna lie to you.”\n\nWant more from @JemerrioJ? Watch his full interview below this teaser. https://t.co/DeTpHLVrly https://t.co/GJSn21Oi7w This is your last chance to vote—make it count.\n\nRT this to cast a double vote for @KingJames.\n\n#LeBronJames + #NBACommunityAssist https://t.co/fviBeNA4xg Last day to vote for @KingJames!\n\nVotes worth double today, and RTs count 👑🗳\n\n#LeBronJames + #NBACommunityAssist https://t.co/rZsvkbrrLN RT @SouthBayLakers: He's one of the best in the business.\n\n🎉 Happy Birthday to South Bay GM and @Lakers Director of Research &amp; Development… Back in the lab 🥼🔬 https://t.co/njbgHLZaeO RT @JemerrioJ: 🙏🏾 gotta keep going https://t.co/amv0gX4BC8 \"They call me the neighborhood hero.\"\n\nOrange Mound native @JemerrioJ on his Memphis roots, self-rehabbing an ACL tear and his rapid rise to the #LakeShow https://t.co/D4kHmIgc8N Happy birthday to the legend known as Silk! https://t.co/3fSy7zw71u Read more about the California Classic: https://t.co/Kdq2APPIWI #LakersSummer tips off in the capital. \n\nBefore Vegas, the Lakers will return to Sacramento for the second annual California Classic. https://t.co/InpK2X4Sow Got a Q for @KingJames? https://t.co/SeJA3Yk5um Weightroom ➡️ Hardwood\n\n@isaacbonga isn't wasting any time this offseason. https://t.co/GfWVO6pqLf RT @kaj33: I met John Havlicek at the same time &amp; place that I met Red Auerbach &amp; Bill Russell @ my high school gym in Autumn of 1961 - my… No longer the rook! Happy 22nd, @moritz_weasley! https://t.co/ZKkfbnyS8i Only one player ranked among the NBA's top five in both scoring and assists: @KingJames.\n\nhttps://t.co/knFpg46WOM “It’s all about how locked in you guys are together.” - @kylekuzma\n\nSenior Writer @KevinDing on the Lakers' evolving mindsets, connections and lessons.\n\nhttps://t.co/PBztBeAJFp #LakeShow x @KingJames\n\nhttps://t.co/yo2lnNFcBV More than an athlete.\n\n#NBACommunityAssist + @KingJames = Votes for LeBron 👑🗳 https://t.co/SpEedXtRkz Lakers fans, here's your chance to win a Brandon Ingram City Edition jersey from this season!\n\nhttps://t.co/xqlGVFGDgk RT @NBA: LeBron James of the Los Angeles Lakers is nominated for the 2018-19 Seasonlong NBA Cares Community Assist Award presented by @kpth… Strength comes from the Hart 💜🏋️‍♂️ https://t.co/jhQu3oOkmq L.A. native and Lakers Legend: Happy 76th to the great Gail Goodrich! https://t.co/MomlG4ZUV0 Official statement regarding Luke Walton:\n\nhttps://t.co/JCFvcSHm6x Ultra-efficient on each side of the floor, JaVale McGee ranked among the NBA's top 5 in both blocks and field goal percentage. \n\nhttps://t.co/iZ15GTAUfC Alex Caruso put the league on notice with his high-flying dunks, relentless defense and 48.0% clip from 3-point range. \n\n https://t.co/nvgEK2n00v Almost time! ⏳ #LakersGaming https://t.co/iDjeMdN1x8 From attacking the rim to defending the post, Josh Hart's unique skill set was on display until suffering a midseason knee injury. \n\nhttps://t.co/D6OIpKypor Lonzo Ball's elite defense was one of the Lakers' main keys until an ankle sprain ended his season in January.\n\nhttps://t.co/LicvIrdKm7 Kyle Kuzma embraced an even larger role as a sophomore, finishing as the team's second-leading scorer.\n\nhttps://t.co/rugzHGhdEN 72 years young. Happy birthday, Cap! 🎂 https://t.co/4yluLpornE Nothing gets past @JaValeMcGee! \n\nLakers Voices presented by @Toyota https://t.co/C9uOWdCCzm 🎥 @JaValeMcGee is joined by @isaacbonga to talk about acting, German and American cuisine, and getting adjusted to the NBA, on Lakers Voices presented by @Toyota https://t.co/GSnS29WpG5 Brandon Ingram elevated his game post-All-Star, averaging 27.8 points before a blood clot ended his season prematurely. \n\nhttps://t.co/qlbey5NMRP .@IceCube joins #TheOfficialLakersPodcast w/ Suzy Shuster and @AaronLarsuel this week!\n\nWe want to get all your questions answered, so shoot them our way using #AskOLP or to Lakers@podcastone.com. Tune in to the season wrap-up episode later this week!  https://t.co/VG0WZQNfzB https://t.co/xt9UbRWrmG ⚡️ “Kyle Kuzma Fields Fans' Questions in Twitter Q&amp;A”\n\nhttps://t.co/cfO422Qmtu The Los Angeles Lakers and Luke Walton have mutually agreed to part ways.\n\n\"We would like to thank Luke for his dedicated service over the last three years,\" said General Manager Rob Pelinka. \"We wish Luke and his family the best of luck moving forward.\"\n\nhttps://t.co/3cgU3WPgnJ “When I get back in this gym, it’s going to be exciting for me just to pick up a basketball.”\n\n@B_Ingram13’s post-surgery perspective sets the tone heading into the offseason, writes Senior Writer @KevinDing.\n\nhttps://t.co/6JapwKFxW1 RT @LakersGaming: Whole squad ready. #LakersGaming regular season gets started tonight. https://t.co/O8JoULFjxc RT @Lakers: “We get so caught up in so much of the negativity. Just to see the positives and see everyone around us saying positive things,… RT @SouthBayLakers: His story had a global impact.\n\n365 days since Andre Ingram made his @NBA debut, teammates and coaches reflect on what… RT @SouthBayLakers: The two-way player with the highest scoring game in the @NBA this year.\n\nThat’d be @ACFresh21. 😎🤙 https://t.co/wEHE3JSS… RT @LakerGirls: Purple and gold for life! #LakeShow https://t.co/PG1Pf8ZB1m “We get so caught up in so much of the negativity. Just to see the positives and see everyone around us saying positive things, I think that was good for me.”\n\nhttps://t.co/cgUp06RcXo ⚡️ “Lakers Reflect on Year in Annual End of Season Interviews”\n\nhttps://t.co/A4rhaffS1R RT @JaValeMcGee: Thanx @Lakers Fans... You guys stuck with us.... really appreciate that! Streaming Live: Isaac Bonga reflects on his first year with the Lakers, presented by @GetSpectrum https://t.co/2nQJnmCduw RT @LakersReporter: Alex Caruso’s April splits: 17.2 points and 8.4 assists with 1.4 steals on 43.8% from 3: “I think it’s just been a good… Streaming Live: Alex Caruso on the progress he made in his second season in the league, presented by @GetSpectrum https://t.co/3J3CsbLQsC \"It felt good. It really did though, because I got to go against players I play with on 2K. I got to play against them in real life, so it felt good for sure.\" - The iconic @JemerrioJ https://t.co/s2JeVOO7ux Streaming Live: Johnathan Williams talks about the 2018-19 campaign in his end of season interview, presented by @GetSpectrum https://t.co/aVnkIqBJRN RT @LakersReporter: Jemerrio Jones said this opportunity definitely helped in terms of exposure for his game. He was very thankful for it.… Streaming Live: Jemerrio Jones looks back on his time spent with the Los Angeles Lakers, presented by @GetSpectrum https://t.co/JqhplYS4id RT @LakersReporter: JaVale McGee: \"It’s all love here in L.A. - they see you working your butt off even though you’re losing, they still su… Streaming Live: JaVale McGee reflects on his 2018-19 campaign with the Lakers, presented by @GetSpectrum https://t.co/K6XemH97xR RT @LakersReporter: Chandler was specific about Brandon Ingram: \"I’ve seen some special things that I didn’t know (Brandon) had … sometimes… Streaming Live: Tyson Chandler hops on the mic to review the 2018-19 season, presented by @GetSpectrum https://t.co/iECWbhIt0V Streaming Live: Rajon Rondo looks back on the 2018-19 season, presented by @GetSpectrum https://t.co/IO5mbYaWA4 RT @SouthBayLakers: One year ago, his dream came true.\n\n#AndreIngram | #LakeShow https://t.co/GRp37mhvO0 RT @LakersReporter: Kentavious Caldwell-Pope talked about getting into a rhythm late in the season when it was just about playing basketbal… Streaming Live: Listen in as Lance Stephenson jumps on the mic to review the year in his end of season interview, presented by @GetSpectrum https://t.co/OlNLZqbYcX Streaming Live: Kentavious Caldwell-Pope discusses his second year with the Lakers, presented by @GetSpectrum https://t.co/v7GamDSsTi RT @LakersReporter: Ingram said it’s encouraging to him that he got to that post-All-Star level he had expected himself to reach at the sta… RT @LakersReporter: Ingram can’t do much yet due to the surgery to remove the clot. That’s not easy for him, as hoops has been his primary… “It’s given me a better perspective on life itself. Without basketball I wouldn’t know what to do. It gives some extra motivation.” - @B_Ingram13 on his recovery https://t.co/2ZxbovGeGp Great to see @B_Ingram13 back smiling 😀 https://t.co/cMICqtH2am RT @LakersReporter: Brandon Ingram said he was initially kinda worried about the blood clot, but that he’s “Happy we caught it early, and i… Streaming Live: Brandon Ingram talks about his third year in the league, presented by @GetSpectrum https://t.co/QHfZm9Rl2P RT @LakersReporter: Reggie Bullock said he loved getting to know his teammates, but it was tough to find chemistry given all of the line up… Streaming Live: Reggie Bullock looks back on the 2018-19 season, presented by @GetSpectrum https://t.co/8snfeuhZUL RT @LakersReporter: Muscala on LeBron: \"The biggest thing I noticed from being a teammate of LeBron’s is just how observant he is. He notic… “It was a dream come true for me. … Watching him my whole life, it was everything I thought it would be. \n\n\"He’s not only a great basketball player but a great person. I looked at him like a big brother.“ - @ZO2_ on @KingJames https://t.co/i02qlhYGVY Streaming Live: Mike Muscala reflects on his 2018-19 campaign with the Lakers, presented by @GetSpectrum https://t.co/sWZlm60U6e RT @LakersReporter: Lonzo Ball said it’s been a long process with his ankle, which he hurt on Jan. 19, but that he’s “finally starting to s… Streaming Live: Lonzo Ball looks back on the 2018-19 season, presented by @GetSpectrum https://t.co/Q6rx7pl592 “So many times in basketball and in sports, you always preach family. \n\n\"You go into an arena and it’s the 17 of you guys versus 20,000 people. … I can’t say enough positive things about people in that locker room.” - @kylekuzma https://t.co/pXFpYdVBxh Streaming Live: Kyle Kuzma talks about his second year in the NBA in his end of season interview, presented by @GetSpectrum https://t.co/lsiCvTIEzI “The biggest thing is we know everyone had each other’s back. I think that’s a bond that goes beyond just one year, one season.” - @joshhart on his teammates https://t.co/EhtAKYFjKr RT @isaacbonga: I wanna say thank u for that amazing first year.......... way more to come  @Lakers 🙏🏾 Streaming Live: Josh Hart reflects on the 2018-19 season in his end of season interview, presented by @GetSpectrum https://t.co/pPH0uXvNAN RT @LakersReporter: Josh Hart on his knee, which started to hurt in January: “Frustrating with the inability to explode off of it. Now just… RT @LakersReporter: Wagner started to get an understanding of where he can fit in the NBA as he got more PT: “It's cool to understand your… 🎥 Luke reflects on the season and what he’ll take away from it. https://t.co/StxcD2lMnc 🎥 JaVale McGee talks about how it was a dream come true to play for the Lakers organization. https://t.co/4AzcOyPJ6y 🎥 Jemerrio Jones talks about taking advantage of his opportunity in the NBA, and recording his first double-double. https://t.co/SPUF7AEJDU 🎥 Alex Caruso talks about his stretch of play to end the season https://t.co/FslvFbU1AY RT @ACFresh21: Tough finish.. thanks for the support this season lakers fans 💪🏼 #LakeShow 🎥 Lakers fight to the last shot but fall to Portland on a last-second buzzer beater in the season finale, 101-104. https://t.co/DLWyqYEf4D Join us Wednesday morning at approximately 8:45 a.m. for annual exit interviews, streamed live on Facebook, Twitter and the Lakers website. https://t.co/qAe0M1hfYB To the 19,000 strong at STAPLES every night and the millions around the globe. #ThankYouFans https://t.co/q4nV7gT5TC Fan Appreciation Day means #WeGotTacos courtesy of @JackBox 🌮🌮 https://t.co/d3JD0lWdBj Through it all. #LakeShow every day. https://t.co/2f3kEsoWfI ALEX. CARUSO. JaVaaaaaale McGeeeeeee!!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/biDLhOv2Dw Throw it down, Moe!!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/sHK3T7GXvV #LakeShow in front with 12 minutes left in the season. https://t.co/eSRjKfBuo4 JaVale slams, and @icecube approves\n\n#LakeShow (📺: @SpectrumSN) https://t.co/8tm8nsQCEv RT @JeanieBuss: Earvin, I loved working side by side with you. You’ve brought us a long way. We will continue the journey. We love you 💜💛 h… Lakers Statement on Earvin \"Magic\" Johnson: https://t.co/lXqb2PS8yv https://t.co/A2e5DFMELs At the half https://t.co/rTXmsqyegq RT @LakerGirls: ⭐️⭐️⭐️ https://t.co/M8FnbBhJoV 🔘⚪️⚪️⚪️ https://t.co/Kn5KcqPxzv J3 flushes it home!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/WJCj70qdTh #SuitingUpTogether for the final time this season. https://t.co/IsdmxcVkHu Season finale coming up now! \n\n📺: @SpectrumSN\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/lrm0MvyChA 🚨Giveaway Alert: Get your #LakeShow License Plate Frames at the door tonight! https://t.co/WMISx7gcby 🏀 There's something new at the Figueroa street entrance @STAPLESCenter!\n\nDownload the “Leon Keer” app through Google Play or the App store to see the @budweiserusa x @leonkeer mural come to life on your screen. https://t.co/Wf95m3F3hD Happy 2️⃣4️⃣th @JemerrioJ!! 🎉🎂 https://t.co/5OOvm0nQoh #LakeShow season finale tonight in DTLA at 7:30 PT!\n\n📺: @SpectrumSN\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/H3fGAnA8vb 📰 @JemerrioJ is one of a kind.\nhttps://t.co/d7gTiEnGLM Not all wounds are visible. Yolanda, a US Army veteran’s injuries affected her mental health; her spirit &amp; outlook on life were disheartening. @Operation_Mend at UCLA Health saved her, she’s living w/o limitations &amp; was our Laker For A Day! https://t.co/Xzda7sJfRm #TeamUCLALakers https://t.co/Ja72XzCTL3 RT @JaValeMcGee: 🐎 🐎 🐎 https://t.co/tTI4u4ZXJ2 RT @LakersCommunity: Our staff teamed up with A Place Called Home last week at their annual Cinderella &amp; Prince Charming Project, where tho… RT @SouthBayLakers: He’s finally on Twitter!\n\nGive a follow to Jemerrio Jones 🙌\n\n➡️ @JemerrioJ\n\n#LakeShow | #SBLakers https://t.co/9FgJt62K… 🎥KCP caught fire late, scoring 18 of his 32 in the final frame to lead the Lakers to a 113-109 victory. @JoeyARamirez and @LakersReporter break down the win. https://t.co/lt66SiLNYp RT @SouthBayLakers: Among all players to debut since 1970-71, Jemerrio Jones is the first @Lakers player with 16+ rebounds in his first car… RT @LakerGirls: Having fun with this #LakersWin! https://t.co/FteJJ6JAx4 RT @kylekuzma: Real one! Lol ...dope💪🏽 https://t.co/9zXSHAzJh2 🔥🔥🔥 @CaldwellPope went into flamethrower mode in the fourth quarter, scoring 18 of his points on 7-of-8 shooting. \n\nhttps://t.co/dCYQPBHdiY 🎥 Luke calls it a “rewarding win” for the group after second straight. #LakersWin https://t.co/LOJshCsP48 🎥 JaVale McGee discusses Jemerrio Jones impressive showing on the boards, and playing spoiler in games down the stretch. https://t.co/YIpgz3EKpU 🎥 Jemerrio Jones talks about making his first career start, pulling down 16 rebounds, and being thankful of his opportunity in the NBA https://t.co/7RsjtHFG7Q 🎥 Kentavious Caldwell-Pope talks about playing 42 minutes and his recent hot stretch of games. https://t.co/KRx5Ta8PgD RT @LakersReporter: Jemerrio Jones is the first Laker with 16+ rebounds in his first career start since Elias began tracking it in the earl… 🎥JaVale McGee finished with 22 points and 8 boards in tonight's #LakersWin over the Jazz. https://t.co/HKMsSwTcTP 🎥 KCP dropped a team-high 32 points tonight to go along with his 6 assists and 6 rebounds #LakersWin https://t.co/0tidj3WOVH 🎥 Lakers claw out the victory behind strong performances by KCP and JaVale, beating the Jazz, 113-109 #LakersWin https://t.co/ROuwiKSp2l 🛡🏠 Home court: Protected. #LakersWin\n\nhttps://t.co/vITY3KFtYI Utah's 7-game win streak comes to an end in Downtown L.A. #LakersWin \n\n@CaldwellPope: 32 pts\n@JaValeMcGee: 22 pts\n@ACFresh21: 18 pts, 11 ast https://t.co/rOK6QZkKYp KCP finds JaVale again!!\n\n#LakeShow (📺: @SpectrumSN &amp; NBA TV) https://t.co/AU7srDFGax RT @LakersReporter: A beautiful lob pass from KCP found McGee for a dunk that put LAL up 112-107, and just 15.6 seconds on the clock. Caldw… Kenny with the crossover into the finger roll! \n\n#LakeShow up 9 with only 2 minutes left. 🚫 Jemerrio Jones 🚫\n\n#LakeShow (📺: @SpectrumSN &amp; NBA TV) https://t.co/P8HBTpCgUA Congrats to Al Morita, who has been a valued season ticket member since 1973.  Al received 2 round-trip flights on @Delta, our Official Airline, and was honored on-court during tonight’s game! https://t.co/ZlGjAdFzTO RT @LakersReporter: B2B 3’s from Muscala - his 4th - and KCP - his 2nd - put LAL up 89-85 early in the 4th Q. The Lakers have been attackin… Don't hurt 'em, Moe!\n\n#LakeShow (📺: @SpectrumSN &amp; NBA TV) https://t.co/Y49dbSZcDP Twelve minutes left to settle this one.\n\nCaruso: 17 pts, 8 ast\nWilliams: 14 pts, 7 reb\nJones: 5 pts, 12 reb https://t.co/PTtkzTi4nC JaVale drops the 🔨 courtesy of KCP!\n\n#LakeShow (📺: @SpectrumSN &amp; NBA TV) https://t.co/l25z8EgZyo Congratulations to Michael Mendoza who just won a new Toyota Corolla Hatchback XSE at halftime in the @ToyotaSoCal Skills Challenge! Toyota and the Lakers #SuitingUpTogether for 42 years! https://t.co/5jHOLRx0tS We've got a close one halfway through. \n\nCaruso: 13 pts, 6 ast\nMuscala: 13 pts, 6 reb\nMcGee: 10 pts, 5 reb https://t.co/0HZdvu8kMs No look, no problem 👀\n\n#LakeShow (📺: @SpectrumSN &amp; NBA TV) https://t.co/C7S0OwzGBx Offense wasting no time filling the bucket. \n\n@JaValeMcGee: 10 pts\n@ACFresh21: 8 pts, 5 ast https://t.co/hROsQGzjC2 .@ACFresh21 with a nice dish to KCP!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/TImzVjTmdG JaVale flushes it home to put the #LakeShow on the board!\n\n(📺: @SpectrumSN) https://t.co/t6rClePEpq Ball is up. #LakeShow https://t.co/KR4gXsQSf7 Jemerrio gets his first NBA start. \n\n#SuitingUpTogether https://t.co/s93V7EFp5w Time to get it started at STAPLES! \n\n📺: @SpectrumSN in L.A. NBA TV nationally \n📻: 710 ESPN and 1330 KWKW\n\nhttps://t.co/WZB1dsTiwT You are now watching the #CaruShow https://t.co/f9IoYHNVFK F O C U S https://t.co/zj5mQPENuS RT @LakersReporter: New story - “Jemerrio’s Journey”; I followed Jemerrio Jones’ path from Orange Mound (Memphis) through junior college, N… Final #LakeShow Sunday of the season tips off tonight at 6:30 PT!\n\n📺: @SpectrumSN in L.A. NBA TV nationally \n📻: 710 ESPN and 1330 KWKW\n\nhttps://t.co/BrV1bbACKO Fresh off a career-high night, learn more about second year point guard Alex Caruso, presented by @Tissot https://t.co/as3hailhJk RT @LakerGirls: A special morning with Make-A-Wish 💙 https://t.co/sUBWB9Lzf9 RT @Lakers: L.A. HIS WAY! https://t.co/8aFZDlPiof RT @Lakers: 🎥 Kentavious Caldwell-Pope finished with 25 points and 6 boards in tonight's #LakersWin over the Clippers. https://t.co/Ir7Ercy… RT @Lakers: 🎶 AC and the Sunshine Band 🎶 https://t.co/qk7FgycV25 RT @Lakers: 🎥 Alex Caruso dropped a career-high 32 points tonight, rounding out his double-double with 10 rebounds and 5 helpers #LakersWin… ⚡️ “Caruso Dominates in Lakers Win Over Clippers” by @Lakers\n\nhttps://t.co/W24LcVWPFh 🎥 @JoeyARamirez and @LakersReporter break down Alex Caruso's career-high night, and the impact Jemerrio Jones had in the Lakers 122-117 win over the Clippers https://t.co/xkLv7QJQAn RT @Lakers: 🎥 Lakers get clutch shooting down the stretch to hold onto their lead and beat the Clippers, 122-117 #LakersWin https://t.co/x5… RT @ACFresh21: @KingJames Learned from the best 👀👑thanks brodie 💪🏼 Alex Caruso caught fire when his team needed him most, pouring in 13 fourth-quarter points and 2 last-minute buckets. \n\nhttps://t.co/o5sfVyrzDS 🎶 AC and the Sunshine Band 🎶 https://t.co/qk7FgycV25 🎥 Alex Caruso reflects on his career-night at STAPLES Center. https://t.co/GYXX8be7QH RT @JaValeMcGee: FINISH SKRONG! https://t.co/zF8T3pmFWO 🎥 Luke Walton praises the young guys for taking advantage of their   opportunity and Rajon Rondo's veteran leadership in the fourth quarter. https://t.co/uKcsiJKyCs 🎥 Rajon Rondo talks about @ACFresh21 catching fire in the fourth. https://t.co/hY34uf2A3k 🎥 Kentavious Caldwell-Pope finished with 25 points and 6 boards in tonight's #LakersWin over the Clippers. https://t.co/Ir7ErcyPgj 🎥 Alex Caruso dropped a career-high 32 points tonight, rounding out his double-double with 10 rebounds and 5 helpers #LakersWin https://t.co/uTTFb17Bi4 @KingJames @ACFresh21 🙌 https://t.co/5y3uxC9sJL RT @KingJames: GAME 🏀 @ACFresh21‼️‼️‼️‼️‼️ Way to hoop bro. 👌🏾 https://t.co/kgveYL4eMb 🎥 Lakers get clutch shooting down the stretch to hold onto their lead and beat the Clippers, 122-117 #LakersWin https://t.co/x5L1uXMa1C #LakersWin with three double-doubles leading the way.\n\n@ACFresh21: 30 pts, 10 reb\n@JaValeMcGee: 18 pts, 10 reb\n@RajonRondo: 15 pts, 12 ast\n\nhttps://t.co/tRRcdKxvYP RT @LakerGirls: #LakersWin!! 👏😃 https://t.co/0ObfOJVGZr L.A. HIS WAY! https://t.co/8aFZDlPiof Take a bow, @ACFresh21. \n\n🔥 32 points 🔥 \n🔥 10 rebounds 🔥 \n\n🔥🔥🔥 #LakersWin 🔥🔥🔥 https://t.co/tKcLb7vHHa 🔥🔥🔥 https://t.co/rICxj8T94b Caruso. Again. Get 🆙 young fella!!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/Qnla9PUpzt The #CaruShow has entered the flex zone!! 💪 https://t.co/3kM7KZ3LD6 AC⚡️AC\n\nWelcome to the #Carushow 🎸🎸🎸 https://t.co/ICvOlmW104 Let the rook eat!! 🍽 https://t.co/qLlJ8ZVnCf Caruso Connection!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/curvXnDi3h RT @LakersReporter: Caruso NBA JAM en fuego … another 3. He has 5 of ‘em overall, 3 in the 4th Q. LAL up 10. Certified Fresh https://t.co/N5sIx3owMX Too much freshness.\n\n🔥🔥🔥 @ACFresh21 is burning up the place with a career-high 25 points 🔥🔥🔥 https://t.co/0DQJ0Dx9hx RT @LakersReporter: B2B 3’s from KCP (his 5th) and Caruso (his 3rd) put LAL up 108-102 with 5 minutes left, forcing another Clippers time o… RT @LakersReporter: Rajon Rondo has 3 4th Q 3’s, his latest putting LAL up 102-97 with 6 minutes to play. The Lakers are 10 for 25 from 3 o… Locked in a tight one with 12 minutes remaining. \n\n@ACFresh21: 19 pts, 10 reb\n@CaldwellPope: 17 pts\n@JaValeMcGee: 14 pts, 9 reb https://t.co/6DGeBUNqul Jemerrio with the rejection!!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/ebO3MbkgkS RT @LakersReporter: After hitting a 3 to cut the lead to 2 at 82-80, @ACFresh21 has 19 points, 10 boards (a career high), 5 assists and 2 s… All the way 🆙 https://t.co/gi54SVpx4X RT @LakersReporter: LAL went on a 9-0 run to get back into it at 73-70 after LAC had opened a 12-point lead early in the 3rd, capped by KCP… JaVale with one hand!! 🤯 🤯\n\n#LakeShow (📺: @SpectrumSN) https://t.co/EzeMIsc18B Halftime at STAPLES. https://t.co/UkESvzKXF9 RT @LakersReporter: Continuing his strong play of late, Alex Caruso has 14 points, 5 boards and 4 assists in his 18 1st half minutes with 2… 🚫 JaVale McGee 🚫\n\n#LakeShow (📺: @SpectrumSN) https://t.co/h7W0MBmu6v Throw up the 👌 https://t.co/A9KPPwbiWt #LakeShow take the early five-point lead behind @ACFresh21. https://t.co/ApzT7zwTkl Block by Muscala leads to a transition stuff for J3!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/6y1ZEGdLAo Pierre coming through. #LakeShow https://t.co/WVGLoI7cVh JaVale soars in for a one-handed flush!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/5fJyr57NTV Again https://t.co/DgY8V32lr9 Statuesque 🗽 https://t.co/KsCkkUpkzV Ball is up. #LakeShow https://t.co/RSkyb3OVte #SuitingUpTogether https://t.co/GdzcBGSa42 Moe time. #LakeShow https://t.co/axWxvUnTpE Game time in the City of Angels! \n\n📺: @SpectrumSN\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/TluJeV5hFg Go time at @STAPLESCenter #LakeShow https://t.co/cJtkCEDsxR RT @SpectrumSN: Pregame notes! 📝\n@LakersReporter talks with Luke Walton ahead of tonight's matchup against the Clippers. https://t.co/Rakgp… Go inside the home of assistant coach @madsen_mark on tonight's all-new #BackstageLakers\n\nFollowing the postgame show on @SpectrumSN https://t.co/vbuKruefj8 RT @SpectrumSN: “It’s absolutely fair that our fans feel the way they feel.”\n\n@KingJames goes one-on-one with @RealAClifton to discuss why… RT @SouthBayLakers: That stone cold reaction by @ACFresh21 😤💪  #OnHisHead https://t.co/9rmFUAkdoR Back at it against our hallway neighbors at 7:30 PT!\n\n📺: @SpectrumSN\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/X6i0yPyYjD 🎥 Jemerrio Jones talks about rising up to the challenge of guarding Golden State's best players, and his defensive and rebounding presence. https://t.co/SZvD85HDw3 🎥 Luke praises Jemerrio Jones for taking full advantage of his opportunity. https://t.co/UYS4ozDcsq 🎥 Alex Caruso talks about his put-back dunk in the 2nd quarter, and getting back on track for the final three games. https://t.co/t8N1k4oI5g Quick turnaround. Back at it in this building tomorrow night. https://t.co/vm5RM2bdGn All Love. https://t.co/sQk7JwZydU Final frame coming up. https://t.co/YN2mIfY02y Spotted @SarahKSilverman courtside 😜 Courtesy of @WishShopping 🛍 https://t.co/JgZnEYHDRE RT @LakerGirls: Loving every moment on the court! ✨ https://t.co/demWqosRMr Alex Caruso's monster put-back is our @budweiserusa moment of the week! https://t.co/aoRrUftlYr Halftime Downtown. https://t.co/9FpynBCsVN RT @LosLakers: 🔨A 🔨L 🔨E 🔨X 🔨C 🔨A 🔨R 🔨U 🔨S 🔨O 🔨 RT @LakersReporter: Jemerrio Jones continues to play well, and Luke Walton has rewarded him by keeping him on the court for the entire quar… RT @LakersReporter: * @SouthBayLakers call up Jemerrio Jones grabbed a board on one end, and found Johnathan Williams on the other for his… End of one. https://t.co/vXtuzzB9gm RT @LakersReporter: The Warriors are locked into playoff mode defensive intensity tonight against a Lakers team missing their 5 best player… Ball is up. #LakeShow https://t.co/TwVwfqEK20 The Marathon Continues 🏁 https://t.co/IMG6hICU0T Rest In Peace. https://t.co/D6mVOfTh7N Fresh lineup tonight. #SuitingUpTogether https://t.co/YqJarVq8Li Nipsey on the ❤️ pregame https://t.co/Y70pnkEn9v @AFNtelevision 🇺🇸🇺🇸🇺🇸 RT @AFNtelevision: #Lakeshow 🔥🆙\n\n@Lakers game is LIVE on @AFNtelevision #ForTheTroops🇺🇸 overseas🌍 https://t.co/R5Ol2G52e3 Time to tip off the final homestand of the season! \n\n📺: TNT\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/haW8Wq5n3F E N E R G Y https://t.co/DxtSeIXmeO RT @LakerGirls: Lakers vs. Warriors tonight! #LakeShow https://t.co/Km7mxCg6Mr RT @SpectrumSN: Luke Walton with tonight's availability, the game plan against the #Warriors and more ahead of tip-off! https://t.co/wbopHv… RT @LakersReporter: Update: Bullock is out, and Chandler is available. https://t.co/Qz55sVfZVk RT @LakersReporter: Kyle Kuzma is out tonight with the left foot tendinitis. Reggie Bullock is now questionable with a stiff neck. Tyson Ch… Gold. https://t.co/P6HbfBHTUP Thank you @Wishshopping for outfitting STAPLES in gold. The future is bright! 🌟 https://t.co/eiyuNFEUsG One more against the defending champs tonight at 7:30 PT!\n\n📺: TNT\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/fJ14OaSkrK RT @LakersGaming: Under the bright lights.\nFeet on the hardwood.\nA proper introduction.\n#LakersGaming https://t.co/HLyIztKJHW As part of @Delta's Salute To Our Troops program, Petty Officer First Class Anthony Aviles of the US Coast Guard got a peek behind the purple and gold curtain. https://t.co/pz30XNaA9X RT @Lakers: Career games have come recently for @ACFresh21, but the routine that got him there has always remained the same.\n\n☑️ Shoot earl… Moe Wagner talks about his road from Berlin to Los Angeles in this month’s issue of the Lakers Insider, presented by @GetSpectrum: https://t.co/67IrnikhI7 https://t.co/kurtFyZ8Q8 🎥 Kentavious Caldwell-Pope finished with a team-high 23 points against the Thunder, shooting 50% from behind the line. https://t.co/emPepxgYqZ 🎥 Lakers can't keep up in the second half as the Thunder pull away, dropping this one 119-103. https://t.co/Gb2lzjHfn3 Back to L.A. for the final four games of the season. https://t.co/clzE8dgQ5W AC brings the boom in the House of Thunder! 💥💥💥\n\n#LakeShow (📺: @SpectrumSN &amp; TNT) https://t.co/gbCHfj9W6F RT @LosLakers: #CARUSHOWWWW 🔨🔨🔨 12 minutes remain in this year's road schedule. \n\nKCP: 17 pts\nRondo: 7 pts, 9 reb, 8 ast https://t.co/UVNEXHB7F3 Rondo hops in the passing lane and flushes it home\n\n#LakeShow (📺: @SpectrumSN &amp; TNT) https://t.co/427IrKjjYU Close one at the half in OKC.\n\nKCP: 12 pts\nRondo: 6 reb, 6 ast https://t.co/bP0fv8le3i #LakeShow roll off seven unanswered for a 50-48 lead. 🎯 https://t.co/SR51PgVtNL Follow it home, big fella!\n\n#LakeShow (📺: @SpectrumSN &amp; TNT) https://t.co/5ztOuWFvrM KCP to Caruso in transition!\n\n#LakeShow (📺: @SpectrumSN &amp; TNT) https://t.co/B5gD9c1c7T 📍MoeKC\n\n@moritz_weasley: 8 pts, 3 reb https://t.co/WsoUpXjxHV RT @LakersReporter: LAL have battled back to tie the game at 21 after trailing by 11 early. Westbrook has missed 4 straight FG’s after star… Battling Back #LakeShow https://t.co/Xg8iyMmNTK RT @LakersReporter: Moe Wagner has made a pair of 3’s already, and rimmed out on a 3rd. He added a 2 and leads LAL with 8 early points as t… Ball is up. #LakeShow https://t.co/r9n9albA5J #SuitingUpTogether https://t.co/bDa9rXgh4Z KCP https://t.co/TtYtiUCKAN All set for the final road game of the season! \n\n📺: @SpectrumSN in L.A. TNT nationally\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/cbzni5d3ce Let's get down to business https://t.co/nLvo7Mv4ye RT @LakersReporter: Kyle Kuzma is out tonight, joining LeBron, Lonzo, Ingram, Hart and Chandler. RT @SouthBayLakers: Always bringing joy and laughter.\n\n#JemerrioJones | #LakeShow https://t.co/Apl7kzct8Z RT @LakersReporter: Nipsey Hussle’s music has been blaring from the Lakers locker room since the team arrived at the arena in Oklahoma City… 📍 Thunderdome https://t.co/JjucHZkhV2 RT @Lakers: Flashy dunks, Lance making ‘em dance, and a little bit of history. Here are the top plays of March, presented by @budweiserusa… Career games have come recently for @ACFresh21, but the routine that got him there has always remained the same.\n\n☑️ Shoot early\n☑️ Recalibrate\n☑️ Get ready to go to war for 48 minutes https://t.co/p86RAdaFPH RT @LakersGaming: Almost ready to hit our new home court. #LakersGaming ⭐️ https://t.co/cHNfAuV7K7 Season's final game outside of L.A. tips off at 5 PT!\n\n📺: @SpectrumSN in L.A. TNT nationally\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/vr6legwe4M RT @MagicJohnson: He was tech savvy and opened a community center in south central to foster STEM education and provide opportunities for y… RT @MagicJohnson: Nipsey Hussle was a talented entertainer that used his celebrity to shine a light on his community and give back. He will… RT @MagicJohnson: I was so proud of Nipsey Hussle who became an astute businessman and created jobs for people who lived in South Central.… Flashy dunks, Lance making ‘em dance, and a little bit of history. Here are the top plays of March, presented by @budweiserusa https://t.co/JUIzqp3vA5 \"Nip became my favorite rapper in high school. ... I was lucky enough to befriend one of my idols and get to know him for the past two years.\" - @kylekuzma\n\nhttps://t.co/EaydIQ4PrJ Lakers are on the road, which means you have a chance to win free tickets and free wings! \n\nDownload the Lakers App and find Lakers Wingman under the “More” tab. \n\nDetails: https://t.co/PFxzSoVUPi https://t.co/XDAj4NMW8M RT @Lakers: 🎥 Alex Caruso tallied a career-high 23 points to go along with his 6 assists and 4 steals against New Orleans #LakersWin https:… ⚡️ “Caruso Explodes For Career High in Win vs Pelicans” by @Lakers\n\nhttps://t.co/OEuQYb7Qoe Big second half fuels the #LakersWin in NOLA!\n\nSee it all on Lakers Gameday, presented by @Delta: https://t.co/qaAofkF2ps https://t.co/nx5eoiyIPU Artist. Activist. Angeleno.\n\nL.A. mourns the loss of one of our own, Nipsey Hussle. https://t.co/7DovnRkayn Alex Caruso constantly slammed onto the hardwood, and Rajon Rondo received mid-game forehead stitches.\n\nThe point guards' toughness and combined 47 points led a huge #LakersWin.\n\nhttps://t.co/rBQG2VSA8V 🎥 Rajon Rondo finished with 24 points and 12 assists in tonight's #LakersWin against the Pelicans. https://t.co/lcHe6ly2we RT @SpectrumSN: Luke Walton on @ACFresh21's performance and his takeaways from today's win. https://t.co/W0uWV8mRMv 🎥 JaVale McGee dropped 23 points and grabbed 16 boards in tonight's big https://t.co/FwtV3nlzYE #LakeShow tie the largest win of the season with a 28-point no-doubter in NOLA.\n\nhttps://t.co/tZlpBGkJJY 🎥 Alex Caruso tallied a career-high 23 points to go along with his 6 assists and 4 steals against New Orleans #LakersWin https://t.co/BWSpJM4p7O #CaruShow\n\n@ACFresh21 | #LakeShow https://t.co/XBwFOmCSlq 🎥 Short-handed Lakers hop out in front and never looks back to beat the Pelicans, 130-102 #LakersWin https://t.co/u3z5myIZQB RT @SouthBayLakers: From @NBAGLeague draft pick to making his @NBA debut 5 months later. What a ride, Jemerrio Jones. 👏\n\n#SBLakers | #LakeS… RT @LosLakers: ¡Bienvenido a la liga, Jemerrio! https://t.co/XfamSJ7Xxt #LakeShow take the season series with a 28-point rout. \n\n@RajonRondo: 24 pts, 12 ast\n@JaValeMcGee: 23 pts, 16 reb\n@ACFresh21: 23 pts, 4 stl https://t.co/GnyfmzCUP5 Jemerrio Jones scoring the first NBA points of his career is our @budweiserusa moment of the week. https://t.co/mkhImZLAtH You want to talk about toughness?\n\n@ACFresh21 isn't afraid to sacrifice his body for the team. https://t.co/9zers5o4B1 Jemerrio Jones checks in for his NBA debut. #LakeShow Nothing fresher than a new career-high.\n\n@ACFresh21 with 23 points and counting heading into the fourth. https://t.co/zOAYN63e1r #LakeShow ➕2️⃣1️⃣\n\n@JaValeMcGee: 23 pts, 14 reb\n@ACFresh21: 23 pts, 4 stl \n@RajonRondo: 21 pts, 10 ast https://t.co/WyoKvGJVnD Steal &amp; slam by @ACFresh21!! \n\n#LakeShow (📺: @SpectrumSN) https://t.co/I2ADUUCuFj RT @LakersReporter: Rondo is getting sutures in the locker room for a laceration to the forehead. He will be available to return. 😤😤😤 https://t.co/IHUf72F3EJ Make it a 14-point #LakeShow lead and a career-high 20 points from @ACFresh21! RT @LakersReporter: A 20-11 run to start the 3rd Q has LAL up 81-73 despite Rondo (21 points, 10 assists) leaving early in the period after… JaVale drops the 🔨!!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/UUbOv2KtsO Strong first half finish by @RajonRondo \n\n#LakeShow (📺: @SpectrumSN) https://t.co/DAujPvHREs Fellas filling the box score 📈\n\n@CaldwellPope: 19 pts\n@RajonRondo: 14 pts, 9 ast\n@JaValeMcGee: 12 pts, 9 reb\n@ACFresh21: 11 pts https://t.co/Mmk48Ub3gU RONDO &gt; 🚨🚨🚨 Rondo lobs it up for McGee!!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/3KAbe5BY5R RT @LakersReporter: Alex Caruso has all 11 of his points in the 2nd Q, leading LAL to a 40-35 lead at the 6:53 mark. He’s 2 for 2 from 3. Strong start from the veteran guards. \n\n@CaldwellPope: 11 pts\n@RajonRondo: 9 pts, 4 ast, 3 stl https://t.co/k2KDPfR6rH Big fella with an even bigger wingspan! \n@JaValeMcGee ➕1️⃣\n\n#LakeShow (📺: @SpectrumSN) https://t.co/S96uFPzl7A RT @LakersReporter: KCP continues the strong offensive rhythm he’s been in of late that eluded him for much of the season, scoring 11 of LA… Go ahead then, @JaValeMcGee! https://t.co/UKGvXxYWoD Ball is up. #LakeShow https://t.co/1lAm5GVmfa #SuitingUpTogether https://t.co/LrtgJHKsa9 ⚜️ Time for tip-off from the Crescent City! \n\n📺: @SpectrumSN\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/ItwhMPNZYl #LakeShow Rollin' https://t.co/by3inUDb62 Fresh face on the squad https://t.co/mUPKaXHSjU RT @LakersReporter: It’s left foot tendinitis for Kyle Kuzma. Luke Walton said Moe Wagner would start in his place. Meanwhile, Lance Stephe… A rebounding magnet at 6-foot-5, Jemerrio Jones ranked 6th in the G League on the boards &amp; played all 5 positions for the @SouthBayLakers.\n\nhttps://t.co/0eOIc07NtA 📍N O L A https://t.co/85TtI9Nmye RT @LakersReporter: Jemerrio Jones is the fourth @SouthBayLakers player to be called up by the Lakers this season (Johnathan Williams, Andr… RT @SouthBayLakers: “I come from nothing. I come from the struggle, so I know what it takes.”\n\nJemerrio Jones fears nothing and is ready to… OFFICIAL: Lakers sign Jemerrio Jones \n\nhttps://t.co/OubyerypNZ LA clashes with NOLA today at 3 PT!\n\n📺: @SpectrumSN\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/LTpSo5ZBJC “After consulting with our team doctors and medical staff, we have decided to hold LeBron out of games for the remainder of the season.\n\n\"This decision will allow his groin to fully heal, and is best for the future success of both LeBron and the Lakers.\"\n\nhttps://t.co/6Z5DsXMFKt RT @LakersReporter: Magic Johnson statement: “After consulting with our team doctors and medical staff, we have decided to hold LeBron out… RT @Lakers: 👑🔨 https://t.co/YTWIUwT3xs The latest @PC1LakersPod is available now! \n\n🎧: https://t.co/bttP050Wiu https://t.co/tr9yVNbpUB RT @Lakers: 🎶Sing it rooks! 🎶 https://t.co/P8ZQlpcKsO RT @Lakers: Clear the runway! https://t.co/6mUGnBmk5G ⚡️ “Lakers Defeat Hornets” by @Lakers\n\nhttps://t.co/Q0nT0BmH8M Rajon Rondo dished out a season-high 17 assists as the Lakers took care of business against the Hornets. @JoeyARamirez and @LakersReporter have all the details from the Lakers win. https://t.co/1HjhkeDJH8 RT @BillieJeanKing: @Lakers @KingJames Wonderful to meet LeBron and a great Lakers win! Three Lakers scored 20-plus points, while one, @RajonRondo, tied the franchise's most assists in 21 years.\n\nhttps://t.co/6mQmakLrdt 🎥Kyle Kuzma talks about the Lakers efficient shooting night and the chemistry behind another 30+ assist game. https://t.co/CUFZFUbRP0 🎥LeBron James gives his thoughts on the Lakers infectious ball-movement and Rondo's superb leadership. https://t.co/FIpVgGT664 🎥 After a well-rounded win, Luke talks about the play from the “G League All-Stars.” #LakersWin https://t.co/VFxdY8WpRa 🎥 Kentavious Caldwell-Pope continued his hot shooting tonight against the Hornets, dropping 25 points on 60% shooting from deep. #LakersWin https://t.co/HnK2028pXF 🎥 Lakers dominate the Hornets through shooting and defense, winning their third straight at home, 129-115 #LakersWin https://t.co/h5UIGCIBhk 🎶Sing it rooks! 🎶 https://t.co/P8ZQlpcKsO RT @LakerGirls: We’ve got that #LakersWin feeling! https://t.co/1FVG4x0fFA LeBron drops 11 of his 27 points in the fourth, icing a double-digit dub for the #LakeShow. \n\nhttps://t.co/9gYWYnb3Jj 🐐➕🐐 https://t.co/bq0bLDmhEM The whole crew steps up to make it a #LakersWin 💪\n\n@KingJames: 27 pts, 9 ast\n@CaldwellPope: 25 pts\n@kylekuzma: 20 pts\n@StephensonLance: 14 pts, 13 reb\n@RajonRondo: 17 ast https://t.co/W8iozNmMQf McGee with the follow slam!!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/IW6sC91ecF Getcha popcorn ready for the #LakeShow 🍿 https://t.co/4WWfNIzWws RT @LakerGirls: Routine scenes! #LakeShow https://t.co/kRtSdU7v8F #LakeShow past the 💯 mark entering the fourth.\n\n@CaldwellPope: 25 pts, 6 3PM\n@kylekuzma: 20 pts\n@KingJames: 16 pts https://t.co/Jihpr3Rq27 Reward the big man for running the floor!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/LyTkj9UWQL Too easy for JaVale\n\n#LakeShow (📺: @SpectrumSN) https://t.co/KHxUSnoT9n Royal Flush 👑 https://t.co/attsDDfzKs #LakeShow ➕🔟\n\n@CaldwellPope: 17 pts, 4 3PM\n@kylekuzma: 15 pts\n@StephensonLance: 11 pts, 5 reb https://t.co/4qEQ42DgjL All the way 🆙 https://t.co/cj2NrwlSzc 👑🔨 https://t.co/YTWIUwT3xs 🚂 Coming through!! \n\n#LakeShow (📺: @SpectrumSN) https://t.co/Aq78DaaUcZ 🚧 @KingJames steamrolling his way through traffic! 🚧 🔥 @StephensonLance ends the quarter the right way https://t.co/6TLkrJ73R5 Kenny &amp; Kuz with the early heat! \n\n@CaldwellPope: 11 pts\n@kylekuzma: 10 pts https://t.co/5BOvzpKk6F Kuz rises for another one-handed slam! \n\n#LakeShow (📺: @SpectrumSN) https://t.co/mAwz0LLK05 😤 Let 'em know @Iam_J3!! https://t.co/OnoWxondJo Clear the runway! https://t.co/6mUGnBmk5G 0️⃣➕2️⃣3️⃣ https://t.co/1532JkiiaJ 🔨 🔨 🔨 \n\n#LakeShow (📺: @SpectrumSN) https://t.co/D3EZF5TrEz Kuuuz with the breakaway jam to open this one up! Ball is up. #LakeShow https://t.co/2HcFmE8CfA #SuitingUpTogether https://t.co/bhymoD2kGY All set for some Friday Night hoops! \n\n📺: @SpectrumSN\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/gvgXSGwGIe 🔥🔥🔥 #LeBronWatch https://t.co/zcQGOvyzgg #LakeShow comin' at ya from @STAPLESCenter https://t.co/AdKu4S7NXu Kobe 4 WIZENARD PE #LakersSneakerCam https://t.co/VJIcIyp5r0 RT @SpectrumSN: Luke Walton on the biggest factor of tonight's game and the #Lakers starting lineup. https://t.co/2WomnRsK8w Five-time NBA champion ✔️ \nAcademy Award winner ✔️ \nNew York Times bestseller ✔️\n\nCongrats to @kobebryant on continuing to be #MoreThanAnAthlete! https://t.co/W7MBrZaQQW Them boys up to somethin' https://t.co/0OWdQR53Dx 👑💧 https://t.co/Wy05Km6GqX 🎥 @MagicJohnson visits Crenshaw High School for something bigger than basketball.\n\nCatch it on tonight's all-new #BackstageLakers, following the postgame show on @SpectrumSN https://t.co/ZwwJFRcZRJ RT @LakersCommunity: One of our own, Kiesha Nix, represented the Lakers Youth Foundation at yesterday’s #HerTimeToPlay event with @kobebrya… 🤾‍♂️🎽🏆 It was an unforgettable day for 200 local kids, who played dodgeball, tug of war and much more with their favorite Lakers and celebrities. https://t.co/eqMKYvY087 Our favorite 90s stars teamed up with our guys to compete at this year’s nostalgia-filled Field Day, presented by @uclahealth! #TeamUCLALakers https://t.co/H5MMAaDrfb Lakers Basketball in DTLA tonight at 7:30 PT!\n\n📺: @SpectrumSN\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/YEQAhThTCm “Blocking a shot can really demoralize a person and defer them from coming to the rim the rest of the game.”\n\n@JaValeMcGee on the art of the swat, as told by senior writer @KevinDing.\n\nhttps://t.co/7ttKipLBvz Camp Lakers, presented by @UCLAHealth, is back for it's 20th summer providing young players with the ultimate #LakeShow experience!! \n\nDetails: https://t.co/cjoWjYGQvo https://t.co/2OTra79CUq RT @joshhart: Road to recovery ✊🏽 BREAKING: Josh Hart underwent a successful ultrasonic debridement procedure on his right knee patellar tendon this morning.\n\n\nHart is expected to make a full recovery and return to basketball activities in approximately 12 weeks. https://t.co/Q5FzDmrYjO Happy birthday, Coach! 🎂🎉 https://t.co/UVUU7lpIAn That's all from Salt Lake City. https://t.co/8TUx6zuhRK No 👀 between-the-legs dish by AC 🤯\n\n#LakeShow (📺: @SpectrumSN &amp; ESPN) https://t.co/OkSCvOKAh0 .@ACFresh21 drops the hammer!! \n\n#LakeShow (📺: @SpectrumSN &amp; ESPN) https://t.co/kRdsDiLb7S RT @SouthBayLakers: Ok, @ACFresh21.\n\nWe see you. 👀 RT @LakersReporter: A big 🔨 from @ACFresh21 had the crowd buzzing, thanks to an alley-oop toss from his @SouthBayLakers teammate Scott Mach… One quarter remaining here in Utah. https://t.co/nWNcJs9exU RT @LosLakers: El gancho de @JaValeMcGee recorta el déficit de los Lakers https://t.co/kBYkX9iubq First 24 minutes are in the books. https://t.co/aJX0llXbCO RT @LakersReporter: Good start for rookie @moritz_weasley, who has 8 points on 3 of 3 FG’s off the bench, with his 3-pointer keeping LAL wi… 🚨 🚨 ALEX CARUSO 🚨 🚨 \n\n#LakeShow (📺: @SpectrumSN &amp; ESPN) https://t.co/tZMlmdHio0 Kuz isn't wasting time, with a dozen points in the opening quarter. https://t.co/R2PXbQjEP7 RT @LakersReporter: Alex Caruso hit a tough, hanging 3 at the 1st Q buzzer - his 2nd 3 of the period - to trim the deficit to 32-25 after 1… 🚫 🚫 🚫 \n\n#LakeShow (📺: @SpectrumSN &amp; ESPN) https://t.co/f80gSNU4Su Kyle Kuzma: Bank Manager 🏦🏦 Ball is up. #LakeShow https://t.co/VVM64YjDjd Make ‘Em Dance Lance gets the start in the House of Jazz\n\n#SuitingUpTogether https://t.co/Jf9LHQMgsg Time to get it started in SLC!\n\n📺: @SpectrumSN in L.A. ESPN nationally\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/Qs621mpin2 Business on the bottom, party on top https://t.co/JMLcW0bcR6 Break it down @isaacbonga! https://t.co/Jwjtf4Xocc ✍️ #ThisIsWhyWePlay https://t.co/yntyIrUyid RT @SpectrumSN: Luke Walton with an availability update and dealing with the #Lakers injuries throughout the year. https://t.co/iOaFX0l2qX RT @SouthBayLakers: First road trip with the #LakeShow\n\n@_ScottMachado | #SBLakers https://t.co/h9Dp3jKrV3 All smiles 😀 https://t.co/gG6Pr8oGYL Strollin' In https://t.co/O3L61THXbZ 👔 #LakeShow https://t.co/ASFtVPlobL Music &amp; basketball. The Lakers #BeatsStudio3Wireless from @beatsbydre are here. https://t.co/Zk5IYukFPl LeBron James is out for tonight's game at Utah. RT @LakersReporter: New Story: \"Basketball Gods Still Watching” - how LeBron is trying to lead the Lakers despite playoff hopes being gone,… RT @JaValeMcGee: 💧 https://t.co/tT9D9x62Dg #LakeShow meets Salt Lake tonight at 7:30 PT!\n\n📺: @SpectrumSN in L.A. ESPN nationally\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/Qs621mGTeA ⚡️ “Lakers Pull Together To Defeat Wizards”\n\nhttps://t.co/u93fQEbBfm 🎥 Joey Ramirez and Rodrigo Azurmendi break down the Lakers win over the Wizards, including KCP's 29 point performance, and Lance's highlight crossover that had the entire bench losing their minds. https://t.co/b0HkTulf3g Chalk up the #LakersWin at @STAPLESCenter!\n\nSee how they did it on Lakers Gameday, presented by @Delta: https://t.co/wLBUkqKgfI https://t.co/l1V9S9kEHa “I told Lance [to] make ‘em dance early in the season, and he did that tonight.\" - @KingJames\n\nhttps://t.co/jb6lXsVpl0 RT @LakerGirls: Cheesin’ over this #LakersWin! 😁 https://t.co/UtZLWpbY0C 🎥Lance Stephenson walks us through his highlight crossover. https://t.co/SGZUHCPxOD 🎥JaVale McGee discusses the defensive effort tonight and his resurgence in the last few games. https://t.co/vjJat4AwWg 🎥LeBron James gives his thoughts on Lance Stephenson's crossover. https://t.co/lLxirRYrnJ 🎥 Luke compliments the team’s 37 assists and individual defense. #LakersWin https://t.co/8nYm3t5NWG 🎥 JaVale McGee had another dominant night in the paint, finishing with 20 points, 15 rebounds, and 4 blocks #LakersWin https://t.co/JdEDTYDv5X 🎥 LeBron James totaled 23 points, 14 assists, and 7 boards tonight against Washington #LakersWin https://t.co/atkUdCuW5U 🎥 Kentavious Caldwell-Pope dropped a team-high 29 points with 6 triples in tonight's #LakersWin https://t.co/AhkZg2OGEU LeBron controls the offense with 23 points and 14 assists, as the #LakeShow defends home court. \n\nhttps://t.co/nlR4rnWwgS 🎥 Lakers combine for 37 assists tonight in their 124-106 victory over the Washington Wizards #LakersWin https://t.co/fiD5Sev7Bf That #LakersWin feeling 🙌\n\n@CaldwellPope: 29 pts, 6 3PM\n@KingJames: 23 pts, 14 ast\n@JaValeMcGee: 20 pts, 15 reb https://t.co/VhigUZtnPE .@_ScottMachado sinks the and-1 for his first bucket as a Laker! https://t.co/O5Xxns6T3B Pierre with the flush\n\n#LakeShow (📺: TNT) https://t.co/wIZv4ih4TT #LakeShow widen the lead heading into the fourth. \n\n@CaldwellPope: 27 pts, 6 3PM\n@KingJames: 19 pts, 10 ast, 6 reb\n@JaValeMcGee: 14 pts, 12 reb https://t.co/eLVy0o2Mgi RT @LakersReporter: KCP has made 18 3’s in his last 4 games, including 6 tonight, with 3 minutes left in the 3rd Q. He has 27 points to lea… LeBron &amp; JaVale making it look too easy\n\n#LakeShow (📺: TNT) https://t.co/bC52fiZiWt RT @LakersReporter: An 8-2 run to start the 3rd Q has LAL up to its largest lead of the game at 75-58. LAL are shooting 55.1% to the 42.9%… Still shook from @StephensonLance’s ankle-breaker 🤯🤯🤯 https://t.co/bRmNvUedc3 #LakeShow up double figures at the break\n\n@CaldwellPope: 19 pts, 4 3PM\n@KingJames: 12 pts, 7 ast, 5 reb https://t.co/XuGv5USCLQ Punch it home, @KingJames! 👑🥊 https://t.co/Vgu6kTfso0 #LakeShow open up a double-digit lead. \n\nKCP's 16 pts make it a 57-46 count midway through the second quarter. 😃 @JaValeMcGee with the only appropriate reaction https://t.co/X01xyWIYIG Put ‘em on ⛸ &amp; break out the 🕺 https://t.co/r0BzSVeHiv Lance making them dance is our @budweiserusa Moment of the Week https://t.co/kr5tgZt3kf Got 'em https://t.co/dRUOIZt89J RT @LakersReporter: BORN READY No shortage of offense to start this one. \n\n@CaldwellPope: 13 pts (5/6 FG)\n@JaValeMcGee: 8 pts, 5 reb https://t.co/scanaqRG9J LANCE STEPHENSON: BREAKER OF ANKLES RT @LakersReporter: LAL open 13 for 22 from the field tonight (59.1%), a departure from their early shooting struggles of late. Both McGee… Touchdown connection from McGee to KCP!\n\n#LakeShow (📺: TNT) https://t.co/J8P0VHOMZl The bench liked that one 🙌 https://t.co/gXMJRJL2DS JaVale with the grown-man takeaway and full-court outlet! 😤😤😤 JaVale skies for the 🔨 \n\n#LakeShow (📺: TNT) https://t.co/g0CsPDQwkN Ball is up. #LakeShow https://t.co/AliMUwHtkO #SuitingUpTogether https://t.co/5ZBpqjoJpB Game time in the heart of Los Angeles! \n\n📺: TNT\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/CdTzRYuVcI 👑 #LakeShow https://t.co/ijQK11bxoY Time for the #LakeShow https://t.co/27n4bKt7dj RT @Lakers: Will Scott joins @JoeyARamirez to talk about Kyle Kuzma, JaVale McGee, and tonight's opponent, the Washington Wizards, presente… RT @SpectrumSN: Luke Walton gives @LakersReporter an update on tonight's availability and game plan against the #Wizards. https://t.co/5nUH… Ready to Dance 🕺 https://t.co/rmK43q4hoN RT @LakersReporter: LeBron will start tonight vs. Washington. Luke Walton said they’ll determine his status for tomorrow night’s game at Ut… Will Scott joins @JoeyARamirez to talk about Kyle Kuzma, JaVale McGee, and tonight's opponent, the Washington Wizards, presented by @Delta https://t.co/XnGYket65y #LakeShow host the Wiz on national TV tonight at 7:30 PT!\n\n📺: TNT\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/4wNjonWZek The golfers are out and the sun is shining at the 29th Annual Golf Tournament presented by @MIRaudiovideo ⛳️ https://t.co/TVlHSTsnWk Justin Jimenez's sons bought him Lakers tickets for his birthday. \n\nDad made 'em proud by sinking the $45,000 @parkmgm Big Shot Jackpot. \n\nhttps://t.co/jymIYnELJn RT @SouthBayLakers: The accolades keep coming!\n\n@_ScottMachado has been named @NBAGLeague Player of the Month for averaging 22.8 points and… We couldn't have had more fun at our annual @LakersCommunity Field Day! Thanks to everyone who made it a blast!!\n\n@UCLAHealth | #TeamUCLALakers https://t.co/59hKVOPkft Congrats to our @budweiserusa Legendary Game Night Experience winners! \n\nNext game with the experience is 4/4. https://t.co/ClRJp8iyc6 RT @Lakers: Justin Jimenez is going home with $45k after hitting the Big Shot Jackpot, presented by @parkmgm https://t.co/SoGAQ3kGli RT @LakerGirls: #LakersWin!! https://t.co/W5FevDTPqQ LeBron James tallied his 8th triple-double of the year to go along with Kyle Kuzma's 29 in the Lakers 111-106 victory over Sacramento. @JoeyARamirez and @LakersReporter have all the details from the win. https://t.co/ErwbJpYPMi #LakeShow ⬆️\nSacramento ⬇️\n\nSee everything from the #LakersWin on @Delta Gameday: https://t.co/ROJyZNjoQZ https://t.co/PALSTdUZLM LeBron and Kuz put up matching 29-point displays, as the #LakeShow roll past their division foes. \n\nhttps://t.co/pdmtjuGHXL We’re smiling about the W too @diplo. Nice 👕.....hey @WishShopping, can we get one? #LakeShowWish https://t.co/C5KLXSSISV 🎥Kyle Kuzma talks about his offensive rhythm that led to his 21 point 3rd quarter. https://t.co/FemxTTUHeT 🎥LeBron James talks about the 2nd half offensive surge and JaVale McGee's continued success on the defensive end. https://t.co/c0JcwpkEiA 🎥 Luke talks LeBron James’ triple-double and how JaVale McGee anchors the defensive play. #LakersWin https://t.co/jj0qe04FTz 🎥 Kyle Kuzma caught fire in the third quarter, finishing with 29 points and 6 boards tonight against Sacramento #LakersWin https://t.co/yk1wJZhoCT 🎥 LeBron James dropped another triple-double, posting 29 points, 11 rebounds, and 11 assists in tonight's #LakersWin over the Kings. https://t.co/Mw3f3PY9Ha 🎥 Behind a strong third quarter and some clutch free throw shooting down the stretch, the Lakers take down the Kings, 111-106 #LakersWin https://t.co/qsyN6ix8n3 LeBron drops his 8th triple-double of the season, as the Lakers take the season series against Sacramento. \n\nhttps://t.co/HTT4LbJq1u The King and Kuz reign supreme at STAPLES. #LakersWin\n\n@KingJames: 29 pts, 11 reb, 11 ast\n@kylekuzma: 29 pts https://t.co/kzks1WbT3j RT @LakersReporter: LeBron grabbed an offensive board (11 boards total, as part of his triple-double) with LAL up 3 and 37.5 seconds left,… Fresh finish by AC\n\n#LakeShow (📺: @SpectrumSN) https://t.co/YxjzfxjFmn Another one for the King's collection. https://t.co/bQVaOVg9xx AC with the reverse layup to make it a six-point lead with four minutes left! Justin Jimenez is going home with $45k after hitting the Big Shot Jackpot, presented by @parkmgm https://t.co/SoGAQ3kGli 🔥🔥🔥 #KuzControl has taken over DTLA with a 21-point third quarter! 🔥🔥🔥\n\n@kylekuzma: 28 pts\n@KingJames: 17 pts, 9 reb, 8 ast https://t.co/cPpOVWkmEd .@_ScottMachado checks in for his Lakers debut. RT @LakersReporter: Kyle Kuzma has 21 points in the 3rd Q. He was 3 for 10 at halftime, but 7 for 8 in the 3rd, including 4 of 5 3’s, towar… KCP finds LeBron for a powerful one-handed slam!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/Ql9QRlkqc0 RT @LakersReporter: Kuzma has 8 of his 17 points in the 3rd Q, with his 2nd triple putting the home team up 72-60 midway through the 3rd Q. #LakeShow open the half with 1️⃣1️⃣ unanswered. JaVale starting strong in the second half\n\n#LakeShow (📺: @SpectrumSN) https://t.co/ZJ1UduS1Pk Close contest through the first 24. https://t.co/FhzirNObgT 🔨 KYLE KUZMA 🔨 \n\n#LakeShow (📺: @SpectrumSN) https://t.co/1agnUoUo59 RT @LakerGirls: Superhero stance! #LakeShow https://t.co/dIf7ii2rQf Clear the lane!! https://t.co/1UjlkIbEXm This time it's Lance with the throwdown!!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/efouyqY65Y What a sequence!! LeBron recovers on defense and JaVale gets the easy slam!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/SeuqZK4dJt RT @LakersReporter: LAL are on a 9-0 run to start the 2nd Q, allowing their biggest lead at 31-20. LeBron has 9 points, 5 boards and 3 dime… 👑🚫👀\n\n@KingJames with the no-look drop-off for JaVale's slam! Defense fuels the #LakeShow to a first-quarter lead. https://t.co/yr0hINodSw LeBron flies down the lane for a one-handed jam!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/qMfcokLwu6 Count that for the King! \n👑➕1️⃣ Ball is up. #LakeShow https://t.co/DqqTrwRyTx Laced 👑 https://t.co/KFsEO154LJ #SuitingUpTogether https://t.co/NZ9j5Vdxmx Time for tip-off from STAPLES! \n\n📺: @SpectrumSN\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/Og9EKoJi95 JaVale gets ready, after a career high game on Friday. #LakeShow https://t.co/n0fHfLsKFc The #LakeShow hits the floor https://t.co/4kOQw7lIHj May 26, 2002: Western Conference Finals Game 4 vs. Sacramento Kings. Big Shot Bob comes up big at the buzzer for the win. @Budweiserusa is the Legendary Lager for Legendary Moments in Lakers History. https://t.co/o06kKc4up9 Lace em’ up Mo. #LakersSneakerCam https://t.co/Z9FGBLlR82 RT @LakersReporter: Update: LeBron is “available,” while Reggie Bullock is now out with plantar fasciitis. https://t.co/ZSg2Crprxr Driving intexticated is not worth it. Lakers fans, please be safe on the way to @STAPLESCenter!!\n\nFor more information visit: https://t.co/YSiIz6sBKR https://t.co/IGPQ4Qb8zW Sunday night hoops in DTLA at 6:30 PT!\n\n📺: @SpectrumSN\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/l7XiMOWtVt Willow was born premature at 22 weeks &amp; 14oz with just a 5% chance to live. Thanks to the doctors, nurses, &amp; staff of @UCLAMCH, she is now 5 &amp; living her best life as our #LakerGirl For A Day!\n\n📰: https://t.co/dNqDiPUgqx\n\n#TeamUCLALakers https://t.co/vGaFWlsAV2 🎥 JaVale McGee talks about setting two career-highs with 33 points and 20 rebounds. https://t.co/ZuxTlVs8Ac 🎥 Luke talks about what led to JaVale’s career-high night. https://t.co/Yo8bv91MvM 🎥LeBron James gives his thoughts about JaVale McGee's monster night. https://t.co/pkaeSQlp0g 🎥 LeBron finished with 25 points, 14 assists, and 9 boards in tonight's loss against the Nets. https://t.co/ivCLP9Lneb 🎥 JaVale McGee had himself a night, dropping a career-high 33 points and grabbing a career-best 20 rebounds to go with his 6 blocks against Brooklyn https://t.co/Peql3L6m45 🎥 Lakers keep it close but can't pull it out down the stretch, falling to the Nets, 106-111. https://t.co/LKTfNBW68o Career-highs on the scoreboard and the glass for @JaValeMcGee. \n\nPierre puts up 33 pts, 20 reb and 6 blk, but Brooklyn takes the win. https://t.co/c6ZZIK5zB2 RT @LakersReporter: McGee’s career game continues as he matches his career high on the glass with 18 boards, to go with his career high in… Adding to that career high. #LakeShow https://t.co/Uty8G5TtNc RT @LakersReporter: A 5-0 Lakers run out of a time out has them up 97-96, with Kuzma’s 3-pointer coming at the 5:40 mark before a Nets time… Caruso ➡️ LeBron\n\n#LakeShow (📺: @SpectrumSN) https://t.co/1NAx3qXeZX Have yourself a night, big man.\n\n@JaValeMcGee with a career-best 29 points on 13-of-15 shooting 💪💪💪 https://t.co/Z3XK2ncyD6 JaVale drops the hammer!!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/jubu8PzwLE RT @LakersReporter: JaVale McGee is 1 point short of a career high after catching yet another lob from LeBron to reach 27 points. James has… Defense on both sides as we head to the fourth. https://t.co/Cq10Ihls01 Chase down swat by the King!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/TbUnBEikBQ 👑🚫 https://t.co/rXhasbTLHA 🚨 LeBron Chase-down Swat! 🚨 JaVale getting it done on both ends!!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/DklkDb4J1a One-point game at the break.\n\nMcGee: 14 pts, 9 reb\nJames: 8 pts, 6 ast, 4 reb https://t.co/SpFGQu9mxS LeBron takes off for a two-handed flush!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/sfM0MWW5Uw Kuz from half court is our @budweiserusa Moment of the Week https://t.co/EBVh4WEt4A Big man's the first to double figures. \n\n@JaValeMcGee: 10 pts, 5 reb https://t.co/8XzcrStFiJ Kuuuz from the half-court line! 🤯🤯🤯 Fast start for @JaValeMcGee, who has all 🔟 Lakers points so far. Ball is up. #LakeShow https://t.co/Jdav9aDbrs 🔙🏡\n\n#SuitingUpTogether https://t.co/CDo8X8pjbT First #LakeShow game for @_ScottMachado https://t.co/m9aZcGIrwS Back in L.A. and ready to get it started! \n\n📺: @SpectrumSN\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/b3h2CBx8Ec The #LakeShow has returned to @STAPLESCenter! https://t.co/8U03MKRwjm RT @LakersReporter: Lance Stephenson is available to play tonight. Mike Muscala is now out due to a sore right ankle. RT @Lakers: Brian Shaw joins Joey Ramirez to talk about KCP's hot shooting, and the impressive play of Alex Caruso, presented by @Delta htt… RT @LakersReporter: Rondo, Bullock, LeBron, Kuzma and McGee will start tonight against Brooklyn. #LakeShow in the building https://t.co/XhrOcj3INJ RT @SouthBayLakers: All ready for his #LakeShow debut.\n\nNo. 10, @_ScottMachado. 🙌 https://t.co/Dre6nKigvH Brian Shaw joins Joey Ramirez to talk about KCP's hot shooting, and the impressive play of Alex Caruso, presented by @Delta https://t.co/wgpaQn68mE RT @LakersReporter: Josh Hart, out tonight due to the sore knee that’s been bothering him since January, will consult with team medical sta… RT @LakersReporter: Luke Walton said Josh Hart won’t play tonight (sore knee). LeBron will play, Tyson Chandler is available and Lance Step… Back on home court for the first time in two weeks tonight at 7:30 PT!\n\n📺: @SpectrumSN\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/hs5kLPpSxl RT @SouthBayLakers: Alumni in the building. 🙌\n\n@ACFresh21 | @_ScottMachado\n@IsaacBonga | @Iam_J3 https://t.co/sgplhGRSmt RT @SouthBayLakers: Taking the court in this heat tonight 🔥\n\nSouth Bay, Los Angeles. #OurWay https://t.co/3FW5mYPpRk Scott Machado joins the #LakeShow in the midst of averaging the G League's 2nd-most assists.\n\nhttps://t.co/tKJkgym345 Senior Writer @KevinDing on the Lakers’ search for consistent play, including the young players’ opportunity for development and lessons learned from LeBron.\n\nhttps://t.co/poigvkQtB3 🎥 New signee Scott Machado reacts to getting his shot with the Lakers. https://t.co/Rn2uclNqEQ 🎥 Luke Walton updates the team's health status, the addition of Scott Machado and looks ahead to the game against the Nets. https://t.co/Mpyd7gHdBV RT @LakersReporter: Machado after practice: “It’s a great feeling to be around guys that have been around the league a long time ... (I’m j… Welcome to the #LakeShow, @_ScottMachado https://t.co/OSaLCbKfOt Back 🏠 at the @UCLAHealthTC #LakeShow https://t.co/0dhAOePU1z RT @SouthBayLakers: You'll love his style, @Lakers.\n\n@_ScottMachado has the perfect mix of strength and finesse. 🙌\n\n#LakeShow | #SBLakers h… RT @SouthBayLakers: This is what it’s all about!\n\n@_ScottMachado breaks the news to his South Bay teammates that he’s been signed by the @L… BREAKING: Lakers Sign Scott Machado\n\nhttps://t.co/HtVfGbQq2Z Time to show out. The Lakers #BeatsStudio3Wireless from @beatsbydre are here. https://t.co/6iaz3bpn1r RT @LakersCommunity: The Lakers, Lakers Youth Foundation and @WishShopping celebrated the opening of the new STEMM &amp; Robotics lab at Crensh… Basketball has taken @moritz_weasley around the world, from his hometown Berlin to Ann Arbor to the Los Angeles Lakers.\n\nhttps://t.co/3TMxBYS3Cv RT @LakersReporter: I sat down with @moritz_weasley to discuss his childhood playing ⚽️ and 🏀 in Berlin, his decision to go to @umichbball,… 🎥 Kentavious Caldwell-Pope had his highest scoring game of the season, dropping 35 points with 8 three-pointers against the Bucks. https://t.co/JqqrY9OOF5 🎥 Lakers storm back in the second half but can't complete the comeback tonight, losing to Milwaukee, 101-115. https://t.co/x7n3U4yOB9 Kenny racks up a season-high 35 points, yet the road trip ends in a loss to the league leaders. https://t.co/a2RYT9EGjg RT @LakersReporter: KCP just set his new Lakers high in scoring by hitting his 8th 3-pointer towards 35 points. LAL are within 5 with 6:37… Make it 3️⃣1️⃣ for @CaldwellPope\n👌👌👌👌👌👌👌 16 unanswered points for the #LakeShow to claw back into this one. One quarter remains in Wisconsin. https://t.co/7zltXLc8fY KCP was 🔥 🔥 🔥 in the first half! https://t.co/XMWj5XuCTH 🔥🔥🔥 Kenny with a scorching 23-point first half🔥🔥🔥 https://t.co/hCZS3sqI5c RT @LosLakers: 🔥K🔥E🔥N🔥T🔥A🔥V🔥I🔥O🔥U🔥S\n\nCALDWELL\n\nPOPE RT @LakersReporter: KCP has been unconscious in this 1st half, now with 20 points in 17 minutes, on 8 of 12 FG’s with 4 3-pointers. LAL tra… Wagner and KCP turning defense into offense!\n\n#LakeShow (📺: @SpectrumSN &amp; NBA TV) https://t.co/gWkU8YtBVM RT @LakersReporter: KCP has 12 quick points off the LAL bench, with 3 FG’s at the rim and B2B 3’s, to trim Milwaukee’s once 13-point lead t… Through one in the 🦌🏠 https://t.co/5ixXjLIl6A 🎯🎯 https://t.co/1ShcZbJmDo 🐂👌\n\nBullock strikes from deep on the first possession of the game. Ball is up. #LakeShow https://t.co/zDls83XVOP Final game of the road trip.\n\n#SuitingUpTogether https://t.co/QZfY3nDNtv All set for tip-off in Cream City! \n\n📺: @SpectrumSN in L.A. NBA TV nationally\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/tsWezDUCVg Closing out the road trip #LakeShow https://t.co/Qzx342MaWJ Pass for me, I'll pass for you #ThisIsWhyWePlay https://t.co/AJcVBFqwJA #LakeShow take on the league leaders tonight at 5 PT!\n\n📺: @SpectrumSN in L.A. NBA TV nationally\n📻: 710 ESPN &amp; 1330 KWKW https://t.co/ywcESHDLhC RT @LakersReporter: Josh Hart and Tyson Chandler are both available to play tonight. Lance Stephenson will not play. #CaruShow https://t.co/imbdHyb5Me RT @Lakers: Check out the best plays from the last week, presented by @budweiserusa https://t.co/fKNh3jjRKO #LakeShow take on the league leaders tonight at 5 PT!\n\n📺: @SpectrumSN in L.A. NBA TV nationally\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/586MROYeET 📍🦌 https://t.co/OAqBhijbJt LeBron James (sore left groin) is out for tonight's game in Milwaukee. Check out the best plays from the last week, presented by @budweiserusa https://t.co/fKNh3jjRKO RT @SouthBayLakers: He’s our leader. He’s our engine.\n\nAnd now @_ScottMachado has been named @NBAGLeague Player of the Week for averaging 2… RT @Lakers: “You’re aware of people knowing the story, but you really aren’t aware of just how many people are cognizant of you… to have th… RT @SpectrumSN: Go behind-the-scenes as @KingJames makes history, passing one of his idols on the all-time scoring list on the latest #Back… Close finish at the Garden. \n\nJames: 33 pts, 8 ast\nKuzma: 18 pts, 8 ast\nCaruso: 12 pts, 5 stl, 3 blk https://t.co/vlJldRfJjg 💪 @ACFresh21 putting his body on the line in crunch time. 🔨 🔨 🔨 \n\n#LakeShow (📺: @SpectrumSN) https://t.co/6Smco7eFIc Poetry in motion 👑 https://t.co/F1H01zOcmr RT @LakersReporter: Caruso is up to 11 points with 3 boards, 2 assists, 4 steals and 3 blocks. He’s +13, trailing only LeBron’s +15. https:… J3 on the break!!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/yIKUgBIJef Up a couple with one quarter left at the Garden. \n\n@KingJames: 24 pts\n@kylekuzma: 18 pts, 8 ast https://t.co/vrZ6llYMK5 RT @LakersReporter: Reggie Bullock is 6 for 10 with a pair of 3’s towards 14 points with 5:40 left in the 3rd Q, one of his better games fo… Kuz drops the one-handed 🔨 \n\n#LakeShow (📺: @SpectrumSN) https://t.co/ucHZUJRnsu 🗽 https://t.co/QIt8V4sUQH First half in the books #LakeShow https://t.co/h7zSqGJMof #LakeShow in front at the half.\n\n@KingJames: 17 pts\n@JaValeMcGee: 10 pts, 6 reb https://t.co/SN0KCXB5a9 Throw it down, @JaValeMcGee!! \n\n#LakeShow (📺: @SpectrumSN) https://t.co/b2A1GlX7Hu RT @LakersReporter: Caruso +13. Cleared for takeoff ✈️ \n\n#LakeShow (📺: @SpectrumSN) https://t.co/gwpD1AoBSH No 👀 \n\n#LakeShow (📺: @SpectrumSN) https://t.co/XFs2JT18qw One quarter down in NYC. https://t.co/ZIUzUmpcPh Great hustle by the big man\n\n#LakeShow (📺: @SpectrumSN) https://t.co/2N45BwNE6S Full tear down https://t.co/0tdD04Ec4s RT @LakersReporter: LAL came out of the time out on a 7-0 run to tie the game at 11, as McGee had 2 hoops at the rim and Bullock a 3. Lift off 🚀 https://t.co/YfA1HY0s1w Ball is up. #LakeShow https://t.co/HmRMkckEta #LakeShow https://t.co/GIZmsLofsR Live from New York, it's Sunday morning.\n\n#SuitingUpTogether https://t.co/MDSj3hYKfU Time to wake up with the #LakeShow!\n\n📺: @SpectrumSN\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/O1IuIjJMvk 🔥🔥🔥 https://t.co/wZKaupBmsZ RT @LakersReporter: The Lakers get LeBron James and Josh Hart back for this game at New York (9 a.m. tip off on @SpectrumSN); both players… Dre made it to the Mecca https://t.co/42Y2LkA97W Dream big, little man #ThisIsWhyWePlay https://t.co/xrqFyGvSbl Garden Party https://t.co/ChaZHvUO0K Top o' the mornin to ya, New York https://t.co/nEuyecQw8U RT @JeanieBuss: Best news of the day 💜 @B_Ingram13 https://t.co/uYmRRzy5w1 We've got some early-morning #LakeShow at 9 am PT!\n\n📺: @SpectrumSN\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/uFNxfxCkuO RT @joshhart: 🙌🏽🙌🏽 my brother https://t.co/YTqOA2RFrs RT @ACFresh21: Great news !!! Let’s go bro 💪🏼@B_Ingram13 https://t.co/MXU8sLFdAB UPDATE: Brandon Ingram underwent successful thoracic outlet decompression surgery on his right arm today. The procedure was performed by Dr. Hugh Gelabert at the Ronald Reagan UCLA Medical Center.\n \nIngram is expected to make a full recovery prior to the start of next season. https://t.co/q3LgtJpVTB Perseverance is key, and no one knows that better than Andre Ingram. Hear what advice Andre has for young players on the @PC1LakersPod: https://t.co/hCo4CyBntV https://t.co/atm76jX9ze Send @ReggieBullock35 some birthday love!! 🎂🐂 https://t.co/oUCMfwvisz RT @SpectrumSN: “We played hard enough to win, we didn’t make enough shots to win.” \n\nLuke Walton with his post-game notes on the #Lakers 1… 🎥 Tough night for the Lakers as they can't hang on in the second half, dropping this one to Detroit 97-111. https://t.co/lazAHrZXoi RT @LakersGaming: We can get used to our new digs! 😎 #LakersGaming https://t.co/zPfLxTHthi Kuz hands out a career-high 10 assists, but Detroit takes this one. https://t.co/oZAskwBBVu RT @LakersReporter: Kyle Kuzma just set a career high with his 8th assist. Still 6 minutes to play in Detroit. Put it on his head, KCP!!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/mq7pxPw83Q Poster giveaway in Detroit! https://t.co/CsPoVMDUs0 RT @LakersReporter: KCP just got Thon Maker with a 🔨, off Kuzma’s 7th assist of the evening, plus the foul. LAL trail 87-79 (lead was 18 no… Rondo's packaged together 12 pts, 8 reb and 7 ast as we head to the fourth. https://t.co/Rc0RvVYLem RT @LakersReporter: Mike Muscala got his ankle re-taped in the locker room, and is back on the bench and available to return. Halftime in Michigan. https://t.co/BVb2cH3Nl0 Kuz scoops it in to beat the shot clock\n\n#LakeShow (📺: @SpectrumSN) https://t.co/dADtVDi7Y4 Lance with the icy cuff https://t.co/Nj67jIT26z Fire it over 🏀💨 https://t.co/mzZLeBI1x2 First quarter 📸 #LakeShow https://t.co/T7SvwikYFw First stanza in the books. https://t.co/dBuNEPq6bf Reggie throws it up, JaVale throw it down\n\n#LakeShow (📺: @SpectrumSN) https://t.co/lgdGvgDIYq Ball is up. #LakeShow https://t.co/BK43V6XFKl #LakeShow under the bright lights https://t.co/WsJ0tdFVEv #SuitingUpTogether https://t.co/jQWp9LgTkG Some Lakers Basketball to start the weekend, coming at you now! \n\n📺: @SpectrumSN\n📻: 710 ESPN &amp; 1330 KWKW\nhttps://t.co/TebqR2R1TI 📍 Motor City https://t.co/82KiY3w6Nw RT @LakersReporter: Reggie Bullock is available to play tonight in Detroit, while Lance Stephenson and Josh Hart join LeBron, Chandler, Ing… Former Michigan star @moritz_weasley returns to The Wolverine State. #LakeShow https://t.co/TLSciTui2E RT @kylekuzma: A lot of these kids came to my camp this summer glad their getting a chance to come to a game!!🙏🏽 https://t.co/SPfo6Lhgmg Our Flintstones always have time to inspire the next generation https://t.co/SYZTzLf955 Moe was raised on that Maize &amp; Blue \n#LakersSneakerCam https://t.co/HceByUf9PN 💪 https://t.co/nPhBscxx2R RT @KingJames: Salute you Dre!! So many you’ll help because of your resilience, work ethic  and relentless mental toughness. 🙏🏾‼️‼️‼️💯 http… “You’re aware of people knowing the story, but you really aren’t aware of just how many people are cognizant of you… to have that roar… that won’t get old to me. I’m still just grateful.” https://t.co/gjaBaZEl7B Injury Update from Detroit: \n- LeBron James (load management, groin) is out.\n- Josh Hart (right knee tendinitis) is questionable.\n- Reggie Bullock (left foot contusion) and Lance Stephenson (left foot, second toe sprain) are probable. Back on the hardwood at 4 PT in the Motor City!\n\n📺: @SpectrumSN\n📻: 710 ESPN &amp; 1330 KWKW\nhttps://t.co/VQx31e9OHS 🎥 Lakers can't keep pace in Toronto tonight, dropping the first game of a back-to-back, 98-111. https://t.co/R3ZUYEJWxz Final from 🇨🇦 https://t.co/0l3GFaiy5I Two-man transition game between @ACFresh21 and @KingJames\n\n#LakeShow (📺: @SpectrumSN &amp; TNT) https://t.co/SGRMtvwAUk 5-for-5 from the field.\n5-for-5 from the stripe.\n\n@ACFresh21 has a personal-best 16 points heading into the fourth. https://t.co/gYR4dlxmD0 Back within striking distance with 12 left. \n\nJames: 22 pts\nCaruso: 16 pts, 5/5 FG https://t.co/up6FZLfmtf RT @LakersReporter: New career high in points from @SouthBayLakers 2-way player Alex Caruso, as he reaches 16 with his 4th and 5th FT makes… Kuz finds McGee for an easy flush\n\n#LakeShow (📺: @SpectrumSN &amp; TNT) https://t.co/lCqCLtKExi RT @LakersReporter: LAL got a 4-point play from Reggie Bullock to start the 3rd Q on the right foot, trimming the deficit to 7. All eyes on the King 👑\n\nLeBron gets the @NBAonTNT IsoCam treatment in the second half! \n\nhttps://t.co/Pn9b90sBaS Freshness in action. \n\n@ACFresh21: 14 pts, 5/5 FG https://t.co/oa2NnBVkhP Stand up for 'em 👌 https://t.co/ZaHhmLtU2b RT @SouthBayLakers: AC FRESHNESS 🔥🔥🔥 🎯 @ACFresh21 for the lead! \n\nHe's got 14 points on 5-of-5 shooting. 🔥🔥🔥🔥🔥 Two-handed hammer for the King!!\n\n#LakeShow (📺: @SpectrumSN &amp; TNT) https://t.co/dfUbYP1Zil RT @LakersReporter: LeBron (10 points) had a 2-hand 🔨🔨 in transition, and then a layup after a quick miss from Toronto, and finally an assi… Better get off the tracks when @KingJames is coming down the court! 👑🚂👑🚂👑🚂 A little bit of everything from Rondo (5 pts, 4 ast, 3 reb) in the first. https://t.co/b4rjiGA2JN RT @LakersReporter: A 7-0 run from LAL’s bench trimmed Toronto’s lead to 24-23, with Hart hitting his 1st triple of the evening amidst the… LeBron ➡️ Rondo ➡️ McGee\n\n#LakeShow (📺: @SpectrumSN &amp; TNT) https://t.co/XAgwGR8TNu Ball is up. #LakeShow https://t.co/Jqo2maHBig #LakersSneakerCam https://t.co/7ma0Hpwlce #LakeShow time in T.O.! https://t.co/mR9e7KTsCV RT @NBA: VOTE NOW for #NBATwitterLive, an ISO-CAM of a player during the 2nd half of tonight’s @Lakers/@Raptors game VOTED BY YOU!\n\nWho do… #SuitingUpTogether north of the border https://t.co/kkPptg5y45 Time for tip-off in the 6️⃣\n\n📺: @SpectrumSN in L.A. TNT nationally \n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/DcIGO4z8ox Rollin' through the 6ix https://t.co/1l5juMxGCy Velvet Fog https://t.co/G20EkX0VTT Put in the work so the game comes easy\n\n@kylekuzma | #LakeShow https://t.co/lyBHMsHOJ9 Cold weather fits https://t.co/LsFgqCkiA8 The King in the North 👑 https://t.co/7CBr94Qxd6 Canada Dre 🇨🇦 https://t.co/wsIr1O1nPt Extended members of the #LakeShow family head out to make a difference in the city on tonight's #BackstageLakers Following the postgame show on @SpectrumSN https://t.co/L1g3E8MN6Q RT @NBA: Averaging 7.8 APG... it's @RajonRondo's BEST DIMES of the season! \n\n🏀: #LakeShow x #WeTheNorth \n⏰: 8pm/et 📺: @NBAonTNT https://t.c… RT @KevinDing: Going behind the curtain with Kuz on his growth this season—and all that is coming next. The latest edition of The Point: ht… RT @LakersReporter: Injury update: Tyson Chandler (neck) and Lance Stephenson (foot/toe) are listed as out once again tonight in Toronto fo… #LakeShow up north tonight at 5 PT!\n\n📺: @SpectrumSN in L.A. TNT nationally \n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/VKzr46tJYw Keep it fresh! 📱🔥 #WallpaperWednesday https://t.co/p8vpebgopA “Every game, I try to think of three things I could’ve done better—and then just blank the game out. I may score 40; I still try to think of something I could’ve done better.”\n\n@kylekuzma details his process with Senior Writer @KevinDing.\n\nhttps://t.co/fUvzN2nYw9 RT @ESPNLosAngeles: Tune in TOMORROW for your exclusive chance to WIN tickets to watch the @Lakers take on the Wizards! Only on the home of… RT @Lakers: LeBron with your typical full-court, bounce pass, alley-oop reverse dunk\n\n#LakeShow (📺: @SpectrumSN) https://t.co/xoqcst6KMn RT @Lakers: Showtime!!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/wSCes3QGr8 LeBron James put on a show, with 36 points, 10 rebounds and some explosive slams in the Lakers' come-from-behind win.\n\nhttps://t.co/ULtNxInZNq 🎥 Kyle Kuzma dropped 21 points tonight in his first game back from injury #LakersWin https://t.co/WBwPwcE5p8 🎥 Kentavious Caldwell-Pope was clutch from deep tonight, finishing with four triples and 24 points #LakersWin https://t.co/qC0RBrbnEx 🎥 LeBron James led the way with 36 points and 10 boards in tonight's #LakersWin in Chicago. https://t.co/cPOJLppXoM 🎥 Lakers storm back in the third quarter and hang on to beat the Bulls, 123-107. https://t.co/B3YAnahqOf Andre Ingram's return to the @NBA is our @budweiserusa Moment of the Week https://t.co/USsyxVVcPz #LakersWin in the Windy City 💨 \n\nhttps://t.co/a1H2DIb4Mp Starting the road trip the right way #LakersWin https://t.co/aUJXHCnOjo 36-point turnaround complete. #LakersWin\n\n@KingJames: 36 pts, 10 reb\n@CaldwellPope: 24 pts\n@kylekuzma: 21 pts https://t.co/644BSJNS7s 😂😂 https://t.co/xCtBTCjZah Showtime!!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/wSCes3QGr8 LeBron with the off-the-glass reverse oop! 🤯🤯🤯 Punish the rim!!\n\n#LakeShow (📺: @SpectrumSN) https://t.co/QIfV7dKM8A 😤😤😤 https://t.co/yftbGQ3mSg LeBron with the stare-down triple! 👀 Welcome back, Andre https://t.co/EO1wL57P0I NBA Dre https://t.co/UoAivuOPnC #LakeShow end the third with a 24-3 run and a double-digit lead. \n\n@KingJames: 25 pts, 9 reb\n@CaldwellPope: 19 pts https://t.co/APlqWYn1ND RT @NBA: 👑📸 https://t.co/CC4LmxglDx 🎯🎯🎯🎯\n\n@CaldwellPope | #LakeShow https://t.co/8ZFH6kGuFD RT @LakersReporter: It’s a 11-0, and 22-5 extended run for the Lakers, who now lead 93-84 after the 4th triple from KCP. RT @LakersReporter: Kyle Kuzma has 12 of his 16 points in the 3rd Q, and KCP backed up Kuzma’s first triple with his 3rd on the next trip d… LeBron with your typical full-court, bounce pass, alley-oop reverse dunk\n\n#LakeShow (📺: @SpectrumSN) https://t.co/xoqcst6KMn 😏 https://t.co/hN5p7si1B2 RT @LakersReporter: LAL open the 2nd half on an 11-4 run to take a 66-64 lead, featuring what was - sort of - a LeBron alley-oop dunk when… 20-point deficit ⏩ 2-point lead Lakers take a 13-point bite out of the deficit. https://t.co/0hO99j403E Leaving ‘em in the dust. 😤 https://t.co/jFyeqE3NAo .@KingJames 🌪 🔨 \n\n#LakeShow (📺: @SpectrumSN) https://t.co/CLIFS6qD7l Put an ‼️ on it @CaldwellPope!! https://t.co/2myBE2owzs KCP with the steal and slam to force a Bulls timeout\n\n(📺: @SpectrumSN) https://t.co/JA32gRNfnr RT @LakersReporter: It’s now a 15-4 Lakers run in this 2nd Q, turning a 20-point deficit into a 38-31 margin. LAL hit 3 3’s (Caruso, Wagner… Rough opening 12. https://t.co/V6Z8LXo9eg JaVale scratches first for the #LakeShow\n\n(📺: @SpectrumSN) https://t.co/ArMRuu8Rs8 Let's start out with an easy one https://t.co/8MiGREWVH6 Ball is up. #LakeShow https://t.co/yWfHNleXKn Bring out the #LakeShow https://t.co/yjkqR7d9on First game of the road trip.\n\n#SuitingUpTogether https://t.co/YwKRZmqtWC Game time in the Windy City!\n\n📺: @SpectrumSN\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/KISEolexbp Play as one #LakeShow https://t.co/U3zDcfsImG RT @SpectrumSN: Luke Walton with @LakersReporter on tonight's starting lineup and what he expects from Andre Ingram with the #Lakers on thi… The routine remains the same, no matter the stage https://t.co/uKmeD3GjHE RT @LakersReporter: Kuzma will be back in the starting line up after missing the last 2 games with the sprained ankle. Rondo, Bullock, LeBr… RT @Lakers: He heard you last season.\nHe heard you with the @SouthBayLakers.\nHe can't wait to hear from you some more.\n\n#AndreIngram | #Lak… Kuz is a go 🚦 https://t.co/mbdi1oR4DF RT @LakersReporter: Kyle Kuzma (ankle) is available to play tonight in Chicago. Dre: The Next Episode https://t.co/2aitzvSMWI Chi-town Showdown #LakeShow https://t.co/E507xbkrnG RT @SouthBayLakers: Back in October, we asked Andre his goals for the 2018-19 season and what success looked like to him.\n\nJust like his jo… RT @Lakers: One of the NBA's greatest stories is getting a sequel. \n\nhttps://t.co/mn5IwicxnW The roadie gets started in Chicago today at 5 PT!\n\n📺: @SpectrumSN\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/0FBurHAzYE RT @SouthBayLakers: Friendly reminder to all.\n\nAndre Ingram DOES NOT have a Twitter or Instagram account. \n\nThose popping up are fake accou… He heard you last season.\nHe heard you with the @SouthBayLakers.\nHe can't wait to hear from you some more.\n\n#AndreIngram | #LakeShow https://t.co/HANoDJmKkl A historic moment leads this week's top plays, presented by @budweiserusa https://t.co/WO5D0FAV2f Be inspired all over again https://t.co/RS1MEn1un2 One of the NBA's greatest stories is getting a sequel. \n\nhttps://t.co/mn5IwicxnW RT @SouthBayLakers: It all went down at @Fly2Ohare.\n\nHis teammates and coaches couldn’t be more excited for his @NBA return.\n\n#AndreIngram… #ThisIsWhyWePlay https://t.co/2xOD5i3bXE Luke Walton shares his thoughts on what Andre Ingram will bring in his return to the #LakeShow https://t.co/GPRhrcwIM9 BREAKING: The Los Angeles Lakers have signed guard Andre Ingram to a 10-day contract.\n\nhttps://t.co/Q9CC27H7KA CHI ✈️ TOR ✈️ DET ✈️ NYC ✈️ MIL https://t.co/qHiMSQEvK7 🎥 Luke Walton gives an update on Kyle Kuzma's ankle injury and discusses the recent play of the young guys. https://t.co/2umXtAm3OF Don’t miss your shot at scoring tickets to the #LakeShow\n\nEnter now at https://t.co/TdtvCFyWgu\n\nSponsored by @NewAmsterdam Vodka https://t.co/YFCFRxiBWy RT @LakersReporter: From Lonzo Ball’s re-evaluation by the team medical staff: he continues to make good progress in recovery from the bone… 🎥 LeBron James talks about the energy and effort from rookies Wagner and Williams. https://t.co/ipDlk0NR7w 🎥 Moe Wagner talks about getting his first career start, and taking advantage of getting more playing time. https://t.co/iotLnVC3tT 🎥 Luke praises the play of the bench and discusses the 3-point shooting struggles. https://t.co/4VMqzAACdc 🎥 Moe Wagner had himself a career night, dropping 22 points and 6 rebounds in 34 minutes. https://t.co/yHTn5lRmd7 🎥 LeBron James finished with a team-high 30 points, 10 boards, and 12 assists tonight against the Celtics. https://t.co/M0XN9QROCI The young man from 🇩🇪 hitting for 2️⃣2️⃣ in his first @NBA start is our @budweiserusa Moment of the Week https://t.co/HlNSko2sJA 🎥 Shorthanded Lakers can't keep up this evening, falling to Boston, 107-120. https://t.co/S8Bwpm1FGy Final from Los Angeles.\n\nJames: 30 pts, 12 ast, 10 reb\nWagner: 22 pts, 6 reb\nWilliams: 18 pts, 10 reb https://t.co/Gv5sL0HjZL Another triple-double for the 👑 https://t.co/24EnESvCPC AC's on a new level 📈 https://t.co/1v6HYjfKpt 11 points in the quarter for 〽️oe.\n\nJames: 18 pts, 8 ast\nWagner: 17 pts, 5 reb\nWilliams: 12 pts, 8 reb https://t.co/CQaheAJXmr Another powerful stuff by @Iam_J3!\n\n#LakeShow (📺: ABC) https://t.co/HXFZYil01k Moe converts after the full-court pass!\n\n#LakeShow (📺: ABC) https://t.co/CbDaYgTTe8 J3 BEEN HUNGRY FOR THIS 🍽 18-6 run by James, Rondo and the kids. 💪 LeBron is having his way in the paint so far this half\n\n#LakeShow (📺: ABC) https://t.co/OjdoMT2aDv Rookie bigs putting in work.\n\n@Iam_J3: 10 pts, 5 reb\n@Moritz_Weasley: 6 pts, 3 reb https://t.co/25ls80O6RZ Rondo ➡️ McGee\n\n#LakeShow (📺: ESPN) https://t.co/89nVtGbakl One-handed rim-rocker by J3!!\n\n#LakeShow (📺: ESPN) https://t.co/fYAGTdrGpZ Bringin’ The Energy 🔋\n\nThe rook has 10 quick points. https://t.co/Wtg89Yjnvy Get angry with it @Iam_J3! 🔨 💜👌 https://t.co/JUWRHGnPFB Tight through one in DTLA.\n\n@KingJames : 8 pts (4-5 FG)\n@JaValeMcGee: 4 pts, 4 reb\n@Iam_J3: 4 pts, 2 reb https://t.co/IZTn0Kw2Iu .@KingJames cleared for takeoff!\n\n#LakeShow (📺: ESPN) https://t.co/Mq2sNdv6l4 Right down the middle!! https://t.co/lztnXX0dZk LBJ TWO-HAND SLAM 😤 Ball is up. #LakeShow https://t.co/u7xlCyvicb RT @Lakers: The rivalry continues tonight at 5:30 PT in Downtown LA!\n\n📺: ABC\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/0hboEH0dYf RT @Lakers: Jesse Mermuys sits down to talk about the impact Alex Caruso and Johnathan Williams had last game, and previews the latest inst… First career start for @moritz_weasley\n\n#SuitingUpTogether https://t.co/iaPEfBYLKz #LakeShow Time! https://t.co/jX64tnddPp #LakeShow https://t.co/S5ZB5h48fP Kyle Kuzma (right ankle sprain) is out for today's game against the Celtics. Jesse Mermuys sits down to talk about the impact Alex Caruso and Johnathan Williams had last game, and previews the latest installment of the Lakers &amp; Celtics rivalry, presented by @Delta https://t.co/q60kJXq5He RT @kylekuzma: .@B_Ingram13 🙏🏽🙏🏽🙏🏽 OFFICIAL: Brandon Ingram, who has missed two games due to a sore right shoulder, underwent further testing yesterday which revealed a Deep Venous Thrombosis (DVT) in his arm.\n\nIngram is expected to miss the remainder of the season.\n\nhttps://t.co/fNr8DwUbrb The rivalry continues tonight at 5:30 PT in Downtown LA!\n\n📺: ABC\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/0hboEH0dYf RT @SouthBayLakers: Athletic Trainer Heather Mau likes to remain behind-the-scenes, so we had to fake an injury to get her in front of the… Reggie's dream became a reality.\n\nWatch the entire @Toyota Lakers Voices episode with @ReggieBullock35 and @JaValeMcgee here: https://t.co/bEm0YNVBOO https://t.co/r4TCzclpuZ 🎥Alex Caruso discusses how he can make an impact in the final 17 games of the season. https://t.co/QZzzGTNeNV 🎥 Reggie Bullock talks about finishing the year out strong https://t.co/5n1GMtgURQ 🎥Kyle Kuzma talks about his status ahead of Saturday's matchup against the Celtics. https://t.co/149L36awnc 🎥 Luke Walton gives an update on LeBron's workload, Lonzo's recovery and more. https://t.co/Wg0Ut9AYwq RT @LakersReporter: Michael Jordan was a hero to many of us who grew up in the 1980’s, but all things considered, it was a whole other thin… 📸 Lights, camera, action! 📸\n\nGo behind-the-scenes of the 2019 team photo shoot at #LakeShow HQ! https://t.co/MCLEl2NxrG When a dream becomes a nightmare.\n\n@joshhart and @JaValeMcGee star in our latest (and scariest) @Delta mini film. https://t.co/1fNCyilRXu RT @SouthBayLakers: #LakeShow last night and out here supporting their South Bay brothers tonight at the @UCLAHealthTC. 🙌\n\n@Iam_J3 | @Isaac… 🎥 @JaValeMcGee chats with @ReggieBullock35 about trash talk, hair styles and who has the best three point celebrations in the league, in the latest edition of Lakers Voices, presented by @Toyota https://t.co/meLtNBCzJY \"The legend of LeBron continues.\" 👑\n\nAll eyes were on @KingJames as he passed his idol, Michael Jordan, on the all-time scoring list. https://t.co/hnMGPXSwza As part of @Delta's Salute To Our Troops program, the team honored SSgt Alan Coleman of the Marines with a game-day experience he won’t soon forget. https://t.co/lOAdHWBO9K RT @ESPNLosAngeles: Tune in TODAY to the home of the @Lakers, ESPNLA 710 for your exclusive chance to win tickets!\n\n📻: ESPNLA 710 AM\n📱: ESP… Flying past Air Jordan ☑️\n\n@KingJames | #LakeShow https://t.co/DjtB2ClOLH RT @Lakers: History in his hands https://t.co/HNtbtSFzCl RT @LakersReporter: * @kingjames on Jordan: “What he did for our psyche, what he did for our swagger as little kids made us believe we was… RT @Lakers: 🎥 @KingJames reminisces on the influence Michael Jordan had on him growing up, and what it means to pass him on the all-time sc… Come out on March 9, 5:30pm for a Lakers Watch Party at @HotelMayaDT. Come for prizes, meet a Lakers Legend + take a pic w/a championship trophy! https://t.co/HqSYBdKrMl 🎥 @LakersReporter and @JoeyARamirez break down LeBron James' historic moment, and the impact Michael Jordan had on LeBron growing up. https://t.co/vaSMTPNXZl RT @Lakers: \"This ranks right up there at the top... for a kid from Akron, Ohio that needed inspiration and needed some type of positive in… 🎥 @KingJames reminisces on the influence Michael Jordan had on him growing up, and what it means to pass him on the all-time scoring list. https://t.co/PKOUyVNzWu History in his hands https://t.co/HNtbtSFzCl \"This ranks right up there at the top... for a kid from Akron, Ohio that needed inspiration and needed some type of positive influence, MJ was that guy for me.\"\n\n- @KingJames reflects on passing Michael Jordan on the all-time scoring list. https://t.co/L3bBjSvj8Y 🎥 Luke takes time to reflect on LeBron James passing Michael Jordan on the NBA all-time scoring list. https://t.co/ueIb8fVUCr RT @SouthBayLakers: These Two Tonight. ✊\n\n@ACFresh21 x @Iam_J3 https://t.co/cxWkBqUkiM 🎥 LeBron James dropped 31 points, 7 boards, and 7 assists tonight as he passed Michael Jordan for fourth on the all-time NBA scoring list. https://t.co/DpYu0OTvvh 🎥 After mounting a furious second-half comeback, the Lakers slip away late in the fourth and fall to Denver, 99-115. https://t.co/FqVTqjXI0x LeBron drops 31 and passes MJ on the all-time list, yet the Lakers' rally ends due to a big Denver run. https://t.co/w7lLIjUj4O 👑🔨\n\n#LakeShow (📺: @SpectrumSN &amp; ESPN) https://t.co/XSfpcWNQH7 LEBRON WITH THE SPLIT AND SLAM! 💪💪💪 Baseline spin and slam\n\n#LakeShow (📺: @SpectrumSN &amp; ESPN) https://t.co/stytw0x0ty Appreciate those who came before #LakersSneakerCam https://t.co/TMdeP7vr7Y And-1 for the 👑 to trim down the deficit!\n\n#LakeShow (📺: @SpectrumSN &amp; ESPN) https://t.co/cwU0NLLxNh #LakeShow on a 36-21 run since halftime. \n\n@ACFresh21 hits the layup to make it a two-point deficit with 10 minutes left. Fought back within 8. \n\nJames: 21 pts, 6 ast\nMcGee: 16 pts (8/10 FG)\nRondo: 11 ast https://t.co/Qw5DRvzqYL RT @LakersReporter: Rookie Moe Wagner is 1 short of his career high 12 points after converting an and-1 at the rim. He’s made some nice pla… RT @NBA: The @Lakers congratulate @KingJames on becoming 4th all-time in career points! #LakeShow https://t.co/Zgky3FO17e 17 points and some history in LeBron James' first half. https://t.co/gBLZqoBiJx RT @LakersReporter: LAL went on an 9-0 run amidst LeBron’s pursuit and passing of MJ, to cut Denver’s once 22-point lead to 13 at 55-42. .@KingJames climbing the ladder!!\n\n#LakeShow (📺: @SpectrumSN &amp; ESPN) https://t.co/M2luT0mz0a One over Jordan 👑 https://t.co/SYp4V8feFE Historic night for basketball royalty. \n\n@KingJames passes His Airness as the fourth-leading scorer of all-time. https://t.co/f1WsVjOBvH LeBron. MJ. \n\nTied at 32,292 points apiece. RT @LakersReporter: Three more points to go for LeBron in the Jordan points chase. #LakersSneakerCam https://t.co/QqTimTNMn5 Through one in Los Angeles. https://t.co/TmxAPyKMBm JaVaaaale McGeeeee!!\n\n#LakeShow (📺: @SpectrumSN &amp; ESPN) https://t.co/6Sek4I2yiM RT @LakersReporter: LeBron is 0 for 4 at the FT line to start, but he responded with B2B 3-pointers to get within 7 points of surpassing Mi… ⬇️⬇️⬇️ https://t.co/yYjlnsFsjy Ball is up. #LakeShow https://t.co/qJMDFyXqZP The birthday boy gets the start tonight.\n\n#SuitingUpTogether https://t.co/FySA5kVkq5 Reggie getting ready. #LakeShow https://t.co/89aIPYh1Bn Time to get it started at STAPLES!\n\n📺: @SpectrumSN in L.A. ESPN nationally\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/ASnYPWcO2n History awaits 👑 https://t.co/f4pL876l7s RT @KingJames: Can’t even front. This is going to be UNREAL!! Wow man Brandon Ingram is out tonight. 1️⃣3️⃣ points away from history https://t.co/d8bE9Y6wwR With 13 points tonight, LeBron James passes Michael Jordan on the all-time scoring list.\n\nWhat this says about LeBron's versatility and success habits, by Senior Writer @KevinDing:\n\nhttps://t.co/bgPRRtH9U8 Game Day in Los Angeles, with tip-off at 7:30 PT!\n\n📺: @SpectrumSN in L.A. ESPN nationally\n📻: 710 ESPN &amp; 1330 KWKW\n\nhttps://t.co/WdbFuIjOqf Happy birthday, @joshhart! 🎉 https://t.co/yOTOYMz9OA Another trip around the sun for the Diesel! Happy birthday, @SHAQ!! https://t.co/laheQI3Uzc RT @LakersGaming: Six strong. We can't wait to get started. 🙌#LakersGaming https://t.co/liomGY2DGs RT @LakersReporter: The precautionary MRI on Kyle Kuzma’s injury confirmed a minor ankle sprain. Kuzma could miss up to one week. RT @LakersReporter: Lakers injury update with details on Ingram, Kuzma and more: https://t.co/LTAKRfPFxf 🎥 Luke Walton updates the status of Kuzma and Ingram following Tuesday's practice. https://t.co/enE0Jjo7Ct RT @LakersReporter: Luke Walton said the Lakers had a film session, then only 8 active bodies for on court work. Kyle Kuzma (ankle) got tre… 🎥 Josh Hart talks about fighting through his injuries and the need to win every possession. https://t.co/BTidi0YIxF 🎥 Rajon Rondo talks about becoming the second player in NBA history to notch a triple-double with five different teams, and the team battling through injuries. https://t.co/PDXlejM69t 🎥 LeBron James talks about taking things one game at a time and fighting through adversity. https://t.co/42Y40pCpCA RT @LakersReporter: X-Rays were negative on Kyle Kuzma’s sprained right ankle. As Luke Walton said, though, it’d be a surprise to see him b… 🎥 Although the team’s mindset was in the right place, Luke feels missed opportunities and injuries took their toll. https://t.co/hW06tBA7Kg Final tally from STAPLES. https://t.co/2iOZ4xCwMv"}