{"tweets": "@SpoiledRSbaby Those look like our Nike Free Run+ 3, style code 510643-702. They were released in 2012 and are no longer available on our site. You can check out the new Free Rn here: https://t.co/XRXiHbVQ77 @RiosStepahanie Hi Stepahanie, it looks like the Huarache Run Ultra (819151-011) is no longer available for purchase. Have you checked out the Air Huarache? It has a similar look and feel as the Ultra, and it's available in your size! Check it out: https://t.co/YGDk5WT2as @JJ__757 They're currently set to drop on 10.25. You'll be able to cop here. 💀⬇️ https://t.co/SCSim5Mol2 @EdeX57222676 Let's pull in our friends @nikestore to take a look. 👍 @paulex78 Air 💨 + Force 🖐️ = Fun 😃 @michuabs Our friends over at @nikestore can help you with this. 👍 @Shan_Jones_ We have plenty of non-pink colored shoes available. Go to the link and sort by your favorite color on the left to find em': https://t.co/4btxzHqmY7 @antdwg1967 🧢 ✔️\n👕✔️\n👖✔️\n👟✔️ @DeNovo09 Keep on, keepin on! 💪 @markischarles Adding a personal logo isn't an option at this time, however, you can add text and choose your own unique colors with Nike By You here: https://t.co/TKttykbeMl @markischarles You can never go wrong with the Pegasus 36. It's comfortable, has perforations for cooling and provides a smooth and responsive ride. 🙌https://t.co/DnFZvUJT4G @Strech_1986 Well done, Rick! 10 next week? 👀 @cecilia_jessyka Nothing beats the classics. 😍 @back_up10 Legend from the turf to the street. Welcome to the club! 👌 @CM0042 Look no further. 👊 | https://t.co/IyH3ioOEU7 @bradwipert Hey Brad, no word at this time about those becoming available for purchase. We'd suggest keeping an eye on our site for any updates! | https://t.co/eB2SbgUaC9 @Dylaaan_D Throwback, and it's not even Thursday. ✊\n\nWe passed your suggestion along to our team. @mics346 Rep your city, no matter where you are. 😎 🔥 @Yes_iHoop14 No better way to start your special day than with some frosty new kicks. 😎 Have a good birthday, Kimmy. @wperezm Hola, encantados. Te vamos a dejar un link desde el que te recomendamos contactarnos y de este modo podemos revisar contigo que ha podido ocurrir. Te esperamos. \nhttps://t.co/sfc3L7XsEp @freyanch Time to lace up and make some heads turn. 🔥 🌶️ @Kym_Nichole If it was easy, everybody would do it. Keep pushin' the pace. 👊 Leave them chasing. Again.\n⠀\nLawrence Cherono sprints to the finish in a tight competition on the streets of Chicago. Finishing with a time of 2:05:45, Lawrence is once again second to none. #justdoit #chicagomarathon https://t.co/0wl0GfE0qw @AbbeWright 🐋🐋🐋 @2Kallday13 Why not create your own? https://t.co/f7N5xFjun4 If it hasn’t been done before, it’s yours to claim.\n\nBrigid Kosgei becomes the fastest woman in history to run 26.2 miles with a time of 2:14:04. Congrats on your World Record and second consecutive victory at the Bank of America Chicago Marathon. #justdoit #chicagomarathon https://t.co/7wQYJvCRWx @ilykathyxo Look no further, Katherine. 😏 https://t.co/3CSrj9S6k8 “I run to prove to any human in this universe that there are no limitations.” @EliudKipchoge \n\nA crazy dream come true — Eliud Kipchoge becomes the world’s first to run a marathon in under two hours. #justdoit https://t.co/12mVz1wbpd @Outsideacircus Gone, but never forgotten! Find out more about our Nike Grind program here: https://t.co/WqZKKO8DKY\n\nIf you're looking to upgrade, check out our Pegasus 36 here: https://t.co/nOkRNuE3gA @Acee626 The W of all W's! Congrats 👶. @lopsster Breaking records? No problem. https://t.co/4pJCMGh6sx @shellcain3 We've got you covered, Shelley! Check out our selection of USWNT 4 Star Jerseys ⬇️. If you don't see the size you're looking for, stay tuned for a possible restock.\n\nMen's: https://t.co/RdKAX6IUBP\nWomen's: https://t.co/ddpfsF5baM @drimanphd Hey Iman, let's get you suited up! We have the Air Satin Jacket in Echo Pink available here: https://t.co/UzXfyDLLIL\n\nWe also have the Air Legging in a few other colorways, check em' out here: https://t.co/ZyqTu511vz @garymheffernan Nothing to share as of now, but keep your eyes on our NikeNews page for any updates: https://t.co/kSzJjQdYtf @TomZajaczkowski Your best bet is to work back with the original retailer. If they aren't able to help, our team is ready to help keep your season going at +44 (0) 2076604453 (8:00 - 20:00 Mon - Fri, 8:00 - 17:00 Sat). @SarahBuice Sounds like it's time for a new pair. 🤙 https://t.co/VMdEXtT3YU @Mr_Mouzaoui From start to finish, we'll be along for every step of the way! 🌲👻 @amoreSTEPH While we don't have a cleaning service, check out our cleaning instructions to keep em' fresh and clean. | https://t.co/jhw4cS71Tk @chapshots Serving up some KMs with a view on the side! 🏃‍♂️💨 @JoseEnriqueMP ScAIRy stuff. ☠️ @CervanteSergio It's always better running with friends! 🐶🐶 @SebShawMusic Totally fine by us! @ryvanthony We glad to hear you like this, Ryv. Get the best our of them with our NTC App here: https://t.co/hMmy4fIMSp @leesmileyman We 👀 you stepping up your game! Way to get after it. 💪 @sharlaforreal Hey Sharla, we have Master Trainers from across the globe. Head on over to the NTC app to learn more: https://t.co/Qxu6kHXYob @RICKMORRIS3 😸 @Bood_FM Great minds think alike. Couple goals. 👟 🔥 @Pdao8 You got this in the 🎒. Let us know how the progress goes, Peter. 💪 @inasuc The motor on those motorcycles doesn't compare to the ones on your feet. Keep burning that rubber. 💪 https://t.co/fl4dWitOeV @omtcrake This much 🔥 should come with a warning: 'Might cause momentary blindness'. 😎 @cynthiaxsarkis Which one can you use to hang around, exercise, sleep and most importantly, is more comfortable? 😉 https://t.co/FgDKOnS1om @ShowtimeShann 👊 @ChadRuffinMD Those are spicy. Be careful not to burn the hardwood floor. 🌶️ 🔥 @arielle_ship We'll see you on the pitch.💙😍 @AE9941 Breaking waves and strong runs. Looks like there's a new Poseidon crashing the water.  🌊 🔱 @GiantSoundLLC Glad to hear you like'em. Keep tearing it up and remember, the skills all you. 💪 😎 @joevankas Getting stronger every week. Nicely done! https://t.co/w3mW3Vvqse @TasMelas That colorway of the Zoom Freak 1 will release at a later date, Tas. Keep an eye out here for the latest updates: https://t.co/8im4emzlG8 @ASassyWomanMEd No better feeling. 💁‍♀️ @kinleygene Setbacks make for the greatest comebacks. Let's get it! 🙌 @DedrickWelch For some it's exercise, for you it's a lifestyle! https://t.co/rIFVoNTp6T @a_aron1100 Bet. @Marnell_good No word on that colorway dropping. We can't guarantee you will posterize anyone, but the Shox BB4 is back in the original Metallic Silver colorway.\n\nhttps://t.co/P4yQgvAVae @D_advantage Wednesday outfit's on point, Sam.  😎 @CashNastyGaming No problem, Cash. Yeet! @desireetornell En este caso te recomendamos escribirnos de vuelta al mismo email y explicarnos cual ha sido la respuesta que la empresa de reparto te dijo y de este modo podemos revisar el caso contigo. Te esperamos. @warrenjwric Way to persevere and push through, James! Good luck with the training. 👍 @CT_fit Now that's what we call a 'treat yo' self' day. 😉 @krististrang The Force is Female. 💪 @homoopinionated You ask, we deliver. Check out those pink Flex Stride 5 lined running shorts below.\n\nhttps://t.co/J9fr8Y24Ql @LadyLondon82 Nothing like an accountability partner. 🤷‍♀️ @Phxrxoh No better time to grab 'em than when they're on sale. 🙌 https://t.co/i6rGc9w1Ah @andyacr That colorway isn't currently available on our site. Keep it locked to the link provided previously for updates on new styles. @andyacr You have a good eye! Get a similar colorway here: https://t.co/3VjLHYy0as @andyacr Hey Andy, the top look's pretty similar to the NikeCourt Challenger top. Get it here: https://t.co/7XTARlly09 @BigTanelly Let's get it Nelly! You crushed that 100th run in style! https://t.co/ST4fPuKsQv @Mr_Miller1 Happy birthday, Kaidyn! Always looking fresh. 😎 @Dfly1990 You cop? @Dfly1990 Right here. https://t.co/FnvT56WHdH @Kassa2x They're still here + on sale. 🙌 https://t.co/3Nfu3R3U92 @vkrysh12 5k tomorrow? 👊 @BlackkingV Smash is an understatement!\n\nHere's a visual representation of your next 5k result. https://t.co/RdJo6mM4vu @rotimi_dada We 👀 you, Rotimi. Way to crush that run! https://t.co/YbZRJXFjF3 @jaklynelisabeth Oh, they work. 🤹‍♀️ Try 'em worry free as a NikePlus member — you have 30 days to return them if we're wrong. https://t.co/FAjAC2zmkv @laurmileys Of course we can... once you purchase them: https://t.co/sv3lNa2lMR @keatonguess Taking the Joyride's to new heights! What's next? 🚀🌑 @SharmaIsland Have your pick, Avinash. 😏 https://t.co/jzMTd6c7Rr @ricardorod5 Una vez borradas de tu historial, tus carreras son irrecuperables. De igual forma vamos a revisar en nuestro sistema e intentar ayudarte. ¿Puedes, por favor, facilitarnos a través de mensaje privado, tu correo electrónico registrado con nosotros? Te esperamos. https://t.co/klmMF17JKV @AaronLutz08 6000 miles and your birthday? We have a lot to celebrate! 🏃‍♂️🎂 @Angelus13AOV Be careful not to leave any burn tracks when walking with that 🔥 😎. @renada_l We're not sure that is does. 😁 @SunilSharmaUK Good tunes to go with that winners' attitude. Keep on crushing those runs. https://t.co/8YOlunvHmv @win_44 5008 miles of sweat, hard work and dedication. Ready to go for another 5000 miles? 💪 https://t.co/f9g0EPut2J @run_lela Happy Birthday Lela! Way to start off your birthday strong! https://t.co/JIh2zQyjz0 @Kasaskeris Shoot your shot! ⛹️‍♀️ \nhttps://t.co/TsGb0OO6DV @Kasaskeris Your canvas awaits. 🎨 \nhttps://t.co/ffjEtFan6p “Your dream starts as a kid. You get older and your aspirations grow, because you believe you can do it.” -@RafaelNadal \n⠀\nRafa wins his 19th major. One shy of tying the all-time record. #justdoit https://t.co/j2f5FDLH4X @joevankas People were eating your dust for brunch today! Get it! https://t.co/viKBRsqxFH @Madeeha_Syed How could you pass it up? 💜 https://t.co/HHo0mmVq2R @amyellemily You're not the only one, Amy. Shop the collection here. 🙌 https://t.co/YnKE8fKwDL @MelissaBuntcake Look no further. | https://t.co/NVhaf643Ke Call her dreams crazy, but history will forever call her champion.\n\nCongrats @Bandreescu_ on your first major title. #justdoit https://t.co/xYNJxQr7Ag @TeamRW_ Freakishly good. See for yourself: https://t.co/FJyn9P6h3N @blucorsa Imagine how they feel on the go. 🏃‍♂️🔮 @JimHoward34 We can see why!🔥🎨 You've got some grails in the background too.👀 @joy_saragosa Welcome to the force!👊🎉😍 “It’s been an honor to be a part of such a great company for the last 18 years. And to know that a building with my name will reside on campus — it’s truly an honor, and I feel truly special.” - @KingJames @Markito_Suave No better time than now. 🤷‍♂️ https://t.co/KU3ZFrLvYC @justrayven Here are the options we currently have, Rae: https://t.co/4ZrJ9Q3jZU @Libbyj2006 Yes indeed, Libby! Please call 800.344.6453 (7a–4p PT, M-F) for more info on our One Shoe Bank program. @KenyattaRooks Hey Kenyatta, it may be sold out, but you can get notified of new drops here. | https://t.co/0c6m1a2ICP @gina_parcesepe 7 years? We couldn't tell!😉 Here's to another 7!🙌 @geminikk Flying through air. ✅\nWalking on Air. ✅ @ClonyDungyXL1 Here to help. Select teams were designed for the Pegasus 36. Shop them here: https://t.co/zq8oWoQAYg @Zuziliciouscake Sweet trainers. 😎\n\nHappy birthday, Frank! @Caitlyn_Brown1 Ask and you shall receive. Do these fit your style?\n\nHat: https://t.co/U8uVKDCaEm\n\nSlides: https://t.co/FenXMJ0GgK @clarry_1 The ball is in your court now. 🏀 https://t.co/Dwthv6vkOb @_BTanner_ Way to go, Ben! What goals are you chasing down next month? 🏅🏃‍♂️ @xxcharlyy We're sold out of the HyperAdapt 1.0, but our next step towards the future is coming real soon. \n\nMeet the Nike Adapt Huarache. https://t.co/3k7gt2A57e @iRUNfarr Anywhere from 300-500 miles, Troy. Let us know how they felt after the first test drive! https://t.co/upHYAmYZVF @bbournival Fresh air is always needed, Brad! @hotscarvey45 Hey Scott, time to feel young again. https://t.co/VEuNMYKFoz @bigblac85 First of many. Welcome to the club, John. 🏕️ @batebr01 You owned that run. Keep going, Bryan! 👊 @actionjaxon666 Hey Shaun, the Adapt BB's released earlier this year. There is no news on a restock at this time, so keep it locked to our site for future updates. @Nakanari It's up now! 🌵 https://t.co/3VEHMNb6My @Selu16GBT Huau, 4´33´´tiempazo José Luis!! No dejes de enseñarnos tu progresión y a por el resto de la semana!!!😉👊 @ChineduOgu Still a good boy. 🐶 @alyssajoye We'll take on the first day together.🍎 Let the adventure begin! 🦄 @Caits_take Hey Caitlin — we know how hard goodbyes are, but let's get you in a pair that you'll love just as much for years to come.\n\nhttps://t.co/oSXKs3R5ow @IRIS18KGOLD We're sorry to hear about your experience. Please give our corporate number a call tomorrow. Tel: 800.344.6453 (7am-4pm PT, M-F) @vanuaryear The bag isn't big enough for a basketball but is perfect for the other essentials. 🙌 https://t.co/eLa1IQHf5y @HopeOrtego Easy flex. 🔥 @kamaumos30 We see why. Keep getting that 🔥, Kam. 👍 @cleeut We'll see you out there one day, Chris. 🏃‍♂️ @Jack03Capu Welcome to the family. 🙌 @VarmaKarma10S Never stop chasing those crazy dreams. 🌠 “I want to make sure that they’re growing up in a world better than the one we are currently living in.” - @KobeBryant \nJoin us at: https://t.co/IgoKWjV5h7 #justdoit #madetoplay https://t.co/aIpSFPAcEs @MarkKLamont Hey Mark, thanks for bringing this to our attention. The prices on our site are current, so we will be sure to alert the appropriate team. @Ant1sdope Welcome to the club! 🏕️ https://t.co/B5jtW6RQKH @franki8701 We're happy to hear your interest for the Nike Adventure Club! At this time, it's only available in the U.S., but we will let our team know there is an interest for availability in other regions. @JadaGomez Can confirm. @JadaGomez Almost forgot the most important part. 😅🔥 https://t.co/r6nVs2Myd3 @HernanSiano Hola Hernan, en este caso @BentonKorth1 We've retired some of our social accounts, so we can better focus on serving customers. For help with all things Nike, be sure to follow @teamnike and hit us up there, or reach out to the store directly for whatever you might need. @JadaGomez Servin' up the heat here. 🎾 https://t.co/QrYUHa4iBi @RoyJonesy Oh geez-louise! Welcome to the club little dude. 🌎 @Dnt_Trip_Crip We're extremely sorry to see that. We recommend only cleaning your shoes by hand, and suggest avoiding using harsh materials. If you need to clean your shoes, warm water and a small amount of material friendly soap should do the trick. “It doesn’t matter whether you’re poor or rich, where you’re from, what religion you follow, what language you speak, everyone is equal on the pitch.” - Rascha Ahmad\nJoin us at https://t.co/IgoKWjV5h7 @theIRC #justdoit #madetoplay https://t.co/M6dxRAzVLN @8inarow2togo Let him know that his pals here at Nike have his back. The Air Max design on the tongue is intended to look that way. The \"r\" &amp; \"m\" are connected. More images can be seen below. https://t.co/z3fH30aoQC @geisharu Hola, encantados. ¿Nos podrías decir en qué país te gustaría realizar la compra y revisamos opciones? Un saludo. @JavierCaireta Vaya Javier, lamentamos ver eso. En este caso tienes que volver a la tienda original donde realizaste la compra, en caso que ellos no puedan ayudar solo comentanos. Un saludo. @Rsaint03 We just provided the tools. The work and dedication was all you. https://t.co/T3FPTjEIpO @Billyxswfc Fine. 🍪🍪 @Billyxswfc That's some serious air. 💨 \nHere's your prize. 🍪 @BarneyGumbo Try flipping it, Barney. @amirraphael7 🤝 @amirraphael7 The classics, you say?\n\n⚪👈 or 👉⚫\n\nhttps://t.co/g6xvdmIQWN @TazThornton Hey, Taz. We appreciate the love. Enjoy the Metcons. 👟 @scottschwef Every stride gets you closer to your goal! 🏃‍♂️💨 @AyeTeeMack We got just the shoe for you. 😍 https://t.co/IMh7TzExls @JWLewinstein That won't be a problem with our new sneaker club! Sign up now. 🥳 https://t.co/60N0mMLIGD @RyleyKushing We feel the same way about you! Congrats on hitting 1000+ milestones! 🙌 “Many of the children’s physical fitness is very poor now. Although I can’t spend a lot of money to buy equipment for the children, I can create equipment for them with my hands.” - Lin Meizhen #justdoit #madetoplay\n\nFind out how you can take action: https://t.co/IgoKWjV5h7 https://t.co/bviMh43LCk @naji_aldajani Way to crush that 10K! https://t.co/PzT3MEJg2c @seguraerika Erika, si quieres, puedes enviarnos un mensaje privado y así te ayudamos. https://t.co/klmMF0Q8Tn @BryanStrasberg Show up and put up! Keep grinding, Bryan! 👊 @fork_knife @NikeNYC 👀 🤸‍♀️ 🎢 @LxrdInAGen We were afraid that he'd try to steal our formula. @iRUNfarr Hey Troy, while we don't have that specific style available anymore, we think you'll like the Flex Experience RN 8. Check it out on our site here: https://t.co/RjoG3EtF6i “Everything that was taken from me, every opportunity I was denied, that’s what I want these kids to have.” - Neide Santos #justdoit #madetoplay\n⠀\nFind out how you can take action: https://t.co/IgoKWjV5h7 https://t.co/CHmJbYp9Oc @jimmy415sfc We've retired some of our social accounts, so we can better focus on serving customers. For help with all things Nike, be sure to follow @teamnike and hit us up there for whatever you might need. @aaronclarkcodes Thanks for the heads up, Aaron. We'll pass this info to our team. @jay_brzy Hey Canis, doesn't look like we have this exact one, but don't let that spoil your birthday.\n\nhttps://t.co/NKp8sUqACA @bamardis That Tiger Woods \"Frank\" hat is finally in stock, Andrew.\n\nhttps://t.co/AxUbu8YMqX @timothyrood We didn't forget about ya. 🐯🧢\n\nhttps://t.co/tolZl5Yyv6 @13AHill Need granted? 🐯🧢\n\nhttps://t.co/zz4Y3UmNlP @ATXSunDevil We got you, Seth. The Frank hat just stocked for NikePlus members below.\n\nhttps://t.co/6cfCPOCNNV @shaneodeezy An update on that merch. 🐯🧢\n\nhttps://t.co/u9ie1eECvl @ImDaSh_t Dropped 'em. 🐯🧢\n\nhttps://t.co/juit4Yu6HK @nicolecbo You got it. 🐯🧢\n\nhttps://t.co/ksAcqfEPui @TJSarrell Since you asked nicely. 🐯🧢\n\nhttps://t.co/8A2qrMf0fC @TJThiel For sale. 🐯🧢\n\nhttps://t.co/HopQ5AgIBO @TCRBrad For the rest of us. 🐯🧢\n\nhttps://t.co/RFpfAdqW3B @himynameisbrew We heard you loud and clear. 🐯🧢\n\nhttps://t.co/WD97fwDdBq @Ego_Icarus Hola Julian, encantados de ayudarte. ¿Podrías enviar un mensaje privado especificando tu correo electrónico registrado con nosotros?. Comprobaremos todo en nuestro sistema y ayudaremos en todo lo posible. Te esperamos https://t.co/klmMF0Q8Tn @kenmorepaladino 👀 \n\nhttps://t.co/InzsvhFMqB @abjectboy Rain or no rain, all we see is greatness! 🏃💨 @blacknoy_ https://t.co/Yqhzla6Ek5 @Lexeye Woo! 🧽 @CVegas23 Hey Cee, the Shox BB4 have been delayed with no word on a new release date. Keep it locked to https://t.co/yYv8xSbp4x for updates. @AE9941 The competition is no match for your consistency. Way to get after it! 🏃💨 @yoAloisius Can't have him stealing our secrets. 🤫 @DefVelle Pushing through isn't easy, but rewarding yourself is. 🙌 https://t.co/5OAvoIoyBF @AboyRafael Bravísimo Rafael, tiempazo Nike!! ¿Buscamos bajar de 6,01 a 5,59 en la siguiente salida? 👊😉. @jacepohl Help is here. To kick things off, could you let us know where you're located and which size you're after? @SpartyBlood We know you want one too. https://t.co/kUHLrd4sT2 @ShAnNoN0211 Apologies for any confusion, but that is not affiliated with Nike. @siyendwandwe1 Indeed, that is our official website. Shop our entire lineup of NFL jerseys below.\nhttps://t.co/KQzXQRsAMD @SAkqj Send us a pic when you cross the finish line. 🏁 \n\nhttps://t.co/dsAWNDeqy9 @lildonjai Apologies for any confusion, but that promotion is not affiliated with Nike. @blackdollincc1 That promotion is not affiliated with Nike. Apologies for any confusion. @Jason_Dew The Nike Shox BB4 will release at a later date. Keep an eye out for any updates. https://t.co/86MvMdu1VK @JasonMJeffries Ready for you. 💪 \n\nhttps://t.co/Ia7SEiAIT8 @jab035 We're going to go with Alistair on this one. Maybe next time dad. 👶 @BigTanelly Lookout world, Nelly's on 🔥! https://t.co/oP5v3sbYKZ @JasonMJeffries Coming soon, Jason. 👀 \n\nhttps://t.co/IwCFEin4H0 @miketor_mty Genial Miguel Angel, deporte en familia, nos encanta ver eso👍😄. @AE9941 From coast, to parks, to tracks, where doesn't your running journey take you. We look forward to seeing more sites along your progress. 😀 👍 @JemSSBU We can't wait to 👀 your Nike OOTD next Saturday. Hit us up with a 📸. @Ryan_Redbeard The Revolution 4 FlyEase. They're breathable, lightweight, and have responsive cushioning. Get them here: https://t.co/IRQxcf8Ood @JemSSBU Who says you can't have your cake and eat it too? 🎂 @jarekpachocki Let's crush the next 1,700KM! Volt Level Activated! 🏃‍♂️⚡️ @TeamOso11 That's what consistency and dedication will get you! 💪 @Braat One of our favorites, Paul. Cop the Air Max 270 React Bauhaus below. 🔥🎨 https://t.co/ygInFz45Oj @_SAIRU_ The wait is over, James. 🎈 \n\nhttps://t.co/ihPZguHXQM @TeachaKidd Hey Lee, are you ready for a joyride? 🎢 \n\nhttps://t.co/W5bXKSWOGM @Tilsz Hey Daniel, they're waiting for you. 🎡 🤹 \n\nhttps://t.co/XRT2ZVyvPq @dsilva13 Join the ride, you won't be disappointed. 🎡🔮 https://t.co/mBhx6OWLV2 @_SneakerMonster Of course we can! That style is the M2K Tekno. Peep the link below to see if your size is still available. https://t.co/Am3nTa3TPp @charbarley Ultimately we recommend working with your physician to see what will work best for you. With that said, our Zoom Pegasus 36 is a great shoe to look into. As a NikePlus member you get free shipping and returns within 30 days to give it a test run. Cop here: https://t.co/CQOSeeD1Ze @fivethree12 Time to start practicing those touchdown celebrations. 🕺🔥 @Nicho501 That day could be today. Put your spin on a pair of Air Max with Nike By You. https://t.co/T340QdTMaI @stumpy1arm Twist the top off and you'll find a screwdriver to remove the yellow swoosh. Personalize your pair with the swooshes included and show us what you end up rocking! @Karina_115 Making it look real easy. 📸🔥 @PVizzy31 Todays years old. https://t.co/PriHTyrETd @tonitoooo17 🗣️ UPGRADE \nhttps://t.co/2YAOjJbIxb @melvindillon Outstanding job, Melvin! Progress comes from dedication and your dedication is out of this 🌎. @keronakhla 👀 🔥 @niron Was it love at first sight? 😍 @StvHollywood Apologies for the confusion, Steve. We appreciate your feedback, and have forwarded your comments to the appropriate teams. To clarify, the Nike Joyride Run Flyknit will be available to members 8.1.\nhttps://t.co/bN0A87qqxm @simondedeney The Nike Joyride will be making their appearance in your region on 8.15. Get ready for a more enjoyable and easy running experience. 🤹‍♂️ @gr8niss71 Crisp and clean design. All that's left is to check out. 😎 @SnkrPrince It feels phenomenal too. 🔮 🕺 @OjiKelechi The start of something great. 💪 @badboi861 🕺🎡 @BillyWhiteBTI Nike By You options are updated daily. Check out our current lineup, and stay tuned for exciting new options in the future. https://t.co/fgndHoZ6XO @KnightOnAir 💪🔥 @andrsju There's no plan to restock at this time. Head to https://t.co/yYv8xSbp4x for the latest updates and restock information. @SomeRandomNufc 🤯 Learn more about Bill Bowerman's waffle windfall here: https://t.co/VwkVt01Amt @durman97 Starting the week off with a clear mind is 🗝️. @UTFRunited7 Bringing the heat. 😅 @adubats For some it's exercise, for you it's a lifestyle. Way to 🏃 it! No matter the noise, her dream was louder.\n\nCongrats, Li Na on taking your place in the Tennis Hall of Fame. #justdoit https://t.co/TFCsAXfQLo @TheRealStevieJ 🥳 @amaizing1 Freezing cold. 🥶 @markverdillo 8 a.m. essentials. ⚡😉 @uptownbourgeois None of our retailers or stores are currently carrying the Air Rift, Rory. Reach back out to us if you have any other questions. @zwill Not a bad lineup, Zack. 😳⚡ @Matt38067275 Hey Matt, go in full swing and cop yours now! 🏌️ \n\nhttps://t.co/67kuTzjTMc @AE9941 Rain or sun shine, always putting in that work like a boss. True Nike Spirit. https://t.co/p5iD1QuWeq @DreaSpeaks Our options will knock your 🧦 off!\n\nhttps://t.co/N5LP2xA70f @hannah_cat10 🤩🔥 @hannah_cat10 Happy birthday, Hannah! Now what are you going to get yourself? 🎉 @ecstaticappeal_ We hear you, Chrissy. The 4-star jerseys were released after the championship match win, and have sold out. Stay tuned for any possible restocks, and check out our current USWNT jerseys in the meantime. https://t.co/diyTJEUUdk @DoMoreMarty Heat isn't a factor for you when you're crushing those miles. https://t.co/Wdvg4wMotC @larrieeee You've got great style! Have you 👀 our M2K Teknos?\n\nhttps://t.co/lFeKETlOyw @SassafrasMama We got your back. 🙆 Shooting a course-record 61 at age 16 🤯 because crazy dreams don’t wait. @McilroyRory https://t.co/lMWaZipDi5 @LWKYLLA 😉 👍 @RubenA82 Hey, Ruben. Roger rocked the NikeCourt Air Zoom Vapor X today.\n\nhttps://t.co/3KhNp6Y4HM @mickeysmoore Us at the finish line. https://t.co/hQzfq5ssU2 @ChacoQueen We got you, Stephanie. Grass stains welcome. 🎾🌱 https://t.co/7KpwkYpKIH In case you missed the first, here's another crazy dream come true. #justdoit @Simona_Halep https://t.co/CzXGVZ1VJS @sarajean1215 No news at this time, Sara. Keep it locked to our site for updates. https://t.co/tj7LfLJx9d @GaryCorr Think of all the new memories you can make in these: https://t.co/21frIcWe2h @a_taranets You'll crush your marathon in our revolutionary FE/NOM Flyknit Sports Bra. You get free shipping and returns within 30 days of delivery as a NikePlus member. Don't forget to keep us updated on how training goes too! 💪 https://t.co/wcuPE2APBP @KingTH94 We see plenty of styles and colors available for your summer needs. https://t.co/GVhEAKDod5 @chasters88 Out with the old, in with the new. Get the Vaporfly Next % below. 🤩 https://t.co/RbmEJ3vPVx @ABSwebCanada Those look fast. 🔥 @UrbanCakes New is better. Try out the Pegasus 36 in a wide fit below. If they don't work for you, as a NikePlus member you get free shipping and returns within 30 days of delivery. You have nothing to lose. 🙌 https://t.co/UIBwnzsPuk @JamesMarkert Careful not to burn to court with that heat. 🔥 @angelaa_martinn We're glad you asked, Angela. Alex is wearing our Air Max 270 React. This colorway is a Member Access exclusive and will be available soon. Get notified below. https://t.co/MnNB8BcrKo @nopueswowlololo The Air Max 270 React was designed with comfort in mind and to be a lifestyle shoe. We wouldn't recommend serious running or training in these. @megelljoe45 The ZoomX Vaporfly NEXT% will drop tomorrow at 9am CEST. Keep an eye out here: https://t.co/SqmOqyLv7D @ChrisThomp_ If it was easy, then everyone would do it. You've got this, Chris. 👊 Sport has the power to change your life.\nSport has the power to change the world.\n#SportChangesEverything https://t.co/bAfYicbuFb @chrisponder74 Rev your engine and leave that 8 minute mile in the dust, Christopher. https://t.co/kW10oxdgsS @kylepholmes Hey Kyle, DM us your size and location, and we'll look into your options. 👍 @dujosu No word on that at this time. But, you can still rep the 🏆 squad. | https://t.co/uubmrkWI0p @yoYEAitsDilly Letting go is hard, but now it's time for new milestones. 🙆‍♂️ @Mr_Alexander11 Looks like your miles matched your motivation. Keep it up, Alexander. 🏆 @bluehydrangeeaa Don't worry, Bella. You can still rep the team. 🏆 | https://t.co/3XlprXt3Nl @kahickey Four stars feels much better.\n\nhttps://t.co/KUXCuzFvLO @pressfowardhoop Look like a champion, feel like a champion. ⭐ ⭐ ⭐ ⭐ | https://t.co/ABsCHAQYVW @acanofmoeebeans We got you! | https://t.co/XT6txZPIc7 @kobenathen13 Patience is a virtue, and yours paid off, Nate. | https://t.co/LuRzR3xuWH @mstelmas It's right here, Michael. | https://t.co/3nyECBxvJH @moniquilla27 You asked, we delivered. | https://t.co/sMr6iwrJRq @DanielSeahorn We got some more for ya. ⭐⭐⭐⭐\n\nhttps://t.co/QtuQL9uFei @WakandaBS_isDis Fulfill that ⭐ ⭐ ⭐ ⭐ mighty need here. | https://t.co/0KtrP1DRB0 @lauren_stellaaa Ready, set, GO! | https://t.co/heRMmutHng @jbs319 We don't have specific players available, but you can rep the whole squad here: https://t.co/a8rLdCNvf2 @msaied56 Your patience has been rewarded. ⭐⭐⭐⭐\n\nhttps://t.co/RM6WK8RuzO @beacikz Oh, you mean this one? 😏 https://t.co/4yKEjx8kuI @Its__Ritz You got it. \n\nhttps://t.co/hkZS9BHTtt @j_legs 👀 \n\nhttps://t.co/RMnUhNrtK0 @NickStro66 We got all the sizes.\n\nhttps://t.co/e1fyIQjlxd @adamwfurlong Rep the champions.\n\nhttps://t.co/FgGcT0o39D @Gussie_12 Say no more. ⭐ ⭐ ⭐ ⭐| https://t.co/ymqv8tRWUa @noslenkay ⭐ ⭐ ⭐ ⭐ \n\nhttps://t.co/Rvw6yyo3Xo This team wins. Everyone wins. And that we will keep fighting not just to make history, but to change it forever. And that women will conquer more than just the soccer field, like breaking every single glass ceiling and having their faces carved on Mount Rushmore, And I believe that we will make our voices heard and TV shows will be talking about us every single day and not just once every four years, And that they’ll be inspired to talk and win and stand up for themselves, And that a whole generation of girls and boys will go out and play and say things like “I want to be like @mPinoe, when I grow up,” I believe that we will be four-time champions and keep winning until we not only become the best female soccer team, but the best soccer team in the world, I believe that we! I believe that! I believe! I! This team wins. Everyone wins.\n\nVictory is when we all win. It's only crazy until you do it. #justdoit @USWNT https://t.co/pBU7UE2IEs @AllanJTaylor Stranger things have happened. 👀 👉 📱 @muajazzd Say no more. ✋ https://t.co/gNb2WoeaXt @LongLiveRoyalty Our Air Force 1s are here to stay. 👊 @Cr9mson That style was released in kids, you can shop our available VaporMax styles here: https://t.co/Dye6VG6cy5 @GirlRunningTall Heat in the air and heat on your feet. You're on 🔥 @MarkKnapman Seems normal to us. 🤷‍♂️ @_1aboog We could never stop. | https://t.co/8kVT3PKmmc @PontiusScience Apologies for the confusion, no word on release at this time. Be sure to keep it locked to our SNKRS app for any updates. @RhusinX Nothin' like lacing up a new solemate. 🙌 @jp_stretch954 Get your Freak on: https://t.co/XEt7gsJXom @SirVIV22 At the moment, the Team India jerseys are only available at select Nike retailers across India. Stay tuned for any updates. https://t.co/yZjBG9vOqQ @TyRubleSign No news yet, but stay tuned for more to come from the line. Head to Nike News for a look at the inspiration behind the logo, and the making of the Air Zoom Freak 1. https://t.co/7dRXPoarqu @cieffe27 Puoi contattarci telefonicamente al numero 0238591453, dalle 9:00 alle 18:00, dal Lunedì al Venerdì, o via email tramite il seguente link: https://t.co/pGctdSsAt8 @Coffee17Girl That's not what we like to hear. Can you clarify when and where this was purchased? If it was with us send over your NikePlus email and order number via DM. https://t.co/klmMF0Q8Tn @loanmeadollar02 You got it. 👌 @cieffe27 Ci piacerebbe aiutarti con la tua richiesta. Inviaci un messaggio privato con il tuo indirizzo email e il tuo anno di nascita. https://t.co/klmMF0Q8Tn @AaronPhilly97 Make sure not to burn your feet with that 🔥😎. @NotElectro Sorry to see that. Can you let us know when and where your pair was purchased? @loanmeadollar02 We don't have any wide versions at the moment, but the Nike Tiempo runs wider than most of our soccer cleats. Have him try them out for 30 days, and return them for a full refund if they don't work out. https://t.co/LCfNi8ehha @LiLiSorensen You'll find the 'Hawkins High' Air Tailwind 79 in men's sizes 4-12, 13, 14 and 15 on 6.27. @PatrickGreen51 Good news!, although her jersey ins't available in Men's sizing on our site, you can create a customized Men's 3-star jersey through our authorized retailer US Soccer Store. Grab your gear here: https://t.co/43M2ydVldc @DStanley_ 👀 \nhttps://t.co/41oOHlyG0H @DStanley_ We'll do our best! Send it on over. @jerrkson You're good. The AF1 is here to stay. @tccasillas 🙌 RT @nikebasketball: Fate can start you at the bottom. Dreams can take you to the top. #justdoit\n\nCongratulations to the 2019 Kia NBA Most V… @HAWYEE420 No word yet. Grab the Australia 2019 Stadium Home Women's Soccer Jersey in the meantime. https://t.co/KIZzW5DIGD @TyMeece These are the shoes you're looking for. 👋 @wilkinsonj1966 Sorry to hear that, John. Give us a call at 800.344.6453, and we'd be happy to look into this. @AE9941 Run the day or the day runs you. Great work out there. 👊 @BonjourNino @snkrfrkrmag Get with the times, Nino. 😉\n\nhttps://t.co/pROyeVk8xq @clmbien Careful not to wait too long, those Wildhorse 5s are begging to blaze a new trail. 👀 @whitneyalana_ No better time than now, Whitney | https://t.co/wqRowoBBdC @MsFisayo All about the right motivation and effort. Keep showing'em you mean business. https://t.co/PsaBgDDkjK @1FuneralFatty Ready to burn the streets with that 🔥. Clean. 👌 @MaceWinduWiper Caution: These shoes will activate unmatched speed. Looks like wishes do come true. 🎂 @BlendedDadUK Birthday boots always look better in motion. ⚽ @ALXT05 We see blue skies in the near future. Looks like Saturday is gonna be perfect Sacai weather, so get ready to bring the heat. ☀️ @bigrmorales How about an all white pair? Have him write down his crazy dreams and watch them come to fruition: https://t.co/AznNucZkbj “Athlete in Progress”\n“Athlete in Progress”\n“Athlete in Progress”\n\nNIKE Track &amp; Field c/o @virgilabloh featuring @caster800m https://t.co/b1Qw3QaH0v @joevankas Quick one to start the week?...... More like killing it at the start of the week. https://t.co/KRY883kVfE @CDarnall1 Hey Chris, you've got good taste. This particular colorway of Golf Tour Premier isn't currently available, but check out this pair for a similar look and feel. https://t.co/cacBy7HJaH @uneedaheadstart Making all the dads at the BBQ jealous. @HazMatttt We got you, Matt. https://t.co/SEKiFQyzwI @BillyWh51593779 Looks like you need more feet 🤷‍♂️ @JeroBuezo Hey Jero, how was that run today? @slexyman The features on our Zoom Vaporfly 4% can make runners up to four percent more efficient than our other previous shoes. Sounds like there might be a marathon in your future. 👀 @ACarillion With heat on your feet, nothing is standing in your way. https://t.co/nLRCwyIR44 @USAhunterCTH Rep the squad. Alex's Jersey is on our site; grab it while it lasts. https://t.co/xUwrrNmoPC @asanz20 Great choice. 👀 Be sure to keep it locked to our SNKRS app for any updates. @HOLLYandherEGO These are the Air Sock Racer Ultra Flyknit, which were also created for women! 🙆‍♀️ We don't have them available on our site at the moment, but you can check out a similar style here: https://t.co/g7AAZJ4CBn @reydearmas Family goals. ⚽ Happy Father's Day Rey. @JeroBuezo How about tomorrow? https://t.co/jyKFS5wyiN @MichaelSmock1 Heat wave. 🔥 @Michelle_Ann511 We found something for you! You'll love our Nike Flex RN 2018, and they're on sale. 😏 Grab yours here: https://t.co/oN8F0ghONK @GerrardMaynard No need to fear, you can grab your pair today, Gerrard. Cop 'em here. | https://t.co/kqjMCpAT0z @inasuc Getting back at it in a strong way. Again tomorrow? https://t.co/lH7qztHXHk RT @nikebasketball: It’s only crazy until you do it. #justdoit #nike #NBAFinals https://t.co/Awikq1nMdE @HateMeNow502 These Nike Air Force Max Basketball Shoes come pretty close. 🤷‍♂️ | https://t.co/TViqbycoYr @andypentland Glad you agree, perfect for those ☀ days. Grab yours before they're gone: https://t.co/24sm1uVXEM @LalaSpicer Sometimes you just wanna stand out. 🤷‍♀️ | https://t.co/M3LROwISf3 @ryennjessica Hey Ryenn, cop the hat here. | https://t.co/ZjjZQLea6F\n\nComplete the fit with the polo here 🏌️‍♀️ : https://t.co/7krADuwcG7 @RatanSaxena12 Hey Ratan, Nike receives many requests for information about our company and can't address your request individually, but we have many resources we recommend checking out. Head to https://t.co/B9KpeDSQ1J, https://t.co/zf1pfhlcyd and https://t.co/jBnseOAdlH to learn more. @mjwysk Hey Michael, we have a pair dropping through our SNKRS app on Saturday, 6.15. Keep it locked here to grab yours: | https://t.co/bqqql8Xwx3 It doesn’t matter what you play. Nobody wins alone. #BeTrue #UntilWeAllWin\n\n@caster800m @TheChrisMosier @ScoutBassett @KerronClement @MarkMcKenzie4_ @EricKoston @S10bird @brittneyGriner @jordin_canada @jewellloyd https://t.co/veA9PtqwbW @niceANDneat_ Great pick. 👀 Keep it locked to https://t.co/yYv8xSbp4x for any updates. @JulTheSavage Sorry. 🙃 DATE: June 12, 2019\nCONFIRMED: Shipment from Beaverton, OR\nSTATUS: In-Transit, Hawkins, IN\nETA: Scheduled, 6/27/19\nETA: Scheduled, 7/1/19\n\nThings will only get stranger...\n\nhttps://t.co/vYVO0OgSQT https://t.co/M1uo7EKqOz @whelan1966 Look no further: https://t.co/rSqQA2Z8Xr @jetsettingjoggr Let's get him geared up. They're available to pre-order now: https://t.co/2Q9Rvzksko @jjjose74 @swipathefox @SacramentoKings @sactownroyalty Heat check. ✅ @oymnutrition They only know one speed—fast. https://t.co/T6Kr7IWC2N @k3yy3 Overcoming obstacles like it's nothing. Dreaming is limitless. ✔️ @shellyldowns No word on that yet, Be sure to keep it locked for https://t.co/yYv8xSbp4x for any updates! 🎾 @k1rkky Thanks for waiting, Kirk. Your pins are on their way to you. 🙌 @shivamsharma There's no time like the present. 🏃💨 @_WindyCity Stacking up those miles like a boss. That's what we like to see. 👍 https://t.co/eINeci1U5y @kihmberlie Picture perfect. 📸 Crazy dreams take crazy effort. \n\n18 career majors. 12 French titles. Congratulations @RafaelNadal. #justdoit https://t.co/AoHOXKIqOn @Kelvin28495443 He's got good style already. 😎 @sofiakhantoru You forgot one!\n4. Shamelessly dream further to change the world. ✔️ @Saint_Grobian You know it. https://t.co/FU8gNTYEc4 @TheMarkLong That's not quality we like to see. Can you share when and where this was purchased? If it was with us send over your NikePlus email and order number via DM. https://t.co/klmMF0Q8Tn @Aceboogie859 That's odd, we're not sure how that ended up there. 🔍 @Offingtonchick Hey Patricia, the Nike LD Waffle Sacai is sold out and there is no plan to restock at this time. Keep it locked to SNEAKERS for the latest launches. | https://t.co/J6sXgqZwKy @ShawnWheeler021 That's not what we like to see. Can you DM us your NikePlus email and order number? https://t.co/klmMF0Q8Tn @noah_firkin Hey Noah, great choice. For updates on this shoe, keep it locked to https://t.co/yYv8xSbp4x. 👊 @lilylouise13 New colorways are always dropping. Keep it locked here for the latest 👇 https://t.co/rpKgzPliyV @juelzswangloww No worries. The Air Force 1 is here to stay. Be sure to check out our current collection on https://t.co/yYv8xSbp4x @Lisa_Vogley We love when solemates meet. ⚡ @emory_byrum Definitely hard to compete with but... https://t.co/HhW70oMB97 @michelletheoxo The first of many. https://t.co/h2l2kl8GCr @ashleeeybash There's only one way to find out. Take advantage of our 7-day free trial for NTC Premium here: https://t.co/7nasxElYmV @hishoeco Be careful not to burn your wooden floors with open flames. 😎🔥 @davidjohn06 While Air Max models typically feature Air-cushioning units within the midsole, VaporMax Air units act as standalone outsoles which allows more Air under your foot. You can find more info on the Nike Air VaporMax here: https://t.co/MXbc179eU7 @LAsneakerdad24 We're excited to see her to dream further. Are you ready? @abhishek_tri She’s never too young to dream further. We’ll see her on the pitch one day. ⚽️ @AllieR913 Dreamers cry too, Allie. 😏 @kathyiniowa Dreaming has no age limit. ✊ @Stephkpifer Dreaming further means elevating your game. 🙆‍♀️ @marisagettas Lace up, we're just getting started. @Dada__M Make room, we have dreamers coming through. 👀 @jeanpaulPM Spread the word, dreamers are taking over the 🌎. Don’t change your dream. Change the world. #justdoit https://t.co/0cJ1ZTPyVn @gregthomson31 Hey there Greg. Are you referring to our Nike Fit Digital Measurement feature? If not, can you send us a screenshot of, or elaborate further on what you're referring to? @4letenya Make room on the mantle. 🏆 @BrandonHyska The course is waiting, grab yours here: https://t.co/RlJbQJGOnP @ColtDev2 Saying goodbye to your solemate feels wrong, but new shoes feel so right. We found a similar style waiting for you: | https://t.co/vPtI727qUq @brandonian133 Coming soon. ⏳ https://t.co/Iq6LynEllc @memnto02 The wait is over, the 2019 BETRUE collection will release at select global retailers on June 1st, and on June 8th in North America on https://t.co/7MDzu2ZvdA, SNKRS and at select Nike stores. You can read more about our collection here: | https://t.co/t12mbDBYPQ @Travis_Gonzales Hey Travis, great question. We are proudly supporting over 20 organizations this year to advance the LGBTQIA+ community through grants administered by the Charities Aid Foundation of America. Follow this link to read which organizations: https://t.co/IgHT0l8KBh @MarkStuart46 Way to get after it, Mark. While the challenge has ended, let's keep it going into June. Have you checked out the custom challenges feature of the NRC app yet? @memnto02 Good question, Samuel. No word on a release date yet, keep it locked to https://t.co/yYv8xSbp4x for any news. 👊 @ajibolajosiah Don't worry Aji, when you wake up from your dreams, the Air Zoom Pegasus will still be there. 👌 https://t.co/1hq8V7qh1g @tlopj_ There is no word at this time, PJ. Stay up to date on our site for any updates. @DH22018 Improvements every day. You got this.👊 @totakethetrain No word on that yet. Keep an 👀 out on our site for release dates. @totakethetrain Hey Cooper. Keep it locked to our site for any updates regarding our Nike Air Zoom Pegasus 36 Trail, or you can refer to this article here: | https://t.co/ZmCmRzxaBK @danidowling Look no further. We got select Air Force 1 styles on sale with an extra 25% off here. 👀 https://t.co/qYu17lAEYc @dodoy_DRP We're unable to see available stock in your area in stores. We recommend contacting them directly to inquire further. @tiffpeezy Good question. No word on a release date for our BETRUE collection quite yet. Keep it locked to our site https://t.co/yYv8xSbp4x for any updates. @dodoy_DRP Hey there. You can shop our Tennis Shoe collection via our site here: | https://t.co/aKmBBe6B5s @JoshColeman Look good. ✔\nFeel good. ✔\nSolid run. ✔ @KutzStacie When the shoes talk, we listen. We think that shoe is telling you about our updated options, you can shop similar styles here. | https://t.co/LcnSMbcRcT @heyalexchoi Great question, Alex. We recommend keeping it locked to our site for any updates. You can shop our current men's tanks here: | https://t.co/pFwGkmL0uu @j_architec Hey James, have no fear the Flyknit technology is still here. Check out our latest and greatest. |https://t.co/vABaDqB3hi @CaesarMaximous No need to worry. We've been producing our classic Air Force 1 shoes since 1986 and don't plan on stopping anytime soon. 👊 @abitsirly No word on that collection quite yet. Keep an eye out on https://t.co/yYv8xSbp4x for any updates. @FluentStep The outsole features optimal rubber for efficiency and traction. Time to break some records. 🏃 https://t.co/3OHE6PH9UQ @nfkb No release info to share at this time. For updates, we recommend keeping an eye on the SNEAKRS feed. https://t.co/BEODmuANQ5 @nfkb That's right. The Air Zoom Pegasus 35 has comparable cushioning that's applied to the full length of the shoe to ensures a more fluid and natural transition between the heel and the tip of the foot. Check it out on our site here: https://t.co/yU8txN6V21 @CSSully Grail quest complete. 🏆 @gartonjonessw1 Why don't we go from 'battered' to 'brand new'? You can shop similar styles here when you're ready to let go, Kieran. 🤗 | https://t.co/MZe7pW7cb6 @JamieWelshICE If it was easy, everyone would do it. We got you, Jamie. 👊 @nfkb The Nike Air Zoom Streak 7 has a Cushlon midsole with a Zoom Air unit in heel for responsive cushioning. The Air Zoom Pegasus 35 will provide a similar fit and feel as it features a full-length Zoom Air unit housed in a premium Cushlon foam midsole. https://t.co/kOTPRJrbPO @TP_VILLAIN New Air 👟\nNew heights ✈️ @ktptn 8 years in the making and got that full count down. Time to go for a 67890. https://t.co/swjYRa5NR3 @tangoislaura Sorry to hear that, Laura. Please give us a call at your earliest convenience. We can be reached at 800.806.6453 (4am-11pm PT, 7 days a week). @leewestwood11 Good catch, Lee. Thanks for bringing this to our attention. We've looped in the appropriate teams and hope to have this fixed soon.  Let us know if there's anything else we can help with. @TarynPapa @nikestore @usta Look good, play better. Now show us your Ace. https://t.co/KCRy83Junl @chris1ireland1 Unfortunately, we are unable to review products for authenticity. To buy genuine Nike products, we recommend shopping with Nike directly or authorized Nike retailers. @SellinqDreams Hey Arisleyda, no word on the VaporMax being available in Preschool sizes at this time. Keep an eye on https://t.co/yYv8xSbp4x for any updates. @honesetly Greatness awaits, Lauren. We'll see you on the pitch. https://t.co/ADJ55yALzg @DadGrit Dad. ✅\nOn sale. ✅\nShoes to rock on the grill. ⬜\nhttps://t.co/0o8IMWHW4A @HiraASiddiqi Way to stack up that mileage. Again tomorrow? https://t.co/dr8Gm40PEd @michelletheoxo Full gear ready. Let the training begin. 💪 @thisisgislane Hi there, Gislane. How was the race yesterday? Did you reach any new PR's? It’s only crazy until you do it - again, again, and again. #JustDoIt  \n\nCongratulations @BKoepka on your 4th Major title. https://t.co/CFMkGSxHHm @Dragn73 Always respect the course, never fear it. Enjoy the chase, David. ⛳ @lukemelloh12 No word on if/when that style will release. Be sure to check out our current line of hats here: https://t.co/VRmKRw5wgi @coleyja Great question. We recommend checking out our size chart for specific measurements to ensure you secure the best fit for your son. You can find it here: https://t.co/QeiV78JiOA @RauchClinton Saying goodbye to a sole mate is never easy. We can help you fill that void here. \n| https://t.co/gXstQ8ufnA @HandsomeIsland Thanks for letting us know. We recommend working back with the original retailer to discuss return options as they can provide the fastest solution. If they're unable to help please visit here to view our claims process: https://t.co/7tSPlPMaSd @mathinho79 Putting in those hours day and night. That's how it's done. https://t.co/UkvPowRwq5 @guilda_h Work hard, play hard. We see you.👀 https://t.co/SIrAUSbgNQ @BleackleyScott Hey Scott, we got you. Grab yours here. :https://t.co/AtDqYeW0GS @_JoshHolman Time to get yours. https://t.co/KWZ7Q5YdXL @Joe90Taylor Great question. It looks like those are part of our Air Max 95 collection. You can shop similar styles here: https://t.co/xksfG2o1j2 @MarkTFrazier We got all the links. ⛳ https://t.co/kZ5kthqSgS @Zedediahh There is no word at this time. Keep it locked to our site for updates. @Zedediahh That exact style isn't currently available on our site, however, you can shop a similar one here: https://t.co/ST9wwAFyGl @simonlegray Right here. https://t.co/sGgYyTFqVA @SideHustleSprts Time to gear up for the weekend. https://t.co/3ugBDYercW @ryan_caldon Thanks for reaching out, Ryan. We recommend signing up to be a NikePlus member. It is free to sign-up and offers free shipping, promos, unlocks, exclusive access, no shipping costs for returns and more. You can read more here: https://t.co/EptdRJ2852 @Jakeyd14 We got you covered. https://t.co/xdWtoGCMnf You don't have to have much to dream. #justdoit @JDayGolf https://t.co/Y7KQGk2jZg @roadside_365 Out with the old, in with the new. You can shop similar styles here. | https://t.co/I42NNHAHnW @yikesoscar Amazing is just around the corner. We'll see you out there again soon. https://t.co/xaQrXkSATV @Palle_C We don't have that information readily available. We recommend contacting stores ahead of going to check. @Palle_C Hey Pauli, there is no word at this time. We recommend keeping it locked to our site and local or online authorized retailers for potential availability. @ACpoker0271 The Kyrie 5 Basketball Shoe features a supportive upper, and the flytrap-inspired overlay helps you stay locked in by clamping down over your midfoot. In the event you have more specific or technical fit, or support concerns, we recommend consulting a Podiatrist. @beantwnbeatdown Yep. The Oregon Project is an authorized Nike retailer. Let us know if you have additional questions. @lorenaclarios1 First, but not the last. See you tomorrow? https://t.co/SiPwR7JABz @TheeGreatHim That style is the Air Challenge LWP. Read more about this style below. https://t.co/RKpIZGymne @qnsny36 That's the Nike Air Challenge LWP, which originally released back in 1995. Let us know if you have additional questions. @iLNxTasTyy It's pronounced neye-🔑. Having a dream won’t change the world. Sharing one will. #justdoit https://t.co/vIw16Y4e3Q @itsDaiisy Sneakerhead born and Bred. @SV_safetypin Continue to push the limits. https://t.co/CdcKSmd22s @CarlotaLevi17 ¡Muchísimas gracias por ese fantástico y positivo feedback! Nos encanta saber que disfrutas con nuestra App NTC. ¡Sigue así de activa! Just Do it! 💪 https://t.co/klmMF0Q8Tn @ItsFangs Sun's out, 1's out. @noah_firkin No word on a restock at this time. We recommend staying tuned to the SNKRS app for updates and checking with local authorized retailers for possible inventory. https://t.co/klmMF0Q8Tn @brianv_graphics Keep crushin' it. 💪 @Jess__lm No need to worry, this is just story. The Air Force 1 is here to stay. @MeechieeBaby Good news. The Nike Shox R4 is back, and you can find them here: https://t.co/ZnptuD3W0R @Laflare2G Nike has retired some of its social accounts to better focus on serving customers. For help with all things Nike, be sure to follow @teamnike. @rwmowbray That's not what we like to hear. Can you let us know where you purchased your pair? If from our site, please DM us your order number, and we'd be more than happy to explore some options with you. https://t.co/klmMF0Q8Tn @EEMA_BEE1 Hey Emma, she's guaranteed to love these. https://t.co/fjG4lodjQL @KangacepeZulu Hi there, Kanga. We wanted to check in and see how the race went. @sharathmekala Setting new PR's and planning new goals like a boss. Way to put in that work. https://t.co/dGyCpBw1gb @Dayennexo The Air Jordan 1 High 'Travis Scott' will be available in Men's sizes 8-12, 13, 14 via SNKRS. https://t.co/IZU0a39wgz @SMEC_UK We're glad to hear that these got you through your marathon. We've also sent you a DM with some additional steps. If you ever have any future questions, we'll be here. @shesnutella That was not a tweet from our handle. Don't worry, we still got 'em. 👍\n | https://t.co/KtdqmWBvWX @CDiDDY_3162 Just a false rumor. That was not an official tweet from our handle. Checkout available Air Force 1's here. | https://t.co/GnhhxFwxVd @PeterOelofse Hey Pete, those are the Air Span II Premium. Search our site or the Nike app for potential availability with style AO1546-001. @OGKushBeats The tweet that surfaced was not from our official handle. Check out available Air Force 1's here. | https://t.co/gGfvGRGMtZ @lexi22j The tweet that surfaced was not from our official handle. Check out available Air Force 1's here. | https://t.co/yYq3JVXZii @breannaa_angel We hear you, Breanna. Sign-up for a student discount here. | https://t.co/4WaBsQ2JWE Never slow down for the world, one day it will catch-up with you. #justdoit https://t.co/xx2UzmQ0Bw @nat_roe Now show us what crazy can do. @shot30hoodies The rumors are false. We are not discontinuing the Nike Air Force 1. The tweet that surfaced earlier with that information was not an official Nike tweet. @mbungelam Ready when you are.\nhttps://t.co/2bny1SiZJU @SmooveDraco Just a rumor. That was not an official tweet from our handle. Checkout available Air Force 1's here. | https://t.co/HHLK1u7N99 @Burr4DaWin That was not a tweet from our handle. We still got 'em. | https://t.co/D5RrkKLmHK @BrooksBabineaux Rest assured, the Air Force 1 is here to stay. @SMEC_UK No matter the circumstances, you're still finishing like a boss. Congrats on your marathon, Simon. Would you be able to send us a DM with your NikePlus email? https://t.co/klmMF0Q8Tn @Kingcdubz Unfortunately, we don't have any news to share of a release in that colorway. Be sure to check out our current lineup of the Nike Shox, and keep it locked for any updates here: https://t.co/LNVsb0zfiL @mazvitaxmupazi The tweet that surfaced earlier with that information was not an official Nike tweet. Rest assured, we are not discontinuing the Nike Air Force 1. Let us know if you have additional questions. @the_joel13 We definitely apologize for any confusion however, we can ship orders placed on our site to APO/FPO addresses. Please note, it can take 30-45 days for your order to arrive, and launch items are excluded from these orders.\nhttps://t.co/OvBxcWh1cT @raymfdizzle The tweet that surfaced earlier with that information was not an official Nike tweet. We are not discontinuing the Nike Air Force 1. Feel free to holler if you have additional questions. @KangacepeZulu Getting in that last run before the big race. That's how it's done. Best of luck tomorrow. https://t.co/2MpRZMhmiz @landon_p__ Apologies for the confusion, Landon. The Air Force 1 Flyknit 2.0 will release on 6.1. Check out our current lineup of the Air Force 1, and stay tuned for an update here: https://t.co/4dlgSpjdDk @garybohlke Hey Gary, when one door closes another one opens. Meet the new most comfortable shoe you'll own. https://t.co/d784xWH4bA @JamezBlak @slyalubo @amasonic @_Sir_LeRoy @misskucheli We're glad to see you back in action, Heriju. The track is where you belong. https://t.co/pU4buCEqLj @chirag1patelinn Dreaming crazy since day one. 💭 @liliteraria It's official. Let's get to work. 🏃‍♀️ @sanchoYmoi Here to lend a hand. For us to assist with this can you send over an image of the hoodie? @VanessaLopicco2 They're here to stay. | https://t.co/Z9YXhriRDt @MmatuManuel Hola Manuel, encantados de ayudarte. ¿Podrías enviarnos un privado especificando lo que te está ocurriendo, aparte de enviarnos tu correo registrado con nosotros? Comprobaremos todo en nuestro sistema y ayudaremos en todo lo posible. Te esperamos y saludos. https://t.co/klmMF0Q8Tn @JM_Depp Hola José, encantados de ayudarte. Nike a partir del 30/04 ya no da soporte al Nike Sport Watch y otras tecnologías y aplicaciones más antiguas. Aquí te dejamos un enlace con toda la información: https://t.co/Xp3VVmD5uS. Sentimos las molestias que te pueda causar. Un Saludo. https://t.co/klmMF0Q8Tn @PrettyBoyyFloyd Rest assured, the Air Force 1 is here to stay. “Believe in yourself and trust that your mind and heart can break barriers.” @eliudkipchoge\n\nCongratulations on your ninth major marathon win today in London.\n2:02:37 #justdoit The greatest field in history just ate her dust.\n\nCongratulations, Brigid Kosgei, on your masterful London win.\n2:18:20 #justdoit @kwelxx They're here to stay. | https://t.co/0zHyJT9MbF @nat_roe We made something for you. 🤩 https://t.co/iUMmreKF6f @stanley_otter Zig or zag, rain or shine, we'll be by your side. Welcome to the family, Kevin. https://t.co/FZbqM4V1Cq @mathinho79 That moment when the hard work and sweat was worth it. 🙌 @Sirvichugo Let the odds be forever in your favor. https://t.co/utKWuMegpC @flood_fn Have no fear, the Air Force 1 is here: https://t.co/qu8DW7Iwcv @joeee1k_ No need to worry, the Air Force 1 is here: https://t.co/0xBvcdqsWd @glowyjhope No fear, the Air Force 1 is here: https://t.co/SIpIGxT9vh @joevankas Breaking in those bad boys in the best way possible. How do you like them so far? He’s done it all. And he’s just getting started.\n\nCongratulations on #1, @TheKylerMurray. #justdoit https://t.co/BdEIRkeslC @GamingwithDjb The tweet that surfaced earlier with that information was not an official Nike tweet. We are not discontinuing the Nike Air Force 1. Feel free to holler if you have additional questions. @RetailAmit Hi Amit, while we don't have the Lunarglide anymore, we think you'll love the Epic React Flyknit 2. Check it out in some fly colorways on our site. https://t.co/Iou7OyiVCP @rexklessjb1 While we love your passion for the brand, we proactively seek opportunities to endorse our brand and don’t accept unsolicited sponsorship requests. @Youngrichhomiee No need to worry. The Air Force 1 isn't going anywhere. @alvaromcxv Rest assured, the Air Force 1 isn't going anywhere. @PrettyBoyyFloyd Have no fear, the Air Force 1 is still here: https://t.co/6N5jIV5drq @ReYbBuSY We appreciate your feedback and have now passed this onto the relevant team. @GeekDadGamer Hey Andy, go ahead and reach out to our Media Relations office at 212-367-4447 or media.relations@nike.com. @joshd2 Makin' it look easy. https://t.co/nnjkzVfN1v @aman786712 Have no fear, the Air Force 1 is still here. | https://t.co/nsWZRPBNXI @atthatonekid That's the spirit. Got any races coming up? https://t.co/0K61yJ0vdj @atthatonekid Just a little more to go. Afterwards, another 100 mi. 💪 @dk_bil T-minus 5 days...🚀 @M_C_777 We don't have that style available to customize anymore, but there's never a bad time to upgrade, right? https://t.co/lp3aMSVhtA @delmaria1x Sorry for the confusion; we did not send that Tweet. You can find Air Force 1 styles still on our website here: https://t.co/3T4jrwwIIf @ZachZilla3R Hey Zach, sometimes new is better. Try them out for 30 days and if they aren't for you, send them back for a full refund. https://t.co/RT1PGf0MuA @armgra 5 km corsi, il tuo record personale abbattuto e noi siamo orgogliosi di questo traguardo. https://t.co/JqPv0b5Wxe @eswold11 Core crushing your way into Monday. 👊 @elevatedsoleslv Nike has retired some of its social accounts to better focus on serving customers. This is part of our constant focus on delivering the best experiences and services to athletes. @johntrepreneur It's amazing what the right pair of shoes can do for you. Welcome to the family, John. @RelatableJulian Hi.\n\nhttps://t.co/b2G8ihXAPd https://t.co/67bhX1CCMK @iamobinnaoforah More to come. 💪 @triplebeams22 Way to push through the pain. 👊 @noamseg We'll be here all along the way; the first one is always the hardest. 💪 @jim_gruhn Keep putting in the work. 💪 https://t.co/XGy3d3UHjh @shidume Unfortunately, our Reuse-A-Shoe program is only available at select Nike and Converse factory stores. We recommend checking with the location prior to taking your shoes in, and you can find the closest store in your area here: https://t.co/X4l7Z1pjJq @IntegranWo No news to share at this time, Fernando. Be sure to check out our current Air Max collection, and stay tuned for any updates here: https://t.co/noRqwykkB9 @ogepercy Makin' it look easy. https://t.co/4iw0NYETDx @KaedenCooper4 We appreciate your interest, Kaeden. If you're looking to become an authorized retailer of Nike, you can fill out an application at https://t.co/ynzrdvkUYZ. Once submitted, the application will be processed within 60 days. Let us know if you need anything else. @D_Matthew5 We are ready for your next thousand mile journey. 👊 @Rofuaz1 Vaya, lamentamos ver eso. ¿Nos podrías decir donde/cuando realizaste el pedido y si fue online, enviarnos un MD con el número de pedido? Un saludo. https://t.co/klmMF0Q8Tn @vitoriavonb Hola Victoria, genial que quieras unirte a nuestra familia. Tenemos que comentarte que actualmente es Nike quién, a través de un equipo, busca a los atletas/equipos para realizar las exponsorizaciones. Un saludo. @RuuSs_ Ruth, te hemos enviado un email con la etiqueta y las instrucciones para tramitar la devolución de forma totalmente gratuita. En cuanto el pedido llegue a nuestros almacenes recibirás un email confirmando el reembolso del mismo. Un saludo. @andreiasjoaquim It was worth it. @Txxr45 Gear. ✔\nMiles. ◻\nSee you on Friday, Ty. @godley_mackie We've got options. | https://t.co/FbBv7DqaoH @mikquela Hey Michela, thanks for reaching out. While we celebrate and recognize the value of academic pursuits, we are unable to share some proprietary information about our company, such as marketing initiatives. With that said, we wish you the best of luck the rest of the semester. @JosMoJo Thanks for letting us know. We recommend working back with the original retailer to discuss return options as they can provide the fastest solution. If they're unable to help please visit here to view our claims process: https://t.co/7tSPlPMaSd @MrGads2 We've got you covered, Wayne. https://t.co/SBqvj511oS @hoodyx You're just getting started. @MINIHMAL Puedes hacerlo a través del siguiente enlace. Un saludo https://t.co/klmMF0Q8Tn @MINIHMAL Hola, un placer. ¿Nos podrías enviar un MD con el número de pedido y/o email que usaste en la compra? Un saludo. @JosMoJo This isn't the kind of thing that we like to see. For us to explore some options can you let us know exactly when and where you purchased your flip-flops? @RuuSs_ Lamentamos lo ocurrido. ¿Nos podrías decir donde y cuando realizaste la compra y si fue online enviarnos un MD con el número de pedido y/o email que usaste en las misma y así revisamos opciones? Un saludo. @xXLUJOXx Hola Luis, lamentamos lo ocurrido. ¿Nos podrías decir cuando y donde realizaste la compra y si fue online, enviarnos un MD con el número de pedido y/o email que usaste? Un saludo. @DrMikeDevlin Squad goals. @Bryainiac We're sorry to see that this has happened to your shoes. For us to explore some options can you let us know exactly when and where you purchased your shoes? If purchased on our website send over a DM with your NikePlus email or order number? @VillainousCos Actually, it would be more along the lines of 'Nigh-key'. @HandsomeIsland Sorry to see that. Can you let us know when and where you purchased your pair? We'd be more than happy to explore some options with you. https://t.co/klmMF0Q8Tn When two runners put their hearts on the line, the world watches in awe.\n⠀\nCongratulations Lawrence Cherono on winning one of the hardest fought races in Boston history. #justdoit https://t.co/6MPESh7rER @nola2mem Apologies for any confusion, Raven. The Air Max Heron Preston By You is currently available on our site here: https://t.co/cvPqBo9pEg @robykkk Siamo qui per te. Inviaci un messaggio privato con tutte le informazioni del tuo acquisto così da poter tutelare la tua privacy. https://t.co/klmMF0Q8Tn 40 years later, Joan Benoit Samuelson is still running after those same crazy dreams. #justdoit https://t.co/GgKElUEhWw @zacmatnahar Full gear ready. Let the training begin. 😎💪 @EduZerbo ¿Nos podrías decir el modelo que usas y donde/cuando lo adquiriste? Un saludo. @AntonitoPerez9 En este caso para obtener ayuda tienes que volver al distribuidor donde realizaste la compra para revisar las políticas de devolución/cambio. En caso de que ellos no puedan ayudarte solo coméntanos. Un saludo. @kenny_bacille We have wide golf shoe options available as well. Check them out and let us know if you have any questions. https://t.co/UuEAURvVBE @Oneputtlefty Go to town. https://t.co/lTTt9gZUIX @JustinHerzig Come and get it. https://t.co/2txeMu6Yrs @betsywaddell Coming soon, Betsy. Sign up to be notified when they release at the link below. | https://t.co/QZxaKIqUIR @kenny_bacille It's that simple. https://t.co/mAYpJYRRhZ @dex_ou 👀\n\nhttps://t.co/ebO1b1zgWx @Simon_daniel01 Our apologies, looks like this colorway isn't scheduled to release in the UK at this time. Stay tuned to the page below for the latest release info for the UK: https://t.co/SNYjZw8iq4 @Simon_daniel01 Hey Simon, a fresh, new colorway is droppin' 4.19 on SNKRS. Keep an eye out for it. https://t.co/ry8KxVaWej @mruger50 Speed is the only option in these: https://t.co/m1Qf073y0N @seanwelchwrites We may not have red yet, but we got options. 🙌https://t.co/juZwpwIrnb @RzJse Este modelo se lanzó entre 2015 y principios de 2016, de ahí que esté agotado online. Te dejamos aquí un modelo similar para que le des un vistazo y nos comentes cualquier duda al respecto. Un saludo.\nhttps://t.co/0RX37FFJHJ @galvmilena_ Hola, gracias por tu interés pero tenemos que comentarte que actualmente es Nike quien, a través de un equipo, busca de forma activa a los atletas/equipos para realizar las exponsorizaciones. Un saludo. @AntonitoPerez9 ¿Y fue en una de nuestras tiendas o en uno de nuestros distribuidores oficiales? @sid_dharta Hey Winston, that hat isn't currently available in your region. Keep it locked to our site and app for future updates with style BQ1299-492. @teagvn Already got 'em. 🙌 https://t.co/eJXKysSRl1 @zagfreak Take your pick. https://t.co/MlEH2lGwUf @AntonitoPerez9 Hola Antonio. ¿Nos podrías decir donde y cuando realizaste la compra y en caso de ser online, enviarnos un MD con el número de pedido y/o email que usaste en la compra? Un saludo https://t.co/klmMF0Q8Tn @AshrafEngineer Setting new PR's in style. No better way to do it. 😎 @joedino_12 Happy to help. Feel free to DM us your questions, and please include an image of the product you're referring to if possible. https://t.co/klmMF0Q8Tn @kiraholmes01 Apologies for the confusion, Kira. If you're looking to become an authorized retailer of Nike, you can fill out an application at https://t.co/JSTCJF83X7. Once submitted, the application will be processed within 60 days. Let us know if you need anything else. @_lizzec You're welcome. 🤩 https://t.co/fImgIqO5lq @JonEHorton Hey Jon, The Nike Polo (CJ0880-010) is sold out at this time. Head to the Nike App for updates on availability. @kiraholmes01 Hey Kira, thanks for your interest in Nike. At this time, we are not accepting new business proposals. Although we cannot accept your request, we appreciate your interest in our business and wish you the best of luck in your future endeavors. @xoRosee_ No need to. 👊 https://t.co/QHEU0rdjPO @PTBNLater Unfortunately, The Nike Polo (CJ0880-010) is sold out at this time. Head to the Nike App for updates on availability. @jr_balzano Unfortunately, The Nike Polo (CJ0880-010) is completely sold out at this time. Check out our current Tiger Woods products, and stay tuned for any potential updates here: https://t.co/kIlcyJ8S7G @mjones3734 Hey Marcus, those are the Flyknit Racer, style code 526628-002. They were released in 2012 and are no longer available at this time. @TheRealCDaddy Unfortunately, The Nike Polo (CJ0880-010) is completely sold out at this time. Stay tuned for any potential updates here: https://t.co/p2TAuB9WAl @mushbets Unfortunately, The Nike Polo (CJ0880-010) is sold out at this time. Stay tuned for any potential updates here: https://t.co/jhHzR5TopA @jacqpalm2012 Need help with a product recommendation? Download the Nike App and hit up our Nike Experts on Demand. They'll help you make the best choice: https://t.co/wcoctWs6CU @MrRogers99 @TigerQuestfor19 @TWlegion @Tiger_Updates15 @JasonSobelTAN @GCTigerTracker @GolfDigest @GOLFTV @golfweek The Nike Polo was just released for preorder and has sold out at this time. Keep it locked to the Nike App or our site for updates. https://t.co/EytOxbtyyt @chrishawkinsPGA The Nike Polo was just released for preorder and has sold out at this time. Keep it locked to the Nike App or our site for updates. https://t.co/QFwtcByxGu @rociomyo De nada Rocío, gracias a ti por la amabilidad. Un saludo. @cagdabas Hi Calcium, bitte kontaktiere uns via Chat, Telefon oder E-Mail: https://t.co/sHlbxodLGU @clarixmarie Hi Clara, bitte kontaktiere uns via Chat, Telefon oder E-Mail: https://t.co/3ofjBHA06c @fruf82 En este caso Fran puedes enviarnos un email a través del siguiente link. Un saludo. https://t.co/MTEGy1Sqis @abrahamessi10 Al no estar disponible online te recomendamos visitarnos en tienda y de este modo podemos revisar disponibilidad contigo. Te dejamos aquí el número de estilo para facilitarlo en tienda (921948 600). Te esperamos. @cmurrell901 It's gotta be the shoes. Go get 'em, CJ. @itsbonniemac We got you. The price of items will not appear on an online receipt. @JaimeDeLen7 Hola Jaime, en este caso te recomendamos que nos contactes a través del siguiente link para ver que ha podido ocurrir. Un saludo.\nhttps://t.co/hKL2GUFSQd @sharkbait0889 We hear you, Daniel. Thanks for reaching out to voice your concern. We'll make sure your feedback gets shared with the appropriate teams. @Chloe92_ There's no news to share on when that style will be on our site in your region at the moment. We recommend checking with authorised retailers and online for availability. Stay tuned for future releases and check out our current running tights here: https://t.co/NZR6GSaccR @BULLCITYBOI @ussoccer_wnt Hey Marshall, we heard you wanted something. 🤔 https://t.co/Xw5P5pPRaW @ReignOfAnnie21 Get yours now. https://t.co/3HUeZSXViB @hookerrr Get your jersey now. https://t.co/34L7GDMAnl @Chloe92_ Hi Chloe, the Nike Power Speed Women's 7/8 Running Tights in XS are currently unavailable in your region. Keep it locked her for updates: https://t.co/PQiIh3wd61 @Phantom_Maggot Hey Ian, we've got something you're going to like: https://t.co/IyuDIpI54c @LISAFINE08 Hey Lisa, we've got the jerseys ready for you: https://t.co/VSmDUVGxLI @hlods Hey Heather -- heard you were looking for this: https://t.co/xKzbKxjlGY @mcsmith23 We got you, T. https://t.co/i45di6gaC5 @BestLifeDom Get yours now. https://t.co/IOZyF3a7f7 @transburrito Get yours now. https://t.co/vlvb1kcjMr @sportsnut1124 We've got you covered, Steve. Check out our latest New York Jets gear here: https://t.co/pHl5ZYTyf1 @uDrZed Great question, Zamani. At this moment in time there is no news to share a restock on that particular style. We recommend using the style code: BV7721-600 to check availability within local stores. @kikigarciaok Cristian, ¿nos podrías enviar un MD con el link desde el que te solicitaron la información? Welcome to the family, @Naomi_Osaka_ . \n\nhttps://t.co/8C48OWrLgr @kikigarciaok En este caso tienes que volver al distribuidor donde realizaste la compra junto con el comprobante de pago para hacer uso de sus políticas de devolución en tienda. Un saludo. @rcrowpatissier We stand behind all our products for material and workmanship flaws up to two years after the manufacturing date. If the original retailer is unable to assist, you can check out our backup claims process here: https://t.co/D2xBMy3rzu @SK8BRDG Marathon doesn't stand a chance, you got this. How's the training going so far? @Phantom_Maggot Stay tuned to https://t.co/yYv8xSbp4x and the app for your chance at a 3 star home jersey on 4.4. Red and White jerseys with 3 stars are scheduled to be available 5.9. @Samdromeda Hey Anromeda, we designed a pair for your big day. Let us know what you think. https://t.co/q9GoLSj7QP @armgra Ottimo Armando. Aspettiamo i tuoi 5km :) https://t.co/cgPyKxXcsQ @lauracarm0na En este caso la talla que buscas está agotada online. Te dejamos aquí el número de estilo del producto para que puedas visitarnos en tienda física y de este modo podemos revisar disponibilidad contigo. Un saludo.\nNúmero de estilo; AT3147600 @zxin_ahmxd No word of a restock at this time. DM us your size, along with our location, and we'd be more than happy to check stores in your area. https://t.co/klmMF0Q8Tn RT @usnikefootball: Some dreams are too big to dream alone.\n@obj x @God_Son80 https://t.co/tjFAvkEWgu @stagadw De nada, gracias a ti. Un saludo. @JessBertelsen Hey Jess, he is wearing the Nike Dri-FIT Top. Get yours here: https://t.co/XhsBqnEsU2 @LCoelho9 Way to dig into every KM.  👊 @HeleenPrssMttrs Hi Heleen, zou jij ons een privé bericht kunnen sturen met daarin jouw bestelnummer? https://t.co/klmMF0Q8Tn @stagadw En este caso te recomendamos que nos contactes en el siguiente número de teléfono y de este modo podemos revisar que ha podido ocurrir. Te esperamos. tel:+34913753366. @topero We got you, Thomas. Those are the ACG Ruckel Ridge (AQ9333-900). They are no longer available on https://t.co/yYv8xRTNFX, so we suggest working with authorized retailers in your area for any possible availability. @DJTopNotch Hey Bartley, we don't currently offer life vests. Keep an eye on https://t.co/yYv8xRTNFX for any possible updates. @virginiuu Gracias Virginia. Tras revisar el caso te pediríamos si nos puedes contactar a través del siguiente link para poder ayudarte. Te esperamos. \nhttps://t.co/XmAlrpnXsZ @itsStormCountry Wait until you try them on. 🤩 https://t.co/MUvKlcmhqw @TBuck14Gray Hey Terrance, we have some Kyrie Low By You that your daughter may enjoy. Check them out here. https://t.co/EHbF3sET3Q @nochebureki Nike proactively seeks athletes to endorse the brand, and unsolicited Nike sponsorship requests aren't accepted. @virginiuu Hola Virginia. ¿Nos podrías enviar un MD con la dirección de email que usaste en la compra y/o número de pedido y lo revisamos? Un saludo. @AllissaM_2 Saying goodbye can be hard, but who knew saying hello could be so good? https://t.co/PheCCjqJIZ @jessontheair Screen-name checks out. Happy #AirMaxDay Jess. #AirMaxDay is here.\n\nWhich pair are you rocking? Share your Air. https://t.co/ZR9r6lMRcC @_zzehrra Hey Zehra, check out our cleaning tips here. | https://t.co/QYUN0UOg8H @teenydiz Love is in the Air.  ❤️ @kikigarciaok Vaya, lamentamos ver eso Cristian. ¿Nos podrías decir donde realizaste la compra y si fue online enviarnos un MD con el número de pedido y/o email que usaste en la compra?. Un saludo. @sophdoesnails Look no further. Check out the Nike Air Force 1 Sage low here: https://t.co/TortHagc0F @vincentidabitur Let's get you back on track. For us to move forward with this can you contact us on +44 (0) 2076604453 (8:00 - 20:00 Monday - Friday and 8:00 - 17:00 Saturday) @imcade Hi Cade, can you send us a picture of the size tag? @Thaddylonglegs No word on that style re-releasing. If you're craving some waffles, you can check the link below for the Air Tailwind 79.\n\nDig in 🍽️: https://t.co/zPJ9Bfmv2I @kadetheinsane Nothing's holding you back, LeAndra. https://t.co/BOqlGZSy3f @HappyHBGilmore Hi harry, we no longer have the Nike Impact 2 available on https://t.co/5rMPUpPdj8. We did locate the Nike Impact 3 Men's Golf Shoe. Check them out here: https://t.co/KewvrruLlL @its_me_suzie Nike is always expanding and adjusting our Sponsored Nike Athlete family. Due to this we do not have a current, updated list of all athletes under sponsorship. @cody_flesher Hey Cody, thanks for reaching out. We proactively seek opportunities to endorse our brand and don’t accept unsolicited sponsorship requests. We wish you the best of luck in your future events. @its_me_suzie Hey Suzie, thanks for reaching out. At this time, we proactively seek opportunities to endorse our brand. @tweethn_ Hey Ethan, nothing to share about apparel for the Throwback Future Pack. Keep it locked to https://t.co/yYv8xSbp4x for any future updates. @DYBARDESCHI Ciao Alessia, ti suggeriamo di installare l'ultima versione dell'applicazione di Nike, prova a completare l'acquisto dall'App e scrivici in privato se riscontri ancora problemi | https://t.co/qPzXwX5GkO @raulmena80 Way to Just Go Bigger. https://t.co/pzpcChuAnL @gabrielafut Hola Gabriela, pues este modelo se trata de las Nike Air Zoom Pegasus 34 y están también a la venta para particulares. Este diseño pertenece a la línea de 2017/18 pero te dejamos el número de estilo con el que podrás preguntar por ellas incluso en tienda (880555-404). Un saludo. @louieBandito Zeker, dan kan je daarna het beste contact opnemen via de volgende pagina | https://t.co/ZGMJgOYnSP @EricCampbell71 Hey, Eric. Nike only considers ideas that are embodied in an issued utility patent, utility model, or a pending non-provisional utility patent application that has been filed with an appropriate governmental agency.\n\nMore info here: https://t.co/qGkHfZB3vV @LISAFINE08 Stay tuned to https://t.co/yYv8xSbp4x and the Nike App for your chance at a 3 star home jersey on 4.4. Red and White jerseys with 3 stars are scheduled to be available 5.9. @DYBARDESCHI Siamo qui per te, Alessia. La Nike Air Max 270, nella taglia che stai cercando, è disponibile sul nostro sito. Clicca sul seguente link per maggiori informazioni | https://t.co/Bo60S5nv8V @louieBandito Je hebt standaard 2 jaar fabrieksgarantie op Nike producten. Kan je ons een privébericht sturen met jouw ordernummer? Dan kunnen wij jou direct verder assisteren. https://t.co/klmMF0Q8Tn @CuriouslyStrong Stay tuned to https://t.co/yYv8xSbp4x and the Nike App for your chance at a 3 star home jersey on 4.4. Red and White jerseys with 3 stars are scheduled to be available 5.9. @yungnced Thank you for your interest in Nike/Converse/Hurley. We do not grant permission to use or modify our trademarks, logos, images, advertising or similar materials. Check out our Nike By You site for possible customization options. | https://t.co/DrFFjVf4X3 @yungnced Hi CJ, check out our available Nike Sportswear Pullover Hoodie's here: https://t.co/sQH2frGfUZ @josediego_16 Te dejamos aquí un link desde el que directamente podrás enviarnos un email con toda la información al respecto y así lo revisamos para ver de que modo te podemos ayudar. Un saludo.\nhttps://t.co/UbgnEL0wRH @josediego_16 Vaya José, lamentamos ver eso. ¿Nos podrías decir donde/cuando realizaste la compra y si fue online enviarnos un MD con el número de pedido y/o email que usaste en la misma? Un saludo. @shaylaphillip That's not something we want to see. Can you let us know when and where you purchased the shoes, so we can look at some options for you? If purchased from https://t.co/yYv8xSbp4x please pass us over the order number and your NikePlus email. @arieljanae_ Treat yo self. https://t.co/VtIG5i9tnn @FrankieMind Hey Frankie, we think our extended tall sizing may work for you. Remember, as a NikePlus member, you're able to try a product out and return it within 30 days of receiving the item if it doesn't work for you. | https://t.co/CsBhp3vW1a @Teamjabbi Happy to help. Firstly, we want to confirm if you're after the Air More Uptempo 720? Also, could you let us know where you're currently located? @HBeats4JessieJ 🔥 @Cheyennesaurus 👍 @Cheyennesaurus That's a good question, Cheyenne. We don't recommend cleaning your shoes in the washing machine, dryer or using any harsh cleaning products. For cleaning shoes we suggest using a soft cloth with mild soap and warm water then gently scrub the uppers and let air dry. @vinaa_vee Hi Alvina, please visit https://t.co/GwNb9Kv6ej to learn about, and apply for, one of our numerous grants, or to request a product donation. We also provide resources on the site so you can get involved in your community. @_astierGo Genial. En este caso te dejamos aquí un link desde el que podrás comprobar nuestras tiendas más cercanas a tu domicilio y de este modo podemos revisar disponibilidad de productos contigo. Te esperamos. https://t.co/Ls0kW55Nbd @Tiffany_Lyn6110 Why choose? Wear two. 🤔👟👟 @GGT1976 We stand by our products for up to 2-years from the manufacture date. You can find this on the white tag inside. @Dougie_Naranjo Believe in the run. @Tiffany_Lyn6110 Rep your favorite pair on Air Max Day. 3.26. @volley_design \"The real purpose of running isn’t to win a race. It’s to test the limits of the human heart”. @Aston35005254 Love your style. @sarah_rose81317 Hi Sarah, Nike usually hires models for advertising through agencies. We recommend that you contact a local modeling agency in your area. @VailPankey Hi there, no news on the Nike Hyperfuse. Keep posted on https://t.co/0s5LyjHQ4B for any potential releases. @hlods Hey Heather, stay tuned to https://t.co/yYv8xSbp4x and the Nike App for your chance at a 3 star home jersey on 4.4. Red and White jerseys with 3 stars are scheduled to be available 5.9. @DannyLoPriore Hey Danny. That's not the quality we like to see. Can you let us know when and where you purchased your pair at? If it was with us please send over your NikePlus email and order number via DM. https://t.co/klmMF0Q8Tn @in_haystack We recommend going with your regular size of 7.5US. This will give your foot enough room to expand during your runs. @emmyleelee That's not the experience we like to hear. Can you let us know when and where you bought your previous pairs? If they were purchased through us please send over your NikePlus email and order number via DM. https://t.co/klmMF0Q8Tn @JesseNanim0820 Hey Maria, no word on a restock at this time. Keep it locked to our site for updates. @bbhyug Hi Chensolo, we proactively seek athletes to endorse our brand and don't accept unsolicited sponsorship requests. @Jan__Main Jan, we're sorry to hear about your order. Have you reached out to DPD directly yet? Meanwhile, could you send us your NikePlus email and order number via DM so we can look further into this? https://t.co/klmMF0Q8Tn @GregoryDeFelice Hey Gregory, no news on a release date. Keep it locked here for updates. | https://t.co/ZoCs7l4n55 @varsity_jay Hi Ryukin, we are unable to assist with your inquiry at this time. This platform is for product related questions/information. If you have any questions like that, please let us know. @mboise208 Thanks for the info Michael. Since you purchased your pair with us, feel free to bring it back to any Nike store near you for possible return/exchange options. Here is a store locator: https://t.co/0oKGaX7UP8 @shawnb3330 Thank you for the info. We recommend working back with Dick's Sporting Goods for possible return/exchange options. If they are unable to assist view our claims process here: https://t.co/BbeKtjy1nA @mboise208 This isn't the kind of quality that we like to see, Michael. Can you let us know when and where you bought them? We can look into possible options for you. @SwanTrystin Stay tuned to https://t.co/2R5O2wbN0S and the Nike App for your chance at a 3 star home jersey on 4.4. Red and White jerseys with 3 stars are scheduled to be available 5.9. @transburrito Stay tuned to https://t.co/yYv8xSbp4x and the Nike App for your chance at a 3 star home jersey on 4.4. Red and White jerseys with 3 stars are scheduled to be available 5.9. @_SusyA_ Aline, hemos podido comprobar que ayer día 14.03.019 recibiste un email de nuestros compañeros confirmando el reembolso realizado y los plazos de ingreso. Un saludo. @_ronarch Nothing to share at this time. Stay tuned to SNKRS for any possible releases. @arianagarde_ Here to help. What size and height Air Force 1's are you looking for? Take a look here for what options we have available online. https://t.co/gX8LSuypme @SP_SULLY Hi Sean, Nike usually hires models for advertising through agencies. We recommend that you contact a local modeling agency in your area. @dancooling Not the quality we expect, Dan. Can you let us know when and where they were purchased originally? We'll take a look at some options. @symonexo_ Thanks for your interest in Nike. We proactively seek opportunities to endorse our brand and don’t accept unsolicited sponsorship requests. @anasofiabz Hola Sofía, pues se trata del modelo Nike WMNS Air Max Thea SE. Te dejamos aquí el número de estilo del producto (861674-902) para que puedas localizarlo con más facilidad tanto online como en tienda física.  Un saludo. @jenniv123 This isn't the sort of thing that we like to see, Jennifer. For us to assist with this can you let us know where you purchased your cleats? @dee_rohq Looks like this is the only colorway we currently have for the AM720 SATRN QS. Keep it locked to our site for any future news: https://t.co/EiVaBSUb2H @transburrito Get yours now. https://t.co/jwqyBfSzN1 @claudinhovega En este caso tienes que volver a la tienda donde las adquiriste para ver de que modo te podemos ayudar. Te esperamos. @lupholes Apologies for any confusion, A. You can find the Nike Pro Women's Hijab on our site here: https://t.co/Gix6njZBgE @itsme_bruno_ Men's sizes will be available soon. Stay tuned to our site to grab 'em when they drop. @IronicHandle We weren't able to locate that specific pair. However, we do have other styles in a similar cut or 2 in 1 style. Let us know if we can be of any further assistance. @MikeDesorbo1 Pre-orders are available now online for NikePlus members. Not a member? No worries it's free to sign up for the latest and greatest Nike has to offer. Check the link here:\n https://t.co/9SGphnX9TO @whatdoidowthis Hi there, check out the link for the USA Stadium 2019 kit for cuts/sizing details: https://t.co/BmHTnCLMcl Nike 2019 National Team Kit Unveil https://t.co/GDuPUzovCp @jsp1185 We're sorry to see that. Can you let us know when/where you purchased the shirt at? If it was purchased through us we do offer a 30 day return/exchange. However, because the manufacturing tag was removed our team may not be able to honor such request. Future Fit for Fourteen Federations\n\nRead More: https://t.co/LM2DsljDiP https://t.co/rN8nmy7jrq Nike Deepens Its Commitment to the Next Generation of Female Athletes\n\nRead More: https://t.co/4OJYSyC3yU https://t.co/814g65dUQA @JoshHussey25 Hey Josh, these Nike Shox BB4s were a PE (player edition). No word on them releasing, but keep it locked here for new styles and colors. | https://t.co/9iRGlKHyJ0 @FocusHome Hi there, we proactively seek athletes to endorse our brand and don't accept unsolicited sponsorship requests. @claudinhovega Vaya Claudio, lamentamos ver eso. ¿Nos podrías decir donde/cuando realizaste la compra y si fue online, enviarnos mediante MD el número de pedido y/o email que usaste? Saludos. @ghandi47 That's the Nike Air Aggress Force which released in 1999. 👍 @kimsbored That colorway is no longer available. Let us know your size and we can help you find another style. Check out our current Air Force 1 Low's here. https://t.co/ovZI5UQD5t @smittal25 Unfortunately, we don't have news regarding a release of that hat yet, Shreyansh. Be sure to check out the BCCI ODI Hat, and let us know what you think here: https://t.co/r6tWhAr5sR @PurplePraxis Only time will tell. As for a restock on this particular style there is no news to share. If you let us know what size you are after and where you are located we can check availability within our local stores. @heartAcat85 Your mind's in the right place. We've made sure to take your feedback to our team. @b1t1111 Hey Brad. Here to help. Can you tell us where and when they were purchase? If you bought them on our website please pass over your NikePlus email and order number. @falcaojr10 Hola Rafael. Tenemos que comentarte que actualmente es Nike quién busca a los atletas/equipos para realizar los patrocinios. Te animamos a que sigas trabajando duro, quién sabe si en algún momento te vemos con nosotros 😉👊. @Eduardo12028773 Hola Eduardo, a través del siguiente link podrás comprobar nuestro número de contacto y también el modo de enviarnos un email, de este modo puede optar por la opción que te resulte más cómoda. Te esperamos. \nhttps://t.co/oXgJrrVnKA @smartlatina21 Hey Becky. Here to help. Is there a specific colorway you're looking for in size 9? Check out our available styles. https://t.co/HE1rxHxaJl @yourboinextdoor All of ours too. @greenstyle75 Hi PJ, we're here to help. When and where were they purchased? @Mee_Guel We still have the 🔥. Check them out here. | https://t.co/ijLgO88fWP @StMarcellinusXC Believe in the run. @Cbrumby93 👌 @Cbrumby93 Hey Clarence, no word on if/when we will restock the Sock Dart. However, have you checked out the Air Presto? It has a similar sock-like fit with a stretch mesh upper for a flexible, lightweight feel. Check em' out, and let us know what you think: https://t.co/8qISxShIxB @mackenzie834 The 'Forbidden access' error can usually be fixed by clearing the cache &amp; cookies of your browser. Please give that a try. @Blckjack9 No current word on if/when we will restock that style. Keep it locked to https://t.co/yYv8xSbp4x for any possible updates. @CCS_231 Hey, Chris no word on the next release for the Nike Hyper Adapt BB. Stay up to date here: https://t.co/R6TGDzqsZa @FreshEbz Nike proactively seeks athletes to endorse the brand, and unsolicited Nike sponsorship requests aren't accepted. @ElletotheJ The Air Hurrache fits true to size. As a friendly reminder, when purchasing directly from https://t.co/E9VFRe1yZI or a Nike store, we offer a 30-day return policy if the product doesn't work for you. Get yours here: https://t.co/QKO7D6c2Yy @363Tweets Get yours here: https://t.co/hclytNUQ03 @ST_MS10 That looks like the Pegasus 34. Check out the newer, Pegasus 35, here: https://t.co/cSZWZ25TO4 @jonsx Hola Jons, como momentáneamente no realizamos envíos te recomendamos visitarnos en nuestros locales más cercanos a ti. Por otro lado, vamos a pasar el feedback a nuestro equipo para tener en cuenta cada opinión al respecto y poder trabajar con el mismo. Saludos. @Darcecus1 We got you with the baggy fit.\n\nTherma Elite pants: https://t.co/ypyZeKcayo\n\nTherma Elite hoodie: https://t.co/MvZBEDsd0P @DomDomasaurus We got you. 💪 https://t.co/zO5RCH8eZf @_DameDon Birthday mood. https://t.co/27uYEa5dQ5 @fastarelli Due to the age of the product, we aren't able to identify the exact name. Let us know if we can help with anything else. @JOZZZYJ We appreciate your interest in the company and your commitment to supporting your community, however, we proactively seek athletes and programs to endorse our brand, and don't accept unsolicited sponsorship requests. We wish you the best of luck in your future endeavors. @n_chualite The feeling is mutual. 💞 @you_a_hype Anything can be a diaper bag; just depends on what you put in it. 👀 https://t.co/AAy7m0zHls @HartyHeat No news to share on a restock of that style. We recommend keeping an on our website for any updates: https://t.co/4t2pSRAEKn @cnice716 Unfortunately, we don't have any promotions to share at this time. Keep in mind NikePlus members receive free shipping on all orders/returns, along with other exclusive promotions. If you haven't already, become a member here: https://t.co/769GLROIWd @Old_Sheldon Unfortunately, the 'Notify Me' option is not available with this style. Stay tuned to the link provided for all possible news. @Old_Sheldon No news to share currently about a restock, but keep an eye out for any updates: https://t.co/aZPyIo4Cl5 @neji_daw_louk Got it. You can find our list of available styles at the link below. Let us know if anything stands out and we can provide more insight. | https://t.co/niUcal31bD @Hey_Arnold_E 😉👍 @georgechuck No news yet, George. Keep it locked for any updates here: https://t.co/F07fhsAbKL BR2297 @Hey_Arnold_E Hola Arnold. Para estar atento al re-stock te recomendamos mantener un ojo en nuestra web. Por otro lado, te dejamos aquí un link con los modelos de A.F disponibles en talla 27.5cm. https://t.co/EWZXEiKsGv @drcaru Dani, recuerda que cualquier producto comprado en nuestra web en España tiene dos años de garantía. Puedes contactarnos a través del siguiente link y revisamos opciones. https://t.co/wJNM5NXo2M @Ace_Zer0 There are currently no upcoming dates in our calendar for that style in that colorway. We recommend checking out our current collection of the Air Max 90 here: https://t.co/gAV1mIdKTv @eriche61224920 Hola Eric, lamentamos lo ocurrido. El albarán que nos muestras en la foto es original de la web así como el número del pedido en el mismo. ¿Nos puedes enviar un MD con el email que usaste?. Saludos. https://t.co/klmMF0Q8Tn @OScottIV We don't have any of those internships available at this time. You can stay tuned to the internship page if we do provide it in the future. https://t.co/kImJVaZVyR @AdailTristan Hola, nos alegramos muchísimo de que te guste nuestra App. Todos los comentarios son importantes y valorados por nosotros. Saludos y ¡sigue activa! ❤️️💪 https://t.co/klmMF0Q8Tn @drcaru Vaya Dani, lamentamos lo ocurrido. ¿Nos podrías decir donde/cuando realizaste el pedido y si fue online, el número del pedido y/o email que utilizaste?. Saludos. @emmagresser You can check out our jobs site here: https://t.co/yYpkwwSjju Show them what crazy dreams can do. #justdoit https://t.co/3fo2XMVkBT @djcynot As always, we recommend consulting with a physician for any pre-existing foot conditions. With that said, the Air Zoom Vomero 14 may be worth looking into. The shoe offers a full-length Zoom Air unit that works with React cushioning. Check it out here:\n https://t.co/6ix5Pz9hRa @Hannabear24 Hey Hannabelle, we got you covered. Check out the Women's Metcon 4 XD; should be perfect for your needs. https://t.co/ToNB6SL9k6 @littleblueyes2 Copy that. As a first step, you'll want to work with the original retailer directly for all return options. If they are unable to help, check out this link to file a claim for possible manufacturing flaws/defects: https://t.co/ygKJrpZZh5 @mpete45 We're sorry to see that. Please check out our return policy here and let us know if you need any further assistance. | https://t.co/NI6cpL03bA @redfernjosh We appreciate your feedback, Joshua. For a similar option, we recommend checking out the Hurley Flex. https://t.co/Dw4nscf3w4 @littleblueyes2 Sorry for the troubles. For us to explore some options can you let us know when and where you purchased your shoes? @IAmSpencerKane Not the Kind of thing that we like to see. For us to assist further can you let us know when and where your shoes were purchased? @duyguaslak Good catch. We'll loop in the appropriate teams to get the price updated. Let us know if there's anything else we can help with. @PARAVERSOUVENIR En la tienda Nike más cercana a ti cualquiera de nuestros compañeros te podrá informar sobre las políticas de devolución e intentar ayudarte dentro de las mismas. @neji_daw_louk Here to lend a hand, Neji. For us to explore some options can you let us know where you are located, what you will be using your shoes for and what colorway you prefer most? @hammedk Yes, you should be good to go. @king_andre20 Hey Andre, thanks for reaching out. We only consider ideas that are embodied in an issued utility patent, utility model, or a pending non-provisional utility patent application that has been filed with an appropriate governmental agency. More info here. | https://t.co/7xkTQVrb3Z @kimmaves Hi Kim, nothing to share about a new version of the Pegasus Turbo at the moment. Stay tuned to https://t.co/3y8SYBbdM5 and https://t.co/62G2h22Bc1 for any potential news. @manish_kalel We aren't able to review products for authenticity. To buy genuine Nike products, we recommend shopping on https://t.co/yYv8xSbp4x, at Nike stores or authorized Nike retailers. @Salihaa55 We recommend reaching out to the store directly with any additional questions you may have regarding their return policy. @a0iqn That's the Nike Air Zoom Vomero 10, which released back in 2015. The current model is the Nike Air Zoom Vomero 14. https://t.co/9EybvY2Yos @Salihaa55 Thanks for letting us know. We recommend working back with the original retailer as they can provide the fastest return resolution. Let us know if they're unable to assist. @bstrangfeld Hey there, we proactively seek athletes to endorse our brand and don't accept unsolicited sponsorship requests. We wish you the best of luck in your future endeavors. @C_Mans94 No news to share about that jersey releasing. Stay tuned to https://t.co/yYv8xSbp4x for any updates. @Jo3yMerlene Nothing to share at this time. Keep it locked to our site for any updates. @MrBuschGardens No current plans to release that style. You can shop our Beal Icon Edition jersey here: https://t.co/o5eQNz0kS2 @VnssaEvns Same tbh. https://t.co/ToOtVipdLp @OliverPlayaMex 🤙 @OliverPlayaMex Promo codes are not valid on the SNKRS app or launch items. You can check out our terms and conditions here: https://t.co/v3J2AvNckc @jursr55 Dit is natuurlijk niet de kwaliteit die je van ons verwacht. Kan je ons het bestelnummer via een privé bericht sturen? Je hebt namelijk standaard 2 jaar fabrieksgarantie op Nike producten. Dan komen we graag met een passende oplossing. https://t.co/klmMF0Q8Tn @Victor230281 Hola Víctor. Para estar informado sobre cualquier noticia relacionada con las Adapt te dejamos aquí el siguiente link. Saludos. https://t.co/Ni8v2Uzvmb @JedryIsMyName A solid weekend of pickups for you. 👌 @jsabusiness 🙌 @Richteaisgreat There is no word on a restock at this time. Keep it locked to our site for updates on availability. @ArcadianAB Nike proactively approaches athletes, associations and clubs for endorsement/sponsorship, and therefore we don't accept direct applications. @carywilliams79 Solid pick up. 👌 @MyWrldULivnIt 🙌 @cracksterdam Let's have you log out and log back into the app. Units are still available. @galvaranena Hey Lupe, we have some that may work for you. Check out our size guide, and remember, we offer free returns within 30-days of purchase. https://t.co/DqokGDxqji @ChandanBora80 That is not a Nike authorized retailer. We only recommend purchasing from our site or authorized retailers to guarantee authentic product. @ScruggleBus No word on any of those jerseys becoming available. Keep it locked to https://t.co/yYv8xSbp4x for any updates. @fabre4 It looks like he's wearing the Nike Free Trainer 5.0 V5 (style: 644671-107). They released back in 2015 and are no longer available. If you'd like to check out our current selection of training shoes, let us know where you're located and we'll send you a link. @79Tambo Here to lend a hand. We may be able to assist you with your complaint here. Let us know your experience, and we will try our best to resolve your issue. @PARAVERSOUVENIR Hola. En todos nuestros mensajes anteriores te hemos pedido que por favor nos visites en nuestra tienda más cercana para poder revisar como podemos ayudarte.¿ Has estado ya en tienda?. @nmfcb Looks like you found your sole-mate. 💘 @gunn_kris GS sizes have been postponed. Stay tuned for any updates here: https://t.co/Wcr17DOgFk @gunn_kris The Air Jordan 1 'Turbo Green' will release in M: 7-13, 14, 15, 16, 17, &amp; 18 via SNKRS on 2.15 at 10:00 AM EST. https://t.co/RYHF2myUG7 @MyLife_Nate The Nike Adapt app is available for iOS and Android, and you can find it by searching 'Nike Adapt' on iTunes and Google Play. For more information, check out this link: https://t.co/pTHDtyAFuj @gontos76 Great question. For us to assist can you let us know what device you are using? @judithmrice Water resistant will help keep you dry in mild conditions. If you are expecting to be in a lot of rain, we recommend something that is waterproof. The Shield jacket is perfect for the lightweight, breathability you're looking for. @judithmrice Hey Judy, the Nike Shield jacket contains wind and rain-resistant fabric to help keep you dry in wet conditions. Check it out here: https://t.co/LsKllineAH @life_of_jennie What do you think @NikeRunning? @KeithHenryJr Hey Keith, thanks for reaching out. We recommend checking with authorized golf specialty shops for potential availability. Also, the Jordan 11 golf shoe is scheduled to be available in a size 15 on 2.15 at 10 a.m. EST. Keep it locked here for updates: https://t.co/BEc3fe1njT @Krystyan18 Buena pregunta Cristian. En este caso el producto incorpora ya los clavos. Saludos. @terryphinkle Unfortunately, we don't sell prints. We appreciate the interest, and will pass it along to our team. @nyaskinny Good news, we can ship most orders to APO and FPO addresses. You can find more info here: https://t.co/QIusNbpxz4 @edgar_santos7 Hey Edgar, those are no longer available for purchase, but check out some other soccer styles available here: https://t.co/6QUltQpNu9 @nmfcb Keep on the lookout for an email sometime this week. The future is coming. 👀 @sairaghavgupta The anniversary of a healthy year. https://t.co/1t56ptVRID @a_crazymama We recommend working with your doctor to find the right fit, as we are not able to offer proper advice regarding shoe modification. @TaVigo92 That style released in 2016 and is no longer available. Head to our site to shop the latest. @FranckitoGooner We proactively seek athletes to endorse our brand and don't accept unsolicited sponsorship requests. We wish your academy the best of luck in their future endeavors. @Dazarbeygui Everybody remembers the exact moment they meet their 𝐬𝐨𝐥𝐞 𝐦𝐚𝐭𝐞. 👟 @a_crazymama Hey Amanda, we recommend checking out our FlyEase collection. Learn more and check out available options here. | https://t.co/3yW7DzhqKz @hugoroget1 The Adapt BB is our most tested shoe ever developed; yes, it is waterproof and dust-proof. @AndrewVotech44 This particular style is the Nike Kyrie 5 and be personalized. We have created something similar check it out here: https://t.co/8t8Ae2OEzW @nmfcb You asked, we answered. Keep on the lookout for an email. The future is coming. @Ramseyyy93 That style is the Nike Flyknit Ultra FG (style: AH5516-005). They released back in 2017 and are no longer available. Let us know if we can be of further assistance. @Amna_meemi That style is the Nike Flyknit Ultra FG (style: AH5516-005). They released back in 2017 and are no longer available. Let us know if we can be of further assistance. @moubry You should see the option to checkout at the bottom of the page. We recommend clearing your cache and cookies before trying to place an order again. If the issue persists, give us a call at 800.806.6453, and we'd be happy to assist with an order over the phone. @davearez Unfortunately we have no restock news to share at this time. For availability updates, we recommend keeping an eye on the product page. https://t.co/S9MKSqjcYA @ThePapachingon Sorry for the confusion. For us to look into this for you can you shoot us a DM with your NikePlus email? @meritoranzo En este caso tienes que volver al local donde realizaste la compra para ver de que modo te podemos ayudar. Te esperamos. @Ammitorres13 Hola Ammi, lamentamos lo ocurrido. ¿Nos podrías decir donde realizaste la compra y si fue online enviarnos un MD con el número de pedido y/o email?. Saludos. @fcomtzhdz Hola, muchas gracias por contactar con nosotros. Los retos y recompensas cambian dependiendo de la ubicación. Si este mensaje apareció en tu bandeja de entrada significará que está disponible para ti. Si este no es el caso, entonces no lo estará. Te enviamos un gran saludo. https://t.co/klmMF0Q8Tn @tristanluker78 This isn't what we like to see. In this case we recommend reaching out to the original retailer in regard to a return/exchange as their process may be faster. If they are unable to assist let us know, and we can explore some options. @Chr1s23 That collection is set to release on 2.7. You can find more information here: https://t.co/dkblCRsjfe @SomaniAzhar That email came from us, Azhar. We recommend logging in to your NikePlus account to make sure your data is saved. @NutFreeWok Hey Sharon. We recommend checking out the Nike Odyssey React Flyknit 2, which will provide a similar ride. https://t.co/BFkJ4JVv5C @AustinLink10 We've got you covered. https://t.co/HcqYCEV93s @meritoranzo Vaya, lamentamos lo ocurrido. ¿Nos podrías enviar un MD con la información de donde y cuando realizaste la compra y si fue online, el número del pedido y/o email que utilizaste?. https://t.co/klmMF0Q8Tn @518Coach Those are not currently available for purchase. You can check out all Duke basketball gear here: https://t.co/ZdPIiuVxB1 @hiiiiimy We're listening, send us a DM below. ⬇️ https://t.co/klmMF0Q8Tn @MardePiedras Hola Mar, esta en concreto no nos consta registrada como distribuidor oficial.Saludos. @jeimacjemimah We don't have an email to share. Go ahead and use that phone number for any concerns in that region. @jeimacjemimah Hi, Jei. You can contact our Philippines distributor line at 1800.1888.6453. @codepanda404 Hey Paul. This isn't what we expect to see. Can you send us DM of where you purchased the shoes and your Nike Plus email so we can look into some options for you? https://t.co/klmMF0Q8Tn @Tinetasm Vaya, lamentamos lo ocurrido. ¿Nos podrías decir donde realizaste la compra y lo revisamos?. @karlagarfig Vaya, lamentamos eso. ¿Nos podrías llamar al siguiente número y así revisamos juntos que ha podido pasar ?.01 800 062 3550 de 8.00 a 20.00 CTL y estamos los 7 días de la semana. One crazy dream turns into another.\nAnd another.\nAnd another.\nAnd another.\nAnd another.\n#justdoit https://t.co/hJrofBCPav @Benjami36557469 There is no word at this time. Keep it locked to https://t.co/yYv8xSbp4x for updates. @DeliNcg Time for a new one. https://t.co/cUUxRLQGCG @PhotogAlex No word on that hat restocking. You can find select NASA gear available on our site here: https://t.co/UypVuo6IRM @Salihaa55 If you'd like to return the shoes, please let us know when and where you purchased them. @Salihaa55 Nike respects all religions, and we take concerns of this nature seriously. The AIR MAX logo was designed to be a stylized representation of Nike’s AIR MAX trademark. It is intended to reflect the AIR MAX brand only. Any other perceived meaning or representation is unintentional. @gia_valdes Have your pick, Gia. | https://t.co/WRpd6QwMHN @julieodeje No details to share yet on when that colorway of the Nike Vandal 2K will be available. Keep it locked to https://t.co/yYv8xSbp4x for further updates. @jxminette We got you, Janey. This is our Air Max Dia,  check them out here: https://t.co/OCGnmwqDOq @_CocoRae Unfortunately, we don't currently offer replacement laces. For Nike brand laces, we recommend visiting local Nike factory and outlet stores as they occasionally carry extra components. @hopper8tor Notes = taken 📝 @runnerLM Buen consejo Lau, la hidratación es súper importante. Sigue así y que nada te detenga 👊😉. @AntonioGlueClub Unfortunately, we don't have any laceless boots at this time. That being said, we suggest checking out our FlyEase models, which have been designed to allow athletes to get their shoes on and off more quickly and easily. Check them out here: https://t.co/c4hYxtMe15 @Rissross72 There is no word at this time. Keep it locked to our site for updates on the latest product availability. @sithembiso_k New PR accomplished. Way to reach for your goals. Where we off to from here? @lafrog257 Hey Tre. That is an older model that is no longer available. Head to https://t.co/yYv8xSbp4x to shop the latest products. @BrianMcGroarty There is no word at this time. Head to our site to shop Fan Gear now. | https://t.co/dm8QXqMiog @PartlyClouty_ We are unable to assist based off the information provided. @JohnnyBoombatz2 Get the gear you need here. | https://t.co/h8CaPRbNpp @_taymich Hi Taylor, check out our Reuse-A-Shoe program, which collects old, worn-out athletic shoes for recycling, and transforms them into Nike Grind, a material used to create athletic and playground surfaces and more. Find more info, and where to donate here: https://t.co/bomRm0mjik @ToddCooper30 Hey Todd, more styles and players will be available soon. Please keep an eye out here for any updates: https://t.co/ffSRQuiVHL @ssarbahi Let's figure this one out. For us to assist with this can you let us know the name of the retailer, so that we can confirm if they are an authorized Nike retailer. @BMOORE_78 Here to help, Brandon. You can customize the Nike Air Max 1 OG with NIKEiD in a size 15 here: https://t.co/kYQ3PtJkLE @Iamkaran_10 Putting in those hours day and night. That's how it's done. 👍 https://t.co/8CcrDQhaSZ @LightboxPV We do not grant permission to use or modify our trademarks, logos, images, advertising or similar materials. It's your responsibility to determine whether your proposed use is legally permissible. Let us know if you have any more questions. @Bigymnast1 Thank you for your interest in Nike. We do not grant permission to use or modify our trademarks, logos, images, advertising or similar materials. It's your responsibility to determine whether your proposed use is legally permissible. Let us know if you have any more questions. @crasher339 Hey Cory, we don't have the exact measurements for the length of the jersey. With that said, we recommend following the size guide to find the best fit. If the jersey doesn't work for you, we offer a 30-day return policy. | https://t.co/Wse8AhzGx5 @thatboy_ed_ All job openings can be found at https://t.co/cFTMdfHU3n @gunboy_12345 No word on that at this time. Stay tuned here for future updates: https://t.co/mzLfjW4JTV @yuliloredo ¿Podrías enviarnos un MD con el email que utilizaste en la compra? @gunboy_12345 Great question. For us to assist with this casn you let us know where you are located? @kezzabugz Hi Kerry, we're glad she's interested in the company. Head over to https://t.co/zf1pfhlcyd to read more about the brand. @yuliloredo Hola July. Vamos a ayudarte. ¿ Podrías contactarnos mediante el siguiente link para poder revisar contigo todo el proceso de compra y ver que ha podido ocurrir?. Un saludo. https://t.co/9AAKLCN3FA @Fer_Sip That product is not currently available in your region. Keep it locked to https://t.co/yYv8xSbp4x for potential updates. @ACSCollectibles Checkout the Zoom KD 11 which has a combination of toe-to-heel React foam and Zoom Air that delivers ridiculously responsive cushioning on the court. https://t.co/XFQGQ16mor @MarciaMEugenio We've got you covered, Marcia. https://t.co/uvktf4NXVg @cmsorrell09 We'll be here the whole way. 🙌 @ishiteru_25 Sorry for the confusion, Lyn. The correct sale price is $152.97. https://t.co/NVvdrd2zxF @Erin_Marie18 Good catch. We apologize for the confusion. The correct sale price is $39.97. https://t.co/Oiok5MSqIQ @ThreJ Hi Justin, depending on the style, the shoes may contain both leather or synthetic materials and in some cases both. https://t.co/3uPHTNpG8Y typically highlights the materials if they are leather. If there isn't mention of leather on a product page, the product is likely vegan. @C_K_TIFFANY The Nike Adapt BB will not be released in wide sizes. Let us know if you have additional questions. @KMOHea Thanks for your feedback, Kevin. We will be sure to pass this along to the appropriate team. Keep it locked here for updates: https://t.co/GFeU5Afjf4 @taylorkrueger Pre-order is no longer available. The Nike Adapt BB will be available via SNKRS on 2.17 at 10am EST. https://t.co/ZCnLaW0i9F @KyleMerrien They will be available globally on 17.2.19. Introducing Nike Adapt BB. Power laces for the perfect fit.\n\nPre-order now for a limited time only on https://t.co/bowoctlxR0 in the U.S. Arriving globally February 17: https://t.co/5cm5ou0XQC #nikeadapt https://t.co/UDbUBK7HvK @NacoolD That is not something we have available on our site. There is no plan to release that style at this time. The future of the game is here.\n\nWatch live on @twitch at 9AM EST. Pre-show starts now: https://t.co/N7Yqbn7gP2 #nikeadapt https://t.co/DVL6vnewaX @brianv_graphics Three is the magic number. Keep up the hard work and dedication. @KeithHenryJr Our team has your back. Check out some of our golf shoes in your size here: https://t.co/xdx94hvZ70 @Bamdharma1 We gotchu'. The very first Nike Pegasus was born 1983. You can brush up on your Pegasus knowledge here: https://t.co/kq8xsKXmlf @_TReid_ Please check your DMs for further assistance. RT @serenawilliams: 12-year-old @kalli_minor is launching a quarterly tennis clinic to give kids in her community of Compton the opportunit… @Germanelaine Here to lend a hand. We recommend checking out our tall collecting of men's trousers here: https://t.co/IHIWLtEzlj The game will never be the same.\n\nTune in tomorrow at 8AM EST. @nikebasketball https://t.co/4LrJGpPDY6 @bribrirgarcia Nike proactively seeks athletes to endorse the brand, and unsolicited Nike sponsorship requests aren't accepted. @notmosesdavis There is no news on a restock of these styles. We recommend heading down to a Nike Factory or Clearance store to check availability of these style. You're able to find your nearest store here with our store locator: https://t.co/zcBwW2w0OC? @taylor_briggs Freshest kid on the block. 😎 @soochronicles Is it the shoes? No Emily, it's you. @WhaztheTgurl They're a must. https://t.co/Ct57RuCR2Z @CoachBru Calf raises are free. No excuses. https://t.co/bBFgK5aHaQ @SteacyC Great question, Steacy. Looks like we don't have any snapaway pants in Baby &amp; Toddler sizes. Stay tuned to https://t.co/yYv8xSbp4x for any possible updates. @etravishappy Cheesin' your way to a better you.😁 @SolesKing Right back at ya. https://t.co/VxngJUI0Ed @Malisa_Matthews Great question, Malisa. Unfortunately, that shirt is currently sold out. Keep your eye on https://t.co/yYv8xSbp4x for any possible restock updates. @Myklarosa Objects in the box may be larger and fluffier than they appear. @Hurrishane10 This is a Player Edition style, and therefore we have no plans to release it. Check out our current Lacrosse Cleats here: https://t.co/e7ZrjgoGaU @CoCo_ChanelC No word on if/when that style will restock. Keep it locked to https://t.co/yYv8xSbp4x for any possible updates. @KSwavy009 Thanks for reaching out, Kendra. While we appreciate your interest in the company, we proactively seek athletes to endorse our brand and don't accept unsolicited sponsorship requests. We wish you the best of luck in your future endeavors. @MrG_LHS He can't be stopped. https://t.co/WfmNSmfctO @AlysonRosenfeld Hey Alyson, our Reuse-A-Shoe program is at most Nike retail stores. We recommend contacting your closest store and seeing if they offer it. | https://t.co/LoRuyHapiG @chrisliam13 Great question, Chris. We will not produce future versions of the Lunar Epic or Lunar Glide. We will look to phase-out Lunar Foam in the Running category to focus on delivering the performance benefits of Nike React foam. Check out our Reacts here: \nhttps://t.co/jCJLO8Ywls\n0 @Elizabeth5130 @shayvdaly Nike proactively seeks athletes to endorse the brand, and unsolicited Nike sponsorship requests aren't accepted. @kandykillss Thanks for letting us know. We recommend working back with the original retailer to discuss return options as they can provide the fastest solution. If they're unable to help please visit here: https://t.co/boPoDBQhoQ @kandykillss That's not something we like to see, Tiffany. Can yo let us know when and where you purchased the shoes, so we can look into potential options for you? If purchased from https://t.co/ATw8CfgdSL please pass us along the order number and your NikePlus email. https://t.co/klmMF0Q8Tn @henrytcasey Sorry for the confusion. Yes, that is the model we're referring too. We currently have an extended 60-day holiday return policy which means you can wear your shoes and return them to us within 60-days to get a full refund. You can learn all about it here: https://t.co/QrqbBoMhjh @henrytcasey Great question, Henry. You'll want to go with the Epic React. The soft React foam underfoot and Flyknit upper is perfect for taking on the miles while also looking making heads turn. Check them out here: https://t.co/Wbm8saWnMm @coachhenson18 You knew, we just had to make sure the world did too. 🤷‍♂️ @Asani_Listhrop Here's one that should work. Hopefully it's not bigger than your head. 😉 https://t.co/Fnb506F61r @SaminoleH Hey Samantha, we have several training shoes available in a women's size 5 and 5.5. Check them out. | https://t.co/S7PctD72fX @Marrmarje Thanks for letting us know. We didn't see any Nike stores in your area with availability. Your best bet would be to check in with in-store authorized retailers for any inventory. @GallivantGirl We recommend following the cleaning instructions on the inner tag for proper care. @Leonfitmarisol Come and get em'. | https://t.co/Azz8GNNRrC @joemathews43 We've got you covered, Joe. That's the Nike Air Force 1 LV8 Big Kids' Shoe (849345-500). Grab your pair here: https://t.co/T63WoT4OUi @StellaNero4 There is no new on a restock. We recommend checking in with local authorized retailers for availability. @GallivantGirl Great question, Anastasia. The Nike Epic Lux Shield Women's Running Tights also feature zoned weather resistance, which shields you from inclement weather. If you're running in wet conditions, we recommend trying out the Shield version. Let us know if you need anything else. @RtH2442 Great question. There is currently no news on this at this time. However you can stay up to date with all the latest launches here thrugth our Launch Calendar: https://t.co/NJ3c3ZJ1qx @ThatDudeGill Help has arrived. For us to assist can you elaborate on your issue? @AyeChelle_ Nike proactively seeks athletes to endorse the brand, and unsolicited Nike sponsorship requests aren't accepted. @Mohamed20537447 No news on a restock of that style. We recommend checking in with authorized retailers for availability. @jetpam Starting the year the right way.  Any big goals for 2019? @mrf1731 Great question. Air Max 'Essential' models typically are classic silhouettes like the Air Max 90 and the Air Max 95, and are great for everyday casual wear. Check out our entire Air Max line here: https://t.co/m4j1sOySXy @nickhtang Starting the year off right 👌. Let us know it goes. @rebrandpending This isn't the sort of thing that we like to see. For us to explore some options can you let us know when and where you purchased your shoes? @princesainiiii That's not what we like to hear, Prince. We recommend working back with the original retailer for return/exchange options. @rmhiggs2 Here to lend a hand. For us to assist can you elaborate on your issue? @Meshamesh Dear Kneechie,\n\nWe got you. Dallas Cowboys Air Maxes are just a click away:\nhttps://t.co/ybYlrLWJgr\n\n-Nike @Sheldon_Payne Way to finish the year strong, Sheldon. Any big plans for 2019? @DJReemsDope Can you pass us your order number and NikePlus email, so we can look into this for you? https://t.co/klmMF0Q8Tn @ScottBloomberg_ Hi Scott, there is no official process to become a Nike Model. We typically hire models through agencies; therefore, we recommend reaching out to an agency near you for any future opportunity. @himangshu_duara This is not an official Nike page. We'll pass this along to our team. @beckpetreene This is not an official Nike page; any official Nike account will be verified. @TheAwkwardCat3 Nike proactively seeks athletes to endorse the brand, and unsolicited Nike sponsorship requests aren't accepted. @Luke_Holtrop No news on a release of that style. We recommend keeping an eye on our SNKRS app here for any updates: https://t.co/tZuN11CPbr @nameisvarunn This isn't the kind of thing that we like to see. For us to explore some options can you let us know when and where you purchased your shoes? @TrueBlueStory83 @NikeRunning Looks like someone's ready for takeoff. @king2shh That account is not associated with Nike and is not an authorized Nike account. Official Nike Instagram accounts will be verified. @tiaaaanicoleee Just eat it. 😉 @allanmike03 We've got your back, Mike. The closest shoe to the Lunarglide 9 is the Nike Odyssey React. Take a look here: https://t.co/W1NNeChqm8. Keep in mind, NikePlus members get a 60-day trial period, allowing you to put them to the test before making a final decision. @popgaint We did some digging but unfortunately, we weren't able to locate a pair through any of our online authorized retailers at this time. Keep in mind Amazon is authorized by Nike to sell Nike products, but Amazon Marketplace sellers are not. Let us know if you need anything else. @triggboy321 Nike usually hires models for advertising through agencies. We recommend that you contact a local modeling agency in your area. @PALMTREEMONK That's not something we want to see. Can you pass us your NikePlus email or the order number, so we can look into this for you? @popgaint Hey Adam, those are the Air Force 1 XX Jester. Looks like that colorway is not available in your region, but we did find another colorway here: https://t.co/XMvNUbf1ce @Josh807 🔥👌 @DBerdi It's not currently available on our site. We recommend checking with local or online authorized retailers for potential availability. @_hrnk We feel the same. https://t.co/stRbvpTJqP @hairlinetheory We like your reason, Steven. Please be sure to follow @NikeRunning to be considered for the Epic React contest. @WAD1980 We like your goal, Will. Please be sure to follow @NikeRunning to be considered for the Epic React contest. @reedeegc We like your reason. Please be sure to follow @NikeRunning to be considered for the Epic React contest. @joesimmons008 We like your reason. Please be sure to follow @NikeRunning to be considered for the Epic React contest. @KacieWrae We like your reason. Please be sure to follow @NikeRunning to be considered for the Epic React contest. @DomainShane We love your reason. Please be sure to follow @NikeRunning to be considered for the Epic React contest. @KennethRay_ Nothing at the moment, Kenneth. Are you a NikePlus member? One of the benefits of a NikePlus membership is the ability to be notified of current promotions and access to member exclusive product. More details here: https://t.co/lGKv3yEStd @Greghennes We'll just leave this here. https://t.co/uDJ7kqtn91 @Hurrican3Carter That's not something we like to hear. Can you let us know when and where you purchased the fleece, so we can take a look at your options. @KingKavod We appreciate your interest in Nike. At this time, we’re not currently accepting new business proposals. Although we can't accept your request, we appreciate your interest in our business and wish you continued success. @DeeptikantY Apologies for the trouble. We recommend reaching out to our customer service team in India via email. You can reach them at Consumercare.india@nike.com. @oded_regev Hey Oded. Those are the Air Zoom Pegasus 35. You can check them out on our site here: https://t.co/dDlLXUuwNO @FemkeVrij Hi Femke, dat is natuurlijk niet de bedoeling. Het beste is om even contact op te nemen met de klantenservice van https://t.co/hPE9oUBUVY op de volgende pagina | \nhttps://t.co/AZGFhv1pYs\nZodat we je direct verder kunnen assisteren met een retour. @ToftJenny Nike proactively seeks athletes to endorse the brand, and unsolicited Nike sponsorship requests aren't accepted. @Emmanuelmtz1993 We recommend reaching out to the original retailer for the best return/exchange options. If they are unable to assist then you can file a claim with our consumer service team. You can reach them at 1-800-344-6453 (7 a.m. - 4 p.m. PT, Monday through Friday). @Emmanuelmtz1993 That's not what we like to see, Zenitram. Can you let us know when and where you purchased the shoes, and we will see what options you have. @GameOverWill Hola de nuevo Wilfredo, es posible que haya fallado el sistema. Prueba ahora si es posible para ti enviarnos un mensaje privado. Un Saludo https://t.co/klmMF0Q8Tn @BoroWilson There is no word at this time. Keep it locked to our site for updates. @GameOverWill Hola Wilfredo, sentimos mucho lo que te ha ocurrido. Para poder ayudarte con ello, ¿podrías enviar un privado especificando tu correo electrónico en NikePlus?. Comprobaremos todo en nuestro sistema y así te echamos una mano. Te esperamos y te mandamos un gran saludo https://t.co/klmMF0Q8Tn @sprouseharths Nike proactively seeks athletes to endorse the brand, and unsolicited Nike sponsorship requests aren't accepted. @kritttaaa That's not what we like to see, Krista. Can you let us know when and where you purchased the shoes, so we can look at your options? @zachschwab05 Nike proactively approaches athletes, associations and clubs for sponsorship, and therefore we don't accept direct applications. @yepeztheprophet Nike proactively seeks athletes to endorse our brand and doesn’t accept unsolicited sponsorship requests. @mrcarter_iamhim You can't go wrong with the Free x Metcon. It combines the lightweight flexibility of Nike Free with the durability and stability of Nike Metcon shoes—which means it can stand up to short runs, boot camps, strength training, and the WOD. Check it out here: https://t.co/JpXVqUgXsT @Nithin That is not an authorized retailer. We only recommend purchasing directly from us or authorized retailers to assure you are receiving authentic product. @TheRealMeloy That's not something we want to see, John. Can you let us know when and where you purchased the shoes, so we can look into potential options for you? @TheGherbo We recommend contacting your local store for clarification. | https://t.co/TOyQpqUTam? @FLyCityNY We hear you and will pass your feedback along to our team. @atlfalcons2822 Thanks for reaching out, David. Although we appreciate your interest in the company, we proactively seek athletes to promote our brand and don't accept unsolicited sponsorship/donation requests. We wish you the best of luck in your future endeavors. @fluffybubbles73 We;ve got your back. Check out our student discount here: https://t.co/gsSc4O70eT @run_100mi Those are some of the design sketches used during the original design process. Let us know if you have additional questions. @FraserStainton To appropriately handle your experience, please contact us at 800.344.6453 (Monday-Friday from 7 am-4 pm PT). Thank you for your contacting Nike, and we look forward to hearing from you soon @16Angel_Perry Unfortunately, we don't offer customisation options for that jersey at this time. Keep it locked here for any updates: https://t.co/sQYiBsJzyf @Jusbrowsing1 Sorry to hear. To clarify, what item(s) were you looking to purchase? Also, what exactly did you experience? Do you happen to have a screen shot of the error? Let us know. @ThissGirl_C Greatest stocking of all time. 🐐 @macrod01 Nothing to share currently about releasing that style. Keep it locked to our site for updates. | https://t.co/ypHVcORigV @SoBeGaPe You can't find what you can't see. https://t.co/81LnJmu9vB @Andy_Davis8 Making your way to the nice list. 🎅 @kayyygeeeee5 Queens of style. 👑 @johannacudi Hi, Johanna. Thanks for reaching out. Nike usually hires models for advertising through agencies. We recommend that you contact a local modeling agency in your area. Get back to us if you have any additional questions. @KnowRayJones Select apparel for the Nike Training x Adonis Creed Collection is currently available on our site. | https://t.co/MCGcKSMVhZ @Shewanttherich Get the next best thing. https://t.co/tJTOuT7LcT @samirsalvio We recommend contacting your nearest store for availability information. | https://t.co/emWtjXGFX0 @LCoelho9 Say no more. Let's go. 😎 @saschiimi Joy to the world, Concords have come. @zasterwil Looks like we were meant for each other. First of many. 🤝 @pC7MxfXaIxnoUSM No plans to release the colorway in JP at this moment. Stay tuned to our running page for product availability. NIKEiD customize is also available for the Nike Air Zoom Pegasus 35. https://t.co/71NX35wZuR @gyglesias Thanks for connecting with us. We appreciate your feedback and will pass your info on to the relevant team. @Golden_Child_32 Thanks for reaching out. We're unable to provide discount on store purchased, Jessica. If you are unhappy with the quality we recommend following up with the store for a full refund. Get back to us if you have any questions. @anthonyflint07 What's the forecast, @NikeRunning? @Rhino864 Rep your squad on the biggest stage. Pre-order your CFP gear here: https://t.co/fzI0Maem16 @PrincessPalmtri 🤔 https://t.co/K00J8gIHmB @durgeshskumar You are correct, the Nike+ Sensor will no longer work. @durgeshskumar As of 4.30.18 all Nike+Connect software has been retired and this includes Nike+iPod. We recommend using the Nike Run Club and Nike Training Club apps to continue tracking your workouts. For more information about all retired devices, check out this link: https://t.co/yx7Nx45hEL @Team_3MP We did some digging and it looks like there are no nearby stores carrying the Air Jordan XI ‘Concord.' We recommend keeping an eye on the SNKRS App and https://t.co/yYv8xSbp4x. @DCorraro Solid pick up.  👍 @focusonfantasy Sorry to hear you did not see the Got ‘Em/Didn’t Get ‘Em screen. The \"pending\" status on the product page will still change to either \"sold out\" or \"purchased\", letting you know if you were successful in buying the shoes. @EatingBeagles Catch of the day. 🎣 @iAmMikeWill_ The Nike Sportswear Tailwind (Style: AV4783-010) was on our site, but has since sold out. If you're interested in a similar style, check this out. https://t.co/ihEKYINEnE @Talvir_Thind Hi, Talvir. This was a glitch on our SNEAKRS app and they are not due to launch. Sorry for the confusion. Any questions? Let us know. @Steveh8213 This isn't the sort of thing that we like to see. For us to explore some options can you let us know when and where you purchased your shoes? If purchased via our website, shoot us a DM with your NikePlus email or order number. @Szero_Value Nike proactively seeks athletes to endorse the brand, and unsolicited Nike sponsorship requests aren't accepted. @Avaladez9 The Zoom Fly SP in the Dark Loden/Dark Loden-Dark Stucco, style AA3172-300, is no longer available on our site. For a similar style, check one out here: https://t.co/NzBtJOyGRA @Uri_Cruz11 Nike proactively seeks athletes to endorse the brand, and unsolicited Nike sponsorship requests aren't accepted. @bigwhoopin This isn't the kind of thing that we like to see. For us to explore some options can you let us know when and where you purchased your band? If purchased via our website, Shoot us a DM with your NikePlus email or order number? @not_chan_bing Nike proactively seeks athletes to endorse the brand, and unsolicited Nike sponsorship requests aren't accepted. @matt_wetzel We do not offer a men's version of the 2018 U.S. Stadium Home Jersey with three stars. We appreciate your feedback and will be sure to share it with the appropriate team. @cIinicalney Nike proactively approaches athletes, associations and clubs for donation/sponsorship, and therefore we don't accept direct applications. @iambaileyparker That's not something we wanna see. We recommend reaching out to the original retailer for the best return/exchange options. If they are unable to assist you then go ahead and give our consumer service team a call at 1-800-344-6453 (7 a.m. - 4 p.m. PT, Monday through Friday). @ericherrera2011 Results of your training showing. Keep it up. 👍 https://t.co/lZmnns5zIk @TamaraElkins8 We like your style. https://t.co/Iq0FLa9dNG @riodee1983 That's not something we wanna hear, Rio. For us to explore some options can you let us know when and where you purchased the shoes? If purchased via our website shoot us a DM with your NikePlus email or order number? @ricardo16420343 Let's get you back on your feet. Head to https://t.co/fmS7WfxlFL to shop the latest. @daviDBWalker Some say battle scars build character. These must have 1000 mile stories. @AQuincyJones Come and get em. \nhttps://t.co/TZNWDRyydo @rjclemens10 All the colors for your holiday needs. @rjclemens10 Its come early. https://t.co/iATGFX8vfv @lexijulianna94 Making good choices. 👌 @joshanderson_99 Hi Josh, while we appreciate your interest, Nike proactively seeks athletes to endorse our brand and doesn’t accept unsolicited sponsorship requests. We wish you and your team the best. @jankilavanjasus Good question. Thanks for bringing this to our attention. That is not an official Nike promotion. @EthanGibs1 Got em. 🔥 @Byron_Burns We appreciate your passion for Nike. Please check out our career page for employee opportunities: https://t.co/iaVnVTSCcO @BunBTrillOG 🤘. @ToriJayne_ No email address to share, Tori. Check out all of our open positions at https://t.co/HZohQ3jhOq. @LonnieErv Let's get you past this wall. For us to assist with this, can you let us know if you are after any particular style, colorway and your zip code? @samueloketayo14 NO news of a restock on that style. If you let us know your size and where you are located we can check availability within our stores. @its_kminna We didn't forget about you, Dixon. The Nike Sportswear 'Kaepernick' Long-Sleeve T-Shirt is back. https://t.co/YXMSPW7b2w @allengrunas This isn't the kind of thing that we like to see. For us to explore some options, can you let us know when and where you purchased your shoes? If via our website shoot us a DM with your NikePlus email or order number? @S1ORDER Read more about our claims option if you believe there is a workmanship flaw that falls outside of the 30-day return policy. | https://t.co/lugfJaLsy4 @S1ORDER Hey Harlem, check out our warranty guide for more info. | https://t.co/nLl7ux5BnU @TheScottEason Gotcha. In these cases, we suggest force closing the app, then trying again. That feedback has been passed along to our team. @TheScottEason Do you have a screenshot of this error? We'll pass this along to our team. @ntandomatini_ If you're still unsure of what size to order, returns are hassle-free and accepted within 30 days of the delivery date. More info on shoe sizing can be found here. | https://t.co/fOwg6rc6Wm @ntandomatini_ Hey Tommy, check out our size guide for further information. | https://t.co/37x4qcM8tf @AmDanielle12 Nike proactively seeks athletes to endorse the brand, and unsolicited Nike sponsorship requests aren't accepted. @Harper_4Life Nike proactively seeks athletes to endorse the brand, and unsolicited Nike sponsorship requests aren't accepted. @AkeemSumthing We appreciate you reaching out to voice your concern, Akeem. Your voice matters to us, so we'll be sure to pass along your thoughts to the appropriate teams. Let us know if you have additional questions or concerns. @mholmes300 No official word at this time. Keep it locked to https://t.co/6frTjiy8F8 for updates. @AaronSlam13 🔥🔥 @maccadoo83 That's not what we like to see Daniel. Can you pass us the order number or the email used when making the purchase? @cristy_td Brace yourself, Christina... We do ship to Puerto Rico. 😊 Check out our website here: https://t.co/VU5JekkeHz @JoshEdits We see you out of this world with those kicks. https://t.co/vYmdFlBjjB @krzydrewski Begin your design below. https://t.co/Jmz8jvXRg7 @FrAnK110598 Nike proactively seeks athletes to endorse the brand, and unsolicited Nike sponsorship requests aren't accepted. @con7roy Giving the body what it needs. 👍 @Kyleellison10 Got it. Just to double check, are you running iOS 12.1 and version 3.7.0 of the SNKRS app? @Kyleellison10 We're here to help. What device, operating system and version of the app are you using? Can you pass us a screenshot of what you're seeing? @mrsdgrif Sorry to hear this, Diana. This is due to the high traffic on the site at the moment. Could you first clear the cache and cookies within your browser, see if this fixes the issue. If not please send us a screen shot showing the error code. @Joshua1Faith Way to stack up that mileage. 💪 Again tomorrow? @JohnGee59 We see you trotting over that finish line. 🦃 @Mr_JohnnyDrama Here to help. Unfortunately this particular style in this colorway has now sold out. If you let us know your size and zip code we can check availability within our stores. Alternatively check out the same style in a different colorway here: https://t.co/mfAhPMlSrY @patgum10 It's always time. https://t.co/MdtAJ0UUBa @Marrmarje No news on a restock of this style via our website. If you send over your size and zip code we can check availability within our stores for you. @Rossell23180507 https://t.co/7PpCdIhru3 “My dad sacrificed his dream, so I could live mine.” @KyrieIrving #justdoit https://t.co/cxU6IMkFQs @danib724 We recommended reaching out to the original retailer for the quickest return/exchange options. If they are unable to assist then the next step is to file a claim with our consumer service team. You can reach them at 1-800-344-6453 (7 a.m. - 4 p.m. PT, Monday through Friday). @danib724 That's not what we like to hear Danielle. Can you let us know when and where you purchased them, so we can look into potential options for you? If purchased from us go ahead and pass us your NikePlus email or the order number. @M_Krisp Grade school sizes of that style will be priced at $170 in SNKRS. Check them out here by scrolling to the bottom of the page: https://t.co/x1QB2T0oTj @Neels330 There is no word at this time. Keep it locked to our site for updates. @angelikaprez We see you over there getting those gains in. @emily_bergquist Hey Em, Nike is unable to accept outside advertising ideas or suggestions for commercials. We appreciate the interest and wish you the best of luck. @KimWessels1 Hey Kim, we appreciate your interest in Nike. As it stands, Nike proactively approaches athletes, associations and clubs for endorsement/donation, and therefore we don't accept direct applications. We wish you and your team the best of luck in the future. @socaljourno An investment worth making. 👍 @J_Gholar3 We got you. https://t.co/U7gDrhcwCP @SeanStr90693825 That's not what we like to see Sean. Can you let us know when and where you purchased the shoes, so we can look into potential options for you? If you purchased them from https://t.co/Gjt5897sf3 can you pass us your NikePlus email and order number? @4thQrt The purrrfect pair. 🐱👟 @whatiswoodworth It's time to create new ones. https://t.co/LqiUbtpcbj @rabbibpd You see this @NikeRunning? @Krys722 Runway walk-off? https://t.co/FBbNn81KYg @Mzhoov There is no word on future availability at this time. Keep it locked to our site for updates. @Mzhoov We know convincing takes time. As a friendly reminder, you can wear any Nike product for up to 30 days and still return it, if it doesn't work for your son. | https://t.co/b75KsR9dZw @Mzhoov That style isn't currently available on our site, but that's not a problem when we have the Hyperdunk X TB. https://t.co/WL146RgqKb It’s only crazy until you do it, and @obj doesn’t feel like he’s done anything yet. #justdoit https://t.co/tFd1wAmBWK @aboutLUVmusic Look no further, Kendra. 👀 https://t.co/FX48bSj7Mn @CoachTuttle That's not what we like to see Andrew. Can you let us know when and where you purchased the shoes, so we can look into potential options for you? @iAmEdg3 Hey Skyler, no word on if/when we will release a Rockets Authentic City Edition jersey. Stay tuned to our site for any updates: https://t.co/tZEet1l0gD @AlexMotsinger Sorry to hear you're having issues checking out, Alex. Let's have you try clearing the cache and cookies for your browser to see if that helps. Keep us posted. @lastmemir Nothing to share currently about a restock. Stay tuned for any updates. https://t.co/Mv3ywOdoxd @jchrisphonte79 Great question, Jenna. No word on if what style will release in Women's sizing. We suggest staying tuned to our site for any updates: https://t.co/wyHGtrhc0e @iamsabibo Hey Sabi, sorry to hear. Unfortunately, we don't have a way to rescue product outside of our 2-year coverage window against workmanship flaws. We apologize for any inconvenience. If you're looking for a new pair, you can find our Air Max 95 options here: https://t.co/ep5Dfqqqat @kennywheeler91 Nike proactively seeks athletes to endorse the brand, and unsolicited Nike sponsorship requests aren't accepted. @Daveyjones253 No word at this time, Kyle. Stay tuned for possible updates. | https://t.co/Fu59QyURaw @MJBEAUREGARD22 No word at this time. Keep an eye on https://t.co/yYv8xSbp4x for any updates in availability. @MJBEAUREGARD22 Nothing to share about a restock. Keep it locked to https://t.co/yYv8xSbp4x for any potential restock updates. @kba41510 Apologies for the inconvenience, Kenny. The Early Access offer for the Air Jordan 1 Retro High OG 'Golden Harvest/Sail/Black' is no longer available. This style will launch on SNKRS on 11.17 at 10am ET. https://t.co/7wYJlpX5Bt @MJBEAUREGARD22 The Browns color rush jersey is not currently available in adult sizes on https://t.co/yYv8xSbp4x. Stay tuned to our website for any updates. @LCoelho9 We see you racking up those miles like these no finish line. @azzozlolo045 This particular style is the Nike Mercurial Superfly IV and is not available via our website. We recommend checking in with local authorized retailers for availability. Alternatively check out our current selection of Mercurial Superfly's: https://t.co/G2xLWODqoS https://t.co/klmMF0Q8Tn @chriskantai Time to get back out there. 🏃 @_KinggChris The wait is over, Chris. You can finally grab your pair of the Nike Air Terra Humara here: https://t.co/rqK8RU9pIu @HimSinPune Hey Himanshu. We recommend checking out the 'Elite Cushioned No-Show' running socks. They are made with strategically placed cushioning and offer exceptional impact protection, mile after mile. You can check them out here: https://t.co/l9HAUHBDsU @michaela_demong Icy ground can't stop you. 😉 https://t.co/npVZ8r0YeF @arierutgers Nothing to share about that style releasing at this time, Arie. Keep it locked to SNKRS for any possible launch info: https://t.co/Imfn2JBSQc @ace3boogie3 They'll be coming soon, however no date/time to share on a release of that particular style. We recommend signing up to become a NikePlus member to receive the latest and greatest from us. @lynjaimeee No time/date to share on a release of that particular collection. We recommend keeping an eye on our website here for any updates: https://t.co/iWxCwBAFSI @mssignificant We'd be happy to pass your feedback along to the team. Hit us up if you need anything else. @tigerafe Hi there -- while we appreciate your interest in Nike, we proactively seek opportunities to endorse our brand and don’t accept unsolicited sponsorship requests. We wish you the best in your future endeavors. @motherhenx4 We recommend using the size guide provided on our site. Also, as a friendly reminder, you can wear any Nike product for up to 30 days and still return it, if it doesn't work for you. @JasonxBrown Get 'em now. https://t.co/csbN9lVRWB @King_Felix092 Welcome to the family. 🙌 @Dodgers821 Locked in, no excuses. Time to grind. 😤 @ericisaacs0n Our friends @nikestore can take care of you 👊. @ChildishLandino 🙌🙌 @c_rod_jr We got your back. Find our selection of gloves here: https://t.co/ScmTjFl6TU @JerseyIdeas We are unable to fulfill requests for custom products/colorways. Let us know if we can help with anything else. @JerseyIdeas Unfortunately, those colors are not currently an option for our Air Max 270 via NIKEiD. Keep an eye on our site for any updates regarding future colorways. https://t.co/TVbXHT9WiT @ericisaacs0n Time for some new treads. Hit us up if we can help. https://t.co/sSAEjBs74c @NinjaButGinger Let us know if we can assist with anything else. @NinjaButGinger We recommend using a soft cloth with mild soap and warm water. We do not recommend machine wash or machine dry. You can check out our official cleaning tips here: https://t.co/JDMWIW5ZEz @HarryFroling Sorry for the troubles. We do not like to see this kind of thing. For us to explore some options can you let us know when and where you purchased your shoes? If via our website, shoot us a message with your NikePlus email or order number? @mourikschilder We're ready when you are. | https://t.co/sTecebv9u2 @RaeganPebleyTCU We like her style. 😉 @simplykdj You see this, @NikeRunning? @Muh_ree_tuh No word on the release of that jersey. We recommend working with your local authorized retailers for potential availability. https://t.co/klmMF0Q8Tn @Chris_Warhol Select sizes of the Air Jordan 1 'PSG' are still available. Grab your pair here: https://t.co/QcdGXsz3L4 @bboy_hodge Current openings can be found here: https://t.co/Mjn82IwIuj. The rest is up to you. @josanyinbi1 Hermes has nothing on you. https://t.co/9bec2UW8KT @KINGFRAZ15 Found 'Em. https://t.co/O2LcAkj7Xh @em_rose120 It's cuffing season. https://t.co/uHxaAmViyb @_AskTellSpeak Check out the link below for the phone number for your area. |  https://t.co/KR7ultDRSB @CarmenIONs Muy bien, Carmen! Queremos seguir viendo cómo te superas día a día! Que nada te detenga! Start with a dream. Finish with a fight. \n\nCongratulations, Lelisa Desisa. #justdoit @only1toostrong We've got you covered. Get your hoodie here: https://t.co/YiQBtYRS2J @atwl77 Our friends over at @NikeRunning may have some ideas for you 🏃. @OG_1394 There's plenty of room on board here, Orlando. https://t.co/53XpcD8Qyk @StillWes81 Those looks like an older version of the Flightposite. Checkout a similar colorway here: https://t.co/mOKJkMPlCi @BigGezzy1 👋🎱👋 Signs point to yes. @jgo319 No news to share at this time. We do appreciate your feedback and will be sure to pass it along to the appropriate team. Let us know if we can assist with anything else. @KingLadyGaga This is the Nike SFB Field 2 8\" boot. Check them out here: https://t.co/2OkBWBVlaV @Drinoculars Let's go, Adriana. Just download the Nike Training app to get the ultimate personal trainer, right on your phone. Keep us posted on your progress. https://t.co/8n35UNNw3h @AlyssaNMark Nike is always looking for new talent; check out our careers page for any potential openings. | https://t.co/KZtxqic2TS @stechilly Got it. As a first step, we'd recommend checking in with the original retailer to discuss your options. If they're unable to assist, give us a call at +44 (0) 2076604453 (Monday-Friday 8am - 8pm, Saturday 8am - 5pm). @Emily_Faithhh Don't ever let 'em catch up. Don’t just dream of a place on the podium. Dream of a place in history. #justdoit https://t.co/LWHGKZ6i1F @preeconsuelaa 🔥🔥 @14clod Ciao Claudia, ci dispiace per quanto accaduto. Ti chiediamo gentilmente il tuo indirizzo email per segnalare il tuo feedback e riportare la tua esperienza. A presto https://t.co/klmMF0Q8Tn @WormBurneRR There is no word at this time. Keep it locked to our site for updates. @Toledo8_8 Hi, Jose. Thanks for connecting with us. You can find out all information on jobs and positions available at Nike here: https://t.co/eJ6vFLv9bN Let us know if there is anything else we can assist you with. @playoffhopes Definitely the biggest sneakerhead we've ever seen. 💯 @scottschwef Crushing streaks like it's nothing. 👊 @ivanjaay Nigel's vision. Ivan's design. Great work. @jgsntv Got it. We recommend reaching out to the original retailer to discuss your options since they were recently purchased. If they're unable to assist, you can file a footwear claim here: https://t.co/38LsyhzXJ2 @jgsntv That's not what we like to see Johnny. Can you let us know when and where you purchased the shoes, so we can look into potential options for you? @Pierre_Sir While we appreciate your interest, we seek athletes to endorse Nike and don't accept unsolicited donation/sponsorship requests. @shashankjaitely Orders placed from our US site must be shipped to a US address. If you're trying to place an order in India, then we would recommend clicking the flag in the top right corner of your screen to change your location, and then shopping that version of our site. @LSincerbeaux 🔥 @AKHI_ZA Mom always knows best. Show her how far you can go with a fresh pair. https://t.co/amMwqlFcE4 @bald_waffle Noodle today, beast tomorrow. https://t.co/AkbIcqt36n Don't chase records. Chase history. #justdoit https://t.co/k9YyeTCaqc @MrJoeWaugh @ChallengeRoth1 @Garmin Not letting the weather get in your way. @byronkelly6 Ready to hit shots like never before. https://t.co/UmRLKDXF7T @COLANI_SHUNGUBE We've got your back. You can find our current selection of VaporMax styles on our site in your region here: https://t.co/ySEUAybGmT @hsaxbyRN Let us know if we can assist with anything else. @rcgladwin64 Hey Ryan, checkout the Vapor Crew socks here: https://t.co/7tRiwnD1S8 @hsaxbyRN The classic is still running strong and ready for you: https://t.co/u6KB18J1Z8 @vweric23 Looking good. 👍🔥 @MariahParsons18 We got you. 😎 @YungFreshUT Not exactly what you were looking for, but you can't go wrong with these: https://t.co/lImxtEuwBc @lambreux Nothing to share about a restock of those colorways of the VaporMax 2. We recommend checking in with authorized retailers in your area and online for any availability, and keep it locked to our site for any updates. | https://t.co/9XjpoSJpdo @csontosgeri Kicking off the weekend the right way, with just over a 10k. https://t.co/QiXiKyb28k @emilysportsacct Hey Emily, nothing to share currently. Stay tuned for any possible updates. @tim_radio Just in time for Saturday. @LadyBookworm117 Great question. All of our standard Women's pairs come in a B width. We also have Women's wide options available, which are a D width. @urf8ce Thanks for letting us know, Christina. Please give us a call at 800.806.6453, and we'd be happy to assist with an order over the phone while inventory remains. @ImperialSC We sincerely apologize for any confusion however, today's SNKRS Pass was available for both iOS and Android. Let us know if you need anything else. @Me49435715 Very rare air. @spelsie_kence Unfortunately, we no longer carry that style on our site. We'd suggest connecting with authorized retailers in your area or online for potential availability. @urf8ce Sorry to hear that, Christina. Try closing your app and adding to cart again. If you still have trouble, give us a call and we'll help you place an order over the phone. | 800.806.6453 @26th_kyle Sorry to see that. Can you let us know when and where you purchased your boots? Where are you located? We'll look into your options. @milliewool Big style with big smiles. 😎 @erinnnn_lynnnn We recommend reaching out to the original retailer for the best return/exchange options. If they are unable to assist you then the next step would be to file a claim with our consumer service team. You can reach them at 1-800-344-6453 (7 a.m. - 4 p.m. PT, Monday through Friday). @erinnnn_lynnnn That's not what we like to see Erin. Can you let us know when and where you bought the shoes, so we can look into potential options for you? @Dallas852 No matter the time, your dedication is winning. 😎 How are the Nike Free RN training you? @ImaneSifi1 After doing some digging, we weren't able to track that style down. If you'd like a similar option, check out the Nike Free RN Flyknit 2018. Get it here: https://t.co/cOIrhetrJQ @real_yagermike That doesn't appear to be a legitimate Nike retailer. To buy authentic Nike product, we only recommend shopping on https://t.co/yYv8xSbp4x, at Nike Stores, or authorized Nike retailers. @RunsWithLuna Hey TJ, great question. That is a PE (player exclusive) jacket that isn't available for purchase. We recommend checking out a similar style, the AeroShield, which stands up to rain and wind to help keep you dry and comfortable. Check it out here: https://t.co/3MIRdbLDiB @lewgibbsandrews Let us know if we can assist with anything else. @lewgibbsandrews Hey Lew, there is no word at this time. With that said, we recommend looking into the Phantom Vision shoes that give you the precise control that you need. Check them out here: https://t.co/QIIQOx1c8n @DeVante_XI Shoot your shot. https://t.co/67BFhvWVKL @BEST_PURYEAR There is currently no info on a restock of this particular style. Keep an eye on our website here for any updates: https://t.co/WK8JrRsURY @jmolinamuriel Question asked and answered with a 5k. No doubt, hard work at play. 👌 @mikelouie_ The Air Max 180 'Wheat Gold' will be available via SNKRS on 11.5. Stay tuned for more information here: https://t.co/gGKFY31GtD @Laurenwoodhous6 We zien dat je verstand hebt van fashion. Geniet van dit mooie paar Lauren. @TheRealTrisC We appreciate your interest. As it turns out, we proactively approach athletes, associations and clubs for endorsement, and therefore we don't accept direct applications. We wish you all the best. @k8421 Hey Karen, thanks for hitting us up. Unfortunately, Nike World Headquarters is private property and not open to the public. Nike does not currently offer public tours. @ryanfinn84 The Cortez Ultra Moire 'Forrest Gump' is currently unavailable on our site. We recommend checking in with our authorized retailers for any potential availability. @jaybizsle Thanks for reaching out, Jay. That style isn't available on our site at this time. You can shop a similar one here: https://t.co/da3gIid016 @kBraydyn We don't have a list of authorized retailers available, but if you have a specific store in mind and want to send us a DM, we can double check to see if they are one of our authorized retailers. https://t.co/klmMF0Q8Tn @trey29_golf Time to hit the links. ⛳️\n\nGet geared up here: https://t.co/UyvXUELu88 @yaeTBG Stompin' since 2002. In case you need two pair: https://t.co/Mv6uaGes7b @justlyk3myke Can you let us know where you're located and what you need help with? We'll get you pointed in the right direction. @askmepb Check out all of Nike's charitable initiatives at https://t.co/6qlWii2vr2. @kBraydyn Doesn't look like we have the Air Max NM for sale at this time. We recommend checking in with our authorized retailers for any availability. @SuelaB8 Let's get you back on track. This particular style is not a genuine Nike product and is unavailable on our website or in-store. We recommend checking out the same style in a similar colourway here: https://t.co/5RKaJzkOhB @DexParker317 There is currently no news on a re-stock of this particular style. We recommend keeping an eye on our SNKRS app here for any updates: https://t.co/e4BpDDz7pM @esmee__zamora That's not what we wanna hear Esmeralda. Can you let us know when and where you purchased the shoes, and we will look into potential options for you? @chidoziemonago We recommend reaching out to an authorized retailer for any potential availability. @chidoziemonago We have no plans to restock the Nigeria Collection, Eri. Keep it locked to https://t.co/yYv8xSbp4x for any possible updates. @ItzDaHotSauce Feeling good after a solid run. 👌 @jeanneb That combo looks lightning fast. ⚡⚡ Kids from Akron don’t just dream it. They do it. #justdoit https://t.co/Cmj2caP2Mq @_uSbo1 That shoe is not currently available in that region. Stay tuned to https://t.co/yYv8xSbp4x for any potential updates. @therandyknights The AirMax 97 'The Ten' will be available at 10:00 am EDT via our SNKRS app. Keep an eye on our SNKRS app here for any updates: https://t.co/ODYevaNmaC @Kimo_pi New shoes can lead to new PRs. Let's do this. 💪 @destiny_cook You can never have too many. https://t.co/FAaE0KwREj @BeckyAlderson3 Healthy obsessions are always good. 😏 @TashMcB88 The Nike Mag is not available for purchase. @heath1370 Hey Dan, those jerseys are not currently available for purchase. Check out our selection of USMNT Jerseys available on our site: https://t.co/lHnDZS9Itw @vweric23 Reppin' your city in style. @_MikeSosa We don't want you freezing. 🥶 https://t.co/avVgbx1NQ2 @ca3troh3ro4 Work hard, play hard. We see you. https://t.co/vKtjewHHDd @KatieMay_MUA 🔥 🔥 🔥 @TuanyeWEST You'll be glad to know that the Zoom Pegasus Turbo does feature our ZoomX foam. Get the bounce here: https://t.co/rWb2OPBuEK @harringtoncp Way to make that swoosh-a-latern, Chris. Just ''Boo'' it. 🎃 @ShoeLacyLace Those who run together, stay together. Couple Goals. https://t.co/SnPz93aOHq @kelsboy6 Glad to see your enjoying the new kicks Josh. We have a wide variety of running shirts available. You can check them out here: https://t.co/m4qFiqmJct @ToyaTrillllllll 🔥🔥🔥 @tymanuel13 Check these out: https://t.co/Pme8MFSKJa @BamFr_ ✋ @UncivilizedAMO Great question, Adam. If you're a NikePlus member, you can take advantage of our 30 day return policy, which allows you to buy the item, try it out, and return it within 30 days if it doesn't work for you. @KourtneyCurrent 🖐 @MJBEAUREGARD22 No word on an away jersey at this time, but be sure to check out all of our available Browns gear here. |\nhttps://t.co/lxNiWXfiiY @rigoretana No news on a restock of that size at this time. As mentioned, we recommend checking into some of the other Chicago Marathon gear to help commemorate this accomplishment. | https://t.co/B0f7y85Ncq @VoiceofDeborah Hi Deborah, we appreciate your interest in Nike. At this time, we’re not currently accepting new business proposals. Although we can't accept your request, we appreciate your interest in our business and wish you continued success. @OMGItsYobi We're here to help. We recommend logging out of the app, restarting your device, and logging back in. If still unsuccessful, we recommend uninstalling the app, restarting your device, and reinstalling the app and log back in. @rigoretana Sorry to hear that, Rigo. Rest assured, we've got you covered. Grab the gear to remember the big race with here: https://t.co/j4GsztLXJQ @lastname_ADAMS Always. | https://t.co/tPruH0Zsj0 @lilCLanky Thanks for hitting us up, Christyne. We do have a selection of Tall sizes for Women. Find all options available here: https://t.co/r0K3wGlVe6 @Dimichard_ No plans to release that style at the moment. Keep it locked to https://t.co/yYv8xSbp4x for any potential future updates. @lilsnig Our favorite time of year. 😉 @web_connect We got you, Justin. Checkout the Pegasus 35 Flyease here: https://t.co/kza004euMj @rokohungary Nice catch. We're in the process of fixing this now. @JBDBOM Thanks for hitting us up, Justin. Unfortunately, no news to share about those styles releasing. We will be sure to pass your feedback along to the appropriate team. @TrojanDNC Check the Pegasus 34 out here: https://t.co/eO2LaMtJKK @BoroWilson Be careful not to burn anyone with that 🔥😉 @NotVeryLilly Those appear to be a pair of our Nike Free RN. You can check them out here: https://t.co/B81g3beptf @YesImDano Be ready. https://t.co/ukuYNqse7H @Griffin20Lance Nothing to share currently, but keep it locked for any updates here: https://t.co/gnJFPBjGbx @chirvvin Hey Charlotte, Nike is pronounced: neye-kee. Let us know if you have any other questions. @CheckTheDossier No word of a release in the US, yet. Checkout our current LeBron collection and keep it locked for any updates here: https://t.co/zHhJ7jp7xO @CoachRShort 🔥 🔥 🔥 @thepcolaagent No current promo going on at this time. We recommend signing-up to be a NikePlus member. It is free to sign-up and you get exclusive access to the latest products, promotional offers, and free shipping and returns. @ray_raybauzon We got you. | https://t.co/eY2dqTr1pE @adimogbu We recommend checking out our Community Impact page, where you can find all information about Nike's investment in the global community. Check it out: https://t.co/qMUwrF3vyY @cookiemillerfit Evidence of hard work, determination and dedication. Let's not forget, inspiration. Way to go. First to the finish, second to none. Congratulations Brigid Kosgei on your #chicagomarathon victory. #justdoit That’s Mo like it. #justdoit #chicagomarathon @Maggie_Givinchy You've put in a lot of work. Now just need a new pair of kicks. 😉 @OFCryangreen Good choice. 😏 @Samdromeda That's not what we want to see. Would you mind DM'ing us so we can take a look into this? @NickyRozay_ We'd be happy to check into that order status for you. Mind sending us a DM so we can get started? @_STECON That's not what we like to see. Mind sending us a DM so we can take a look into this? @The_Mr_Strong An accomplishment worth sharing. Keep setting the pace, and we'll see you at 2,000. 🏃 @hookerrr We appreciate your feedback and will be sure to pass it along to the appropriate team. We recommend keeping it locked to our site for product availability updates. @ericj076 Time to lace up and set your own personal best. 🏃💪 @Jo_GotGame No word on that at the moment. Keep it locked to https://t.co/yYv8xSbp4x for any updates. @KScully319 Hey Kristen, we are aware of this issue, and working on a fix. Thanks for bringing this to our attention. @nilesh3857 Thanks for reaching out to us. However, that isn't an authorized Nike website. Can you let us know where you're located? @CaseyNeistat Sneakerhead ready to hatch. 🐥 @diegolemem Nothing to share about that style releasing at this time, Diego. Keep an eye on https://t.co/yYv8xSbp4x in your area for any possible launch updates. @goldthought We apologize for all the confusion, Allison. Good news, you can now grab your pair of the Nike VaporFly 4% Flyknit here: https://t.co/Nojra63nHs @PotentAura We've got some we think you're going to like. |\nhttps://t.co/Yjz1Rcdb5x @Sportstakejake1 As mentioned, we do not accept unsolicited sponsorship requests. Please let us know if we can assist you further. @Sportstakejake1 We proactively seek opportunities to endorse our brand and don’t accept unsolicited sponsorship requests. @ClarkSSClub Thanks for reaching out. All of the information about Nike's charitable giving is available at https://t.co/LVjIsAN7XU. We recommend heading there for more info. @DoMoreMarty Hey Martin, that size appears to be sold out at this time. We recommend checking for availability with local or online authorized retailers while keeping it locked to our site for updates. @kyle_coffee Update: check the VaporFly 4% available now. https://t.co/FsDTuRgK4w @nathankline The Vaporfly 4% Flyknit is scheduled to release at 10 a.m. ET. @nadyice_ We may not have that one, but no worries -- we have a similar full-zip jacket available here. 😉 https://t.co/ZmHAgYTxeJ @byHannahMcG You can never have too many. https://t.co/ipTb3JybJy @Adam_Snow27 Hey Adam, no current word on if/when that style will release in your region. Stay tuned to https://t.co/yYv8xSbp4x for any potential updates. @jscheel2254 Hey Justin, thanks for hitting us up. Unfortunately, Nike World Headquarters (WHQ) is private property and not open to the general public. Nike does not currently offer public tours. @TheTonyPortelli Way to get that new personal record. How long until the race? @palmer_a5 We recommend checking out the Renew Rival Shield. This shoe offers responsive cushioning and a weather-resistant design that helps keep your feet dry. Check it out here: https://t.co/bCHAwZTW9f @katelynecarter We got you, Katelyn. We do have a few neutral colorways for our Lunar Hyperdiamond 2 Pro, that has lightweight cushioning and great traction for speed optimization around the bases and in the field. Check em' out and let us know what you think. https://t.co/lA8XUsObgv @Cashton310 Our apologies. That is an older style of the Air Force 1, Style: 820266-001. Let us know if you have any other questions. @Goingdowntheal1 Sizes should still be available to select. We recommend trying to enter the draw on the SNEAKRS page here: https://t.co/BTxs28d5wI Make sure you have cleared your cache and cookies. @_bourtneibane We got you. | https://t.co/ixwE8vG03j @erinnnn_lynnnn Getting that afternoon run in. 👌🏻 @Cashton310 Hey Celia, checkout available versions of the Air Force 1 '07 LV8 Utility here: https://t.co/EgYQ3bdo7X @JayMcinally7 Hey JM, there is no word on if that style will be brought back. We recommend checking out the Zoom Strike as it has the same heel-to-toe drop and foam. Check it out here:\nhttps://t.co/2cfZUHBvfn @__njw__ Another run in the books. What's next for you and your Zoom Fly's? @AlexCIark Sorry to hear you were unable to snag your size, Alex. Stay tuned to our site for any potential restocks here: https://t.co/5iOl5DpLzL @pumpkin684 We recommend checking in with authorized retailers in your area and online for any possible availability, as we currently have no plans to release that jersey via our US site. @KamTheHumble Hey Kam, thanks for bringing this to our attention. We have passed it along to our team, and are working on a fix. @keith_breck You already know the answer. https://t.co/z1jVeU5lyz @LuckiSkinz The perfect shoe for any type of workout. | https://t.co/KiNve1tIsP https://t.co/J1Fzin6Pn7 @SuddrickR Were glad you reached out, Rachel. Sorry for the troubles. We don't like to see this sort of quality. For us to explore some options can you let us know when and where you purchased your shoes? @IllSupreme She's a keeper. You may just have to hook her up. 😉 https://t.co/GHe5Q5whII @tishh_lah Say no more. https://t.co/GbeexkOL6N @mw_formation Got it. We recommend checking out the Hypervenom III Elite. This boot is designed to increase shot velocity and enable dynamic changes of direction, perfect for keeping your players on their toes. Check them out here: https://t.co/5XvEwXum5s @mw_formation Hey Matt, we are here to help. Could you let us know what kind of player you are and if you train on turf or grass? @Rogue_Leia_ Thanks for reaching out. Check out our shoe cleaning tips for our recommendations. | https://t.co/4iuWZbxeGk @jungminshim Nothing like a Sunday morning run. @JimSiedlecki Bump, set, bust a move. 🏐 @dlayphoto Welcome to the club. 👟 @tayyyoh As that jersey was worn back in 1998, it is no longer available for purchase. Check out current USA Jerseys: https://t.co/sWagM0h6iS @DreBuzzworthy How about free muscles? | https://t.co/W3BeOp2Bx0 @equalitywarrior Here to help, Sarah. We recommend working with a doctor, as they'll be able to help you with specific needs. That being said, we suggest a stability shoe such as the Odyssey React, which features our lightweight and responsive React foam. Find more info: https://t.co/qpuAsb9pxF @YahirG_7 Get yours now: https://t.co/8lVLvRYlzJ @IfexChi That is not an official Nike page. Let us know if we can help you with anything else. @youdoyouboi They're back. Grab you pair of the Nike Sportswear Tech Fleece Men's Joggers here: https://t.co/no8Xks1q8a @guptayol That is not a Nike authorized retailer. We only recommend purchasing from authorized retailers to assure authentic product. @TWOTOTHEMORGAN 🔥 🔥 🔥 @IronCobra 3 is the magic number. Same time again tomorrow? https://t.co/jYOPdlpJDh @SI8064mohit For assistance, please follow up with our customer service team. You can reach our team on: 1800-102-6453 (Freephone) or Consumercare.india@nike.com. @Unathi_jam Knocking challenges out of the park. 👊 @rudomeanslove That is not an authorized Nike account. Official Nike Instagram accounts will be verified. @kinleygene Rain or no rain, all we see is greatness. https://t.co/t50j41u9X2 @sarni72 Well-done. 😉 @dosomethingPR Thanks for clarifying that. Since this was from a Nike store, we suggest contacting any Nike store near you to discuss a return. You can check this link for contact info for nearby stores: https://t.co/M4Qzj8F6iw @dosomethingPR This isn't the quality that we like to see, Paul. For us to explore some options can you let us know when and where you purchased your shorts? If via our website can you shoot us a DM with your NikePlus email or order number? @bittyrip After a run like that, time to stretch and recover. https://t.co/KiWV7u5E6k @ARQ_ECRA Up, up and away with those 5km. No kryponite can stop you. 💪 @BenjaminSchmid Life about to get flipped upside down once you rock this fresh pair. 😉 @rudymadethis While we don't have that specific style available at the moment, we do have some Converse styles with Lunarlon cushioning. Check em' out: https://t.co/5NtzIMX5mU @CapricornColey Great question, Nichole. FITSOLE is a specific type of footwear insert that provides optimal cushion and support for running. Let us know if we can help with anything else. @sushrut_kamble Thanks for passing that along. That is not a Nike authorized retailer. We only recommend purchasing from authorized retailers or https://t.co/yYv8xSbp4x to assure authentic product. @sophieyeo94 🔥 🔥 🔥 @weightlifter14 Hey Kenson, thanks for hitting us up. Unfortunately, Nike World Headquarters (WHQ) is private property and not open to the general public. Nike does not currently offer public tours. @Odiegavriel Great question. He was wearing a PE (player exclusive) of the Dri-Fit TW striped polo. You can find available colorways here: https://t.co/KU8S9lDmtm @julianna_nich Worth every penny. https://t.co/vp6qVUnRnt @JackSnashall Let's get you past this wall, Jack. We don't like to see this sort of thing. For us to explore some options can you let us know when and where you purchased your shoes? @C_Eduardo_EM We see you racking up those miles and cutting down your time. Same time tomorrow? He’s done it again. \n\nNever stop chasing your crazy dreams. #justdoit https://t.co/sVXo12E1r9 @dalesiov17 We've got you covered: https://t.co/syV5PD00n0 @MichaelHicks66 Great question, Michael. He is wearing a Nike Pro sleeveless training top underneath his polo. You can get yours here: https://t.co/ajmwoCvGyy @monicacr7 Shoes got the block hot. Super hot. 🔥 @S1LENCEK1LLS Thanks for reaching out. We appreciate your interest in the company, however, we proactively seek athletes to endorse our brand and don't accept unsolicited sponsorship requests. We wish you the best of luck in your future endeavors. @BrandonRockhold We got your back, Brandon. Hoping these can still get us bonus points: https://t.co/tqJ6GZiEl6 @OctobersOwnTae It's not quite what you wanted but it's still 🔥 https://t.co/kjDlXcbfbu @BrandonRockhold Not just any shoes, shoes for speed. 🏃💨 https://t.co/UwhmVrhEUE @geminii_mua Get some heat for the streets here: https://t.co/xD58xj0h6e @geminii_mua Some 🔥 https://t.co/HK6baXIFxp @IrwanBadree Another run in the bag. Training for any races? ....Yes you. https://t.co/VUybeHZDVk @deleonr1 Here to help, Bobby. DM us your order details and we can check this out. ⬇️ @InfamousWambli Head in the clouds on a hard morning run. @IronCobra We truly see there is no finish line here. 👍 Any events coming up? @RyanParedez Gotta bring in a fresh pair to match those pearly whites. 😎 @akornylife Toffe kleurencombinatie Kornelis. Je hebt de smaak te pakken. @Legallicious New PR ✅. On to the next challenge. Let's get it. 💪 @zzhbkk Way to break in the new running kicks. @dannycuellar16 You're in luck. | https://t.co/Eqgp4BrLDz @brianv_graphics Sounds like a plan to us. Keep us updated on your progress. 💪🏼 @blondie54 🔥 🔥 🔥 @RobbyBear512 On it. | https://t.co/Cno2ZIWGNz @brianv_graphics Getting in that early week jog in style. 😎 Any races coming up? @tingle1971 Time to lace up and let out that speed beast. 💪 @imyazaa We appreciate your interest. As it turns out, we proactively approach athletes, associations and clubs for endorsement, and therefore we don't accept direct applications. We wish you all the best. @teamrituals We appreciate your interest in Nike. At this time, we’re not currently accepting new business proposals. Although we can't accept your request, we appreciate your interest in our business and wish you continued success. @teamrituals We appreciate your interest. All available information about Nike's partnerships can be found on https://t.co/63MYV3QRWX. Let us know if you need anything else. @healthyhilling2 If you enjoy our NRC, check out our NTC app here: https://t.co/a4ARg0x0P6 @Natasha90915677 The Air Presto Mid Utility X Acronym is scheduled to release 9.20 at 10am ET via SNKRS. For more information see here: https://t.co/NnHvbFFJUW @mhshelton21 From hurt feet to hot feet. https://t.co/NPFuBK6olP @Adroso360 No specifics to share yet. Keep an eye on https://t.co/yYv8xSbp4x for updates. @_Ky95 Make sure your smoke detector isn't going off. Lots fire in this pic. 😎 @umbilhetepfvr Now that's how we do a Sunday. 💪 See you again tomorrow? Yesterday, 2:01:39 seemed crazy. Today, it’s the marathon world record. #justdoit https://t.co/dm7JeOCPqN @cj_beckerman Thanks for reaching out. You can shop our headwear options here: https://t.co/mI4JsHEY5V @TorryHickson Great question, Torry. That's not something we offer at this time but are happy to pass this along to the appropriate team. @TweetMePleaseTw The recent Instagram accounts that are recruiting brand ambassadors aren't associated with Nike. You can find official Nike accounts via Instagram's verified seal. @J_ohhJ_ohh She'll step into the new season in style with these: https://t.co/TPx8PNS3de @NicoleZwiener To appropriately handle your experience, please contact us at 800.344.6453 (7am-4pm PT, M-F). Thank you for contacting Nike, and we look forward to hearing from you soon. @Elder_TCEvans Hey Tijuan, that isn't a colorway we offer. You can check out available options here. | https://t.co/LobxUNkDu8 @derricktre_ That's the Nike Air Max 270 Bowfin. Stay tuned for availability. @RONIROXX Autumn shades on a classic silhouette are ready and waiting: https://t.co/UJUzvYnsBw @SteveG_79 Thanks for reaching out, Steve. We recommend heading over to https://t.co/AKeYSJB0XA to check out our options for group orders and to get in contact with a local authorized Nike Team dealer. @Theboymala Hey Malachi, there is no word on new colorways at this time. Keep it locked here for updates. | https://t.co/24uBkpbcsy @Qlynnc The recent Instagram accounts recruiting brand ambassadors like that one aren't associated with Nike. You can find official Nike accounts via Instagram's verified seal. @Choni_ Hey Choni, thanks for passing this along. Our team is aware of the unauthorized accounts acting as Nike and are working to take them down. You can find official Nike accounts via Instagram's verified seal. @itssmac That's the Air Max 1 Premium Jewel (Style code: 918354-100). It was released back in 2017, and is no longer available on https://t.co/yYv8xSbp4x. We suggest checking in with authorized retailers in your area for any possible availability. @ChantalMarie87 Hey Chantal. Those are the Nike Air Monarchs. You can find them here | https://t.co/TZO3XBDrV1 @byronthomasinfo That is our Hurley 'Advantage Plus' men's wetsuit. You can find it here https://t.co/8kJjkHxJgC? @daddyndumbe 'You don't have to change who you are to change your world.' You got this, Seth. 😉👍 @iChyna Two pair mood. ✌️ https://t.co/4CTpo1ufUd @ArantxaV_ Veel plezier met jouw toffe aankoop! @Tmac9mmTracy The recent Instagram accounts that are recruiting brand ambassadors aren't associated with Nike. You can find official Nike accounts via Instagram's verified seal. @RDoomra We're sorry to hear pair hasn't performed the way you expected, Rajan. Please give us a call at 000 800 100 9538 to address your concern further. @DavidDay_CTS Hey David, the recent Instagram accounts that are recruiting brand ambassadors aren't associated with Nike. You can find official Nike accounts via Instagram's verified seal. @angelikaprez Keep the streak going 👊 @TikurAsat The recent Instagram accounts that are recruiting brand ambassadors aren't associated with Nike. You can find official Nike accounts via Instagram's verified seal. @davinalexmma The recent Instagram accounts that are recruiting brand ambassadors aren't associated with Nike. You can find official Nike accounts via Instagram's verified seal. @TheSarahFader The recent Instagram accounts that are recruiting brand ambassadors aren't associated with Nike. You can find official Nike accounts via Instagram's verified seal. @YamiMarko The recent Instagram accounts that are recruiting brand ambassadors aren't associated with Nike. You can find official Nike accounts via Instagram's verified seal. @chpchris27 Great question, Chris. The recent social media accounts that are recruiting brand ambassadors are fake and have no affiliation with Nike. Let us know if we can help with anything else. @Maurice_Leggo Hey Maurice, that is not an official Nike account or promotion and has no connection to Nike. @shatadal_saha Hey Shatadal, thanks for reaching out. That isn't an authorized Nike retailer. We only recommend shopping at authorized retailers to assure authentic products. @mijnforza Goede tijd gezet, volgende keer de 10 kilometer binnen de 55 minuten? https://t.co/KSrgV6w09z @reyxrmz Great question. We only sell shoes in pairs. If you have any other questions, let us know. @eddieloks92 Time to lace'em up and bring that heat to the court. 😎 Yeah, that’s more like it. #justdoit If you’re a girl from Compton, don’t just become a tennis player.\nDream of being the greatest athlete ever. If you have only one hand, don’t just watch football, play it. At the highest level. When they talk about the greatest team in the history of the sport, make sure it’s your team. Believe in something, even if it means sacrificing everything. Don’t become the best basketball player on the planet. Be bigger than basketball. If you’re born a refugee, don’t let it stop you from playing soccer for the national team — at age 16. Don’t believe you have to be like anybody to be somebody. Lose 120 pounds and become an ironman, after beating a brain tumor. Don’t settle for homecoming queen or linebacker. Do both. Don’t picture yourself wearing OBJ’s jersey. Picture OBJ wearing yours. Don’t try to be the fastest runner in your school or the fastest in the world. Be the fastest ever. RT @Kaepernick7: Believe in something, even if it means sacrificing everything. #JustDoIt https://t.co/SRWkMIDdaO @HelloLandie Great question, Landie. That style isn't available on our site at this time. You can shop her current collection here. | https://t.co/tPjPlykn8x @lewisheming24 You see this? @NikeRunning @mrflacogallego Buena ruta.👌 ¿Pensando en próximos retos? @danielua23 Te has superado. ¿Tenemos retos a la vista? https://t.co/bIzsPAyCHL @BoukevdVeen Je bent niet te stoppen Bouke. Komt er een deel vier? https://t.co/l67IhAminA @TheLucasFiles Hey Lucas, unfortunately that is an older style. Check out some newer options for when he is ready to part ways here. | https://t.co/IK8Zn9Wset @_FRESHPRINTZ_ We're sorry to hear that. That shoe is the Air Max NM and is an older style that is no longer available on our site. We recommend checking out some newer styles of the Air Max here. | https://t.co/yEHMzmhJiG @lyssa_sd Guess she is having a hard time seeing it. Shop the collection here. | https://t.co/qE2VPDTBqE @curlyfoodie If your dog wants to play ruff, we've got the shoes for you. \nhttps://t.co/46dl8AkdII @Chiu_bacca506 No word on if/when we will restock that style. We suggest checking in with authorized retailers in your area and online for any possible inventory. @AndrewRoySteele Thanks for hitting us up, Andrew. Nothing to share about that style as of now, but keep it locked here for any potential updates: https://t.co/FzhsM8Zuof @Jellybean_kaang Not what we'd expect to hear. Can you let us know when and where you purchased your AJ11's? @mohib_riyaz Setting the pace for an active weekend. 👍 Again tomorrow? @SinisterAudio Did you see this, @nikefootball? @AaronMorter Thanks for passing that info along Aaron. Were sorry to hear about your experience. We have escalated your complaint to the proper team, and they will be looking into it. Let us know if we can assist with anything else. @Ajoy07ms Unfortunately, we are not currently offering product through any apps in your location. Feel free to give us a call at 000 800 100 9538 for more information. @TrulyBlesseddd We proactively seek athletes to endorse our brand and don't accept unsolicited sponsorship requests. @FrankPucher We think it feels something like this. https://t.co/kVEY7ZKUDT @sn1zzle Unfortunately, that exact color is not available for purchase at this time. Stay tuned for any updates in the future and check out our current Nike Air Zoom Pegasus 35 options here: https://t.co/Xcf0K2gef6 @stick2web Seems like Roxanne's ready to go another round. Ready? 😉💪 @zulugg7 Watch out. Straight up 🔥 about to hit the streets. @Veesh_veesh We're here and ready to help, Irie. For us to look into this, can you shoot us a DM with your NikePlus email or order number? @Asmakki We got your back, Ali. These are our Metcon 4's. Check them out and let us know what you think: https://t.co/YuMtz3ZTdC @HMNG99 No word of a restock at the moment. We advise to stay tuned to SNKRS app for possible updates. @ZeroMotiveSa We appreciate your interest. As it turns out, we proactively approach athletes, associations and clubs for endorsement, and therefore we don't accept direct applications. @mannycee89 No word at this time. Keep it locked to https://t.co/yYv8xSbp4x for updates. @waldo_nick On August 23, Nike members in the UK, France, Germany, Italy, the Netherlands and Spain have the chance to unlock early access by participating in an NRC challenge to run a marathon over the period of 10 days. More details: https://t.co/n6tvbWmuQc @Oppersnor Hey Tasha, thanks for hitting us up. Looks like the Air Max BW is not available via https://t.co/yYv8xSbp4x at the moment, but we'd suggest checking in with authorized retailers in your area and online for any possible availability. @iTrixzeh Fresh and ready to hit the streets with some 🔥. @j_ca1977 Way to feel that running rhythm. Monday's got nothing on you. 😉 https://t.co/Xbfpalf7Xe @umodmohs We’re here for you. This is not the quality we expect. Let us know where and when you purchased the AF1's, so we can explore some options. @deepak3180 Sorry to hear this, Deepak. Have you contacted the store directly in regards to a return/exchange of the gloves? @freeman4eversa Hi, there. We can confirm that this is not an authorized retailer of Nike. If you want to buy genuine Nike products, we recommend that you shop at the store or website of a recognized retailer, a Nike store or at https://t.co/KsVlgVcJiO. @dave_air Greatness always 🍃 a mark. @BeeCeAnne There is no plan to release that style at this time. Keep it locked to our site for updates. @Elara38 At this time, that option isn't available. We will be sure to pass your feedback along to the appropriate team. @Elara38 Hey Elara, that is a custom shoe that isn't available for purchase at this time. However, you can find the NikeCourt Air Zoom Vapor X Hard Court here: https://t.co/VR5TVs7hTz @IamSasu Hey Sasu, there is no plan to release that style at this time. Keep it locked to our site for updates. @_phoeb22 Hey Phoebe, that's an older style of the Air Max Jewell and isn't available on our site at this time. You can shop current Air Max options here. | https://t.co/TUB07E2PYl @_Awake13_ First of many Aaron. What's next on the race list for you. @goody2shus Great question. The Structure 21 would be a great shoe to use for your marathon. It features a firmer foam on the arch and a softer foam on the outer side, which creates the right amount of stability and protection. Let us know if we can answer any additional questions. @mikeromano93 We are here to help. How can we assist today? @goody2shus Hey Clare, check out the Air Zoom Structure 21. As a friendly reminder, you can wear any Nike product for up to 30 days and still return it, if it doesn't work for you. https://t.co/HCrLnpzl1A @froomedawgeeee We are scheduled to release the Zoom Vaporfly 4% Flyknit on 01/10. You can read more on this updated style here: https://t.co/wzgiR8jsQv You can take the superhero out of her costume, but you can never take away her superpowers. #justdoit https://t.co/dDB6D9nzaD @Ricks1236 To appropriately handle your experience, please contact us at 800.344.6453 (7am-4pm PT, M-F). Thank you for your contacting Nike, and we look forward to hearing from you soon. @IronCobra Nothing better than finishing the week off with a challenge. 💪 What's next? @BruceLeeWalker1 Great question, Bruce. Looks like that is not an official Nike Instagram page. You can find our official Instagram accounts with the verified check mark. @GracieClayton19 The Air Max 98 'Tidal Wave' are only available in men's sizes. @LTHundley Someone is looking fly 😎😎😎 @Christi91985342 Hey Christian. The Instagram accounts that have been recruiting ambassadors are fake accounts, and are not affiliated with Nike. Official Nike handles can be identified by Instagram’s verified seal. Let us know if we can help with anything else. @lovexoxpink16 To appropriately handle your experience, please contact us at 1-800-344-6453 (7am-4pm PT, M-F). Thank you for your contacting Nike, and we look forward to hearing from you soon. @Meyer9M03 There is no set time for the Collegiate Week Zero Collection to live on our site. Product will be available as long as we have inventory. That said, we recommend purchasing as soon as possible. | https://t.co/sGOfW563uy @Gaurav_Munna Some say tomorrow. You said 'Just do it'. https://t.co/hJujzRCdma @scottschwef Nothing's out of reach for you. Why? Because.... https://t.co/DtvI31I7k5 @Camelia_Gayle Congrats. 👏 We look forward to seeing the next stop in your journey. https://t.co/Z98bpned4Z @heyauntiebae As it turns out, we proactively reach out to potential ambassadors and therefore, we do not accept direct request. We wish you all the best. @BuckNut85 Hey Brett, thanks for reaching out. Nothing to share about an updated version of that shirt, but check out our current available Ohio State shirts here: https://t.co/kZxk8wuItY @SwaggyRen Thanks for connecting with us. That is not an official Nike account. Official Nike handles can be identified by Instagram’s verified seal. @RMGDier That is not an official Nike account or promotion and has no connection to Nike. Official Nike Instagram handles can be identified by Instagram’s verified seal. @Olicityibelieve Hey Em, no current word on if/when we will restock that jersey. Keep an eye here for any potential updates: https://t.co/fi7Mz4ILfq @patil_khush No problem, Khush. Let us know if we can help with anything else in the future. @patil_khush Got it. We recommend checking in with the original retailer for all return/exchange options. @patil_khush We're unable to authenticate products, however, if it was purchased from our site, a Nike Store or an authorized retailer, it is authentic. @chEWybody Thanks for reaching out. That is not an official Nike account. Official Nike handles can be identified by Instagram’s verified seal. @_smitty55_ Thanks for connecting with us. That is not an official Nike account. Official Nike handles can be identified by Instagram’s verified seal. @deepmauze Hey Leonardo, that is not an official Nike account. Official Nike handles can be identified by Instagram’s verified seal. @JSullyUF Hey Joe, that is not an official Nike account. Official Nike handles can be identified by Instagram’s verified seal. @stefanpaetow Thanks for connecting with us. Our team is aware of the issue and is working to resolve it. Official Nike handles can be identified by Instagram’s verified seal. Let us know if we can further assist. @youngserenityy Great question, Jordy. The social accounts that have recently appeared online aimed at recruiting ambassadors are fake accounts with no connection to Nike. Official Nike handles can be identified by Instagram’s verified seal. Let us know if we can help with anything else. @Todmir1 That is not an official Nike account. Official Nike handles can be identified by Instagram’s verified seal. @JustBringit247 That is not an official Nike account or promotion and has no connection to Nike. Official Nike handles can be identified by Instagram’s verified seal. @nellipotnambiar Thanks for reaching out. However, that is not an official Nike page. Be sure to reach out if there are any other questions. @mrflacogallego Retazo completado. ¿Vamos a por más? https://t.co/uiwDiFpf6U @aschauer08 That is not an official Nike account. Official Nike handles can be identified by Instagram’s verified seal. @mr_jtenorio Hay Jayvie, that is not an official Nike account. Official Nike handles can be identified by Instagram’s verified seal. @Alpha_Sykk Great question, King. That style was not produced by Nike. Let us know if we can assist with anything else. @danielua23 ¡Buena carrera! ¿Tenemos retos a la vista? https://t.co/uhM0qx6L17 @A_Kayz_6 Those are the Air More Uptempo's. That colorway is no longer available on our site but can be found with Style: 414962-002. You can find the same shoe in a different colorway here: https://t.co/iVcu5CfkCj @Leenvestment Hi Lee, thanks for hitting us up. The social media accounts that have recently appeared online aimed at recruiting ambassadors are fake accounts with no connection to Nike. Official Nike handles can be identified by Instagram’s verified seal. Let us know if we can further assist. @StretchMoneyCT Look no further. | https://t.co/A2BcE0Od27 @ianjh05 Your Cortez supply drop just landed. https://t.co/0jRpZSxgjC @riyashtamang__ That's not an official Nike promotion or account. Keep it locked to your NikePlus email for future promotions and offers. @ExtremeReacts That's not an official Nike promotion or account. Keep it locked to your NikePlus email for future promotions and offers. @Anshuman_Gilani That's not an official Nike promotion or account. Keep it locked to your NikePlus email for future promotions and offers. @sangamman That's not an official Nike promotion or account. Keep it locked to your NikePlus email for future promotions and offers. @adv_sadique That is not a Nike authorized retailer. We recommend shopping at https://t.co/8cSult8x9X or at local or online authorized retailers to guarantee authentic product. @Ogz_13 There is no plan to release that jacket at this time. We recommend keeping it locked to our site for updates. @CINCODEMYHOES Mac might need some new game day kicks 😉 https://t.co/ieoXXymBYj @StarkeIndustrie Hey Michelle, that's not something we wanna hear. Could you tell us when and where you purchased these, so we can look into potential options for you. @_angelsalas_ Guess you'll have to distract her with another hat. https://t.co/Fuhx9DECdU @Bbenji44 Stay tuned for potential releases in the future. In the meantime, check out our current France gear here: https://t.co/q7lXBMqjF4 @duhonshea Check it out here: https://t.co/cgXoqTKu2y @MrJtooU No word on a release at this time, Jay. Check out our current line of Air Max shoes here: https://t.co/FAqMJPgDfN @pranavsharma00 That is not an official Nike page. Let us know if we can help you with anything else. @iannoname The Nike Free x Metcon is available in unisex sizing on our site. https://t.co/pQrpZUO0uA @cristicream Thanks for reaching out, Cristian. The FFF shirt has been launched in EU only. Stay tuned to https://t.co/0wJi4RGpwB for updates on US release. @SarahjThomson18 Getting those miles one step at a time. https://t.co/HgnktqhFQu @beadsontoast Thanks for reaching out, Bob. Most products have a 2-year coverage period. You can find out more about this here: https://t.co/YpU2eDFQHl @IDoItForHaiti No promo codes available at the moment, make sure you sign up to NikePlus to be the first to know. You can register for free here: https://t.co/WgkEvLF0Xb @Bee91Amanda Part of a complete marriage. @daynanaomi The first two colorways released in sizes 4 &amp; 4.5. Please note, we recommend purchasing from authorized Nike retailers only. This ensures you're receiving genuine Nike product. Let us know if we can assist further. @Naava_Mo We appreciate your interest in Nike, MoMo. However, we proactively seek athletes to endorse our brand and don't accept unsolicited sponsorship requests. @Mamta_khndelwal In that case we advise to contact our team on - 000 800 100 9538 (24 hours a day, every day) to see if it is possible to set up a claim. Let us know if you require any further assistance. @Mamta_khndelwal Thanks for the info, Mamta. Have you contacted the store you purchased the product in? We would advise to first follow up with the original retailer. If they cannot assist, let us know. @K1Matt6D Sorry to see that, Matt. Can you let us know where you purchased the pair of cleats? We'd be happy to explore some options with you. @daynanaomi Hey Dayna, thanks for hitting us up. No current plans to release that style in a 4.5. Keep an eye on the SNKRS app for any potential updates. @BeeLaSole Keep it locked to the Lakers team page via https://t.co/yYv8xSbp4x for the latest. @IronCobra Now that's how you start a week. https://t.co/CnvJdgcj7y @JordanJohnson2_ Sorry to see that, Jordan. We've forwarded this to the appropriate team. Keep an eye on your NikePlus email address for an update, an athlete will reach out as soon as possible. @greghall24 Out with the old, in with the new. https://t.co/Swmqa90bAD @adam_panzer Go ahead and pass us a DM of the message you received, and we'll look into this for you. https://t.co/klmMF0Q8Tn @ada0obi That isn't an official Nike page. Let us know if we can assist you with anything else. @anistan81145404 You'll need to contact that site to ask for a refund. @anistan81145404 Hey Anistan, that is not an official Nike website. We suggest always purchasing from https://t.co/yYv8xSbp4x, in Nike stores, and authorized retailers to ensure you are receiving genuine Nike products. @natalimorris Great question, Natali. That's the Zonal Cooling TW Golf Polo with a blade collar. You can check it out here: https://t.co/cAxIzbsZpf\n\nAdditionally, the rest of our men's golf polos with blade collars are available here: https://t.co/zI9T7bskcF @BJ13X Check out the PG 2.5. It's got a supportive midfoot strap, foam midsole and rubber tread for durable traction. Let us know what you think. | https://t.co/3VUU0oOWJV @BJ13X Mind elaborating on what you're looking for in a shoe? @daf1b7e0f63b487 No word on if or when that style will be available. Keep an eye on https://t.co/yYv8xSbp4x for any potential updates. @BJ13X That shoe is the Roshe Mid Winter Stamina, this shoe comes in Kid's sizes. It is not currently available online/in-stores. We recommend checking with Nike authorized retailers for availability, you can use style code 859621-001 to help in your search. @nino_24s We've got you covered: https://t.co/f9ly5Mp8VJ @nino_24s Say no more: https://t.co/fu1J2TEXFa @hotsince1030 No release date to share at this time. Keep it locked to the Nike App and https://t.co/yYv8xSbp4x for the latest. @bangkokram Hey Chris. If your daughter is not a fan of our Dynamic Fit collar, we recommend checking out our low top Mercurial options here: https://t.co/EwUCAdHnQE. As a friendly reminder, product purchased from our site is eligible for a 30 day trial run per our return policy. @harrisonlhl123 ☄️🌏🌵 @ChiEzekwesili Can't stop the rhythm now. Will we see you again tomorrow? @Money_Meach Let's get you past this wall. This particular style is the PG 2, and is currently unavailable via our website. We recommend checking out the same style in a different colorway here and letting us know what you think: https://t.co/ZgpktcgkNh @TousNadine Hey Nadine, to clarify, are you referring to the tongues? Our Flyknit material is made to be worn close to the skin. As a friendly reminder, you can wear any Nike product for up to 30 days and still return it, if it doesn't work for you. @NickBenderKMBC Tomorrow calls for partly cloudy with 100% chance of comfort. @willwen26 We recommend checking with your local store for volunteer opportunities. @b_curtis Hey Brittany, we recommend checking out the Free X Metcon. This shoe has the lightweight flexibility of Nike Free with the durability of Nike Metcon. As a reminder, you can wear any Nike product for up to 30 days and return it, if it doesn't work for you. https://t.co/iN0KNl0DL5 @peterllort Here to lend a hand. There are no plans in our calendar to release a VaporKnit Strike version of this. However, you can check out the Paris Saint-Germain Breathe Squad here: https://t.co/6oLKUiCHRE @JetFlyy4 Great news. The 2018 Nigeria Stadium Home Kit has now been re-stocked. Check it out here: https://t.co/OezFznbaeO @RodoSpartan El ritmo no puede parar. ¿Cuándo volvemos a quemar las calles? 🏃🔥 @Stacey_Knight97 It looks like the manufacture date is 12.06.17. With this being said, they fall within the 2-year window. Please give us a call for further assistance with the claims process. Tel: +44 (0) 2076604453 (8:00-20:00, M-F &amp; 8:00-17:00, Sat.) @LukeL210 Great question, Luke. That specific colorway was designed on NIKEiD and unfortunately is no longer available. Check out our current selection of Air Max 1s or, design your own version here: https://t.co/PQTXqiV7px @king_rela That exact color is not currently available on https://t.co/BaGzlIoF0R however, you can design your own colorway in \"Rust Pink\" on NIKEiD here: https://t.co/yyVYZyBJeY @BLEEDINBLUE4 Apologies, Scott. The reserved for you sold out on a first come basis. However, you'll have another chance to grab the kicks on 8.10 at 10am ET. Keep an eye out for updates here: https://t.co/9FWAdgvAye @Stacey_Knight97 Gotcha. We stand by our product for up to 2-years from the manufacture date, which can be found on the size tag. Please give us a call so we can walk you through our claims process. Tel: +44 (0) 2076604453 (8:00-20:00, M-F &amp; 8:00-17:00, Sat.) @Facetimegod Hey Kevin, keep it locked to the team page via https://t.co/yYv8xSbp4x for the latest. @Stacey_Knight97 Sorry to see that happened, Stacey. As a first step, we suggest checking back with the original retailer for all return/exchange options for the quickest solution. If they are unable to assist, give our team a call. |  +44 (0) 2076604453 (Mon - Fri 8 am - 8 pm; Sat 8 am - 5 pm). @JustisWhite42 Sorry to hear that, Justis. We will pass your feedback along to the correct team. We suggest checking in with authorized retailers for all availability. Also, we release tall sizes occasionally, so make sure to keep it locked to our site for any updates. | https://t.co/etSPs1wH6W @wordbender_dia We currently don't have any jerseys available on our site. We recommend checking with local or online authorized retailers for potential availability. @wordbender_dia Hey Dia, appreciate you hitting us up. To clarify, where are you located? We'll do our best to assist. @xanisz Hi Anisa, het ziet er naar uit dat jouw winkelmandje nog leeg is. Is het inmiddels al gelukt met het plaatsen? @dreyesguardia Empezándolo como debe ser. Te vemos otra vez mañana? @_lauramiles_ Mind if we jump in? This isn't something we like to see. For us to explore some options, can you let us know when and where you purchased these flip-flops? @JessyJRenae Hey Jessica, we don't have any on our site at this time. However, we recommend checking with local or online authorized retailers for potential availability. @Arnold20K Unbox those buckets and go. https://t.co/5tcUyxyP26 @LarkLogan Get yours today: https://t.co/bMC0cBpgHC @TaoOfKathryn Destined for greatness. 💪 @dujosu No word on that as of now. Keep an eye on our social feeds and https://t.co/yYv8xSbp4x for any updates. @katrina2991 Sorry to hear that, Katrina. As a first step, you'll want to check in with the original retailer for all return/exchange options. If they are unable to help, give our team a call. | +44 (0) 2076604453 (Monday - Friday: 8 am - 8 pm; Saturday: 8 am - 5 pm). @OriginalRitro Hey Ritro, those are the Air Jordan Future. You can find them here: https://t.co/zWYImhWL1V @danfow02 Nice cop with those Dan. Get after it on your run in the morning. @KennedyAlyse_ Sounds like it's time for some new ones. Check out our styles here: https://t.co/WtFj8WMvCY @theandrewjacobs Hey Andrew, no word on a release at this time. Keep it locked to our site for potential availability. @sweet_angel1 Un placer ayudarte. Garmin, TomTom y Polar son colaboradores con Nike. Para encontrar el que mejor se adapte a lo que necesitas Penelope realmente aconsejamos contactar con ellos directamente puesto que hay mucha diversidad y con muchas opciones. Un gran saludo https://t.co/klmMF0Q8Tn @Chrismorden24 Nice cop on those, Chris. Ready to hit the streets with some 🔥 on your feet. @easyrichkidz No restock news to share for that style at this time. We recommend checking out authorized retailers for potential availability. @TheChineduOraka No word on when that jersey will be available. We recommend checking with local or online authorized retailers and keeping it locked to our site for potential availability. @WhereMyKicks Get yours here: https://t.co/guqFNF3zm7 @Jason_Dew No word on an extra-wide version of the Turbo. Keep it locked to our site for updates. @Colleen_C23 Great question, Colleen. You can bring up to 10 pairs of shoes to any Reuse-A-Shoe collection location, which can be found at most Nike and Converse retail stores  For more information regarding Nike Reuse-A-Shoe visit our site here: https://t.co/0X4skWlXGn @LiamJReale Time to take'em out for a test run 😉. Let us know how you like them. @jmestrenadal Hola Jordi, entedemos la frustración. Hemos cogido tu Feedback y hemos dejado constancia de ello, de tu opinión y de tu experencia. Sentimos mucho las molestias.\nCualquier otra duda con la que te podamos ayudar, será un placer, de verdad. Un gran saludo https://t.co/klmMF0Q8Tn @lightningsrobin ❤️❤️❤️ @Sajuoe That's correct. The size run for the Free RN Commuter 2017 is 35.5-36.5, 37.5, 38-39, 40-41, 42-43, 44 and 44.5. @millertmjd Feel free to give us a call at 800.806.6453 (4am - 11pm PT, 7 days a week) and we'd be happy to talk more in-depth about the right option for you. @ivvno7 That style is not currently available for purchase on https://t.co/yYv8xSbp4x. We recommend checking out authorized retailers for potential availability. @millertmjd Thanks for passing that over. The FS Lite Trainer 4 is a training-specific shoe, which means it will provide added durability in comparison to your current model, the FS Lite Run 2. To check out other training options, we recommend heading over to https://t.co/yYv8xSbp4x. @millertmjd Mind providing us with a picture of the inner shoe tag? That's the easiest way for us to identify which style you have. @millertmjd What shoe are you wearing, Joe? Fitsole was a drop-in insert and not specific to an actual model. We'd recommend a new pair of shoes after approximately six months of regular active wear. @jmestrenadal Hola Jordi, efectivamente Nike ya no ofrece servicio a antiguos dispositivos y apps, entre ellos SportWatch. Nike ofrece las apps NRC y NTC gratuitas para que puedas registrar tu actividad. Aquí dejamos un enlace. Sentimos mucho las molestias https://t.co/6IH63gkYo2 https://t.co/klmMF0Q8Tn @KeshavUnhelkar Surprised about your time? No need, you got this. 😉 @OrchevA85 They better rev their engines. You about to leave'em in the dust. https://t.co/0eqUaEiF3c @iamjajja You did that.....Yes you. 😎 https://t.co/ZYb5c8FmqW @vivssbby We've got you covered, Vivian. The Nike Juvenate Women's Shoe is available on our site now. Check it out here: https://t.co/h3MHGLTeqd @dawoodsulmn5050 Hey there, no current word on that. We do release new styles on https://t.co/yYv8xSbp4x frequently, so stay tuned to our site for any future updates. @giuseverzz Complimenti per il tuo impegno, Giuseppe. Qui i consigli NIKE per prepararti al meglio a questa distanza e migliorare le tue statistiche: https://t.co/4Jovenanpv @IanAndrewsDC Sorry to hear that, Ian. As a friendly reminder, if you purchased your shoes via https://t.co/yYv8xSbp4x within the last 30 days you can still return them. @xaviergreen12 Just Soup It. @qthubby Ready to feel like your flying?😉 Let us know how they fit and what you think? @jdsharp7 Nothing to share about that style releasing at the moment. Stay tuned to SNKRS for any possible updates. | https://t.co/EWQ3UKfIrY @bgfireee Look no further. https://t.co/lqWBNJ8YPQ @Jake_Jordan29 Sorry to see that, Jake. Unfortunately, we do not sell individual shoes at this time. Be sure to checkout our current Nike Free x Metcon Training shoes if you are in need of a replacement, here: https://t.co/d43mvFZ8Yg @MrsRandiBowser No word on that dropping, but you can find our current collection of floral options here: https://t.co/u4BwbnCNJK @MzLuckylefty No release news to report on All-Star apparel. You can stay tuned to the link for the latest gear: https://t.co/F8iM3YwZiN @CybermanAndy Happy to help. Let us know if we can assist with anything else. @CybermanAndy We do offer tall sizes available in select training pants such as the Dri-FIT Training Pants. You can check those out here: https://t.co/XHNd3qRMJL @deejay_sharky No current plans to release that style on our site. Your best bet would be to check in with authorised retailers in your area and online for any possible availability. @JuankQuir Hola Juan, Nike ya no ofrece servicio a antiguos dispositivos y apps, entre ellos el SportWatch y por eso no deja sincronizar las carreras. Ahora Nike ofrece las apps NRC y NTC para que puedas registrar tu actividad. Aquí dejamos un enlace https://t.co/YCMddhvc0M. https://t.co/klmMF0Q8Tn @effeerreaa Siamo qui per te, Francesca. Per poterti offrire un' assistenza personalizzata e su misura per te, ti preghiamo di contattarci allo +39 (0) 238591453, dal lunedi al venerdì, dalle 9:00 alle 18:00 e il sabato in lingua inglese. A presto. https://t.co/klmMF0Q8Tn @productrunning We see you putting in that work and flying through your run. How are the Pegasus Turbo treating you? @BLUESTARFTW Closing out the month strong. What's the next challenge? @PIEDSGEANTS  https://t.co/Lm9XPknXAn @moilozano7 That's the Futura Blocked t-shirt, Style: 927392-072. We recommend checking with local or online authorized retailers for potential availability. @shanmt14 Not the quality we expect to see, Shan. Can you let us know when and where you purchased your pair? We'll do our best to help. @StuffRoan They're re-tooled and ready for you: https://t.co/uSBWjkY0LQ @imfkgdone We do have the Cortez available on our site. If you're after something similar, but different, check out the SB Zoom Blazer Low: https://t.co/k7r4QvRYqJ @labita1995 Nothing to share at the moment. Keep an eye on https://t.co/yYv8xSbp4x for any updates. @HeartOfAGiant That gift card giveaway isn't a Nike promotion and is being offered by a third-party company. We apologize for any confusion. @morgz_tv That gift card giveaway isn't a Nike promotion and is being offered by a third-party company. We apologize for any confusion. @JurassicAnthony That gift card giveaway isn't a Nike promotion and is being offered by a third-party company. We apologize for any confusion. @cedricpremium That giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed and apologize for any confusion. @Thebigjackpot We apologize for any confusion however, that giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. @ArmandoDelFuego Thanks for connecting with us. This is not a legitimate Nike promotion and apologize for any confusion. Let us know if you have any other questions. @Marquess_vela Thanks for the tweet. This is not a legitimate Nike promotion and apologize for any confusion. Let us know if you have any other questions. @c_bear98 We're aware of this link. That gift card giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. @TrueButters That gift card giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. We apologize for any confusion. @RueNigel That gift card giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. We apologize for any confusion. @TherealMskitty_ That gift card giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. We apologize for any confusion. @Tologa That gift card giveaway isn't a Nike promotion and is being offered by a third-party company. We apologize for any confusion. @TheFreEP That gift card giveaway isn't a Nike promotion and is being offered by a third-party company. We apologize for any confusion. @IRockJays96 That gift card giveaway isn't a Nike promotion and is being offered by a third-party company. We apologize for any confusion. @itgottabeJD That gift card giveaway isn't a Nike promotion and is being offered by a third-party company. Our team is looking into getting this taken down. We apologize for any confusion. @EFEJoseph17 That gift card giveaway isn't a Nike promotion and is being offered by a third-party company. We apologize for any confusion. @mmeggggo That gift card giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. We apologize for any confusion. @prettyheartash That gift card giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. We apologize for any confusion. @Capone7813 No word of a NFL option for NIKEiD at this time however, keep it locked to our site for a potential launch as the season starts here: https://t.co/4KbTTCFnMR @private_world77 That gift card giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. We apologize for any confusion. @Diamonds_ByDee That gift card giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. We apologize for any confusion. @laurenprata That gift card giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. We apologize for any confusion. @baeannaaa That gift card giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. We apologize for any confusion. @jay08330238 We're aware of this link. That gift card giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. @nj10__ We are aware of this link. That gift card giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. We apologize for any confusion. @imdezrenee We apologize for any confusion however, that giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. @ChadTheCoolcat Hey Brian, that is not a Nike promotion. We apologize for any confusion and recommend keeping it locked to your NikePlus email for future promotions. @Boy1der22 That gift card giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. We apologize for any confusion. @aaron_caine Those are no longer available, however, you may want to check out the Havoc gloves. | https://t.co/WgPLKTDBcp @_shockedculture That gift card giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. We apologize for any confusion. @krivriv1 That gift card giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. We apologize for any confusion. @brydominique That gift card giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. We apologize for any confusion. @_HughHeff That gift card giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. We apologize for any confusion. @__vanityy That's not a Nike-sponsored promotion. Keep it locked to the Nike App and your NikePlus email for any promotional offers. @_Nat3BANKS That's not an official Nike promotion. Keep it locked to your NikePlus email for future promotions and offers. @FromBqutecorp That isn't a Nike-sponsored promotion. Stay tuned to your NikePlus account and email for any promotional offers. @Fluit_Fry That gift card giveaway isn't a Nike promotion and is being offered through a third party company. We are working with our teams to have it removed. We apologize for any confusion. @BigMan776 That gift card giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. We apologize for any confusion. @dani_hughes31 We're sorry for the confusion. That gift card giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. @RageSober That gift card giveaway is not an official Nike promotion and is being offered through a third party company. We are working with our teams to have it removed. We're sorry for the confusion. @Makaveli1221 That gift card giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. We apologize for any confusion. @ionstheGOAT Please check with the original retailer for possible options. If they're unable to help, visit here: https://t.co/XliQQTlqa1 @bs_4bidden That isn't an official Nike promotion. Our team is looking into getting it taken down. We apologize for the confusion. @ShenikaBlack4 That gift card giveaway isn't an official Nike promotion and is being offered by a third party company. We're working with our teams to have it removed. We're sorry for the confusion. @SolelyLiving That gift card giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. We're sorry for the confusion. @dlynnnn_ That gift card giveaway is not an official Nike promotion and is being offered through a third party company. We are working with our teams to have it removed. We're sorry for the confusion. @Reason_tjay That gift card giveaway isn't a Nike promotion and is being offered by a third party company. We are working with our teams to have it removed. We're sorry for the confusion. @ionstheGOAT Let's get you past this wall. For us to explore some options can you let us know when and where you purchased your boots? If purchased via https://t.co/wwNa2fhME3 can you shoot us a DM with you NikePlus email or order number? @Big_Papi_Daddy That's not what we like to see, Benjamin. Can you tell us where and when you purchased the compression pants? @raab1ya Great question. Here are the recommended cleaning guidelines: https://t.co/AfUlOURzPX @MrBenLaw If you're looking for something similar aesthetically, the Nike Free RN 2018 is a great option. Check it out and let us know what you think here: https://t.co/bkUISpR2wF @priyanshupree Great question, Priyanshu. We are unable to determine authenticity of products through photos or descriptions. To ensure you are receiving genuine Nike products, we always recommend shopping on https://t.co/Hppo1qOvjY, Nike stores, and authorized retailers. @EMaikisch We'll always reply. Stay tuned to https://t.co/yYv8xSbp4x for any potential restock updates. @KylaBones Let's have you check with that store or your nearest Nike location on possible return options. Here's a store locator to find your nearest Nike store: https://t.co/TILCziNVTr @JCoileUGA18 Hey Jared, no current plans to restock that style. Your best bet would be to check in with authorized retailers in your area and online for any possible availability. @rdkriplani No word at this time. Let us know if you have any other questions. @KylaBones That's not what we like to see, Kyla. Can you tell us where and when you purchased the item? @AmiFromIndia We proactively approach athletes we wish to become an ambassador of our brand and do not accept unsolicited requests. We'll be in touch if we see a good fit. @rdkriplani Great question, Rohit. That is the Nike VaporMax 1 which is no longer available. You can find the latest version here: https://t.co/jSGkP3tBiE @effeerreaa Piacere di assisterti Francesca. Ti suggeriamo di tornare al negozio dove hai acquistato le scarpe, munita di prova d'acquisto e richiedere un' ispezione dell' articolo. @imfkgdone Great question. Can you tell us what type of shoes you're interested in? @braysalo Let's look into this. Please DM us your order number and/or the email address used on the order. https://t.co/klmMF0Q8Tn @Smuv_ Hey Chad, no list to share at this time. We recommend you hit up your local authorized retailers to ask about potential availability. @IzNEbodyLisenin Sorry to hear that. First, check back with the place of purchase for potential options. If they're unable to help, give our team a call at 800.806.6453 (4 am - 11 pm PT, 7 days a week) @sfiorini Wake up hungry, every day. @zoranmaletic Sorry to see that. We'd suggest checking with the original place of purchase for options. If they're unable to help, let us know. @fb_mza Hola Franco, Nike ya no ofrece servicio a antiguos dispositivos y apps entre ellos la FuelBand y por eso ya no la reconoce. Ahora Nike ofrece las apps NRC y NTC para que puedas registrar tu actividad. Aquí dejamos un enlace con toda la información: https://t.co/0j1184rofO https://t.co/klmMF0Q8Tn @JetFlyy4 We're here to assist. Currently no news on a re-stock. We recommend you keep an eye on https://t.co/tCMQ8W1hw2 for any future updates. https://t.co/wB5A5pPNUV @akkenaar Welkom bij de Nike familie. https://t.co/2g6jBH0Gwv @joshuaokee18 Great question, Josh. You can find the all white Air Force 1 here: https://t.co/NUqqpVxlOf @GABITACARRERA We have a few different contact numbers available. We recommend heading over to our contact page to find the number that best fits your needs. | https://t.co/OC4nGDqPBa @Tshawisi_Da_Reb We'll pass your suggestion along to our team. You can find other Nike stores in South Africa here: https://t.co/StP4dFEXmB @Bllanca Please check with the original retailer for possible options. If they're unable to help, visit here: https://t.co/XliQQTlqa1 @RomeyRome1978 No events planned in Vegas at this time. Keep it locked to the Nike App for potential updates. @iamchristyjane Here to lend a hand. We don't like to see this sort of thing. Let's explore some options. Can you let us know when and where you purchased your trainers? If purchased via https://t.co/o8WEV1FOgI can you send us a DM with you Nike Plus email or order number. @eyepumpiron We're here for you. No date/time to share on a release of that style at the moment. Keep an eye on our SNKRS app for any updates. https://t.co/dNlBEe7ZfT @Bryonebang We don't like to see this sort of thing. To assist you with this can you let us know when and where you purchased these trainers? If purchased via https://t.co/am0OIjFU8c shoot us a DM with you NikePlus email or order number. @coachbc3 Thanks for reaching out. To assist you further with this can you elaborate on your experience and let us know at what stage of your journey you are experiencing issues? Also, if you are receiving any error messages please send us over a screen shot. @Bllanca Help has arrived. Let's look at some options to assist you. Can you let us know when and where you purchased these trainers? If purchased via https://t.co/PP2Maj9qV2 can you send us a DM with your NikePlus email or order number? @RawatMo Hey, Mohammed. This isn't something we like to see. To assist you further can let us where and when your purchased these trainers. If purchased via https://t.co/xGjvLO6JB2 can you shoot us a DM with your NikePlus email or order number? @The300sBoston You might want to keep an eye on this page: https://t.co/HJc5VBFSpb Nerve Beats Nasty. Congratulations @F_Molinari on winning the Open Championship at Carnoustie Golf Links. #TheOpen #nike @AlexMcCabe38 We'll just leave this here: https://t.co/tKeAvwFHVu @AlexMcCabe38 We can, but can your feet? @_Just_Katherine Check this out, @nikesoccer. 👀 @MareBer Great question, Mary. Those are the Nike Golf Tour Premiere PE (AO2241-003) released in limited quantities on 7.19. Read more about them here: https://t.co/LqGDv75r7e @tim_reading Hey, Tim. Let's take a look into this for you, can you send us a DM with your NikePlus email? @JoseThobs Thanks for your interest in Nike. We proactively seek athletes to endorse our brand and don't accept unsolicited sponsorship requests. @firehawk_tv Hey Cooney - you can mail your shoes directly to Nike's recycling facility:\nNike Grind Processing, U.S. Facility\n3552 Avenue of Commerce\nMemphis, TN 38125 @bjhenderson10 Brooks is looking pretty fly. 😎 @CoolTamato Sorry to hear that happened. Have you tried checking back with the place of purchase yet? @BeniganFlow Thanks for connecting with us. There is currently no news on this. We recommend you check out our other colorways in this style here. https://t.co/YkPQGxVFGw @Da_Warden305 You can find similar colorways at Nike authorized retailers. We recommend reaching out to stores in your area or online for cleat availability. @JJ0han7 Check the Nike Jersey Shop for more information about the 2018 FFF Stadium Home kit with 2 stars. | https://t.co/rKS2HiVIQs @cheezeburger15 We've got you covered, Amer. Check out all the slides on our site here: https://t.co/YBychSOaZN @thesmoothkdr You can recycle your shoes through the Reuse-A-Shoe program at most US Nike and Converse Factory stores. Please check with the location prior to taking your shoes in. You can use the store locator to track down the closest Nike Factory store to you here: https://t.co/kfOX06LMOG? @r_2the_o_b No word on that at this moment in time. Let us know if we can assist you with anything else. @r_2the_o_b They will be similar in terms of brightness, but the solar red is going to be more red-pink while infrared is more red-orange. @jmbartus That style isn't currently available on our site, Julie. We'd recommend checking with Nike authorized retailers in your area or online for possible availability. @Brooklyn2099 Hey Brooklyn, no plans to offer that size as of today. Keep it locked to https://t.co/yYv8xSbp4x for possible future updates. @Daniellezed No word on a restock, at this time. Stay tuned to https://t.co/yYv8xSbp4x for any possible updates. @JeffChangx That appears to be a custom-model, and not a colorway released by us. @rgomezgiraldo Hola Ricardo, Muchas gracias por el mensaje.\nHemos activado la opción para que nos puedas responder en mensaje privado. Prueba a ver ahora. Mil gracias y un saludo https://t.co/klmMF0Q8Tn @aplabnik Hola Ariel, sentimos que no te guste la app. De todas formas, si tuvieras alguna consulta o duda con la que te podamos ayudar, puedes contactar de nuevo con nosostros, que será un placer. Saludos https://t.co/klmMF0Q8Tn @PaulTReynolds Let's get you back on offense. We recommend you check out these styles here and let us know what you think. https://t.co/KE4s9nB3NT and  https://t.co/tOihKhUZQa @rgomezgiraldo Hola Ricardo, un placer ayudarte. ¿Podrías enviarnos un MD (mensaje directo) indicando tu NikePlus email, app y versión que tienes y teléfono que tienes y versión de OS (sistema operativo)?. Vamos a comprobar todo. Quedamos a la espera y te mandamos un gran saludo. https://t.co/klmMF0Q8Tn @Daniellezed Nothing to share about a restock at the moment. Keep an eye on https://t.co/UimVvHAjvY in your region for any possible updates. @PaulTReynolds That looks like an older version of the Nike Tailwind Sleeveless Running Top. We'd recommend reaching out to Nike authorized retailers in your area or online for possible availability. @IroseSocial We're unable to provide internal email addresses on this channel. That said, if you elaborate on your inquiry, we may be able to assist further. @dotmegs It appears that style is no longer available for purchase on https://t.co/yYv8xSbp4x. We recommend reaching out to Nike authorized retailers in your area or online for possible availability. @NuclearNerdFR Keep an eye on https://t.co/yYv8xSbp4x in your region for all release information. @NickCho Sorry to see that. We'd first suggest checking with the original place of purchase. If they're unable to assist, go ahead and give our team a call at 1-800-806-6453 (4 am - 11 pm PT). @jebbrilliant We like to think of @nike as our big brother. It's a family thing. @SweetlyShan Sorry to hear that. We'd first suggest checking with the original place of purchase. If they're unable to assist, go ahead and give our team a call at 1-800-806-6453 (4 am - 11 pm PT). @reiskandar Great question. There is currently no news on this. we recommend you stay tuned to https://t.co/FL4hsfqNbO for any updates. https://t.co/b5MyUzERAg @JayLo801 We'll get you back on your feet. This is not something that we like to hear.  To assist you with this can you shoot us a DM with your Nike Plus email? https://t.co/klmMF0Q8Tn @brownerandio Let's get you off the bench. This particular style is called the Nike Sportswear Crew and can be found here. https://t.co/a1y343stJk @LaFrenchPlug Thanks for reaching out. There is currently no news on this. We recommend visiting https://t.co/89qbZmGfje and signing up to be notified of any updates. https://t.co/SO9dt8VIOS @CoachsWifeASU We're here and ready to help. Check out our college football apparel here and let us know what you think. https://t.co/uNm2nEgWFM @EnzoGFS That style isn't currently available at https://t.co/yYv8xSbp4x. We'd suggest checking with your nearest authorized retailer for potential options. @Skye1991 Keep it locked to https://t.co/t6cX8UOtqk for updates on the new kit. @Jojo09159176 We can help you with that. This is currently not available via https://t.co/IHlt2pQ5ol. However, check out our Jersey Shop to be the first to be notified of any updates. https://t.co/OkSdfrusQw @mjshaw85 We're here to assist. There is currently no news on when this particular style is dropping. We recommend you keep an eye on https://t.co/XnYqJ0ZWMp for any future updates. https://t.co/TkvV1obNhT @TheRyanNeal Let's get you back on offense. Check out our other colorways of the Nike Air Zoom Pegasus 35 and let us know what you think. https://t.co/tFJECCBQgc @HlongoaneLeslie We're here to assist. Currently no news on this. We recommend you stay tuned to https://t.co/egNK119XJ2 for any updates. https://t.co/ijmg59kYaR @Lulu_pix We're here to help. There is currently no news on this. However, you can click here to be the first informed of any updates https://t.co/rvR3JTCXY4 @attitudesivan No word on that as of now. We suggest reaching out to that store directly for all information. | +44 2076120800. @MaksTLG We recommend reaching out to our Nike Paris location at +33 1 42259380 (Sun – Fri 10:00AM – 9:00PM, Sat 10:00AM – 10:00PM) and keeping it locked here: https://t.co/w7CJCk412q A Star is born. @KMbappe #JustDoIt https://t.co/cn8eqmUuuq @iamdzodze Hey @NikeRunning, have you seen this? 👀 @michclev101 Thanks for connecting with us, Michelle. That style is unfortunately an older one, which is no longer available. No love lost.\n\nThe greatest athlete ever is the mother of all inspiration. #justdoit https://t.co/BUspq4xlxF @paegpaeg It's hard to tell, however, it looks similar to the Alpha. Check it out here: https://t.co/wMR6MWvkEx @LCaCera_PR Great question. Those were released at other authorized retailers. They're currently unavailable on our site, but we recommend reaching out to authorized retailers with the style number AA6647-100 for any potential availability. @WakaSoftball We proactively seek athletes to endorse our brand and don't accept unsolicited sponsorship requests. @iamthepan13 Double trouble. 🔥 @tommorton Friday the 13th? Never heard of it. 🔥🙌🍀 @RiledUpYinzer Great question, Riles. The 856 is the area code where Mike is from. @Ryukpizza Go ahead and pass us a DM with your questions, and we'll do our best to assist. https://t.co/klmMF0Q8Tn @eddy_mahlathi We proactively approach athletes we wish to endorse our brand and don't accept unsolicited sponsorship requests. @GregEvansg2 No word on if or when those styles will restock. Keep it locked on https://t.co/yYv8xSbp4x for updates. @Ryukpizza They will be releasing 10:00 a.m. EDT via SNKRS. @theironfight No word on if or when that style will be restocked. Stay tuned to the Nike Football Kit Shop for availability. | https://t.co/jaYfi5ncVR @MeichenD Both the Stadium Home and Away jerseys for Croatia are sold out at this time. Keep it locked here for updates: https://t.co/grQibJr3iE Unstoppable belief. #justdoit https://t.co/9Axn3glvwz @JenniferADavco Yes we do, Jennifer. Bring up to 10 pairs of shoes to any Reuse-A-Shoe collection location, which can be found at most Nike and Converse factory stores as well as some global Nike locations. Find a local store here: https://t.co/sxR9LjSX47. @fangirl_steph98 Scuffs tell the story of your game. How will the next story begin? | https://t.co/7xiu0wwwGW. @MrAjrouche90 Hey, Marc great question. Currently no news on a re-stock. We recommend you stay tuned to the Jersey Shop for any updates. https://t.co/CtQiYf8U5U @Z_and_Co We're here for you. The is no current news on a re-stock for this. We recommend checking with nearby authorised retailers and keeping an eye on our website. @chadm Yup. \nTissue paper, shoe trees, and sneakers sold separately.\nhttps://t.co/dSo7qQQjJP @DABA5393 Celebrate the journey, not just the destination. @coco_pewu No plans to restock that style. We suggest checking in with authorized retailers in your area and online for any potential availability. @ThatDJStik We have some styles coming soon. Check them out here: https://t.co/5tOw6QsmMA @leshill28 Hey Les, nothing to share about a restock at this time. Keep your eye on https://t.co/yYv8xSbp4x in your region for any potential updates. @gynginanjar Let's get you past this wall. This particular style is the Nike Air max 270. Check it out here on https://t.co/hRbPLJfSdE and let us know what you think. https://t.co/COy5YluTP9 @montaneus_ Mind if we take this one? We don't like to see this. In order to assist you further can you let us know when and where you purchased your trainers? If they were purchased on https://t.co/uuIGyr1z5q could you please send us a DM with your Nike Plus email or Order number? @LucyOUFC Thanks for reaching out. Currently no news on a re-stock. Keep your eyes on the Jersey Shop for any future updates. https://t.co/2knGM4x18j @WyattBurpp A great mid-stability option will be the Nike Odyssey React, which features Nike React technology for a smooth and comfortable ride. https://t.co/tpZd0ZbypR @bryzeeee1 Happy to help. Let us know if we can assist with anything else. @ohheywheresshae Mind if we take this one? How are we able to assist you? @bryzeeee1 Great question, Brian. That is the NikeCourt Tech 2.0 Tennis Duffel Bag. It's currently unavailable on https://t.co/yYv8xSbp4x, however, we recommend reaching out to your nearest Nike store or authorized retailer with style number BA5171-010 for any potential availability. @ASpossey Ready to run as one. @_abrowngirl Check out our shoe cleaning tips here. | https://t.co/wKyJ1uUGaA @brunodamasco Nike doesn't offer campus tours to the general public. @marcuscorporal We don't offer a men's option with a similar print. You can find our selection of men's tights here: https://t.co/Gy7Wg9i3n6 @mrmarkevans Thanks for reaching out, Mark. Unfortunately, we're unable to authenticate items via social media. We always recommend purchasing from https://t.co/uRwy0KsNkU, Nike stores, and authorized retailers to ensure you are receiving genuine Nike products. @DiarmuidDineen Help has arrived. This style is the AirMax 1 Ultra Moire and was last released Summer 2016. This style is currently not available on https://t.co/6rT45qFzic, however we recommend you check with local authorised retailers. @coachk11233 We appreciate your feedback and will be sure to pass this onto the relevant department. @limmjunji Check out some alternatives here and let us know what you think https://t.co/kib8XjlE4H @limmjunji Help has arrived. This style is the Nike Court Advantage Tennins Polo and was last released on the holiday season 2017. This particular style is currently not available via https://t.co/XB4Qg73G5o. Might be worth checking with local authorised Nike retailers. (1/2) @VaSabela We aren't able to provide internal contact information. That said, you can call Nike South Africa's general phone line for further assistance. | Tel: +27 (0) 11 256-0700 @pompomspretty Finding your fast. https://t.co/59WAeh5rxT @putinsrealbff Thanks for reaching out. We appreciate your interest in the company, however, we proactively seek athletes to endorse our brand and don't accept unsolicited sponsorship requests. We wish you the best of luck in your future endeavors. @rigoretana No word on if that colorway will be making it's way back to our site. Keep an eye out here for further updates: https://t.co/zevBFXo4xj @bpeters83 We see you swinging into action. https://t.co/s2ieRvGT9o @TheMikaelT Look good, perform great. @Lucliamat That's how it's supposed to be done 💪 @DRaskal Great question. The Nike Air Max 1 LX was launched in women sizing only and there are no current plans to release them in men sizing. Keep an eye on our SNEAKRS app for new releases https://t.co/xijtGM7P2u @Nakanari Nothing to share about that event at this time. Keep an eye on our feeds and https://t.co/voinoXkbmA for any potential updates. @GunzillaTheDon  https://t.co/T8si5KjuTu @tristenb_7 Sorry to hear that. Can you send us a DM with your order number and place of purchase? @manokreationz Update: we have three colorways of the M2K Tekno on our site in women's sizes up to 12. This equates to a men's 10.5: https://t.co/vffZdEky0s @ChrisKnierim @nikestore @nikesportswear @USOlympic Hey Chris. We've passed your message along to the appropriate team to see what we can do. In the meantime, we appreciate your patience. @LizeeAngel We've got your back. Great to see you getting back into the swing of things. How are you liking the Nike Studio Wraps? https://t.co/MEBT06GvFk @on_my_chinstrap They might be retired, but the miles are never forgotten. Suit up with some new kicks. | https://t.co/9momR5Np8r @_DrFunk Thanks for hitting us up. That top is currently unavailable for purchase. Keep your eye on https://t.co/XHM9GCaS8p for any updates, and let us know if we can help with anything else. @Paige0828 Hi Paige. That shoe is not available on https://t.co/FfEbtIpM92, however, we do recommend the Free x Metcon. It is a great training shoe that allows for great flexibility and durability, and can be found here: https://t.co/7KxtTfXQpH. @daveynolan Got it. Let's have you reach out to the original place of purchase for all return/exchange options as your first step. If they are unable to help, give our team a call, and we'll do our best to assist you further. | +44 (0) 2076604453 (Mon - Fri: 8am - 8pm, Sat: 8am - 5pm). @DanielInman3 We drop fire every day. Check out our latest releases to see if you can handle the heat. | https://t.co/ZYLj8HAfzq @daveynolan Hey David, that's not something we want to see. Could you let us know when and where you purchased the shoes from, so that we can look into some options for you? @GirlsVsSuits No word at the moment, Cody. Stay tuned to our feed for updates. @IAJmusic No news to share on that style at this time. Keep it locked to https://t.co/yYv8xSbp4x and our feed for udpates. @RebelToUhmerica There is no plan to restock at this time. We recommend checking with local authorized retailers for potential availability and staying locked to https://t.co/ZGHF2A0DfY for updates. @silvia_aristeo You can find the white Nike Epic React Flyknit here: https://t.co/2RF8Gfg9PM @dwwmc Since that retailer won't take back the shoes, you can file a claim on any pair that was manufactured within the last two years. You will send in the shoes to get inspected for manufacturing flaws. You can start the process here: https://t.co/lJNKzWhDBu @ThePinkPrintEra We've got you covered. Those are the Kyrie 4, which are available here: https://t.co/xshUabXDTk @dwwmc Hi David, we're sorry to hear about your experience. We will make sure to pass you feedback along to the appropriate team within Nike. Are you interested in return/exchange options? Let us know when and where you originally purchased your Monarchs, and we'll do our best to help. @JayFlaco23 That specific kit is not currently available on https://t.co/yYv8xSbp4x in your area. We recommend checking out authorized retailers for potential availability. @Ngba_eze We love the passion, Candace. No restock news is available at this time. Keep an eye on https://t.co/yYv8xSbp4x and the Nike Bootroom for the latest. @tesska_77 Hallo Katrin, sende uns bitte eine private Nachricht mit deiner Mailadresse. https://t.co/klmMF0Q8Tn @rsw4224 We'll have an update for you closer to the end of summer. Keep it locked to our feed and https://t.co/yYv8xSbp4x for the latest till then. @GraysenMorgen Glad to hear it. Be sure to keep us updated as you rack up the miles. @GraysenMorgen The gift of endless potential. How'd they feel? @JayyAknell_ Unfortunately, we have no info on a possible restock at this time. Let us know if we can assist with anything else. @tksmith23 No word on that at the moment, Tasia. We recommend checking with another authorized Nike retailer for availability. Let us know if we can assist with anything else. @sam_fantastic Great to see you settling in those LunarGlides and racking up that mileage. Will we see you again tomorrow? @nickiebev1 You're able to see the other options here: https://t.co/DlGQUVLBfU https://t.co/psYqV2X8xh https://t.co/5SLgXcw3OP @nickiebev1 We hear you and appreciate your feedback, Nickie. We've had a look and found a few of options which offer either a looser fit for comfort while in movement or compressed feel with extra coverage. Check'em out here and let us know what you think. | https://t.co/5X3OmYH2So. (1/2) @Heard80 The Nigeria Team Collection is currently sold out. Stay tuned to https://t.co/yYv8xSbp4x in your region for any potential updates. @TheReal7thLtr Nothing to share about any promo codes for sale items at the moment. Keep an eye on https://t.co/unxewiflKc for any future updates. @Tonytornado24 Time to lace them up and show others how you 'treat yo self'.😎 @JordynHuitema When defenders realize that can't keep up...😉 https://t.co/EqR6FYnce3 @CarrieTrownson A good win and a great run makes for the best day. @Max62958871 Hey Max, thanks for reaching out. To see all of our Internship opportunities, check out our Jobs page here: https://t.co/FuJlO1M19C @AEinwechter No word on are stock at this time, Adam. We recommend staying tuned to https://t.co/K5u5tt3bod for updates and checking with local authorized retailers for availability. @Sweet_N__Lo No word on a restock at this time. Keep an eye out here for any updates: https://t.co/7qM6U77cnQ @yourrealhyna That is not an authorized Nike account. Let us know if you have any other questions. @naijaz_finest Hi there, no current plans to restock the Nigeria kits at the moment. Stay tuned to https://t.co/yYv8xSbp4x in your region for any potential updates. @ParkerMolloy The pack is back, Parker. Check out what's available here: https://t.co/MJft92dxFR @_gettingblessed We recommend checking with local authorized retailers. @DookieOnDrumz Good news. They're back, just in time for summer: https://t.co/0nY6Pc73Sg @canga8876 Thank you for your interest in Nike. We proactively approach athletes we wish to be a brand ambassador, and don't accept direct applications and/or requests. Let us know if we can help answer any additional questions. @MademoiselleT No restock news to share at this time. Keep an eye on our feed and https://t.co/yYv8xSbp4x for updates. @youfeenmylife Now's your chance: https://t.co/KAxabXszr1 @fannypackdude You may want to slide over here, Aiden: https://t.co/4Rq6z4B13z @Afrique_SoChic The Nigeria Team Collection is currently unavailable. We recommend keeping an eye on https://t.co/yYv8xSbp4x for any potential updates in availability. @KrisOrton38 The social media accounts that have recently appeared online aimed at recruiting ambassadors are fake accounts with no connection to Nike. Official Nike handles can be identified by Instagram’s verified seal. @norwegianbrooke We just give you the tools. You're hard work makes it easy. Keep it up. @Syon_Foppen The social media accounts that have recently appeared online aimed at recruiting ambassadors are fake accounts with no connection to Nike. Official Nike handles can be identified by Instagram’s verified seal. @GrantWP The social media accounts that have recently appeared online aimed at recruiting ambassadors are fake accounts with no connection to Nike. Official Nike handles can be identified by Instagram’s verified seal. @faitheliztho The social media accounts that have recently appeared online aimed at recruiting ambassadors are fake accounts with no connection to Nike. Official Nike handles can be identified by Instagram’s verified seal. @Twils84 The social media accounts that have recently appeared online aimed at recruiting ambassadors are fake accounts with no connection to Nike. Official Nike handles can be identified by Instagram’s verified seal. @manosfer That account is not associated with Nike. Let us know if we can help with anything else. @Marcela98780602 Hola Marcela, encantados de ayudarte. Muchas gracias por el correo electrónioc. Marcela, ¿podrías enviarte un MD (mensaje directo) indicando tu fecha de nacimiento?. ¿Tienes algún otro correo electrónico que hayas podido utilizar en Nike?. Te esperamos. Un saludo https://t.co/klmMF0Q8Tn @DMOWENS22 Unfortunately, we have no info on that at the moment, Dylan. We recommend keeping an eye on this page here for updates: https://t.co/BcdJhXsIy7. @Comfortyourlife Those accounts are not associated with Nike. Reach out if we can answer any additional questions. @SINcereOfMidMob That is not an authorized Nike account, and we don't recommend providing personal info. Let us know if we can answer any additional questions. @Jitsero_ That account is not associated with Nike. Let us know if we can help with anything else. @Lito_Holmes Good question. That is not an authorized Nike account. Reach out if we can further assist. @BeLikeBRRG Thanks for hitting us up. That is not an authorized Nike account, and we don't recommend providing personal info. @EBONIVORIxJOIE That is not an authorized Nike account, and we don't recommend providing them with personal info. Let us know if we can help with anything else. @momslrb Hey Katie, that account is not affiliated with Nike, and we don't recommend providing them with personal info. Let us know if we can help with anything else. @chellgranoski Thanks for hitting us up. That is not an authorized Nike account, and we don't recommend providing personal info. @1natVson1 That is not an authorized Nike account, and we don't recommend providing personal info. Let us know if we can help with anything else. @dailybeto That is not an authorized Nike account. Let us know if we can help with anything else. @uisce05 Hi Darren, thanks for reaching out. Looks like we don't have any Men's Cortez available in Pink via https://t.co/4yAoGzpKU2. We recommend checking in with authorised retailers for any potential availability, and check out available colorways here: https://t.co/3KLlE01St4 @nicthepainter Your future is looking bright. 😎 @_Mr_BenJamin_ No it is not. We do not recommend providing any personal information to this page. @jenannrodrigues Good question, Jen. That is not an authorized Nike account. Let us know if we can help with anything else. @QualityBat Thanks for hitting us up. That account is not affiliated with Nike, and we don't recommend providing them with personal info. Let us know if we can help with anything else. @meeshsparks We are not affiliated with that page and do not recommend providing them with any personal information. @maryjmco This is not real. We do not recommend providing them with any personal information. @Lingking27 That is not an authorized Nike account. Let us know if you have any other questions. @Lilyspace This is fake and we do not recommend providing them with any personal information. @Lucliamat Always on point. 📍 @jihazedge We appreciate the question. That is not an official Nike account. @simplysope No word at this time. We recommend staying tuned to https://t.co/yYv8xSbp4x for any further updates. @aestewart0084 Thanks for connecting with us, Jay. That is not an official Nike account. @Sithandiiwe This is not an official Nike account. @Finding_Forever Hey Anthony, no plan on a restock at this time. With that said, stay tuned to https://t.co/T6uYsFZo9t for updates. @JacobAMeza Hi Jacob, that is not an official Nike account. @jason_jpg Hey Jason, that is not an official Nike account. @RickyDeSousa2 Hey Ricky. That is not an official Nike account. @LandriaultJosee We aren't surprised it's warm when you're bringing the heat like this. @urban_suburb Hi Claire, thanks for reaching out. No plans currently to release that kit. Keep an eye out here for any potential updates: https://t.co/K3s29qmiw5 @lameberIy No current plans to release that style. Keep it locked to our feeds and https://t.co/yYv8xSbp4x for any potential updates. @kinleygene Closing out the week strong. How's the training going? @UncleJesse77 The grills aren't the only thing heating up this weekend. @Richardpacer The Nigeria kit is currently sold out. Keep an eye on https://t.co/yYv8xSbp4x in your region for any updates. @Moremi_Mowela The Nigeria Team Collection is currently sold out. Stay tuned to https://t.co/yYv8xSbp4x in your region for any updates. @Ziahzayah The Nigeria Team Collection is currently sold out on our site. Stay tuned to https://t.co/yYv8xSbp4x in your region for any updates. @mannymaxwelljr No plans to restock the Nigeria kit in that store. We recommend keeping in contact with your local store for any updates. @itskimgeee You're ready to start the summer training in style. 😎 @dammiedavinci Nigeria soccer items are available now, check them out here: https://t.co/LzIeJqSygJ @Xoxjlove No word at this time on a restock. Be sure to stay tuned to https://t.co/6e4NFATyrI for potential updates. @OgYoungsteino No word at this time. We recommend keeping an eye on https://t.co/yYv8xSbp4x for any potential updates. @Jgx94 No word on a restock, at this time. Stay tuned to https://t.co/1liP22nNbA for any updates. @MarDa23 Hallo, würdest du uns bitte eine private Nachricht senden, sodass wir dir bestmöglich weiterhelfen können. https://t.co/klmMF0Q8Tn @JohnBortz6 Those shorts should fit true-to-size, but that is dependent on the wearer. We suggest heading back to that retailer to discuss a exchange for a size up. @izzycarrebrown We appreciate the feedback, Isabella. We've gone ahead and passed along your comments to our team, please let us know if we can further assist. @JohnBortz6 Hey John, do you have a link or a style code for the product in question? We'd be happy to clarify how the style is designed to fit. Additionally, if the shorts were purchased from https://t.co/yYv8xSbp4x, you can trial run the product for up to 30 days and still return it. @NikeBoyNStripes Thanks for hitting us up. The React Element 87 is scheduled to release July 13 at 10am ET. Let us know if we can help with anything else. @KAMONIHASISSUES @sigmastrange Easy 💪. Can you top that today? @FayeSemou Thanks for reaching out. Since online ordering is unavailable via https://t.co/3FH3knFfT1 in your region, we suggest checking in with authorized retailers in your area and online for current available Nike products. @thelochneff Can you elaborate on what you're looking for on https://t.co/kTBfdfGP7p? @wayiseethingss We have no plan to restock that shoe right now. We have limited sizes available you can find here: https://t.co/pTiOtZQTk6 @wallnerr Hey Joe, no word on a restock right now. We recommend staying tuned to https://t.co/tQcS0NzSUI for updates. @troythibodeaux Hey Troy, thanks for connecting with us. As of April 30th, all Nike+ Connect software has been retired, which includes viewing your Activity on https://t.co/m10MZQLyGc. You can still view your run history on the NRC app. For more info, check out this link: https://t.co/bCvPMTIum4 @TweetMeLizzy Hi Elizabeth, check out our available internships here: https://t.co/jnp9lBtBaz @ranya_shar5 Thanks for your patience, Ranya. We do not have a timetable to share at this time and recommend staying tuned to your inbox for the latest. @kkassem2 1's lined up and ready to take flight. Clear the runway for that 🔥. @thelochneff Hi there. Could you confirm which product your referring to? https://t.co/klmMF0Q8Tn @pippamelody This is only the beginning. Stay consistent with our training plans here. | https://t.co/gK1awNoxFE @Ngba_eze No word on when we will re-release that kit. Stay tuned to our site for any updates. | https://t.co/HKtH4vDBtD @m_ddot Thanks for reaching out. Due to other commitments and programs, Nike is not accepting outside donation requests, but we do thank you for your interest in our brand. You can learn more about Nike’s community investments here: https://t.co/njGH30nWnn @rickygeorgerix No word on a short sleeve goalkeeper shirt being available. You can get the long sleeve version right now: https://t.co/0gbXMB5Uwu @belgianadian Hey Daniel, that's not an option at this time. We've gone ahead and passed along your comments as feedback to the appropriate team. Let us know if we can help answer any additional questions. @rootout Hey Radix, we recommend checking out the Lunar Prime Iron II. It has a similar Lunarlon foam midsole for a soft, yet stable platform in the gym. You can check it out below. https://t.co/h1sbditbPV @jchcrz Hey Jed. We recommend cleaning that specific style by following these steps: use a soft cloth with mild soap and warm water &gt; gently scrub the uppers &gt; air dry. Let us know if you have any other questions. @T187BANGBANG Get out there and go. https://t.co/vYdpI2KZG3 @amndka Hey Amanda, no word at this time. We recommend staying tuned to https://t.co/yYv8xSbp4x for updates. @BadGalAlPal Sorry to hear that, Alexandra. Unfortunately, we have no info on that at the moment. We'll pass on your feedback to the right teams. @steuck_ Crisp, clean and ready to hit the streets. @sergios18576996 Great question, Sergio. The Odyssey React is indeed a neutral running shoe. They feature our React foam that delivers a responsive, cushioned ride while providing the support you need in the right places. Check them out here: https://t.co/xQOjHQPgmF @MrsDmomofthree Run and ride together, grow in strides together. Again. And again. And again. And again. And again. And again. And again. And again. And again. And again.\n⠀\nA historic 11 majors on clay, and counting. @RafaelNadal #nike #justdoit https://t.co/EgdPZ5k1kD @KCTICKETGUY From one legacy to the next. 🏆 @bulbelliott Hey Allan, no word on if/when we will be restocking that style. We'd suggest checking in with authorized retailers in your area and online for any potential availability. Keep an eye out here for any updates: https://t.co/HKlfyRzJy9 @FleurShomo Here to help, Fleur. Customization for the England kit is not available in the US. You are able to purchase the England shirt without customization in your region here: https://t.co/JEDI9mYCvf @alejon01 No current plans to release any new KD styles. Keep it locked to https://t.co/yYv8xSbp4x for any potential updates. @LockGertie Great question, Gertie. We can recommend the Free RN 2018. Made for short runs, the innovative sole has an updated design, yet still delivers a comfortable, barefoot-like feel. Check out more information here: https://t.co/wTzainR1No @ZamiWhammy That's not what we like to hear. Please give us a call, and we'll do our best to assist you further. | 800-395-180 (9:00 - 21:00 CLT, 7 days a week). @kmblois No word on a restock at the moment, Kelsey. Keep an eye out here for any updates: https://t.co/f6zqnpinV3 Self belief makes believers. \n\n@Simona_Halep fearlessly captures her first major title on the clay in Paris. #nike #justdoit https://t.co/aTew6s4CQ6 A champion never settles for one.\n\n@KDTrey5 #JustDoIt #NBAFinals https://t.co/8PXOHhCvwq @Ugly_Boy_Swag18 You tweet, we answer. New releases are here: https://t.co/DMDBzZl6KJ. If nothing catches your eye, give us some info about your sister and we'll cook something up. @10KSarah You're ready to start the next chapter in style. @Tanner_Leggett The swoosh on those wristbands are white. @ruthfavoreel We see a bright future ahead of you. 😎 @ranya_shar5 Hey Ranya, we recommend keeping your eyes on your email inbox for an update regarding your application. @ReignOfAnnie21 Hey Annie, that's not on the radar in the near future, but we recommend keeping an eye on https://t.co/yYv8xSbp4x for updates. Additionally, we have passed along your comments to the appropriate team. @Tanner_Leggett Hey Tanner, can you provide us with a link to the product in question? Anth is typically short for Anthracite which is a dark grey, but we would like to double check to be safe. @BlackDorianGray We're not currently offering a customization option for that kit via https://t.co/yYv8xSbp4x and recommend checking out authorized retailers for potential options. @joelle_ferguson So we should not tell you a new colorway arrived just in time for summer: https://t.co/BY9yw1RW0A @mbutala We've got you covered. Check out the latest footwear here: https://t.co/7uG3e1nWbj @RobHeilbron That's not what we like to hear, Rob. Mind letting us know when and where you purchased them from? @Allipooch9876 Thanks for reaching out, Allison. We appreciate your interest in the brand, however, at this time we proactively seek athletes to endorse our brand and don't accept unsolicited sponsorship requests. Best of luck in your future endeavors. @joanne1986swfc You see this, @nikefootball? @Sephene That's the Nike Women's Tyan. Let us know if you have any further questions."}