{"tweets": "RT @Talking_Thrones: https://t.co/UPURKBLjj0 Excited my plans were cancelled so I can sit at home and listen to @bruceprichard  and @HeyHeyItsConrad podcast. #youknow #shepooted Do you wear makeup? Join me at @ipsy\n  https://t.co/GBa5paywoL There's no waitlist to get your Glam Bag for a limited time. Get in on it now:\n  https://t.co/WJiI6Lb1te Tried to get myself something signed by @kennyhotz on ebay for my birthday and there is nothing on there. Stop hoarding the goods people. @DDPYoga is the Catalina Wine Mixer of yoga!!! Found out @TheRealXPac is on @steveaustinBSR podcast. It felt like Christmas morning. Swig of beer for me. @WWEDanielBryan you are my hometown hero and the nicest celebrity I have ever met in my life. Thanks for everything u have done in the ring. Re-listening to @TalkIsJericho interview with @Zak_Bagans. My two favorite things...wrestling and ghost hunting. See u in Seattle Jericho. Chilling with Lord Stanleys cup #tbirdsstanleycup https://t.co/jjIb4EBa1d Conspiracy theories and @TalkIsJericho ...Thats the best start to the day. Might spend the rest of the day reading more conspiracies! OMG. WUT?! Only a few more hours to get your Glam Bag without the wait. Get in on it now: https://t.co/0LVzVEYkD8 Join me on @ipsy and get awesome Glam Bags for just $10/month: @ipsy https://t.co/JxbLyI2aDL Listening to fellow washingtonian @WWEDanielBryan  on @TalkIsJericho ...these two wrestlers make me proud to be a wrestling fan @GhostAdventures in Seattle...finally some Pacific Northwest Love. I dont know what u mean my computer screen is not work friendly? @kennyhotz is a work of art. http://t.co/iIxInwkjNu RT @DetroitRedWings: DATSYUK!!! 🚨🚨🚨 Mans best friend must love the paranormal! Reading @Zak_Bagans  book #IAmHaunted out loud to my dogs. http://t.co/TZKEKteHfd My chow Datsyuk watching the @DetroitRedWings  game in bed. Shoot outs make him very nervous. Go @Datsyuk13 http://t.co/BXxxskTZe4 Thanks to @TalkIsJericho I have decided to to be a hermit, ignore the nice weather and read @Zak_Bagans new book. Dont call me I am busy ( : single New York New York Sept. 1st Cant wait for tonight...I am dressed and ready! getting ready to make some cash money Waiting to see whats going on today. Maybe it will be as awesome as yesterday! I dont wanna do anything today! No cleaning, no going out, no nothing! I am pooped Its halloween, around 7:30 and I wanna go to bed...lame Spaghetti Night at the apartment, gunna watch a movie and have other...snacks! Yes Planning the \"Scooby doo\" Road trip! I am watching Corpse Bride...yep yep Back home *sigh* Leaving today....see ya Seattle...be back home soon! Resting up for tomorrow. Reading this weird ass book.in one part they write about how people think the middle of the earth is hollow and thats were Hitler escaped to cleaning time. You know how it is. Grrrrrrrr I hate being sick.....screw you cold! My myspace song explains whats up...haha word I really dont care for Mondays I think I am about to nap...dustin should be home soon ( : wow another night by myself I missed fall! about to turn up some music and clean. Paris needs to come home. I have to tell her stuff HAHAHA. Its nice being a girl sometimes All alone .... feels weird. again no plans for tomorrow sleep time. Not much going on tomorrow (Saturday) Going to doggy daycare today...wish I had something else going on but I dont I hope tonight goes well. Waking up...have no idea what I am going to do today...effing LAME I am listening to Chiodos....chillin and shit just heard the good news that my best friend may come out here next month...YAY about to pass the hell out Watching beerfest about to get some FOOOOD!"}